{"episode_id":"SW - #343 - 2024-06-08 - Skateboarding and the Divine Chariot","start":0.48,"end":1224.82,"speaker":"Jonathan Pageau","text":"Hello, everyone. So recently I posted a video of myself skateboarding. It's something that when I was young, I did quite a bit. And some of you probably know that my youngest brother was a professional skateboarder, retired now. Pretty amazing, you know, lived in California in the 90s. And so it's been part of our family since I was maybe 10 years old that I started skateboarding, and I hadn't done it in a very long time and then just started just a few days ago, I think I hadn't skated in like five years and so just been going through my midlife crisis and enjoying myself. But some people posted a question and said, you know, why don't you do the symbolism of skateboarding? And at first I thought, okay, that's kind of funny. But it's been a while since I've done a more pop culture or trying to show how symbolism can be applied to pretty much everything. And so I thought this could be a good way to talk about that and discuss even to what extent the symbolism of skateboarding has to do with the divine chariot that is seen by Ezekiel in his vision of the revelation of God. This is Jonathan Pedro. Welcome to the Symbolic World. So if you enjoy what we're doing here at the Symbolic World, please consider becoming a member. Just go to the symbolicworld.com there are ways to become members for free. You can join in the conversation in the community, but also paid members have access to discounts on courses, also a Q and A every month and an extra video a month as well. And so the symbolism of riding something like a skateboard, first of all, has to be put into the context in general of the symbolism of riding something. The symbolism of riding is very ancient, of course. You know, the taming of the horse, the use of mounts in order to increase one's power is a symbolism that has many, many applications. And the best way to understand it is really as an extension of your body. And so the first part, if you think of sitting on a horse and then controlling the horse, it's an image of controlling the animal part of you or the powerful part of you. And you become now the mind, and the horse becomes an extension or an image of your body. And so to the extent to which you're capable of controlling this beast under you, is an image of how you're able to control your body and everything that extends from your body. And so material potential. You know, that image now of a. Of a mount, of a horseman on his mount can become an image of, for example, a King and his kingdom, you know, a leader and his people. So this. This image can. The analogy for the image of someone who. Able to control something which is powerful and possibly dangerous, that can possibly be out of control, that it's taming it and restraining it and directing it towards the purpose of the writer is of course, the way to understand this. And the analogies of that, like I said, can be applied to all kinds of things where someone is restraining power towards a purpose. But of course, the image, if you think of a knight, you know, riding his horse, the horse warrior riding his horse, but also vanquishing his enemy, these two things go well together. The same for the king sitting on his horse as an image of him being above the others and kind of mounting and being in charge of his kingdom. All of this kind of comes together. Now there is, of course, an extension of that symbolism which also includes more aspects of civilization, which is the idea of technology, you could say, or of human activity. And that is, of course, the symbolism of the chariot and the symbols of the chariot is very important in the Bible, you know, this chariot is seen in some ways as related to the stranger. If you look in the book of Exodus, if you look in the book of Genesis, the idea of the iron chariot, for example, the Egyptians are represented as having chariots. And, you know, the Israelites don't have chariots. And so this idea of this empire, of this civilization, this technological bureaucratic society that has weapons made of iron, as you know, of course, the analogy goes to Bulkheim, to the development of civilization itself and the mastery of materiality. And you can see already, like the very mastery of materiality in terms of technology can be analogous to the idea of taming the horse and of riding the horse. But now if you put them together and you have a chariot, then you have all of this coming together, which is the horse is pulling the chariot. You have a chariot which is made of metal and is therefore an image of human techne and human civilization, human capacity. But then that chariot is also a weapon. And therefore all of the symbols align one with the other, because the weapon is there to master the enemy and to master the other and make them into potential for our. For our empire. Either potential as an extension of our empire or potential in the sense of, you know, getting money from them, getting riches, getting women, getting, you know, all the things that ancient armies used to get from their enemies when they would beat them. And so this is already, you can see how it kind of comes together. The symbolism is not that complicated to understand. Once you see it. But then when you come to, you know, modern. Modern versions of that, you know, there's a difference also, by the way, between the chariot that you sit on that has a certain image of power. But there's also. There's a difference between that and the chariot that you stand on. And so the chariot that you stand on is a chariot that is related to activity and is not just rule in the passive sense of the king kind of sitting. But when you stand on the chariot, it means you're in an active pose. And you're therefore mastering actively the materiality underneath you. But ultimately, the reason for it to be standing in a chariot is usually to fight. And so you're also mastering the enemy in that sense. Think of, for example, a good example is of course, the chariot race, which was very popular in Rome. And of course, as Roman gladiatorial combat ceased to be a thing in the Roman Empire, the Christian Roman Empire, the chariot racing became the main vehicle for sport, which is the main sport that people would watch would be chariot racing, because it had all of that symbolism, you know, included together, plus, of course, the spirit of competition, the race, and so all of this together, the man standing his chariot, you know, also going to vanquish his enemy, you know, master his. The potential and also dis and show his excellence. That's also part of it. And so mastering the potential is a way to show your excellence. This is, of course, what all sports are about. But, you know, this becomes clearly manifest in things like rodeo, for example, or, you know, the idea of taming wild horses. All this kind of imagery makes sense. And so before we actually go to skateboarding, this leads to the symbolism of the divine chariot. And so in the book of Ezekiel, Ezekiel sees this image of a chariot with four wheels that turn in every direction and four beasts that have four faces that are, you know, the manifestation of multiplicity. I don't want to go too much into the symbolism of the chariot itself, and it's multiple elements, but, you know, you can find other videos that I've talked about that. But you mostly need to understand the idea of the divine chariot itself, which is the chariot itself is in some ways God the man, which God reveals himself in the world. And the chariot becomes a vehicle for that manifestation. The chariot is also. Can go in every which way. It's mobile because, you know, it's variable depending on the circumstance. And so God descends onto the chariot, and then the chariot becomes an image of the entire cosmos, of the entire world. And that's Important to understand, because what Ezekiel ultimately sees when he looks up, he sees a dome. And he sees the Son of Man sitting on the dome, very much like you see in the. In the architecture of the Orthodox Church. He sees the Son of Man sitting on a throne at the top of the dome. And then under this are the four pillars that are also four, let's say, wheels of a chariot. And then you have this chariot kind of moving around. And that is, of course, an image of the man in which God masters the entire cosmos rules over. You know, the cosmos becomes a vehicle for his power. His footstool is another way to often represent it. You know, the thing that he dominates, not in a bad sense, but in the sense of mastering and manifesting his will through it. This is, of course, this is what this vision of the chariot is there to represent. But now it applies to the entire cosmos. So you can see how the image of. Of God descending onto the divine chariot and manifesting his will and power in. In the world can be taken all the way down to the image of someone riding a horse or someone riding a chariot into war, like you see in the scripture. But then you can apply it to all kinds of things. And so the idea, for example, of surfing, out of which skateboard comes from, is a pristine example of that. So you can understand how, you know, people tend to associate surfing with some kind of mystical experience because. And, you know, there's a kind of weird spirituality about surfers because of. I think that they're onto something. I don't think it's sufficient, obviously, but they're onto something. They can kind of glimpse through their activity and understand, you know, what it is that they're doing, which is very simply, they're standing on a flat board on top of chaos. And so think of the world as a disc in the old, ancient idea world as this thing. And then under the world are the waters, all the chaos, all the possibilities. And then man stands on, connects the meaning and purpose and reason and direction with the chaos below by being the connector of heaven and earth together. And so the surfer standing on his board on the water, and it's important that he stands too. And it's a little different than, for example, being in a boat, because when you stand, if you're standing on the board and you're using the wave underneath you, there's something a little more also of not just mastery, but also, how can I say this? Of really feeling the potential that is underneath you and in some ways using it in order not to drown. And to be able to surf the wave of chaos and use it to your advantage and to your purpose and to kind of also show your expertise, to show your. To show your capacity to manage it. It's closer to, for example, riding a bull, you know, riding a wild horse, for example. Surfing is in terms of what it is that you're accomplishing when you're doing it. It's closer to that type of symbolism. Now, once you're doing that, then, because part of it is basically showing your mastery, then you can understand why it doesn't take long for there to be something like tricks. Just like you have trick riding, for example, in rodeos, where the idea is to up your mastery and then also show up your mastery compared to the others. And so you start by riding the board on the wave, and then you start by moving. Then you start moving on the board. You start doing these things, and you do different tricks. And then ultimately, the ultimate trick is, of course, something like getting air, because then you're using the wave of chaos in order to go up into the heavens. And so there's something that is completely intuitive about seeing that because you think, you know, we're so used to seeing these images on skateboards or on surfs on surfboards of people kind of, you know, hitting the wave and then using the peak of chaos in order to ascend up into the heavens that we think. But when we see it, it's so satisfying. There's something about it when. Which feels so right, even though it's completely absurd. It's not practical. It doesn't have any purpose in the world. You know, it's a form of game. It's a form of play. But you can really see the symbolism of how it is that man connects with the chaos of the waters and what it is that man can do to use it in order to go up higher up into the heavens. Something like going up the mountain, for example, in spiritual symbolism. Now, of course, skateboarding, then, is a derivative of surfing and has the same. The basic same symbolism. But in skateboarding, there's a difference. That's why there's a punk aspect. Because in some ways, there's a symbolism in skateboarding which has to do with freeing ourselves from the constraints of civilization and so showing our mastery and our use of civilizational things, whether it's the city itself by riding through the city, whether it is, you know, these constructions that we have to build in order to master them. There's a weird aspect which is, on the one hand, to show our mastery of the, you know, of the civilizational apparatus, but then also demonstrate in some ways the capacity to be free from that. And so all of skateboarding has always had this kind of punk rock attitude also because it's often made illegal. And therefore there's an aspect of that which is also transgression, the capacity to transgress the use of these social constructions, right? And so you grind something that's made to just be a sidewalk, you. You jump up, you ollie onto things, you use the architecture in ways that aren't meant to and that are somewhat dangerous and also show a kind of separation between what you're doing and the normal use of this apparatus. But ultimately, as you master the board and you master the four wheels and this chariot, your chariot now is something that you master, and you're able to kind of master the architecture and the city that is around you, it is nonetheless participating in a very little way, in a very kind of imitative way, with the intuition we have about this symbolism of the chariot, especially the standing chariot, and the idea of showing mastery over the world in this. In this capacity. And so hopefully this is helpful for you to understand how it is that symbolism can be applied and how it is. You can see the analogies and understand that even though some versions of symbolism are quite reduced and are much smaller and are less encompassing than the others, that we can find their meaning and we can understand why they're so important. When you can notice the analogy with the higher and higher types of. Of symbolism. Now, of course, like I said, skateboarding is a game. There's an aspect of skateboard symbolism which also has to do with carnival in the sense that there's an aspect of carnival which is the capacity to demonstrate your mastery of the carnival. And so there's an aspect of carnival which is in some ways giving in to the turning, right? To giving in to the. The light and the chaos and everything. But there's an aspect of carnival which manifests itself always as the capacity to master the element of carnival. And so if you think of someone rolling on a ball, for example, you know, like walking on a ball, this is. Or, you know, walking on a roller, these different aspects of symbolism, or to some extent, the manner in which acrobats use, you know, walking on a string, these different things that you see in circuses and the way that acrobats kind of manifest their capacity to be in the swirling of the world and to kind of be in this wheel that's turning and turning, but either being on top of it, and mastering it or showing some type of degree that this thing isn't going to swallow them, that in fact they're above it and they're capable of mastering it. There's definitely something about skateboarding in that symbolism as well, you know, especially as you get into all the flippy tricks and, you know, all these things. But there's still that whole element of getting air. You know, can you imagine the first time someone did that? You know what? It was showing this weird epiphany. I remember hearing Tony Alva say that he was skating a pool. I think he was the first one to actually get air. And he was skating a pool and. And he. He kind of went over the lip. He went over the top and he said. I remember the interview, he said, like it was the revolution. It was the beginning of the revolution. And of course, you know how ridiculous that sounds. You can understand that this idea of this. This standing chariot with wheels under it, you know, that as you kind of move from flat and then you move into something that's vertical and it's going up, and then you're capable of using that thrust to move from the horizontal into the vertical and then suddenly launch up into the air is something which has deep resonance in us, deep resonance in religious symbolism and religious participation. And of course, like I said, it's not sufficient. And the thing about surfing and skateboarding, that because it does have some element of the mystical in it, people sometimes get trapped in it. People get obsessed. They let it take over their entire personality. It becomes like a little cult where they're like skaters, and everything about their identity now is taken over by this thing or surfers. And that shows that to what extent it glimmers on the religious symbolism and hints at it. And so, of course, it can be dangerous in that sense because people can sometimes get caught up. But in the right perspective, if you understand the symbolism and you can participate in it and use it as a kind of method of training for mastery and, you know, for understanding these relationships of horizontal and vertical and the mastery of potential. But you also don't get caught up in it. You don't let it take over. Then it can be a little bit of a. Let's say, a glimmer of a mystical experience. And so, you know, I hope this was useful to you. I thank everybody for your attention, and. Yeah, I'll talk to you very soon. Bye bye."}
