{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":0.64,"end":75.43,"speaker":"Jonathan Pageau","text":"Hello, everybody. I am here and I know everybody's excited. I'm here with Father Steven DeYoung, the host of the Lord of Spirits podcast. He is also an Orthodox priest. And his new book, the Religion of the Apostles has just come out, I guess yesterday or just a few days ago, and I heard that it is flying off the shelves and I had a chance to read it. I'm one of the lucky few that had a chance to read it before. And so I'm really looking forward to. To having this discussion with Father Stephen. This is Jonathan Pageau. Welcome to the symbolic world. So, Father Stephen, before we kind of get into the meat of the book, and also of the Lord of Spirits, there has been so much discussion around the symbolic world, and there's been this strange confluence. Well, not strange, actually wonderful confluence of interest between the different worlds. And so tell us a little bit about what it is that prompted you to write this."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":77.19,"end":90.22,"speaker":"Fr Stephen De Young","text":"Well, this book is sort of filling a niche. I decided earlier, early on that if I was gonna write things, I wasn't gonna write my version of a thing that already exists."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":91.1,"end":91.5,"speaker":"Jonathan Pageau","text":"Right?"}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":91.5,"end":137.81,"speaker":"Fr Stephen De Young","text":"Yeah, another version. One of the things, unfortunately, in English speaking orthodoxy is that we have a very high concentration of a few things and then very little of a wide range of things. I'm only qualified to address certain little parts of that. But fortunately, some of those little parts are completely unrepresented now. And so this is one of them. So the religion of the apostles is a bunch of things looked at in different ways, but one of the main things it is, is a sort of one volume orthodox biblical theology, which is a thing that until this hasn't existed in English."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":138.29,"end":186.3,"speaker":"Jonathan Pageau","text":"Well, I think that there. It's such an opportune moment. There's something about the state of biblical scholarship which you could say that until, you know, until a few decades ago was quite. Was quite aggressive and was quite. Was used in a way to kind of destroy Christians, to destroy their faith. And what I really enjoy about your approach, what I see in the book and also what you're doing on Lord of Spirits, is you're flipping the tables and you're using, you know, kind of Second Temple, these Second Temple theories, and this new biblical scholarship to then point back and to point back to the liturgy and the sacred space and all of this type of thinking, which had been Discounted by the 19th century type of scholars, but now there's room for it again. So that's exciting."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":186.86,"end":196.89,"speaker":"Fr Stephen De Young","text":"Yeah. One of the good elements of what postmodernism has done is that it's kind of trashed modernism."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":198.89,"end":211.53,"speaker":"Jonathan Pageau","text":"Yeah, yeah. It's made the rationalist, materialist world insufficient. And so there's a crack that's open that we can actually speak it to."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":211.77,"end":236.1,"speaker":"Fr Stephen De Young","text":"Right. And so the idea. I mean, it seems so strange when I tell people this, but the idea that, hey, if we go and look at other Jewish writings from the time of the New Testament that could help us interpret the New Testament is an idea that did not really exist in biblical scholarship until the late 70s and early 80s."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":236.58,"end":265.43,"speaker":"Jonathan Pageau","text":"Exactly. Right. But then you realize that these texts, like, even though some of the texts maybe were lost or semi lost, the contents of the text were kept in these medieval traditions, in these kind of medieval legends. And so the content was still there in the iconography. And so it's as if all of a sudden this kind of new biblical scholarship is shining a light on some of the elements which were there. But so it's actually supporting the kind of liturgical point of view, let's say."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":266.15,"end":294.19,"speaker":"Fr Stephen De Young","text":"Right. And the previous modernist approach had said, well, we need to be skeptical of all that. Right. All those. Any Christian writer is lying. Right. He's not objective, and we need to go back and we apply these objective laws of history and make our reconstruction of what. Really. So you have all the quests for the historical Jesus stuff and all that. But then postmodernism says, well, there is no objective. Right, yeah."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":294.19,"end":326.69,"speaker":"Jonathan Pageau","text":"Or at least that the world is bound in stories and that the world is. Is from a point of view, let's say. And then with kind of cognitive science and these new approaches to emergence and to attention and all these problems coming up, even in physics, in terms of the limits of the relationship between attention and even phenomena, all of a sudden this idea of ritual doesn't become so stupid anymore. It really becomes something that is. That is. Makes sense even for a secular person."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":327.33,"end":335.41,"speaker":"Fr Stephen De Young","text":"Right. And there is always a subject. Right? That's what subject. See, we use objective and subjective in this weird way."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":335.65,"end":336.45,"speaker":"Jonathan Pageau","text":"Yeah, exactly."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":336.45,"end":341.57,"speaker":"Fr Stephen De Young","text":"But the real idea is just that there's a subject, there's an observer, it's from someone's point of view."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":341.97,"end":344.53,"speaker":"Jonathan Pageau","text":"Yeah. And that doesn't mean that it's. That it's arbitrary."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":344.69,"end":345.09,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":345.25,"end":407.41,"speaker":"Jonathan Pageau","text":"And that's what people have been trying to push, is that if something is subjective, it means it's arbitrary, but that's not it. Because the, The, The. The percept. Human perception has a pattern and human communion has a pattern, and all of these things are. Are not at all arbitrary. Because even if you go down to the most Materialist level. It ends up flipping the tables because you're like, you know, if you're going to apply materialist rules to. To things, apply to everything, and what happens is you have to talk about consciousness. You have to talk about, you know, your experience. All of this now has to flood back into the story. And. And it's like a surprise. Sometimes I even see it as slightly akin to the trick that Christ plays when he goes down into Hades where, you know, the scientists thought, oh, we've dealt with all this stuff. Now we've got. We're going to deal with consciousness. And they tried to pull consciousness down to their material world, and it did the opposite of what they thought it would do. It actually shot. It actually, like, was shining light on the world in a way that they didn't expect. It flipped it, you know."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":407.57,"end":471.54,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. Thomas Nagel, who's the contemporary great philosopher of mind talking about human and other consciousness, said, there's no view from nowhere. Right. So you can't write something. You can't describe something from nowhere. Right. You have to have a point. And so that's really the approach of the book. That's why it's titled. What it is, yeah, is St. Paul and the Other Apostles. Right. From the perspective of St. Paul and the other apostles. So they're not writing an abstract, quote, unquote, objective treatise about some unformed reality. They're writing from their perspective, from their own conscious experience. And so the book is trying to approach the Scriptures from that viewpoint, not from our modern or postmodern perspective, but what was their perspective to understand what they wrote from that perspective."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":471.86,"end":514.13,"speaker":"Jonathan Pageau","text":"But what you do as well, like, there's a lot there. There's a lot of stuff. What I sense from the book, what I got from the book, let's say, is that it takes what you're doing, Lord of Spirits. But it's not. It's as if it add. There's a lot more than what's happening in the Lord of Spirits. Lord of Spirits is like a. A section of the book, let's say. But the rest of the book is really trying to show also even in the Old Testament. But you mentioned this in Lord of Spirits a few times, where the idea of the monotheism that we understand today, like the kind of late, you know, this more modern vision of monotheism just wasn't there. It was never there. It's not there in the Old Testament and Second Temple. Definitely not. And that there really is a sense of different hypostasis already in the Old Testament."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":514.69,"end":548.28,"speaker":"Fr Stephen De Young","text":"Right. Yeah. Well, I mean, the. The term monotheism doesn't start getting used until the 16th and 17th century. And that's not because the words didn't exist. Monos and Theos were around for the church fathers and everyone else to use. Right. And the apostles use if they wanted to. They never did. Right. And they did use the term polytheism to refer to paganism. Yeah. They usually called what they were doing monarchianism, but that distinguishes it from what we now call."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":548.28,"end":550.48,"speaker":"Jonathan Pageau","text":"They actually use that word Monarchianism. Really?"}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":550.8,"end":552.72,"speaker":"Fr Stephen De Young","text":"Yeah. Yeah. That's tainted now."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":552.96,"end":574.12,"speaker":"Jonathan Pageau","text":"Yeah, yeah. It's a wonderful world in the set. It's a wonderful word in the sense of understanding the hierarchy. But it is problematic in the sense that it can give you the sense that God is inside the system. But in terms of just understanding an analogy to understand that there is all this whole stuff happening between God and us. Like, it's not just God and us."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":574.44,"end":577.88,"speaker":"Fr Stephen De Young","text":"Yeah. They meant it at the. At the. In the root meaning."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":577.88,"end":578.08,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":578.08,"end":580.36,"speaker":"Fr Stephen De Young","text":"That there's one. Archie, one first principle."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":580.36,"end":584.36,"speaker":"Jonathan Pageau","text":"Yeah, okay. Yeah, yeah. Monarch principle. Right."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":584.6,"end":586.2,"speaker":"Fr Stephen De Young","text":"But there are lots of beings."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":586.2,"end":586.76,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":586.76,"end":591.8,"speaker":"Fr Stephen De Young","text":"Aside from that first principle, they just aren't separate, independent first principles."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":592.17,"end":625.61,"speaker":"Jonathan Pageau","text":"Right. Yeah. And in a way, that, I guess that was why there was so much emphasis on the idea of uncreated, the idea that there's a chasm between the uncreated and the created. But the created is a lot bigger than what you think. Like, it includes all of these hierarchies of angels, which are so present in the liturgy. You know, once you start to notice it, you realize that they pop up all of these different little places, even in your prayers, like in your daily prayers. You see that there is these references to these hierarchies of beings that participate in this cosmic dance, I guess you could call it."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":626.01,"end":657.36,"speaker":"Fr Stephen De Young","text":"Yeah. A lot of what we do on Lord of Spirits is if you're already in the Orthodox Church and you're attending the services and paying attention, you have a lot of the dots, but you don't necessarily know how to connect them or how they connect to each other to make a picture. Right. You could just start drawing lines, but that doesn't always give you anything cohesive, you know? And so kind of what we're doing is, well, here's a few extra dots that you may not be aware of. And now here, let's start connecting some of these. And then people sort of take off on their own."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":657.76,"end":658.32,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":658.4,"end":662.32,"speaker":"Fr Stephen De Young","text":"Once they start to see those things and the picture starts to take shape."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":662.56,"end":721.36,"speaker":"Jonathan Pageau","text":"And the image, I think the image that God is calling us to participate in the divine council. The formulation, I think is so useful. It's, it's so useful for so many reasons. And I think it's going to be useful even in speaking to Protestants and to people. And because it's, it really can help you understand like what these saints are about. You know, without that concept, you can still get it, but once you have that idea that it, Christ tells us we're going to rule with him, Christ says that's what we're meant to do. And so this image is already there in the, in scripture. And if you look at the iconography, it's in the iconography. It's like, it's so crystal clear. You look at this image of the Last Judgment and you have Christ up there with, with, you know, with the Mother of God and the foreigner and then the apostles and the angels behind. And so you can just see that if that's what it is, it's obviously a divine council. It is this court that is judging the world with Christ."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":722.48,"end":749.01,"speaker":"Fr Stephen De Young","text":"And it's. When people have an issue with that, it's usually because they're coming at it from the wrong side. They come at it from the side of, well, why do I need anything or anyone but God, right? Or why would God need anyone but himself? But that destroys the whole concept of Christianity and salvation, right? God doesn't need anyone or anything."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":749.09,"end":806.44,"speaker":"Jonathan Pageau","text":"Yeah, but that shares. You can really, like I always just bring it back down to the most, I always like to bring things down to the most common experience. And I, and I always say, okay, so why did you ask me to get that plate then? Like, why did you just didn't just ask God? Like, why did you ask me to help you with your car? Like, why didn't you just ask God? You know, it's, it's, it's. And then usually then the next argument would be something like, yes, but you're asking for spiritual things. And I'm like, really? Let's talk about that. Like if you, if you ask me to help you because you're not doing well, like what do you think you're asking? You're asking for consolation from me. Just get it from God, right? Don't get it from me. And so as soon as you bring it down to everyday experience, you realize that it becomes a silly argument. You know, like, it destroys, not only Christianity, destroys the entire universe, like it destroys the world. If you think that God didn't actually create all of this to participate in the way that he reveals himself and manifests himself in our life, you know, it destroys the world."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":806.92,"end":833.21,"speaker":"Fr Stephen De Young","text":"Yeah, well, yeah, yeah. And it's this utilitarian approach of, well, I just need God to save me. Right. Because I have this problem, which is I'm worried I might go to the bad place when I die. And so I have this. But I don't need anything other than that. Other than that, I'm good, you know, So I can just kind of do my thing, you know, once I get those boxes checked to get that taken care of."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":833.29,"end":834.57,"speaker":"Jonathan Pageau","text":"Yeah, yeah, exactly."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":835.42,"end":861.9,"speaker":"Fr Stephen De Young","text":"Then I could move on. It's not about need. It's about, again, it's about love. There's sort of a self centeredness to utilitarianism, right. Of I'm only going to interact with other people the minimum amount I need to, and I'm only going to interact with God in the spiritual realm the minimum amount I need to for my own benefit, you know, Whereas God is the opposite of that. God doesn't need any of this. It's just pure love and sharing of what he has and who he is."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":862.58,"end":887.1,"speaker":"Jonathan Pageau","text":"Yeah. And it's overflowing. I think that that's the thing that once you start to get a sense of what's going on in the liturgy and in the Orthodox tradition is there really is this kind of overflowing and this kind of joy. Right. The joy in bowing before each other, of giving each other the holy kiss. Not now, but, you know, before COVID Hopefully after Covid, you know, giving each kiss."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":887.1,"end":890.83,"speaker":"Fr Stephen De Young","text":"How to get away with it again? Sorry, down here we could kind of get away with it again."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":890.83,"end":908.83,"speaker":"Jonathan Pageau","text":"Yeah, I know in Canada we've got the Gestapo. Like we. We celebrated Pasca on Sunday morning because we couldn't do it on Saturday night. And the police came by three times, drove in front of the building, slowed down, and tried to see what was going on inside. Three times."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":909.31,"end":909.79,"speaker":"Fr Stephen De Young","text":"Wow."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":910.11,"end":914.19,"speaker":"Jonathan Pageau","text":"I mean, can you imagine? It's just scary. It's scary stuff."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":915.8,"end":919.72,"speaker":"Fr Stephen De Young","text":"You know, we're kind of through the looking glass when Americans look at Canada as a police state."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":922.52,"end":1031.05,"speaker":"Jonathan Pageau","text":"Yeah, we've got. Justin, We've got. Anyways, let's not go into politics too much. That could go down a slippery slope pretty fast. All right. And so I have. Okay. I have some major questions, like for myself, because I've been following Lord of Spirits, obviously, everybody knows. And I've been really excited to see how it, for me, at least, how it connects a lot of the dots, I would say, in the sense that a lot of intuitions I've had a lot of things that I've noticed on my own, but sometimes I don't have the information. And so, you know, you're giving me a lot of tools. One of the most powerful images that you've given me is the image of the idea that the angels of the left hand, right? This idea that. That the demons are actually, in the end, kind of doing God's will. Because Saint Gregory of Nyssa talks about that at an individual scale. He says that each person is given an angel and a demon and that the angel is kind of carrying you up and then the demon is pulling you down, let's say, really like in the cartoons, like you see with the angel on the one side. But the idea that there's a cosmic. That in the cosmic vision that the fathers already had, this. This notion is really helpful in terms of understanding how reality can work. And my big question. This is my big question. So there's a. There's an individual level and there's a cosmic level. But do you think, or have you seen traces that there are other levels, like, at other. Other places? So, like, an example, a simple example would be, let's say you have the angel of a city. Like, would there be. Would there be like the demon of a city that's pulling things down, let's say. I don't know if you've seen traces of that in the tradition at all."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1031.21,"end":1057.38,"speaker":"Fr Stephen De Young","text":"Well, yeah, I mean, the place you most clearly see that is, for example, the Roman Empire during Christianization, right. Where the city of now, Thessaloniki, Thessalonica, you know, had Artemis presiding over it. That was the spirit who was presiding over that city and is sort of overthrown by Saint Demetrius."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1057.86,"end":1058.5,"speaker":"Jonathan Pageau","text":"Okay, yeah."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1058.5,"end":1066.18,"speaker":"Fr Stephen De Young","text":"In that sense, who becomes the patriarch of that city. But that didn't mean that all the pagans just vanished, Right."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1067.22,"end":1077.56,"speaker":"Jonathan Pageau","text":"There could be, like, a haunting of Artemis that could be. If people continue to worship her in the city, there could still be some tension in the city, let's say."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1077.64,"end":1100.28,"speaker":"Fr Stephen De Young","text":"Right. And there's a constant theme in ancient Near Eastern literature and even into the Greco Roman period, that there are these demons in, like, ruined places, ruined cities and abandoned cities who are the gods of that place that now have no worshipers."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1101,"end":1111.96,"speaker":"Jonathan Pageau","text":"Right. And they're so. They're kind of these residues, these kind of like the Titans or these, these. These. These beings that are on the edge and they're kind of falling apart or fragmenting, let's say, and sort of haunting the place."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1111.96,"end":1123.96,"speaker":"Fr Stephen De Young","text":"And they're weak, but because of that, they're also sort of vicious and need to be avoided and warded off. And, you know, exorcisms need to be coming done on the place to, you know, to rededicate it."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1124.2,"end":1164.4,"speaker":"Jonathan Pageau","text":"So the way that I'm thinking of it is mostly like, let's say, like a modern city. So you think, imagine New York. New York has a pretty strong presence. Like, it has an effect on the world. It's pretty important. And so could it be. It. Would it be possible to imagine that there's. That there's like a battle for principality happening in that. For that city, let's say. Right. That there's. That there's a battle for the city and you've got, let's say, Christians praying and you've got other things going on. And so there's this battle for the. For who from. For which principality is going to rule over the way that the city is going to lay itself out. That's what I'm wondering about."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1164.4,"end":1166.92,"speaker":"Fr Stephen De Young","text":"Yeah, sorry, that's the short answer."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1167.16,"end":1169,"speaker":"Jonathan Pageau","text":"He says. Yes, that's the short answer."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1169.56,"end":1170.04,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1170.04,"end":1181.72,"speaker":"Jonathan Pageau","text":"Because if that's true like that, I basically. If I can think that, then I feel like pretty much, very much a large part of reality is going to be solved for me."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1182.2,"end":1197.82,"speaker":"Fr Stephen De Young","text":"Yeah. Well, I think the last time we talked, we briefly touched on panpsychism, I think, for a second. But I think it's even correct to say that they're battling for the soul of the city. Yeah, in a sense."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1198.06,"end":1220.17,"speaker":"Jonathan Pageau","text":"Yeah, exactly. Kind of like St. Gregory of Nyssa, the image that he gives of the angel and the demon, let's say, pulling on each side, and then you as the person, either following your angel or following your demon. And that will. That will direct your. Your soul, like you said, that'll direct your life, and it'll manifest itself in your actions and in everything about you."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1220.89,"end":1249.58,"speaker":"Fr Stephen De Young","text":"Right, right. And we tend to think of soul as something that just humans have. That's not the way any ancient or even medieval person thought of it. Right. Animals have souls. All these things have souls. They just have different types of souls. Plants have souls. But you could go beyond that to the idea that a community, a town, a police, has a shared life."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1250.14,"end":1269.63,"speaker":"Jonathan Pageau","text":"Yeah, well, Christ seems to point to that when he talks about judging cities. Like when he says, woe to you. It'll be worse for you in the time of judgment than it was for Sodom and Gomorrah. He seems to be treating the city as a being that. That has a life that will be judged as well in the age to come."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1270.27,"end":1294.24,"speaker":"Fr Stephen De Young","text":"Yeah. And this is reflected in Orthodox praxis in some cases. For example, after communism fell, the Russian Federation had a long period of public mourning and repentance for the death of the czar and his family. The murder of the czar and his family, almost none of them were alive at the time, the people who were there repenting of this."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1294.8,"end":1305.28,"speaker":"Jonathan Pageau","text":"But it's almost like there needs to be a kind of. Yeah, there needs to be a repentance in order to set things right and to kind of realign the city, you could say, towards the good."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1305.76,"end":1312.24,"speaker":"Fr Stephen De Young","text":"Right, right. The community's life has to be reoriented, put back in order. Right. Justified."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1312.96,"end":1356.09,"speaker":"Jonathan Pageau","text":"Yeah. And the taint was actually in the geography. And this is not. And it's not. It's like, you know, you can even see it's not superstitious. It's like you could actually measure it, see that the taint of the killing of the Tsar manifested itself in the. In the destruction of the churches and the sacralization of the land and the desire to. Not just. It's like. Because this idea of desacralizing, it's not just we're going to get rid of it, it's we're going to twist it, like we're going to make it. We're not going to just destroy the church. We'll make it into a stable. We'll have like, theses in it. We'll try to. It really is this. This kind of embittered action that is more than just a calculated political move, let's say."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1356.65,"end":1361.85,"speaker":"Fr Stephen De Young","text":"Well, that's because atheism is a myth, and not in the sense I usually."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1361.85,"end":1364.97,"speaker":"Jonathan Pageau","text":"Use myth in the bad sense, in the way they use it."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1365.05,"end":1401.74,"speaker":"Fr Stephen De Young","text":"I'm not really existing because every atheist is dragging around the dead body of the God he doesn't believe in behind him. Right. Because a negation can't exist. There's a joke from an old movie that Slavoj Iek, of all people, uses to illustrate this, that a negation can't exist. Where a guy is in a restaurant and he says to the waiter, can you bring me a cup of coffee? Sugar, but hold the cream. And the waiter comes back a few minutes later and says, I'm sorry, sir, we don't have any cream. Can we hold the milk instead?"}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1403.36,"end":1404.16,"speaker":"Jonathan Pageau","text":"That's amazing."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1405.92,"end":1410.56,"speaker":"Fr Stephen De Young","text":"So to have no cream. Right. You have to have cream."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1410.64,"end":1411.28,"speaker":"Jonathan Pageau","text":"Exactly."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1411.68,"end":1413.76,"speaker":"Fr Stephen De Young","text":"Can't exist without the thing. It's negating."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1414.08,"end":1463.62,"speaker":"Jonathan Pageau","text":"No, I think you're so right. That's something that I've been kind of pointing to. I did a Video on this weird kind of. On WandaVision and the Montero video. Like this kind of weird satanic moment. And I also did one on the inverted pentagram talking about this, how, in fact, these kind of satanic tropes are this strange dark mirror that ultimately will reflect back to God, even if it's not in their will to do that, even if they're doing it despite themselves, it ends up bringing back the image of God even, you know, because like you said, the negation can't have, doesn't have, can't exist. It always is pointing to its. And the parasite needs its host. You know, you can't. The parasite can try to feed off its host, but at the. In the end, it has to reaffirm the host or else it's going to die itself. Can't live without the host."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1464.34,"end":1484.02,"speaker":"Fr Stephen De Young","text":"Yeah. And so there's no sort of secular. There's no sort of neutral. There's no sort of bare bones while we've stripped away all of the, you know, or banished any kind of meaning or spiritual significance to this place, person, thing, idea. Right."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1484.18,"end":1514.6,"speaker":"Jonathan Pageau","text":"Yeah. It would cease to exist. It would have to just cease completely cease to exist for you to banish any form of sacred from a person or from anything. Because that's the actual shape of how it exists. It's the actual pattern of how it's there and how you even notice it out of the millions of things you don't notice. It's because it has the same pattern as this little holy place where you see things come together and are in communion, you know, in communion into something."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1514.76,"end":1544.92,"speaker":"Fr Stephen De Young","text":"So, yeah, and that's been probably the hardest nut to crack on. Lord of Spirits has been people's idea that existing means, you know, this mug exists because I can bang on it, you know, like I could. Right. It has physicality to it. That means it exists as opposed to existence, meaning it has an order and a form, and so the opposite being chaos, not an imaginary void or whatever it is that they think."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1545.24,"end":1593.26,"speaker":"Jonathan Pageau","text":"Yeah, but I think, you know, I think. I think we're getting there. I mean, I feel it. I can see that, you know, the people that are close, at least to the. To your podcast, the people that are close to what I'm doing, I can see that they get it. Like, I can see they understand it. But for sure, it's somebody who comes in kind of just cold on these ideas. Obviously, sometimes they. I've had people tell me that. I don't know why, but they've said that for two years. They listened to what I was saying and didn't understand what I was talking about. And then I don't know why they would continue to listen to it. That's the. But then, oh, finally I get what you're talking about. And I'm like, well, good. I guess I'm not explaining it well enough then. But it's a difficult thing because we're basically breaking a pattern of thinking like that has been prevalent for 100 years more. So."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1594.06,"end":1645.62,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. I mean, literally, the words that get translated as nothingness or non existence in English usually in Greek, is tomion, right? Which literally means that which isn't being. Being is a verb there. It's a participle. So it's that which is not doing the action of being or existing. So when people try to push back on me and say, well, no, look, see, there's nothingness in the ancient world, I say, okay, what's that? What's the pronoun referring to? Right? Because a pronoun has a referent, right? Yeah. And so that referent is chaos. Right? That referent or prime matter or pure becoming, depending on your ancient philosopher, however you want to."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1646.34,"end":1655.86,"speaker":"Jonathan Pageau","text":"Yeah. The only nothing. You could say the only nothing. And this is going to sound weird to people, but the only nothing is God in the sense of that he's not a thing. Right."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1655.94,"end":1657.22,"speaker":"Fr Stephen De Young","text":"He's not an object of the world."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1657.22,"end":1691.33,"speaker":"Jonathan Pageau","text":"Right. And so when we say that God created out of nothing, we don't mean that there was this nothing that was there that God created out of. It just means that, that, that. That God is the origin of all. And the origin of chaos, even like the origin of all possibility and of all actuality, is in this infinite. No thing, no, beyond being. Whatever you, you know, going up straight into Dionysus the Areopagite, you know, trying to find words for things that can't be named. But, but that's really the only thing that is really nothing in the. In the strict sense, let's say."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1691.89,"end":1707.18,"speaker":"Fr Stephen De Young","text":"I like the way St. John Chrysostom phrases it in his anaphora because he talks about God bringing all things, bearing or carrying, moving all things from that which is not being to being."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1708.38,"end":1713.42,"speaker":"Jonathan Pageau","text":"So then you really have this idea of moving from potentiality into actuality and of causation."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1714.14,"end":1715.1,"speaker":"Fr Stephen De Young","text":"Of causation."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1715.42,"end":1715.78,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1715.78,"end":1719.66,"speaker":"Fr Stephen De Young","text":"Yeah. And being the one who puts things in order."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1720.94,"end":1757.97,"speaker":"Jonathan Pageau","text":"Yeah, that makes a lot. That definitely makes a lot of sense in terms of understanding, but I really see that. I think we're getting there. Not only that, I think we're getting There. I think that at this point, I think that this is the future, like there's no other way, you know, and that this type of, this type of thinking and the people that are going to be able to kind of use it. How can I say this, that the fruits that are going to come out of this, you know, they're going to be the ones that will be able to answer the madness of the, of the postmodern world. Because using the old arguments doesn't work anymore. There's no room for them."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1758.69,"end":1804.22,"speaker":"Fr Stephen De Young","text":"Yeah. The whole hubris of modernism, the whole positivist project looks laughable now. But like, I could send. If you read the preface to Hodges, systematic theology from old PRINCETON in the 19th century, you would laugh out loud where he's talking about how theology is a science and the biblical text gives us the data. And so we just need to extract the data from the biblical text and follow good, sound deductive logic. And then the truths of theology are just as objective as the law of gravity. I mean, it's laughable. Like no one Christian, pagan, atheist, anyone can buy that now."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1804.6,"end":1804.92,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1805.64,"end":1828.04,"speaker":"Fr Stephen De Young","text":"And at the same time, postmodernism has proved completely unable to get past nihilism. Yeah. No matter how much they try. And so the only other option is to try to go back to some of what we set aside in those pursuits in the first place."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1828.2,"end":1902.65,"speaker":"Jonathan Pageau","text":"Yeah. And reinvigorate them. Because, you know, the idea, for example, like I just want to say, like, you're, you're. I've been wanting to talk about first Enoch, for Enoch for a long time, and I've just been avoiding it because of the problem of the angels and humans. And because I know that that was such a hang up, hang up for people. And I was like, okay, I'm not going to talk about it. But that book offers so many solutions to our problems, even in terms of the idea of technology coming and technology and, you know, power to act in the world coming from these demonic forces and how it basically led to corruption, moral corruption, but also physical corruption, and then leading to the flood. I'm like, this is what's going on around you right now. I mean, if we could have that access to that tradition again and the, the, the solution that you give, which is the Nephilim ritual, which is that this was a ritualized practice and that it was done through humans, but through this ritual that still exists today in Japan and still exists in. And existed, you know, continue to exist in the world. It just solves all the problems. And so all of a Sudden, the Book of Enoch does it. Like, it can't bother anybody anymore because even the reason why it bothered the later fathers is solved now. Like, you don't even. You don't have to worry about that."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1903.69,"end":1966.69,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And it becomes. And we talked about this on the show a little. But it becomes clear when you read those fathers. And you have to be very clear what they were bothered by. They weren't bothered by the idea of sexual congress between spiritual beings and humans because, like St. Augustine, who is one of the great opponents of that view, probably the greatest in terms of his influence, believed in incubi and succubi, for example. So in other places he talks about them, it was the idea of reproduction. Right. They would be able to reproduce. But when you look at their arguments, like you look at St. John Cashin's arguments, and one of his key arguments is, well, if that was happening then and it was happening after the Flood, why isn't it still happening now? And it's like, well, because you're living in 430 AD and so there aren't any pagans around anymore to do it. But there were people doing it in Mesoamerica and in Japan and in China."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1967.17,"end":1974.45,"speaker":"Jonathan Pageau","text":"Yeah. And they're. If you read. Like when you read the Hammer of Witches, that's what it sounds like they're talking about."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1974.77,"end":1975.25,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":1975.73,"end":2052.62,"speaker":"Jonathan Pageau","text":"Because they talk about how the women are having relationships with demons. But they say. They say you can't. It's not possible. But they just say. And then they just say it's just through secondary causes. And they don't like them even. It's like, for. They're so. They're so like, you know, there's such. Thomas. That they don't need to explain it. Like, we don't have to explain the secondary causes. We just know it's secondary causes. And, you know, it's like it's the seed of other men. That is, they say something like the seed of other men which is gathered by succubi and then. Then are given to the incubus, which will then impregnate the woman, which is also like, okay, you didn't explain anything, at least not like in the way we think of explaining by saying that. But it's like, I keep. How can I say this? I keep joking that we have versions of that now. It's called artificial insemination. Like that. That is actually that process materially manifesting itself where, you know, you gather the seed of a man and then you put it into a woman. She Has a child from a man that's not her husband. And I know that the guys who wrote the Hammer of Witches would have said that's witchcraft. Like, that's actual witchcraft. It seemed like it was going on because it. They talk about it in like the 16th century and they didn't have access to these theories that. At least not that I know of."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2053.26,"end":2068.62,"speaker":"Fr Stephen De Young","text":"Right. And our modern view of science has skewed a lot of those connections. Right. But just going back to the Book of Enoch, right. They don't draw a distinction between, like sorcery."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2069.5,"end":2069.82,"speaker":"Jonathan Pageau","text":"Right?"}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2069.82,"end":2077.82,"speaker":"Fr Stephen De Young","text":"No, I gotta make amulets. Right. And do inscriptions that will ward off evil as know how, as technique."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2077.82,"end":2078.14,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2078.96,"end":2083.84,"speaker":"Fr Stephen De Young","text":"And on one hand. And metallurgy. Right. Forging iron weapons."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2084.4,"end":2091.36,"speaker":"Jonathan Pageau","text":"Yeah, it's all the same. It's all the same. It's just using meaning to affect the world, like using these essences to affect reality."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2091.68,"end":2106.01,"speaker":"Fr Stephen De Young","text":"Right, right. And so we now have these, you know, this schism between those. But they're the same, you know, for. From that approach. And also the same in the Book of Enoch is the art of applying makeup and perfumes and seducing people."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2106.25,"end":2159.67,"speaker":"Jonathan Pageau","text":"That's right, yeah. One of my favorite parts of that book is when it says Azazel taught them the art of metallurgy and the art of painting the eyelids. I was like, that's like in one sentence. It's amazing. Well, because I think it's also because the thing they were using for paint on the eyes were made of metal. This idea of this metallic paint that they're putting on, which is perfect in terms of the symbolism as well. But it's like that's the hope. The whole idea of the garments of skin, seduction is part of that. Like, seduction is part of this covering of yourself to hide yourself, but then also to increase your power, let's say. And power of seduction, or power to kill someone is also that if you use an artificial manner, if you use an artificial means to increase your power, doesn't matter what you're increasing it towards. It's. It's the. It's the same. The same. The same process, let's say."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2160.79,"end":2162.07,"speaker":"Fr Stephen De Young","text":"Yeah, right, right."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2162.07,"end":2162.43,"speaker":"Jonathan Pageau","text":"And that."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2162.43,"end":2188.6,"speaker":"Fr Stephen De Young","text":"And so of course, we have the same thing, right, in our world. People using an understanding of how the world works, whether that's on a physical, material level or a social level, you know, or a spiritual level, you know, psychological understanding, sociological understanding, in order to accrue power to themselves, to control and dominate. And, you know, I mean, that's who the giants are. They're tyrants."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2189.72,"end":2191.64,"speaker":"Jonathan Pageau","text":"Oh, witchcraft. It's all witchcraft."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2193.4,"end":2199.64,"speaker":"Fr Stephen De Young","text":"And they're able to do that because they have this knowledge, you know, and that's how they're using it."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2199.8,"end":2253.61,"speaker":"Jonathan Pageau","text":"And there's an interesting. So there's this interesting idea that it's like that hubris is what leads to the flood. And like, one of the interesting, fascinating narratives that I've been seeing, you know, the kind of environmental narrative that has been popping up, it's very fascinating because there's something of Enoch in the environmentalist narrative. And, you know, even though I don't totally ascribe to a lot of the tropes of the environmentalist narrative, if you look at it, it can help people understand what it means, like what the judgment of God is. You know, what it means that God judges the world and destroys it. It's actually playing out of the very processes themselves. It's not like this arbitrary God that just arbitrary judges the world. It's kind of like the things that you do will have repercussions, and those repercussions will be the judgment of God on you. It's not arbitrary at all."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2253.93,"end":2262.81,"speaker":"Fr Stephen De Young","text":"Right. And that's, you know, regardless of what anybody thinks about climate change and the science and all that stuff. Right. That's a scientific question."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2263.5,"end":2263.82,"speaker":"Jonathan Pageau","text":"Fine."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2263.98,"end":2283.78,"speaker":"Fr Stephen De Young","text":"But the idea that our actions and the way we relate to each other and the world affects and changes, for the positive or negative, the world around us at all levels is, well, was clear to everyone in the ancient world and should be clear to everyone."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2283.78,"end":2338.06,"speaker":"Jonathan Pageau","text":"Yeah. But even that there's like a. No, there's a point of no return. Right. That's the thing that you see in the flood is that a lot of people, a lot of people don't like the flood idea because they think, you know, how is it that God could, you know, could do that? Because they can't imagine that there's actually a point of no return where the mechanisms that you've laid out, they're rolling and you can't stop it. It's just going to. You can't. You know, it's like a ball rolling down the hill. You can say, well, it's just rolling down the hill. You can't stop it anymore. And the environmental narrative has that in it. It's the idea that at some point you reach a point of no return and then it's over. But it can help us. Like I said, I don't totally ascribe to it for other reasons, but I think that it can help people understand what it means. Like what the flood narrative is and what it means that God can judge the world, let's say."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2338.3,"end":2403.64,"speaker":"Fr Stephen De Young","text":"Yeah. And you see that tipping point all through the scriptures. The next book I have coming out that's in process right now is about violence in the Old Testament. And so it's dealing with a lot of this stuff. But you have this imagery of a given people's cup of iniquity being full or not being full, or the land itself reaching this level of pollution and the cries of the victims, you know, coming before God and that reaching a point where now he has to act. He can't allow. Right. He's trying to show mercy to the wicked by not cutting them off immediately in their wickedness. But that reaches a tipping point where his love for the victims, he has to put a stop to evil at that point. And you see that with the flood. You see that with the giant clans. You see that with. When Joshua comes in, fights a giant clan. So you see that with all the way. You see that with Israel itself later on."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2404.12,"end":2411.08,"speaker":"Jonathan Pageau","text":"Yeah. Even within Israel, that some aspect of Israel gets judged and basically falls apart."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2411.48,"end":2426.85,"speaker":"Fr Stephen De Young","text":"Yeah. It gets past this tipping point where God's mercy toward the victimizers gets overtaken by his mercy toward their future victims."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2427.33,"end":2463.62,"speaker":"Jonathan Pageau","text":"Yeah. So here's my big question. This is kind of like my big question. I think you probably. I know what you're going to answer, but I think it's important. So this, this one of the things that I see you're doing and that I really appreciate is I would call it restoring the mythology of Christianity, which some people are going to think sounds horrible, but I know. You know what I mean when I say that. Yeah. And, and my question is, do you think that we can live like we can live in that story again? Do you think it's possible for modern people to. To. To live once again in that. That kind of grand story?"}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2464.26,"end":2466.42,"speaker":"Fr Stephen De Young","text":"Yes. That's a short answer."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2466.5,"end":2469.86,"speaker":"Jonathan Pageau","text":"Yes. I would like you to elaborate. I will answer."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2473.06,"end":2476.58,"speaker":"Fr Stephen De Young","text":"So this is going to go a little deep again."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2477.3,"end":2477.7,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2478.48,"end":2502.56,"speaker":"Fr Stephen De Young","text":"But. And this gets into some phenomenology, but we've been talking about this lately on Lord of Spirits. So if people listen to that, aren't gonna be totally familiar with that, but the world we live in, Right. Our actual umfelt as a person is constructed by the interaction of reality, which actually exists."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2502.88,"end":2503.28,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2504.1,"end":2541.23,"speaker":"Fr Stephen De Young","text":"Interacting with our human consciousness. And it's always been true, always will be true, as long as humans are humans. Right. But what we've mainly lost, even in most of Christianity, that's become very materialist. What we've mostly lost is that there's a third input there, which is God, not just the spiritual realm in general, but God, the divine energies, God himself acting in the world."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2542.43,"end":2542.83,"speaker":"Jonathan Pageau","text":"And."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2544.59,"end":2622.34,"speaker":"Fr Stephen De Young","text":"That'S perceived by. We're going to do a future episode of Lord of Spirits talking about the news. But we have a perceptive organ to perceive that and to quote unquote, hear or quote unquote, see that that's. We've closed off mostly on purpose, and that's why we've lost that sense. So it's a question of sort of reawakening that so that we're. We're interacting with all of reality and with the full scope of the world. But this is. Somebody asked in the Lord of Spirits discussion group on Facebook a while back if anybody. They talked about an experience they had and asked if anybody else had had an experience in their life with the grace of God. Just a direct encounter with the grace of God. And my response to that would be, have you ever had an experience in your life that wasn't a direct encounter with the grace of God? Because the divine energies, God's work pervades all of creation, Right. Subject and object, right?"}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2622.34,"end":2626.86,"speaker":"Jonathan Pageau","text":"Yeah. It's our incapacity to actually to see it because it's there all the time."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2627.18,"end":2634.14,"speaker":"Fr Stephen De Young","text":"Right. And we experience it unaware. And we're perfectly capable of experiencing things unaware. We experience oxygen unaware all the time."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2634.14,"end":2634.62,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2634.7,"end":2639.66,"speaker":"Fr Stephen De Young","text":"Right. I'm not aware of the atmosphere surrounding me. I'm not aware. But."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2641.39,"end":2641.71,"speaker":"Jonathan Pageau","text":"It'S there."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2641.71,"end":2647.87,"speaker":"Fr Stephen De Young","text":"And we're unaware of it and unacknowledging of it. And because of that, we don't understand anything."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2648.27,"end":2648.59,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2648.59,"end":2686.86,"speaker":"Fr Stephen De Young","text":"It's not that we understand the material element of reality really well and don't understand the other, because we don't understand the other. We don't understand the material either. Yeah, it doesn't make any sense either because we're missing this other piece. But so that's what it's about. And when that comes alive, that's when you start to live that way. And it's something that happens. It dribs and drabs and drips and drops. You don't like one day, all of a sudden wake up and be like, okay, I'm going to now I see the light."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2686.86,"end":2688.9,"speaker":"Jonathan Pageau","text":"I see the divine light everywhere. Yeah."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2690.9,"end":2692.5,"speaker":"Fr Stephen De Young","text":"Like that doesn't happen."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2692.58,"end":2695.38,"speaker":"Jonathan Pageau","text":"But it hasn't happened to me, that's for sure. Not yet."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2696.38,"end":2712.94,"speaker":"Fr Stephen De Young","text":"Little bits and bops, right? Little drips and drops exactly the way that person who posted that in the group experienced it. They had a Moment of that. Right. They had a moment of that. And it's giving that the space to grow and. But we tend to banish it."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2713.18,"end":2713.66,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2713.9,"end":2727.17,"speaker":"Fr Stephen De Young","text":"When it does happen, we tend to push it away and explain it away and we're scared of it. We banish it or some of us go the opposite direction, pursue it in all the wrong ways. Right, through psychedelic drugs. Through. Right."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2727.81,"end":2737.17,"speaker":"Jonathan Pageau","text":"Yeah, yeah. It's. Right now. This is very. Right now. It's a very popular thing that's going on. The whole psychedelics is coming back in a frightening way. So. Yeah, right."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2737.17,"end":2763.58,"speaker":"Fr Stephen De Young","text":"Because that's. I mean, if you want to find sort of technique again, sort of the method for the noose, for opening the eye of the noose and all this. Hey, read some Hindu literature, they've got all about it. But I don't know if I'd go down that route because, you know, we've seen with the giants at all what Techni does when it's applied in the wrong context."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2763.82,"end":2804.36,"speaker":"Jonathan Pageau","text":"Yeah. And it's so funny. The whole psychedelic thing is hilarious because a lot of people that are coming to me talking about it, they have a weird. They have a more kind of traditional vision or kind of a traditionalist ideal. It's a. You know, even if through. Sometimes they're not totally Christian. But, you know, the psychedelics came out in the 60s, guys. The psychedelics are part of the reason why we're here. Like, we're in this. This crazy world because of the psychedelics. And so now bringing them back isn't necessarily going to bring us in a better spot than. Than what happened in the 60s, at least I don't think so. There's not like there's more capacity to discern now than there was in the 1960s. Right."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2804.76,"end":2818.84,"speaker":"Fr Stephen De Young","text":"And artificially inducing a state or experience does not give you the ability to understand and assimilate and process and find meaning in that experience."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2820.2,"end":2820.56,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2820.56,"end":2860.93,"speaker":"Fr Stephen De Young","text":"It just gives you an experience. And that experience can then go very badly. Right. And if you need example other than psychedelics for that, just look at sexuality. Yeah, right. We have all kinds of artificial technological means now to induce sexual ecstasy and a sexual experience. But people who go down that path end up with a sexuality that's very disoriented and bent and confused and not healthy, you know, for them or anyone else. And it becomes very hard to come back from that. Not impossible with the grace of God, but very difficult to come back."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2862.21,"end":2880.73,"speaker":"Jonathan Pageau","text":"And so long answer is that you think that it is, like, I'd say, for the postmodern world Right now in North America that we have the capacity to live once again in this story, let's say this story, this grand story that you're presenting in Lord of Spirits. I think so."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2880.73,"end":2885.23,"speaker":"Fr Stephen De Young","text":"But to make a beginning of it. Yeah, to make a beginning of it."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2886.43,"end":2886.91,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2887.39,"end":2950.66,"speaker":"Fr Stephen De Young","text":"Yeah. And there's what I was. I was just talking to somebody about this today. One of the real problems we face, frankly, and I'm not going to get into politics, especially not Canadian politics, but that is one of the problems we face because there's this whole territory of our communal life and our social life that's been bracketed off now as, oh, that's politics. You have to stay out of there. You can't go into there. That's not connected to anything else, and nothing else is connected to that. And they've kind of made it sacrosanct. And eventually it's not going to be able to be right. Because eventually it's not enough to just reshape my personal life. Eventually I've got to reshape my family life and then community life. And I mean, it's going to hopefully progress out from my personal life. Right. That's the place that it starts."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2950.66,"end":2951.22,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2951.46,"end":2965.28,"speaker":"Fr Stephen De Young","text":"But down the road, we're going to smack into that fence around politics, and there's going to be a kind of a reckoning where we're going to have to. Things are eventually going to have to kind of dismantle in that arena."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":2966.64,"end":3047.96,"speaker":"Jonathan Pageau","text":"Yeah. Because it's happening. One of the things that. One of the things that postmodernism is doing is it's breaking down the material stability, let's say the materialists, they at least had some kind of stability. They didn't have access to the angels and they didn't have access to the demons, let's say. So they were protected from. A little bit protected from one side, but also protected from the other. And so as postmodernism kind of breaks down that solidity, a lot of dark stuff is seeping in. And so the politics themselves are already being, let's say, taken up by these weird demonic forces. And you can see it, it actually appears to you, right? You see possessed people, I don't know, literally possessed, but at least they're semi possessed. At least they're being ridden by demon, however you want to say it. And so it's happening and it has a weird coherence to it, like a kind of weird dark coherence to what's going on. And so. And so I think, like you said, that at some point we Also need to be able to understand that as those that are looking to have discernment in this breakdown and hopefully look up and look towards God and see how all this can come together. You know, it's. It's gonna. It's gonna have to face that. We're gonna come face to face with that at some point too. Yeah."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3049.48,"end":3084.27,"speaker":"Fr Stephen De Young","text":"There's a very good book called Earthly Powers that's talking about 19th century European politics on the European continent. And it shows how in terms of iconography, the civil iconography, in terms of patriotic songs, in terms of the structures of government, how all of the things that were associated with religion before the French Revolution. Yeah. All the iconography, all the music, all the. Everything gets transferred to political parties and political. Napoleon, you know, political."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3084.59,"end":3085.47,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3085.95,"end":3094.59,"speaker":"Fr Stephen De Young","text":"And personalities. And I don't want to be a total downer, but that line of development gave us World War I and 2."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3094.59,"end":3095.15,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3095.79,"end":3124.1,"speaker":"Fr Stephen De Young","text":"And Bolshevism and Stalinism. That's where that leads. And I think the same thing is now happening in North America. We're seeing the iconography that used to be attached to, albeit the Protestant Puritan kind of American church right now getting transferred into politics and political morality. You know, that's."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3125.67,"end":3178.71,"speaker":"Jonathan Pageau","text":"Yeah. The whole last year was just a symphony of insane religious upheaval. Like there was just all this religious imagery flooding back into the world. And it's scary. Like, it doesn't look good. It doesn't have the transformative power that Christianity does because we're seeing the scapegoat mechanism kind of get brought into the world. And, you know, Christ gave us the solution to that, which is self sacrifice, which is self sacrifice. But now that's not what's going on there, once again, is this demonizing of groups and this. And it's done in a. In a very strange, sacred way, using this imagery that is very religious. And so, yeah, it doesn't. It looks like we're going back to paganism. That's what it looks like."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3179.34,"end":3213.86,"speaker":"Fr Stephen De Young","text":"Yeah. There's. I was recently listening to some comments from, believe it or not, a Marxist university professor who was talking about what he called the Great Awokening, which is itself religious language. Yeah. But talking about the problem with sort of woke liberalism. And he said, you know, it's just too Protestant for me. They're all out there arguing about who's going to heaven and who's going to hell. Yeah. He's like, and I'm trying to do politics. It was sort of like."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3214.18,"end":3236.07,"speaker":"Jonathan Pageau","text":"But that's those. But it reveals to us what really drives these things. Like, it reveals to us what. That the passions that are behind or the desires, the hidden desires that are behind these political actions are actually spiritual, you know, and they're distorted and they're contorted. But, you know, if he thinks that it was any different during the Bolshevik Revolution."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3236.07,"end":3237.03,"speaker":"Fr Stephen De Young","text":"Oh, no, no, no."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3237.91,"end":3251.03,"speaker":"Jonathan Pageau","text":"What do you think was going on back there? It was exactly. It was very religious, the way that. I mean, this deification of Lenin and, you know, like, the embalming of his body, all of this, like. What do you think is going on? This is not politics."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3251.91,"end":3284.36,"speaker":"Fr Stephen De Young","text":"Absolutely. But the, you know, Puritanism is always sort of associated with, you know, the American. Right. You know, that they're. They're not. That they're puritanical, but that they see themselves as sort of puritan terms. The elect, you know, they're the good ones. They're the good people. And there's these other sinners. But now we've got the exact same thing on the other side, you know, where we've got women, like, marching on Washington dressed as Puritans in an ironic way to tell men they need to act more like puritans in an unironic way."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3284.72,"end":3304.32,"speaker":"Jonathan Pageau","text":"Yeah, yeah. It's getting crazy out there. And. Yeah. And the whole cancel thing, all of that is just. It's exactly this kind of excommunication. Like, there really is just an excommunication, but it's like almost like a Democratic excommunication. Very strange."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3304.96,"end":3306.56,"speaker":"Fr Stephen De Young","text":"Racism in the Greek sense."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3306.64,"end":3307,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3307,"end":3309.76,"speaker":"Fr Stephen De Young","text":"We all write the name of the person and we throw them out of the city."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3310,"end":3324.7,"speaker":"Jonathan Pageau","text":"That's what's going on. That's exactly what's happening. And so we really are seeing a kind of flooding in of paganism and paganist. Pagan structures and pagan gods, I would even say. And so. So we've got work to do, you know."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3327.34,"end":3327.74,"speaker":"Fr Stephen De Young","text":"But."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3327.74,"end":3328.14,"speaker":"Jonathan Pageau","text":"But."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3328.78,"end":3331.66,"speaker":"Fr Stephen De Young","text":"But now that I've had a negative. Nancy."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3331.66,"end":3334.5,"speaker":"Jonathan Pageau","text":"All right, let's get a positive answer. Finish with the positive thing here."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3334.5,"end":3335.74,"speaker":"Fr Stephen De Young","text":"To be positive, I guess. Positive."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3335.74,"end":3336.06,"speaker":"Jonathan Pageau","text":"Pete."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3336.06,"end":3374.96,"speaker":"Fr Stephen De Young","text":"I don't know. One of the things. I grew up in Southern California, which was sort of ahead of the curve on this. So if somebody there was a pagan, they had a big license plate saying they were a pagan. Proud pagan. Right. And if somebody was an atheist, they were an atheist. Right. You know, everybody was pretty clear on who they were. And I went to my undergraduate in East Texas, which is a very different culture right there. Everybody went to church. Right. The county that school was in was the only county In East Texas, that was not a dry county. It was the only place you could get liquor."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3374.96,"end":3375.4,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3375.64,"end":3394.04,"speaker":"Fr Stephen De Young","text":"So the county was just packed with bars and strip clubs. Right. But all the strippers were in church on Sunday morning. Right. Like, everybody went to church. When you met people in this town, they said. They asked you what church you went to. That was like the second question."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3394.04,"end":3396.24,"speaker":"Jonathan Pageau","text":"Yeah. What's your name and what church do you go to?"}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3396.24,"end":3427.57,"speaker":"Fr Stephen De Young","text":"What church do you go to? Because that was how class divisions worked. That was how, you know, so it was all, what church do you go to? And the people there were no more committed to the Christian faith than the pagans and atheists and stuff I grew up with in California. Right. They were just fooling themselves and sort of being performatively Christian publicly. So as that breaks down everywhere, I think we're actually at a better position because at least we all know where we stand."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3428.13,"end":3458.26,"speaker":"Jonathan Pageau","text":"Yeah. There's no advantage. Like, the advantage of being a Christian is going away and is. Has gone pretty much. And so it's. So it's. It's harder. Well, there's probably still some, but it's. There are less in certain places. But let's say that it doesn't have the same. The same effect as it used to. And so like you said, then, it definitely going to wean out a lot of the. The people that weren't. That weren't serious about. About why they were there and what they were doing. So."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3458.58,"end":3472.82,"speaker":"Fr Stephen De Young","text":"And that. That opens up the possibility of actually having real conversations with those people. Because if you approach someone who's in this bad place in their life and lost, but they insist that they're a good Christian and believe in Jesus."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3473.09,"end":3473.33,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3473.89,"end":3506.68,"speaker":"Fr Stephen De Young","text":"I'm very limited in what I could say to them, you know, and as an orthodox priest, they're gonna, you know, think I'm Roman Catholic, first of all, and they're gonna critique, you know, try and do some kind of surface critique of my theology and just disregard me, you know. Whereas if someone knows, you know, no, I am lacking something spiritually, maybe I want it, maybe I don't. But that kind of person in that kind of position is much more open to hearing what other people have to say."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3506.92,"end":3507.4,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3507.8,"end":3508.36,"speaker":"Fr Stephen De Young","text":"You know."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3508.76,"end":3554.02,"speaker":"Jonathan Pageau","text":"Yeah, I've seen a strange. It'll be interesting to see, like, I'm being more involved now here in Quebec. I'm trying at least. It's like almost like a therapy for me with these French Canadians. And so I've seen like, the younger generation, they. They actually don't know anything about Christianity. The, like, the people in their 20s, like late teens and 20s, they don't know anything. And so they're actually not even hostile towards it. They're just like, I don't know what this is. Like, what is this? What is your thing? And so it actually. It's like a clear slate that you can speak into. And. Yeah. So it'd be interesting to see how that. How that's gonna. How that's gonna play out. It definitely. It's not. It's not. It's not a battle. It's not the same kind of battle. It's just more like real conversations."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3554.75,"end":3563.39,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And we have to. We have to approach it that way, too, and not make assumptions about who people are and where they're at and what they think."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3563.95,"end":3564.83,"speaker":"Jonathan Pageau","text":"Yeah, exactly."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3565.07,"end":3574.35,"speaker":"Fr Stephen De Young","text":"I've had some fascinating conversations with pagans since we started Lord of Spirits. Because when you start out by saying, like, no, I believe all those gods exist."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3575.71,"end":3597.65,"speaker":"Jonathan Pageau","text":"Yeah, yeah. That's been my move for, like, several years. When people say, you know, a Christian is just someone who believes in, like, one. Just, you know, like one. What did they say? Like, one less God or whatever? Like, yeah, I'm like, what are you talking about? I believe in all the gods. Like, I've always believed in all the gods. And so. So let's have another discussion, because that one's definitely not going to work on me."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3598.37,"end":3606.61,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And sometimes they just look at me in disbelief and I'm like, no, that's what Christianity is. And I talk to them about theosis and stuff, and they're like, wait, what? You know."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3608.39,"end":3624.95,"speaker":"Jonathan Pageau","text":"Yeah, exactly. So, last question, I guess, before we go. So what are you hoping for the book? Like, what are you hoping. The discussion, what it will bring about, the effect that it'll have. I'd like to know how you see it being, how you hope it's going to be received."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3625.91,"end":3669.88,"speaker":"Fr Stephen De Young","text":"Yeah, well, I started out saying it's a bunch of different things. The main reason I say that is that I think, or I'm hoping that there'll be a bunch of different gaps that it will fill. Right. I sort of deliberately structured it as a biblical theology, and I've already gotten feedback from some people because Ancient Faith released the table of contents as part of a sample early. I've gotten feedback, for example, from a lot of Protestants who are sort of interested in biblical theology. They look at the table of contents and they're like, okay, this is. The structure is familiar to them. The layout is familiar to them. And so they're interested in what the contents are going to be."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3670.52,"end":3727.51,"speaker":"Jonathan Pageau","text":"Yeah. And it really. I was surprised because I wasn't expecting, when I got it, I wasn't expecting it to be like a kind of apologetics book, but mostly, in a way, that's what it is, like a biblical theology, but done trying to help people see people who are interested in biblical theology understand what it means, like what it means in terms of the tradition that was actually there in the early centuries that you discounted. And so it's like you're studying this on this side, you're ignoring this on this side. Now let's see if we can connect them together. And then all of a sudden a lot of things are going to make sense to you. One of the best things in the book, I don't know if you want to spoil it, but you give the best. You give the best explanation for the baptism for the dead that I've ever heard. And when I read it, I thought, I'm such an idiot for not having thought that before. It was just so obvious. I don't know if you're willing to spoil that for the people watching."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3728.23,"end":3772.9,"speaker":"Fr Stephen De Young","text":"Yeah, well, I kind of go in, I get kind of granular with the Greek on that one, and there's sort of a bunch of pieces to it in terms of the way it's addressed. But again, I'll try to do a shorter version that essentially this is talking about a practice that we still do today in the Orthodox Church, which was at that time, in the first century, someone being baptized and taking the name of a martyr. Right. Who had gone before within the understanding in the Greco Roman world of patronage and of how when you take someone's name, your actions bring honor right."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3772.9,"end":3773.26,"speaker":"Jonathan Pageau","text":"To."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3773.26,"end":3774.22,"speaker":"Fr Stephen De Young","text":"To that person."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3775.26,"end":3862.22,"speaker":"Jonathan Pageau","text":"It makes so much sense because all the other explanations don't ever satisfy. They didn't. Never satisfied me. You know, it's like no matter how people tried to explain it to me, I was. Sometimes I would say, well, they did it, but. But it doesn't. It's not saying we should do that. All this kind of weird explanation and. And this, the idea that you're baptized in the name of someone, basically, the way that we do it now, it makes so much sense and it explains the origin of a practice that is, like you said, is just totally common in Christianity and has been from the earliest stages when we hear of people being baptized and taking a new name, and then we have the idea of naming a child at their baptism. All of this makes so much sense when you understand it when. So it just. To Me that was like, it's such a small thing, but it can help people see the type of argumentation that you're giving, which is saying, if you look at. Even at the liturgical practice of the Church later on, it actually helps you understand, like, have Second Temple type thinking, have the liturgical type type world that we live in. And take those two, look at the New Testament again, and all of a sudden so many things make sense that you didn't understand before. And so, like, I don't think you're doing many things. Like, if I could say the one thing that you're doing, I think that that's what you're doing. And it's a. And it's a. It's a wonderful. For people that are interested in the Bible, it offers these wonderful keys that you didn't think were there before."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3862.38,"end":3918.61,"speaker":"Fr Stephen De Young","text":"So, yeah, I think that's a good example too, because it shows a place where it's our. It's our modern view that gets in the way. Because the ancient view of identity is that, you know, sort of like ogres and Shrek, right? There's layers that your identity is the composite of these layers, right? Your family, right. Who your father is in particular, but your family, your community, the city where you're from. I mean, how many people of the ancient world, their quote unquote last name is actually the city they're from. Yeah, that's part of their identity. The place where they're from, the place where they live, the community. They're a part of their trade, right? Yeah, right. All of these factors are layered. And that's your identity, the modern sense of the individual is the inversion of that identity is the negation of all those things."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3918.93,"end":3965.81,"speaker":"Jonathan Pageau","text":"And you can say that you don't have to go to Shrek. We can just go to the tabernacle. Like, the temple is made that way, right? The Garden of Eden, the temple, all of these are. That's exactly what is happening. And the idea that we are made in the image of the macrocosm, like that we are microcosms in the. In the image. You know, the temple can help us see how we're made. That's how we have the same structure as the temple. That's why we talk about circumcision of the heart. That's why we talk about going into the heart. Even Protestants talk about, you know, like, you know, having Jesus in your heart. That it's like all of that is because you're made like the temple. And this idea of identity as these layers is actually what makes the world coherent. Or else we have these atomized realities that are not interconnected, right?"}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":3965.81,"end":4041.28,"speaker":"Fr Stephen De Young","text":"And that's. And if we're going to be wrapping up here, this is another place for hope, right? Because if you look at your average human life, right, when you're a child, your identity is kind of given to you, right? You're born into a family, you're born in a place, you're born into a community. You get brought to a church or other place of worship without choosing right. You know, all of those things, all those layers are placed upon you and given to you, and that's your identity. Then when you become an adolescent, you rebel against all that, right? You become very modern and individualistic, right? I'm going to be my own person. I'm going to be who I am. Not you, dad, not you community, not you church. But then when you become an adult, right, you reappropriate all those things that were given to you as a child and really make them your own, and they really become your identity. So if that's what we can do collectively as a people, right, as an American Orthodox Church, as people, if we can go back and reappropriate some of that that was given to us when we were young, get past the rebellion, then we can have that identity again and have it for real in a real integrated way."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":4041.6,"end":4074.18,"speaker":"Jonathan Pageau","text":"And there's a kind of maturity in the new way that we perceive it, you know, not in the naivete that we had as children, which was fine at the time, but as adults, you know, coming at it through this different way of seeing the world. All of a sudden, there's a maturity we can bring to these. To these stories, to this reality. And like you said, it's more integrated. So thank you. Thank you for the book. I want to tell everybody. So get the Religion of the Apostles. It's out now. We want it to be on the New York Times bestseller list. So let's do this, everybody."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":4074.98,"end":4076.1,"speaker":"Fr Stephen De Young","text":"I have student loans."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":4076.5,"end":4100.88,"speaker":"Jonathan Pageau","text":"I have student loans to pay. All right, thank you, Father Stephen, and thank you for Lord of Spirits. You know, everything you're doing. I'm really excited about the future and what it brings. You know, I really do feel. I really do feel like I have this kind of extended team members that we're all kind of working in the similar directions and working towards similar things, and so it's great. I don't feel alone."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":4101.04,"end":4102.4,"speaker":"Fr Stephen De Young","text":"It's a cinematic universe."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":4102.56,"end":4104.88,"speaker":"Jonathan Pageau","text":"There you go. There you go. All right. Thank you, Father."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":4105.2,"end":4105.76,"speaker":"Fr Stephen De Young","text":"Thank you."}
{"episode_id":"SW - #162 - 2021-06-13 - Fr. Stephen De Young - Hope for the Future and the Religion of the Apostles","start":4107.28,"end":4172.23,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, just Jonathan Pedro's YouTube channel. You can also get involved There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description and so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
