{"episode_id":"SW - #094 - 2020-03-15 - Art and Technology - From Death to Glory","start":13.2,"end":3323.11,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. I want to thank you, Kelly. Thank you for inviting me and the Boston fellows as well. And thank you, Father, for having us here. It's really wonderful to be in Boston and to see a bunch of. A lot of people and kind of this. It's kind of this. The crowd is what I was expecting, you know, kind of 20s, early 30s. That's my image of Boston, I guess. And yesterday I was walking around Boston and I was pretty confirmed in my image. It was just all these young people walking around. And so what I want to talk to you about today is I want to give you a story of art. It's going to be a story of art that's going to be maybe a little different from the one you're used to hearing. I want to try to trace the story of art in Scripture and how it relates to our life today or what it means for us today. And when I'm going to talk about the story of art, it's actually going to end up being more than just art in the very narrow way that we understand art today. It's going to end up being the story of art as the entirety of human making, the entirety of human activity. How can we trace this line in Scripture? And how does it relate to us today in the Church and also as we see Christianity erode in our culture? What does that also mean for human making? What does that look like in terms of human making in the Orthodox tradition? For those of you who are Orthodox, there's an interesting little issue. There is a kind of duality in terms of human making, or in terms of, let's say, liturgical art or beautiful things, beautiful architecture, is that on the one hand, we have an ascetic tradition. And in this ascetic tradition here, we have an image of Saint Simeon the stylite, who stood on a pillar for most of his life and just stood there for day and night living this extreme ascetic life. And the image of the Desert Fathers and the image of the life of the monk and the ascetic is the lifeblood of the Orthodox tradition. It is what infuses the saints that we venerate. The stories that we tell of the early Desert Fathers, that is the lifeblood and the mystical tradition of the Church as well. The hesychastic tradition has these very extreme pronouncements about human activity, about images, about image making, which is that the purpose of the mystic is to attain pure prayer without any images, without any language, without any exteriority whatsoever, but to Enter into the divine darkness and experience oneness with God without any form at all. So how do we connect that to something like this? How does that match? How can we have a tradition that also celebrates this plethora of image making, that we have this exuberance in terms of our art, in terms of ornamentation, gold, all of this. When we go up into the church later, you'll see it's gold, mosaic and there is a carved marble and all of this kind of exuberance. How do we connect those two together? And we see tension even in the Christian church, even in the Orthodox tradition, we'll see tension appear once in a while. In that issue, you'll find a very sober priest who will quote to you, you know, a homily of St John Chrysostom which says that we should be careful, we shouldn't have gold, we shouldn't use gold for make churches, we should help the poor. And so you have this idea, no, we have to help the poor, we have to be ascetic, we have to be this. And then you also have the other side, where we have Hagia Sophia, which became the model for all the churches in the world and all the mosques in the world actually, and became the cornerstone of architecture for the west for centuries, right? So we have these two things. What I want to do is I want to go into the story and look at why these two types of these two traditions, how do they come together in Christianity? One of my main. The main people I go to is St. Gregory of Nyssa, because he is. His understanding of Christian symbolism is. Is no one beats him in his understanding. If you read the life of Moses, you get a very powerful vision of the Old Testament and this vision of the mystical union with God in the Old Testament. But if you read St. Gregory of Nyssa, it seems like he's really on the side of the. Let's say on the side of the ascetic. Let me just read you a quote from St. Gregory in his text on virginity. So St. Gregory says that we need to renounce marriage, right? We need to renounce all these things and renounce toil, the work that was given to Adam. We need to renounce, even to reject the deception that is given to us, even through taste and sight itself. And. And he talks about to be with God alone and enjoy this delight continuously and without interruption, and no longer to mingle with this repose, nothing which draws us in the opposite direction. And so he talked about being snatched up into the divine presence. And St. Gregory uses this story of Moses ascending the mountain. If you look at the story of Moses ascending the mountain, that's exactly the structure that is given by St. Gregory of Nyssa. As Moses ascends the mountain, he is returning to paradise. The mountain of Sinai is also the mountain of paradise. If you look at. If you look at this image, you can see Moses atop, and you see this glory of God. I don't know if you can see this little glory of God at the top of the mountain. So he's going up and he's entering into the divine presence. And to do that, he has to get rid of all the external coverings. He has to remove his sandals. He has to also shed the people that were with him. There's this image in the Old Testament, in Exodus, where as Moses goes up the mountain, at first he leaves all the people below, and then as he's going up, he's going up with all the elders. He leads the elders, then he goes up with Aaron, with Joshua, then he leaves Joshua, Then he finds himself alone at the top of the mountain. And so this is really the image of the shedding of all the externals and moving into the oneness of God. And in that, you really do find this image of Hesychasm, this image of the mystical vision of orthodoxy, which is this pure oneness with God. And you can see the image of the mountain is exactly that, right? Because you move from many things. You move from a large base, and as you go up, it gets smaller and smaller. And as you reach the top, then you can imagine almost like a pyramid at the very top. There's room for only one point. There's just one point at the top, and that's the oneness. And when you're up there, then you look at the world and you can see the entire. You have this overview of everything because you've reached the top and you have joined with heaven. So the very image is that. So then we can also understand the opposite as being related to this fall from oneness into the many. And that is what we see in the story of the Garden of Eden, the story of Moses, is this going up into the oneness of God, into the top where heaven meets earth. And the fall of the garden is the opposite. It's this moving away from the oneness up at the top of a mountain, and then moving out into the many, into all the things that are outside, the distractions of the outside. So the imagery that's used in Scripture is that. And that's also the image that St. Gregor of Nyssa uses as well. So imagine now Adam and Eve are in the garden. At first, Adam is not even separated into two. He's one. And this is actually an important thing that we see in the Church fathers, the tradition in the Church fathers, which is that even the separation of Adam into two people to make this androgynous being into two was already looking forward to the fall. So the separation into male and female. Then finally, Adam and Eve are seduced by the serpent and they have to leave the garden. And leaving the garden is this going down into the world? When they were in the garden, they were naked. And we need to understand this nakedness in the context of this image of the mountain. Keep this image of the one and the many. You know, just keep that image in your mind, because I'm going to keep coming back to it all the time. In the garden, they were naked. They didn't need anything from the outside. They had everything they needed within that communion with God. They didn't need to add something from the outside to build something from the outside. They just had all they needed was the communion. And as soon as they fall, then this nakedness. The Church fathers talk about how this nakedness was actually. They were clothed in glory. It wasn't that it was naked, the way we think of it, but it was rather that they didn't need external things. They were emanating light. You can imagine it that way. They were emanating glory. They didn't need to cover themselves. As soon as they fall, then they become ashamed. They look up, you know, they understand that God is there. And all of a sudden they feel like they have to hide themselves from God. So what do they do? They take leaves and they try to cover themselves. That is the very first human act. Act in the sense of the first human making. The first things the human made was, was clothing. First human art. Let's talk about it that way so you'll see where I'm going right away. The first human art is clothing. And what's its purpose? It's to cover, it's to protect, it's to hide. Okay? And so you can also understand it as you're moving down from the mountain. So imagine now again, the sun above, above the world. The sun is shining down, right? And at some point, the sun becomes a threat to you. Just like for them, God actually became to them, in their perception, God became a threat to them. And so they wanted to cover themselves. They wanted some shade from something that was above them. And that is what art is. And that is why art in the Old Testament is actually pretty negative, has a very negative connotation. And I'm going to show you, I'm going to bring you through it, but you're going to see that actually human activity, human making, is actually a very negative aspect. And it's not just even in the Bible, but even, let's say, in Hellenistic culture, it was the same idea. They had this notion that true knowledge was episteme. True knowledge was the knowledge of the principles, the knowledge of the higher things and techne or craft or art. It was, you know, it's like applied knowledge. And there's something about that that's almost like degrading of knowledge down to the world. You know, think of Plato and his idea of the shadows of the pure forms and then the shadows in the world. And so it's not just. We don't only see it in the Bible, we see it in other cultures as well, where this idea that the higher things, when you make, when you cover yourself, you're hiding yourself from the higher things, it becomes a veil. Okay? Becomes a separation. Right? So now using the word veil is probably a very good word for you to understand what it's referring to. The veils in the temple, the veils in the tabernacle, it was all about that. It was all about hiding, you know, protecting ourselves from the glory of God, but also protecting the glory of God from being desecrated from the outside. Okay? So that's the clothing. And then as they fall, God gives them garments of skin. And the garments of skin are the best image to understand this clothing, to understand this addition to our nature, this adding that we put on top. Because the garments of skin are made of dead animals, they're made of death. It's using death to protect us from death. Taking something dead, making it as a covering so that you protect yourself from death outside. So why did they wear the garments of skin? What were they protecting themselves from in the scripture? From the thorns. God says, you go down the mountain, you come down, and then you encounter the hostility of the world. You know, being naked up in a garden in the glory of God is all fine, but being naked out in the woods is not fine because you get. You step on thorns, and that's why they wear these garments. St. Gregory of Nietzsche is amazing because he says that Moses sandals are the garments of skin. It's a perfect image because these skin sandals on the bottom of your feet to protect yourselves from the thorns and the spikes and the hostility of the ground is A very beautiful image to help you understand, to understand this. Now what's important is that we need to understand this covering now, not just as clothing. You know, clothing is the image. It really ends up being everything that humans do in the world of the Fall, Basically our whole state of death, our whole state of living death, you could say, you know, of. Of fighting death, of being in a world of death, of constantly having to deal with the reality of the hostility of the outside. So if you want to read more about this idea of the garments of skin, there's a wonderful classic orthodox book called Deification in Christ by Paniodus Nellis. I'm going to quote something from his where he talks about St. John Chrysostom. And Nellis says St. John Chrysostom teaches that before the Fall, man had no need either for cities or for arts and skills, or for the covering of clothing. These were then superfluous, he continues, but afterwards they became necessary because of our infirmity. And not only these things, but everything else. The whole throng of remaining necessities and death entered with all these, dragging all of them in along with itself. So there's a play between death and these protections from death. There's a game happening between the two, right? As you go further out into the world, you need to build stronger and stronger things. And the classic example is, I'm from Montreal. When my ancestors, maybe a very long time ago, lived in warmer climates, didn't need much, but now if I go outside without a winter coat and a hat and boots, I'm going to die. So to live further out in the world of death, we need more and more covering, more and more civilization, more and more structures, an army, weapons, a wall around the city, etc. Etc. We need buildings to protect ourselves from the elements, to protect ourselves from attacks, to protect ourselves from the people viewing, spying on us or whatever it is that we do. That's why we need buildings, right? And now in the story of scripture, oh, and medicine is the same, by the way. Medicine is exactly the same structure. It's a human activity which uses death to put death away. Because all medicine is poison. All the medicine, it's all poison. It's all something that can kill you. We use something that can kill you in order to stop something that's killing you. So we play this game and we have to be careful. It's a fine line between you have cancer, you go take chemotherapy, and the chemotherapy is killing you, but you're trying to heal your cancer. So it's like this line that you're always playing, you take a vaccine, you get injected with a disease in order to fight off a disease. This is the process of. Of the garments of skin. Now, in order to accentuate that this is really what you see in Scripture, you have to read the genealogies in the Bible. No one likes to read the genealogies, but there's great stuff in the genealogies of the Bible. Every single human activity in Scripture, the basic human activities, are developed by the children of Cain. Cain who killed his brother, Cain who was chased out. So think of the garden, again as this mountain. St. Ephraim the Syrian, he talks about the Garden of Eden as the entire cosmos. He says that the Garden of Eden is a mountain whose summit reaches above all summits and whose base reaches across the ocean. So he talks about this image, this structure, this mountain is basically being the entire cosmos is this mountain. So Adam and Eve fall, they go down. They've chased down the mountain. As they go down the mountain, they're further from the oneness of the top. They're going towards more, many more quantity as they're moving away from the top. And then Cain kills his brother and he gets chased further down the mountain. So the children of Seth are above, higher up on the mountain, and the children of Cain are lower down in the mountain. They're closer to the hostility. In Scripture, it says that he's chased out into the land of Nod, into this land that is like a wilderness. And so because of that, Cain himself founds the first city. Does anybody else know? Anybody know another story of someone who founded a city after he killed his brother? Rome. Yes. Remember that? Remember that? Okay. Rome is also founded by someone who tried to kill his brother. Okay? And as Cain goes down the mountain, as his descendants go down the mountain, we have this idea that the children of Cain become the ultimate outsider, the ultimate foreigner. You would say, like the ultimate thing, that you don't know what it is. And this is a tradition that spans in very strange ways all across storytelling. You even find it in the story of Beowulf, where in the story of Beowulf, Grendel and his mother are actually descendants of Khaine. These, like, primordial monsters that live in the swamp and in the forest are actually these descendants of Cain. But you can imagine it like this. You can imagine it that on the top of the mountain, we are these humans in the image of God. And as we get further and further down the mountain, we resemble God less. We resemble the animals more. We wear animal skins on us. And as we go down, then we start to become monstrous as we get further and further out. But it's not just Cain who founded the city. His descendants are also did other things. So Cain had children. And then in his line you have these Lamech has these different kids. One is named Jabal, who is the father of those who dwell in tents. His brother's name is Jubal and he was the one who created the musical instruments. And then finally, one of his children is Tubal Cain. And Tubal Cain is the instructor of every craftsman in bronze and iron. So we have Cain founds the first city. So he found sedentary lifestyle. Cain's children are the first nomads who live in tents and carry livestock. His children are the first artists, they are the first musicians. They create musical instruments. And his children are the first artists, they are the first craftsmen. They are the ones who make use metallurgy to make things. And so you can see that all civilization comes from the bad side. It comes from the dark side, you could say. And I'm sorry, everybody's like all discouraged. Don't worry, there's a happy ending, okay? Everything's going to be okay. But for now, we need to understand this first. If we want to understand the salvation that Christ brings, we have to understand the dark part first. And in the tradition, other traditions, it's a extra biblical tradition that goes even further than what I'm telling you here. In the extra biblical traditions, for example, in the traditions around the Book of Enoch, it's the demons who teach human beings their skills. So it's not just that Cain develops these skills, but it's actually fallen angels who are teaching the skills. And think about it in terms of, think about it in terms of what I've been telling you. Like, we get all hung up about the image of fallen angels and all this, but think about the image I had about the mountain, right, of coming down the mountain, how applied knowledge is moving, is coming, taking something above and bringing it below, okay? And so it's not that strange to imagine that these angels, these principalities, these higher beings are falling and they're the ones who are teaching the skills to human beings. Whether you think it's a legitimate tradition or not, just try to understand it. It can help you understand the story and why in the time of Christ, these traditions were very, very prominent. So in the Book of Enoch, it talks about different demons. One major demon is Azazel. And it says that Azazel taught men to make swords and knives and Shields and breastplates and made known to them the metals of the earth and the art of working them. Now, think of the metal part is really important, very important, because metal is digging in the ground. Remember the mountain? Remember this pyramid? Right? Metallurgy is digging in the ground, taking stuff from underground, bringing it up, and then using that. It's a very dark. And all the imagery around metallurgy in every culture is very dark. You have the image of Hephaistos, this deformed God in Greek and Roman myth that lives in Hades, that lives in this dark, fiery place and is pounding and making. And just think of a blacksmith in any kind of fantastic story that you get living in this soot and banging on metal and taking this ore out of the ground. It's a very dark imagery. So Azazel teaches people to make weapons, but he doesn't only teach them to make weapons. He also teaches them to make bracelets and ornaments and to use antimony. Now, antimony is very strange, but the reason, it seems to me, why he said to use antimony is because in the ancient times, antimony was a metal that was used to decorate the eyelids. So he's connecting metallurgy and weapon making with ornaments, with decorating. And so he says they use antimony and the beautifying of the eyelids and all kinds of costly stones and all coloring and tincture, and there arose much godliness, and they committed fornication. They were led astray and became corrupt in all their ways. So why is ornamentation connected with making something beautiful? Why wouldn't we want to make something beautiful? You know? Now, ornamentation is the ultimate garment of skin, is the ultimate thing that you add. You can think about it this way. And I. I tried to explain it. Think of someone. Why would someone need to wear makeup? Sorry. To all the ladies, like, why do you wear makeup? Right? Do you wear makeup in order to enhance your beauty? Okay, so you put something, you add something in order to enhance your beauty. Now, if you push that a little further, right? And let's say you put on more makeup. You put on more makeup. Where's the line between enhancing your beauty and hiding what's there? Okay, that's the line. That's the line that I'm talking about. This idea of adding something in order to enhance, but then you're also hiding. You're camouflaging what is there, you're supplementing in order to hide as well. That's the line that is going on in this. In this whole game. And that's why the ornamentation that the demons teach. Ornamentation is related to making cities and making walls and weapons. Because why do we use. Why do we need. Why would you want a sword? You want a sword to enhance your strength, right? That's the same thing. Every technology has the same function. Every single technology has the same function. It's to enhance something, but it also can be a way to hide that which is lacking. The example I like to use is always book of matches. I can. My ancestors had a lot of pain to start fires like they suffered to start fires. I don't suffer. Just take out my book of matches. There you go. I've got fire. But what do I do if I don't have that book of matches? Can I start a fire? I don't know how to start a fire. My ancestors knew how to start a fire. If they didn't have a book of matches, they could still start a fire. It's the same for everything around us, right? We have. Cars can go very far. And now our whole society shifts. And now if you don't have a car, what do you do? If you live in the suburbs, you can't live without a car because you actually. The grocery store is too far away from your house. You would actually die of hunger if you didn't have a car. Okay? Trying to help you to think that way in order to. To help you understand the problem of supplementarity and the problem of craft. And so there is a. There's a relationship between death and glory. Those two are very connected because that's what an ornament is that as well, right? We ornament something to help you see its glory. Why would you ornament something? Usually it's because you want people to think it's special, right? You have a plain chair and you have the special chair. You have the chair you use to eat, and then you have the chair for the king. And the chair for the king has got to be fancier than the chair that you just sit in for dinner, right? So you ornament the chair of the king in order for you to know that it is special. To reveal the glory, right? To manifest the glory. The game is still there because you can also fake it, right? Okay. All right. So hopefully I've got you thinking in the right direction. So sadly, art is related to the Fall. It is related to this problem of the world of death. And all human activity in this world of death is a problem. But now we come to this moment where God starts to reveal Himself to the people in Scripture. And we start to see what God does with the Fall. This is where the good part of the story starts to appear. We see how God is constantly changing. If we in the Fall changed our glory into death, God is constantly taking that death and changing it back into glory. And this is the story of salvation. This is the story of salvation all the way to Christ, all the way to the end of Scripture in Revelations. And so I told you that in the story of Moses who ascended the mountain. And really, in the version that St. Gregory of Nyssa gives you is the best version, because he really captures this ascetic movement, this removing. Now, in order to enter into the presence of God, he has to remove all the veils, the veils of the heart. He talks about. We have to remove them even he has to remove his sandals. He has to remove all these people. And he moves up and up and up into the unity, into the oneness, oneness of God. And there he has shed all of this exteriority, all of the outside. And said Gregory of Nyse uses crazy imagery to help you understand what he's referring to. He talks about. He talks about the idea of the Egyptian, for example, the Egyptian as this foreign power which is not connected to the God of Revelation. And so the Egyptians who die in the flood are being shed away, shedding away this foreign thing. And the. The foreign thing is also the. The shedding of the foreign is also circumcision, the shedding of this extra skin, right? Shedding the extra skin, shedding the foreigner, all of this imagery, and then moving up the mountain, entering into the divine darkness. And it's amazing. But then. So you think that's it, right? Everything we do is useless, but everything we do is pointless. All of this human activity, it's all pointless. It's all nothing. It's all. And to a certain extent, that's true. We always have to remember that. To a certain extent that's true. But then something happens up. When Moses reaches up there in the divine darkness, something happens which flips it. What does God give? Moses gives him two things, really. He gives him the law. He also gives them something else. What does he give them? Does. Anybody can guess? He gives them the plan for the tabernacle, okay? And St. Gregory says he gives them the archetype of the tabernacle. And he says that the archetype of the tabernacle is Christ himself. He gives Moses a vision of Christ in this plan of the tabernacle and in the tabernacle. So here's the tent of the tabernacle. Now, in the tabernacle, what do we have? We have the same structure that I gave you. He's giving him a little version of the whole structure that I told you about. The tabernacle has different courts. In the outer court, outside of the tabernacle, the foreigners can be there. Only Israelites are allowed to enter into the actual inner court of the tabernacle. And then from that, only the priestly cast is allowed to enter into the holy place. And there's a veil, and a veil, and then in the inner, inner, inner part, only one person, the high priest, is allowed to enter once a year in the very high place in order to come into the presence and the glory of God. So tabernacle is a mountain. It's a mountain. It's a mountain in the sense that there's many on the outside, and there's fewer and fewer and fewer. And there are these levels, these veils. And when you go into the Holy of Holies, you're going back into the Garden of Eden, too. There's a reason why on the outside of the Garden of Eden, there's a cherub which protects the garden. And why there's a cherub on the veil of the temple? Because entering into the temple is also entering into the garden, and it's also going up the mountain. All these things are all the same image, okay? But what's fascinating is that God is giving Moses this pattern, this whole pattern. He's telling him, this is how you make the veils. This is how you make the quartz. And even on the outside of the tent, there are these animal skins which are dyed red. So the garment, the tabernacle has garments of skins. Understand that? The same garments of skin that Adam had when he left the garden. So this is the wildest. This is the craziest thing. Moses spends all this time stripping away all these externals. And then when he gets into the presence of God, what does God give him? He gives them all back to him, the whole thing. Even the garments of skin, he gives them back. And in Saint Gregory of Nyssa, you read. You can read in Saint Gregory of Nyssa's words when he's talking about this almost this scandal, like, he has to tell us, don't worry when you see the garments of skin in the tabernacle, like, don't worry about it. Don't get freaked out. Because you'd think that you wouldn't see that this dead thing in the pattern of. Of the tabernacle. But he Says, don't worry. And then he says that it's the sacrifice of Christ. We'll get to that a bit later. And what's interesting is that God tells Moses that. He tells him who's going to build the tabernacle. He names them. He gives Moses the name of the people that are going to build the tabernacle. And the two names are Bezalel and Oholiab. The name Bezalel means the shadow of God, and the name Oholiab means the father's tent. Okay, can you see that those two things are the same? That they're the same image? The shadow, the tent, the covering. So the names of the people that are building the tabernacle are related to this very pattern in their name. And one of them, Oholiab, is said that he's from the tribe of Dan, which is. If you know what the tribe of Dan is, you'll understand how wild that is. Because the prophecy about the tribe of Dan, when Jacob prophesies on his sons is, he says, let Dan be a serpent by the roadside, a horned viper by the path that bites the horse's heel so that the rider tumbles backwards. So Dan is related to the fall itself. He's the serpent. He is that which makes you fall. Oholiab, his descendant is also very strange. He is a descendant of Caleb. Caleb means dog. And Caleb is ambiguously also a foreigner. He seems like he's a Kenizite, and he takes the margin of the country. So there's this whole thing going on where God is actually taking the very imagery of the fall itself. He's taking the very imagery of these animals on the periphery. And he's flipping it. He's saying, okay, I'm going to use this, and I'm actually going to turn it into glory. And that's where you see the beginning of the incarnational principle, the one which will culminate in Christ. We already see it. What do we say that Christ did when he descended into Hades? When Christ was on the cross? We say he. He trampled death by death, that it is his death which trampled death. And by doing that, Christ's death is his glory. When you see Christ on the cross, you are seeing the highest thing. When you see Christ on the cross, you are seeing the most glorious thing that you've ever seen. And that is this flip that happens, this incarnational principle. And it goes on. You'll see like it goes on, because, you know, I tried to show you how the craft is related also to something that is outside Something that you need to add from the outside in order to protect yourself. And so that's why it's also related to this idea of something which is foreign, like the foreigner, is related to craft making. Can you kind of see how that makes sense? Which is why Bezalel is from a Kenizite, descendants from this kind of foreign group. Because you have to kind of take that which is from the outside in order to make the wall. You know, that's always what you're doing when you're protecting yourself from the outside. You're gathering something in and you're making a wall out of it in order to protect yourself from the outside. You see that the story of humanity is there are so many examples of that where you hire a barbarian tribe to fight off the barbarians. The Romans do it all the time. You take something from the outside and you turn it against the outside. That's what's medicine is. All of that is the same. And that's also what ornamentation is. If you look at ornaments, they are very spiky. They're made out of foliage, they're made out of labyrinths. They're made out of all this imagery of knots. All of this is related to this idea of taking something, bringing it together and holding out the outside. You know, when, you know, everybody has this idea, we talk about how ornaments used to be protection. They're magical. People would put ornaments on things in order to protect themselves. Right? You put ornaments on buildings. People kind of joke about it. You know, you put a Greek key on a building to stop the evil spirits from coming in. You know, you put a labyrinth outside to stop the evil influences from coming in. And we think, ha, ha, ha, it's all superstitious, it's all silly, it's all nonsense. But once you start to understand this process, you can understand that that's what we do all the time. That if you don't like the ritual version of it, if you don't like that, then you have to understand that when you make an army or if you hire mercenaries from the outside, or if you do all this kind of things, then you're actually participating in the same pattern, even if you're not doing it ritually. The ancients just did things ritually as well, in order to manifest the pattern in a very proper way. All right? So as the story keeps going, in scripture, the same pattern just repeats itself over and over and over and over. That's what scripture is like. I want to beat you over the head with this pattern. So that you can see it, because people don't seem to see it. So when they now from the tabernacle, they build the temple, King David gets the plan of the temple. But does King David build the temple? Who builds the temple? Solomon, but not really Solomon. Solomon manages it, kind of, but he's not the one who actually builds it. You know who built it? The Phoenicians build it. The king of Tyre. It's foreigners. Foreigners build the temple. Okay? The same story over and over. And if you read that text where it talks about Solomon building the temple, it's very fascinating because the biblical authors are just so amazing. There's this strange relationship between Solomon building the temple, but him also being visited by the Queen of Sheba. And so in the same text, talks about how Solomon is associating himself with the King of Tyre in order to build the temple, but then he's also being visited by this queen, this ultimate foreigner in a way, you know, the queen, the Ethiopian queen, who comes from the ends of the earth, who's coming to now to interact with Solomon. So these two things are actually related together. And then in the story of Solomon, you actually see the downside of that because he goes too far. If you go too far in that, what you end up happening, you end up having foreign gods, right? If you go too far out and you're not careful of that line, then you pick up things from the outside which don't connect you. Then you end up having these, serving these foreign gods, and that will make you fall. And you have to think about it. Think about it already. Now, in terms of our own Christian tradition, it's always been this tension as Christianity develops its forms. It was taking things from the cultures that it lands in. Taking things from Roman culture, taking things from Greek culture, taking things from Ethiopian, from Armenian, from Georgian, from all these cultures. It's gathering these things in, and then it's developing its craft, its art, its beauty, its ornaments, all based on these foreign things that they're bringing in. And there's always this line, this tension. Sometimes maybe they go a little bit too far. Sometimes they, you know, so it's like you can see a play that's happening all right now. Then we come to Christ. Christ has everything. Every strain in the Bible culminates into him. Every symbolic strain that you find from Genesis, it all culminates into Christ. And so does this one. Christ is called what? Right, right. Christ is. Christ is called the carpenter. And it's interesting because in the scripture, you actually see in the moment where Christ is being called the carpenter. You see this pattern that I'm telling you about? Because when the Pharisees say that Christ is a carpenter, are they doing it to his glory? No, they're doing it to demean him. They're doing it to mock him. They're saying, isn't he the carpenter? Right. Because being a carpenter is a very low thing compared to what Christ is supposed to be. You know, in the idea that he would be the Messiah or he would be the chosen one, that would be the anointed, that he would be the. The prophet, that he would be all these high things like, oh, no, he's just a craftsman. Of course, the Pharisees did not understand what Christ was going to do, which is that he was going to enter into all the dark places, that he was going to go down into death, that he was going to fill death with light, that he was going to fill death with glory. And that is one of the things that Christ is doing by being called a carpenter, even if it is in a mocking manner. He is filling that aspect of the world with divinity. He is infusing it. He's transforming it. And the transformation was already happening before. We can see it in the tabernacle. You can see it in the temple. You can see it in all these moments where God uses these externals, all these garments, all these additions, all these human acts and flips them, changes them, turns them into glory. Now, the story doesn't stop there, right? The same thing happens with Christianity. The same thing happens with Christianity, even more so, even more so than what's in the Old Testament did. Is it the Jews that developed the arts of the Christian church? No, it's not. Who is it? It's the Romans. The Romans who developed the Christian arts. And a lot of people, they say that to criticize it. They say that to mock the Christian tradition, as if this was a scandalous moment in our church where all of a sudden Christianity took on these Roman forms. But no, no, no. This is the story. This is the story. We have to understand that Christ is one of the things Christ is not all he's doing. Christ is doing everything. But one of the things Christ is doing is saving Cain. He's redeeming Cain. He is the firstborn. You ever notice that in Scripture it's always the second born after Cain? Cain's the firstborn. And then everybody else who's important in Scripture is always the second or the last. And then Christ appears and Christ is the firstborn. And not only is he the Firstborn, but he is. He is. He converts the Romans. He converts the ones who killed him. He converts the ones who killed their brother and founded the city. So the story of the conversion of Rome is one of the most important aspects of understanding what Christianity is, what Christ is doing. And so what's important when we think of art, we have to keep in mind the two images of Christ. There are many images of Christ, but basically, really, there's really two images of Christ. The two basic images of Christ is Christ in glory and Christ crucified. Christ dressed as a Roman emperor, a Roman senator holding a book, making a Roman gesture of address, and Christ on the cross being killed by the Romans. Those two images solve the problem. They solved the problem. As you go up into paradise, as you move, as Moses goes up into the top of the mountain, as Christ entered into the Holy of Holies, when the veil was ripped while he was on the cross, he was entering into the garden, right as that happened, he was also going down into the bottom of the mountain, all the way to the edge of the world, all the way to the edge of death. He was doing both at the same time while he was being crucified, he was spanning the entire cosmos. That's why when we have Christ with his hands stretched out and we have the sun and the moon on the side, Christ filled the world when he died on the cross. He was doing both. And so when you. And so we have. Now, as Christians, we have those two traditions, and they're fine together. We have an ascetic tradition of those who go up the mountain and remove the garments, and these monks who live in caves and have nothing and eat almost nothing and pray without ceasing. We have that tradition, and we have the glory of a church covered in gold mosaic and resplendent, filling the world with this life light and using ornamentation. You know, if you look at Hagia Sophia, a friend of mine pointed out that all the ornamentation in Hagia Sophia is Persian. It's not even Roman. It's going even further. It's taking Persian ornamentation and bringing it into the Roman church and manifesting through its ornamentation the radiation, the radiance of the kingdom of God. And the final image of that, the ultimate image of that is in Revelations. How does the world end? Does the world end in a garden? The final image is not a garden. The final image is a city. Right? New Jerusalem. That's the final image. The garden is in the middle, the Tree of Life in the middle. You know the water of life in the middle and around it, this glorious city of gold and jewels. And that's the ultimate image. Everything has been filled. All of human activity has been sanctified, has been glorified, has been changed into glory. That's the final image. So that is the first part of my talk. I wanted to give you kind of a story of art, help you understand the problem and how Christ and the Christian church bring a solution to that problem. And so this afternoon I'm going to. Then I'm going to try to talk about how we can do that in terms of artists or people making things in the world and how to deal with that. So this is going to be the end of my first part. What time is it? Father?"}
{"episode_id":"SW - #094 - 2020-03-15 - Art and Technology - From Death to Glory","start":3324.63,"end":3389.6,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially. Get going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
