{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":0.16,"end":62.53,"speaker":"Laura Diaz","text":"Tucson, the weight is over Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight and serious risks at mediweight loss. I got the same medication but with a customized plan, weekly check ins and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com Mint is still $15 a."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":62.53,"end":77.77,"speaker":"Richard Rohlin","text":"Month for premium wireless. And if you haven't made the switch yet, here are 15 reasons why you should. One, it's $15 a month. Two. Seriously, it's $15 a month. Three, no big contracts. Four. I use it. Five, my mom uses it. Are you."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":77.77,"end":79.97,"speaker":"Jonathan Pageau","text":"Are you playing me off? That's what's happening, right?"}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":80.13,"end":85.47,"speaker":"Richard Rohlin","text":"Okay, give it a try@mintmobile.com Upfront payment of $45 per three month plan."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":85.47,"end":90.15,"speaker":"Laura Diaz","text":"$15 per month equivalent required. New customer offer first three months only, then full price plan options available, taxes and fees extra."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":90.15,"end":137.45,"speaker":"Richard Rohlin","text":"Seaman mobile.com but there is something to be said for the idea that our kingdom is not of this world, that we belong to a heavenly city. And the thing that I want to argue is that if you don't have this sense, the sense of belonging to heavenly city, then you won't have universal history. And that actually the sense of alienation to this world is the thing which is necessary, paradoxically necessary for enculturation. Our longing for paradise and desire to forsake this world paradoxically results in saints who establish the world. When you say something like the saints uphold the world, this is what that means."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":149.37,"end":176.92,"speaker":"Jonathan Pageau","text":"This is Jonathan Pedro. Welcome to the symbolic world. Hello everyone. We are back with an episode of Universal History with Richard Rowland. As you see, sometimes it takes a little longer for us to to get to these episodes, but it's actually because we're doing all the good stuff."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":177,"end":177.56,"speaker":"Richard Rohlin","text":"That's right."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":177.64,"end":192.68,"speaker":"Jonathan Pageau","text":"Symbolic World Press. Richard has been working in the background. You know, he's really been managing the. The company, putting things together, trying to get people's books to them. You know, getting the courses together like there. We have so many great things going on. We're really excited about the."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":193.03,"end":199.35,"speaker":"Richard Rohlin","text":"This is what we are right now. And part of the reason it's been a while since we've done one of these videos is because we just finished the purgatorial course."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":199.35,"end":200.31,"speaker":"Jonathan Pageau","text":"That's also true."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":200.31,"end":377.34,"speaker":"Richard Rohlin","text":"Which was an amazing experience. And if you like this sort of thing, it's just us talking for 18 hours about Purgatorio. And I think it's so far, of the classes that we've done, it was my favorite. I mean, we got to talk about so many amazing things in that course, and there's so many great insights that I think that really surprised everybody. And I got new things going through it with you as well. So. And we do plan. I know a couple of people have been like, okay, don't forget about parody. So we want to make sure that's on the schedule. So that is on the schedule for early next year. So just stay tuned for that. We have some other exciting courses in the new year that I'm really eager to announce, but I'm going to restrain myself for now. But we have. We have just a lot of good things coming. So one of the cool courses that we have coming up that's starting in mid November is Martin Shaw's course on Christian Wonder Tales. And let me just say that this course is going to be absolutely amazing. It's going to be four sessions with Martin, and he's going to be. He teaches in a very different way than I teach, which is to say he's going to basically, like, get you inside of the story. So one of the things we're going to be kind of talking around the story of St. Brendan the Navigator today as part of our Universal History series, and especially as part of the miniseries where we're kind of focused on Ireland. But what I want to say is that I'm not going to steal any of Dr. Shaw's thunder. In fact, it would be impossible for me to do so, because no matter how I tell the story, he's going to tell it better. I'm going to talk about the story, but he's going to tell you the story. So hopefully this just maybe whets everybody's Appetite. I am personally really looking forward to that course. We're also. The course has an insanely amazing logo that Heather designed. And we went to Heather and Martin, and we're like, could we make this into a T shirt? Because I would wear that. So we're gonna have. We're have merch for that course, which I'm really excited about. So. Okay, so we're gonna be talking about the voyage of St. Brendan the Navigator today. Probably not the entire thing, because the actual voyage is incredibly long. I think much longer than anybody remember. But one of the questions that I've gotten several times recently is, what book of Irish Saints do I keep referring to? And I thought I'd shared it before, but if not, here it is. It's just called the Lives of Irish Saints. It's in three volumes, edited by Charles Plummer. They have these green covers and no pictures at all. I mean, this is the horrible thing about academia. It's published by Oxford Clarendon Press. The horrible thing about academia is that people collect the most wondrous things they can and then make them look as deliberately boring as possible. And someday we're going to fix this, Jonathan."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":377.34,"end":377.78,"speaker":"Jonathan Pageau","text":"Oh, yeah."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":377.78,"end":384.38,"speaker":"Richard Rohlin","text":"Someday we're going to do our own collection of the lives of the saints of the British Isles. And it's going to be dope."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":384.7,"end":386.3,"speaker":"Jonathan Pageau","text":"Yeah, we'll have the best illustrations."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":386.3,"end":585.6,"speaker":"Richard Rohlin","text":"Yeah, it's going to be amazing. So, okay, so the thing that I wanted to talk about today, to kind of introduce this, is actually to, let's say, introduce a corrective to the universal history discussion. And so I started this entire series, which has been going for, like, almost three years now. And people, somebody asked me the other day, like, how many more videos are you going to do? And I said, I can do unlimited videos on this. I'm never going to stop. Like, I'll stop when Jonathan, like, you know, smothers me with the pillow. Like, we're gonna just keep making these forever. But no, the. The. The very first video in this series, we introduced with this idea that sort of, as I said, you know, I said something like, constantine saved everything or something like that. And. And you were like, oh, Richard, Jesus saved everything. Like, we got to be a little, you know. But I. That was a corrective itself, right? I'm, you know, like, Constantine is sort of the big bad guy. And one of the purposes of this project is basically like an apologia for Constantine and for other people who build civilizations, found cultures, established dynasties, all these different things. And you've talked a ton, even really recently, your. The video you did on St. Peter is another great example of the ways that, you know, whenever we establish these hierarchies in the world, they have these upsides and these downsides, and they have these two different kind of aspects they can take. We actually talked about this a lot in. In our Inferno and purgatorial courses as well, since this is one of the main things that Dante is constantly thinking about and trying to, like, work through what's gone wrong with it in his own time. But then also, why is it still necessary but all of that to say when somebody says something like, oh, well, you know, Christ's kingdom is not of this world, which is certainly something you find a lot of the martyrs saying, especially during the great persecution, Christ's kingdom is not of this world, and we should be focused on heavenly things and not on any earthly city. I mean, as I'm recording this, we're in the middle of a. Yet again, the most important election of my lifetime. I'm told every election is the most important election of my lifetime. And I'll just admit that I really struggle actually being a Christian and being involved in politics. And part of it is just a certain amount of cynicism that I sort of carry. And so you can go too far and just say Christians shouldn't be involved in politics at all, which seems to not be right. But there is something to be said for the idea that our kingdom is not of this world, that we belong to a heavenly city. And the thing that I want to argue is that if you don't have this. If you don't have this sense, the sense of belonging to heavenly city, then you won't have universal history. And that actually the sense of alienation to this world is the thing which is necessary, paradoxically necessary for. For enculturation."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":586,"end":615.91,"speaker":"Jonathan Pageau","text":"And I think this is the paradox that, you know, we presented many times on this channel in different guises, which is that if you don't hold. If you try to hold on to something as if it. You own it, then you lose it. Whereas if you are willing to let it go and to. Or offer it up to God is a good way of thinking about it, then you actually get the best of it, you know. And so, you know, obviously Christ said that about your life, but he. It's a way of thinking about everything, all the identities and all the things you participate in."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":615.99,"end":999,"speaker":"Richard Rohlin","text":"Let me just pick on my own tribe for a moment. Right. So among converts to orthodoxy in the United States, there's a lot of talk about enculturation. And you could even say a certain degree of anxiety about it. A lot of anxiety about, okay, well, when are we going to get like, really like American music? As if there's like one, you know, American music. And so anyway, and there are attempts that are constantly made at this about sort of trying to figure out. And you can see anxiety in people where they're constantly worried about, well, what's it mean to be like a Western person and an American and then also part of the Eastern Orthodox Church and all of the things that, you know, come with it. And one of the things, one of the ways this can manifest is that people get a little hasty about trying to solve the problem. And they get a little hasty about, you say, like baptizing various elements or things from other religious traditions, stuff like that. And I just, I hear half this, I'm going to say this. I have to insist upon the fact that Christians don't baptize cultures, they don't baptize practices, they baptize persons. And we very often this language has kind of slipped in where we talk about, oh, we just took this custom and baptized it, you know, by analogy. But I think it's important to insist on this idea that we baptize persons because it's through holy people, it's through us living lives of asceticism and holiness, it's through the saints that our culture, whatever it's supposed to be, whatever is good in it, whatever can be carried with it into the life of Christ, that that's going to grow and be made manifest. But this is a slow process. And as I said, paradoxically, it is one that only begins to work when we embrace our alienation to this world and our desire for paradise. So our last video was on the sort of these surprising Irish origins of purgatory. And then we went into that and did, you know, a six week course on Dante's Purgatorio where we revealed, among other things, that the secret resting place of King Arthur for people who, if you, if you watch the course, you know, well, one of the things that is true about all traditional accounts of purgatory, that, or things that are like Purgatory, right? Not even, you know, purgatory specifically as the doctrine now taught by the Roman Catholic Church, but these kind of these data which have come to us in the, usually in the form of, you know, apocalyptic visions and dreams and, you know, the visitation of dead loved ones and so forth. Right, which, which, which, which accounts for a very large body of human experience. Over the course of the last several hundred years. And one of the things that all of these traditional accounts that we talked about in the purgatorio class, that they all have in common, is that at the end of purgatory, or at the bottom of purgatory, or at the top of purgatory, depending on what your scheme is, there's the earthly paradise. And the earthly paradise is sort of the last stop. It's a refreshment before you move on to the true paradise. And what it seems to be is that all of this fixation on the afterlife, and you could say that at its heart, it really has a longing for paradise, and that these accounts cast that longing forward into the journey of the soul after death. But this desire for paradise, this is what sent men out into again, very paradoxically, it's what set men out into the wilderness of the Egyptian desert to confront. Confront the demons head on and to confront the darkness within their own hearts. That same desire for paradise is what made Constantine build the first Christian city. And what I want to talk about today is the way in which this desire for paradise manifests itself in the life of St. Brendan of Clonfer, who is considered one of the 12 apostles of Ireland. So there's these 12 great bishop saints of Ireland, and they're called the 12 apostles of Ireland. And they're sort of the ones upon whom you could say the manifestation or the phenomena of an Irish church is founded. And I think I said this a couple of videos ago, but several historians have said that it's not an exaggeration to say that the church of Britain and Gaul during the 6th century is fundamentally an Irish church. It's founded by Irish missionaries, it's founded by these Irish monastic bishops. So in the west, not every bishop has been a monastic. They're usually not. But in the Irish practice, and there probably is here, one of the things that I have not yet really talked about is whether or not there is a continuity between, you could say, like the Egyptian desert, Egyptian Christianity and Celtic Christianity. The evidence seems to be that there is, but it's really easy to overstate the case. And I think we're just now sort of maybe kind of sorting out what. What, you know, what things are similar just because they're both Christian ascetic traditions and what things are similar because maybe there's some direct influence. But certainly one of the things that seems to be an element of direct influence in the Irish Church is the fact that all the Irish bishops are monastics. And so you have people Building Christian communities not in the center of a city like they would do in Constantinople, but rather around the monastery. So what happens is you have a holy man and then a community forms around him and then the city forms around the monastic community. And that's the model for how churches are planted and how they grow in the in the Irish church of the."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":999,"end":1062.29,"speaker":"Laura Diaz","text":"5Th and 6th Tucson, the weight is over mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me, this isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight and serious risks. At mediweightloss, I got the same medication but with a customized plan, weekly check ins and a licensed physician guiding me every step of the way. And the cost the same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com pack up though."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":1063.09,"end":1091.69,"speaker":"Announcer","text":"Because Chevy SUVs have the capability to take you to some incredible places like an adventure in the middle of in the equinox. Active an SUV that will help you get away with confidence. Or head off for a night in the in Chevy Traverse with all the tech you need to stay connected. While the undeniable value of Chevy Trax will keep you moving from here to over here to way over here. Get to all the places you want to be with Chevy SUVs. See Watson or O'Reilly Chevrolet Century."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":1092.09,"end":1181.88,"speaker":"Richard Rohlin","text":"So St. Brendan is born somewhere in the second half of the fifth century, I believe. And he is a remarkable young man in many ways. He is, you know, the sort of. The sort of. Well, let me just, let me just introduce him because I think that we have some ideas of St. Brendan and he's in his little boat and sailing across, you know, alone on the, on the sea and it's all very picturesque and whatnot. But I want us to under in order to kind of make the point that I want to make. We need to understand how St. Brendan was conceived of by the Irish. So this is from. This is from an 8th century life of St. Brendan. Then one then of this company of happy and blessed ones that is one of the 12 apostles. Well, let me back up a little bit. He says now there are many of the patriarchs and the prophets and the apostles of the Lord of the Elements. The Lord of Elements, that's an Irish name for God, of whom this oracle is spoken in the Old and the New Testaments, that they were happy, just and perfect in their desire and longing and to fulfill the divine command and teaching, and who had the secret fear of the Lord perfectly in their hearts and minds without thought for anything else but that alone. So there's a connection here between the 12 patriarchs of the Old Testament, the 12 apostles in the New Testament, and then the 12 apostles of Ireland."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":1182.12,"end":1182.52,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":1183.24,"end":1232.79,"speaker":"Richard Rohlin","text":"One then of this company and blessed ones in the New Testament is he whose festival and commemoration falls at this season on the 16th day of June, to wit, Brendan the son of Finlug. This Brendan was the head of the belief and the devotion of a great part of the world, like faithful Abraham, a preeminently prophetic psalmist, like David the son of Jesse, A distinguished sage like Solomon, the son of David, a lawgiver to hundreds, like Moses, the son of Amram, A prolific translator like Jerome, wondrous thinker like Augustine. And this is going to trigger some people. A great and eminently universal student like Origen, A virgin like John, the Lord's bosom fosterling, which is a great."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":1232.79,"end":1234.27,"speaker":"Jonathan Pageau","text":"This is the 8th century, they wrote this."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":1234.27,"end":1330.56,"speaker":"Richard Rohlin","text":"Yeah. A virgin like John, the Lord's bosom fosterling. An evangelist like Matthew, a teacher like Paul, a chief apostle, gentle and forgiving, like Peter, an eremite, that is a hermit like John the Baptist, a commentator like Gregory of Rome. That's St. Gregory the Dialogist, a prudent and wondrous emissary by sea and land, like Noah in the ark. For as Noah raised the ark, of course you might just be thinking, oh, he sailed, Noah sailed. That's the comparison. But no, it says, for as Noah raised the ark high above the noisy waves of the flood, so will Brendan the son of Findlig, raise his monks, his family, hopefully that is us, high above the fire of doom, so that no fog or spark or smoke shall reach them through the power and fair devotion of Brendan the son of Finnburg. So that's how he's introduced every single one of the patriarchs and the prophets and the great fathers of the church. Come again in Brand 5th century Ireland. Yeah. So the stories of his childhood themselves are, you know, quite remarkable. And there's all the sort of the wondrous stuff that you would expect in one of these kinds of wonder tales when he. At his baptism. Three, actually, today, everybody, we're going to play my favorite game, which, as you all know, is throwing information at Jonathan that he's never heard before and then asking him to interpret it on the fly. So one of the things. I should really just send you notes beforehand."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":1330.56,"end":1331.76,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":1331.84,"end":1356.73,"speaker":"Richard Rohlin","text":"One of the things. And maybe you have a take on this, maybe you don't. Maybe it's just one of these kind of like wondrous things that happens in the story. But one of the things that happens is when he's baptized that out of the font 3. And they are three gelding rams. They're called. What's the word for that? Man, I can't remember the word right now. There's a special. There's a special word for."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":1359.05,"end":1359.93,"speaker":"Jonathan Pageau","text":"Gelding rams."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":1360.17,"end":1383.1,"speaker":"Richard Rohlin","text":"Yeah, for a gelding ram. Like an old. There's like an old English word for this. It's like waiters or something like that. Anyway, three of them come leaping out of the font, and they basically become his baptismal feast. So the idea is like you bring an offering to church when a child was being baptized, and these three rams come leaping up out of the baptismal font, which is like. Pays his baptismal fee."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":1383.82,"end":1387.34,"speaker":"Jonathan Pageau","text":"Pays his baptismal fee. And do they eat the rams?"}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":1388.14,"end":1393.46,"speaker":"Richard Rohlin","text":"I. Yeah, that's the implication. I mean, you can't do anything else with a gelding ram. Right? You, you, you."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":1393.46,"end":1394.9,"speaker":"Jonathan Pageau","text":"Right. Because it's castrated."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":1394.9,"end":1395.34,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":1395.74,"end":1397.02,"speaker":"Jonathan Pageau","text":"So, yeah."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":1397.42,"end":1399.66,"speaker":"Richard Rohlin","text":"I don't know if you have thoughts about that. I didn't even."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":1399.9,"end":1447.54,"speaker":"Jonathan Pageau","text":"I think. I think. I think that it's. It's definitely. It's related to the. The idea of the miracle of the 5000 in the sense of this notion that you kind of are able to gather out of the sea. It's something like fishing. Right. Some ways it's the idea that when you go down in the water, when the Christian goes down into the water, they bring up the fish. So like the miraculous fish of St. Peter, I think that's what it refers to. It's like Christians are able to gather new things from the waters. And so I think it's also probably related to the fact that he then finds a new land, because that new land is something that he gathered out of the chaos of the west, you know, that was able to kind of discover this new place."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":1447.86,"end":1448.9,"speaker":"Richard Rohlin","text":"Yeah, that's right."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":1449.06,"end":1454.42,"speaker":"Jonathan Pageau","text":"Yeah. So it's all related to this idea of going into the deep and then bringing out a treasure."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":1455.46,"end":1500.76,"speaker":"Richard Rohlin","text":"There's definitely a very strong association for people who aren't familiar with, like, ancient baptismal rites. In ancient baptismal prayers, there is a very, very strong association between the baptismal waters and then, on the one hand, the primordial waters of chaos over which the Holy Spirit hovers to draw creation up out of it. And then also, like, the flood. Right, the flood. And the idea of, like, the serpent in the water or the demon in the water, like there's a dragon down there. Right. And so that's one of the things that in these ancient baptismal prayers, we would ask God to actually crush the head of the serpent in the water. Right. So basically take this thing that has this potential for chaos and then make it a place of new life and where identity can be conferred."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":1501,"end":1507.8,"speaker":"Jonathan Pageau","text":"Yeah, So I think. I think that's what it is. And it's like. It's also like this idea of, like, gather. Bringing food. Like, bringing food up from the."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":1508.68,"end":1607.63,"speaker":"Richard Rohlin","text":"I think I mentioned this before, but a lot of Irish miracles are specifically food related. They have to do with a miraculous meal being provided in some way. There's a lot of other fun stories about, you know, St. Brendan, all these kinds of things that maybe you would expect in a story like this. He. When Brendan is young, he decides he wants to spend his life traveling around the island and basically learning the rule of the saints of Ireland. In other words, traveling to all these monastic communities and collecting what is their rule of life. And so he does this, and there's a lot of, you know, as he travels from place to place, he rights wrongs, he, you know, restores the dead to life. He. One of his miracles involves a man who's traveling with him who's being hunted by his enemies. And he says, go and hide under this stone. Like, it's under the standing stone, like an old pagan standing stone, says, go hide under the stone. And then the enemies come along and they look at the stone, and it. To them, to their eyes, it looks like the. This man they've been hunting. And so they strike the top of the stone off, like. And the. The top of the stone falls off as though it's this man's head. And then the man comes out, and St. Brennan says, you know, you have to do penance and become monks now. And so, you know, just like Stories like this, and a lot of them are, as usually in this kind of literature. The, the, the, the interesting thing about this kind of hagiography is that the emphasis is, is you could say the rhetorical flourish is put on extolling the virtue of the saint, but the miracles themselves are just told in this very matter of fact kind of a way, which is maybe counterintuitive to the way that most of us would write the story now."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":1607.63,"end":1608.47,"speaker":"Jonathan Pageau","text":"Right, yeah."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":1610.63,"end":1780.34,"speaker":"Richard Rohlin","text":"So, long story short, as he's traveling around, he finally comes to. So after having written the whole rule of the saints of Ireland and put together the customs and their devotions and, and this, this is sort of the, you say the mythic source for the, the rule of life that was followed by Celtic monastics, you know, is St. Brendan's rule. The same way that you have like The Rule of St. Benedict in the west or, you know, St. Basil in the east or something like that. But after he's been writing all this, he comes back to the bishop and it says he received orders from him, which is to say he's ordained, he's made a priest or a bishop. And there at that service, the gospel reading that day is the same gospel reading that seems to launch a lot of these ancient monastics on the career, which is whoever does not give up father and mother houses and lands, etc, etc. And it says that it was after this, therefore. So this is after he's kind of been traveling around Ireland and working on establishing and building up the Irish church. Ireland is his home, right? His, his parents are very devout, a very devout chieftain, and his wife, his, he has a brother, he has, his foster mother was, was this monastic woman. And anyway, so he has a family, Ireland's his home. And it says, but after he heard this gospel passage, it was after this, therefore, that there grew up in his heart a great love, the Lord. And he desired to leave his land and his country, his parents and his patrimony. And he requested earnestly of the Lord that he would grant him some secret country far removed from all men. And so at this point, Brendan starts looking for this place, for this secret country. And he starts moving, you know, more and more, you could say towards the edge of the island. And this is when he first meets a small group of monks who had once traveled to the land of the saints. And with a blessing from an angel, he is granted to undertake this task. So Brendan takes 60 men and three boats and they embark actually the story of how they get together. Originally, it's 57, 50, 56 men, 56 men, three boats. So they make the boats, and we get all the language about the making of the boats. And if you're attentive to this sort of thing, there's similarity in the language for the making of the boats, and then the. The account of the creation, the building of the ark in Genesis, but also some of the same phrases for the building of the Tower of Babel."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":1781.21,"end":1781.61,"speaker":"Jonathan Pageau","text":"Huh."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":1781.69,"end":1828.1,"speaker":"Richard Rohlin","text":"Which I just thought was very interesting. And people who've been paying attention to your work for a long time should, I think, be able to understand the similarity between these two things. But just talking about, like, bitumen and mortar and all these different things, like, there's some similarity in the language. So he gets his boat ready, and then after this, it says he saw three monks of his family coming towards him, and they fell on their knees before him and said, o Holy Father, for the love of God, let us go with you where thou goest, or else we will starve ourselves, for we have vowed to make our pilgrimage with thee as long as we live. And Brendan says, go ahead and come onto the boat because one of you is doing this out of the right motivation, and you're gonna find salvation, and the other two of you are going to hell. So."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":1833.15,"end":1834.99,"speaker":"Jonathan Pageau","text":"Does he imply that they're going to die on the trip?"}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":1835.07,"end":1837.35,"speaker":"Richard Rohlin","text":"Yeah, but not just die, but lose their souls."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":1837.35,"end":1838.59,"speaker":"Jonathan Pageau","text":"Lose their souls, yeah."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":1839.39,"end":1876.29,"speaker":"Richard Rohlin","text":"So then now he's got. He's up to 59 people, and then just as they're about to launch. You're going to love this. A jester shows up. And like a fool, like a jester, he shows up and he says, take me with you, for God's sake. Pity my wretchedness that I may go with thee. None of these, like, threats or pleadings or. Look at how pious I am. Just take me with you, for God's sake. And Brendan says, took him with him, for God's sake, and embarked in his boats with 60 men, as the writings say. And then we get some poetry."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":1876.85,"end":1890.29,"speaker":"Jonathan Pageau","text":"Now, this is when we actually last one. And it's like just before leaving, you can almost imagine that he would have, like, the scene of him, the boat's actually leaving, and like in the movies, like, he jumps on the boat."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":1890.29,"end":1914.53,"speaker":"Richard Rohlin","text":"Yeah. And I mean, again, if somebody were to, I don't know, animate this or something, you know, it's not impossible to think about future projects, maybe artistic projects. You could sort of, like, see him with his. His, you know, probably didn't wear, like, a gesture like a Renaissance jester's Cap. But you can almost see him, like, there. He's tattered and his motley is all."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":1914.93,"end":1918.29,"speaker":"Jonathan Pageau","text":"It's all spoiled, you know, Kind of ridiculous."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":1918.85,"end":1939.25,"speaker":"Richard Rohlin","text":"Yeah. And so. And you know, last guy in the boat comes at the 11th hour, right? The last worker in the vineyard. Right. And so they set out on the sea. And then we come to the next thing that you'll get to tell me the symbolism of on the fly. Are you ready? Okay. Yeah."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":1939.73,"end":1940.13,"speaker":"Jonathan Pageau","text":"Always."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":1944.15,"end":1963.19,"speaker":"Richard Rohlin","text":"Brendan bade farewell to the saints of Arran and left a blessing with them. And they sailed on due west across the ocean and saw after a while, at a distance from them, a notable fair island. And they steered their boats toward it till they reached the brink of it. And they saw the shore. What's that?"}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":1963.27,"end":1965.11,"speaker":"Jonathan Pageau","text":"I said, I know the scene, but. Yeah, keep going."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":1965.19,"end":1986.08,"speaker":"Richard Rohlin","text":"Okay, good. They saw on the shore was full of hideous furry mice as large as cats. And the brethren asked Brendan, what do yonder mice want? Said they. Their desire is to eat and devour us, said Brendan. So you have these big mice as big as cats. Now do you know what happens next?"}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":1986.88,"end":1988.16,"speaker":"Jonathan Pageau","text":"No, that wrong."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":1988.16,"end":2076.77,"speaker":"Richard Rohlin","text":"But okay, yeah, I did not. I've read the. So this is, like I said, this is an 8th century Vita. There's the navigatio, like the navigate the voyage of St. Brendan as a text. And I don't remember. Maybe it's in there. I read it last year. I don't remember the island of Mice. And I certainly don't remember the detail about the jester. So this is Isle of Mice, giant mice as big as cats. And the, The. And you can sort of like imagine they're all kind of gathered there on the shoreline. And the. The men who are with St. Brendan, they ask him, like, what's going on here? And Brendan says, they desire to devour us. And then the craziest thing happens, and that is Brendan turns to the jester and says to him, arise, take the body and blood of Christ and depart to the eternal life. For I hear the song of angels calling thee to them. And then the mind of the jester rejoiced at the saying. And he said, ah, Lord, what good have I done that I should be taken to heaven so speedily? And so he takes communion and he lays down in the boat and he dies. And it says that the jester is carried up into heaven by all nine orders of angels, carry him from the boat up into paradise. And then Brendan takes the body, throws it on the shore."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2077.09,"end":2077.57,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2077.57,"end":2078.89,"speaker":"Richard Rohlin","text":"And the mice devour it."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2078.89,"end":2080.61,"speaker":"Jonathan Pageau","text":"Okay, so now I understand what it's about."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2080.77,"end":2095.57,"speaker":"Richard Rohlin","text":"Okay, I just the last little detail, and then you can explain this one to us. It says the company, Brennan buried his bones afterwards, and his name was inscribed in the martyrology for he was a glorious martyr."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2096.69,"end":2100.45,"speaker":"Jonathan Pageau","text":"Wait, a glorious. Okay, now it's like, would you. Glorious. Smarter."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2101.64,"end":2102.12,"speaker":"Richard Rohlin","text":"Okay."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2103.24,"end":2105.08,"speaker":"Jonathan Pageau","text":"Okay. That one threw me off there."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2105.08,"end":2126.45,"speaker":"Richard Rohlin","text":"Yeah. So. So the jester who sort of lays down, takes communion, lays down on the boat, gives up his life voluntarily, and then his body is eaten by the, shall we say, rodents of unusual size. For all of my R O U s. And it's eaten by the rodents of unusual size, and then he's a martyr."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2128.44,"end":2135.28,"speaker":"Jonathan Pageau","text":"So, I mean, I. Okay, so let's start with the first part. The first part is. Is. Is. Is not obviously pretty simple, like."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2135.28,"end":2135.6,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2135.6,"end":2210.32,"speaker":"Jonathan Pageau","text":"In the sense that I think that one of the things that, you know, going. Obviously going out into the water represents is something like death. And so we'll see different images of that, different iterations of it. And the idea of the, you know, the devouring parasites, the idea of all of, you know, it's kind of like they're rats, but they could be worms. Like, they could be the things that eat you when you go down into the earth. Like, all the multiplicity kind of coming to you and devouring your body. And so the image that's being proposed here is, you know, that in death we still ascend into heaven like that. Even though your body decomposes you, it doesn't mean that that's hell like it does. Just because your body decomposes doesn't mean that that's. That that's the end of you. That, in fact, you know, it actually opens up the space for you to. To ascend. Now, I have to admit that the martyr thing through throws me off. Really throws me off. Why is he a martyr? Like, and, you know, are. So could we consider that the rats represent also like, something like the pagan nations? You know, that."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2210.46,"end":2212.94,"speaker":"Richard Rohlin","text":"That seems to be. I think that's part of the answer."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2213.1,"end":2215.42,"speaker":"Jonathan Pageau","text":"Okay, that's probably. Yeah. So it's like something like."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2215.58,"end":2222.86,"speaker":"Richard Rohlin","text":"But also like the passions. I mean, you know, like the. The oversized. You know, like these oversized rodents."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2224.22,"end":2246.73,"speaker":"Jonathan Pageau","text":"For sure. That's what they. For sure. All of these things are connected. But then if it was the passions, he wouldn't be a martyr. But if. If it's the nations, then it's something like, you know, in some ways, an image of being eaten by the lions, but being eaten by these. These savage, like, nations that are. That are gonna kill you because you're shit."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2246.73,"end":2325.66,"speaker":"Richard Rohlin","text":"You do sometimes find in Celtic Christianity. And I have no idea because I don't know what the provenance of this schema is. I have no idea if it's what's going on here, but I'll hazard this as, like, a suggestion, and that is that. That you do have in Celtic Christianity, this idea of. Have you heard this? Like the. The red martyrdom and then the green martyrdom and then the white martyrdom. So the idea is something like the red martyrdom is when you're martyred in your blood. Right. And then. But the green martyrdom is the martyrdom of the. Of the ascetic. Right. The ascetic who ultimately gives their life up to God. There's a. There's a beautiful story about this that now Saint Dimitri Staniloi tells in one of his. In one of his books about. About this Athenite monk who was so full of longing for God that he just went into a cave and just said, lord, just take. Just take my soul, just take my spirit. You know, I just want to be with you. Like, because he was in the state of perfect prayer, he said, I can't hold on to this much longer, and I need you to take me now before I sin, you know, and then. And then he just falls over there in the cave and God receives a soul. And so there's this. I mean, that's a crazy thing, by the way. Like, you know, probably most of us should not pray that prayer, but."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2328.62,"end":2331.5,"speaker":"Jonathan Pageau","text":"Yeah, because God's like, yeah, you just sinned two seconds ago."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2331.5,"end":2364.72,"speaker":"Richard Rohlin","text":"Yeah, Right. Exactly. Right, Right. Yeah. You don't want me to take you right now. Yeah. I mean, this is. This is. There's this idea of, like, the green martyrdom and then the white martyrdom is the martyrdom of basically the chaste marriage bed. Like a couple who lives a holy life in the world together and becomes a witness to holiness in that way. Right. So I think this is actually a pretty useful schema for thinking about our own lives and things, but it's certainly the case."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2365.2,"end":2369.24,"speaker":"Jonathan Pageau","text":"You would think that it would be the second one, like a green martyrdom."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2369.24,"end":2376.84,"speaker":"Richard Rohlin","text":"Yeah, maybe. But I'm not really satisfied with this explanation because that doesn't really seem to be. I. I'm just. I'm really just like, you're just trying."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2376.84,"end":2380.28,"speaker":"Jonathan Pageau","text":"To figure out how there could be other types of martyrdom. Yeah, you know?"}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2380.44,"end":2388.2,"speaker":"Richard Rohlin","text":"Yeah, but I don't think that's the key. I don't think that's the case here. I think that something. Something about his his body being devoured. Devoured by the mice."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2388.6,"end":2399.08,"speaker":"Jonathan Pageau","text":"So one of the things you could understand, like, if you think of it like, I mean, just narratively, if you thought of it as this is a test that they have to get through."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2399.16,"end":2399.6,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2399.6,"end":2439.65,"speaker":"Jonathan Pageau","text":"And so basically it's like a barrier. There's. It's like a, you know, they come to the barrier, they have to defeat the boss in like a video game before they go to the next stage. And that in some ways almost like someone has to be offered up to these mice for them to continue on. Like someone has to be eaten by the mice before they continue on. Who is it going to be? The last one? The last one is martyred in that sense because it's. He's willing to let go in order for the boat to continue and to be martyred for. I mean, this is. Now we're in fantastical. Like we're obviously because, I mean these stories are always really quite fantastical. But that might be a way of understanding the idea that he's a martyr."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2439.73,"end":2469.72,"speaker":"Richard Rohlin","text":"Yeah. One of the things that it mentions here also is to say herein is the kindness of the Lord, that the sinner who came last to the ship should be chosen of him to go first to heaven. Right. And so it's interesting, like even St. Brendan, who's this great saint who has this desire to see paradise, he's got to go on the seven year voyage. Right. But the, but the fool who showed up at the last minute, he's just taken."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2470.92,"end":2479.16,"speaker":"Jonathan Pageau","text":"Yeah. And then for sure, that's definitely got to be some connection to the idea of the, of the workers. Like the parable of the. Of the. Of the workers."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2479.65,"end":2482.61,"speaker":"Richard Rohlin","text":"Right, Exactly. I think that's. Yeah, that's, that's, that's for sure."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2483.17,"end":2487.29,"speaker":"Jonathan Pageau","text":"So still really muddy. Like very odd."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2487.29,"end":2514.61,"speaker":"Richard Rohlin","text":"It's still. Yeah, I. This is one of those things. I actually kind of wonder. I need to go back and look at the, the version of the navigatio that I've read before because I actually wonder if this is a case of one of those things that Martin was talking about in your last video together where he said, he said think about. Or maybe you said this one of you said this is like, think about the part of the story that you can't remember. And that's the part of the story I don't remember which one of you said it."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2514.61,"end":2516.05,"speaker":"Jonathan Pageau","text":"Yeah, I think it was."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2516.05,"end":2544.51,"speaker":"Richard Rohlin","text":"Yeah, it was really helpful for me though, because there are even parts of the Gospels. I mean, I've read the Bible probably over a hundred times cover to cover. And you know the Gospels, like how many times have I read the Gospels? And there's still parts of the gospels that I can't remember with exactness because they're so, so strange. And I'm wondering if this was in there before. And it was so strange, my mind just said, I'm gonna delete that. I have no idea what the big rous are about."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2544.67,"end":2546.67,"speaker":"Jonathan Pageau","text":"There's no hook for this in my memory yet."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2546.67,"end":2547.39,"speaker":"Richard Rohlin","text":"Yeah, no. Yeah."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2548.11,"end":2560.98,"speaker":"Jonathan Pageau","text":"We'll continue to meditate on it. Hello there. This is Martin Shaw inviting you to come and join me for Christian Wonder Tales, my first online course with Symbolic Wonderful world."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2562.02,"end":2564.18,"speaker":"Richard Rohlin","text":"It is a secret history of things."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2564.26,"end":2588.33,"speaker":"Jonathan Pageau","text":"That we're going to be exploring from the early Celtic saints and heroes of antiquity all the way up to the chivalric tradition of Arthur, Round table, Merlin, the whole thing. What do stories like that have to tell us about the mosh pit of our own modern lives? Well, over four gatherings, we're going to find out. I promise you this."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2588.73,"end":2589.53,"speaker":"Richard Rohlin","text":"It will not."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2589.77,"end":2652.28,"speaker":"Laura Diaz","text":"Tucson, the weight is over. Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight and serious risks. At mediweightloss, I got the same medication, but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweightloss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com pack up though."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2653.08,"end":2680.77,"speaker":"Announcer","text":"Because Chevy SUVs have the capability to take you to some incredible places. Like an adventure in the middle of in the equinox, Active, an SUV that will help you get away with confidence. Or head off for a night in the in Chevy Traverse with all the tech you need to stay connected while the undeniable value of. Of Chevy. Tracks will keep you moving from here to over here to way over here. Get to all the places you want to be with Chevy SUVs. See Watson or O'Reilly Chevrolet."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2681.09,"end":2904.43,"speaker":"Richard Rohlin","text":"Be boring. Okay, so this is the thing, guys. We're not going to get through the whole voyage of St. Brendan because that was literally just the first weird episode. So the next episode has to do with the story of the island of the bridals. And I won't read the whole thing here, but essentially what happens is they show up and there's a. There's a hermit on this island, and he's really, really happy to see them. And St. Brendan says, we can't trust this hermit, you know, but he basically brings them. Brings them into this house. And they come into the house and the house is full of. It says, indescribably long and wide with many chased vessels. And this is probably a culturally specific reference here. And. Well, maybe not. Maybe it's symbolic or both. And gold mounted bridles. So there are these. These bridles, like, you know, like for a horse that are. But they're really rich and they're like, you know, chased with gold and things like this. So they come into this hall. The idea is like. It's like this big chieftain's house. And there the food is really good. There's a board spread with a covering of all various colors, bread of strange whiteness and a quantity of excellent fish. And so St. Brennan blesses the food. They say a prayer. You actually get kind of this old Celtic blessing prayer in the. In the. In the text, actually, which is lovely. And then they sit down and he says, okay, we need to pray our hours. And so they do prayers and. But whenever they fall, as when they fall asleep, Brendan stays awake. He stays vigilant in the hall, and he sees the hermit, their host, as this evil spirit who's walking around and takes one of the golden bridles and says. And throws it into the bosom of one of the brethren. And this is one of the three brothers who showed up as the late to the ship, right? So now we know what's going to happen to this guy, right? And so they start to leave. And one of the things that St. Brendan told them when they arrived on the island is. Is you can't steal anything, even the water. And so when they get ready to leave, they get on the. They're getting on the ship and Brendan says, we can't get on board because one of you has stolen something. And they all say, you know, forbid, dear Father, any theft should stay in our journey. And Brendan says, there's a golden bridle under the armpit of the brother of whom I spoke to you last night, and a theft which the devil gave him. Then the brother heard this. He cast the bridle from him and prostrated himself before Brendan and said, o beloved Father, I have sinned beyond doubt, but pity me and pray for my soul, that my soul and body be not damned. And then Brendan basically expels the demon from the island and tells him not to torment another human being until the day of judgment. So they're at least down by one now. And then Brendan says to the brother who stole the bridle, so remember a moment ago, I said, now we know what happens to this guy. Surprise, surprise. This turns out to be the brother who is saved, because Brendan says to him, receive the body and blood of Christ, and then your soul is going to depart from your body, and you're gonna be buried here on this island. And the brothers who came with you from the monastery, their resurrection is going to be in hell."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2905.39,"end":2906.75,"speaker":"Jonathan Pageau","text":"He repeats that again."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2907.07,"end":2923.35,"speaker":"Richard Rohlin","text":"Yeah, and so he's a rough team here. This is a rough team. So he takes communion and he dies, and he's buried. And that's the one of the three who. That's the one of the three who. Who."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2923.35,"end":2947.23,"speaker":"Jonathan Pageau","text":"All right, we're seeing. We're seeing. So we're seeing a few things going on. One of the things is that this is definitely decidedly a contrast to the other island. On the other island, you had a bunch of rats that are going to eat you, and here you have a bunch of bridles without animals. You have things that are meant to control animals. So a principality, basically, the idea of a spirit or something. Something."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2947.55,"end":2949.63,"speaker":"Richard Rohlin","text":"Think about that. That's great, though. Yeah."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":2949.79,"end":3011.86,"speaker":"Jonathan Pageau","text":"Something that is. And that it has a royal. There's a royal element to it. Like, you know, it's like all these. These very fancy things. And so you kind of get these two opposites, you know, let's say, looking at each other. And so, interestingly enough, the. You know, the spirit is trying to. So the. The animals want to eat the person, and then they ultimately are given the person to eat, but not before they're saved. And now this. This guy, what he wants to do is he basically wants to, let's say, infiltrate or. It's like he's like his hidden power. He wants to impose his hidden power on the group, and then he fails. But nonetheless, the person who participated that it's to his salvation and he stays there and, and is buried there. Does it say that the. That the. That the fool is buried on the island with the rats?"}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":3013.54,"end":3014.02,"speaker":"Richard Rohlin","text":"Yes."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":3014.66,"end":3046.23,"speaker":"Jonathan Pageau","text":"Okay, so. So then I think what you're also seeing is a kind of salvation of these islands. Like, you're basically seeing these islands being colonized for Christ for all intents and purposes, by bearing a saint there and making them, like transforming them. And so you see that. So they satiate the rats and then they can go there and bury him there. Then they chase the demon away and then they are able to. And so I think we're also seeing a type of spiritual colonization of the wild world."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":3046.95,"end":3132.77,"speaker":"Richard Rohlin","text":"That's. That's such a good point. And the. There is definitely. I mean, this isn't all Christian, like ancient Christian traditions. Okay. This idea that, that you have to build a church on top of a saint, like on top of a martyr, on top of somebody who, you know, who has been shown to be a holy person. There are some extreme examples of this in Celtic storytelling, some of which are like, almost like too dark to tell. I have. I had this one story, I was telling Martin about it back in February. I have this one story that I've been trying to write about one of these instances which I've never been able to finish it because the actual story is terrifying and dark. But it's based on this idea that you have to build a church over a Christian body, basically. And this does seem to be in some ways an inversion or transformation of the old. So in some pagan societies, including the Irish, there's this idea that if you're going to build a building, you have to bury somebody alive under the foundation of the building. It's basically like to appease the old gods of the land, you have to bury somebody under the foundation, usually a slave. Right. And so what happens with the Irish church is that the slaves of Christ give their life, they give their bonds."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":3133.13,"end":3150.01,"speaker":"Jonathan Pageau","text":"To the land to become the foundation for civilization. Yeah, yeah. The idea that civilization is based on sacrifice is something that most people have understood and like you said, embodied it in the weirdest, surprising ways and sometimes very dark ways. But, you know, the Cain and Abel story is not right."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":3150.01,"end":3150.33,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":3150.33,"end":3169.1,"speaker":"Jonathan Pageau","text":"Not ridiculous. The foundation of Rome is. All of these. These stories are. Have to do with the idea of a kind of human sacrifice before the foundation of a city. And so I think you're probably right that in some ways it's showing how Christ transformed that through self sacrifice. And that that is actually how you found the right type of city."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":3170.06,"end":3377.21,"speaker":"Richard Rohlin","text":"Maybe. I'll tell you the other story later. I mean, people who are in the know can probably guess what it is, but I'm not gonna. I'm not gonna tell it today because it's. It's a little dark and I don't want to get distracted. But. So the next island. The next island is. Oh, the other thing I should mention is that as they're leaving the island of the Bridles, a young man comes up to their ship and it's very obvious. The young man is Christ. It's like this beautiful youth comes up with like a basket of bread and a vessel full of water. And he gives it to them and he says, this is going to last and you won't need anything else until Easter. Then they sail away, right? And so it's kind of like it was originally, like, don't steal anything from the island, even the water. And now that they've kind of passed the test of the island, they're given the water and the, the bread that they need for their journey. Now, one of the main preoccupations with. Of the. Of the voyage of St. Brendan is how the, how the. Say, how do you keep the liturgical calendar when you're in three boats out in the middle of the North Atlantic, right? And so we get a lot of detail about, you know, they arrive at this island just in time for Easter, and then they're given the things that they need to celebrate Easter there by a hermit. And then. And then they travel on to an island called the paradise of Birds, which is. Which, of course, is where they celebrate Pentecost. Where else would you do that? And there's a ton of stuff in here about certain sheep on certain islands and what makes the sheep grow big and all this different stuff. And it's like, we probably like every single one of these things. There seems to be something about the animals that you meet from island to island. And so this island, which is where they celebrate Posca, right, is full of sheep, right? But the sheep are as big as cows, right? And they're. And they're docile. They follow the monks around and there's definitely like, this is kind of a paradisical place already. And this is where they celebrate. This is where they celebrate Easter, and that's where they receive the. It even mentions them doing like the foot washing service and things like that. But that's where they celebrate Easter and that's where they receive provisions to go on their way. They get to the island of Birds and there's so many. So many things that I could talk about here. You know, the last thing that is maybe. Oh, my gosh. So I hate to make a two parter, especially when Martin's going to talk about this in his course, but. So let me just put this out here as like maybe the. Okay, let's do two more. Let's do two more. Every single one of these islands, and there's several different islands because Brendan makes multiple voyages, and each voyage is like a certain number of years. And, you know, you get these different islands and these could be like, you know, various legends that people put together."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":3377.29,"end":3379.37,"speaker":"Jonathan Pageau","text":"You know, it's not just one voyage."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":3380.89,"end":3394.57,"speaker":"Richard Rohlin","text":"Not just one voyage. That's right. There's the isle. There's the Isle of Dwarves. There's the boy. The island of Paul the hermit, you know, from Egypt. There's the story of."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":3395.13,"end":3396.01,"speaker":"Jonathan Pageau","text":"On an island."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":3396.57,"end":3405.05,"speaker":"Richard Rohlin","text":"Yeah. Paul the hermit's on an island, like, alive. Yeah. There's. There's so many."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":3405.21,"end":3406.49,"speaker":"Jonathan Pageau","text":"I never. I don't remember any."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":3406.49,"end":3432.06,"speaker":"Richard Rohlin","text":"There's so many crazy things. There's. There's the. The island that is like the. The. Okay, I'm gonna give you dealer's choice here. I'm gonna. Or not. Dealer's choice. This would be opposite of that. All right, so you get your pick. Do you want to do. Do you want to do the story of the Isle of the Demon Smithy, or do you want to do the. The story of the island of the Intoxicating Waters? Like it's making a."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":3432.06,"end":3433.1,"speaker":"Jonathan Pageau","text":"Choose between those two."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":3433.1,"end":3433.7,"speaker":"Richard Rohlin","text":"I know."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":3434.26,"end":3436.5,"speaker":"Jonathan Pageau","text":"I like the. I mean, obviously the demon smithy wins."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":3436.5,"end":3598.32,"speaker":"Richard Rohlin","text":"Oh, we got to do that. Yeah. Okay. All right. So as Brandon was traversing the ocean, he saw an island near him. Hideous, dark, mountainous and rocky, with a rugged summit without trees or herbs, full of houses like forges. So they get close to the island, and Brendan says to the brothers, I'm afraid of this island for your sake. It's not my will that we would go there if we could avoid it. But the wind is driving us straight towards it. So when they're no more than a stone's throw from the island, they hear the thunderous working of the bellows being blown, the clang of the hammers as they smite the anvils, and great fear seizes them. And of course, the monks all make the sign of the cross Lord Jesus Christ delivers from the folk of this island. And it says, after this, they saw a couple hideously black, like the color of a smith's coal, coming out of the forges. As if they were going to do some work or other. And when they saw God's people, and I should say, by the way, this is a little like each of the islands gets more extreme. Like there's a. There's definitely a progression. Like the first two are, you know, like there's some clear symbolism at work. And as we get further and further out. So this is. This is like island number 39 or something in the. In the chain, right? So they see these two demons coming out of the forge, and when they see God's people, they turn back again into the forges and brought out two charges of molten iron, red hot, which they held with tongs in their hands. And rushing eagerly to the shore, they cast them at the boat. This did no harm to them, for such was not God's will, for they passed over the head some distance beyond the boat. After this, God sent a following wind to Brendan's company from the side of the island. And out of the same forges there issued an innumerable hideous and diabolic band carrying fiery charges, like these molten bits of metal to cast at them. And basically they continue to sort of charge these until it makes the sea boil. And it says the cries and shrieks they uttered were heard after they were out of sight. And then basically the sea boiling creates this tide that kind of pushes Brendan and his ships away from the island. And that's the. That's the story. Like, it's. It's this. It's. Again, it's just very, very strange. And it's kind of like this, like, volcanic island with these demons working forges. You know, there's like, shades of Vulcan or Hephaestus there, and even all the relations that. That. That has would have had in the Irish mind to like, purgatorial imagery which we talked about previously."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":3598.81,"end":3608.09,"speaker":"Jonathan Pageau","text":"I mean, it all makes. It all makes sense. Okay, so, question. So you said there's that island with Paul, with the."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":3608.17,"end":3608.81,"speaker":"Richard Rohlin","text":"Paul the Hermit."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":3608.81,"end":3648.35,"speaker":"Jonathan Pageau","text":"Yeah, Paul the Hermit. So for people who don't know, some people might not know, but in the legend of St. Anthony, in the story of St. Anthony, there's a sense in which we tend to think of St. Anthony as like the first hermit saint. But in his story, there is this mysterious character called Paul the Hermit, who is already like a hermit. He's basically a monk before monks. He. Yeah, and he. The end. His origin, no one knows what it is. Like, we don't really know what his. You know, how he became a monk. He's just a monk and he's there, and Anthony learned from him. And so it's just. It's just fascinating that they would integrate that into the story of the."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":3648.35,"end":3668.56,"speaker":"Richard Rohlin","text":"Yeah, that's definitely an Egyptian link. Oh, so. So there's something that I should. I did a bad job telling the story of the devils with the molten metal. And the reason I did a bad job is because that story is related to the torment of Judas. And I know you're going to want to hear about this. Okay, let me see if I can."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":3668.56,"end":3669.76,"speaker":"Jonathan Pageau","text":"This is one of the islands."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":3669.76,"end":3793.01,"speaker":"Richard Rohlin","text":"This is one of the islands, right? So they're voyaging on the sea. They leave one island where they lose one of the guys, and they get onto this next island, and they see what appears to be a man, like, on a rock. Like, just on this rock out in the middle of the ocean. And one of the guys says, that's a bird. And Brendan says, no, no, no, let's get closer and see what it is. And so they get closer, and they see a man sitting on the stone and the likeness of a cloak or other garment suspended on two iron forks before him. So there's like, these two iron forks, and they're holding some kind of a garment before him, and he's being tormented among the waves. The cloak basically, like, whipping in his face, smiting him under the eyes. He's being dragged off the rock. He's being tossed onto it again by the waves, all these different things. And Brendan says, what's going on? And who are you and why are you being tormented this way? And he says, I'm that evil Chapman, Judas, who delivered the Lord Jesus Christ into the hands of the Jews. But it is not this place, which is my requital, but by the mercy of the Lord, and in honor of the resurrection, I have this ease. So this is on. On Paradise. This is on Easter. So on Easter, Judas gets let out of hell, and he's on this rock and he's still being tormented. But it's not quite so bad, by the way, this idea of, like, a refrigerant, like a little break for the souls in torment on Easter is a pretty old belief, certainly a minority tradition, but it's something you find in, like, a lot of apocalyptic literature, like the visio poly and things like that. And it's usually, like, the virgin Mary or St. Paul or somebody intercedes for the damned, and they're given, like, kind of, like a day off. Again, this is not a dogmatic teaching of anybody's church. I just need to be really clear about this. So I don't get canceled. But this is like a traditional thing in certain, especially in monastic literature."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":3794.37,"end":3809.65,"speaker":"Jonathan Pageau","text":"It's a beautiful image in the sense that it is a glimmer. Right. A glimmer that the resurrection and that ultimately the final moment or the final resurrection holds some mysteries that are not as obvious as we might think."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":3809.65,"end":3816.07,"speaker":"Richard Rohlin","text":"Yeah. And what Judah says is that this state is like being in paradise compared to my state in hell."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":3816.15,"end":3816.79,"speaker":"Jonathan Pageau","text":"In hell?"}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":3816.79,"end":3851.76,"speaker":"Richard Rohlin","text":"Yeah, yeah. And. And he says, and compared with what will be inflicted on me this night on the fiery mountain, where is Leviathan and his companions and where the brother was snatched from you. So this is referencing the previous island. It says there they assail me, that is. And it says I am smelted like lead in an earthen pot. So there's a connection between this and the. The island of the demon smithies. Right. I'm smelted like lead in an earthen pot. And I was with them when the brother came to them. That's the second. That's the brother that got snatched. That's the third of the three that showed up late. So there's the one."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":3851.76,"end":3854.4,"speaker":"Jonathan Pageau","text":"How did they die? Tell us how the two monks died."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":3854.4,"end":3867.47,"speaker":"Richard Rohlin","text":"Alright, so one of buoy, I'm gonna have to remember this. Well, one of them gets snatched away by demons and basically thrown into lava. And I don't remember how the other one dies right now. But anyway, they both come to bad ends."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":3867.87,"end":3871.87,"speaker":"Jonathan Pageau","text":"They're like, yeah, you know, Renan says that we should still go on this trip, you know."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":3872.43,"end":3892.29,"speaker":"Richard Rohlin","text":"Well, the thing is like, let's be honest about ourselves and say, like, if you show up, if you show up with like two of your buddies and the holy man that you want to travel with, and you're like, we're going to starve ourselves to death if you don't let us on your boat. And the holy man says, sure, one of you is going to heaven and the other two of you are going to hell. A lot of us would be like, I'm obviously the good one."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":3892.45,"end":3896.69,"speaker":"Jonathan Pageau","text":"Yeah, but once the guy goes to heaven, the other should have seen."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":3896.85,"end":3899.81,"speaker":"Richard Rohlin","text":"Well, at that point you're on the boat, man. It's like, where else are you gonna go?"}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":3899.97,"end":3901.09,"speaker":"Jonathan Pageau","text":"Where are you gonna go?"}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":3901.57,"end":3979.02,"speaker":"Richard Rohlin","text":"Oh, yeah. So he says, there they assail me. I'm smelted like lead in an earthen pot. And anyway, so. And then he says, oh, and of course we need to figure out, why does Judas get this? Why does he get this little reprieve? So Brendan says, what's the garment which Smites thee under the eyes. And Judas says, it is a garment which I gave to a poor man out of the portion of my Lord when I was his chamberlain. So remember that Judas had the purse. He's in charge of distributing the alms. But as it was not mine to give, it turns to my loss now and not to my ease. And the stone on which you see me sitting is a stone which I laid down on the public road when I was in the secular life before I became a disciple of the Lord. So this idea of here are these things that Judas did in his life, and it's like the story of the onion in Dostoyevsky, you know, except that it's not because Judas was a thief. He had the purse, you know, all these things. But even the things that he did distribute were not actually his to distribute. Right? Yeah."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":3979.02,"end":3992.94,"speaker":"Jonathan Pageau","text":"It's related to the. It's related to the servant, like that story that is so hard to understand. The servant that gives away his master's debt. That gives away the debt even though it's not his to give. And then. And then he."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":3993.1,"end":3993.46,"speaker":"Richard Rohlin","text":"He."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":3993.46,"end":3995.42,"speaker":"Jonathan Pageau","text":"He's, like, shrewd because he does that."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":3995.58,"end":4000.62,"speaker":"Richard Rohlin","text":"Except in this case, this. This is like his reprieve, but also it's his torment at the same time."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":4000.62,"end":4001.9,"speaker":"Jonathan Pageau","text":"Both at the same time."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":4001.9,"end":4002.38,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":4002.46,"end":4005.74,"speaker":"Jonathan Pageau","text":"Right. I mean, very, very mysterious."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":4005.82,"end":4060.23,"speaker":"Richard Rohlin","text":"This stuff is. This stuff is very, very strange. And how many of these islands are there? Man? I don't even know because there's so many of them. I haven't, like, sat down and counted them. I should have. I should have counted Jonathan. Yeah, yeah, but I was. I was really just trying to, like, immerse myself in the story. But there's so many different things. There's the island with a giant griffin on it. There's. You know. And then eventually, you know, he finds the Land of Promise. And. But. But the whole story of just the Land of Promise itself is so long, we'd have to do a video on it. Like, just a video on it. And maybe we will. The. The. Maybe the last thing. Well, I'll mention two things. One is just to further scandalize people in case they're still watching this video at this point. When the demons show up to torment Judas, St. Brendan tells them to leave him alone."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":4060.47,"end":4062.55,"speaker":"Jonathan Pageau","text":"Yeah. Give him his day of reprieve."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":4062.79,"end":4136.7,"speaker":"Richard Rohlin","text":"And Brendan says. And the demons say, why do you invoke the name of the Lord on behalf of yonder man when it was he who delivered up the Lord to cross and passion? And Brendan just says, leave him alone. Wow. And then when they leave, the demons curse Brendan. They say, o servant of God, accursed be thy journey to us because our Lord treated us with contumely because we have not yet exhibited him his special servitor. And Brendan says, your curse shall be turned into a blessing for me, for whoever you curse shall be blessed, and whoever ye bless will be accursed. And then the demons are like, well, as soon as he gets back in here, we're gonna torture him extra, just to show you. And Brendan's like. I mean, there's this long exchange of smack talk between Brendan and the demons. But what Brendan basically tells them, tells the demons is, you don't have power even in hell, so you're going to torment him exactly as much as God allows you and no more. And it says, nevertheless, the demons were bound to fulfill the commands of Brendan. So that is. That is a story, man."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":4137.1,"end":4142.51,"speaker":"Jonathan Pageau","text":"That is some wild stuff. And so. And so then the final land is the land of promise. We'll do a video on that."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":4142.51,"end":4142.91,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":4144.67,"end":4156.91,"speaker":"Jonathan Pageau","text":"I have a question. Like, I. Actually, it's such a weird thing that I'm asking this, because in some ways, the last person to try to mix these types of stories with more historical considerations. You know what I'm gonna ask."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":4156.91,"end":4157.87,"speaker":"Richard Rohlin","text":"I know what you're gonna ask."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":4158.59,"end":4181.52,"speaker":"Jonathan Pageau","text":"So there. There are people that have surmised the possibility that in fact Brendan, you know. You know, that obviously the story of Brendan, although some of it is somewhat fantastical and accumulation of legends, that it is based on something that's real in the sense. Real in the sense of historical. Like that actually this is something that happened. And that. That. The possibility that Brendan came to. Yeah, to the big land on this."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":4181.52,"end":4560.58,"speaker":"Richard Rohlin","text":"Side, obviously, the land making. Making Canada paradise is what you're trying to say. Right. So I think there could be something to that. And certainly, like, people have proven that it's feasible. Now, when you think about, like, the multiple voyages and what's the. What's the meaning of these different islands and things like that. It's obvious that Brendan is moving through myth. And I'm certainly not the kind of person. You know, I'm absolutely the wrong person to tell you all of these things are just only allegorical because I think they're much stronger than that. And there's definitely the sense of wildness. I think that if it's true. And again, I think there's no reason to doubt that it was doable and that it was possible, that if it's true and that the land of promise that Brendan made his way to is in some way like North America. There are some interesting implications for thinking about the symbolism of what it means to be a North American, because certainly Brennan probably didn't wash up in Florida. So I'll say North American, not American. But there's something interesting there. I want to talk about that more next time because there's two things that I want to say to kind of close this video out. I know it's been a little long. One is that the story of St. Brendan's life doesn't end with his finding paradise. Because when he finds paradise after a seven year voyage and then a second voyage after that, he comes back to Ireland and he spends the rest of his life working miracles and building monasteries. And we'll cover all of that. I think we'll just have to do another St. Brendan video. I think that's the best way to do this because we haven't even talked about, you know, celebrating Pascha on the back of Leviathan and like all the other great things from the Navigatio that we haven't had time to cover yet. So we'll do that for our next video. But the thing that I want to point out is that Brendan has this desire for paradise which causes him, which motivates him to forsake the world and to move in, to begin to move towards paradise. And along the way, what you have happening is this winnowing, right? And so we lose this brother to this thing, we lose this brother, this thing, and some of these guys go to paradise and some of them go to hell. But Brendan doesn't get to die, right? And so there's this winnowing that happens which is in. It's the winnowing of Brendan's soul, the winnowing of our soul, right, as we undertake this journey. But the thing that it eventually results in is for Brendan, as one of the twelve apostles of Ireland, to found the Irish church and to establish the Irish people. And those are parts of his story which most people have forgotten. The stuff in the voyage is the weird stuff. That's what people remember. But in the earliest lives of Saint Brendan, the voyage stuff is kind of, I wouldn't say hand waved, but it's not even emphasized to the same degree that Brendan's work as somebody who created Irish civilization, Irish culture is. And obviously we usually think of St. Patrick in that role, but St. Brendan is one of the other people who has that role for the Irish people. And so it's a way of seeing the way that our longing for paradise and desire to forsake this world paradoxically results in saints who establish the world. When you say something like, the saints uphold the world, this is what that means. And if we're going to be that kind of person, if we're going to do that kind of work, and I'll say, you know, whatever church you find yourself in, certainly if you're an orthodox Christian in America today and you're really struggling with the whole convert thing and you're really struggling with the whole enculturation thing, what I want to encourage you to do is actually pump the brakes a little bit on the enculturation. I joke, and I think some people took it too seriously and freaked out a little bit. But I joke about someday when there's the Autocephalous Church of Texas and Guacamole has replaced hummus as a Lenten dip of choice, right? You know, I joke about, you know, what will that, you know, what will that be like? But the truth is that we need to pump the brakes a little bit on worrying about all of this stuff. And, like, is our music really American yet? And, like, all this stuff and, you know, and I'm not against those attempts, some of them are quite beautiful. But for the most part, you know, we can afford to be a little less agitated, a little more trusting in God, but also, first and foremost, I mean, fundamentally focused on the life of prayer and asceticism that we're called to as Christians. Father Seraphim Rose. One of my favorite things about him, and this is something that I heard around the celebration of his repose last year, is that after he died, they go in and cleaning out all those things, and he has. He's. He's a prayer book, you know, just, you know, like. Like, I don't know if it's exactly the same, but like one of the little red Jordanville prayer books, basically, you know, nothing. You know, every. You know, that's part of your ortho bro starter pack, right? But he's got this prayer book. But the prayer book is. The pages are stained yellow with use. They're wrinkled from the continual falling of his tears. On the pages, they're stained with wax from, you know, just years and years of just using the same prayer book, praying those prayers and weeping over his sins, right? And I think he's really become a symbol for a lot of us who have converted to the orthodox faith, and I think rightly so. But the thing that we need to remember about him isn't just like his huge literary Output. It's his life of prayer and his life of repentance. That's where enculturation begins. Right. Don't worry about baptizing the culture. Just baptize your kids and trust the church."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":4560.9,"end":4573.14,"speaker":"Jonathan Pageau","text":"Yeah. So that's great. That's a great call. That's a great call. And I can't wait to learn more about the voyage of Brendan. It's funny because I think I know the story, but you're right, there's so."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":4573.14,"end":4574.9,"speaker":"Richard Rohlin","text":"Many parts of it that just don't stick to mind."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":4574.98,"end":4580.66,"speaker":"Jonathan Pageau","text":"The virgins that I've encountered have been, you know, just shortened for consumption."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":4580.66,"end":4597.2,"speaker":"Richard Rohlin","text":"Like a lot of people just focus on the. Just focus on the voyage as well. Well, and they don't know about the other stuff. And I think some of the weirder stuff in the voyage in the older sources, some of that got weeded out over time because people were like, it's too weird. I don't know what to do with it. But I promise to always find the weirdest stuff for you, Jonathan."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":4597.6,"end":4620.89,"speaker":"Jonathan Pageau","text":"There you go. That's what we need. And as Richard said, I would say, always remember how identity functions for Christians and that self sacrifice is the core. But it is affording of life. Right. It doesn't actually. It's. That's. That's the surprise of. Of Christ we have to stay attached to. So thanks everyone and we'll talk to you soon."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":4620.97,"end":4621.29,"speaker":"Richard Rohlin","text":"Bye."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":4621.29,"end":4621.49,"speaker":"Jonathan Pageau","text":"Bye."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":4621.49,"end":4622.09,"speaker":"Richard Rohlin","text":"Talk to you soon."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":4622.25,"end":4663.31,"speaker":"Laura Diaz","text":"Tucson, the weight is over Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication, but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":4663.31,"end":4663.46,"speaker":"Richard Rohlin","text":"And."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":4663.61,"end":4685.33,"speaker":"Laura Diaz","text":"And the cost. The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better, and lose weight the right way, mediweightloss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com looking for your next Go."}
{"episode_id":"SW - #366 - 2024-11-25 - Richard Rohlin - Universal History - The Voyage of St. Brendan","start":4685.33,"end":4750.62,"speaker":"Announcer","text":"To Smoke Shop Stop scrolling. I've got you. Headshop.com is the one online smoke shop already trusted by over 100,000 happy smokers just like you. They've got it all. Dab rigs, vaporizers, glass bongs, smoking pipes, even thca flower all in one place. Need a new daily driver? Grab a smooth glass bong or a classic smoking pipe. More of a concentrate fan. Their dab rigs, E rigs and wax accessories are designed for smoother, harder hitting sessions. And yes, they've even got got legal THC flower. Best part? Every order ships fast and discreet, which is why thousands of smokers keep coming back. So don't waste time hopping between shops. Shop the best in dab rigs, vaporizers, glass bongs, smoking pipes and THC flower right now@headshop.com the number one online smoke shop, headshop.com has what you need. Check it out today. Oh, and because you're listening right now, you get 10% off your next order when you use the coupon code HSHOP at checkout. Go to headshop.com now and smoke smarter."}
