{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":12.56,"end":80.18,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. Hello, everybody. I am very excited to be here with Eugene Vodoletskin. Eugene is in many people that I've talked to, many authors, Christian authors that are here in North America or in Europe. He is really seen as paving the way for the future of storytelling, the future of Christian storytelling. His book Loris has made a massive impact on anybody who is attentive to culture and also to, like I said, Christian narrative and how it is possible to tell stories today. And so I'm very excited to look at his book because many of his themes connect with my themes. This idea of the edge of the world, the notion of a universal history. All of these things we will be exploring together in this conversation. Eugene, thank you so much for taking time to speak to me from Russia right now."}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":80.82,"end":83.14,"speaker":"Eugene Vodolazkin","text":"Thank you very much, Jonathan, for your invitation."}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":83.86,"end":183.47,"speaker":"Jonathan Pageau","text":"And so the novel Lores is really amazing. It really is an amazing story, and it connects both this ancient vision of reality, but it also seems to, at least in some aspect, it seems to be talking about working out through the difficulties of postmodern society. So we can see these images at the outset of the novel where the main character is made aware of these geographic limits of the world, these monsters, the cynocephali, the dog headed monsters, St. Christopher. We also hear of the voyages of Alexander. All of these references set up the narrative as an exploration of the limit. The context is not just this idea of this limit in space, but also in time, because the whole book is layered through this idea of. Of the end of the world, or the different ends of the world that layer themselves on top of each other. And whether we see this in this prophetic vision, whether it's the facing of death, but also even in the narrative elements itself, we see a breakdown of coherence of which the main character goes through himself. So this breakdown in a linear way of speaking, even goes as far as using anachronisms in the story, where you see things, impossible things, coming from the future, from the past, melding together in the same moments. And so all of this really struck me tremendously about the book. And it made me curious about how you feel that Loris is not just dealing with something which happens in the late Middle Ages in Russia, but also dealing with our current cultural moment."}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":185.47,"end":456.61,"speaker":"Eugene Vodolazkin","text":"Well, thank you very much for your good words about my novel. In your question, you rightly speak about the limited space and time, about the borders, and the border place, a certain, I would say, very important role in my novel here. So we recall we can recall another concept that is associated with finitude. Actually, this concept calls border. And finitude is a border. The border is not only what separates. The border is also something that indicates interaction, because it is possible to interact only with. With a person or with a country, or with a culture that is near you, that is in direct contact with you. And if we talk about the current state of the world, then we can. Then it has come to the point where borders are disappearing between states, between people. So at first, the first look, that is, there is nothing wrong in this. But if you will look more closely on this problem, with the loss of boundaries, differences disappear. Differences between cultures, between people, between individuals. And it was actually this stage that coronavirus pandemic emerged. You know, pandemics have occurred before, it is known, but the world has never been completely closed. I have a strange feeling that the current pandemic has been used by the world to rebuild borders. I don't think that it is a conscious process, rather it is a collective unconscious. And it is a great problem. But I try to say about it in a few words. And so maybe you will ask more on this problem. But what I want to say, I will come back to my novel. The Russian thinker Mikhail Bakhtin called the space time system a chronotope. My characters, they transcend both space and time. It is funny, but one of my students, a girl, she wittily said that in this sense, Lorus is a chronotopleth. Because my protagonists, they do with space and time. What do they want? They try to destroy both of them, but they overcome boundaries for universal. Universal unification. Not for universal unification, but they overcome them metaphysically, that is, they go. Whereas there is neither space nor time. And in this quiet overcoming of borders differs from the overcoming which we call globalization."}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":458.61,"end":531.69,"speaker":"Jonathan Pageau","text":"Yeah. In Loris, it's very interesting because you seem to juxtapose, on the one hand, a confusion. There is a sense in some places where there's a confusion of linearity and there's a confusion of space and time. But the character seems to be moving towards exactly this transcendence which you speak of. There's a moment as if it almost feels like he is losing himself in those moments where his memory is broken and he had this injury, but then he comes out of that moment and then moves towards a place where he seems to transcend it. But even on the outside, sometimes that transcendence doesn't appear. How can I say this? Externally, as easily as we would want it to. And so the last moments of the main character, his death and the way that he has to be treated. It might seem like he is losing himself, but ultimately, if you followed the arc of the character, he is actually moving into that transcendent zone. At least that is how I saw the movement of the character."}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":532.49,"end":566.85,"speaker":"Eugene Vodolazkin","text":"You see, the medieval people, they had more complicated relations with time and eternity than we actually they lived their time. Lifetime was not so long, 40 years, 50 years. We have exceptions, of course, but still it was not as long as now. But still their lives were rather long."}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":567.25,"end":567.65,"speaker":"Jonathan Pageau","text":"Why?"}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":568.05,"end":700.59,"speaker":"Eugene Vodolazkin","text":"Because in each fragment of their life, they had a direct call to the heaven, to the place where doesn't exist time or space. And they measured themselves not with such terms as here and now, but they thought about eternity. And the time was not so busy as now. You know, in early Middle Ages, people, they didn't use even clock. It was enough to see the position of the sun, and it was really enough. And the life was quiet. And in this life, in the center of the personal life was a God with eternity. And in the center of the social life was a monastery. Monastery was so in Russia, maybe in the west it was a little bit another situation, but in Russia, monastery was the university school was academy of Sciences and so on and so forth. And this, all the things, they made the attitude towards time and space rather specific. And I would say that we have a good example of the right attitude towards the time."}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":701.39,"end":741.04,"speaker":"Jonathan Pageau","text":"Yeah, we have. I mean, I think as Christians today, especially as Orthodox Christians, we still find an image of that in liturgical time, where we see in the way in which time is treated within the liturgy and how we have this kind of movement and apex towards the union of heaven and earth, the union with the angels, and also even the again and again of prayers, of this cycle of prayers which starts and ends and starts and ends, we get a sense of this different, this different perception and participation in time that infused the Middle Ages."}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":741.52,"end":981.02,"speaker":"Eugene Vodolazkin","text":"Yes, in Laureus I write about this interesting time of Christianity, because so it is common thing, it is known that the time in pagan societies, or so this time is not linear, but it is a circle. And that is why it was possible to hear this famous phrase, antique phrase, that history is a teacher of the life. Historia Maggie Stravite. And why it was so, because as the people of those times considered the similar circumstances, they gave similar results and it was possible to live in this circle. Judeo Christian history is a linear history. It is a time. Excuse me, it is a historical time. It is a time that had its beginning history that had its beginning and was and is always waiting for its last day. And so. But Christian history is, if I would find, if I would speak about the symbol of this history, maybe it is spiral. Yes, because the same history has its crimes, and all the. Or not all, maybe the most important things, they come back, but they come back in another dress with another face. You know, this famous typological exegesis of the Church Fathers, typology, Tupus and Antitupus, Christ as a new Adam, Mary as a new Eve, and so on. On the one hand, this time had its direction from the beginning to the end. On the other hand, it was eternity dimension, the circle. And this collaborating, so to say, of the time and eternity, it is a characteristic, the most maybe essential characteristic of the Christian time and history."}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":981.66,"end":1019.35,"speaker":"Jonathan Pageau","text":"Yes, I think I was very happy that you used the image of the spiral, because I really also think that very much so. Even looking at the final image in the book of Revelation, the image of the New Jerusalem, we see that it contains the Garden of Eden inside its own resolution. And so it is both a return to the beginning, but also a transformation of that beginning into something completely new. And so you do have this sense that it's. It turns, but it also. It's always going up, let's say, into God. And so that. That is definitely something."}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":1019.91,"end":1065.16,"speaker":"Eugene Vodolazkin","text":"If you remember, in Laurus, I have such a fragment. Old monk tried, tries to explain what does it mean, Christian time. And he makes circles around the monastery. And then, so the first circle was he was walking, the second, third, he was flying, not very high, but still it was enough to make Laurus sure that the time is a spiral. This monk says to see, now I'm flying. Not very high, but Laura's head. No, it's enough."}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":1067.56,"end":1153.32,"speaker":"Jonathan Pageau","text":"Well, that comment brings me to my second big question, which is that one of the most striking aspects in Laurus is how the book embraces a form of realism, the type of realism that we find in all the great Russian novels. But also there is injected into it something which I can only call this magical aspect, you know, and the example you gave is one of them. There are also wonderful examples of the holy fools who walk on water, and there are many other miracles which are happening. And this is something which, you know, let's say, historically for Russian novels, we would find in. In someone like Bulgakov, but in Bulgakov's work in Master and Margarita, for example, these fantastical elements, they serve a strange solipsistic fantasy, somewhat like in the tradition of the surrealists. Or the late 19th century symbolist. But in your work, all of this seems to be integrated in a very different way, as a movement towards what many of us have been thinking about what we call something like Christian reenchantment of the world. And so I was curious, is as modernity as this, the modern thrust reaches its twilight. What possibilities do you see for such Christian re. Enchantment of the world?"}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":1154.12,"end":1308.89,"speaker":"Eugene Vodolazkin","text":"Well, as for the mythology in my novel, it follows not a modern view of things, but medieval one. Mythology is useful when something meets to make up for the lack of real knowledge. You know, Moses describes the creation of the world as a process that developed over six days. You must admit that it would be strange if the people of that time would describe the creation of the world and man in terms of geophysics or genetics. Gradually, knowledge is concretized, taking the form of scientific knowledge. But this does not make any significant changes in the picture of the world. A fragment, I would remember a fragment of my last novel, the Justification of the Island. It will be published, I hope later in English. So there it is, rather strange dialogue between medieval man and modern film director. Interesting, yes. And they speak about the different consciousness, about different notion of the world creation and everything that surrounds us. And film director asks this medieval man, he shows him old manuscript where, so I have forgotten this word in English, something that flies from this heaven like a spaceship. Meteorite. Meteorite."}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":1309.13,"end":1310.09,"speaker":"Jonathan Pageau","text":"A meteorite? Yes."}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":1310.09,"end":1395.86,"speaker":"Eugene Vodolazkin","text":"Okay, yeah, meteorite. And he says, you see, it was the painter, not painter. So maybe a man who wrote this manuscript, the author tried to. So he painted this meteorite as a snake, as a dragon. And he said, now we understand what does it mean, this meteorite, what does it consist of? And so on. And you can deny that for your contemporaries it was a snake. He said, he asked, your contemporaries called a meteorite snake a snake? And medieval protagonist answers, yes, I can't deny it is clear. They called it's a dragon. And film director asks, and now what you can say about our days? He said, now they called snake a meteorite."}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":1398.82,"end":1453.88,"speaker":"Jonathan Pageau","text":"That's wonderful. It's wonderful because I myself have felt also that the modern categorizations have become so pointed that it makes it impossible for people today, or very difficult for people today to understand ancient ways of understanding or ancient ways of categorizing a category, especially a category like dragon. If you try to reduce that to, let's say, a measurable phenomena that you can categorize with biology, is completely missing the point of. Even the way the dragon functioned in medieval thinking. And so it's almost like it's really two worlds that don't touch each other very difficultly. Touch each other, yes."}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":1453.88,"end":1511.87,"speaker":"Eugene Vodolazkin","text":"And there are metaphorical language. Maybe they were not aware that it was the so metaphorical. But this language actually, it gives no possibility to say that these people were primitive or actually the main things were known in medieval ages and now, or unknown. So we know the details, but the whole we don't know. And I fear that we will never know it. Not never, I mean never in this on the earth. It will come a day if God will, He will show and tell us how it was. But not here, I suppose."}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":1513.32,"end":1674.13,"speaker":"Jonathan Pageau","text":"Exactly. Okay, so I'm going to move on to my next big question, which is really one of the things which fascinated me when reading Laura's. And so during what people call the Middle Ages, there was a universal history consensus we could call it. It was a bringing together of different elements which included the Bible, Christian legends, but also included ancient mythological patterns like the Trojan War or Alexander the Great, for example, several texts from the Aeneid to the Eddas, the Arthurian cycles, they all see their origins in Troy. Gog and Magog are found in Alexander's romance. Muslims saw themselves as descendants of Ishmael, et cetera, et cetera. Hungarians saw themselves as descendants of Nimrod. So there are many more examples, of course, and all of this culminates in text that we find something like Dante's Comedy, for example, where he tries to trace this mythological unity of all the ancient stories brought together with a biblical one. So this mythological unity has been progressively destroyed by scholars through different techniques, whether it's trying to find pagan. To look only at the pagan versions of stories which were ultimately brought into Christianity, whether it is by using just historical techniques to show that this or this fact is not possible, but there is still a deep desire for this kind of unity of story. And so we see this kind of interconnected legendarium or mythological world being revived in people like Tolkien. And we see it in many, many other popular franchises like Star wars or Marvel Comics and, you know, Harry Potter. All of these, these stories which are very popular, present us a kind of unified mythological story. And so in Loras, you allude to this many times, you, you kind of bring it, you bring it to the fore into the story as these allusions to Alexander, to these mythical creatures on the edge of the world. And so I was wondering what you thought, what kind of use you think these legends that have been mainly forgotten by many people, but are still there? What Use they can be for us today. Is it possible to recover some of this Christian mythology for our time?"}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":1674.61,"end":1738.67,"speaker":"Eugene Vodolazkin","text":"Thank you. As I was hearing you, I thought about my translator, my American translator, Lisa Hayden. She's a genius translator. And so your questions show me how sophisticated she made this translation and how deep he came into the text and how deep she is in this interacting of cultures and traditions. It is really very important question because it shows us many things among them that Christianity is not a futuristic religion. It never pretended to come from nothing."}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":1740.59,"end":1740.99,"speaker":"Jonathan Pageau","text":"And."}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":1742.75,"end":2079.13,"speaker":"Eugene Vodolazkin","text":"It not only fought against the previous religious cults, but also incorporated them. This is how, for example, Christopher, a saint with a dog's head sinoceph phallus arose. He went back to the Egyptian jackal God Anubis. And this is how he was portrayed in Russia and say in Ireland. Why? Because Ireland had direct connections to Egyptian monasticism. And by the way, it was amazing history of this painting. It was very interesting history. Up to the 18th century in Russia, Christopher was with dogs head. But Metropolitan Arseny Matsyevich, in the 18th century he interrupted this tradition. And he said that instead of dog's head, one must paint the head of the martyr Demeter. And as his arguments he had a violent wonderful argument. He knocked everybody with it. He said that the life of Christopher, said that press prostitutes wanted to somehow to seduce him, make a temptation to him. But Metropolitan Arseni writes that if he would be with a dog's hand, no one prostitute would come to him. I suppose that he underestimate these women. So dog's head, it is not the worst they have seen in their lives, but the story was rather funny. And what else? The pagan fist, for example of Solstice gave way to the Christian feast of John the Baptist. And Christianity skillfully dealt with pagan mythology. So the Byzantine chronicle of John Malala tries to synchronize the biblical tradition with ancient mythology. To do this he uses so called FGMR method of so what? According to the chronicle, it turns out that Cronus is one of the sons of Noah and the father of Zeus. And it was the direct line from Adam. Why was it so? Because from the Christian point of view, it was only one universal history and no one history could exist. In addition, so to say, if there is only one history, one had the two ways to react or according to pselm, to consider the gods of pagans, demons and to fight against them or incorporate them. And Christianity used both methods. And what is interesting that it was from that point of view, it was a progressive thing. Why? Because this incorporation helped to to establish Christianity. And the chronicles who integrated mythology into Christian history spoke with yesterday's pagans in their language. And here you can also recall the first Russian chronicle, the tale of bygone years. This chronicle demonstrates a special attention to angels. Why? Because it was a way of slowly transitioning from polytheism to monotheism. That is why there were so attentive to angels and so on and so forth. There are many, many another examples of this collaboration that was rather useful, I would say."}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":2079.69,"end":2091.37,"speaker":"Jonathan Pageau","text":"And do you think that exploring these connections can be useful to us today in this post Christian type of world?"}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":2092.49,"end":2175.41,"speaker":"Eugene Vodolazkin","text":"Oh, it is a difficult question now when neo paganism becoming popular, when we are overwhelmed by a new mythology in literature and art. I assess the situation in a completely different way. At the beginning of Christianity this was justified. But after the establishment of Christianity, I see no justification for it. Everything was already said. We know it from Christ. He told us all this. The only justification I see is to view mythology as a special metaphorical language as to consider it the language of poetry. Really it is useful and nice. I like these pieces of art that use mythology. But in this case we must clearly separate poetry from the religion and not see any metaphorical metaphysics behind it."}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":2176.93,"end":2229.5,"speaker":"Jonathan Pageau","text":"Have you thought a bit about. Because here in that, say in, in the. In North America and in Europe, JR Tolkien has been a very large influence even in terms of people converting to Eastern Orthodoxy. For some reason he tried to create a form of, let's say almost a form of mythological structure which was not like you said it, it was a poetry in the sense it was fiction, but it was trying to show, you know, it was trying to show the coherence of the world through a fantastical lens in a way that could be. That was palatable for people today in a way that people could connect to people's imaginary. And so I don't know if you've thought a little bit about that type of approach in terms of art creation."}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":2230.38,"end":2303.89,"speaker":"Eugene Vodolazkin","text":"You know, Tolkien or for example, this long legend about Harry Potter. It is something strange because as you know, Tolkien was forgotten. He was not so popular after his death. It is incomparable with the modern admiration of him. The question lies not in Tolkien, the question lies in us. So some pieces of art are forgotten for centuries, but suddenly they have unexpected, expected resonance with modern problems with modern point of view and they are exhumated, so to say. I fear that it is not the proper word."}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":2303.97,"end":2306.69,"speaker":"Jonathan Pageau","text":"Yeah, yeah, they're dug up, they're brought back."}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":2307.41,"end":2520.92,"speaker":"Eugene Vodolazkin","text":"Yes. And they are discovered for the second time, even for the first time. Now it is time, you know, now, really, as you said, we live in, to my pity, mostly post Christian society, but human being can live without metaphysics. And so we differ from our brothers animals in this way. So we need God. We need to explain somehow our soul, the phenomenon of soul, of thinking and so on. And God is no more in the center of the life of personality, is not in the center of society, but this great wish to another dimension. That is, everybody feel this dimension, not everybody can speak about it and so express their feelings, but they feel and they find they discover for their. Discover for them some sort of metaphysics. But this metaphysics is not very high one. It is so Christian if we speak just about ideas, not about sacral things, if we take a great system of Christian philosophy, if we speak about the harmony of Christianity and Christian ideas, and when we will speak about Harry Potter. So these are different things. I have nothing against such tales. So maybe for somebody it is a first step to another dimension. It could be. But the matter is that this great thirst, this great wish for something that is not from here pushes the people to this strange type of metaphysics that characterized mankind before Christianity many, many centuries ago. It's strange and a little bit funny."}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":2521.32,"end":2572.28,"speaker":"Jonathan Pageau","text":"A little bit funny indeed. And so the difficulty, one of the difficulties we have here, I think, is that much of the art which is considered explicitly Christian for our culture is deeply mediocre. The music, the novels. There is something which. Much of the art which considers itself explicitly Christian has a bad sense smell. It just. It's. There's something propagandistic about it. There's something superficial about its metaphysics, about its approach. And so what is the advice that you would have to give to aspiring artists who want to use their faith or their worldview in their artwork, but they struggle to do so in a way that is profound."}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":2574.76,"end":2756.66,"speaker":"Eugene Vodolazkin","text":"I remember the expression of my beloved writer those of Pater Brown, Gilbert K. Chesterton. He was a wonderful thinker. He was not at all dull, had a wonderful humor sense. And once he said that what lacks Christianity is to be of Chinese or Japanese origin or something like this, or from the Far East. Yes, he said that. He said he spoke about the English society of his time. But he said Christianity is too much at home here. And that is why people, they want to. If they have water, as I, for example, here, if they have water, they don't drink. They don't want to drink. It is so easy to drink water that stands near you it is better to, I don't know, to go to the restaurant and to buy the identical glass of water and to drink it with another feeling. Yes. And maybe people must be enough wise to discover in old and maybe forgotten things the new ideas new, because Bible, it is a book that has everything. If you want to, you can laugh, you can cry. Reading the Bible. I know I knew I had a colleague in Germany, he was a great specialist on the Bible. And he, as he finished his lectures, almost in despair because his students were rather so they were sleeping. But the last his sentence was, my dear, read the Bible. It is more exciting than Harry Potter."}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":2758.1,"end":2831.6,"speaker":"Jonathan Pageau","text":"That is definitely something which at least around me, all of a sudden, I feel people are getting more excited a little bit about Scripture again. I think that the return to narrative is part of it. Because one of the disservices that has been given to us by modern scholars is that they've sucked the story out of scripture, they've reduced it to textual analysis, source analysis, and all these extremely technical ways of seeing scripture. And they have forgotten or ignored the power of typological reading and the kind of narrative parallels that you can make when you read scripture in that way. But I feel like even with postmodernism, somehow that this type of reading is now possible again. And exploring the strange stories and judges and all the very weird elements of scripture is maybe a way for people to rediscover how wonderful and strange the scripture really is."}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":2832.48,"end":2903.11,"speaker":"Eugene Vodolazkin","text":"Yes, from time to time I read scripture and as a writer, I can't understand how nice is it as for example, this story with 10 ill men that were healed by Christ. And his question, that is actually not a question, he said, were not the 10 of the 10 healed? And where are 9? He knows, of course, but this expression through the question, it is so strong, literally, or for example, I don't know it in English, but in old church Slavonic or in Russian, this about Naboko."}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":2904.47,"end":2905.67,"speaker":"Jonathan Pageau","text":"Nebuchadnezzar."}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":2907.91,"end":2922.63,"speaker":"Eugene Vodolazkin","text":"This wonderful phrase. You was. Wait, on the. How it will be in English, the thing where you can wait."}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":2923.76,"end":2932,"speaker":"Jonathan Pageau","text":"The balance? Yeah, like on a balance. And it was weighed on a balance. On a scale. On a scale."}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":2932.08,"end":2941.68,"speaker":"Eugene Vodolazkin","text":"On the scale of the God. And you was found very light. Yes, it is incredible. Good."}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":2942.96,"end":2947.6,"speaker":"Jonathan Pageau","text":"Yeah. The stories of Nebuchadnezzar becoming an animal in the field."}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":2948.33,"end":2948.65,"speaker":"Eugene Vodolazkin","text":"Yes."}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":2949.37,"end":2955.37,"speaker":"Jonathan Pageau","text":"Those stories are astounding. They're something that could be in your novel lores, I think."}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":2955.77,"end":3002.87,"speaker":"Eugene Vodolazkin","text":"Yes. And you know, in the Bible you can find about the love Solomon, you can Find actually a key to the world history. World history is not, as Marxists say, so that some events, they provocate another event, they provocate the struggle of classes and so on. It is a time to gather stones and the time to help me to stay away."}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":3003.27,"end":3006.47,"speaker":"Jonathan Pageau","text":"Right, right, right. Yeah, yeah. To gather and to."}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":3007.51,"end":3149.77,"speaker":"Eugene Vodolazkin","text":"And actually history is. Actually, history is just something that has its rhythm as wave. And nobody knows why this wave comes and how to predict big waves and so on. And as our writer Liskov, he wrote, nobody knows about each man, what thinks about him. God. And one monk told me a good joke about a priest and a driver or bus driver. They, after the death, they met each other in the paradise. And as the priest saw the driver, he was a drunkard and drove his bus on serpentine. And suddenly he sees him in paradise and he asks, God, tell me, please. For many decades, I spoke to my brothers and sisters. I told so many good words. And he drank all this time, and he put in question the lives of the people that were sitting in the bus. And he's also here, why? And God answered him. So during all your speeches, everybody was sleeping. But if this man came into. Came to serpentine with his bus, all the people were praying."}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":3152.25,"end":3181.05,"speaker":"Jonathan Pageau","text":"That's a wonderful. That's a wonderful. That's a wonderful joke. And it. It also shows us, as you said, that the secret patterns that are hidden in us are not. Sometimes they're not as easily discernible as we would want. And certain action, let's say, have opposite effects that end up bringing everything. Nonetheless, even if it looks dangerous at."}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":3181.05,"end":3187.62,"speaker":"Eugene Vodolazkin","text":"The moment, nobody knows the ways of God and his creatures."}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":3188.74,"end":3235.37,"speaker":"Jonathan Pageau","text":"So, Eugene, thank you so much for your time. I really appreciate our discussion for you making time out for me late on an evening for you. We're definitely looking forward to your future novel if it will be translated into English. Just the little hint that you gave is already making me want to read it. And so I really appreciate, I speak also on behalf of so many Christian artists that sometimes feel hopeless, really, really hopeless in terms of the capacity to tell stories that are vibrant and alive. And so I feel like you have given us some keys and some examples to follow and to emulate. So thank you so much."}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":3236.02,"end":3253.7,"speaker":"Eugene Vodolazkin","text":"Thank you very much. And I would like to send my love to my readers and non readers and future readers and future readers, and to express my love to America and American people. Thank you very much."}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":3253.86,"end":3254.34,"speaker":"Jonathan Pageau","text":"Thanks."}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":3255.86,"end":3287.47,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel channel Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description and so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and."}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":3287.47,"end":3289.35,"speaker":"Jonathan Pageau","text":"Also leave some of my comments as well."}
{"episode_id":"SW - #171 - 2021-08-22 - Eugene Vodolazkin - Laurus, a Glimpse Into the Medieval Mind","start":3289.59,"end":3320.81,"speaker":"Jonathan Pageau","text":"You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially going to www.thesymbolicworld.com support or else on Patreon Pajo videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
