{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":0.16,"end":62.41,"speaker":"Laura Diaz","text":"Tucson, the weight is over Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications, you can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight and serious risks at mediweight loss. I got the same medication but with a customized plan, weekly check ins and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com we have to really realize."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":62.41,"end":106.73,"speaker":"Jonathan Pageau","text":"That, you know, the gods, the northern gods, they die, they end, they get eaten by the wolf. Narra ends them and that's the difference. Like we actually have. The end of our story is the opposite of that. You read Revelation, you have this glorious king that rules forever over a city of jewels. It's like that's the end of our story. It's there, it's encoded in the story. And so this search for glory and power and just riches, their entire life leads to their, their decomposition at the end and being eaten by the dark wolf. The life of self sacrifice and of giving yourself leads in the story to the this glorious city. And so you know it's there encoded in the mythology."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":106.97,"end":107.45,"speaker":"James Orr","text":"Yeah."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":118.89,"end":170.89,"speaker":"Jonathan Pageau","text":"This is Jonathan Pedro. Welcome to the symbolic world. So everyone, I am very happy to be here with James Orr. Many of you who have watched the Gospel series or the Exodus series have seen James. He's become a friend of mine. We've done several things together, of course, those series. I was also had the chance to to go to England and do a tour with him. He is an associate professor in Cambridge. He's the chair of the Edmundberg foundation in the UK and also runs the Trinity Forum in the uk which is what I was able to participate in when I was there. And I thought it would be a great opportunity to have him on he is such an insightful cult thinker and very brave person in his own context. And so, James, thanks for. Thanks for talking to us."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":170.89,"end":178.97,"speaker":"James Orr","text":"Oh, it's great to be with you, Jonathan. I'm a huge fan of the symbolic world and all the work that you do, so just so good to be with you."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":179.77,"end":206.64,"speaker":"Jonathan Pageau","text":"And so we have been now on the two, you know, the two Bible seminars with the Daily Wire, of course, the first one, Exodus, which was wonderful, amazing. But the Gospel seminar, I think we're all a little worried about it because talking about the Gospels is so much more controversial than talking about Exodus. And so we all came in and so I'd like you to maybe to tell people a little bit about what. What your experience was of. Of doing that with. Of all this together."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":207.76,"end":239.19,"speaker":"James Orr","text":"Well, yes, you're right. I think we all approached it with a certain sense of foreboding, but also excitement and, you know, a sense of reverence, but also. Yeah, we were. I didn't quite know what. What to expect. I mean, the first thing to say is that those two Exodus. It was two Exodus series. And so we spent two weeks on. On those 40 chapters. And whereas this project, we're trying to get through all four Gospels effectively. What was it, six days?"}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":240.47,"end":241.67,"speaker":"Jonathan Pageau","text":"Yeah, four hours a day."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":241.67,"end":242.03,"speaker":"James Orr","text":"Two."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":242.03,"end":243.99,"speaker":"Jonathan Pageau","text":"Two, like in the morning. I didn't have to. Something."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":243.99,"end":285.58,"speaker":"James Orr","text":"It was a while. That's right. And so probably it doesn't really come across in the series, but we were in the studio four hours a day as opposed to two hours a day. Everything was compressed down into a single week. So it was a lot more intense. It was much more, you know, it required a lot more stamina. I found it was a. Was a lot more of a kind of an emotional rollercoaster, too, particularly that final day, you know, the last two sessions at Golgotha and the Resurrection, the trial. We don't think we did the trial. Golgotha, the Crucifixion and the Resurrection all in about, you know, four hours. I think it was almost. I think it was a single day. And I think we were all emotionally shattered at the end. At the end of that day."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":287.42,"end":287.82,"speaker":"Jonathan Pageau","text":"But."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":288.62,"end":364.29,"speaker":"James Orr","text":"And I think. And it was harder to. I think with Exodus, we were able to approach it as this enormously important kind of canonical text that was more than merely just any other text. We know. We. We all approached it that. We had different perspectives, some secular, mainly not, but with a sense of reverence. But I think with the Gospels, there was something. It was much, much more freighted and, you know, and that's why I think it was so important to have Dennis Prager there. You know, I know there was some. Been a little bit, a few questions about, you know, what is Dennis Prager doing there? What was John Vervake doing there? Actually, if they had not been there, I just, I think the whole series would have just fallen. Ap think it was wonderful having them there. John as a sympathetic secular, quasi secular, but not kind of hard boiled secular perspective, counterpoint. And Dennis there, just so open, generous, willing to understand, willing to give a kind of, you know, mildly critical Jewish perspective. So that really held it all together. But yes, it was, it was, it was a much more delicate tightrope, I felt. And I don't know if you felt the same."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":364.93,"end":413.22,"speaker":"Jonathan Pageau","text":"Well, I came in quite nervous about it. And there were some issues that, you know, because we. We didn't. We weren't actually reading the gospels, we were reading this like kind of synthetic account of the gospel. So that made us all nervous as well. Everything. There was all these things that were there, but there was something again. And I think Jordan sets the tone in, just in terms of his stance in conversation. I think that the tone of the conversation ended up being so productive. And there was a dance really, like you said, in some ways everybody kind of knew what it is that they were bringing. And we created this. In some ways people could watch it just as a model of a conversation. I mean, people who don't even care about the gospel to see how can you have people that are so far from each other in their positions in some cases, but nonetheless be able to discuss something that important and controversial."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":413.49,"end":494.76,"speaker":"James Orr","text":"I couldn't agree more. I mean, I think Jordan chaired it really well and I wasn't actually sure how he was going to do it or how good a job he was going to do it. This is basically. It's not something he actually got much practice in. The podcast, the dialogue, occasional trial podcast format. It doesn't lend itself to kind of chairing a seminar of eight, nine different people over that long period. And I thought he did a fantastic job with it. And there was. I'm not sure what it was. It was a combination of a kind of the intensity of a kind of evangelical preacher, but with that sort of sympathetic skepticism of the. Of, you know, of the psychologist, of the clinical psychologist and the kind of. And the student of culture and the kind of the reader of the cultural runes. And. But I think at no point is that, you know, his, his sense of respect shone through every conversation. And I think he set the tone perfectly for it, with that, that, that. The sense of seriousness, the sense of reverence, but without it feeling, because of his own position, overly pious or. Or devout or saccharine. And I thought that was crucial to the success of. Of this series in particular."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":495.56,"end":554.72,"speaker":"Jonathan Pageau","text":"Yeah, that's it. I think that that point, the last point, is important because in some ways the danger, one of the danger that we could have fallen into was a kind of sentimentality. Exactly. You know, also a kind of evangelical space where we're, you know, we're trying to. To convince people or convince each other of some position or whatnot. And because of Jordan's. Yeah, because of his stance, I think we were mostly able to avoid that in any. At all. I think even at some point, Dennis Prager mentioned. He said, we've been here for several days and no one yet has told me, like, how to be saved. You know, And I thought, wow, that's a pretty amazing stance also, because if you actually read the gospel, you realize that there's so much more. It's actually not that much about that. You know, that's not really what Jesus is talking about most of the time. But I think that. And I had never. I think I realized afterwards I had never in my life gone through the entire gospel story in a week. And so that was an astounding thing to do."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":555.36,"end":692.97,"speaker":"James Orr","text":"It really was. And, you know, like you, I was a little suspicious when Jordan circulated that text of, you know, the four in one one gospel. But it reminded me that it had been done before in the early church. There was that gitation in about 160, I'd done the diatessaron, you know, folding all four gospels into one. I remember reading about that when, you know, in those old debates about when did the canon form and how do we know it was four gospels? Well, that's a really good early date for there being four gospels. So actually. And I thought it worked well. I mean, we could have. I'm sure there are all kinds of scholarly criticisms to be made of, you know, the sequencing and how can you chart the chronology and so on. But I don't think it really mattered. We got the basic sequence, the narrative thrust to the gospels, and we managed also, we simply had to cut out a lot of the kind of duplicate and triplicate synoptic material, which would have made no sense if we'd done full gospel sequentially. It would have been an impossible thing to produce. So actually that worked really well. And I think the other thing I appreciated, I mean, we've Talked already about John Vervaeke's friendly, interesting perspective, mildly skeptical perspective from somebody who'd grown up in a church background and had a Baptist background. So there's some very moving exchanges I remember having with him and he having with others, and then, of course, Dennis's perspective. But I think what I found especially enriching was the ecumenical sort of synoptic perspectives. We had you, of course, with your. Your learning and insights steeped and soaked in the orthodox tradition. We had Bishop Barron, sadly, only for three days, but I think those. Those sessions were electric. Learned so much from him. He's got such a. A gift for communication and also for conveying the Catholic, you know, an unapologetically Catholic perspective. And that I think those provided anchor points. And then there was sort of woolly Anglican takes like. And mine and, and. And Professor Headley and Dr. Blackwood. But that for a bit of padding."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":692.97,"end":759.89,"speaker":"Jonathan Pageau","text":"There, that's a little pad. But I think that, you know, you say that, but in some ways both, Stephen, all three of you Anglicans are deeply rooted in, you know, Stephen, who has read so much of Boethius and has a kind of a vision towards also Hellenistic culture. Douglas, who is a Neoplatonist. And you have also such a sen. Mystical aspect of Christianity and also the cultural aspect. And so I. I felt like, in some ways, I didn't even notice. The person I noticed the most was, of course, Bishop Baron, because he really spoke from a position of kind of Catholic authority. And I thought it was really useful for that to happen because sometimes he would give the theological words that. That I, for example, purposely avoid, because are you mostly talking to kind of half secular, half Christian audiences? But I thought it was useful to have that. But in all, I felt really like there was. There was just this exploratory mode that we were in and that made it. I think anybody can watch it from any faith tradition, not even Christian, and be able to enter into the conversation."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":760.45,"end":984.66,"speaker":"James Orr","text":"Absolutely. And you're right, Bishop Barron was very good at enunciating the kind of orthodox theological kind of pronouncements and. But all in a very helpful way in sort of explaining how those. How those doctrines and dogmas are kind of unfolded and how they were to be, you know, found in the Gospels. And so I thought that was so useful. And I think for me, I mean, it's kind of you to say that we're sort of attuned to the mystical dimensions of the Gospels. And that's something that's relatively new to me. And of Course, I love Plato and have been, you know, very enamored of the Neoplatonic tradition. But I think it was a shock to me, as it were, approaching the Gospels from some lens other than the sort of traditional lens of Anglo American New Testament scholarship, which is primarily the hermeneutical prism of the literal and the historical in the dulubax, you know, the four senses of Scripture. And that's what I found so powerful, sort of approaching Scripture not just from that one prism, but from the other three too. What are they? The allegorical, which you were so good at in explaining how to. And in Exodus as well, explaining how to think through the Scriptures in terms of allegory and symbol. And then the mode that Jordan, I think, was especially strong at, what do they call it? The tropological. So the moral sense of Scripture, how. How should I apply this to my own life or how I ought to do? How do I think about virtue? How do I think about moral formation, becoming a better person? And then the mystical, what is it? The other, the final one is the anagogical. The anagogical, of course, which is, you know, the mystical ascent, you know, what is the eschatological horizon and import and direction of this text. And I can't tell you New Testament scholarship. I mean, I'm not a New Testament scholar, but I, you know, will occasionally go to New Testament seminars and, And I'll often, you know, I keep abreast of New Testament scholarship and that it is just tone deaf. You know, you'd be laughed at if you'd brought up those other three senses. Anything other than basically a theological analysis of the text, biblical theology, or a kind of quite a dry textual, literal, historical analysis. I mean, I did feel, and D. Lubac does say that that that layer is the foundational one. And I felt I was often making quite sort of apologetic historical points, saying, look, trying to bring everything down and say, look, it does matter that this happened. This got a. There's a very granular and plausible historical context to this. No, the resurrection is not own. Is not just a sort of symbolic awakening in the hearts of the, of the apostles. It's. It's more than just. It is more than just history. It's the axis of history. And so we shouldn't naively historicize it and reduce it to just some other contingent event in history. Of course not, but it is at least history. And one has to stand by that and one has to be, you know, open to the historical strength of, of. Of the documents which was, which had such an impact on me when I came to faith 20 years ago. But that's, you know, in the end, that's kind of limited, too. If you want the Scriptures to enrich your life and to help you think about God, to think about the final, the first things and the last things, you desperately need these other three readings. And that's what I got. That's what I learned most from our time. Not. Not just in the Gospels, but Exodus, too."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":985.22,"end":1062.73,"speaker":"Jonathan Pageau","text":"Yeah, I really appreciated in some ways the voice that you brought, that more technical aspect sometimes to say, you know, like this is even in terms of the translations, in terms of the Greek and bringing it. Have you had more of the scholarly approach? Because I don't have that at all. Like, I just don't. And I don't. It's not that I don't totally care for it. It's just that I'm not. I don't. That's not the thing that. That drives my attention. That's not the reason why I care for the Gospel. And I do believe what you said. I do believe that all these things happened. I do. You know, obviously I believe that the resurrection is an event, but I tend to focus on the type, the typology and the vision, the eschatological vision. And so I thought it was just. And I thought everybody also was able to play with each other because usually, you know, I've had conversations with the more kind of historical types, let's say. And it's sometimes very difficult to play with each other because we're just talking completely past each other. And people think that I'm suggesting that none of this happened, that it's all allegory, that it's all metaphor. And I'm like, no, that's not what it is. But that's what was amazing about the event was that we were also, because of Exodus, I think we already had a. We kind of knew. We knew each other, and there was already a dance that had started and made it easier to have that conversation."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":1062.73,"end":1128.14,"speaker":"James Orr","text":"Yeah. And I couldn't agree more. I mean, in many ways, I felt it was a sort of confusion or a synthesis. I mean, I've got this theory. I don't know if it's plausible or not, but what you've seen in biblical hermeneutics over the last, what, 150 years is a kind of. There's a sort of split. You've got the stress, more fundamentalist, evangelical stress on the literal sense of scripture, the historical. It's quite monochrome, but it's you know, very kind of very strict. And then liberal theology has gone in completely other direction. It's much more. It's just allegory, you know, it's just the symbolic. And I felt what we managed to do in those seminars was to not see that as a zero sum game and actually, and to see more to it precisely because we're seeing those two together, to also be alive, to the capacity for moral instruction and also for that eschatological horizon, the orientation to the final vision. And I just. It was, you know, I found that so galvanizing."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":1128.78,"end":1298.33,"speaker":"Richard Rohlin","text":"Hello, my name is Richard Rowland, and I am interrupting the construction of the new Symbolic World Barn of podcasting to tell you about a new course that is coming from the Symbolic World beginning February 24th. This course is called Tolkien and Universal History. So there's a famous letter that Tolkien wrote, it's about 10,000 words or so to a man named Milton Waldman. Sometimes it's called the Waldman letter or letter 131. And in it he says this, speaking of his efforts to create the Legendarium. I had a mind to make a body of more or less connected legend, ranging from the large and cosmogonic to the level of romantic fairy story, the larger, founded on the Lesser in contact with the earth, the Lesser drawing splendor from the vast backcloths, which I could dedicate simply to. To England, to my country. Later, he says, I would draw some of the great tales in fullness and leave many only placed in the scheme and sketched. The cycles should be linked to a majestic whole and yet leave scope for other minds and hands wielding paint and music and drama. So this course will begin with an exploration of two medieval literary genres, the epic poem and the chronicle, and see how Tolkien used them in his early conceptions of Arda. These two genres of literature are essential to medieval universal history, but of course, as you all know, they're often overlooked as being boring by modern readers, so it's easy to overlook their importance to Tolkien's project. Then we're going to move on to the linguistic and philological framework for Tolkien's Legendarium, which shows us how his quote unquote, secret vice is the key to Middle Earth's deep sense of place and time. As surprising as it might seem, it's also the in, you could say, for Tolkien to connect his legendarium to the Christ story. And finally, we're going to look at how he takes all of these elements of universal History and works them into the modern genre of the novel. So it's been said that the only honest response to a work of art is another work of art, and that's something I really believe. So in our final lesson in the course, we're going to do a couple of things. One is we're going to look at the application of the genres and methods that we find in Tolkien to the mythopoeic and universal history efforts of three contemporary fantasy writers, including one Jonathan Pageot. And there's also going to be a little optional writing assignment for those who want to participate in some mythopedic efforts of their own. I'm really excited about this course. I know that I've done a lot around the Internet about the works of J.R.R. tolkien. This is completely new material and I'm very excited about it. So I hope you will consider joining me for February 24th. You can learn more by going to thesymbolicworld.com courses, and I hope to see you there."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":1298.81,"end":1350.48,"speaker":"Jonathan Pageau","text":"And I think that what you're saying brings me in some ways to the next thing I wanted to talk about, which is this idea of going beyond this opposition of the literal and the metaphorical, all of these types of things that are happening. It speaks to a cultural moment that we're going through. We can talk about the re Enchantment. There are different ways in which we're addressing this, that we're moving towards a post Enlightenment, post liberal world. All of this. You know, the Gospel Seminar, the Exodus Seminar, was the most popular thing that Daily Wire did on their platform. And now it looks like the Gospel series might outdo it. And so I want to get your take on that. You know, you've been also following this story, you know, Rodrier, you know, you know, Paul Kingsnorth and Martin Shaw, all these people that are speaking into this moment, and Jordan Peterson as well, John Vervecki. So what is your perception of what's happening in our world right now?"}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":1351.84,"end":1758.35,"speaker":"James Orr","text":"Well, I mean, I think we're in a time of extraordinary flux, of course, to state the obvious, a time of a real instability, culturally, enormous tension. Obviously, all of this is to state the obvious. But I think what early on when I started noticing this, sort of the waves of the cultural revolution crashing into across the institutional landscape here in the uk. This is roughly a year or two after it started in North America. I realized that there was a tendency among some Christians and people of faith to kind of, you know, shore up a little bit, to get very pessimistic, to kind of ghettoise themselves a little bit. And that's changed, I think, around 2015, 2016, 2017. I think partly thanks to these more sort of secular profits, Knight, Jordan and, and others, or secular prophets on their way to embracing the sacred, as in the case of a Paul Kings north or a Martin Shaw. And I, you know, I think that there are opportunities here amidst the crisis and I really can see the fingerprints of Providence all over these, these cultural developments. And, you know, if you'd said, you know, 20 years ago at the high noon of the new atheism, that before too long you would be seeing, you know, public conversions of very distinguished intellectuals, writers, mythographers, celebrities to Christianity. And not liberal Christianity, but Christianity with all the weird stuff, you know, and all the, all the bells and whistles and, and, and, and a kind of, and wanting to embrace all of that. I think we'd have thought you were just completely mad. And so, you know, I think it is, it's. There are all sorts of opportunities. I think I've noticed that the evangelical tradition, certainly here in the UK has struggled to cope with it, with it, or struggled to seize some of the opportunities that have opened up. And I don't, and I think that probably is to connect back to what we were talking about earlier, that maybe the tradition, historically, maybe this is changing now, but historically the hermeneutic is not open to the enchanted dimension quite as much, inasmuch as it's a little bit more skeptical of the allegorical and the tropological and the anagogical and, and the kind of, the final vision, all of that is this kind of restraint there. And, And I think the liberal wings of the church here in England have unfortunately disappeared so far down various political rabbit holes that have rendered it basically indistinguishable from, you know, a secular policy shop, that they've not really been able to rise to the challenge at all, which is a source of great sadness that our established church has this extraordinary, you know, once in a century opportunity, in my view, to address the crisis of meaning and to address through faith, this sense of civilizational instability and rootlessness. And I find that really heartbreaking. At the same time, I often get emails, partly thanks to the Exodus series. I can't remember doing anything that has stimulated so many people to get in touch with me. I think it's partly because my email is sort of available. You can look me up and write to me at my Cambridge email. So I probably get the benefit of all the sort of compliments because other people are harder to track down. But I've had the most moving messages from people all around the world and occasionally some slightly zany takes, but often very reflective, sophisticated, moving testimonies about from doctors in their 60s who, you know, who are searching for God late in life and who found something in the series which, which spoke to them, you know, which a fiery sermon from a pulpit just couldn't do. They just wouldn't work. And I think what Jordan and others, and what you and Paul and Martin and others and Rod are able to do is to open up just less tested, more oblique ways into the faith that don't feel, you know, that don't feel overly cognitive or propositional, but stress a world of beauty, a world that is magnetizing, mesmerizing and that is attractive, that helps you to understand Western culture, helps you to read myths afresh, to read fairy stories afresh. And I think that's just so, so powerful and new. I can't really think of, I can't really think of anything comparable. I mean, you might have said, you know, when, you know, Lewis and Tolkien were publishing in earnest in the 60s and 70s, perhaps there was something going on there, but we didn't see, you know, it wasn't meeting the knee, meeting any particular religious need, nor did it stimulate any particularly noteworthy phenomenon of revival. So, no, I, you know, it's very hard to. Things are moving so fast and it's sometimes hard to distinguish the political dimensions and dynamics from the spiritual, you know, the sort of, the meaning vacuum. I mean, they're often obviously interlinked in lots of ways. But if there's, I mean, it's clear that, you know, the sort of work that you've been doing and the work that we've been doing on the series, and I think the Daily Wire recognizes this and note and the pop that the popularity of the series for the Daily Wire relative to their political output, I think testifies to the fact that Christianity and the great riches, the imaginative and theological and biblical riches, scriptural riches of the Christian tradition, provide a kind of antidote to the chaos, an antidote to the sense of civilizational instability."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":1759.39,"end":1782.79,"speaker":"Jonathan Pageau","text":"What do you think of, I don't know if you had the chance to see Paul King's North First Things address, where he in some ways also proposes a critique of that or the dangers of the politicized politicization of Christianity, of also seeing Christianity as a tool, a civilizational tool, rather than seeing it as a good in itself. Yeah, I don't know if you had thoughts on that in the wake of that."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":1782.95,"end":1851.87,"speaker":"James Orr","text":"Yes, I haven't actually. I didn't watch it But I read it. I think. I don't know if it was an edited or fairly full transcript of it, but I read it quickly. I'd like to read it again. And as with everything by Paul, it repays rereading and careful digestion. As always with Paul, he's onto something. It's provocative and I think he's touching on, you know, he's developing a criticism that we need to take seriously. I was talking with a very distinguished evangelical here in London, a kind of influential guy who was saying how he wanted to set up a project connected to set up a project that inspired. Focusing on the need to restore a Judeo Christian ethos and foundation to our culture. And, you know, there's been some debate about this online, but whenever that term is used, Judeo Christian, it does feel as if it's a pawn in some larger kind of political, cultural culture war game. Right."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":1852.43,"end":1855.55,"speaker":"Jonathan Pageau","text":"I never use that term, if you've noticed. I just don't use it."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":1855.63,"end":2025.46,"speaker":"James Orr","text":"Well, I'm with you. I mean, you got there before me. But I'm kind of allergic to it now because I think of all my Jewish friends. I've got, you know, work a lot with people in Jerusalem for the Edmund, but with the. On the Edmond Burt Foundation. I think Judaism, obviously Christianity, is so enriched. It's just completely unthinkable without Judaism, of course, and yet it's not Judaism. And it doesn't, you know, it doesn't respect one's Jewish friends to say that. It's, you know, there is this kind of fusion. This is a kind of weird sort of uticianism, you know, fusing the divine nature and the human nature of Christ to create a third person. It's a kind of. It's the same sort of problem. But I think, you know, so that sort of phenomenon makes me think that Paul is onto something, that Christianity is often being used as. As a kind of. In a kind of instrumental way, as a tool or as a signal of a need to. Or a clarion call to defend Western civilization and a kind of a cultural stability that seems to be under threat economically in terms of demographic changes and all the rise of secularism, aggressively confident secularism and so on and so forth. And I think there's a lot. There's a lot to that. You know, Christianity, yes, of course, it has nourished our civilization to an unimaginable extent. But it, but it's. But it is so much more than that, too. And, you know, it's fashionable to mock people like, you know, the great German liberal biblical critics like Bultmann, you know. But actually, I think it probably. It's quite good to go back to someone like Baldman and read him. And Waltman basically has this existentialist Heideggerian reading of Scripture where he talks about. Or even Barth, you know, talks about that sense of existential immediate immediacy and the raw contact and power of encountering Scripture. Never mind all the kind of arguments about civilization and, oh, it's so useful for society and it's so useful for holding the family together and so on. Kierkegaard is also a good person to read on this. You know, his great critique of the kind of cultural complacency of Copenhagen Christianity, you know, of just. It's. That this. We're missing something here. This is. We're missing the kind of the raw power of contact with Christ, of relationship with Christ. So I think what Paul is. It's an important contribution. I know it's ruffled a few feathers and it's kind of discombobulated people."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":2026.02,"end":2109.22,"speaker":"Jonathan Pageau","text":"Yeah, well, it's okay, you know, and I think that, like you said, I think we have to enter into the conversation. I had to record a conversation with him about it, which probably should be out by the time we put this out. And. And I think that the critique is absolutely right, you know, but it's. It's all. It's difficult. It's. It's. In some ways it's an image of the difficulty of all good things, because you're right that it does offer. It does offer so much in terms of our civilization. It is the foundation of so many good things. But we always have to keep things in the right order. Right. If you want. If you want the higher good for the lower goods, then it never works. It never functions. You cannot make the worship of God a utility for the stability of your family or for your civilization, although it will yield that. And so it's hard even in our own hearts to keep the order properly because we do want all these things. We do want our societies to function. We do want our families to hold together and that it's also okay to want that. And so we. It's hard to order that. I feel it in myself, like, it's hard to order things properly in my heart, knowing that if I. That if I am. If I'm a Christian and faithful Christian, that it. It will have fruit that will. Won't just be, you know, for my faith, you know."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":2109.3,"end":2128.28,"speaker":"James Orr","text":"Yeah. Yeah. I mean, I. We were. You spoke brilliantly at the Arc Conference here in, you know, in London. What was it last year? And I remember in that conference, that electric panel with Oz Guinness and Ayan Hersi Ali and which I think for the first time she announced her."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":2128.28,"end":2129.48,"speaker":"Jonathan Pageau","text":"It was the first time she announced."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":2129.48,"end":2178.74,"speaker":"James Orr","text":"Yeah, that's the first time we were all, and we, we had no idea that that was coming. It wasn't, it wasn't scripted, it wasn't planned. But I know she got a bit of blowback unfairly, I thought, for instrumentalizing Christianity or saying, you know, trying to frame her Christian, her conversion in the context of a need to defend a civilization that she'd fallen in love with and that she'd seen to be, you know, the best hope for, for humanity. And I don't, you know, my sense is whatever, whatever route to God one takes is, is great if it's a route that gets you to God. That's right. But also true, you know, you, sometimes you need instruments. Well, you always need, you need instruments to do, to do stuff. And, and you know, people take all kinds of different paths to the divine."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":2179.78,"end":2222.43,"speaker":"Jonathan Pageau","text":"But I want to say something on what you're saying because I think that it's really important because when you think about, for example, someone who becomes an alcoholic and you know, falls into the worst parts of their life and you know, hits rock bottom and then turns to God, you could say, well, there's something instrumental about that as well where you want God because you're suffering and therefore you hope that God will answer your suffering. And so you have to have sympathy, like you said, for people who are dealing with the meaning crisis, both personally and civilizationally, to see that oh, it is, God will provide a solution to these problems, although we have to be careful not to make that the final end because then it doesn't, that doesn't function."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":2222.43,"end":2222.87,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":2222.87,"end":2389.25,"speaker":"James Orr","text":"And I think also, you know, maybe Paul and those whom he's criticizing are, are both guilty of a rather restrictive or, or you know, a kind of crude assimilation of Christianity and Western civilization. I mean, you know, it's all kind. The very word civilization doesn't really start to come into common currency until I think, I think I checked this the other day, late 19th century. So, you know, for most of the course of Western civilization, people in Western civilization did not think of themselves as a civilization and didn't really think of themselves particularly as Western. And I just, I suppose there are just so many engines to what's got us to today to this sort of post liberal cultural and political moment. And yes, Christianity almost uniquely distills infuses and synthesizes all of those different currents in a way that I don't think any other tradition has managed to do. I mean, liberalism neutralizes the strands or privatizes or domesticates them. In effect, it permits them to some degree, but effectively formally clears it from the public square and formally erases distinctiveness from human beings and, and, and particularly and culture and intellectual traditions and so on in this kind of fungible human beings as fungible blank slates and so on. And so, you know that there is a lot to it. But you know, it's, I think it's, it's, it's probably too crude and implausible to just think of Western civilization entirely in, as, as a kind of, as a, as an, as a Christian achievement. And I think it also probably occludes the extraordinary impact that Christianity has had elsewhere in the world. I mean, you think of the Christian communities in India, you think of the Christian communities, what's left of them. Tragically in the Middle east you look at the extraordinary surge of energy and in sub Saharan African Christianity too, and in Southeast Asia, extraordinary things happening in Southeast Asia and Iran and so on. That is having a cultural impact. And so yes, it's tempting to domesticate Christianity or attempting to identify it too much as a kind of Western, as a Western phenomenon, even though it's just obviously it enriched us incalculably."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":2389.73,"end":2460.47,"speaker":"Jonathan Pageau","text":"Yeah, I think that's a great, I think that's a great point. You know, I, I'm hoping to go to Armenia next year, you know, and that's a great example where the Armenian king converted before Constantine, you know, even according to church tradition that, that and the same you have Ethiopian Christianity. I, I just had dinner with some Coptic priests last this week, you know, and the amazing resurgence of even Coptic Christianity in America and in, and in kind of in Europe and everything. So you see that, like you said, that Christianity is not a Western thing, although it has, it is at the base of so many of the things that underlie our value system. You know, one of the things that I tried to help people see is the idea of self sacrificial, of self sacrificial love in general even sometimes it's weaponized, sometimes it's, it's misused. But the very idea that self sacrificial love is the basis of our morality, that we should serve the weaker, that we should put our strength in service of those that don't have the strength to do it themselves, all of that can, does would not exist without The Christian impetus, you know."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":2460.79,"end":2559.2,"speaker":"James Orr","text":"Absolutely. And of course it's difficult because on the one hand, you know, we've got, we have those who would criticize us for saying, well, it's not a monopoly of Christianity. Right. I mean, you can believe in self sacrificial love now and we can, you know, thanks, but no thanks to the Christian influence. We can just see that as self evident when it's not. It's very far from self evident. Had it not been for the historical impact of Christianity. On the other hand, you've got the emergence of a kind of Spenglerian, Nietzschean, right. That says, well, this is part of the problem. This, this endless stress on weakness and on fragility, on sinfulness, on self sacrifice. And that's been interesting. That's not something I expected to see, but I think it's, it's, you know, hard to judge these things, mainly online phenomena. But I picked it up a little bit, you know, in, in the physical world as it were, on the street, in seminar rooms and conversations with young Zuma types. And there is that kind of growing skepticism of Christianity as being the kind of hidden source of the excesses of a kind of hyper progressivism, wokeism, whatever you want to call it, a kind of a fetishizing of weakness and a sort of repudiation of the kind of resilience and strength and vitalism that in their view flourishing civilizations depend upon."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":2559.36,"end":2654.35,"speaker":"Jonathan Pageau","text":"Yeah, yeah. And it's not that hard to see the difference. You know, I understand how it's tricky because we have many of our, the more progressive Christian strains that have taken that position, but it's not that difficult to see the difference. I really anchor the difference in the Judas story where the woman comes and washes Christ's feet. You know, where the woman is washing Christ's feet and Judas says, well, you should give this money to the poor. And then it says that Judas was stealing the money from the, the purse. And so you, you can recognize weaponized compassion. When it is wielding compassion in order to get power for myself. And then that is so easy, you can just see it right away. When it's using compassion to acquire power for oneself, then it is the very opposite of what Christianity offers. Like if you look at Christian tradition, you, you didn't, you have, it's difficult when you see these Nietzschean types and you say, well, how do you account for the entire Middle Ages? Like how do you account for the entire Christian tradition? We had kings and emperors and knights and we had, we had Christian warriors, we had this whole sense of, you know, a sense of the, the possibility of power and of. And of regal reality. But the notion was that higher than that was the saint, the monk, and the notion that the king had to at least, at least, how can I say, at least make a gesture towards that right, even if sometimes they didn't. And so I just find it difficult when people say that. It's like it seems like they don't really know much about history, you know, to posit that."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":2654.75,"end":2866.15,"speaker":"James Orr","text":"I don't know if you saw last week some of the effective altruists. I don't know if your viewers will be familiar with that movement of. It's a radical kind of utilitarian movement that says you've got to really give as much as you can away to those charities that will maximize the benefit and, and quality of life to. So not, not to the charities you choose, but to the charities that according to their Excel spreadsheet, do the most good. And anyway, there was an outcry when the costs of the extraordinary restoration of Notre Dame in Paris and there was all sorts of sort of, you know, an outcry effectively, that. Think how many mal. Malaria nets this money could have gone to. Think, think how many lives this could have saved. And I thought of the Judas story and when, when I saw that and yes, you're right, there is, there is this sort of year zero mentality everywhere. You know, maybe I think it's a symptom, it's a disease of modernity as such. You might say that it's a disease of the age that defines itself by reference to modernitas nowness. Right, that we, that we can't think diachronically, we can't think that concepts and traditions have a hinterland. And, you know, I think that's why the sort of work that you're doing and Martin's doing, you know, recovering these older tales, these older sort of patterns of myth and legend are just so important because they remind us how strange a lot of our modern assumptions are as, you know, sort of steeped as they are in the kind of tepid waters of secularism. We. I've got some of my students here, have a WhatsApp group. They. I'm not allowed on it, but they're all kind of young, you know, Christian lads in their 20s, 30s, and it's called Knights Templar and it's, it's, it's, it's LARPing, as they like to say. It's ironic, but they are also thinking about what does it mean to be we believe men and women are different and complementary. What is it to be a non toxic man? What is it to be to live a kind of a life of a Christian masculine ideal? And that means, I don't know what it means for them a lot. They do, they love working out, they do weights, but not in a kind of, not in a pursuit of vanity. They just think strength is good and God has given me this body, I'm going to make it, make it strong or I'm not going to date this girl, I'm going to court her, you know, I'm, I'm, that I'm going to see her for a few evenings and if I think it's actually not going to work out long term, then I'm going to honor her by saying, you know, this isn't working out and we'll move on. And I find that really encouraging. I'm not saying this is a widespread phenomenon, but I'm, I'm seeing it among a lot of the young students that I sort of spend time with in Oxford, Cambridge, London. And I don't know how to nurture that, but one wants to catalyze it. And I think having an enriched imagination and being able to tap into the great sources of the Christian imaginative world and so on, the patristic tradition too is very useful. Here is that wonderful essay of Bernard of Clairvaux. I mean, it was a little propagandistic. I think it was Pope Urban, one of the Popes, got him to write this theological defence of crusading."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":2867.59,"end":2868.79,"speaker":"Jonathan Pageau","text":"Yes, we know about that."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":2869.67,"end":2886.43,"speaker":"James Orr","text":"And that's quite a sort of good read. And I mean, you know, maybe goes a little bit too far, but it's a reminder that, you know, it's a riposte of sorts to the Nietzsche and Vitalists that, you know, it's not always been the case that to be a Christian is. To be one is to just, just fetishize weakness as opposed to, you know."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":2887.07,"end":2965.86,"speaker":"Jonathan Pageau","text":"And it's weird because it's like there, there, I don't think there's ever been a vision of fetishizing weakness, at least not in the way that we see it happen today. It's just not part of Christianity. We, we admire the, we admire the, the martyrs and the idea of self sacrifice and we hold that up. But you know, the bodies of the martyrs are finally, they're held in huge cathedrals that hold entire towns together. And so, you know, the idea that it's just a kind of revolutionary, you know, the way that Nietzsche, you know, talked about the you know, the fetishization of weakness and of the victim and everything. I just don't see it. I don't see it in the history, you know, and it's a misunderstanding of what it is because. Because in Christ we have these two images, right? We have the images. Image of Christ as the crucified one, as the one who really did in some ways lay his life down, did not resist his enemy and all that. And then in the wake of that, because of that, he's also the glorious king, you know, And I've quoted to some of these vitalists, you know, the text in Revelation that says. Talks about him ruling with an iron scepter, you know, and his enemies will be defeated. And it's like, you know, there's also. That it's also. Also part of the Christian story."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":2965.86,"end":3006.47,"speaker":"James Orr","text":"You know, I. I agree. And I think it's, you know, I think the. The criticism is misplaced. I think it's a lot more plausible to see the valorizing of victimhood, particularly in kind of socioeconomic contexts, as. As an extension or as a development of Marxism. I mean, it's. It's complicated. It's a complicated genealogy. But I. That seems to me a more plausible source in. In the kind of history of ideas over the last 200 years. Yeah, that. Moving from class to identity and so on and so forth. There's a lot. There's been a lot that's been talked about and written about this, but. But it's."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":3006.47,"end":3058.28,"speaker":"Jonathan Pageau","text":"It's even like in terms of mythology and. And we have to really realize that, you know, the gods, the northern gods, they die, they end, they get eaten by the wolf, Ragnarok ends them. And that's the difference, like we actually have the end of our story is the opposite of that. You read Revelation, you have this glorious king that rules forever over a city of jewels. It's like that's the end of our story. And if you think that, because it's. It's there, it's encoded in the story. And so this search for glory and power and just riches, their entire life leads to their decomposition at the end and being eaten by the dark wolf. The life of self sacrifice and of giving yourself leads in the story to this glorious city. And so, you know, it's there, encoded in the mythology."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":3058.52,"end":3155.09,"speaker":"James Orr","text":"Yeah, I couldn't agree more. Absolutely. The great eschatological closure is one of triumph and victory and riches and happiness and eternity and so on and so forth. I wonder. This is really speculative, but I wonder whether the fact that the kind of the targets of those Nietzschean critiques, you know, that sort of, that kind of hyper progressive approach to society and culture. The fact that it emerges from distinctively Protestant cultures, cultures that historically from the Reformation onwards tended to emphasize crucifixion, the suffering and over and above the final vindication and victory in the Resurrection, and underwritten so gloriously and eschatologically in Revelation. I wonder if there's something to that feels a little speculative. But, you know, there are differences, I think if you just look at rates of secularization, for example, between Protestant dominant dominated countries and Catholic dominated ones. And I wonder whether, and I think it's true that the cultural revolution that we've seen has begun really within the Anglosphere, America predominantly and has not really taken root quite as powerfully in Mediterranean Catholic cultures and certainly not in Orthodox cultures, as far as I can tell."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":3155.5,"end":3210.49,"speaker":"Jonathan Pageau","text":"Yeah, well, we do have that whole communist period in Russia that we have to account for, although it does come from Germany. Like, I mean, the ideas come from Germany. But it is, it's, it's, I think that there is, there is something about that. I, you know, I, I wrote an article a while ago about these two images and how they always. The two images in Christianity have to be held together and we have to always be careful not to collapse one to the other, which is the Son of Man, the glorious Son of Man, you know, dressed as an emperor on a throne, you know, the right hand of God the Father and also the crucified one who laid his life down. And I think that it is in holding those two images in tension that we find the solution to the problem. And we have our temptations, like everyone has a temptation to go one side or the other. And you know, it's okay to have a tendency. But in our culture right now, we're so ripped apart that we have to find that, that tension again."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":3210.73,"end":3342.68,"speaker":"James Orr","text":"Yeah, absolutely. I couldn't agree more. I couldn't agree more. And, and I think that's what, you know, it's frustrating in, in the context of the UK at the moment, Church of England, we've just lost our Archbishop of Canterbury. There's a cloud over the Archbishop of York such that he can't even step in to assume the ceremonial roles of the Archbishop of Canterbury. And, and part of that is because my view is that the leadership of the Church of England over the last few years has not been talking about self sacrifice and suffering through a Christological lens and the ultimate victory and vindication of the resurrection and the glory of the Son. Of man but has really been chasing after the false gods of secular political, political issues that are kind of with a little bit of theological window dressing around them. And I just, you know, it's just so frustrating. On the other hand, it's, you know, what I see in the kind of institutional failures of, of my own church I think is more than made up for by the emergence of this. I mean I call you guys sort of digital anabaptists. You know, this kind of these, these networks across the Internet using the tools of, the extraordinary tools and platforms of the Internet to open up the riches of the Christian faith. And I mean I think it's, I see it as sort of a marriage of tech bros and trad bros. You know, I think the work that you're doing in the symbolic world, the work that Martin does and Paul though, he's more of a technophobe, I think it's a very good reminder that those of us who are more conservative in our outlook don't need to see technology as a threat. Yes, technology can liquefy what we love and what we want to conserve. It can liquefy our traditions and conventions. But there are also ways in which it can remind us and excavate them and remind us of them and help us to channel them into our lives through our AirPods. When we're doing the washing up and listening to."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":3343.08,"end":3344.04,"speaker":"Jonathan Pageau","text":"You can't avoid it."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":3344.44,"end":3348.62,"speaker":"James Orr","text":"Listening to your podcast about Ragnarok or whatever do you think?"}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":3348.62,"end":3390.21,"speaker":"Jonathan Pageau","text":"I mean we've seen it now. I've been waiting for it to happen in Quebec but I hear now the reports are coming to me that it's happening, which is that in many of even these progressive kind of Catholic churches that are very Vatican II but kind of trying to constantly adapt, these wide eyed 18 year olds, 19 year olds just walking in from the street, they have no idea, they, you know, I've heard stories from friends of mine who live in these little towns and all of a sudden, you know, the church has been empty and gray haired for 10 years, 15 years, and all of a sudden now there are these strange people just walking in. And so I wonder if you've seen that happen in the uk."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":3390.21,"end":3526.46,"speaker":"James Orr","text":"I mean it says, really, I'm so glad to hear that that is happening. And it actually confirms what I've heard anecdotally of, of what's happening in parts of the uk. I suppose in Cambridge. It's unusual Cambridge because you've got lots and lots of churches, you've got college chapels, you've got the evangelicals you've got Catholic. I think it's. They did a study, you know, a couple of years ago that showed that I think there are more Christians in church on a Sunday per square foot in Cambridge than anywhere else. But that's a little artificial because, you know, most of that is the, you know, the 15,000 or 25,000 students that descend, you know, three times a year for eight weeks. And so it's hard to kind of get a sense of shifts. But what I have noticed is a. Those churches that stress liturgy plus orthodoxy in belief are becoming more attractive. We've even just. Here in our little commune in Cambridge, we've just basically converted a shipping container into a chapel and we need to decorate it with icons. So I'm going to have to get on your waiting list. But we've started just a very. Just a few weeks ago, one of our young students who lives with us here said, oh, I'd like to start a morning prayer. Book of Common Prayer, good old traditional Book of Common Prayer, Morning prayer two or three times a week. And he started that. We've been going along 8:30, and it's just more and more people have been coming and, and there is something attractive, you know, to finding that still point of the turning world as Elliot, as Elliot sort of talks about. And it's almost as if the more political upheaval there is, the harder life is. If you're particularly here in the uk, starting out in your twenties, getting a home is a nightmare. Wages are stagnating, job opportunities are dwindling. There is a sort of sense of, well, what can I put my faith in, what can I ground myself in? And it's a sort of almost, you know, it's a rather bleak one, but it is, it's a gateway, gateway to the gospel. It's a gateway to the kind of solidity and stability and order that Christian life can bring you."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":3526.94,"end":3584.61,"speaker":"Jonathan Pageau","text":"Yeah, I think that that's right in some ways. You know, we talk about the meaning crisis, you know, but it's a meta crisis. That's how John also approaches it. You know, there are all these things coming together and collapsing simultaneously and, and so there's no, there's no, it's not. It is a surprise, but it's also not surprising once you see it, that people are trying to find something solid to stand on and, and these young, especially the, these young people, you know, we had a, you know, someone in my parish, some 17 year old just shows up. He's just there. He took a Uber, like an Hour away from an hour away. And just came to church and, and it's just, you know, and it, and I think, I mean, this is an orthodox church. This is like very difficult. Right? It's not, it's not. So it's happening everywhere. And glory to God. Glory to God for that. Hopefully it's something that can, that can consolidate and, you know, and, and create a, a new generation of Christians."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":3584.61,"end":3592.75,"speaker":"James Orr","text":"Yeah, absolutely. I mean, I don't think it was just an accident. I'm sure that he had got wind of you somehow and that he didn't know about crazy."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":3592.75,"end":3605.47,"speaker":"Jonathan Pageau","text":"That usually it happened. Usually people that come to the parish, like, they, they, they've heard about me or they've seen me in videos, but not this guy. He was just 17. I didn't even know like what he, what he was watching or where he saw it, and he just kind of walked in."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":3605.47,"end":3652.14,"speaker":"James Orr","text":"It's pretty. It's pretty. It's wonderful to see. I mean, I just. My, my son Godfrey, who you've met, he's what, he's 16 and he is, you know, he doesn't talk much about faith, but he is, he is in church without me. He doesn't like, he doesn't like me to go with him. So we go to different churches. He goes to his own church in the morning on a Sunday morning. High Anglican liturgy, all sort of smells and bells. Then he goes to a charismatic evangelical kind of Wesleyan service in the afternoon and he does Calvinist Bible studies on Friday night. And he lucked. I mean, it's just completely non negotiable. He will. That he will never, ever miss it. And I just think, wonderful."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":3652.14,"end":3652.62,"speaker":"Richard Rohlin","text":"It's great."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":3652.62,"end":3665.94,"speaker":"James Orr","text":"I've not really done anything to, you know, particularly to catalyze this and. But I think, you know, he's a young man. He's, you know, finding his feet in an uncertain world. And these are sources of stability and meaning."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":3666.66,"end":3668.02,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":3668.1,"end":3669.46,"speaker":"James Orr","text":"And I'm so thankful for that."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":3670.25,"end":3683.93,"speaker":"Jonathan Pageau","text":"And so last question. You know, you. I think I haven't yet announced this publicly. This might be the place where I announce it publicly. So the rumor is. The rumor is that the next daily Wire seminar will be about the Book of Revelation."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":3685.93,"end":3716.79,"speaker":"James Orr","text":"Yes, this is. And I, I remember you floating the idea and thinking, oh, my goodness, what is that gonna. Because, like, there were other options, I think, in the air. And so I think I'm probably even more nervous about tackling that than I was about the Gospels. However. I trust you, Jonathan, but I think you're gonna have to do even more hand holding than you did in Exodus and God and the Gospels. But I'm really gonna. I didn't get to prepare much for the Gospels, but I think you're gonna."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":3716.79,"end":3717.79,"speaker":"Jonathan Pageau","text":"Have to prepare for this."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":3719.47,"end":3740.28,"speaker":"James Orr","text":"My goodness me. But there's just. Oh, I mean, there is so much there. And, you know, for years and years and years, I have wanted to get to grips with that text. And, well, to the extent that one can get to grips with it. And so actually, you know, having. Having that kind of opportunity is what's going to focus my mind and help me begin to grasp."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":3740.28,"end":3791.86,"speaker":"Jonathan Pageau","text":"Yes. Forces to go in and to master, at least master the content, kind of get a sense. At first, I was so nervous about it. And I also advised that we shouldn't, you know, but Jordan is like, no, that's what we're doing. We're doing revelation. Like, how else can we go from the Gospel? You know, the only place we can go that will be like. And so I'm like, okay, let's do it. You know, let's do it. But if we're going to do it, we have to do it. We have to do it properly. And I think that it. I think in the end, now that I've. It's been a few months now that I've been thinking about it and working with the Daily Wire people on it, I'm realizing that it might actually be a great thing. It might actually be a wonderful thing for a lot of people to look at a culmination of prophetic images. And it will be, you know, it'll bring together a lot of the deeper readings that we did in Exodus and the Gospel, but in this vision."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":3792.1,"end":3819.71,"speaker":"James Orr","text":"Absolutely. I couldn't agree more. And I'm so pleased that you've already kind of started work on doing all the hard work and heavy lifting and thinking that will help us. Will help us get through it. But it's also just to go back to what we were talking about, just to bring things back to what we're talking about at the beginning of the conversation. It's that, you know, it is impossible to read that text without the allegorical, tropological and anagogical spectacles on. I mean, you just, you know, what is it you have."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":3819.71,"end":3821.11,"speaker":"Jonathan Pageau","text":"You can't. Or else. What are you reading?"}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":3821.35,"end":3842.37,"speaker":"James Orr","text":"Exactly right. The great climax of Scripture is just so. So freighted with symbolism and eschatology that there's just, you know, there's no denying that, you know, Origen and the great patristic exegetical tradition had it right."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":3842.93,"end":3851.13,"speaker":"Jonathan Pageau","text":"Yeah, they could see that in some ways that's what it leads to. Like you said, it leads to this vision that you need all these senses in order to understand. Or else. Yeah."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":3851.13,"end":3851.65,"speaker":"James Orr","text":"Ross, what are you."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":3851.65,"end":3884.63,"speaker":"Jonathan Pageau","text":"What are you reading? And so. So James, thank you so much. Thanks for this wonderful conversation. Also, thanks for your continued participation in these seminars, your courage in the intellectual life. People don't know, and I don't think people understand how much courage you have in your position to be able to just joyfully stand in the traditional vision of Christianity, of society, in the world that you are. So we really appreciate your. Your existence in this world."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":3885.03,"end":3887.91,"speaker":"James Orr","text":"I can't thank you enough, Jonathan. It's been so good to be with you."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":3888.31,"end":3903.35,"speaker":"Jonathan Pageau","text":"If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase. So go to thesymbolicworld.com and thank you for your support."}
{"episode_id":"SW - #381 - 2025-03-09 - James Orr - Christianity Beyond Civilization","start":3904.07,"end":3965.05,"speaker":"Laura Diaz","text":"Tucson the Weight is Over Medi Weight Loss. They're officially open on North Oracle Road. That's right, no more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz. This is Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication, but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way and and the cost. The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better, and lose weight the right way, mediweightloss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com."}
