{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":0.24,"end":52.97,"speaker":"Jonathan Pageau","text":"You know, I listen like, I listen to the, to the poking and people saying like, what. What is going on? Like, how did he able to connect these things together? I've been thinking a lot about the idea of transpersonal agency in terms of again, trying to bridge the traditional categories like the angiology of the ancient world and the. Even just the hierarchy of gods or the hierarchy of principality that you find in every single culture. So the problem is also in terms of the dismissive tone is like, if I'm trying to bridge a way to help you understand in a more reasonable fashion, something which exists in every culture, has existed in every culture for thousands of years, it seems like this is. It should not, unless you want to dismiss those cultures completely as being stupid for thousands of years, despite also having civilizations which will probably last longer than ours."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":53.27,"end":53.55,"speaker":"John Vervaeke","text":"Yes."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":53.55,"end":123.5,"speaker":"Jonathan Pageau","text":"No, it's like, I don't know. I think that it's, it's probably a better effort rather to help, to try to help us understand what they were doing. If we can help people in our terms today, help us understand at least a little bit what they were doing, it seems like that's something that is worth the effort. This is Jonathan Peugeot. Welcome to the symbolic world. So, hello everybody. There are no introductions needed, as you can see. I'm here with my friend John Ruvake, who we've been having conversations now for several years, this growing conversation. And John is working on a new video series called After Socrates and, and so I invited him here to talk about it, kind of give us a sense of what it is he's trying to do and of course, for certain we will wander into all kinds of interesting subjects at the same time. So, John, thanks for coming."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":123.74,"end":126.7,"speaker":"John Vervaeke","text":"Oh, it's a great pleasure to be here, Jonathan. I've."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":127.18,"end":127.54,"speaker":"Jonathan Pageau","text":"We."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":127.54,"end":129.94,"speaker":"John Vervaeke","text":"I don't think we have we talked since Thunder Bay. I don't think."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":129.94,"end":148.35,"speaker":"Jonathan Pageau","text":"Don't think so. Like a few emails and everything. And so people, we're planning another conference, people, by the way, just to say it's going to be in California probably, I think in the spring at some point. We haven't, I don't think we. The dates are clear yet, but it's coming, so that's great. So John, tell us a bit about what this, this new project of yours is."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":148.75,"end":303.35,"speaker":"John Vervaeke","text":"So this, this is a project intended to be on the scale of Awakening for the meaning crisis, but it will only be 25 episodes, not 50. And so it's, you know, and really up the production value. And first I'll talk a little bit about the format. And then I'll talk more, a little bit about. About the content. I'm trying to do a lot that really explore and experiment with it. So, like Awakening from the Meaning Crisis, there'll be a lecture series, a continual argument that builds, but in addition, there'll be. I give points to ponder. And my intent is that people will ponder that individually, but also perhaps that will help discussion groups afford discussion groups forming. And then third, for almost every episode, not every single episode, but I give a practice that people can engage in, a meditative practice, a contemplative practice, a dialogical practice, and it builds in order to give people a participatory and perspectival sense of what's being talked about in the lecture. So there are these three things running, and then I also break from it just being me. And about halfway through episodes 10A and B, it's me with Christopher Mastepietro, Guy Sen. Stock and Taylor Barrett. And we take everybody through. Like, we do a demonstration and an enactment of meditation, contemplation, some of the stuff I did at Thunder Bay and beyond. And so there's that. And then also there's the series within the series, which is I break from the monologue and Christopher masterpietro and I do Socrates and Kierkegaard and the deep and important relationship between Socrates and Kierkegaard. And then that, of course, gives us a venue in which we can talk about the relationship between the Socratic project and the Christian project. And of course, Kierkegaard wrestled with that very profoundly. And that's being done dialogically. And so really trying to play with this medium and open it up and really exemplify new possibilities for how it can afford people entering into deep discussion, entering into ecologies and practices, getting involved with other people, et cetera. So that's the. That's the big sort of difference in the format. I'm very, very, very, very happy because I had an amazing crew, Chris Altorfan, his brother Casey, and some other people just doing amazing work on that. So it'll look a lot better, it'll sound a lot better, and it won't just be me in a room with a whiteboard. I'm trying to, as much as possible, exemplify what I'm talking about in the series. But maybe I'll pause there in case you have."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":303.35,"end":307.67,"speaker":"Jonathan Pageau","text":"So is there. Is there a public. During the. During the filming? Like, do you have people there with you?"}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":308.19,"end":347.97,"speaker":"John Vervaeke","text":"No, we didn't do that. But I'm hoping that, like I said, that there'll be that people will get engaged with it with other people. I'm really trying to exemplify that, encourage that and give people a chance to bring. I mean, I'm trying to exemplify even in the discussion with Chris. Right. Trying to like you and I have been doing. Trying to bridge between these worlds that have typically been isolated, even though we have tremendous resources for trying to bridge between them. And again, trying to do that in a dialogical, logical fashion. Chris is an ardent. I don't know what to call it. Follower of Kirkegaard. And you know Chris, you know, how eloquent."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":347.97,"end":352.13,"speaker":"Jonathan Pageau","text":"Yeah, I had a discussion with him that was gonna probably be up by the time this one goes up. So."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":352.13,"end":449.46,"speaker":"John Vervaeke","text":"Yeah, excellent. That would be great. So that, that's the, the format of it. The content is after Socrates in, in a bunch of ways I'm trying to. I'm after Socrates in the sense of pursuing him and trying to understand him. And all the people have. Who have tried to pursue him and understand him. And then there's after Socra sense of, well, who are these people that came after Socrates? And so I'm trying to trace out the whole tradition, the Socratic tradition all the way through up to its culmination in people like Erigina and Cusa. I pick them for specific reasons. I know you. Why isn't Maximus in there? Or something like that. But here's my reason. For me, two of the main themes are this interconnected of that reality is inherently dialectical in the Platonic sense. And Erigina for me is really, really clear on that. And then Nicholas of Cusa is the corresponding learned ignorance. And learned ignorance, I think is the culmination of the Socratic proposal that the wise person is the one who ultimately knows what they do not know. But of course taken through this whole huge Neoplatonic and then eventually Christian Neoplatonic tradition. And what I'm trying to do is help people. I'm not claiming that this is what was going on in Socrates or the Platonic dialogues, although I'll make a lot of arguments around it. But I'm trying to revers engineer from this whole entire tradition. What is right, this whole Socratic, Platonic, Neoplatonic practice of dialectic into dialogos. What I'm trying to reverse engineer it and make it plausible, make it powerful, make it practicable for people. That's the content."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":449.86,"end":472.37,"speaker":"Jonathan Pageau","text":"Yeah. So there. So definitely it's not like. Because the first series you did was more like kind of the history of thought through your lens and also explaining the notions of relevance and all these kind of concepts that you play with. So here you're really dealing with basically taking someone by the hand and kind of saying, like, okay, so now let's do. Do this. Like, yeah, actually."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":472.85,"end":568.02,"speaker":"John Vervaeke","text":"Exactly. Exactly. Now let's do this. What would it be like to take this up as a way of life and to very responsibly put that way of life into deep conversation with other ways of life? So, you know, I talk at the beginning about, you know, Socrates and Jesus, and I believe this is done very respectfully. One of the people, Casey, is a Christian. And so he said. So I was right. And you know, because they're both. They both talk about being midwives, helping give birth. And I, you know, and there are Christians who have talked about that. And I said, so I want to pick up on that. And then that's why it leads into, you know, what are the. What's the deep interconnections between the Socratic way and the Christian way? First in that, you know, culmination in Erigina and Nicholas of Cusa, but also in this deep dialogue that I'm having with Chris about Socrates and Kirkegaard and how Kirkegaard is really. I think I really recommend people to really like the philosophical fragments where he's really wrestling about, how did Chris put it, He's a follower of Jesus, but Socrates is his teacher. Right. And so there's this real. Because, you know, he wrote his PhD thesis on Socrates and things like that. Right. So I'm really wanting to help explicate, exemplify the Socratic way. And I'll. I'll name that for that whole tradition and trajectory. And then how it's also bound up with the Christian way, how it's bound up with the cultivation of wisdom. And I will. I do bring some cogs. I."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":569.22,"end":570.42,"speaker":"Jonathan Pageau","text":"How could you not?"}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":570.66,"end":599.44,"speaker":"John Vervaeke","text":"Right. I bring it in along the way. There's stuff around, relevance, realization, stuff that's come up, up about, you know, in the discussions I've had with you and with Paul, the discussions I had with the Buddhist monks when I was at Maple and things like that. So, yeah, it represents. Really trying to turn this from theorizing into proposing how one could enter into a way of life."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":601.58,"end":615.98,"speaker":"Jonathan Pageau","text":"So do you think that, let's say, because you talk about how, for you, this process culminates in Urogena and Nicholas Vousa. Do you think that in the west people went away from what Socrates had brought at that point?"}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":616.38,"end":689.18,"speaker":"John Vervaeke","text":"Yeah, I think so. And this comes out at the very beginning of this series when I talk about sort of what's called new way, third way. Sometimes people also say third wave Platonism, which is this whole new recent scholarship around Plato that's really taken off important figures like Gonzalez, Drew, Hyland, Kirkland, Ruchik, a whole bunch of important scholars who are really arguing that. And this follows in some way from earlier points. Well, I won't go into that because that's just another can of worst that I do. We've treated the dialogical nature of Plato's philosophy as ornamental, actually essential and central and crucially important. And of course, this ties in with my argument that the propositional, the procedural, the perspectival and the participatory are all bound up together, and that dialectic into dialogos is central to that. And I think we've only recently, in the last 20 or 30 years, has this become the new way of really understanding Plato and correspondingly understanding Socrates. Because you can't pull them apart, right?"}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":689.18,"end":689.54,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":690.18,"end":752.93,"speaker":"John Vervaeke","text":"That, I think, affords us a profound recovery of what was really going on in that tradition. And for people who are even like yourself, who are a Christian. Right. Why were Christians so deeply attracted to this way? Why did it matter so much to them? Why did they feel that they needed to enter into deep dialogue with it? If you go into most. Well, so I'll change that. If you went into the philosophy classes I went into about Plato and Socrates, you would. You wouldn't have any clue as to why does anybody care about this, other than some arcane arguments about whether or not there are universals and stuff like that. And so very much trying to bring this back. And that's also part of a larger project, which is this thing I've been talking about. And I've mentioned to you how I think Neoplatonism can form like the courtyard of dialogue. It can be the intellectual silk road because of its capacity to enter into deep reciprocal reconstruction with Christianity and Judaism and Islam and Buddhism, etc."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":753.09,"end":793.31,"speaker":"Jonathan Pageau","text":"Yeah. And so, I mean, I'm curious about what you said in terms of the idea that the importance of the. The dialogue format in terms of what it is that Plato was trying to. To manifest. Because you're right, usually the way it's presented to us, and I remember in my philosophy classes, it' presented to us as if, right. Socrates is the protagonist and then the other characters are basically reacting, questioning, challenging Socrates. And then Socrates is. But he's the one. He's the thread you have to follow. And so how do you see that, like in terms of how the dialogue functions in the. How the dialogical aspect functions in the dialogues."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":794.03,"end":934.22,"speaker":"John Vervaeke","text":"So it's very important to pay attention to the fact that many of the dialogues end in aporia, which really undermines the claim that what Socrates is doing is laying out an argument and he's got a conclusion that he's trying to get us to instead. So, for example, there'll be a dialogue on courage, and you'll have two figures, two generals, I believe, and they'll both be talking about courage. And then Socrates will do his thing, he'll ask the questions, and the definitions don't hold. They don't. Right. And if you just follow sort of the propositions and you don't pay attention to the drama, you'll come to the conclusion, oh, well, look, it just ends in skepticism. Socrates himself says, I don't have a definition. Right. Pay attention to the drama. The two generals, first of all, they represent different things. And I'll come back to that in a sec. The two generals say, we want our sons to spend time with you, Socrates. Because it was. The whole question was, where should we send our sons to be educated so they're more likely to become courageous. So wait, wait, wait, what's going on in this doc? If you pay attention just to the propositions like skepticism, but why, if this argument just leads to a skeptical conclusion, do the general say, and this is a moment of drama, oh, but we want you to be the person that we send our sons to in order to learn courage. And you realize, oh, Socrates is right, he's exemplifying the virtue. And part of the exemplification is the point that it has to be exemplified. It cannot be captured by statement. But you don't see that. If you don't follow the drama, then you have to pay attention to the character of these two generals and what they. This one, the one general, he all. He just. I know, here's my intuition, right? And Socrates says, challenges that first person intuition, the other person, the other person represents sort of third part authority. Well, the sophist taught me this. And here's a definition, and here's a definition, and Socrates demolishes that. So the first person and the third person are demolished, and what's left is the value of the second person perspective, the dialogical perspective. You have to put the character, the drama together with the argument to see what is actually happening and what is actually being conveyed. Did that make sense? As."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":934.62,"end":983.95,"speaker":"Jonathan Pageau","text":"No, that makes sense. I mean, it's like Because I think that I've also been very influenced by the way that I was taught Plato. And so, you know, also because of Plato's kind of hostility and Socrates, the hostility that existed between him and the playwright, the hostility between, between the way that Plato represents the poets and all of these ideas, the way in which you feel as if the, the dramatic aspect of the, of the dialogues would be accidental, but, I mean, it would make. I think you're forcing me to rethink, to rethink the dialogues myself because. Because what you're describing makes a lot of sense. Like, it makes a lot of sense in terms of. Of how it is that. It can also help us explain sometimes why Plato. Why Socrates does certain things which are sometimes rather mysterious. Like in terms of logic."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":984.11,"end":1055.03,"speaker":"John Vervaeke","text":"Oh, yes, yes, exactly. Because he's often doing something for a pedagogical purpose than for a strictly logical connection to be made. And like Reid, I got the great pleasure to talk to him and we're going to talk again. D.C. schindler, his book Plato's Critique of Impure Reason. And he just lays out, like, even the structure of the Republic, how Socrates goes down to Piraeus and then, like he's actually exemplifying going into the cave, right. And then coming out of the cave. Like there's. All of this is going on and you have to pay attention because why is Plato putting in that structure? Because Plato's trying to emphasize that the ascent and the return are both important to understand what Socrates and what wisdom are about. We have tended to only emphasize the ascent. But Socrates's return into the depths of the cave is as important to understanding the Socratic project. And so again, you have to pay attention to the structure. And I think, I agree it's. It helps to explain so many things. Like there's dialogues in which Socrates is the one that's getting sort of beaten up. The Parmenides famous."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":1055.11,"end":1056.35,"speaker":"Jonathan Pageau","text":"Yeah, yeah, right."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":1056.35,"end":1103.66,"speaker":"John Vervaeke","text":"And there are dialogues when Socrates withdraws or he's not even present, like the later dialogues, because Plato is. He keeps trying to dramatize and write something. And he's trying to. And in the letter, Right. You know, the seventh letter, Plato talks about how he. He gave the world a more beautiful Socrates. Right. And so you have to, like, there's something going on there above and beyond. This is just, you know, a stage so that Plato's mouthpiece, Socrates can utter propositions about some theory that Plato has, which I, I agree with many of the current scholarship. Plato doesn't have a theory of the Forms. The forms don't play that role in his theory. They have a much different function. And that's related to all this dialogical stuff we're talking about. But I'm talking too much."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":1103.82,"end":1111.49,"speaker":"Jonathan Pageau","text":"No, no, no, this is, this is great. So, I mean, what are you hoping to, like, what are you going for? What are you hoping to accomplish with this?"}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":1111.73,"end":1131.29,"speaker":"John Vervaeke","text":"Well, I'm hoping that. Well, some things have already happened. Some people are even before this because of some of the interviews I've been having and discussions. They're going back and rereading Plato and getting stuff out of it that they didn't get before. And I think that's important because I agree with Arthur versus Lewis, because we often don't read."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":1131.29,"end":1182.45,"speaker":"Jonathan Pageau","text":"We often don't read the actual. No dialogues we read, you know, regurgitations of them. Like we. Because we read, read in secondary sources. I had a similar experience. I read the Phaedra recently because I. Because I was talking about the problem of Pharmakon and I was in. And so I went back to read Phaedra and. And now that even what you said just lit so many things for me. Because there's some gestures that Socrates poses, like he covers his face at some point because he's too embarrassed to say certain things, you know, because, you know, it's like a. It's like this weird relation of seduction. You're not sure exactly what's going on in terms of Socrates and Phaedra. And so you realize that the gestures he's posing, the, the actual physical, the way that he's described his acting is part of what he's trying to bring out in the problem of this outside world that he's in. You know, crossing the river, going outside the city. And now what is that space, you know?"}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":1182.45,"end":1285.04,"speaker":"John Vervaeke","text":"Yes, yes, and you get the emphasis. This is, you know, this goes way back to Gonzalez's book Dialectic and Dialogue and Plato, which is one of the first books of the Third Way, arguing that Plato is really trying to point us towards non propositional knowledge, non propositional knowing. You can see why I would find that important and how central that is for actually enabling and affording profound transformation. And that the Socratic cultivation of the self is a properly aspirational cultivation of the self, and therefore it is committed to profound transformation. So all those things that Socrates are doing that are so weird, right, if you go back and reread them, they make a lot more sense, which is what good exegesis would do if people could read in this new way. That's important. I agree with Arthur versus Lewis that I think Neoplatonism is kind of like the spiritual grammar of the West. You and I sort of agree and sort of disagree on that, and that's fine. But I think the degree to which people are, and I don't mean this in an insulting way, but degree to which people are ignorant of it and degree to which people only know of it as a set of propositions about weird things that people used to think, I think is the degree to which people are cut off from this very valuable, well, way of life. And I want people to be, I want to be able to afford people returning to this way of life. And as I keep emphasizing that returning to that way of life in a dialogical fashion, which means that way of life has to be put into dialogue with other important ways of life. And that's what is needed right now. Well, that's my proposal at least."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":1285.2,"end":1317.45,"speaker":"Jonathan Pageau","text":"Yeah, I. What I love about what you're saying in terms of our constant discussion is that, that there is a sense in which you seem to be proposing that the, that's a. The vision that Plato presents or the, even the vision that, that Socrates presents, you know, through, through Plato is bound in the drama like it's a story. It's Socrates story is really that which is carrying, let's say they're just preventing the, the ideas from being only propositional, which is bringing them into, into this engaged experience."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":1318.17,"end":1442.73,"speaker":"John Vervaeke","text":"Yes. And again, I don't deny the importance of narrative, but I would say that the point of the narrative, given my previous point, is to take us to what is beyond the narrative, the non propositional, the non narrative in some fashion, the relationship to the good or to the one. And I think that's important because of you. I'm in and I'm grateful for this. I'm in. And these videos are going to be released soon. I mean, I'm going to have two videos. But I've had discussions beyond this with, with Bishop Maximus from Patagonia, who's an Eastern Orthodox bishop and also, but also philosopher. He teaches in the seminary and we've been having an ongoing discussion about this. He has a proposal about what he called, and he's very strict about this, the transfiguration of Neoplatonism within Christianity and how that differs from how it was taken up in the west in Scholasticism. I think that's, that's very, very cool. And so I don't want to deny what you said, but, but I, but I want to say that and Plato Uses mythos. And this is something people forget. Like, and he uses symbols in your sense of the word. The divided line is not an al, is something more like the sun isn't just an allegory. We literally do depend on the sign. Right, right, right, right. And so like you have to take all of these things. You have to take the symbols, the narrative and the argument and also the character that's being portrayed. All of this has to be taken in. And I would argue, because what Plato's trying to do is, I mean he's clearly trying to get us. He's trying to activate and integrate and make it present to us the non propositional and how important and central it is and how much it affords a way of transformation. And that's why he uses all of these things, because he's trying to simultaneously trigger the, the propositional, the procedural, the perspectival of the participatory and integrate them and then orient them towards something."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":1444.25,"end":1517.1,"speaker":"Jonathan Pageau","text":"Yeah, that's. I mean, I think what you're saying. I mean, like I have to stop thinking because, because it's really, I'm really. It's like I'm going through what I know. Like I haven't read all the dialogue, but like, of the dialogues that I have read, I'm kind of going through them and I'm seeing. And also because there's some elements, like you said, there's some elements of the dialogue which gets pulled out sometimes and shown as being exemplary of what Plato thought. But then you find contradiction if you, if you see it there. Yes, right. And so, right in the symposium you get this silly myth, right? The silly myth of the, with the round people, like there's this idea, do you want a logo? So you want a myth and get this like really silly myth of these circuit round people, like the two opposites that join together. Which is weird because the modern people are now sometimes using that as a actual like myth that ancient people believe. But when you read it in the text, it's clear that this is. They're making fun of, they're making fun of this. And so I, I've read, I remember having professors telling me like, this is Plato mocking mythos and how mythos isn't part of, of his thought. But then when you go into, when you see some of the images you use, like the image of the chariot, for example, with the two horses, like there's these images that he uses that are, that are right out of like my symbolic playbook, right. They, they just, it perfectly fits into this idea of a."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":1517.65,"end":1549.3,"speaker":"John Vervaeke","text":"And even there, I think Plato's critique of Aristophanes is nuanced. I don't think it's mockery. I think he also thinks there's something right about this idea of love, finding something that is lacking in us and that we can't give to ourselves, but we nevertheless need for our core self. Like, there's stuff in there. Because Socrates actually says that he thinks that. Well, it's sort of. Plato seems to indicate that Aristophanes speech is the best one until Socrates speech."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":1549.3,"end":1549.5,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":1549.5,"end":1560.34,"speaker":"John Vervaeke","text":"Yeah, yeah. Because all the other ones are like sort of medical reductionism and just self. Self indulgence. But Aristophanes is. So. I agree there's a critique there. I think it's more subtle than walking. Yeah."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":1560.34,"end":1561.06,"speaker":"Jonathan Pageau","text":"Okay, good."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":1561.06,"end":1581.34,"speaker":"John Vervaeke","text":"I think. I think it's like, again, it's like, what's going on there? And so it's. I think it's Plato in that sense, sort of being better than Aristophanes. He's not simply like Aristophanes does in the clouds. He's not simply mocking, you know, but he's doing something a little bit more nuanced and, and sophisticated around that."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":1581.34,"end":1582.5,"speaker":"Jonathan Pageau","text":"Yeah, you're probably right."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":1582.5,"end":1582.78,"speaker":"John Vervaeke","text":"I."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":1582.78,"end":1587.7,"speaker":"Jonathan Pageau","text":"Maybe it's because I want him to be mocking her stuff and he said so. I agree with that. Even that way. Even more."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":1587.7,"end":1601.46,"speaker":"John Vervaeke","text":"I mean, but. But think about it. I mean, there's even something in your work a lot about the left and the right hand and the masculine feminine that, you know, I get it. It's. It's presented in a comical fashion. He's Aristophanes."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":1601.46,"end":1601.82,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":1602.13,"end":1605.81,"speaker":"John Vervaeke","text":"But there's something in that myth. That myth is also pushing on those."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":1605.81,"end":1635.86,"speaker":"Jonathan Pageau","text":"Yeah, the idea of the androgynous being for sure. Like, I tend to see the creation of Adam and Eve as being something like. Like, like when it says that it took Eve from Adam's side, I tend to think of it like, cut in half. Like this idea of separating a being into two opposites. That's the way that I tend to see it. So. Yeah, definitely. Definitely. So, I mean, I think this is. It's exciting. I can't wait to. I definitely can't wait to see it. And so are you. Are you offering it on YouTube? Are you going to be charging for it? Are you. It's going to be just. Okay, right?"}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":1635.86,"end":1751.34,"speaker":"John Vervaeke","text":"It's free. It's going to be free. And it's going to start January 9th, which is a Monday, and it'll be twice a week, Mondays and Thursdays. And you just go on the YouTube channel and you can watch it and there'll be some more promo videos and I'm going to release a couple of videos to try and try to help people. Hopefully not in a heavy handed fashion like how to, how to take this, how to relate to, to After Socrates. And so I'm very excited about it too. It's, it feels awakening was really comprehensive. It was this huge argument. This one is much more, like you said, it's a bunch more about trying to conduce people into. Right. A pathway and I think of one that we've lost and one that I think we need to properly recover as a way of responding to the meaning crisis. So it goes towards a criticism and a good criticism that many people made and you made a version of it. And you know that I've responded in the ways that I can to your criticisms. I take them, I take them to heart. But you know, but at the end. But, but what do you do? Like. Oh, you have a few practices and like. And that's. No, yeah, that's exactly right. That's a good criticism. There's been two fundamental responses and they're bound up in After Socrates. One was you and Paul and you particularly, you know, this is a very individualistic project. And, and so I've. Yeah, no, no, you're right. This is why the dialogical so important. Secondly, it's like there's some practices and all that, but you know, there's a way of life and. Yes, right. And that's what I'm trying to bring out together in After Socrates. Yes. Not make this, you know, individualistic in nature, make it properly dialogical rather than monological and also not don't just talk about some practices and some, but talk about something much more comprehensive, a way of life. So that's, that's how I'm trying to respond to some of the criticisms. Yeah."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":1751.34,"end":1768.35,"speaker":"Jonathan Pageau","text":"And in some ways also I think what's interesting is I kind of see you honing in on a Neoplatonic like more and more like honing in on this Neoplatonic strain. And it also has a, it also I think has the advantage of being something that already has a coherence to it."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":1768.35,"end":1768.55,"speaker":"John Vervaeke","text":"Right."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":1768.55,"end":1861.4,"speaker":"Jonathan Pageau","text":"It already is a kind of coherent body. And so on the one hand you can reinterpret and you can let's say, play with it in ways to emphasize certain things and not. But it, but I think that it definitely will, I think for people kind of coming to it, it'll, it'll present more as this, as a path like this. Here's this coherent path that has existed for, for thousands of years. It's like, it's part of the Western path for sure. Like, there's no way to avoid it. This has been, you know, this has been something that has followed through from before, before Christianity. It influenced Judaism and then it kind of went into Christianity. And so for. Even if Christians sometimes can criticize, they'd say, like, no, we need the, we need the Christian version. Let's say it's at least, I think, a robust position to hold. Like, it's a. It's a place to stand where you can really engage in the discussion. And, and you have all this foundation to, to pull on. And it doesn't. Because a lot of the new spirituality, sometimes people, they pull in from everywhere. Right. Which is. Which I understand why, because in some ways that's what happens when you're kind of lost. Not lost, but you're. When things are broken, you're like, okay, you know, pointing like this. And so, you know, you go to, you'll go to a conference and then people will be, you know, it's a Western person standing in front of you who probably grew up as a Christian. And, and all they're citing Buddhist texts and Indian texts and a native. And native perspective and everything. And it's like, well, okay, I get it, but now what? Like, what do I do? But, but the Platonic tradition, it has that core. It has that place to stand on. It feels like."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":1861.64,"end":1891.9,"speaker":"John Vervaeke","text":"Thank you for saying that. The. I mean, I'm, of course, proposing. I'm not proposing nostalgia. I'm proposing we pick it up and how to move it forward. That's a big part of it too, but exactly. Thank you for saying that. And, and secondly, that. That, that hopefully shifts the focus off me onto this path and way of life. And I'm trying to articulate it and I'm trying to. I'm trying to contribute and to propose how it can be taken forward and."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":1891.9,"end":1895.58,"speaker":"Jonathan Pageau","text":"It can help you deal with the guru problem. Like the modern guru problem."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":1895.58,"end":1930.33,"speaker":"John Vervaeke","text":"Yeah, exactly, exactly. I want to avoid the guru problem. And, and so both of those things are important. And after Socrates is an attempt to address those two. Like you say, can this be a coherent thing that feeds back into traditional. Yes. And then the second one is, how do we. How do we get this focused on a way of life and not sort of just on me and the things I'm talking about? And so it's trying to do both of those as well. That's also why I have people other than me playing important parts within the presentation."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":1932.01,"end":1941.37,"speaker":"Jonathan Pageau","text":"Yeah, I mean, we'll definitely be paying attention to that. I mean, it sounds great. I can't wait to see and I can't wait to argue with you about things that I don't agree with."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":1941.7,"end":1983.25,"speaker":"John Vervaeke","text":"Of course. Of course. And I expect you to. And I hope you see that I'm responding to a lot of criticisms and, you know, criticisms given with affection and respect by you and others in how I'm doing this. I, I, this is my way of trying to be deeply responsive and responsible to a lot of those points. And of course, I expect that you and Paul and other people will like, well, this is where I disagree with John, and that's fine. But I do, there's, there's a way of responding to criticisms that is not the attempt to silence conversation or prevent disagreement, but that at least people acknowledge. Yes, you heard me and you've done something constructive in response. And that's what I'm trying to do."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":1983.65,"end":2043.8,"speaker":"Jonathan Pageau","text":"That's great. Yeah, that's wonderful. And so based on what on that. I think that one of the things that I've appreciated that's been, that I've seen happen recently is, you know, there, there was this contentious, we didn't seem contentious when we were talking about it when we had this discuss while ago with Rebel Wisdom. And I brought up the idea that the way that you talk about transpersonal agency seems to connect very closely to the ancient way that people talked about, about spiritual beings and how spiritual beings affect us and everything. And it seems like there was an interesting possibility of creating the bridge and that I think since I've been speaking on YouTube, it's the thing that I, that has brought about on me the most criticism. And it's also because it's probably until then I didn't touch, like I was far enough from, let's say, touching the modern psychological apparatus or the modern way in which we understand things so that people either didn't know what I was talking about or didn't see how it was going to affect, like their worldview."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":2043.96,"end":2044.92,"speaker":"John Vervaeke","text":"Didn't challenge them."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":2044.92,"end":2082.64,"speaker":"Jonathan Pageau","text":"Yeah, and challenge the worldview. Exactly. And so I've appreciated, I, I've seen you, let's say, being forced to like, defend just even talking to me in terms of, in terms of this question. So, so I wanted to express that. Thanks as well, because I really appreciate it. I know that in some ways probably it's still an exploratory discussion. Yes, I know that that there are several questions that still need to be, let's say, that have to be dealt with in terms of understanding how these things bridge or not or how they connect. But, but I appreciate the fact that, that you defended me, let's say, or you tried to defend my position, even though you don't necessarily even hold my position."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":2083.39,"end":2107.87,"speaker":"John Vervaeke","text":"I, Yeah, I, well, first of all, the defense of the proposal is because I think there's, there is parts I deeply agree with. We do disagree on some points, but there's parts I deeply do agree with. And, and even the parts I disagree with, I think it is a proposal that should be taken seriously. And, and yeah, I, I, yeah, there was a couple of videos and I also did, I did a stupid thing. I tried to make an argument on Twitter defending you."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":2108.11,"end":2109.99,"speaker":"Jonathan Pageau","text":"Yeah, yeah, we're never do that."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":2110.55,"end":2205.58,"speaker":"John Vervaeke","text":"Yeah, well, I have to say there was a lot of positive uptake of that argument. And so, yeah, there were sort of three venues in which I tried, like, because they were trying to make you sound like an idiot. And I am. First of all, I'm really convinced you're not an idiot. And secondly, I just, I also deeply dislike that strategy. I mean, I get it a lot too. It's usually along the lines of John is just blah, blah, blah, blah, blah, therefore I can dismiss him. It's a dismissive strategy rather than an engagement strategy. And I think there's no defense at all for dismissive strategies. I think if you do it, this is a strategy, you deserve to be dismissed seriously. And so that also sort of got me a little bit like, first of all, Jonathan's not an idiot. He enters in good faith and he brings a lot of intelligence. I, I tried to bold out what I thought the argument was, at least how I was taking it. Right. And then, and then it's like, don't be dismissive. Engage or shut up. Right. I'm sorry, I'm just like, like, please, right. We, we do not need like that, that dismissive that I don't have to think about you. Because here's my, you know, you've put in two decades of work and I can dismiss it by this three premise, this three sentences response. I, like, like, come on, like, please, right? Enter in, like, ask questions, make criticisms, but, but do it in an engaged fashion. Don't try to be dismissive. And what I was hearing was an attempt to dismiss you, which is also what, what, that irks me. Yeah."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":2205.58,"end":2265.05,"speaker":"Jonathan Pageau","text":"And so I, I've been thinking a lot about, because that, you know, I, I listen Like, I listen to the. The poking and people saying, like, what. What is going on? Like, how does he try to connect? How is he able to connect these things together? I've been thinking a lot about the idea of transpersonal agency in terms of, again, trying to bridge the traditional categories, like the angiology of the ancient world and even just the hierarchy of gods or the hierarchy of principality that you find in every single culture. So the problem is also in terms of the dismissive tone. It's like if I'm trying to bridge away, to help you understand in a more reasonable fashion, something which exists in every culture, you know, for. Has existed in every culture for thousands of years. It seems like this is a. That should not, unless you want to dismiss those cultures completely as being stupid for thousands of years, despite, let's say, also having civilizations which will probably last longer than ours."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":2265.13,"end":2265.57,"speaker":"John Vervaeke","text":"Yes."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":2265.57,"end":2282.22,"speaker":"Jonathan Pageau","text":"No, it's like, I don't know. I think that it's probably a better effort rather to help. To try to help us understand what they were doing. If we can help people in our terms today, help us understand at least a little bit what they were doing, then it seems like that's something that we. That is worth the effort."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":2282.46,"end":2379.17,"speaker":"John Vervaeke","text":"I totally agree, and I think you're right. I think that part of this is right, exactly. Sort of the Enlightenment mythos of the priority of the present and the future and the past is something we leave behind because it was bound in superstition, et cetera. I think it's completely legitimate for us with knowledge that we have, that people in the past didn't have to make criticisms. But I think it's also important to realize that we, as you said, are also locked into ways of seeing that might be open to serious education by paying attention to what other cultures at other times have said, even our own culture in previous historical epochs. This is part of what I was saying earlier about, like, we had a way of reading Plato that was largely so that we could put Plato behind us, so that we could get to Descartes. This Introduction to Philosophy. Here's Plato, here's some Aristotle. See why this doesn't work. Descartes, right? And then Descartes, Kant and Boosh, right? Because all that really matters are these core epistemological problems. It's like, well, maybe not. Maybe that's actually the wrong way of framing the whole problem of right. And so I think that, that, that there's a lot of trying to dismiss you because you, you are doing exactly what you're talking about. You're talking you're trying to say maybe there's something we can learn from these people and their mythological worldviews. I happen to agree with that. I don't happen to agree with everything you say about it, but I happen to agree with that part of it."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":2379.17,"end":2379.65,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":2380.13,"end":2398.55,"speaker":"John Vervaeke","text":"And I'm not quite. And I even, and I, even when I made the argument, I said like putting aside the religious thing, Durkheim makes similar arguments. Durkheim is like central to anthropology and sociology. I'm not saying Durkheim is right, but people don't go, oh, stupid Durkheim. Like, no, no, he's a pivotal figure."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":2398.79,"end":2441.47,"speaker":"Jonathan Pageau","text":"Yeah. I think the difference between, let's say what I am trying to propose and what Durkheim would have been proposing is that I am proposing a type of agency which is real coming from above. And so it's not just that humans put things as, you know, elevate things as being, let's say, totems, you know, or, or characteristics that they, that they create their identity around, which is, which seems to be more a bit what Durkheim was proposing rather that there is also, there's definitely a top down relationship that that identity then binds and that there is a form of agency which binds coming back down on the group, which is, which is bound by it."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":2441.79,"end":2481.14,"speaker":"John Vervaeke","text":"Okay, so two things to say about that. First of all, that second part, I think there's a cognitive scientific argument to be made about that, about distributed cognition and collective intelligence, top down causation. And you know, that you and I talked about that. The other thing is, I think, I think you should be a little bit more charitable to Durkheim. I think Durkheim, he doesn't have that developed, but he definitely has the idea of the super organic and that that represents or has an impact on people. It's, I think it's preliminary in Durkheim, but I think there's a legitimate opening even within Durkheim for talking about. Right. Collective intelligence, distributed cognition and its top down effect on an individual participants, which only strengthens the argument to my mind."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":2481.46,"end":2671.98,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah. And so, and I've been thinking a little bit about the question of independent existence because I know that's one of the things that came up in the discussion, which is that do these angels exist without humans? Right. Do these transpersonal agencies exist without humans? And I tend like, I always have the same approach. Like my, I really believe in a fractal structure of reality. And so if I want to test something up here, I test it down here at my level. And I, and I, I use that as an analogy to help me transpose the problem. And so the question, the same question can be asked about me. The question is, do I exist without my body? And the answer is it's a ridiculous question. It's actually not a question like what are you asking? You know, the, at least in the Christian position, like St. Gregor of Nyssa says clearly that humans begin, that human begin to exist in their bodies. They don't pre exist in some temporal way. You could say that they exist in the mind of God from all eternity, if you wanted to say something like that. Or they exist in the totality of all things. Like there are ways to formulate like a kind of pre existence, but it's not, it's not a pre existence in time. And so the idea of understanding transpersonal agency seems to be the same. So there's a manner in which we can say it pre exists, just like you could say about you to a certain, in certain manner. Like just follow me through this argument, right, that you preexist your body. And the reason why you could say something like you pre exist your body is because the elements of your body are changing. And so like the actual like chemicals in your body and the parts, like they're not the same that you had when you were born, right? They, they, they, they've moved. They, it's like it's a, it's a, what is it? The ship of Theseus problem. And so you, you, you pre exist your body in that sense. And so you could also understand that transpersonal agency pre exists the bodies in that sense. That is a basketball team that has a coherent agency acting on it, that acts as a, as a body. The players can change, right? And even the management can change. There's a certain amount of variability possible in the body, but the agency can remain the same despite the change of the body. There's a limit. There's a limit. At some point if you shatter the manifestation too much, like if you shatter the body too much and at some point it, some point it separates and then there's no, then there's no being. Like there's no being anymore. But so I think that if we see it that way, then we can both understand the reason why we talk about angelic pre existence, but also understand that angels don't exist without their subtle bodies either. Like they exist in the world through the effects that they have. So that, you know, the angel of charity doesn't exist without charity. Like there has to be acts of charity in the world. For the angel of charity to exist, like the. Let's say that the angelic. The virtues which are one of the hierarchy of angels are the easiest to understand. In that sense it's like there is no angel of hope without hope. There has to be hope. There has to be a body of hope for the angel of hope to exist."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":2672.38,"end":2782.38,"speaker":"John Vervaeke","text":"First of all, this is tremendously helpful. Let me, let me try and say something similar. And so we talk about, you know, non reducibility. The. You can't reduce. I can't reduce you to your chemical structures because you are instantiated in different chemicals. And your body isn't the same even physical body it was when you were 25 and all that sort of ship of Theseus kind of thing. And same thing with a computer program. I can put this computer program in this computer or that computer or that computer. What makes it the same program now? Can it be free of any computer? That's weird. But can you reduce it to any one computer? No. And in that sense it, you know, it pre exists being in that computer because it's in this computer, et cetera. And then secondly, like you said that these things can't exist independently of their manifestations. And I think I'll try and phrase this as a question. There's a connection that coming. We got into a point in our discussion where I proposed to you that these higher things might not have consciousness or self consciousness. And you were very gracious about that. You said, you know, there might be something in that because the angels are actually really weird in a lot of mythology. And they like the angel of Death, is that like, is that a self conscious being and stuff like that. Like. And I thought that was also very helpful because I think there's a lot of questions that are being mixed up together here. Are these things self conscious? Do they exist before us independently from us, self consciously. And I think what you're saying, and I'm not saying we completely agree, but you're saying those questions are kind of picking up on the wrong parts. Like you're emphasizing aspects of the mythology that are. Are not actually the parts that should be emphasized. So I guess what I'm asking is does that sound like I'm getting you fairly."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":2782.62,"end":2877.96,"speaker":"Jonathan Pageau","text":"I think so. I think so. I think I do think that I'm definitely. I'm far more open to the idea of consciousness, transpersonal consciousness, because I really don't see any reason apart from that I can't experience it. That they're. That they're that consciousness and self Consciousness should, should that human beings should be the crown of, of consciousness. Like, I don't necessarily see that that's necessary in any way. Like, because I see consciousness scaling, you know, up to me, up to a human. Like I said, just because. The reason why I, I hesitate is because I can't experience the consciousness of a transpersonal being. Like, I, I don't have access to it. I don't, I don't know. Like, I don't even know what that would be. Like, what type of consciousness would it be? But I definitely don't exclude it because, because there's something, it's interesting though. There's something about agency and consciousness which I find fascinating in some of the secularist type of argument, which is that there seems to be a desire to make like the human person very, very special in some ways because like the offense that I feel like there's almost this, this sense of, like that all of a sudden, you know, you're touching this deep taboo when I say, why wouldn't there be transpersonal consciousness? Like, why does it bother you that that would be a reality? If you notice the pattern of agency acting on groups of humans, why does it bother you that there would be consciousness? As even a materialist, like, even as a naturalist, why would the human being be the summit of all things? Like I said, that's also something that I, that I've been wondering about in terms of."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":2878.68,"end":2956.76,"speaker":"John Vervaeke","text":"Yeah, let me help you on that point and then I'll. First of all, it's like notice how important consciousness and self consciousness is for agency and for attribution. And you're trying to put that into a worldview that often tries to claim that consciousness and self consciousness are reducible at the phenomenal of knowing. Like, that's a big tension, that's a huge tension in, in that sort of position. It's like, then you're saying that there really is something ontologically real and important about consciousness and self consciousness and that doesn't fit in well with any kind of reductive materialism. So first of all, I think you're arguing a bit of strength in there. Secondly, this has to go and I don't want to repeat our conversation, right? I never said in principle that it wasn't possible. I just said I think I do, I do kind of something like you do. I look at what are, what are the conditions that seem to track here with consciousness about connectivity and recursivity and stuff that really exemplified in the nervous system. Do we have good evidence that that's Possible. Is it logically possible? Yes. Do we have any physical means of instantiating that right now? I don't think so. So I tend to say I think we have clear evidence for intelligence. I think that. Not in principle, but in practice right now I don't see how it can be the case."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":2956.76,"end":2960.28,"speaker":"Jonathan Pageau","text":"So you would say intelligence and agency, but not consciousness."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":2960.6,"end":2962.29,"speaker":"John Vervaeke","text":"But. So here's my full thing."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":2962.29,"end":2963.57,"speaker":"Jonathan Pageau","text":"We're not self consciousness."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":2963.73,"end":2974.81,"speaker":"John Vervaeke","text":"Right. Intelligence and agency, not consciousness or self consciousness. But not in principle. Impossible. Only in fact, not the case. That's a different thing."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":2974.81,"end":3011.1,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah. So like, so sorry, because we are going to kind of jump back into our conversation. But, but like, so if. So when it's, let's say a city defends itself against parasites, like when a city defends itself against criminals, you can't see that there's a form of, of consciousness of its state. Like it. There's a form of consciousness of its borders and how it's. Well, no, because they are not crumbling and how it's. How it's, let's say, holding together or functioning smoothly until it sends out. It sends out like some kind of. But bodies do that without consciousness. I understand, I understand what you mean."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":3011.1,"end":3020.58,"speaker":"John Vervaeke","text":"That's what I was expecting to say. Your immune system is fantastically intelligent at that. And yet I have no reason or evidence that it's conscious, let alone self conscious."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":3020.58,"end":3040.34,"speaker":"Jonathan Pageau","text":"Yeah, but it happens through like it will happen through meaningful orders, especially in that case. Like there'll be like a law, there'll be like a statement, there'll be like a general telling the military to go and do these things. Like there'll be this. There'll be like a. At least at the level of the humans will be consciousness going down, like."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":3040.34,"end":3049.59,"speaker":"John Vervaeke","text":"Towards the action to a degree. But even that is not all the way down because your consciousness doesn't permeate down to the chemical interactions that are making your body move."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":3049.75,"end":3051.19,"speaker":"Jonathan Pageau","text":"No, for sure, not. No for sure."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":3051.59,"end":3055.67,"speaker":"John Vervaeke","text":"So I see consciousness attenuating at both ends. Okay, right."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":3055.83,"end":3075.51,"speaker":"Jonathan Pageau","text":"I, Like I said, I, I mean, I definitely hold the traditional. I hold the traditional kind of Christian position in some ways. So I, I tend to. But I understand why we need to. Definitely to do. I need to think about it more. And we need to do more work in terms of trying to find ways to formulate the analogies so we can see how far we can go with this question."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":3075.75,"end":3137.91,"speaker":"John Vervaeke","text":"And I also again want to say the three papers that I published with Dan Chiappi about the scientists moving the rovers around in Mars and all of this two things, this idea about collective agency, collective intelligence, distributed cognition, we agency. This is cutting edge stuff. So this is innovative and important. And secondly, this is not inconsequential, you know, and I've picked up on this in some of the talks I gave at, like, the talk I gave at Cambridge. And so like, there was a, there was a spirituality that naturally sort of emerged within the scientists. This weird thing about how they like, they really almost sympathetically magically identified with the rover and they did these rituals where they would embody the rover or they would anthropomize the rover and personalize it. And this was not just ornamental. This was crucial to them being able to do the work. Like, that's also an important point to be made. And I make it like, again, it's not the same as what you're claiming, but it's also, it also means that you're not like saying something completely like, you know, out of the blue."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":3138.07,"end":3176.36,"speaker":"Jonathan Pageau","text":"Yeah, well, for sure, in the case that you're talking about, it could definitely help you understand totemization practices. Like different types of practices, tribal practices of identification with spirit animals. You know, like this idea of certain characteristics that we recognize as identifying us and then binding us, but then also manifesting in the way we act. And so there's, you could, you could see how that would function to cohere a group and get them to act coherently against their enemies in the world together with other tribes. You can understand that with your Mars Rover experiment, Definitely."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":3177.01,"end":3217.26,"speaker":"John Vervaeke","text":"Right. And it also, it points to the ritual and the imaginal. Like that that's not just sort of a belief system. They're enacting it and they're, and they're, and they're drawing on the photographs and they're doing all this stuff that's imaginable in order to afford them actually being able to be present on Mars to get that actual perspectival knowing. So again, I agree with everything you said about. And Vertesi does use the word totem, by the way. The rover became a totem for them. But I want you to understand that it's simultaneously like a social process, but also it interpenetrates deeply into cognitive affordance. It actually enables people to do, to see and to do the work they need to do."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":3217.26,"end":3232.7,"speaker":"Jonathan Pageau","text":"Yeah, it's not, yeah, it's not just like you said, it actually makes, it makes it easier for them to, to exist this way. Like, it's not just that. They're not just, they're not just telling themselves let's say, like it's not just a team riding themselves up, you know, with their mascot and with their thing."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":3232.7,"end":3233.5,"speaker":"John Vervaeke","text":"There's something more."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":3233.83,"end":3242.39,"speaker":"Jonathan Pageau","text":"There's more of a kind of an actual embodiment of the rover through practices that make it. That what they're trying to do is more effective."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":3242.87,"end":3260.83,"speaker":"John Vervaeke","text":"Yep, exactly, exactly, exactly. And that, by the way, then feeds back, see the spirituality and the affordance of agency feedback into the point we were making before about top down effects, actually making a difference in the cognition and the sense making of the individuals."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":3261.31,"end":3273.87,"speaker":"Jonathan Pageau","text":"All right, yeah, that makes a lot of sense. And, and definitely, definitely it is, it is more food for thought. And, and I know that we're going to continue this conversation forever as long as we. As long as we still breathe."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":3274.11,"end":3285.15,"speaker":"John Vervaeke","text":"So I would want to say that this stuff, actually some of the more recent stuff I've done on the imaginal and the ritual also gets developed and articulated in After Socrates."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":3285.4,"end":3392.29,"speaker":"Jonathan Pageau","text":"Yeah, and I think that's great. I also think that there's a. There. I mean, I'm going to say this, I might get in trouble for this. But, you know, the notion of the imaginal has been controversial in orthodox circles because of the ascetic practice of hesychasm. And hesychasm because what the monk or what the practitioner is trying to do is to attain unity, full union with God. There's a sense in which the imaginal space becomes a dangerous space. Like it's a. Yes, it's an intermediary. Like it's like the spirits of the air, right? This intermediary space that has to be, that has to be crossed in order to reach the higher space. And so the tendency is to say, ignore the images, ignore the, ignore the imagination part so that you can reach silence and beauty and light. Right? So basically going all the way up into the highest sphere. But I think that a lot of work that certain people that I know have been doing, Father Suleiman, Justiniano, some of my work, and other people's work as well, by using iconography, like what we did in Thunder Bay, right. Using iconography as the support to show that this imaginal space also has a positive, has a positive manifestation. And it's like the church full of all these paintings and drawings and images, like it really is. And the way that it's structured and how it does represent a cosmic image. And all of this, I think, has been, has been a good bridge to help people understand that, that the, the. There is room in Christianity for this notion of a Positive vision of this intermediary world and the imaginal space. And we need it because without it, I think that we're very, like Christians are very vulnerable without developing a robust vision of this intermediary space."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":3392.45,"end":3410.49,"speaker":"John Vervaeke","text":"I totally agree. And I think the imaginal is. I mean, it's just. It's like what we said about narrative or. Right. It's bound up with human cognition in an important way. I. I would propose to you that my attitude towards the narrative is. Is the same when you're trying to propose about the imaginal. Yeah."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":3410.49,"end":3444.09,"speaker":"Jonathan Pageau","text":"So you're so right. It's not. It's not. It's not. It's not even my it. But it is. It is a deep. It is a deep tradition in the orthodox. In the orthodox tradition of being suspicious of that space. So I kind of have to deal with it. I myself am more, obviously more. I mean, people know what I'm doing. I'm writing comic books. I mean, I'm making all these things. I'm obviously more. I have more room for it, but I also want to formulate it in a way that's respectful to the tradition because I do believe that there are good reasons why hesychism had the form that it did."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":3444.57,"end":3495.92,"speaker":"John Vervaeke","text":"So maybe then what I've been trying to say. And again, we don't have to pick this up because we keep going. This is another one of our things. And by the way, before I forget, you released a video. I think it was part of your Q A where you sort of said flat out, you know, John is right about this, about the nomological. I want to now return and say thank you for you doing that. That was gracious and that was, you know, part of what we're all trying to do here together. But what I want to say is I think the narrative is important. It is powerful, but it is intermediary. That is, in a nutshell, what I'm trying to say. In a lot of ways, I keep getting cast as. John doesn't like. It's unfair to attribute to me. John's a critic of the narrative or doesn't think narrative. I've never said that. I never said that in awakening from the meeting crisis. That is not my position. And I don't. And it's really straw personing me to attribute that to him."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":3496.23,"end":3559.63,"speaker":"Jonathan Pageau","text":"Yeah. But I think that understanding, and this is the same for the imaginal question as well, is that you see it in the ascetic. I really. St. Gregory of Nietzsche's Life of Moses, you See it clearly in that text. You see, you see, the Moses goes up the mountain. He removes the garments of skin, he removes the layers. He moves into divine darkness. So he basically moves out of any form, any form, any representation. And then, but then when he crosses that space, he's given the. He's given the pattern of the tabernacle. And so the idea is that this space which is above the narrative and the nomological, let's say the transcendent or the non dual or whatever, however you want to name it, it's the source of it, right? It's the source of that other space. And so. So it gives birth to it and it gives it its proper. Its proper form. So. So you can have both the aesthetic understanding of moving into that which is beyond being, but then also understanding that, yeah, it's also the father of being. It's also that which gives being, makes it. Makes it exist."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":3559.79,"end":3598.07,"speaker":"John Vervaeke","text":"You just did. To my mind, and I don't think this is dismissive of what you just did. I'm not taking anything away from Gregory, but that's also Socrates. That's a republic. And then the return. And if you, if you separate the ascent from the return, you don't understand the ascent. Plato is very, very clear about this. And D.C. schindler makes a fantastic argument about. And that, See, that's what that. The fact that there's that convergence there about exactly that point. Right? And that's, again, that's why. That's why I want to be doing what I'm doing, because then we can. All right, let's make these connections. Let's draw this out."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":3598.47,"end":3631.81,"speaker":"Jonathan Pageau","text":"Yeah, but that point, I think the point about how the transcendent gives birth to the world and how it, the world actually exists out of it, I think it's important today because there's, let's say, in the spiritual, but not religious. Yeah, you get that argument, right, where it's like, well, I don't want the religion, I don't want the forms, I don't want any of the practices. I just want the top thing. Right. You know, I believe in non duality. I just want that and everything else. Like, I don't want. And so there's a kind of naivete about then how does. Then the world exists? Like, how is it that there's more than an I?"}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":3632.45,"end":3714.77,"speaker":"John Vervaeke","text":"There's more, there's more. Here's, here's Schindler's read on Plato, which I think is profound. The absolute that does not include the relative is not the absolute, right? Because then it's not. If your non. Duality does not afford. And properly. I don't know what to say. Give birth to. I'm trying to, like I want to get. Then you don't understand. You haven't properly understood it. You've reified it again. The ascent and the descent, the emanation and the emergence. You can't. You know, you and I have been sort of not arguing, but this is something we're converging on a lot on. And I think that that connection you just made is so appropriate. Right. There's a profound naivete because it's based on a profound misunderstanding and misapprehension. If you think the absolute does not include, and I mean deeply encompass and interpenetrate the relative, then you have not understood it at all. You've turned it into something like a totalitarian thing, a totalizing rather than an absolute. And that. And I think Schindler just knocks that argument out of the ballpark. It just says, look, and this is Plato's argument again and again and again and again. I think what you said, I'm just deepening it, that. That spiritual bypassing is not just naivete. It's naivete that is driven by a kind of profound misunderstanding and misapprehension."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":3715.4,"end":3723.96,"speaker":"Jonathan Pageau","text":"Yeah. And like you said, it does. It leads to two impulses. It leads to a totalitarian impulse and it leads to a kind of anarchic impulse."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":3724.12,"end":3724.56,"speaker":"John Vervaeke","text":"Yeah."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":3724.56,"end":3757.65,"speaker":"Jonathan Pageau","text":"Both at the same time. Like, it's like either anything goes and could just do whatever. Because it's like nothing. It's all. It's all nothing compared to the absolute, or rather control. Like everything has got to be. Got to be completely ordered and has to. So, so. Yeah, so you're right. So they're, they're. And in a way, like, that's the right. That's a. That's the right hand and the left hand. Right. That optimal grip that. That you talk about, you know, this idea that there's this letting go. And everything has a letting go and a grasping to it. That's a necessary. It's necessary for the thing to actually exist."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":3758.37,"end":3870.92,"speaker":"John Vervaeke","text":"I think that's exactly right. And I think you, like you. You have to be. You have to be constantly opening to the one, the absolute, the inexhaustible. And you also have to be closing to the finite. Right, Right. The suchness. And you have to be constantly doing both or you don't have, like you said, don't have a world. Yeah. You don't have a world and you don't have the, you know, you have neither an intelligible world nor the optimal grip needed to realize that intelligible world. And that's why spirit. But I mean, insofar as it is spiritual bypassing as a psychological category, which it is. That's what people are trying to do. Right. It's kind of a crypto gnostic thing of trying to pretend. And I think there is something pretentious of it that we can somehow be free from the world, you know, like in our embodiment. And. And then we don't have a. We don't have a moral. We don't have moral and epistemic responsibilities, which we do. I mean, I've got kids. Like, if the absolute makes me not treat my kids well. Well, I'm sorry. Like, that's not the absolute, it's something else. Yeah. And so to be fair to me, I did make this explicit criticism in Awakening for the Meaning Crisis. I said any notion of enlightenment, that. That does not have something to tell me about how to deal with the perennial problems and cultivate wisdom. I'm not interested in that notion of enlightenment. And why should you be? Why should you be? Other than you're having some unique experience that you find really personally wonderful? How is that not just self indulgence or narcissism? I'm sorry, that's. I'm not saying that people don't have a right to engage in spiritual exploration or anything like that. I'm not saying that. But when we're talking specifically about what goes wrong in spiritual bypassing, I think that's what goes wrong in it."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":3871.56,"end":3885.96,"speaker":"Jonathan Pageau","text":"This is great. John. I need to. I need to go. I need to go to another appointment. But this is always. Usually we could just keep going. That's the problem. Just keep talking forever. So give the. The last. Tell people again, where the. After Socrates, when is it coming? Where is it going to be?"}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":3886.28,"end":3934.39,"speaker":"John Vervaeke","text":"Okay, so after Socrates, January 9th, there's going to be lots of promo videos. There's already been one released. It's going to come out on YouTube. Subscribe to my channel and you'll get it right away. It's free, you don't have to pay. It'll be released twice a week, probably Mondays and Thursdays. Twice a week is for sure. We're not quite sure if it's going to what. That's the Monday to Thursday. This is probably Monday for sure. Probably Thursday, but definitely twice a week. January 9th, look for it. Really strongly recommend. Try to watch it with some other people. Do the discussions around the points to ponder, do the practices individually and collectively and then discuss the practices and the relationship between the practices and the propositions, please. I think. I think you'll find it of great value. All right."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":3934.39,"end":3943.59,"speaker":"Jonathan Pageau","text":"Thanks, John. And you will definitely be talking soon again. If not very soon, then for sure. If we do, if we have this conference in California, that'll be great as well."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":3943.59,"end":3949.63,"speaker":"John Vervaeke","text":"So, as you know, I'm always looking forward to talking to you. It's been great. Thank you so much, Jonathan. All right, Bye. Bye. Bye."}
{"episode_id":"SW - #269 - 2023-01-12 - John Vervaeke - After Socrates","start":3950.35,"end":4012.46,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon, the Pageau videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
