{"episode_id":"SW - #353 - 2024-08-17 - Symbolism Explained - The Olympics Opening Ceremony is Worse than You Thought","start":0.4,"end":1519.55,"speaker":"Jonathan Pageau","text":"This is actually one of the funniest things about this event is all these people and a lot of Christians going online saying it's actually not the Last Supper, you know, it's the feast of Dionysus. Why are all the Christians getting so annoyed? And why are the Christians getting so mad? You know, I am educated. I understand that this is the feast of Dionysus. It's like the capacity of people to easily accept gaslighting is hilarious. You know, I mean, it's like, are we still. Are we back in Covid once again? Is that what's going on? Or, you know, I guess so. I guess it doesn't take much. You know, people don't learn their lesson. This is Jonathan Petro. Welcome to the Symbolic world. Foreign. So, hello, everyone. As most of you noticed, the Olympic opening has created quite a stir. A lot of people reacting online. It seems like everyone is talking about it for some reason on Facebook. It's like my entire feed with people commenting on the Olympic opening ceremony. To be honest, I did not have the intention of making a video on this, but people close to me that I care about and that I trust have said that it would be a good idea to make a video about it. Mostly because, yeah, maybe to help people understand what is going on and why things look the way they do. And so here we are. I'm going to talk about the Olympics opening ceremony. So before we start, if you enjoy what we're doing at the Symbolic World, please go to the symbolicworld.com and you can become a member of the Symbolic World. There's free membership where you have access to a community and discussion. There's also ways you can support what we're doing. Supporters have access to a Q and A to free videos, special videos every month, and also discounts on different things. And we really appreciate the support you give us. And so the first thing I have to say before I start giving my critique is that it is all very tedious to me. You know, the whole thing is just. Oh, it just. Just makes me want to go to sleep. It's like this super obvious, super boring. Everything is so obvious. And, you know, I mean, I understand that it's shocking to some people, but I don't know why people are shocked. There's. People shouldn't be shocked at this point because, you know, basically this is just a continuation of what has been happening for the past five years, 10 years, 20 years, more than that, possibly. And, you know, as the image of what has been happening in our culture is becoming more and more obvious and maybe more and more transparent. You know, in some ways, I'm happy that more people are noticing, but this is just a continuation of what is going on. And so what are we talking about? Most of. You know, the Paris Olympics opened up a few days ago, and there are several elements in the opening that were disturbing to some. And the culmination of that disturbance came with a representation of the Last Supper by Leonardo da Vinci, in which was full of drag queens and, you know, kind of LGBT icons. And in the middle of the scene, you know, because it was the Last Supper. So obviously it's a meal. And then the meal gets opened up. This plate comes up to the scene, and the meal gets opened up, and inside is a strange blue man wearing almost nothing, who starts to sing very sensuously and strangely. And then everybody in the scene of the Last Supper begins to kind of frolic very orgiastically in a very disturbing manner, made even more disturbing by the fact that in the group was what seemed to be a prepubescent young girl who then gets taken by one of the men, you know, in his arms, kind of in a dance move, as all these other people are starting to kind of frolic and caress each other and rub up against each other. And so the first thing we have to dispel is this is actually one of the funniest things about this event is all these people and a lot of Christians going online saying, it's actually not the Last Supper. You know, it's the feast of Dionysus. Why are all the Christians getting so annoyed? And why are the Christians getting so mad? You know, I am educated. I understand that this is the feast of Dionysus. It's like, the capacity of people to easily accept gaslighting is hilarious. You know, I mean, it's like, are we still. Are we back in Covid once again? Is that what's going on? Or. You know, I guess so. I guess it doesn't take much. You know, people don't learn their lesson. The scene is clearly referencing the Last Supper. The name of the tableau was a wordplay in French, which was La Seine. I forget how exactly it goes. It's something like La Seine de La Seine apparit. So La Seine, which means. You can't really translate it in French because there's a wordplay in it, which basically, if you translate it into English, it means the scene of the Last Supper on the Seine River. Because in French, one of the words for the Last Supper is La Seine. And so La Seine De la Seine sur la Seine. Right? And so the name of the tableau was referencing the Last Supper. The head of the event said that he was referencing the Last Supper. The main person in the middle, the dj, the kind of fat lesbian DJ that was in the center, she posted on Instagram sitting, saying that it was the New Gay Testament, right? And that this is what they were doing. She deleted, of course, the post later and changed it by saying, no, no, no, it is Dionysus. And so, first of all, clearly, it was referencing Leonardo da Vinci's Last Supper. But, you know, this is the thing, is that you have to just understand what it's about is that they're saying, no, what we want to do is we're emphasizing openness, we're emphasizing diversity, we're emphasizing inclusion. And that's exactly what they're doing. Now, the problem, there's nothing wrong with diversity, and there's nothing wrong with inclusion. We mentioned this several times. It's necessary for a society to exist, to have diversity and inclusion. But societies do not celebrate diversity. The only way to celebrate diversity is by carnival. The only way to celebrate diversity is by turning unity upside down, by emphasizing the fringe, the margin, and the imagery of the carnival. Now, the imagery of the carnival goes even further than the imagery of the carnival. We have carnivals in the west, of course. You know, we have Halloween and Feast of Fools, we have Mardi Gras, we have all these traditions of carnival in the west, which are moments of inversion and scandal and chaos, which is usually then followed by some kind of return to normalcy. Either it's the fast in Christianity, the. The. Whether it's Lent or different ways of doing it, but it usually references. It usually moves into return to normalcy. And these festivals are important and they're part of the yearly cycle. The idea of. Of kind of showing the chaos or showing the inversion as a limit of order, but that is the only way to celebrate diversity. And so this is why there's an absolute coherence in everything about this imagery. The rainbow flag, where it's multiplicity of color, you know, the rainbow as an image of multiplicity, not unity. The image of the drag queen as ambiguity. As a man who's dressed as a woman, but also has a beard and is showing their ambiguity. All of this is. There was there, obviously in the ceremony, but it is part of the culture. And so you don't. There's nothing hidden about it, you know, and it's also. What I'm saying is not a gloss on top of what's going on. This is the discourse of the people engaged in this themselves. There's a pastor in the United States, a pastor, a Methodist pastor, who does his sermons in drag. And he says it clearly in his speeches, in his sermons, he says that the best ways to enact systemic change is through joy and carnival. Drag is carnival. It is over the top, it is loud, it is joyous, it is laugh filled. And it is in moments where people on the margins are handed just a little bit of power, and when they hold onto that power for longer than it was intended, things happen. Drag is carnival and carnival is a manner to bring about change, to bring about transformation. Now what is the transformation that is happening? The transformation that is happening is the dissolution of normal identities in order to reconstitute them at higher levels. You could understand it as a revolutionary transformation trope. We want to destroy identities in order to reconstitute them into a new identity. What is this new identity? You know, it's a transhuman identity. It's a post human identity. It is a universalist image where all the distinctions kind of disappear into a, you know, kind of chaotic, amorphous being. And this is what was happening in the event. Now, a good way to do that is to do it exactly the way that they did. Because the Last Supper is an image of the cohesion of the west for the past 2000 years. It is the way in which, it is one of the central images of how the west communes together, brings multiplicity into one, into the holy meal that is the center of the church, that is the center of the community, that is the center of the Western nations and has been now for millennia. And so the best way to undo that in order to bring about a new identity is of course to undo communion, is to mock the things that are sacred. And, you know, and it's not like this is the first time this happens, that the entire kind of drive, like one of the drives of the drag queen and a lot of the rainbow stuff is of course to replace the sacred with a new sacred, which is the sacred of ambiguity, a sacred of multiplicity, you know, the sacred of difference. And these are, these are all things that the people involved in these events and in this way of thinking are saying that they're doing themselves. So we have to just be aware that that's what's going on. Now, I do believe that it is destructive. Like, you know, it is really in some ways undermining. Right? Literally inverting, twisting, they use the word queering. It's Queering Christianity in order to bring it into this new vision of reality. And so a good way to do it, for example, is to take the Last Supper and then replace it with an orgy. Replacement. Replace it with a Bacchanalian festival. Because it's not like there aren't certain analogies that you can make between the image of the, you know, the image of the feasts, for example, the banquets of Dionysus and the Holy Communion. There are certain types of analogies that are there, of course, in Christianity. It is in some ways a kind of bringing in of multiplicity into one. There is an aspect of the scandal in communion that I've mentioned before, which is this idea of eating the body of the God. But it is sublimated, right? It's transformed into a, you know, a vector of unity where all things are kind of collected together. Now, a good way to subvert that is of course, to bring back these kind of Dionysian party instead of a true communion in. And this presenting of the God Dionysus as the meal that we will enjoy in order to celebrate our diversity. Now, remember that in the stories of Bacchus and in the stories of Dionysus, there is this image, right? We see it in the Bacchae of the Sparagmos, right? This idea of the ripping apart of the character, right? The. The Bacchic celebrants that take the person and rip them into. Into pieces, right? And that's what is being celebrated. I don't know what to tell you. That is what is. That is what is being celebrated in this thing. Because it is a celebration of diversity. It is a celebration of multiplicity and of inclusion, where, you know that it is the opposite of communion, but it's so much the opposite that there is a man in which you can see that they're related. And it all has to do with, of course, this kind of the kind of orgy culture of the Bacchanalia, which is trying to come back, which is being reinstated in the image. And so it's hilarious to watch Christians say, oh, it's not the Last Supper. It's just a Bacchanalia. It's just basically a cannibalistic image of. And an orgy that is being presented to us with a hint of pedophilia. And people are saying, oh, you know, why are you getting offended? That this is the image that is being represented as, you know, one of the images that's being represented to inaugurate an international celebration of excellence in sports, you know, and the answer is, you know, we are so now become so jaded and so used to seeing this kind of insanity that we just see it and we watch it. And a lot of people maybe aren't aware of. Of what the guy was singing and what he was singing. He was singing basically about inclusion and about, you know. You know, removing all our differences and seeing each other like, we're all naked. And then he starts saying, and it's as if. And. And we have to celebrate each other like, we're all naked. And he kept repeating, naked and naked. And then the music became like Barry White bedroom music. And everybody started to rub themselves against each other in the background. And then you have these Christians going, I'm an educated person. I'm not offended by a reference to Dionysus in the Olympics. My goodness. Is that really where we are? Like, is that really the level that. Where we are? And so, you know, I mean, but that is where we are, and that is what is happening. And therefore what. You know, because that the whole image is so. Was clearly sexual, was clearly orgiastic in its references, you know, and is a celebration of diversity. You know, if you look at what happened right after that part of the section, the. Which is wild. I don't know if they do this on purpose. It's like. Or if it's just accidental. But then the naked Dionysus, he gives it off to the next show, which is called Darkness. And then there's this dance, kind of frenetic dance. So it's a continuation of the other dances that were there before, but it's called Darkness. And that's the next dance. And then we cut straight into Imagine by John Lennon. It's like, if you want to know what's going on, it's just pretty clear what's going on. Imagine there's no heaven, there's no hell, there's no difference. And we're all together as one in a big bacchanalian orgiastic feast, you know, and that's what was being referenced. And, you know, and how can I say this? It's like we're so far down the line that although the people then gaslight and lie and say, no, that's not what's referenced. That's not what's wrenched. But that is what's referenced. And they know that's what's referenced because that's really what they really believe, that that is a good thing. If we could all just, you know, like, we can all just let go of our differences and all be One in a big. In a big party, then that is an image of a transcendent unity. And so, you know, and so what we're seeing is the return of Dionysus. And it makes sense because that is what Dionysus is. It is the extreme of the natural world. We're watching civilization be undone. We're watching. And it's not like the Dionysin or the kind of ecstatic, frenetic aspect of the world isn't integrated into Christianity. It actually is. And it is some ways integrated into the Last Supper. There is a Dionysian element to the Last Supper. We can't deny that. But the reason why it actually holds society together is because it's not just that, right. Communion brings together the kind of ecstatic Dionysian excess with a reasonable communion in holy love, brings all of those extremes together into one. And so a good way to undo it as post Christian is to tease out those parts again, is to kind of tease out all those different things. And so you'll see, right, this emphasis on. I've mentioned it in many videos, this emphasis on extreme reason and extreme order, that is image and technology and the modern state and the modern bureaucracy, which now becomes opposed to the kind of Dionysian, chaotic, let's say, hybrid and ambiguous identity. And now these two play with each other. Right, I mentioned it. It's something like the horror sitting on the back of the Beast that we see in Revelation, that there's these two extremes kind of playing off each other. And that is, of course, what we saw during the thing. And because it was so degenerate and so decadent, then it's not surprising that other elements of the Thing, which maybe are not as offensive or wouldn't have been as offensive on their own, are now interpreted in that way, you know, and there's not much to say about the Marie Antoinette, if those that have seen it. You know, there was one scene with a heavy metal band with Marie Antoinette with her head cut off, you know, holding her head in her hand, and then her hand and her head saying, all will be well as some heavy metal band starts to play. And then there's like these explosions of blood, you know, out onto the. Out onto the field. And it's like, yeah, you know, that's it. And it's interesting because the head of the. The one who orchestrated it, he said, you know, it's the Republican values, it's the values of the republic, it's the values of the revolution. And the answer is, my reaction to that is that yeah, that's what it is. You, you know, hopefully my people will start to understand that that is what the. That is what all of the revolution leads to is this type of kind of chaos and madness. And so there are many other images people pointed to. You know, of course, this. One of the strange images was this kind of image of the torchbearer on a horse kind of riding on the waters with wings behind him, and he has this hood. He looks kind of like a strange grim reaper figure. Is that on purpose? Is that what it is? I don't know. You know, at this point, anything is possible. But also, we shouldn't attribute too much intent to these people. They are in some ways, many of them are in some ways unconscious vehicles for things that they don't totally understand their, their part in. We have to be careful in thinking that this is some completely planned thing. And it's mostly, you know, it's mostly people aligning themselves with certain virtues, certain vices and certain values, let's say, and then those playing themselves out in different ways. And that seems to be the case of what we saw. But what I hope is that for most people, you know, people can just wake up and realize that that's happening and that the fact that it's been happening in our culture now for a few generations, maybe since the 60s, actually, that all of this is happening and that this kind of inverted, upside down, subversive and, you know, and a lot of people are branding the word satanic around and I think that it's okay to use that word if we kind of understand it. You know, on the one hand you have the Satanists who say, oh, we're just being ironic, we're just being cynical. You know, we don't really believe in Satan, we don't really believe in the devil. All of this is just a play, right? It's all irony and joking. And the answer is, yeah, we know that's what it is. You know, and that's what part of the problem is that if you celebrate the irony, if you celebrate the upside down, if in an event that is there to kind of bring nations together and celebrate excellence in humans, and everything about your celebration is ironic and mocking and degenerate. It's like, yeah, that is Satanism. That's what it is. And I'm fine with believing and thinking that people aren't sincere in their Satanism, because that's what we're talking about. We're talking about not being sincere and being dismissive and queering and turning things upside down and making fun of them and mocking them, and, you know, that's where we are. But at some point, that will run out. And what is at the same time being installed are new taboos and new systems of control and new moral taboos, like I said. And so we have to remain attentive and not be distracted by the little blips of this. We need to look at the long arc and see what is happening and attach ourselves to that which is important, to the things that actually do unify us, to the virtues that we have in common, to the stories that we have in common. And as Christians, when you see this and you notice that they're mocking the story of Christ and that they're mocking the image not only of Christ, but of the center of Western unity for the past, that was the center of unity of the Western world for the past few millennia, which is the Holy Eucharist, which is communion, then we have to attach ourselves even more to that unity and understand that inversion and mocking is empty and it will run out, you know, and the true seed, the things that are true and that are good and that are beautiful, they will win in the end. But it's up to us to foster them and to make them the priority in our lives. It's a lot easier to get offended at something like this and to get annoyed than it is to actually foster those things that are important and valuable for the future of our children and for whatever future our civilizations have. And so hopefully this was helpful to help you understand what is going on. And hopefully, you know, I would say, you know, don't, don't freak out. This has been going on for a while, this part, for the course. And I just have to warn you, things are going to get crazier. 2024 is not over yet, folks. You haven't seen Pete Crazy. I warned you at the outset that 2024 is going to be mad with the Trump shooting and everything that's happening in the United States and this, of course, but it's not over. So like I mentioned on Twitter on X, basically, you know, cross yourself and then put your hands up and it's the, the ride. The ride isn't over yet. So thanks, everybody. Thanks for your attention and I'll talk to you very soon. Bye. Bye."}
