{"episode_id":"SW - #393 - 2025-05-16 - Wheels Within Wheels - The Universe as a Symbol","start":0.32,"end":2479.96,"speaker":"Jonathan Pageau","text":"Hello, everyone. We are halfway through the Symbolism Masterclass. As I record this. It's been a wild ride. I'm really pushing people to their limit. I like to watch in the chat and see people's brains fizzle. People seem to be following. It's tough, it's. But it's important stuff. And we thought we could post a little section from the Symbolism Masterclass in which I describe in more detail than I ever have before what it is that I mean by fractal symbolism or the fractal structure of reality. And especially how it relates to that weird and wonderful vision that Ezekiel has of the wheels within wheels within wheels in the chariot of the divine revelation. And so we thought this could be fun for you to realize and kind of see how deep it is. We're going into symbolism. Last class. You can still sign up. Of course. We have three weeks left, but all the videos are available for those that sign up forever. Once you sign up, you have access to them because you will definitely want to re watch these videos. People I know are saying I need to re watch this two or three times because there's a lot. It is very coherent, but it is. It's like drinking from a fire hose. We still have three episodes left to record, so I hope that by the end people will. Will be, let's say, well trained in symbolic visions. And so please enjoy. This is Jonathan Peug. Welcome to the symbolic world. This symbolic structure is really amoral. And this is one of the most important things to understand about it. It's not. We talked a little bit about how the pyramid and the image on the dollar can be parasited like that. There can be a parasitic version of it. And this is true of all of this. Like so all of these images. The idea of hierarchy, if it's a. There can be false hierarchies, right? The image of a ladder, there can be. There can be false ladders. You can be taking a ladder that you. That like going up. The corporate hierarchy is actually not the same as the virtue the ladder of virtues. It is a real ladder that has the. That has all of this coherence to it, but it doesn't lead to the same place if you're actually. It can be a dangerous ladder to climb because it can lead to more and more kind of pride and power. And that is really the image of the hierarchy that is off, off kilter. Is this image of an idol, right? Or the image of a false. For false hierarchy, of a false truth that is ordering the world. And it's Kind of like this demonic imagery or like the dark mountain. And so this is what you see in the image of. You see this in the image of the statue of Nebuchadnezzar, right? So the image of the statue of Nebuchadnezzar has this powerful hierarchy in it, but it's represented as an idol, right? It's said that it has a head of gold and that the head of gold is the origin, right? It's the first empire. And then it has a torso of silver, and that's an empire that's lower down on the hierarchy, and that is also lower, let's say further in time. It has the hips of brass, the legs of iron, and the feet of clay and the toads that are a mix of iron and clay, right? And so this is a perfectly coherent vision of a hierarchy, right? So the gold, right? Gold in some ways is the. The less solid metal. It's the one that is most. It's most. Looks like light, right? It's, it's, it's. It's shiny, it's reflective, it's precious because it's rare. It's more like, you know, but it also doesn't. You can't make a sword out of gold. That's not. That's not possible. And as you move down the ladder, you can see that the metals are. Are darker and darker and are also more and more strong, right? They have that kind of stability as you move down, and they're more and more stable, more and more stronger and stronger until you reach the last one. And then in the last one, you have the image of fragmentation where you have mixture, you have the toes made of clay and of iron mixed together. So you have this powerful image of a hierarchy where it's actually an idol. It's like a false hierarchy. It's an image of civilization in its false hierarchy. But it's using the same type of symbolism that would be used in other contexts to describe an order of qualities from the most precious at the top, right. That is also the less hard to things that are less precious and harder and harder until they become brittle and until they become confused and. And then they shatter. So you have this weird image of heaven and earth. And what's interesting is that this image is reflected. So now the negative aspect of the hierarchy, and then this image is reflected in the order of the tabernacle, right? And so the tabernacle has the same order, similar order as the order that you see in the statue of Nebuchadnezzar, which is that Gold is held just for the holy of holies, right? Which is the place on which the heavens come down onto the top of the, of the. The structure, okay? And then they. There's silver that are made out of parts in the holy place and in, in the sanctuary. But gold is just for the holy of holies, the highest place of the sanctuary. And then after that, you have. Bronze is used in the outer court. So you have the bronze that is used out here, you know, and then ultimately on the outside, you have the clay, right? You just have the dirt, you just have the, the dust of the, of the ground that is outside and is not part of the, of the sacred order, we could say. Okay. And so, so Kwame Owusu says, why is the Nebuchadnezzar statue symbol of false hierarchy? Well, in the story of Daniel, it's represented as an. Also as an idol that is meant to be worshiped. And so the image Daniel sees the. The story of Nebuchadnezzar in a dream, and he sees this statue that is. That is above. And then it sees that there's a mountain that is next to it. And a stone comes from the mountain. It's really good idea to understand the stone as being from the top. So a stone at the top of the mountain breaks off and then rolls down and then destroys the statue. So that's the dream of Nebuchadnezzar. And so you could understand that it is an image of a false hierarchy that gets set up and then that which comes from the holy mountain, from the top of the holy mountain, this kind of. This stone that is actually uncut by man, which is only made by God, rolls down the mountain and then breaks the statue apart, right? So that image of the stone that is that, of course it's an image of Christ, but you could understand it as something that is not artificial. The true nature, the true hierarchy manifesting itself and destroying the false hierarchy. So that image can be represented. It's represented in many places in scripture where you have the, the, let's say the Egypt, the Israelites leaving Egypt, where they have a pharaoh and they have a whole civilization that is. That is falsely aligned, is very powerful, but it's falsely aligned. And then they go through, right? They leave that and then they go up the mountain to receive the true revelation, right? And in that process, the pharaoh's men get drowned in the sea. And so you can kind of see it's a similar idea where it's like you have to destroy the, the. The evil hierarchy in Order to build. So think about it like you have to. You have to. You have little hierarchies in you, like sins that are little hierarchies that order behavior towards purposes and that are evil purposes. And so you have to deconstruct those before you actually move up the up the path. Right? And so it's just important to understand that. So the reason why I'm saying that is that gold is used in the holy of holies, and it's used to make idols. And so the question is, what does gold mean? And gold means, it depends where it. In what story you're placing the gold. And so gold can be an image of the holiest thing dedicated to God. And gold can be like King Midas worshiping riches and turning everything into gold in a way that makes him have no body, right? So he's just ahead. And because he's worshiped gold, he now cannot, cannot feed himself anymore. He no longer has access to his body. So you can see how the same image is used in different contexts in order to manifest the different purposes. Okay, Zach Mack says is depends is always a safe answer, but it doesn't depend on anything. It actually depends on the context and the context. When I say that we use the word context, it means purpose, Right? A context is defined by purpose. And so, you know, money. How can I say this? It's like I can give. I can give food to the poor, and I can do it in the right way, and I can also do it just to increase my stature and my pride. It's the same action, but because the purposes are different than the same symbol, the same behavior will play a different role. And that's really important. That's why, like, you can totally have images with evil kings, and you can have images with good kings, you can have images with evil peasants, and you can have stories with good peasants. And it just depends on how you structure things in order to manifest the purpose of why you're putting that image in there in the first place. And this is super important because if you don't understand that, it's like you'll never. You'll never understand the stories in Scripture, because then you'll, You'll. You'll think something like the snake represents the devil. Because look in Genesis 1. And then by the time you get to Jesus saying that he's the serpent in the desert, you're going to become very confused and you're not going to be able to understand what the heck he's talking about. Because I thought, I thought the Serpent was evil, and I thought the serpent was the devil. And in fact, that's not the case. The, the serpent represents something far greater. Like greater represents something which has different manifestations depending on where. Where it is. Right? And that's true of. That's true of everything. Right? Everything is. The best way of understanding is that things have a place on this order of being, right? They have their place. And this is. Obviously, we're just in the second class. We're going to go through all of this as we move forward. But that place can be aligned differently depending on the reason. Right. Of why they're put there. And so every level of the. Think about it this way. Every level on the ladder of divine ascent that we saw earlier with the monks going up the ladder towards heaven, every step on that can be a step towards God or it could be representing a distance from God. It could be represented you not being close to God and a place of falling off. But that's true of every single level. All of them can become a type of forgetting, because that is the relationship of the, of the many to the one is that the many to the one. The many, if they remember their connection to the one, then the many becomes an image of glory, comes an image of fullness. But if the many forget their connection to the one, then they become an image of fragmentation, they become an image of sin, they become an image of death, right? Because they're veering away from the purpose. But the same structure, the same things that you, that you do can be one or the other. Another way of saying is that every virtue you can do in pride and every. And every virtue that you do in pride is actually, it's a kind of sinning because you're using the virtue to increase yourself. And you're building an idol, you're building a little Nebuchadnezzar statue which looks really good, but ultimately is not connected to the highest, highest purpose. All right, all right. So Luis Blanco said the snake is still a symbol of sin. We'll see about that. We'll get to that. We'll get to that, and we'll see if the, the, the, the, the. That the serpent is just an image of sin. All right, okay. Now we just looked at the tabernacle and we kind of saw how this, the tabernacle represents this mountain again, right? So the image of the tabernacle, right, even though it's represented horizontally, it's still structured kind of vertically. So it has this hierarchy which moves from the outside into the inside, from the many that are there in the tabernacle. So you have all these people coming in, right, to the priestly caste that are fewer to the high priest, that is one that moves into the place where the glory of God descends down on it in the same way that Moses receives the law that comes down from heaven. So when Moses goes up the mountain, he goes up with the 70, and then he drops them on his way up. And then he goes up with. With Joshua and I forget the name of the other person. And then he and Aaron. And then he lets Joshua and Aaron remain at a different level, and then he ends up alone at the very top where he receives the law from heaven. That is the, the kind of the structure. And so this structure can appear, of course, as the kind of mountain, but it can also appear horizontally as. Right, A kind of concentric structure, right? So you can understand now if you look at the way that the camp of the Israelites is set up, that the place where heaven and earth meet is in the tabernacle, right? And then that what that does is it radiates out and it gathers all of the tribes together, right? So this is the, this is the, the, the. The. The camp of the Israelites, you have all the different tribes that are named around the edge, and. And in the middle you have the Levites that are in the center. And then in the middle of that, you have the actual tabernacle. That is the place where God reveals himself. And so you have this kind of concentric model now, where heaven comes down from above and then manifests itself horizontally as this extension. And so that's why you can also represent heaven and earth this way. You can have. Represent heaven as the middle and earth as the edge, or at least you could. Heaven in the sense of the image of heaven on earth appears as the center, right? We use it in common parlance all the time, right? We say it's the center. It's the central thing. It's the reason why we're doing things like all of these. All of these aspects are completely coherent in terms of the symbolism, right? And that's why the image of the wheel is one of the images that represents this so powerfully. Because a wheel is exactly the image of, you could say, a way in which all the multiplicity, right? So all of these multiple aspects are joined in and joined by the center. So the, the center is collecting all the multiplicity into itself. It's giving it its direction, is giving it its purpose, you know, and in the wheel, it's particularly true and particularly Interesting, because when a wheel is turning, the actual axis, like the actual axis of the wheel, the place around which the wheel is actually turning is a virtual point. It doesn't have. It actually doesn't have extension. It doesn't have extension in space. It's like a virtual point in the middle. And then all the multiplicity is turning around that virtual point. And so there's like a. You could say there are different reasons of why. To represent the purpose or the heaven or the reason as the top of something at the top of the ladder, the head, the. Or as the heart, right? As the middle. And there's a distinction between the two, right? You could think of the heart tends to emphasize more the place where heaven and earth meet, you know, but ultimately they play very similar roles, like they play very similar roles in practice, right? And so sometimes there's a reason to distinguish them, and we can look at those at some point, but they. They play distinguishing roles and they kind of compete, like, in a way. Like they kind of compete in different ways of representing it. So a good example of. Not that they compete, but that they kind of alternate. So a good example of. Of place, a place where they alternate is. Is, of course, in. In Dante. Like in Dante, he is joining this imagery of a kind of concentric world and a mountain, right? And this is also where you can start to understand the yin yang symbol a little more. This is going to get a little esoteric because until now I've represented heaven as a point, right? I've said heaven is a point. It's things that culminate to each other, you know, but that's really, you could say where heaven appears, you know, because it's the place where things meet. And when heaven manifests itself, it always manifests itself as a point. But you can also represent heaven as an expanse. Heaven as an expanse of actualities like. As an expanse of names, an infinite, like, opening up. And then it's only when it comes down onto the world that it manifests itself as a point. You know, this is where the image of the Trinity becomes relevant. You know, where it's like, we don't actually believe that the world culminates just into one, that it is, in some ways, there's an expansive element to that one, to that unity which is beyond the unity itself. And in Dante, he's always trying to represent this. And so basically, he represents both, in some ways, the idea that God is the center, but that also God is also kind of surrounding all of us. And so God appears in your Heart. But the truth of it is that you are in God, right? So that's when symbolism goes very, very, very subtle. Usually most of the time, when I talk about it, I'm always saying. Talking about the point and the center and how things kind of culminate into one. But this is supposed to be the masterclass, folks. And so you have to be able to kind of expand your mind and understand that ultimately the truth of it is that it's a point and a center. But we are also, you could say, in God. And that's why a lot of some representations will look. Will look different. And this is why in Dante, he plays with that. So on the one hand, he makes these mountains that you're constantly ascending in order to kind of go up, but he represents the heaven as this thing in which we're contained. And then once he gets to the very, very top of the heavens, then once again, God appears as these kind of concentric circles that are moving into one. He's constantly playing with you and trying to. Trying to help you understand that God appears as this point of light, but that ultimately God. We are in God, right? So this accounts more for this imagery, right? This is probably the first time that I've even talked about this, which is that. That's why the tree looks the way it does, is that the tree has a central axis which is like this connection between heaven and earth. And below, it has all this multiplicity that is the roots, that kind of connected to the earth and distribute it in the earth. But then when you reach the top of the. Of the trunk, it opens up and has all of these stars, all above, like all of this kind of. All of this multiplicity of. Of. Of. Of actuality that is up in the heavens, right? And that's what accounts also for this image of the star of David or the. The seal of Solomon, which is that in this image, heaven, right, Is this one heaven is this triangle that's coming down. So a way of understanding it that makes sense is to understand that as Moses goes up the mountain and he reaches the top of the mountain, and then he. He encounters God. You can imagine that encounter as being like a triangle that goes up like that, right? A triangle that goes up into the infinite and then comes down and points itself, right? To manifest as this. This center, as this seed, as this, you know, as this pearl, as this. All of these images that we have in scripture of the center, and then redistributes itself into the earth as this. This kind of. Of. Of redistributes. Itself into potentiality, okay? And then the, that which is at the bottom is like the, the, the water and the food comes up, right? And then becomes the fruits, all the fruits that are, that are up above. And so this is really the, this is really like the most subtle version of symbolism you'll, you'll hear about. I, like I said, I usually, I don't go this far in, in, in my presentation because for some people this could be confusing. And so now we're back to this. Like, this is what also accounts for this, the structure of this symbol, which is that both heaven and earth are in each other in the sense that, right, Heaven has to be in earth in order to activate its potential, right, towards the purpose of. But earth also has to be in heaven so that heaven can distribute itself, right? And can be motivated to act towards, towards potentiality. And so this can really help you kind of understand, I hope, can kind of help you understand the Ascension to some extent and why the Ascension is necessary in the image in the story of Christianity, which is that the Ascension is the continuation of the Incarnation. Christ coming down into the world and manifesting himself in the world is, if you think of it in terms of metaphysical structure, it's simultaneous to him going up, taking man up into heaven and that those two Christ incarnate in the world and Christ's body up in the heaven, that is the ultimate structure, that is the ultimate structure of reality and this and this. The. The yin yang is actually one of the most like successful images that manifest that right of this double. This, this double being inside each other in a different way. And as we move forward in the class, we'll see the difference between the way in which the man is in the woman and the way in which the woman is in the man will, will show how the. What is the difference between, you know, the way in which, for example, you'll, you'll hear. Because often when you hear like people talk about symbolism, they'll say things, simple things, and they're not wrong. They'll say the masculine is active and the feminine is passive. And it's like anybody who's paid attention to reality knows that that's not the case, at least. Like, what are you talking about? It's like, so the masculine is active and the feminine is passive. And then you realize, well, actually, no, actually, okay, no, the feminine is active, right? The feminine is doing all the things and the man is passive because he's giving. The king is passive, right, because he's giving the orders and the people are doing the things. So what's active, what's passive? And it just really depends on how, from what perspective you're looking at it and how you're seeing what. In what, you know. And we'll distinguish all this. Like, you'll see. It'll make sense. But I wanted to kind of take you on a. On a. On a limb and. And push you a little bit. There's no way we're getting to the end of this presentation today. It's just absolutely no way. All right, okay. But let's get back to the wheel, because the wheel is an important image to kind of understand this. So we have this beautiful quote from Saint Nicodemus of the Holy Mountain. He says, we must therefore keep in mind that as the center of a wagon wheel has a certain number of spokes going out to the circumference of the circle and so returning to the center where they meet. So also is the heart of man like a center where all the senses, all the powers of the body, and all the activities of the soul are united. All right? And so Saint Nicodemus talking about this image of the wheel as an image of the relationship of the heart to the externalities of the person, of the heart to your senses, to your. To your being. And so that's why you can have all this type of imagery that is represented. That is represented, you could say, as radiation. Image of radiation from a center. And many religious images have that structure. And that's why it's important to understand it, because if you want to be able to. To know why sometimes you represent the relationship of Christ to the world like this, right? Instead of Christ at the top of the mountain, like, you can totally understand how now it makes complete sense, because Christ is the center of the cosmos, and around him are the 12, right, the 12. The 12 tribes, the 12 signs of the zodiac, the extension of his rule and his identity in the world. Okay, but this is, again, this is a universal image. I think that it takes its highest form in Christianity, but you will see it manifested in every single culture. So the symbolism of the wheel, obviously, some of you will know this. This is. This is the. This is the. The. What is it called? The Wheel of Karma, which is this idea of the Buddhist wheel with the way in the center, and then the eighth full path of the Buddha, you know, going. Moving away from the central vision of enlightenment into the practices that people are supposed to embody in order to reach the center of the wheel. But it's there in every. Like, it's just everywhere. Here are a few examples. You have. This is the native medicine wheel, which is this wheel that is separated into four, right? And the four are joined together in the center of the wheel. Obviously you see people making mandalas. Everybody loves mandalas today because the mandala has the same, the same structure. And of course, that's what the swastika means as well. You know, I know the swastika has been captured by horrible political forces, but the swastika is one of the oldest images in the history of the world. Like, it has this sense of a unity of multiplicity and this kind of turning wheel that. That is related to a central axis. Yeah. Someone said the compass rose. What do you think my next slide is? I mean, you probably are looking at the slide presentation, right? So the compass rose is a good way to kind of understand one aspect of this symbolism and how it's all going to kind of join together in this fractal pattern that I telling you about. And how there is this cosmic way of representing how all of these purposes embed themselves together. And so in the, the, the. The directions, right, this idea of the, the rows of directions, you. You are acting as the center, right? You are the one standing here in the middle of this road, and you are connecting heaven and earth. Why are you connecting heaven and earth? Because you are the one who knows where they're going. You're the one who cares where they're going. You're the one who needs the world to be separated into direction in order to direct your action. And so you stand there and then you have this directionality that lays itself out in front of you, which represents also your separated into four because you're separated into four as well. We'll look into that later. You have in front of you, you have behind you, and you have left and you have right. And that is how the human being functions. And it makes complete sense to separate the world that way. Because when you experience the world, that is also how you experience it. As you look at the things move up in the heavens and you see these things moving east to west, east to west, you notice that in the north, the light never goes. You notice, you know, that the sun always moved from the east to the south and then comes back into the west. That there is a kind of coherence to the world and that you have to understand that you look at the heavens. This, this rose, right, comes from looking at the heavens, by the way. It doesn't come from looking at the earth. You can't get Directions from looking at the earth. You get them from looking at heaven. Then you. Then you infer them in the. In the earth, but you get them from looking at heaven. All right? And so the. Now, once you get that, like, once you get that kind of sense, you can understand that one of the best images of the world that you can come up with is this, right? And so you have. You have this vertical heaven, right? And then you have the earth as a wheel. The earth is a wheel that turns around the vertical heaven. So the heaven is the axle of the wheel is the axis of the wheel. It provides stability. It also provides direction, right? It provides the. The, say, the center of the movement. It's the stillness in the turning, right? It's the thing. It's the heart, right? It's the place where all the multiplicity is gathered. And so this axis represents a kind of connection, you know? And then the wheel is turning like this, right? So you can. You can see how it is just another version of this. So you have heaven, which is the axis, and then you have the wheel which is turning, okay? That is one of the images you can have. Now, the thing is that it's a fractal system, right? And so you have heaven, you have earth. That's the wheel. But that's not the best way of representing it. The best way of representing it is like this, right? Because what. Because you have the ladder, right? This is the ladder. So you have the vertical, and then each horizontal is a wheel. Each horizontal is a gathering of multiplicity towards the purpose at that level in the ascent into heaven, right? So you have wheels stacked on wheels, all right? Is even better way of representing it. And you could represent it this way, right? This is even better way of representing. Why is it better to represent it this way, right? Because the higher you are on the. On the axis, the closer you are to the very, very purpose of the whole hierarchy in itself. So you have a hierarchy of purposes like this. The wheel at the top is smaller, just like the. The high priest in the tabernacle. Just like Moses at the top of the wheel, he's gathering his small possibilities into the top. But he has under him a bigger wheel that has more, and under that, a bigger and bigger and bigger wheel that are all gatherings of multiplicity into the axis. And so you have this ladder that moves up into heaven that is a series of wheels, right? That are going up the ladder of, Of, Of. Of the world, right? Right. So you can think of it like the. Right, the. This border of the wheel that goes around the axis, right? You can think of it as a serpent. It's a good way of thinking about it. It's chaos on the very, very edge, right? It's the ouroboros on the edge, okay? Now the truth is that none of these things are separated, right? And so it's like we separate them and they then make sense, but they're all actually connected together, right? And so the. The. Although. The. Right. Although the. The. The. Let's say if you have a car and you have different parts of the car, right? The cars are connected in their purpose, but they're also connected. Like they have to be connected even in space. They have to have some, like, proximate connection, some measurable connection, you could say, that makes them participate in the whole. And that's why an even better way of representing this, which is not just a bunch of wheels, and it's a spiral, right? So you have a spiral that is turning, that is going around an axis, right? So it is like this. This is the way that you represent the world, right? The world is a spiral of wheels, right? That is going up an axis. It's a. It's a. It's a ladder, but it's not just a ladder. It's like a spiraling ladder that go all the way to the top. That's what. Again, the same thing. The serpent around the pole or the serpent around the tree. That is what it is representing, you know, in the story of the fall. Now, you could say it's something like. It's the periphery of the wheel that's competing with the tree. It's competing with the structure. But it can also be an expression because it is this. It is all of these possibilities kind of moving up and joining together, right? Towards the highest purpose. And that's, of course, why the Christmas tree is the best. Is one of my favorite examples. Obviously, the Christmas tree is one of my favorite examples because it's one that we make every year. You put it there. It's a triangle. It's like a cone that moves all the way down. And then you put these things around it that move up into the star. And the star is. Is the top. The star is the thing that gives the whole thing meaning. It's the image of heaven itself that is at the top of the tree that now orders the entire structure in this way. Okay, and so this is what you mean. So we have this relationship of macrocosm to microcosm, right? So you have these little wheels that are microcosms that are joined to the macrocosm, which is this hierarchy that joins it together. You can understand it in any single way that you want. And then all things that exist will have that structure. There'll be little incarnations of heaven and earth that are connected more and more and more and more to the heaven, right? So let's go crazy before. Because we're almost done. I'm not. I'm going to finish very soon here. So let's go crazy. Let's realize that, that, that the way that I've shown it until now is actually not sufficient. You can have an even better way of showing it, which is this one, right? Because every spoke of the wheel is a connection between heaven and Earth that has on it all these wheels that are also little versions of the same pattern that go up into heaven. So now remember, just remember this. Just remember the image of Ezekiel, right? Just remember the image of Ezekiel. That is what Ezekiel is seeing, not necessarily represented exactly the way that I'm showing you here, but the idea of him seeing the throne of God, that is manifested on these wheels within wheels within wheels, right? And that can move in every which direction. That is this. That. That is what I'm trying to help you see is that the world is made that way. And there's no limit to how much it can be. It's an indefinite process, right? You can have. You can separate the world in as many beings as you need to, and all of those beings will have this structure, okay? So just for fun, I even went further. And so it's like imagine now a giant wheel that you can't even see with every spoke having a wheel with. With. With a spoke, with wheels, with the spoke. And you could keep going, keep going indefinitely. Indefinitely. Indefinitely. Right? Everything is. Is heads and bodies. Everything is this kind of cosmic structure moving all the way up and all the way down. All right, all right. So now that I've driven you all completely insane, what we're going to do is we're going to take. We're going to take. We're gonna. I'm going to take a few questions. I know we're past our time, but I kind of made you suffer there for the few minutes. We're going to take some questions, and then next week I'm actually gonna. I'm gonna separate so that we can continue this part and, and hopefully we can make it land a little more. Because I was like, I mean, I'm in some ways stopping in the worst possible place because I'm going to take you. I was going to kind of take you into crazy land and then make you land in, like, completely in, like, completely. Just everyday life. But sadly, we're gonna have to do that next week. So please trust me that I'm not insane and that this will. This will absolutely makes sense to you. But I wanted to show you how far this vision of fractals and this vision of how little purposes are embedded in larger purposes. And like I said, that's what Ezekiel saw. Ezekiel saw the wheel."}
