{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":0.16,"end":59.17,"speaker":"Laura Diaz","text":"Tucson, the weight is over Mediweight loss. They're officially open on North Oracle road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iHeartRadio. And you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweight loss. I got the same medication, but with a customized plan, weekly check ins and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":59.25,"end":69.25,"speaker":"Richard Rohlin","text":"That's mediweightloss.com that St. Brendan gave Communion to a mermaid. That's actually the really tame later version of the story."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":69.25,"end":69.89,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":70.85,"end":132.9,"speaker":"Richard Rohlin","text":"It's actually much, much stranger than that. I mean, you know, communing a mermaid, that's pretty believable. The thing. The thing. But the thing that happens in this version of the story, this is really something else. So they had not gone far from there when they found a fair young maiden with golden tresses as white as snow or the foam of the wave, lying dead from the thrust of a spear which had entered between her shoulders and come out between her two breasts. So this young beautiful woman, stabbed in the back, killed lying there dead on the ocean. Vast was the size of the maiden. She was four. She was 100ft high. What, wait, nine feet between her breasts. Nose was four feet long and her middle finger seven feet long. Brendan restored her to life, baptizes her at once."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":145.46,"end":149.14,"speaker":"Jonathan Pageau","text":"This is Jonathan Pedro. Welcome to the symbolic world."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":160.36,"end":161,"speaker":"Richard Rohlin","text":"Hello everyone."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":161.32,"end":172.52,"speaker":"Jonathan Pageau","text":"We are back here with Richard Roland. You, all of you know him really well. We are going to do our second pass at the voyage of St. Brenda. That amazing, weird and disturbing tale."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":172.92,"end":173.4,"speaker":"Richard Rohlin","text":"Yes."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":173.4,"end":175,"speaker":"Jonathan Pageau","text":"And so Richard's going to take us along."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":175.72,"end":188.57,"speaker":"Richard Rohlin","text":"Well, you know, and it took us a little bit of time to get around to this because I had a baby and then a flood. But it took St. Brendan seven years to get back home. So I Feel like we're actually like, pretty. Pretty ahead of schedule. So."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":188.57,"end":215.08,"speaker":"Jonathan Pageau","text":"And I. And I. I told Richard that, you know, I'm not. I don't know how much of it is true, but there is a. There is a rumor going around the symbolic world that we call it something like the St. Christopher curse, maybe, or the St. Christopher blessing. Not sure that. It seems like people involved in the symbolic world, and especially around the story of God's dog and St. Christopher seem to seem to have floods."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":215.08,"end":581.05,"speaker":"Richard Rohlin","text":"And so, yeah, I think it says it's got a sort of initiatory quality, that's for sure. Oh, my gosh. Well, okay, so speaking of floods, when we last left our heroes, right, St. Brendan is out on the water. St. Brendan actually takes two voyages in the life of St. Brendan, or at least the version of it that we've been reading. Again, this comes from Christopher Plummer. Not Christopher Plummer. Christopher Plummer's an actor. This comes from Charles Plummer's Life of the Irish Saints. And so that'll be kind of the version that I'm reading from today. There are other versions of the voyage of St. Brendan, but this particular one is pretty old. And it works in a lot of works in a lot of kind of interesting details that I think get omitted later. And I think part of the reason they get omitted later on is because some of them are just really weird. They're really strange. You don't know what to do with them. And if you're trying to take the story and retell it in a coherent way, in a way that feels like it's like a narrative, some of these things can be a little bit frustrating. Fortunately, I am not burdened with the need to do that today. So I'm just going to read some weird things to you. And I think the thing that we left on last time was this idea of celebrating Posca or celebrating Easter on the back of the monster. And this is an idea that sort of I come back around to over and over again in my imagination. I especially think about, you know, Pascha during, you know, Pascha 2020. And, you know, what happened that year, you know, where we weren't be able to be in church and then, you know, how were we supposed to keep the feast in that year? And actually what we did at my house is that we had friends came over and we. We just did a reader service and we did like the whole midnight office for Pascha and everything else, and we lit candles and we processed around the house. And honestly, as rough as that year, Was. That is one of my favorite memories. I mean, it was just really, really blessed. And afterwards, we had a bunch of food. And I don't want to trivialize how difficult and traumatic that year was for everyone, but at the same time, there was this kind of the sense of being out on the waves that year. And so this is the story. This is how it goes. When, however, Easter drew near, Brendan's company began to say to him that he should land for the celebration of Easter. And the interesting thing is that there are. If you read the whole voyage of St Brendan, there are multiple times where they're serving the mass, like, basically every day on the boat. But the idea is, and keep in mind, these are skin boats, boats made out of skin, which, as we're going to see, is actually really significant in the story in a way that I think you're going to like. And so they're serving Mass every day, but they said, well, it's Pascha is coming up, so we need to, like, have a. We need to have a fixed place. We need to find land so we can celebrate Easter so God is able, said Brendan, to find a land for us in any place he pleases. When then Easter came, a great whale raised its shoulders high above the surface of the waves so that it formed dry land. And then they landed and celebrated Easter on it. And they were there one day and two nights. When they had entered their boats, the whale dived into the sea once more. However, it was thus that they celebrated Easter to the end of seven years on the back of the sea monster. So it's either that St. Brendan's first voyage is five years and his second voyage is two, or the first one is seven years and the second one is two. Numbers are 1 of the most difficult things to translate from old manuscripts. And so there are places where the manuscripts kind of disagree. But in any case, they spend at least seven Easters like this, seven Paschas like this, for when it was near Easter, each year, it would lift its back above the sea, forming dry land. Now, this story would mean something very different. I mean, obviously, to modern people. We are just, you know, the story just sort of bounces off of us. We're like, oh, that's weird. How could that even happen? How could that be a real thing? But this would mean something very different to somebody in the Middle Ages because of what whales mean, right? What a. What a whale is. I mean, a whale is really a sea monster. And you can definitely imagine if you're sailing along the North Atlantic and A little boat made out of animal skins and you see a whale. I mean, that is potentially extremely bad news. Right. And so there's a couple of. A couple of old sources that you can go to for how whales were viewed. I'll just give a couple here. This is from a second century Latin kind of bestiary or a book of natural history with, you know, what we would consider to be like biology or something like that now. And it says that there is a monster in the sea which in Greek is called an aspo. Oh boy, here we go. Aspido decaline. I got that wrong. Aspido kelowni. Aspidocelloni. There we go in Latin, the asp turtle. It is a great whale that has what appears to be beaches on its hide, like those from the seashore. This creature raises its back above the waves of the sea so that sailors believe that it is just an island. So that when they see it, it appears to them to be a sandy beach such as is common along the seashore. Believing it to be an island, they beach their ship alongside it and disembarking, they plant stakes and tie up the ships. Then in order to cook a meal after this work, they make fires on the sand as if on land. But when the monster feels the heat of these fires, it immediately submerges in the water and pulls the ship into the depths of the sea. So this is like some kind of a large turtle or some kind of a large whale. In the Alexander Romance, which I. Yeah."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":581.05,"end":581.85,"speaker":"Jonathan Pageau","text":"There definitely is this."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":581.85,"end":598.65,"speaker":"Richard Rohlin","text":"There definitely is that story in the Alexander Romance. It says they landed on the so called island in an hour passed, suddenly it proved to be no island but a monster which plunged into the sea. We shouted and it disappeared. But some of my companions met a wretched death. Among them, my best friend. That's Alexander writing to Aristotle."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":598.65,"end":603.29,"speaker":"Jonathan Pageau","text":"Yeah. So you find that in the story of Sinbad. There's a lot of old stories that have this."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":603.29,"end":691.27,"speaker":"Richard Rohlin","text":"Yeah, this idea is kind of surprisingly well documented. You could say. Make of that what you will. You know, all the crypto bros. By which I mean like the cryptozoology bros, not the bored monkeys bros. But yeah, get in the comments. I mean, so if you read medieval bestiaries, then what they do with this idea is they see the whale as actually a type of the devil and that the devil sort of. Or a type of the passions. Right. This thing that sort of deceives you into thinking it's one thing, into thinking it's solid land, into thinking that you're going to be safe here, that you can rest here, that you can eat here, and then it dives beneath the sea and it takes you down with it. That's the basic idea. So then knowing that this is a kind of a common understanding in the ancient world and in the Middle Ages, we have this, like, what do you do with this story? So this is where I present the weird thing and then I pass it over to you, Jonathan. But no, you can sort of say, like, what do you do with this story? That basically it's the devil, right? Basically, it's the passions. Basically, it's the thing that you spend your entire life actually as a monk trying to get away from, trying to escape, trying to defeat. And that's the miracle that comes every year. So you can celebrate Easter."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":693.11,"end":705.19,"speaker":"Jonathan Pageau","text":"Yeah, but I think. I think that you. The way to understand it is to see it in a wider. As a wider frame. That is that in some ways it's an image also of resurrection."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":705.19,"end":705.59,"speaker":"Richard Rohlin","text":"Right?"}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":705.75,"end":782.49,"speaker":"Jonathan Pageau","text":"It's an image of basically body being pulled out of the water. It's an image of creation, of the first. Of the first creation, you know, when God can, you know, calls the dry land out of the sea. So I think that it's. That makes sense for it to be there at Pascha. I think there's also an image of the defeat of death, you know, but you can understand the defeat of death in many ways, sometimes as, like spearing the monster. But also the walking on water is part of this idea of Christ defeating death. So I think that's why all of these images come together. So you can understand it, like just in the same way that all the images of the body are often associated with the passions because of the fact that the body tends to pull our attention towards it and then can kind of enslave our attention in ways, in different ways. But then the body is also. Is also positive, right? It is also the gathering of matter towards purpose and stuff. So I think in this case, what we're seeing is, of course, the positive aspect of the symbolism, which is the gathering of the potential. And then it appears as firm ground on which to celebrate the resurrection of. Of Christ, you know, and then. Then it. Then it. Then it goes away after that. So to me, that's what I would. That's what I would think."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":782.89,"end":872.19,"speaker":"Richard Rohlin","text":"And I always think about. I mean, in the. In ancient Christianity, in both the east and the west, the thing that you read on Holy Saturday is the story of Jonah. That's the thing you read on Holy Saturday. We know they were doing this, by the way, in the Latin Church as well, because Augustine writes about. St. Augustine writes about it. But. Yeah, so there is also, I think, some kind of connection here with the story of Jonah. Right. And with the idea that, you know, the sea monster that swallows Jonah is death. Right. It's the leviathan. It's death. It's all those different things. But then also it's the thing that. That God made and ordained for that particular time. And, you know, God commands it to do things. Right. And so, I mean, there's this. There's this image in the psalm, you know, talking about Leviathan, where. Where the idea is that Leviathan is. Is. Oh, this isn't Psalm 103. It's the. The. You know, that. The. The. That God made the sea and then Leviathan to play in it. Right. And the idea is actually that the. The sea is God's mixing bowl or just to weird people out, I think, really, in Hebrew, it's like his divination cup and then. And the Leviathan is just like his little pet goldfish, you know, that kind of plays around in the water there. Right. And so. So we definitely see some of this here. You know, it's. It's very much. Listen, we're waiting for God to provide. Don't worry. God will provide him for himself. A land. See, it's a little. Yeah, yeah, yeah, yeah."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":872.19,"end":874.91,"speaker":"Jonathan Pageau","text":"So I think that all of that is. It makes total sense."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":875.15,"end":875.59,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":875.59,"end":907.32,"speaker":"Jonathan Pageau","text":"You know, like the idea of the land that comes out of the water. If you think about how at the end of the story of Noah, they end up on a mountain, you know, that's also an image of like the land that comes out of the. Of the waters. But there's also some aspect of maybe this. This strange symbolism of the idea, you know, how the Leviathans defeated in the end and how the sea monster, like the feast of the sea monster that is there in some of the Hebrew traditions. Like the idea that Leviathan is we're actually going to eat Leviathan at the end and wear the skins and all that type of event."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":907.32,"end":909.36,"speaker":"Richard Rohlin","text":"That's okay. This happens in this story too. So."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":909.36,"end":909.68,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":909.68,"end":934.92,"speaker":"Richard Rohlin","text":"So we're good? Yeah, we're good. Yeah, yeah. Okay. So the next story that I want to tell is the story of. You'll have heard sometimes, and I think we even put this in the thumbnail for the last video we did on the life of St. Brendan, that St. Brendan gave Communion to a mermaid. That's actually the really tame later version of the story."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":934.92,"end":935.56,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":936.6,"end":998.54,"speaker":"Richard Rohlin","text":"It's actually much, much stranger than that. I mean, you know, communing a mermaid, that's pretty believable. The thing, the thing. But the thing that happens in this version of the story, this is really something else. So they had not gone far from there when they found a fair young maiden with golden tresses as white as snow or the foam of the wave, lying dead from the thrust of a spear which had entered between her shoulders and come out between her two breasts. So this young, beautiful woman, stabbed in the back, killed, lying there, dead on the ocean. Vast was the size of the maiden. She was 4. She was 100ft high, 9ft between her breasts. Her nose was 4ft long and her middle finger 7ft long. Brendan restored her to life and baptizes her at once."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":999.42,"end":1129.34,"speaker":"Jonathan Pageau","text":"This is it, folks. This might just be the culmination of my life's work. Join me for the symbolism masterclass this April 2025. During this course, I'll take you by the hand into the essentials and depth of symbolic thinking. Over six weeks and over 18 hours of lectures and Q&As in a concise and comprehensive way, I'll teach you everything about how I think, so that by the end, you might see the world anew. This class will not only be an introduction, but also a deep dive into a way of seeing that cuts right through our secular dead end. It reconnects the ancient religious ideas with some of the most cutting edge notions of complexity developed today. As the world is shaking and changing at an increasingly rapid pace, being able to read the patterns of reality will give you an anchor and a solid sense of what is up and what is down. In this class we will talk about so many things, about heaven and earth, the sacred and the secular, the the Bible, dragons, demons, fairies. We'll explore the surprising value of conspiracy theories, how symbolic patterns are found in movies, in science, philosophy, art. We'll look at the relationship of symbolism to natural selection. We'll look at the basic patterns of the world of sacrifice, of the center, the margin, the masculine, the feminine, the mountain, time and space, left and right. It will be a synthesis of everything I've covered in the 500 YouTube videos that put out over the years, and much more as well now, all in a structure that has one purpose, which is to make you a master of symbolic thinking. This is your opportunity to get to the core of what symbolism is, to ask questions, to test out your ideas, and to make sure you have a strong foundation of the fundamentals of plus getting some hidden gems that I've never shared before, so don't miss out on the live experience and register today. Yeah, we're missing that part. We're missing the giant part."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1129.34,"end":1142.74,"speaker":"Richard Rohlin","text":"Huh, huh, huh? He asked her further of her race, and she said, I am of the dwellers of the sea. So she's not described here as a mermaid, but she is a kind of like, you say, like an undine. She's some kind of a giant."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1143.06,"end":1145.94,"speaker":"Jonathan Pageau","text":"She doesn't have. It doesn't say that she has a tail."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1146.18,"end":1171.63,"speaker":"Richard Rohlin","text":"Yeah, yeah, yeah. And. And you'd think that they would mention that in the description, which is, like, fairly exact otherwise. Yeah, there's no tail mentioned, but she's a giant from the depths of the sea. She's like. She's like a titan. Right? Like a sea nymph, something like that. Right. And he asked further of her race. He said, I am of the dwellers at the sea, said she, the folk who pray and. And entreat for resurrection."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1173.55,"end":1173.95,"speaker":"Jonathan Pageau","text":"What?"}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1174.19,"end":1175.39,"speaker":"Richard Rohlin","text":"So what does that mean?"}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1177.15,"end":1184.51,"speaker":"Jonathan Pageau","text":"What, she's. She's saying she's a remainder from before the flood? Is that what she's saying?"}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1184.75,"end":1186.03,"speaker":"Richard Rohlin","text":"That seems to be what she is saying."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1186.03,"end":1186.83,"speaker":"Jonathan Pageau","text":"Oh, my goodness."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1187.15,"end":1196.63,"speaker":"Richard Rohlin","text":"And I just want the audience to know that Jonathan had a chance to look at notes before this, like, so that he would be prepared for this stuff. And he's like, we'll just go, you can."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1196.63,"end":1198.35,"speaker":"Jonathan Pageau","text":"I am not prepared for any of this."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1198.84,"end":1199.68,"speaker":"Richard Rohlin","text":"Oh, my God."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1199.68,"end":1213.16,"speaker":"Jonathan Pageau","text":"So they're suggesting that she is an Ephraim from before the flood and that she is. She has this desire for. To. To return. Like, she had the desire to be saved, basically, that she."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1214.12,"end":1247.52,"speaker":"Richard Rohlin","text":"So this is the thing. The thing about. You could say, like, fairies or fae creatures, you know, whatever they are, the monsters, the fairies, the. The she. In Celtic storytelling, this is the thing that they're always really concerned about, which is, is there salvation for me? Yeah, there's a. There's a famous collection of eyewitness accounts of people who ran into fairies, you know, and then, you know, somebody went around and collected all the stories. And the question the fairies always have whenever they meet a Christian is."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1249.92,"end":1250.2,"speaker":"Jonathan Pageau","text":"You."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1250.2,"end":1261.12,"speaker":"Richard Rohlin","text":"Know, is there, you know, can we be saved? Can we be baptized? Is, you know, can we be resurrected? And the answer to this question usually is no, that can't be known until the Day of Judgment."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1261.28,"end":1263.36,"speaker":"Jonathan Pageau","text":"But Brendan seems to be like, nah, we're good."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1263.6,"end":1267.28,"speaker":"Richard Rohlin","text":"Yeah, but I mean, like, Brendan is doing this."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1267.52,"end":1274,"speaker":"Jonathan Pageau","text":"I'm gonna resurrect the dead. She's dead. It's not like he found her in trouble or she was dead."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1274.48,"end":1285.06,"speaker":"Richard Rohlin","text":"And if she's a giant from the. I mean, we're sort of reading in here, but, I mean, like, if she's like a giant from before the flood or whatever, you'd have to be like, well, she's dead. Who killed her?"}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1285.38,"end":1293.22,"speaker":"Jonathan Pageau","text":"Like, you know, a big spear across, you know, coming from heaven. No, Piercing her through her back."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1293.86,"end":1343.84,"speaker":"Richard Rohlin","text":"So baptizes her and then asks her this. He says, do you want to go to heaven or do you want to go back to your own country? Do you want to go to heaven at once? Which would mean you die now, or do you want to go back to your own country? That is, like, back to wherever, you know, the deeps, you know, which is also hell. And, you know, like, where do you want to go? And she answered in a language which no one but Brendan understood and said, to heaven, in truth, said she, for I hear the voices of the angels praising together the mighty Lord. And so, after receiving the body and blood of Christ, she died there without a struggle and was buried honorably by Brendan."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1346.4,"end":1346.8,"speaker":"Jonathan Pageau","text":"Wow."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1346.8,"end":1350.12,"speaker":"Richard Rohlin","text":"And that's. That is the story. Yes."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1350.12,"end":1351.6,"speaker":"Jonathan Pageau","text":"And why. That's some w stuff."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1352.08,"end":1352.6,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1352.6,"end":1357.32,"speaker":"Jonathan Pageau","text":"Yeah, man. Yeah. And we thought St Christopher had all that. And it's like."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1357.32,"end":1357.56,"speaker":"Richard Rohlin","text":"It's."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1357.56,"end":1357.76,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1357.76,"end":1386.78,"speaker":"Richard Rohlin","text":"I mean, it's. It's obviously, like, that's an insane story. And I would like, caution people against, you know, trying to take this to your priest and be like, church. Yeah, yeah. Like. Like, don't, you know, probably. Like, probably don't put this, like, you know, make an icon and put it in your church. Unless you live in Ethiopia, where you can probably get away with it. But the rest of the episode is just going to be John."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1386.78,"end":1389.1,"speaker":"Jonathan Pageau","text":"It's going to be laughing hysterically forever."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1389.36,"end":1389.68,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1389.76,"end":1392.56,"speaker":"Jonathan Pageau","text":"Yeah. Wow. But this is. This is amazing."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1393.52,"end":1501.53,"speaker":"Richard Rohlin","text":"Yeah. I mean, the thing to maybe mention is that this is right after they met, they ran into, like, big whirlpools, like big burling, boiling whirlpool pools which threatened to kind of, like, suck them down. Which, you know, feels like a moment from the Odyssey a little bit. And then right after that is when the devil shows up to Brendan's boat. And the devil shows up to Brendan's boat and settles on the mast in front of Brendan. Only Brendan can see him. And it says, Brendan then asked the devil why he had come before his proper time, that is before the time of the Resurrection, the day of judgment. So the resurrection, the day of the Resurrection is like the. It's the big thing that is looming all throughout the life of St. Brennan, that's the big thing everyone is looking forward to. So whenever somebody says they're going to die or they want to ask Brendan, where are they going to die? What they will say is, where will I have my resurrection? Which is to say, this is the place. My body is going to wait until the resurrection. The devil said at once to be tortured in the depths of this black, dark sea, am I come. Brendan then asked him, how. So where is that infernal place sad is that, said the devil, that no one can see it and survive. However, the devil showed Brendan the door of hell and he saw its pains and miseries. Then his company asked the holy monk, who art thou talking with? Said they. Brendan told them what he saw and told them some small portion of the pains which we have said he saw, as is found in the writings of the Old Testament. Which writings of the Old Testament, which talk about the pains of hell, you ask. This is probably the book of Enoch."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1501.77,"end":1504.65,"speaker":"Jonathan Pageau","text":"Yeah, yeah. Because I was gonna say, like, where is it?"}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1504.89,"end":1522.37,"speaker":"Richard Rohlin","text":"Which is. Which is definitely kind of part of the Old Testament in Ireland at this time, at least as far as we can tell. The pains of hell are not actually described in. In the Old Testament, unless you want to say maybe in the psalms. But then in that case, usually they would just say the Psalms. Like the psalms are."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1522.37,"end":1523.05,"speaker":"Jonathan Pageau","text":"Yeah, yeah."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1523.05,"end":1550.77,"speaker":"Richard Rohlin","text":"Kind of their own thing. All right, then, said one of his company to Brendan, let me see some of those pains. On being permitted to see the varied pains of hell, he died forthwith and said as he expired, woe, woe, said he, for all who have come and come and shall come into this prison. Thereupon Brendan prayed and restored to life his companion who had died. So this is the story that comes right before. And it says they had not gone far from there when they found the fair young maiden."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1550.93,"end":1555.93,"speaker":"Jonathan Pageau","text":"Okay, so the order is, this is before the. The mermaid."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1555.93,"end":1559.69,"speaker":"Richard Rohlin","text":"Yeah, this is before they find the. The sea giantess. And it's."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1559.69,"end":1561.57,"speaker":"Jonathan Pageau","text":"Whatever it is after the whale story."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1561.89,"end":1563.17,"speaker":"Richard Rohlin","text":"Yeah, yeah."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1563.81,"end":1566.45,"speaker":"Jonathan Pageau","text":"Are you skipping stories, or are they. Actually, this is."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1566.93,"end":1582.53,"speaker":"Richard Rohlin","text":"I am skipping a. In this particular case, it's whale story. Whirlpools. Devil shows us the pains of hell which are in the depths of the sea, and then. Then we meet the giantess who is from the people who live in the depths of the sea."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1582.53,"end":1583.13,"speaker":"Jonathan Pageau","text":"Yeah, yeah."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1583.13,"end":1593.93,"speaker":"Richard Rohlin","text":"And so especially, like, with the sort of, like, the. The Enochian background to this, I think there's zero chance that this isn't supposed to be a reference to someone, one of the giants from before this, because it just."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1593.93,"end":1595.05,"speaker":"Jonathan Pageau","text":"Yeah, all of it."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1595.21,"end":1597.21,"speaker":"Richard Rohlin","text":"It all flows in and it. Yeah."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1598.17,"end":1598.53,"speaker":"Jonathan Pageau","text":"Wow."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1598.53,"end":1611.42,"speaker":"Richard Rohlin","text":"So that's, you know, and I do want to say I don't think that this story would have happened in Ireland. Right. This is the sort of thing, you know, that could only happen out on the sea. Right. In this kind of this liminal place."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1611.66,"end":1612.54,"speaker":"Jonathan Pageau","text":"In America."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1613.02,"end":1613.98,"speaker":"Richard Rohlin","text":"In America."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1617.34,"end":1620.54,"speaker":"Jonathan Pageau","text":"Richard Kenneth, on the Way to America."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1620.62,"end":1623.5,"speaker":"Richard Rohlin","text":"On the Way to America. I mean, America. Yeah."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1625.42,"end":1632.54,"speaker":"Jonathan Pageau","text":"But definitely. I mean, I think it's important to notice how coherent a lot of the images are in the sense of what it is to."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1632.7,"end":1633.1,"speaker":"Richard Rohlin","text":"That's right."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1633.1,"end":1663.19,"speaker":"Jonathan Pageau","text":"On the ocean. And what it is to be not only sailing on the ocean, but sailing west towards the edge of the world. And how all of these. These ideas of both, you know, this notion of a kind of new creation with the whale coming out on the Resurrection. At the same time, the idea of this. This monster that's lost in the. On the edge of the world, that is a remainder of the old world, but is also being saved and resurrected. And the devil as well. I mean, the idea that the devil is in the west is not a. Is not."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1663.19,"end":1663.47,"speaker":"Richard Rohlin","text":"That."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1663.63,"end":1664.83,"speaker":"Jonathan Pageau","text":"Is not that ridiculous."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1664.83,"end":1667.47,"speaker":"Richard Rohlin","text":"Right. The devil's in the West. Hell is at the bottom of the sea."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1667.55,"end":1668.03,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1668.03,"end":1688.59,"speaker":"Richard Rohlin","text":"But also, like, you know, when. When Brendan. So. So, okay, this is like a poorly formed thought, but let me try to put it out there for you. So there's this thing where Brendan is. He's meeting this woman, and it's not clear if they meet her on an island or if she's just sort of floating in the water."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1688.59,"end":1688.87,"speaker":"Jonathan Pageau","text":"Right?"}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1688.87,"end":1766.73,"speaker":"Richard Rohlin","text":"Yeah, but she's from the depths of the sea, which, as we've just established, is where the door to hell is. Right. Which is good biblical imagery as well. So we have this door to hell and then there's heaven up there, hell down here, and there's nothing really in between because we're just on the water. But the thing that we meet is sort of like one of these sort of in between creatures. Right. She's like some kind of a monster. In this case, she's a giant. In later versions of the story, she's a mermaid, or at least that's a vision, you know, a version that's entered popular legend. But there's, you know, you could. I mean, the idea of, like, a giantess who, like, lives at the bottom of the sea is a pretty common image in seafaring cultures, especially in northern Europe. And so she's. She's from a race of people who have been imprisoned in hell. That seems to be the case. And so then Brendan basically gives her the option, like, where do you want to go? But you can't stay in the middle anymore. Like, it seems to be something like that. The fairy thing really bothers people. People are always wanting to know, like, what's the deal with fairies? Do they really exist? I mean, and the thing to understand is that that question is what a fairy is."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1767.21,"end":1768.65,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah, that's great."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1768.89,"end":1773.61,"speaker":"Richard Rohlin","text":"Like people, you know, and so people will kind of object to this."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1774.95,"end":1780.99,"speaker":"Jonathan Pageau","text":"Even the idea of fairies asking whether or not they can be saved is asking something like if the fairies actually exist. That's right."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1780.99,"end":1818.28,"speaker":"Richard Rohlin","text":"Right, exactly. Because in the end, that's actually. It's between existence and non existence. That's right. So there's always. The funny thing is that, you know, whenever, you know, I've definitely seen, you know, clergy, you know, sort of roll their eyes. Oh, this question again, why are people asking this? This is probably Jonathan Peugeot's fault. People are asking these questions and they'll be like, well, nothing is really, you know, there's no such thing as an in between thing. Right, that's right. And that is actually always the answer that in the stories the clergy tell, that's what they always tell the fairy."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1818.28,"end":1818.76,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1818.92,"end":1824.12,"speaker":"Richard Rohlin","text":"Like, you know, that's the right answer for a priest to give to that question."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1824.12,"end":1834.54,"speaker":"Jonathan Pageau","text":"Yeah. The problem is that I think that that's right. The best way to think about it is I think that that's true. You could say something like, there's no such thing as an in between thing in the eschaton."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1835.1,"end":1835.5,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1835.5,"end":1889.57,"speaker":"Jonathan Pageau","text":"But to not. But now, sadly, we deal with that, we deal with that, that, that problem. Like we deal with the idea that there's no judgment yet, there's no final judgment in order to put things in there completely in their place. And so we, we deal with. In some ways, it's a consequence of sin. The idea of unformed things or malformed things or things that are half formed is a. Is a consequence of sin. Because that's what sin is. That it's basically not hitting the target, not, you know, not having a clear identity or having a mitigated or a confused identity. So. So we have to know how to deal with this stuff, you know, in the, in the world. And so. And in the scriptures, there are stories that talk about this. You know, the story of the. The saving of the mermaid, you know, is really the story of the saving of the Ethiopian eunuch in."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1889.57,"end":1890.29,"speaker":"Richard Rohlin","text":"Right in."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1890.29,"end":1904.25,"speaker":"Jonathan Pageau","text":"In the story, in the acts. Because it's Very similar. And it happens, you know, it happens on the edge. And this encounter with a man who is from very far away, who looks very different from us, but is also castrated. And so it is like a kind."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1904.25,"end":1906.45,"speaker":"Richard Rohlin","text":"Of like a half a man."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1906.53,"end":1942.26,"speaker":"Jonathan Pageau","text":"Half a man or a confused. Like a confused identity, you know, and then the whole story of it going into the water and then Philip, you know, disappearing into the heavens like Elijah and leaving behind this, this. This being that's like, kind of like the garment of skin, like this, this, this being who's there. All of this is what that story is about. And so we have several stories in Scripture, but then of course, the St. Christopher story as well, that talk about how, you know, what is the role of these intermediary things in the meantime, you know, before the. The Last Judgment."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1942.34,"end":1975.55,"speaker":"Richard Rohlin","text":"Yeah, yeah. Anyway, so I think what you said is really important and I just want to emphasize it. It's. That these episodes seem like they're just random things, but if you just take them together, it's very clear that part of this cohesive picture of life and death and the resurrection and Easter and hell and heaven and like kind of all of these opposites, you know, with Brendan kind of being the thing that, that it is in there, in between all of them, mediating them. Yeah, yeah. Which is what. Which is what saints do."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":1975.55,"end":2032.88,"speaker":"Jonathan Pageau","text":"Yeah. And it's also, I mean, I think the one thing too to understand is that in some ways think about how when Adam names the animals, you have to understand the. When the animal presents itself to Adam, in some ways it is an. It is a. It is not completely formed. There's something missing to it. It's. It is a question, you know, it's presenting itself, but it. It still needs to be named and to be stabilized. And so we can understand that. That's why humans, we struggle with the monsters we've lost in some ways the God given capacity to fully be able to do that, to always mediate God, to mediate reality, to be able to name things. So, and so we have these. We have in some ways, like I said, a consequence of sin, which is that now sometimes we have to face things that are ambiguous and don't and aren't clear. But this is a temporary thing, you know, at the end of time there, you know, the sea becomes glass and. And all identity becomes. Everything becomes a reflection of the divine order."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":2033.52,"end":2057.81,"speaker":"Richard Rohlin","text":"Yeah. So there's some more weird stories that happen on the, on the. There's a couple of more things that happen to Brendan. They're not very long, and I won't get into them right now. But they have to do with. I mean, they just have to do with sweet water and bitter water, and they have to do with dry. Well, okay, let's just talk about it."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":2057.81,"end":2059.33,"speaker":"Jonathan Pageau","text":"It's important. This is good stuff."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":2059.33,"end":2175.97,"speaker":"Richard Rohlin","text":"Yeah. Yeah. Okay. All right. So the first thing we find, the next place that we go is we find this beautiful island. Very lofty, but no harbor in which to land. So Brennan's company decides to. They try to decide to kind of coast around the island for a week, see if they can find a place to land. They're not able to, but it says that while they're doing this, they hear in it, in the island that they can't land on the voices of men praising the Lord. And they see in it a fair and noble church. So after hearing the sound of the voice of the island folk, Brendan and his company slept a spiritual sleep. And as they were not admitted to the island. A waxed tablet. This is a weird detail, by the way. A waxed tablet. There's not a lot of writing in this story, but usually when. When there is, you come across a book. This is like a wax tablet, which is. Be something you would use to, like, do your draft work on. Right. A wax tablet was let down to them with writing on it to this effect. Labor not to enter this island, for you will never enter it. But the island which you seek, that's. Remember, they're looking for paradise ye shall find, and this is not it. Depart to thine own land, O Brendan, that is, go back to Ireland, for there are many seeking thee who would fain see thee and search the holy scriptures in which it is said many are the mansions of God, as if it said many places and abodes has the lord beside this island. And after this, they turn away from the island, taking with them that wax tablet as a sign of the island, folks with welcome and care for them. And it was read aloud to them every day as if it had been from God that it was sent to them. So it's this idea that there's something holy going on here, but it's not something Brendan and his men are meant to have a part of. And so it's sort of like, you know, don't worry about what we're doing. We're not what you're looking for. You know, actually go back to your own homeland. But then eventually you are going to find the thing which you seek, which is the earthly paradise."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":2176.29,"end":2199.89,"speaker":"Jonathan Pageau","text":"This is a really interesting. Especially if it's compared to the other stories. And so you could say that in this case, the. This identity, like this world that is appearing to them because it doesn't have. It doesn't have a way in. There's no border. Like, there's no. There's no buffer between that and where they are. So because of that, they can't. They can't access it. There's no port."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":2199.89,"end":2200.29,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":2200.29,"end":2252.33,"speaker":"Jonathan Pageau","text":"There's no way in. And so it. It has a kind of completeness to it, but it's completely unavailable to them because it's separate. Like, it's a thing that's separate from their. Their. Their world. And so it's interesting because in some ways it can show you a little bit the positive aspect of the intermediary, like the need for an intermediary. Because without it, without some kind of access to the outside, then there's no. There's no possibility of. Of community, of having communion. There's no possibility of communication or of. Of dealing with them. And so. And I love how on the wax tablet, super interesting. It's almost saying, like, you know, we're a complete thing in itself, like, we're one of the mansions in God's kingdom. We're just not yours, and you don't have access to us and basically go find your thing. But. And don't worry about us. We're good. We're good."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":2252.65,"end":2269.67,"speaker":"Richard Rohlin","text":"Yeah. Super interesting. Probably some lessons that could be taken from that as we, you know, as we interact with each other as Christians, especially in the. On the Internet and especially, you know, just constantly worrying about what other people are up to and what they're doing and all those things."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":2269.83,"end":2313.32,"speaker":"Jonathan Pageau","text":"Yeah. And also I think the idea that. How can I say this? Like, the idea that there. Okay, this is the best way to think about it. The idea is that there's a fullness in. The fullness in what we participate in doesn't mean that there is no fullness anywhere else. It just means that it's not like. Can I say this? It doesn't take away from the fullness of the things we participate in. If we can see from afar that there's a kind of fullness that isn't connected to ours. Right. So the idea is, what I'm trying to get to is something like we know that the Holy Spirit is in the church and the Holy Spirit works, but that doesn't mean that God is not present in other places that are."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":2313.32,"end":2313.72,"speaker":"Richard Rohlin","text":"That."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":2313.96,"end":2316.84,"speaker":"Jonathan Pageau","text":"That are mysterious and not available to us, you know?"}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":2317.72,"end":2369.42,"speaker":"Richard Rohlin","text":"Yeah. And. And I mean, the fact that this is what they run into right after they run into the giantess is also, you know, because, like, who knows actually what's on that island, you know, Is this more. You know, it almost seems. If I had to hazard a guess, I would say that whatever is on that island is not actually human. Everybody that we run into in this whole section of the story is either an angel or a demon or something in between, but we don't run into any humans in this part of the voyage. And if I had to guess. If I had to guess, that's what I would say we're meant to understand there. But I mean, it's, you know, that's just a guess because the whole point is whatever is here, it's not for you. Don't worry about it."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":2370.06,"end":2370.54,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":2371.02,"end":2381.58,"speaker":"Richard Rohlin","text":"Go home, read the scriptures and just, you know, accept that there are things that God has for you that aren't here."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":2382.38,"end":2446.27,"speaker":"Jonathan Pageau","text":"Yeah, no, I think it's a great. Even in terms of understanding how reality works, it's such a great image, you know, and it's also. It's a great image to understand how exactly, like, the idea. The capacity we have to define things does not encompass them completely. You know, there are types of identities and types of intelligences that we don't necessarily master or that we don't have access to. And that's also like, okay, it's okay. We can also just let them be, you know, in. You know, in. In. In God's dog. We have this idea about the monsters. Like, we say there are three kinds of monsters, right? The kind you kill, the kind you tame, and the kind you leave alone. And I feel like this is a version of that, but not in terms of monsters, in terms of identities or worlds. Like, there are worlds that. That you can encounter. Right. There are worlds that you can. That can defeat you or that you can defeat, but there are also worlds that are just not. They're just not available to you."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":2446.27,"end":2447.47,"speaker":"Richard Rohlin","text":"Yeah, it's not available to you."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":2447.55,"end":2448.99,"speaker":"Jonathan Pageau","text":"Yeah, it's okay."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":2449.47,"end":2470.47,"speaker":"Richard Rohlin","text":"Yep. I think it's part of the. The temptation of modernity. And this is really part of the spirit of Babel is this desire to try to make every. Everything, integrate everything, cohere, like, gather everything into one place under one, you know, and that's a. That's a. Obviously that's something that will be in the eschaton."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":2470.87,"end":2471.51,"speaker":"Jonathan Pageau","text":"Yeah, yeah."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":2471.51,"end":2479.43,"speaker":"Richard Rohlin","text":"You know, like, it'll be there in the resurrection. But if we try to do it under our own steam, then it, you know, it's. That's what the mark of the beast is."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":2479.51,"end":2505.2,"speaker":"Jonathan Pageau","text":"And there's something. I think there's something really relevant right now, like in terms of the whole psychedelics question, like that idea of what it is that they encounter, what the. The experience they have there where they can see the coherence of a world, but basically it's not their world and there's no way in. And in some ways they just have to go back. Go back to your world and go back to your thing and don't. Don't worry about it, you know?"}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":2505.6,"end":2562.62,"speaker":"Richard Rohlin","text":"Yeah. All right. So the last thing that happens before Brendan's first voyage ends, it says they're out on the ocean rowing, when a violent thirst seizes them so that they well nigh died. Then they saw fair streams of water distilling and dropping from the crags. The brethren asked, may we drink some of yonder water? Said they. Bless it first, said Brendan, to ascertain what it is when they had blessed the water and chanted alleluia over it. Which, by the way, is also how we bless the water for baptism in the Eastern church. I don't know what they would have done at this time, although there's some weird Greek liturgy references in the story, which we'll get to in a minute. But they. They blessed the water, they chant alleluia over it, and then the streams dried up at once, and they saw the devil darting from the water, and he would kill all who drank of it. Thus were Brennan's company saved by his power, and their thirst vanished at once, and the place was closed upon the devil that he might do no harm to any man thenceforth. So it's like the island sort of swallows the devil up."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":2563.9,"end":2591.32,"speaker":"Jonathan Pageau","text":"Wow. Yeah, that's very interesting. Yeah. It's another version of the story we just saw, but in the sense that this one is negative, like the other one, it's more like the. Here is a. Here are some possibilities. Here's a world that exists, like type of coherence that's just not yours. Like, just don't bother with it. Go do your thing and be content with what you have. And here it's actually an island or a world that. That its source is poison to you. Like, it will."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":2591.64,"end":2592.08,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":2592.08,"end":2593.48,"speaker":"Jonathan Pageau","text":"It will actually destroy you."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":2594.04,"end":2611.59,"speaker":"Richard Rohlin","text":"Yeah. And then there's some interesting kind of baptismal imagery there. Again, one of the things we do to prepare water for baptism is to bless it and to basically sort of kick the devil out of the waters, which is this very ancient idea which you have here, which you've actually seen. We've Seen kind of multiple times."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":2611.67,"end":2619.59,"speaker":"Jonathan Pageau","text":"But here the idea is that it's only the devil. So once they kick the devil out of the water, the water goes away. It basically shrivels up."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":2619.83,"end":2621.91,"speaker":"Richard Rohlin","text":"But also they're not thirsty anymore afterwards."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":2622.47,"end":2641.61,"speaker":"Jonathan Pageau","text":"So think about it. We could take a lot of the stories that we just heard, and we can interpret them through baptism. Right. Which is in some ways, the idea of certain things that are encountered in the world that we say. We say Christianity baptizes other. Other cultures. Like, we say that, you know, but the. The idea would be something like, there are some things in other cultures."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":2641.61,"end":2643.69,"speaker":"Richard Rohlin","text":"Sloppy language, and it annoys me, but we'll go with it."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":2643.69,"end":2645.21,"speaker":"Jonathan Pageau","text":"Yeah, yeah, but you've heard that, right?"}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":2645.21,"end":2645.97,"speaker":"Richard Rohlin","text":"Yeah, I know. I know."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":2645.97,"end":2662.18,"speaker":"Jonathan Pageau","text":"You can im. You can think that there are some things that can be baptized and come out of the waters. There are some things that. That are just completely separate, like, that are not related to the question at all. And there are some things that can be."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":2662.98,"end":2664.82,"speaker":"Richard Rohlin","text":"That you can't integrate. Yeah."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":2664.82,"end":2671.62,"speaker":"Jonathan Pageau","text":"That just stay in the water. They. They're basically a poisonous source for the world that you're participating in."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":2671.7,"end":2810.44,"speaker":"Richard Rohlin","text":"Yeah, that's good. I mean, this conversation is really helping me see the way those four stories are all really coherent with each other. Yeah, yeah, yeah. It's great. So Brendan has been on the water at this point for either five or seven years, and he makes it back, and with the instructions in the wax tablet, he turns around, goes back to Ireland. Importantly, interesting things don't happen to you on the way back home. They only happen to you on the way out. So he gets back to Ireland pretty quickly. And once he makes it back, he goes to first his foster father, who's an abbot, and then he goes to Ita, his foster mother, who is a nun and was basically the woman that raised him, and he goes to her for counsel. She seems to be a very wise woman. This is not the first or the last time Brennan will go to her for counsel. And he basically says, what should I do? I tried to get to the earthly paradise. It's not happening. And so, of course, after Ita has greeted him as one would have greeted Christ and his apostles if they showed up. This is how. In the Irish hagiography, this is how you make a. This is how you say you made a big deal over somebody when they show up, you greet them as you would greet Christ and his apostles themselves if they showed up. That's the kind of feasting, that's the kind of merriment, that's the kind of hospitality. And then she says, ah, dearly beloved son, why did you go out on your journey without taking counsel from me? For the country you are seeking from God, you'll never find on these dead, soft skins that is, on these skin boats you've been sailing in. For it is a holy and consecrated land, and no blood of men was ever shed in it. I knew you're going to like this part. And so she says, let timber mo. Timber boats be made by thee, and belike thou wilt find that land on this wise. Thereupon Brendan went into the region of Connacht, and an excellent large boat was made by him. And he embarked with his company and people, and they took various herbs and seeds to store the boat withal. And the wrights and smiths who had. Who had prayed Brendan to let them go with him. So Brendan finds out that the reason he couldn't find paradise is because you can't get to paradise on a boat of skin."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":2810.44,"end":2810.88,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":2811.82,"end":2812.02,"speaker":"Richard Rohlin","text":"Wow."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":2812.02,"end":2850.52,"speaker":"Jonathan Pageau","text":"I mean, that's amazing. For those who know, of course, the story of Moses and St. Gregory of Nyssa's telling of the life of Moses, the removing of the garments of skin is such an important part of going into paradise. Just as Adam and Eve put on garments of skin in order to be protected outside in the world of the Fall, you know, in order to go back into the holy place, you have to remove the garments of skin, especially imaged as sandals. Right. These skins that you wear under your feet that Moses removes when he goes into the holy place place. And so it's a wonderful image. And also what's interesting about it is it also seems to refer, you know, to the ark, you know, to some extent, because."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":2850.52,"end":2851.2,"speaker":"Richard Rohlin","text":"Right, yeah."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":2851.2,"end":2879.37,"speaker":"Jonathan Pageau","text":"It emphasizes the fact that he builds a boat, but then he gathers these people and these things and these seeds in. In. Into the. Into the ark, you know, and also it's funny because in the Gilgamesh version of the ark, that's what happens, Right. In the Gilgamesh version, it's not just animals, but it. It explicitly says that he brings craftsmen and all the different crafts, like a representative. All the different crafts get gathered into the ark as well."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":2880.25,"end":3082.92,"speaker":"Richard Rohlin","text":"I. I hope that people are paying attention to. How do I say this? The stuff that you and your brother have been talking about for years. Like, you're not. You didn't just, like, make that stuff up one day. Like, it's so fl. Fundamental to the pattern of the world that you find it in every single ancient story. Right? And so even. Even basic things like, well, obviously you can't get to paradise wearing your garments of skin. But also this idea that you could build something, like you could build an ark, right? Of course we talk about the church. Like, what is the church? The church is the ark of salvation. So what happens after this is they go back out on the water. And the very first thing that happens. So there's this note about taking the wrights W r I g H T s like the craftsmen, right? And the smiths who had prayed Brendan to let them go with him. So they're begging him, they build on this boat. And then they basically say, you gotta let us come with you. And he says, okay. The very first thing that happens once they get out on sea is that the smith gets sick and he's gonna die. So this is their blacksmith. He gets sick and he's going to die. And Brendan says, basically, like, you shouldn't be surprised this is happening. Depart to the heavenly kingdom, right? Or if you want to, I'll heal you and you can stay here, like in this life. And the smith says, I hear the voice of Lord calling me. So the smith dies, and they don't have anywhere to bury him. You know, obviously there's no island or anything like that. And so the brothers say basically, like, where are we going to put this guy? And Brendan says, it's no trouble. Let's just bury him in the sea. Now, the idea of like a sea burial, you know, I think it's like as kind of a given for modern people. Like, if somebody dies while you're at sea, you, you know, you do the ceremony that we've all at least seen in movies, right? You do the ceremony and then you toss the. People didn't do this in the ancient world, right? Like, because to toss the body into the sea and like, you know, it's not a Christian burial. It's not a. It's not an appropriate way to dispose of a body, right? So you need to bury the body in land. So the question is, what are we going to do with this guy? And what Brendan says is, he who made the heaven and the earth and the other elements has power over the waves of the sea to fix the corpse immovably in them. So then the smith who was buried among the waves of the sea without drifting to land and without rising to the surface of the brine, without moving in any direction as if he were in the ground, as one said, and I should mention there's a bunch of old Irish poetry interspersed all throughout the life of St. Brendan and the Normal case in stories like this. This is called prosometrical literature, where basically you have prose and then you have meter, Right? The meter. The poetry is almost always older. And what people are doing is telling the stories that people would have remembered. They're writing down the stories that come between the poems. Right? And so we get a bit of a. We get a poem, and this is probably like a 6th century Irish poem. They bury him, though it was wondrous, the smith in the ocean amid the waves of the wild sea, without sinking under the roar of the billows. And it's very clear there that the. The body of the smith is like, buried under the waves. But not like he didn't sink to the bottom."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":3083.08,"end":3084.36,"speaker":"Jonathan Pageau","text":"He kind of stayed there in the middle."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":3084.36,"end":3154.31,"speaker":"Richard Rohlin","text":"He's not floating around. It's just like they buried himself six feet under, and he kind of stays fixed in that place. And so they bring the smith from the old world, like, to paradise. But then, like, immediately, first thing that happens is the smith gets sick and dies, and they bury him in the ocean and his body sort of becomes this fixed point, this anchor in the sea. And this is important because the next thing that happens is that they show up at this island and they. They're, you know, so they drop the anchor at the island they're about to unload. And then it says the harbor was filled with demons in the shapes of dwarves and leprechauns. So if you were wondering, when are the leprechauns coming along? Here they are. And Brendan says, go ahead and bring. Bring the anchor up again. Let's get out of here. Because no one can enter this land but he who shall wage human war against demons and shed blood over them. And the, you know, the idea seems to be like the demons here have taken this physical form, and we don't want to fight them with human weapons. This is not how monks fight demons. It's a little. So."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":3154.31,"end":3169.19,"speaker":"Jonathan Pageau","text":"So what is that? Let me ask you a question. Like, what is the difference between a dwarf and a leprechaun? I mean, I get. I have the cliche image of it. Yeah, it's like the leprechaun on guard, the pot of gold and stuff."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":3169.43,"end":3169.79,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":3169.79,"end":3171.51,"speaker":"Jonathan Pageau","text":"I mean, more of a trickster figure."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":3171.91,"end":3266.29,"speaker":"Richard Rohlin","text":"Yeah. I mean, the. The idea, you shouldn't be thinking of, like, you shouldn't be thinking of. Of when you. Well, first of all, when you hear dwarf, you shouldn't be thinking of, like, dwarves from, like, Middle Earth, like Tolkien dwarves. Right. You know, dwarf here is. Is something like, if there's a difference between elves, dwarves, leprechauns, at this particular time, right? In the 6th century or whatever. It's not really at all clear to us, but the idea is dwarves are this thing that are kind of from under the sea and then. Whereas a leprechaun is the sort of fairy that will. If you. I said dwarves. Dwarves, like, dwarves live under the earth and they do the forging, right? So in that sense, they're like Tolkien's dwarves, but also not really at all like Tolkien's dwarves because they can shapeshift and they're tricksters and all these other things. But then leprechauns are. They are a kind of spirit or like fairy associated with the sea. And they can. You know, the classic story is that you sort of fall asleep on the beach and then the fairy. And then you wake up and the leprechauns are dragging you into the. Into the ocean. But if you can capture them, then you get the wishes, you know. So that part of the story is pretty old, but, you know, like pot of gold, little green jacket, all that stuff. Much, much later. Much."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":3266.29,"end":3266.77,"speaker":"Jonathan Pageau","text":"A little later."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":3266.77,"end":3290.82,"speaker":"Richard Rohlin","text":"Yeah, much later. But the question here is like, is it really fairies or is it demons that look like fairies? Because it says demons in the shapes of dwarves and leprechauns opposing them. And people sometimes seem to have the idea that. Okay, well, the, the. You could either say fairies are this in between thing or they're always demons. But in this story, it really seems like sometimes it's one, sometimes it's the other thing."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":3291.06,"end":3333.85,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah. It makes sense in terms of experience, you know, because that's. Demons are always represented also as an, As a intermediary thing, because in some ways something that has no substance, which suddenly has substance, like the aspect of their demon aspect, which is the negative aspect of principality, is manifesting itself. But how is that possible? Like, how does evil have body? How does evil have being? It's not supposed to, but then that's the strange thing about the twisting and the fall. So it's. It. And the way we represent demons in the Western tradition especially is as these ambiguous kind of hybrid creatures that have different parts of different animals and stuff. So they."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":3333.85,"end":3388.57,"speaker":"Richard Rohlin","text":"And maybe they want to. They want to steal you away or they want to steal your soul away or. But also like there is an association about the dwarves, you know, between the dwarves and like, you know, the craft of smithing and they, They've just lost their smith, right? And so what happens is they're trying to get away from the harbor, but their anchor won't come up. So eventually Brendan, like after seven days of trying to get out of the harbor, things are just getting worse. And Brendan says, all right, just cut the anchor. Let's get out of here. So they cut the anchor, but then of course that means they're in real trouble out on the open sea. And they can't make a new anchor because the smith is dead. And so what Brendan does is that he blesses the hands of one of the priests that's on the ship with him and the priest, even though he's never worked metal at all in his life, Brendan blesses his hands and then he's able to forge a new anchor for the ship."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":3388.57,"end":3389.13,"speaker":"Jonathan Pageau","text":"Hmm."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":3392.17,"end":3394.73,"speaker":"Richard Rohlin","text":"I know. It seems like all these things kind of go together."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":3395.45,"end":3399.61,"speaker":"Jonathan Pageau","text":"You know, you can see how it makes sense. Like there's something, there's definitely something about."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":3399.69,"end":3418.91,"speaker":"Richard Rohlin","text":"Like you said, the, and the way the smith's body becomes sort of like this anchor point, like an island in the sea. And then they lose their anchor, but then they have this new one for. Forged for them. And you know, but it's made for them by the hands of this priest. Like so, I mean, it's so strange, but also like, it feels like it's."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":3420.83,"end":3461.97,"speaker":"Jonathan Pageau","text":"Yeah, yeah, like it's, it has something to do with, with the. Yeah, it has something to do with the capacity to encounter all of this like the, the, the possibility. Because the thing is that also related to the book of Enoch and to the idea of the in between world. You know, the, the smith is always an image of that. Right. The smith is an image of the, of the, of the descendants of Cain, you know, the Vulcan type imagery, this idea of an in between. That's why, you know, that's why Hephaestus is lame because he's, he's incomplete. Right. He's not completely lame."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":3461.97,"end":3476.48,"speaker":"Richard Rohlin","text":"He's a cripple, he's a hunchback. But not just, not just Hephaestus, but like Wayland, who's like the, the, the northern European equivalent also like layman, one foot or maybe castrated. Yeah, you know."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":3476.48,"end":3496.72,"speaker":"Jonathan Pageau","text":"Yeah, yeah, just like the Ethiopian eunuch. And so this, this image of the in between character. But for sure, like, it would be worth meditating on how this comes together. Like why is it that in dying or being willing to give up his. Give up his soul, why does he become this, this. Why is he held in the waters?"}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":3496.72,"end":3497.12,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":3497.12,"end":3503.04,"speaker":"Jonathan Pageau","text":"And then why do they lose their anchor? And why is it now has to be a priest that becomes black, forges."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":3503.04,"end":3508.56,"speaker":"Richard Rohlin","text":"That forges the new one. And it's like. Yeah, you could say that."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":3508.56,"end":3529.3,"speaker":"Jonathan Pageau","text":"Yeah. The idea of the priest forging a new anchor, that you can kind of understand what it is, it's saying, you know, whatever, when we get to the, to, to paradise, that the anchor has to be something that is pure, not something that is mitigated, not something that's in between. It has to be like, you know, an anchor in the heart or something like that."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":3529.62,"end":3539.38,"speaker":"Richard Rohlin","text":"Well, and the anchor is also this, this ancient symbol of Christ. Right. You know, that's like one of the early Paleo Christian symbols of Christianity is like the, the cruciform anchor."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":3539.38,"end":3549.39,"speaker":"Jonathan Pageau","text":"Yeah, but man, this one I don't think we're going to get to the bottom of. It'd be great for people to speculate in the comments and. Yeah, tell us how you see this coming together, because we can see it, it kind of glimmers through."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":3550.03,"end":3668.39,"speaker":"Richard Rohlin","text":"So because we're at kind of like we've been going a long time, I think I'll just, Let me, let me just tell a couple of stories to kind of wrap up the voyage of St. Brendan. And then. Oh man, there's so many big things where like they, they meet these sea monsters fighting and then later they, you know, like the corpse of one of the sea monsters beaches and provides them a meal. So there's the whole like eating Leviathan thing. Like, I mean there's, there's just, there's a lot of stories where they meet two monsters. But let me tell, let me, let me tell the story of. Okay, so Brendan makes it to paradise. Brendan makes it to paradise. Eventually he makes it to the, to, to paradise as in the, like the earthly makes it makes it to the earthly paradise. And he gets there and he spends some time there. And boy, I'm just skipping over so many different things. There's like a giant sea cat and not sure if he's related to the island of mice that we hit at the beginning of the voyage, but in any case, he makes them, makes it to the land of promise, makes it to paradise. And he wants to stay there and basically says like, you know, he's talking. There's this hermit there who lives there in paradise, obviously. Oh, I mean, so paradise is, it's, it's beautiful in all these different ways. It's also like totally silent, so you're not supposed to speak because it's sort of like human speech is going to like, it's going to be dangerous. And so, so, so, so Brendan and His and his monks, you know, they're enjoying. To kind of keep silent. And the only thing they do in paradise is. Is. Is pray the hours, actually. And so after the ninth hour, you know, like, basically, like after the ninth hour in vespers, Brendan finds out, okay, like, you've spent one day in paradise, like, one day praying the office in paradise. Now it's time for you to go back home, because you have things you're supposed to do in Ireland. So. So he goes back home."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":3668.39,"end":3676.87,"speaker":"Jonathan Pageau","text":"So wait, I'm gonna be. Just. Does it. Is there any idea of who the hermit is? Like, is there some kind of hint of who the hermit is or what he's doing there?"}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":3678.07,"end":3693.72,"speaker":"Richard Rohlin","text":"Okay. All right, Jonathan. I'm just wondering if it's like, really. I mean, like, the. The whole voyage is for this. We probably shouldn't skip over it. So let me. Let me tell you, there's the. So many different monster stories because there's."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":3693.72,"end":3700,"speaker":"Jonathan Pageau","text":"All these ideas of, like, maybe that give Shem going back to paradise. Melchizedek, like, all these weird legends."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":3700.48,"end":3711.56,"speaker":"Richard Rohlin","text":"So one day, when Brendan and his company were traversing and searching the sea, they happened upon the little country which they had been seeking for seven years, to wit, the land of promise. As it says in the proverb, he that seeketh will find."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":3711.56,"end":3713.12,"speaker":"Jonathan Pageau","text":"And they found it in the seventh year."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":3713.44,"end":3759.85,"speaker":"Richard Rohlin","text":"Found it in the seventh year. Yeah. Yeah. That's why it seems like the original intent is like, first voyage, five years, second voyage is two years. So seven years total. When they came near to this land and were reminded to take harbor there, they heard the voice of a certain elder speaking to them and saying, o much travailed men, O holy pilgrims, O ye who look for the heavenly rewards, oh toilsome life in laboring and waiting for this country, Stay a little from your labor now. And when they had remained a little while at rest, the elder said unto them, dear brothers in Christ, do you not perceive this glorious and lovely land on which never was spilt the blood of man? So remember, like, this is the whole kind of. The reason they can't come in the garments of skin is because to get those, you have to kill something. I think. I think it's part of the idea. Right."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":3760.17,"end":3769.4,"speaker":"Jonathan Pageau","text":"People should know that there are some tradition, liturgical traditions, in which you're not ever supposed to have animal parts on the altar in the church."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":3769.4,"end":3772.12,"speaker":"Richard Rohlin","text":"And so, I mean, that's why we don't. We don't allow leather."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":3772.36,"end":3777.48,"speaker":"Jonathan Pageau","text":"Yeah. You have a leather book on the. On the. Like, that goes directly on the Altar."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":3777.64,"end":3995.76,"speaker":"Richard Rohlin","text":"Yeah, yeah, yeah, yeah. So in which it is not fitting for any sinner or evildoer to be buried. By the way, the idea of burial is one of the main themes of the story. Like. Like almost, you know, a lot of the people that go on the voyage with Brendan, or a lot of people they run into, basically, we just see them at the moment of their death, right? And that's when you meet them in this. So. So basically, you know, but. But no sinner or evildoer can be buried here. Leave now everything you have in your boat, except the clothes that you have on you, and come up hither. So they came to land, each of them kissed the other, and the elder wept greatly for his exceeding joy. See and search and see, he said, the borders and regions of paradise, where will be found health without sickness, pleasure without contention, union without quarrel, dominion without interruption, attendance of angels, feasting without diminution, meadows sweet and scent as fair and blessed flowers, Happy indeed is he whom Brendan the son of Finlug, shall summon hither to join him. Said the same elder, to inhabit forever and ever the island in which we are. But when they saw paradise amid the waves of the sea, they marveled and. And were astonished at the wonders of God and his power when they saw these wonders. Now, the elder was on this wise, without any human clothing at all, to get to your question, right, without any human clothing at all. But his body was covered in a white down like a dove or a seamew, which is a gull. And his speech was almost like that, almost like that of an angel. And they celebrated tears the third hour after the ringing of the bell, with the giving of thanks to God, and with their minds fixed on God, but they did not dare to ask any question. Then, said the elder, let each of you pray privately without speech to any, of any to any other of you. For this land is holy and angelic. And moreover, sin commonly attaches to speech. For often in old world fables is there either sorrow or idle joy, which are the two things that you're not allowed to have in paradise. There's no sorrow and there's no idle joy. We agree in truth, said the folk, when they had remained there thus for a while, the elder came to them and said, let us celebrate the midday office. That's the sixth hour. And when they had finished celebrating the midday office, Brendan asked the elder, is it God's will for me that I should remain here until the day of doom? That is the day of judgment, which again the day of the judgment, the Day of the resurrection is always the day that's looming in the story. Yeah. And the elder answered him this wise, he who shall seek his own will opposes the will of God. And it is 60 years since I came hither, and the food of angels has fed me all that time. And my body is well nigh wasted away with old age. But it is not here that I grew old, but I continue at the age that I was when I came here. And Christ bade me to remain here to wait for thee another 30 years in addition to that first 30. And now it is time for me to go to heaven. For thou has come to me. And when you have celebrated none, that is the ninth hour, depart to your own land and instruct the men of Erin, that is Ireland, for crimes and sins shall be corrected by thee. And Christ said to me at this hour of none, that thou shouldst come into this land with thy family, thy monks and nuns, together with the saints of Aaron, seven years before the judgment and with that marvelous anchor which the priest made for thee. So seven years before the day of judgment, Brendan is going to return with the anchor forged by the priest. I do not know what the heck that means, but this is what the hermit says."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":3997.28,"end":4021.38,"speaker":"Jonathan Pageau","text":"I mean, clearly it has to do for sure. Then it's not a kind of, it's not, it's obviously not like Melchizedek or some old character, these there for 60 years. And also there's a he's. But he is in paradise. He's naked. It's like he is beatified, you know, in that sense. And so I think that maybe what he's suggesting is, is, is something like this is for you as a visit."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":4022.34,"end":4024.62,"speaker":"Richard Rohlin","text":"You know, and then you need, you."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":4024.62,"end":4082.58,"speaker":"Jonathan Pageau","text":"Need to, you'll return and then it will become your permanent abode. And that will be with the anchor, the right anchor, right? And you can anchor yourself in paradise because one of the things you see is that in some ways you can think about it as like the Jesus prayer, right? Or this, this, this as a Jesus prayer, as this moving in and moving out of paradise. If you think about it that way, as this, this capacity to, to, to inhale, you know, attention and spirit, but then you have to exhale. And that seems to be what's happening. He goes out and then he encounters these glimpses of paradise. And then he's told, okay, well now you have to go back, go back, go back to your world, you know, and then go back and then go, you go out again and then he gets closer. He actually Gets the actual paradise. And he said, well, no, you have to go back, but then you will return. And then for. For good, like, you will return with. With an anchor."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":4083.54,"end":4178.95,"speaker":"Richard Rohlin","text":"The curious thing is that, of course, the story ends with the death of St. Brendan. So the idea is that he's still going to come to this land with all the saints of Ireland, seven years before the day of judgment, with the anchor, right? And the theme that we kind of started with when we first started these videos on the voyage of St. Brendan is this idea that the saints established the world, right? And so, like, this. This idea of anchoring, this idea of, like, finding the place, right? Finding paradise, finding the place of silence, right. Finding the place of prayer and sort of establishing. That seems to be one of the. One of the things that's going on here. I should also mention that this entire time they've been. Well, I say this entire time, the whole second voyage, basically, their food has been brought to them every day by this bird, the shining bird that follows them and brings them bread and fish for each man. And that's where their food is coming from. And so the shining bird brings them the food here on this island. And then the elder, this old hermit, partakes of the body and blood of Christ and then sends his spirit to heaven. It says, doesn't. Doesn't die. He sends a spirit to heaven and then they bury his body there on the island. And remember that, you know, no, no sinner can be buried here. This is paradise, right? And so, but the. But the hermit, he. He's able to be buried there."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":4179.03,"end":4181.63,"speaker":"Jonathan Pageau","text":"So the hermit dies, right?"}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":4181.63,"end":4188.59,"speaker":"Richard Rohlin","text":"Yeah, yeah. He was there just waiting for Brendan. And now. Now it's sort of very like Saint Simeon. Let now let your servant depart in peace."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":4188.59,"end":4189.79,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah. Wow."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":4189.79,"end":4207.37,"speaker":"Richard Rohlin","text":"Yeah. So, I mean, this is all, like, wonderfully mysterious. And, you know, you would stop the story here probably if you were writing it, because, like, what else are you going to do? Well, it turns out a lot. And I just want to mention two. I know we're kind of like, long, but we can keep going."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":4207.37,"end":4208.61,"speaker":"Jonathan Pageau","text":"We've only been going for an hour."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":4209.17,"end":4699.94,"speaker":"Richard Rohlin","text":"Because I'm really having fun with this. And I just want to mention what happens when St. Brendan comes to Britain. So Brendan, to kind of summarize a little bit, Brendan goes back to Ireland and he starts setting things in order. And so we get a bunch of different miracles where he basically. And the theme of the miracles is basically that each one is there's injustice, and then Brendan balances the scales, right? And so one Day, Brendan gets angry with this guy and he turns him into an otter, like you do. And this is connected with, like, kind of this famous old Irish poem about this otter who's like, you know, so this is this man whose name means otter in old Irish, and he's. He gets. He kills one of Brendan's cows, and so he gets turned into an otter. And so he's like, swimming in the river. And then his sons from when he was a human, they come to fish in the river and he, like, sings to them out of the river. And that's the context for this poem, which also appears here in the life of St. Brendan. But in any case, eventually the man, you know, dies, and Brendan kind of feels. It seems kind of bad that he turned this guy into an otter. And so he goes to his foster mother, Ita, and asks, you know, what should I do about this? And she says, basically, you need to go to the island of Britain as sort of like a penance. And so he goes to the island of Britain. And there on the island of Britain there is a. I'm skipping so many things here. There on the island of Britain, you know, is Saint Gildas. Saint Gildas, who's a famous Celtic saint, also from the same century. This. This century, the sixth century is the century that create. That produces, like, all the great celtics, Irish and Welsh saints. So he comes to the island of Britain and there's St. Gildas, and Gildas hears that Brendan is coming. And basically he's heard stories about Brendan, but he wants to sort of test him and see if Brendan is legit, if he's the real deal, if he's really a holy man, etc. And so he puts. He basically, he has seven iron bolts put on the doors of the monastery, and then he has iron bolts put on the doors of the church. And then he has a. This is very interesting and strange detail, but he has a litter. A liturgy book. A book with a liturgy in it, but it's in Greek, set on the altar of the church. And so St. Brendan comes along and he. Yeah, right. So St. Brendan comes along and he just tells his attendant. Like, he doesn't even deal with the. The doors himself. He just tells his. His. Telemach is his name. He's basically his. His. His servant tells him to open the doors, and he goes and opens the doors and the seven iron bolts shatter. And then they get the doors of the church and. And the iron bolts on the doors of the church shatter. Iron. I don't know, maybe it's a way of making sure Brendan's not a fairy or something like that. I'm not sure. Or it's just like a really, you know, really strong lock. That's the idea. And then he gets into the middle of the church, and Gildas says. Or at least the minister of the church says to Brendan, by the command of St. Gildas, he says, same ass, Brendan. And there. There he is. And the altar is all prepared. The vessels are on it, and there's a book on it with the liturgy. But the liturgy is written, we're told, in Greek letters. So the idea is that, you know, how could you read it if you, you know, like. And I. You know, there are people who are really interested in the idea that the. That the. The Christianity, you know, may have been brought to the Celtic people originally, maybe from somewhere in the east, like northern Egypt. There's books you can read about this. There's a new one that came out recently, and I wish I could remember the name of it, but, I mean, you could say there's, like, a persuasive case to be made. So this might be a reference to that. It might also just be the idea that, hey, it's in Greek. How are you going to read Greek unless you're, like a holy person? That kind of. That St. Brendan is part of the powers that come with being a holy man. He's going to be able to read the liturgy in Greek. And so Brendan opens the book and reads out the liturgy, and then Gildas and his family, they receive communion at Brendan's hand. And just as they're about to do this, Gildas sees a human form, like the body of a little baby on the paten, and human blood that smells, you know, like coppery, like human blood in the chalice. And Gildas freaks out, because as everybody knows in the ancient world, if you see this kind of miracle associated with the Eucharist, it is not a good thing. And in fact, if you read the Church fathers, you know, St. John Chrysostom, he talks about the fact that the fact that Christ's body and blood comes to us as bread and wine is basically God sparing us, Right? So if you see something like this, it's a sign of God's judgment. Mm. And so Gilda sees this and he says, vengeance is ready to fall upon me because I have reproached Brendan. In other words, the fact that he didn't trust Brendan, he didn't recognize him as a man of God. Now he's. Now he's. He's going to be judged. And so Brendan says, and this seems to be like, part of the idea here is that St. Gildas has violated the laws of Christian hospitality, you know, that he's barred the church to a man of God who was also a fellow priest, also a fellow monastic, et cetera. And so. And so Brendan says, I will protect thee from that vengeance, for though thou didst try the strangers. And this idea of. And it's weird that in this case Brendan is the stranger. Like, Brendan has been out on the edge and he's been like, running into the stranger that you can integrate and baptize and the one that you can't, and the one that's just poisonous. But now Brendan is the stranger. And so it says then, for though thou didst try the strangers, it is now the time of remission or forgiveness, that is, of going to receive the body of Christ. Then Brandon blessed the altar once more, and it was the body of Christ the host. In other words, the bread that was on the patent and the blood which was in the chalice became wine. And when the people of Gildis have communicated at the hands of Brendan, Brendan and his company remained there for three days and three nights. And after this, things are, like, pretty good between Brendan and Gildas. And Brendan does. Does a bunch of miracles, you know, related to, like, the taming of wild animals there and everything. So one day Brendan is. He's. He's still there in the island of Britain, and he's building churches. And as he's building churches, he sees these two sea monsters which begin to fight in the sea and this. And then they take to the air, right? So they're, you know, what's the. What's the. What's the flying version of amphibious? Like, they're not land and sea, they're air and sea. But anyway, so these two sea monsters, they're fighting through the air, and one of them is just really giving the other sea monster a hard time. And the sea monster cries out in the name of Saint Brigid, leave me alone. And so the other monster is like, oh, okay, well, if you're gonna invoke St. Brigid, I don't want that smoke. And so he flies away. And Brendan turns to his monk and says, monks and says, we have to leave for Ireland right now so that I can go meet this Saint Brigid. Because how holy does she have to be that even the monsters are calling on her name? And he even says, and there's maybe a little bit of vanity here. I mean, it's always good."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":4700.66,"end":4702.14,"speaker":"Jonathan Pageau","text":"She's alive, right? At this point."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":4702.14,"end":4735.32,"speaker":"Richard Rohlin","text":"Yeah, she's alive. I mean, again, all these big 6th century saints all live right at the same time. Patrick overlaps with them as well, and he says, how holy must she be that the sea monsters even are calling on her name for intercession and they're not mentioning Brendan, you know. And so there's this kind of thing that happens sometimes in these stories where you've had this holy man who's been a holy man for a long time. There are stories like this about St. Anthony the Great, for instance, where, like, you find out there's this other person that's even holier than you. So it's kind of like, yeah, but it's not quite."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":4735.8,"end":4736.64,"speaker":"Jonathan Pageau","text":"It's not his thing."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":4736.64,"end":4762.25,"speaker":"Richard Rohlin","text":"Yeah, put you in your place, right? So they go to Ireland. They go back to Ireland and they meet with St. Brigid. And this is when, by the way, St. Brendan composed the famous and celebrated hymn Bridget, A Woman Ever Good, which is referenced in the story and then not quoted because obviously we all know that hymn. But in any case."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":4764.09,"end":4764.65,"speaker":"Jonathan Pageau","text":"I was going."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":4764.65,"end":4916.44,"speaker":"Richard Rohlin","text":"To say, like, yeah, yeah, yeah, me neither. I wish I did, though. I wish we could find it, because that would be pretty great. So Bridget comes to her and then he says, tells her about the story of the conversation between the two monsters that he heard. Or Brendan comes to her, tells about the story of the conversation between the monsters, and then asks her, he says, what good said he do, dust, thou do for God more than I. When the monsters entreat thee, even though absent and me though present, they leave uninvoked. And Bridget says to Brendan, make thy confession. And so they basically make a confession to each other. And what Brendan says is that I have never crossed seven furrows. Like, think about like a plowed field, right, with furrows in it. And how long it would take you to walk across seven furrows, which is like three or four steps, without turning my mind towards God. And then Brendan says to her, make your confession. And Brigid says that since I first fixed my mind on God, I've never taken it off and never will until the day of doom. Thou, however, said she art so constantly incurring great danger by sea and by land, that thou must needs give thy attention to it. And it is not because thou forgettest God that thy mind is fixed on him only at every third furrow. So basically it's like, Brendan, you've been catch up. Yeah, yeah. It's just like, listen, I, you know, and It's. It's kind of like, you know, Brendan is this masculine saint, and he's out there, you know, traveling and running into all these dangers and obviously, like, raising the dead and casting out demons and all these other things. And then Bridget just stays in one place, but because she does that, because her mind is. Is always fixed on God, right? And. Yeah, so we get another poem here, and Brendan goes back home. It moves between Britain and Ireland. The rest of the story is kind of focused on the different monasteries that Brendan establishes and the monastic rules that he puts in place. And when we come to the story of Brendan's repose, there's a story in here, by the way, about the rescue of a monk named Coleman after his death, like, from hell through the. Through St. Brendan's prayers. And this whole section is basically about whether or not the prayer of Christians is, like, if it's effective for the dead. Right, Basically. Why you should pray for the dead, Brendan."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":4916.44,"end":4917.36,"speaker":"Jonathan Pageau","text":"Get someone out of hell?"}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":4917.84,"end":4922.24,"speaker":"Richard Rohlin","text":"Yeah, well, yeah, I mean, yeah, you know, just that."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":4922.24,"end":4923.04,"speaker":"Jonathan Pageau","text":"Not a big deal."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":4923.12,"end":4945.66,"speaker":"Richard Rohlin","text":"Like you do. Like you do. He actually doesn't just do that. He puts together a prayer rule. And this seems to be the origin story for the Irish Office of the Dead. Like, this is what you pray for souls who have recently reposed. There is no mention at this particular juncture of purgatory, but the idea is that the monk is kind of the worst monk, but through Brendan's prayers, he's delivered anyway from the fires of hell."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":4945.74,"end":4946.14,"speaker":"Jonathan Pageau","text":"So."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":4947.98,"end":5033.71,"speaker":"Richard Rohlin","text":"Finally we get to the story of Brendan's repose, which is where the story ends. Again, skipping a lot of details here, but Brendan is away from Clonfair, which is the monastery that he's found. And he said, this is where my resurrection is going to be. He's away from there when he's dying, and he knows he's about to die. And so he says, I need my body to be taken to Clonfert. That's where there will be an attendance of angels over it. And that's where my resurrection will take place. And so he leaves instructions, and the instructions are very particular. He says, first of all, just make a little wagon and put my body in the wagon. Because if there's a large wagon, if there's a big attendance, everybody in Ireland's going to realize that's my body, and they're going to want to, like, they're going to fight over my body, you know, like. And, like, you have to imagine the sort of. The recently Christianized Irish tribes would definitely Fight over. And in fact did fight over the relics of saints. Like it's something, you know, a different state of affairs, one might say. Although it's not too difficult, actually, I think, to imagine the world, in the world that we live in, that if you really believe the, like, the relics of the saints are like holy things that would bring protection to your community and, you know, like healing sickness and all these other things, like, maybe you would fight to have that for your community. Not saying that's what we should do, but, you know, I don't think it's too hard to imagine."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":5034.39,"end":5039.91,"speaker":"Jonathan Pageau","text":"Anyway, people pay a lot for more like huge amounts for very ridiculous participation things."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":5040.15,"end":5187.22,"speaker":"Richard Rohlin","text":"Exactly, exactly, exactly. So he gives these instructions and he says, when you're moving my body, a young man is going to show up with. And he's only got one eye, the left eye in particular, to speak precisely who will meet the bearer of my body? And this guy is basically like a prince from one of the local tribes. And he will say to the brother who has the corpse, is that the body of the saint that thou hast? And he will say in a gruff voice among us, shall his resurrection be. Give up the body. So he's saying, people are going to come from my body and there's going to be this thing that they have to offer. So first of all, you're going to offer him gold and he's going to refuse that. Then you have to offer them the kingship and say Brendan said you could have the kingship if you sort of leave his body alone. And he's going to refuse that. And then you say, I'm going to offer you heaven and earth. That is salvation. And then for those three things, for the gold, the kingship, and heaven and earth, he'll release it. And that's basically. That's how the story. That's how the story goes. And so Brendan's body is taken to Clonfert. And in the year 581, according to the story, in the year 581 from the birth of the son of Mary, we're assured to the extinction of Brendan's life was a year and a glorious 80 in addition to 500 complete. He dies. And the last thing that we're told about him is that the body of Brennan was then brought to Clonfert and buried there with great honor and reverence, with psalms and hymns and spiritual songs in honor of the Father and of the Son and of the Holy Spirit. And that's how Brendan dies. And Brendan is one of the twelve apostles of Ireland. He's one of the people who really establishes the Irish church. His story is. His life is full of these strange, bizarre, amazing, wonderful stories that seem to be about these things, which Celtic Christianity and really all Christianity. I mean, that's the thing that I want to secretly do, is help people understand that we. When we're talking about the ancient church, there are these different flavors, but it's all part of a single cohesive whole. I mean, you could imagine the stories that I've told today and in the previous video being the sort of stories that would show up in Ethiopian folklore and Christianity and hagiography. Right. But also really, really anywhere kind of out on the edge."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":5187.54,"end":5188.1,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":5188.66,"end":5264.48,"speaker":"Richard Rohlin","text":"And that these. These stories are really. They're part of our common inheritance, that and that they. By moving through kind of extremes like this, they show us the way that the saints establish the world, the way that they mediate between heaven and earth. And also, you know, kind of the wonderful variety that is between them, which is the wonderful thing. There's, you know, the opening line of War, not War and Peace, of the other Tolstoy novel, Anna Karenina, says something like, you know, good people are all the same, but bad people are all different. Something. I'm butchering the opening line. But in any case. But it's exactly the other way around. Like evil things, and this is what you see in the life of St. Brennan, that all the evil things that you come across are very mundane, and they're very much. You know, they're very banal. They're very much the same. But in the saints, you know, between somebody like Brendan and somebody like St Brigid, who has her own hagiography, which is full of strange and wonderful, wondrous happenings as well, but there's a very different character between them. You know, they're two very different people and two different witnesses to what it looks like to live this life that is transparent to Jesus Christ in a place that could not be more different, but also couldn't be more similar to the world that we live in."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":5264.72,"end":5272.53,"speaker":"Jonathan Pageau","text":"So awesome. That's a great place to finish. Do we have. Are there relics? Do they have Brendan's Relics?"}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":5273.24,"end":5376.52,"speaker":"Richard Rohlin","text":"Relics of St. Brenda? I don't know the answer to that question. I know there are relics of Saint Brigid, but there's a lot that was lost during the Reformation, so I'm not sure about that. I thought I would end this, if it's okay, by reading a poem. So the poem is by J.R.R. tolkien, and there's a Couple of versions of it. The early version is called Imram, and then he later updated it and renamed it to the death of St. Brendan. And it is about sort of Brendan's last moments. And I want to mention the story because we. We have this course that we're about to launch. It's coming later this month. It's going to be the first time that I've taught a course solo for Symbolic World, actually. But I'm really looking forward to it. And the story, the course is called Tolkien and Universal History. The Symbolic World Goes to Middle Earth. We'll have a link down to it here in the Doobly Doo. But in that. In the Doobly Doo, yeah. In that course, one of the things that I want to do is show people the kind of. The sort of the secret ways that Tolkien. Tolkien's Legendarium is actually a work or it's an attempt at a work of universal history. And as part of that, it shows the way that Tolkien tries to take the story of the English people and the sort of the mythical ancestors of the English people and somehow make it fit into the ancient Christian identity of the British Isles. Right. And that to be British and to be English are not actually the same thing, but Tolkien tried to sort of make them fit together in ways that people have not noticed or have not really paid attention to. And so this is one example of that. This is the death of St. Brendan."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":5377.16,"end":5377.88,"speaker":"Jonathan Pageau","text":"And last."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":5378.53,"end":5780.35,"speaker":"Richard Rohlin","text":"Out of the deep seas he passed and mist rolled on the shore under clouded moon the waves were loud as the laden ship him bore To Ireland, back to wood and mire, to the tower tall and gray, where the knell of Llewenferta's bell tolled in the green Galway where Shannon down to Lucht Derg ran Under a rain clad sky St Brendan came to his journey's end to await his hour to die. O tell me, father, for I loved you well, if still you have words for me of things strange in the remembering in the long and lonely sea of islands by deep spells beguiled where dwell the elven kind in seven long years the road to heaven or the living land did you find the things I have seen? The many things have long now faded far Only three come clear now back to me. A cloud, a tree, a star we sailed for a year and a day and hailed no field or coast of mean, Nor boat, nor bird saw we ever afloat. For 40 days and 10 we saw no sun at set or dawn, But a dun cloud lay ahead and a drumming there was like a thunder Coming and a gleam of fiery red from the sea to cloud, Then sheer a shoreless mountain stood, Its sides were black from the sullen tide to the red lining of its hood. No cloak of cloud nor lowering smoke, no looming storm of thunder in the world of men saw I ever unfurled like the pall that we passed under we turned away and we left astern the rumbling and the gloom. Then the smoking cloud asunder broke and we saw the tower of doom. In its ashen head was a crown of red where the fishes flamed and fell as tall as a column in high heaven's hall. Its feet were deep as hell, Grounded in chasms, the water drowned and buried long ago. It stands, I ween, in forgotten land, Lands where the kings of kings lie low. By the way, it's amazing that, you know, the, the, the, the episodes that, that Tolkien is describing here in his poem are ones that we read, but Tolkien is like, very consciously interpreting them like, as having to do with, you know, the fall of Numenor, which is also like the flood and the, the, the fall of the kings and all these things. We sailed then on till the wind had failed, and we toiled then with the oar and hunger and thirst a sorely rung, and we sang our psalms no more. A land at last with a silver strand at the end of strength we found the waves were singing in pillared caves and pearls lay on the ground, and steep the shores went upward, leaping to slopes of green and gold and a stream out of rich and teeming through a combination of shadow rolled through gates of stone. We rode in haste and passed and left the sea and silence like dew fell in that isle, and holy it seemed to be as a green cup deep in a brim of green, that with wine the white sun fills was the land we found. And we saw there stand on a lawn between the hills A tree more fair than ever I deemed might climb in paradise. Its foot was like a great tower's root, Its height beyond men's eyes so wide its branches the least could hold in shade an acre long, and they rose as steep as mountain snows, those boughs so broad and strong for white as winter. To my sight the leaves of that tree were they grew more close than swan wing plumes, all long and soft and fair we deemed then, maybe as in a dream, that time had passed away and our journey ended for no return we hoped but there to stay in the silence of that hollow aisle, in the stillness. Then we sang softly as seemed, but the sound aloft Like a peeling organ rang, Then trembled the tree from crown to stem, from the limbs that leaves in air the lim, the leaves in air as white birds fled in wheeling flight and left the branches bare. Now, this part of the story comes from a different version of the the story of St. Brennan and the one that I've read to you. From the sky came dropping down on high a music not of a bird, not voice of man, nor angel's voice. But maybe there is a third fair kindred in the world yet lingers beyond the foundered land, yet steep are the seas and the waters deep beyond the white Sea strand. Oh, stay now, Father, there's more to say, but two things you have told. The tree, the cloud. But you spoke of a third, the star in mind you hold the star. Yes, I saw it. High and far at the parting of the ways, A light on the edge of the outer night, like silver set ablaze where the round world plunges steeply down. But on the old road goes as an unseen bridge, that on the arches runs to coasts that no man knows but men say, Father, that ere the end you went where none have been, I would hear you. Tell me, Father dear, of the last land that you have seen in my mind the star I can still find, and the parting of the seas, and the breath as sweet and keen as death that was borne upon the breeze. But where they bloom, those flowers fair, in what air or land they grow, what words beyond the world I heard, if you would seek to know In a boat, then, brother, far afloat, you must labour on the sea and find for yourself things out of mind. You will learn no more of me. In Ireland, over wood and mire, in the tower tall and gray, the knell of Clwanferta's bell was tolling in green Galway. St Brendan had come to his life's end under a rain clad sky and journeyed whence no ship returns but his bones in Ireland lie. Anyway, it's a lovely poem. I mean, it's. I always read it on the feast of St. Brendan every year, but we're going to get into it and look at the versions of the story of St. Brendan's life that Tolkien was reading and how he tries to connect them into, for instance, this idea of maybe there's a third fair kindred that in the world yet lingers. And. Yeah, so that's something to look forward to. I hope folks will join us for Tolkien and Universal History. And I've talked a lot, Jonathan, so this is great."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":5780.35,"end":5798.91,"speaker":"Jonathan Pageau","text":"As usual, you know, surprises all abound and and and amazing stories and so yeah, people show up. It would be be great to see Richard try to. You know, Richard has talked so much about Tolkien, but it'd be wonderful to see him really try to frame it within our our universal history arrow."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":5798.91,"end":5800.44,"speaker":"Richard Rohlin","text":"So yeah. Yeah."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":5800.76,"end":5801.64,"speaker":"Jonathan Pageau","text":"Thanks Richard."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":5802.04,"end":5804.2,"speaker":"Richard Rohlin","text":"Thanks Jonathan. Talk soon. Bye. Bye."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":5804.28,"end":5863.55,"speaker":"Laura Diaz","text":"Tucson the Weight is Over Mediweight Loss they're officially open on North Oracle Road. That's right, no more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me, this isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":5863.55,"end":5894.44,"speaker":"Richard Rohlin","text":"That's mediweightloss.com looking for your next Go to Smoke Shop. Stop scrolling. I've got you. Headshop.com is the number one online smoke shop already trusted by over 100,000 happy smokers just like you. They've got it all. Dab rigs, vaporizers, glass bongs, smoking pipes, even thca flower. All in one place. Need a new daily driver? Grab a smooth glass bong or a classic smoking pipe. More of a concentrate fan. Their dab rigs, E rigs and wax."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":5894.44,"end":5897.56,"speaker":"Jonathan Pageau","text":"Accessories are designed for smoother, harder hitting sessions."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":5897.88,"end":5918.33,"speaker":"Richard Rohlin","text":"And yes, they've even got legal THC flower. Best part. Every order ships fast and discreet, which is why thousands of smokers keep coming back. So don't waste time time hopping between shops. Shop the best in dab rigs, vaporizers, glass bongs, smoking pipes and THCA flower right now@headshop.com the number one online smoke."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":5918.33,"end":5920.85,"speaker":"Jonathan Pageau","text":"Shop, headshop.com has what you need."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":5921.09,"end":5922.05,"speaker":"Richard Rohlin","text":"Check it out today."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":5922.37,"end":5924.61,"speaker":"Jonathan Pageau","text":"Oh, and because you're listening right now."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":5924.69,"end":5926.53,"speaker":"Richard Rohlin","text":"You get 10% off your next order."}
{"episode_id":"SW - #392 - 2025-05-16 - Richard Rohlin - Universal History - Symbols From the Edge of the World","start":5926.61,"end":5932.69,"speaker":"Jonathan Pageau","text":"When you use the coupon code HSHOP at checkout. Go to headshop.com now and smoke smarter."}
