{"episode_id":"SW - #389 - 2025-04-29 - Joe Allen - Transhumanism and the War Against Humanity","start":0.16,"end":59.17,"speaker":"Laura Diaz","text":"Tucson, the weight is over Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iHeartRadio. And you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks at mediweight loss. I got the same medication, but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better, and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today."}
{"episode_id":"SW - #389 - 2025-04-29 - Joe Allen - Transhumanism and the War Against Humanity","start":59.25,"end":105.27,"speaker":"Joe Allen","text":"That's mediweightloss.com that is futile. Soon the machines will do it for you. And so you've demoralized an entire generation and told them that they can look forward to basically being pets to the machines or to billionaires with machines. Okay, if that actually comes true, Nightmare. But if it doesn't come true, then you've enfeebled this generation. They did not hit the ground running. And so that is even worse to me, right? Like you never get the godlike AI. You never get the superpower brain chip. All you get is, you know, a fluffy dream and a whole lot of atrophied human beings. That's the real nightmare. And that's what I hope can be countered. And it can be. I really do believe that."}
{"episode_id":"SW - #389 - 2025-04-29 - Joe Allen - Transhumanism and the War Against Humanity","start":116.79,"end":149.67,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. Hello, everyone. I am excited to be here with Joe Allen. Joe Allen is the author of the book Dark Eon. He's also a tech editor on Steve Bannon's War Room. And he's going to help us think through all the things tech and all the things transhuman that are transpiring around us today. So, Joe, thanks for talking to me."}
{"episode_id":"SW - #389 - 2025-04-29 - Joe Allen - Transhumanism and the War Against Humanity","start":150.23,"end":152.31,"speaker":"Joe Allen","text":"Very good to be here. Thank you. Thank you for having me."}
{"episode_id":"SW - #389 - 2025-04-29 - Joe Allen - Transhumanism and the War Against Humanity","start":152.63,"end":180.13,"speaker":"Jonathan Pageau","text":"So, I mean, my first question is going to be a very broad one. There are so many things happening simultaneously right now. You know, with the kind of explosion of AI in the actual Models to the, you know, to Trump saying he's going to deregulate AI as much as possible, investing in the Stargate project. With Musk being in the White House, there's this crazy. It's just crazy. What is the thing that is grabbing your attention the most that you think is what we need to be paying attention to the most?"}
{"episode_id":"SW - #389 - 2025-04-29 - Joe Allen - Transhumanism and the War Against Humanity","start":181.57,"end":299.04,"speaker":"Joe Allen","text":"You know, the duality of this administration is really striking from my perspective. Many of the issues that I was, that I voted for Trump on the basis of, you know, he seems to be coming through for us on the border, slashing a lot of the wasteful government spending, a fraction of it anyway. And, you know, of course, doing away with dei, affirmative action, these sorts of things. To me, these are all positives. But, you know, I covered this for the majority of 2024. This, this influence by tech accelerationists. You know, Peter Thiel's been with him from the beginning, since back in 2015. 16. But then you have Musk coming on board, you have Marc Andreessen coming on, coming on board. There's always been that element and I've always tried to beat it into the heads of my listeners and readers that transhumanism isn't some globalist thing. It's not some left wing thing. It's always had a kind of right wing flavor from even the Nietzschean origins. But also you've got Nick Land, people like this that are not liberal. So it's not like this comes as a surprise, you know, to the chagrin of the war room audience. I was banging on this drum that Trump is going to be a mixed bag. And you know, on one half of that bag is the all the things that we want to see happen in America, the possibility of preserving the Republic. And on the other hand, you have red, white and blue demons clawing their way into the earth to get rare earth minerals and, you know, develop massive artificial intelligence infrastructure that will watch your every move and become a godlike entity for machine worshipers. So, you know, it's a little half and half."}
{"episode_id":"SW - #389 - 2025-04-29 - Joe Allen - Transhumanism and the War Against Humanity","start":299.45,"end":356.91,"speaker":"Jonathan Pageau","text":"Yeah, I mean, I think that's something that we can dive into and it would be interesting to think about it because, you know, there is of course, the left wing aspect of transhumanism, which has to do with this vision of progress, this vision that there's a relationship between scientific and science and technical progress and moral progress and the idea of, of making it possible to be more and more idiosyncratic and less and less, you know, it's a less and less connected to the traditional hierarchies and be able to do whatever you want. And so you can see these aspects of transhumanism in. In kind of the biological modifications of the bodies with. With obviously transgender stuff, but then also body modification in terms of the more aesthetic aspect. All of these things definitely do connect with AI and also the idea of kind of being whatever you want online in the metaverse, you know, of the avatar. But what would you see? What is the connection to the more kind of right wing or more conservative aspect that leads into transhumanism?"}
{"episode_id":"SW - #389 - 2025-04-29 - Joe Allen - Transhumanism and the War Against Humanity","start":358.11,"end":614.13,"speaker":"Joe Allen","text":"Well, you know, just to address that really quickly, the notion of progress, both technical and moral progress moving forward, so to speak, in tandem. It's more capitalist progress than Marxist or communist progress. Not to say that there aren't communists who I would classify as transhumanists, but it is definitely techno capital driving it so that even someone that like Martin Rothblatt is probably the most outspoken on the connection between transgenderism and transhumanism. But Rothblatt is close to a billionaire, if not a billionaire. You know, Ross Black came from the tech world, developed Sirius xm, all these sorts of things. So, you know, I think that it is progressive, right? It sees history, especially the singularitarians, see history as this exponential increase in sophisticated technology, so on and so forth. But it is by and large a capitalist vision of that. So that is, to the extent left and right. You talked about this at length. Left and right are very slippery terms and very fuzzy conceptually. They don't make sense in the same ways that they did, you know, during the French Revolution, Right? So. But to the extent that you would say that right wing is more free market, that right wing is more nationalist, or that right wing is in some sense traditionalist in regard to, say, gender, a good example of the latter of gender norms, gender normativity and transhumanism would be the enhanced Olympics that Peter Thiel is funding and many others. This is, especially from a masculine point of view, very gender normative, in which, you know, the traits, the masculine traits are being emphasized by way of technology, whether it's, you know, you're juicing steroids or any other sort of like body modification augmentation. Another example would be the sort of quasi porn starlet of Fox News, right? Like these women, you know, some of them are naturally beautiful, but, you know, by and large, the culture coming out of Hollywood of augmentation creating an aesthetic, a feminine aesthetic in and of itself. You might not call that transhuman, I would. But it is on that spectrum of, like, normativity now, real quick, you know, with nationalism, Peter Thiel, very much an American nationalist. Marc Andreessen, I think at least, you know, more recently an American nationalist and certainly anti communist, certainly anti China. And Elon Musk as much of he. He is really a trickster figure, a kind of Luciferian, you know, tongue in cheek Luciferian sort of figure. But I don't think that he is 100% disingenuous when he says that he wants to see America become great. Right. I don't know about great. Again, he seems to be much more forward thinking. But I do think that by throwing in his chips, a quarter billion of them with Trump, that it does signal a legitimate dedication to America. So this sort of nationalism. So yeah, I mean, transhumanism, you know, this desire to use science and technology to go beyond the human is trans political. It's transnational. There are, you know, people like to wag an accusing finger at the World Economic Forum and Klash Schwab and Yuval Harari, but these are mouthpieces. These are people doing pr. The real transhumanists are something else. You know, both the philosophical transhumanists and the ones in, in Silicon Valley, at Google, at Meta, in these massive companies that are making it possible to if not go beyond the human, at least hold that myth out that we can go beyond the human and give us some reasonable facsimile of the cyborg."}
{"episode_id":"SW - #389 - 2025-04-29 - Joe Allen - Transhumanism and the War Against Humanity","start":614.93,"end":649.3,"speaker":"Jonathan Pageau","text":"So let me play devil's advocate for a little while. People who watch me know what I probably think. But, you know, why is that a problem? Let's play it out like, why is it a problem? Why is transhumanism a threat to us? Why wouldn't we want to be more than human? Like, why? You know, what is it about us? The more kind of traditional thinkers who see that as an issue and related to a kind of idolatry. But like, what would be the argument for it? Like, you know, why is it bad? I'm not sure, Like I'm trying to. I'd like to hear your thoughts on that."}
{"episode_id":"SW - #389 - 2025-04-29 - Joe Allen - Transhumanism and the War Against Humanity","start":650.19,"end":660.27,"speaker":"Joe Allen","text":"Well, you know, if you're making billions of dollars or if you want to become a slave to the machine, it's a great thing. But I think the number one, work that out."}
{"episode_id":"SW - #389 - 2025-04-29 - Joe Allen - Transhumanism and the War Against Humanity","start":660.27,"end":671.95,"speaker":"Jonathan Pageau","text":"Like what you're saying is that what transhumanism will do will be create a more an elite that will be more than any of many more of an elite than anything we've seen until now."}
{"episode_id":"SW - #389 - 2025-04-29 - Joe Allen - Transhumanism and the War Against Humanity","start":672.75,"end":1039.52,"speaker":"Joe Allen","text":"Yeah, they say rising tides lift all boats. But something tells me that we're going to Be in the little puttering motorboats while they're in the yachts. Yeah. Excuse me. I think that the number one issue I have with the concept of transhumanism isn't that it's not that people want to do this. People have all sorts of desires. I'm not trying to stand in the way of them. To the extent they affect me or my family or my community or my country, then it becomes my problem too, right? And so one of the central features of the kind of current wave of AI hype is the concept of human replacement, the greater replacement. It's very similar, I think, to the issue of mass immigration. You have this alien swarm coming in to both displace the workers of a nation, to subvert their political power by watering it down, diluting it by a group that is easily manipulated. And in the case of public discourse, the same artificial intelligence fits that and the aversion to artificial intelligence, these alien minds, and the aversion to especially humanoid robots. That weird creepy feeling you get is very similar to racism. And you hear these arguments from pro transhumanists. They say speciesism is racism towards technology. And in a way they're correct. But I am an unapologetic human racist or speciesist. And even if I don't want to see all the robots rounded up and sent away to, you know, space, not that I would argue with it, but I think that there needs to be that suspicion because the people pushing this, it's the most bizarre sales pitch one could imagine. We are going to solve physics, the theory of everything, we are going to advance human technology, we are going to become godlike, going to cure cancer, become quasi immortals, and also we're going to replace every human role in society and possibly kill everyone. It's a very strange sales pitch, but that's what they're going with. From Elon Musk to Google to anthropic even more conservative people like Yann Lecun, the chief AI scientist at Meta, they all talk in terms of creating this artificial general intelligence that will be smarter than any human being on Earth, may be smarter than the collective of all human beings on Earth, and that the creation of this will not only demote humans on the great chain of being to being either pets or biofuel or whatever we end up being to this being and that, you know, descending from the creation of this technology, then you already see indications of it with just the regular old artificial narrow intelligence we have now. Descending from that, you get the capacity to read the human brain, to manipulate the human brain to create sophisticated brain implants that would or even non invasive brain interfaces that would allow us to communicate directly with these alien minds infused with them like symbiotes. You have the capacity, like all these humanoid robots you're seeing everywhere. The reason that speed is so fierce is because artificial intelligence allows for a kind of flexible computing that accelerates the development of it. And so the assumption is that post AGI, the world is flooded with these, these robots, whether they're humanoid or any other shape. And then of course the physical manipulation of the body is also accelerated. You see that with AlphaFold and other computers, kind of similar AIs that accelerate the process of sequencing the genome, predicting what any kind of mutation in that genome will do to the proteins downstream and then the body downstream. So all of it comes down, right, like it's massive transformation. Number one problem, the greater replacement to me, number two is this. You know, just coming from the background I do. You can't escape the sense that as many of them say, they are bringing to life the myths of the ancients. You think Icarus or Talos, you think the Golem and you think of any of the science fiction that emerged from, you know, a century plus ago, especially St. Rossum's universal robots, where the word even comes from in all of those that, you know, some instinct in the human mind or you know, some, some direct insight into the nature of humanity in the future, whatever the cause, there is this darkness embedded in those myths, an anti human darkness. And I think that to deny that and accept any kind of utopian point of view would be beyond naive. I don't think these people who are creating these systems have our best interests in mind ultimately. And so whenever they start talking about we, as in we humanity are creating this and this is what it's going to do for us humanity. I don't hear that. I hear us as in this small group of people who are either ideologically invested or financially invested or both in creating artificial intelligence and transforming the civilization, civilizations of the world, there may not be any stopping that. But the more we can carve out space to preserve what we do hold sacred, the better off we are."}
{"episode_id":"SW - #389 - 2025-04-29 - Joe Allen - Transhumanism and the War Against Humanity","start":1040.72,"end":1313.86,"speaker":"Jonathan Pageau","text":"This is it, folks. This might just be the culmination of my life's work. Join me for the Symbolism master class this April 2025. During this course, I'll take you by the hand and into the essentials and depths of symbolic thinking. Over six weeks and over 18 hours of lectures and Q&As in a concise and comprehensive way I'll teach you everything about how I think so that by the end, you might see the world anew. This class will not only be an introduction, but also a deep dive into a way of seeing that cuts right through our secular dead end. It reconnects the ancient religious ideas with some of the most cutting edge notions of complexity developed today. As the world is shaking and changing at an increasingly rapid pace, being able to read the patterns of reality will give you an anchor and a solid sense of what is up and what is down. In this class we will talk about so many things. About heaven and earth, the sacred and the secular, the Bible, dragons, demons, fairies. We'll explore the surprising value of conspiracy theories, how symbolic patterns are found in movies, in science, philosophy, art. We'll look at the relationship of symbolism to natural selection. We'll look at the basic patterns of the world of sacrifice, of the center, the margin, the masculine, the feminine, the mountain, time and space, left and right. It will be a synthesis of everything I've covered in the 500 YouTube videos that put out over the years, and much more as well now, all in a structure that has one purpose, which is to make you a master of symbolic thinking. This is your opportunity to get to the core of what symbolism is, to ask questions, to test out your ideas, and to make sure you have a strong foundation of the fundamentals. Plus, getting some hidden gems that I've never shared before. So don't miss out on the live experience and register today, of course, as usual, patrons at the involved level or plus get 10% off indefinitely. But also if you sign up before April 6th, you can get 15% off with the code MASTERCLASS1. And so I will see all of you in class. Tell me what you think about this. Is that what I see? Because it is in some ways such a weird contradiction to realize that the AI is promised to us as being the thing that will solve all our problems while simultaneously being the thing that will overrun us. And it's interesting because it is, in some ways it's like an image of sin or an image of the passions themselves, because we deal with that little on a smaller level all the time, right? It's like the person that reach out, reaches out for the bottle, or every time you lie, you have that, that, that double thing playing in your mind, which is, I'm going to engage in this behavior because it's going to give me more power in the moment. It's going to give me something that will increase my reach. But I also secretly know that that thing that I'm putting out in the world always has the danger of then overwhelming me, like coming back and eating me. Especially a lie is a good example. Right. It's like when you lie, you kind of secretly know that, okay, I'm putting that out there, but I've just put out something that will maybe devour me later in time. And the other thing maybe I want to put out there and hear your answer is I also seem to see it as. As a playing out the revolutionary trope in Extremists. Right. There's a sense in which, since we've embarked on this revolutionary pattern. Right, right. Since the French Revolution down stream. There's a pattern in revolution which is that if I can rise up and take the power from that which is above me and install myself in that place, there's almost like a secret thought that comes into your mind, which is that, oh, that means that that which serves me at some point has to rise up and take my place. It's almost like. It's almost like in doing that, in rising up and taking the power from those that are there, like through force, I have this sense that, well, that inevitably is going to happen to me. And that seems to be inscribed, you know, in. In Hesiod's Theogony, you know, in the midst of. Of. Of Prometheus, you know, all of these seems to be inscribed in those stories. So I don't know. What do you think about that?"}
{"episode_id":"SW - #389 - 2025-04-29 - Joe Allen - Transhumanism and the War Against Humanity","start":1314.74,"end":1607.3,"speaker":"Joe Allen","text":"I think that's beautifully put. Absolutely. I. It's. It's a very curious thing, this notion of succession, this notion that. Richard Sutton Google AI FORMER GOOGLE AI maybe one of the most articulate and morbid, I would say, about this. The idea that these beings are a new species, a new form of life, and that we have no choice to in the immediate future but to become symbiotic with it, like their mitochondria or something. But in the long view that they will inevitably become much, much smarter than us, which, you know, the sales pitch we're getting right now is by 2030, they'll outlive us and they will ultimately be kinder and less prone to sin than us, is this idea. And so what we have to do is just kind of sit back and relax and let it all happen. You know, ride the singularity. Like a roller coaster that never drops. It goes up and up and up and up and up. But we. Eventually the bars will come off and we'll just fall off and it will keep going up without us. But we have to be okay with that it's this strange mixture within the broader transhumanist and posthumanist movement of this like fierce ego. Like you talk to any transhumanist or hear them speak, they're usually like really, really egotistical people. You know, there are as many singularities or not singularities in the future as there are fevered egos predicting them, right? Like these guys. And then this notion too of becoming an immortal, of gaining these godlike powers, that's all obviously ego driven. And yet for a lot of them, not all of them, but for a lot of them there is this notion of succession that we're just in a process in which maybe we will continue on in post human forms or maybe we don't. Maybe we're doing this selflessly to create a more perfect being, recreating Eden, basically, in which lab techs and computer scientists are Yahweh and these machines are Adam and Eve, which was a motif from Rossum's Universal Robots. And I don't, I myself think that you should never ever take these people at face value, like any of their predictions, any of their promises, any of their warnings, not to say they're 100% not true. But there you look at the history of futurism, no single vision ever captured the future. Usually any science fiction writer or futurists of any sort, going back to H.G. wells and going forward, they get certain things right, but mostly as a whole they don't. Some of which the reason for that sometimes is because they created this vision and we chose not to go down that path. But so, you know, looking just to that notion of succession, I do find those who do hold to that sense. Hugo de Garis is one of my favorites on this because he is such a strange, autistic, morbid person that he doesn't hold back at all. And he talks about the development of these systems, these godlike artificial intelligence systems, or he calls them artelects. It's kind of corny, Boomer words, mush. But his, you know, for him, he's just open about it. This is a religion we are creating. What? No, all religions dreamt of gods. Well, they didn't exist. We will make them exist. And most likely it will yield gigadeath, the destruction of most or maybe even all humans. But ultimately it has to happen because the only thing worth living for is to create godlike artificial intelligence systems and terraform the entire cosmos with intelligence and computronium. And it's, you know, he is a good example of a real, just a Dogged egotist. But his vision is one of just total selflessness, total self annihilation. It's very weird, it's very off putting. And even if Mark Zuckerberg doesn't believe exactly this, or Elon Musk doesn't believe exactly this, it is, this sort of thinking is the primary foundation for the, the actions of the wealthiest men on the planet that are supported by the most powerful governments on the planet. And we, we are in many ways at the mercy of lunatics. But you know, hey, what else is new?"}
{"episode_id":"SW - #389 - 2025-04-29 - Joe Allen - Transhumanism and the War Against Humanity","start":1610.26,"end":1692.19,"speaker":"Jonathan Pageau","text":"So again, to play, to play the devil's advocate, but also to kind of, you know, bring about what I've been saying, saying is sometimes I try to explain the idea that there's a principality that is running this thing. You know, that in fact, because people are, everybody's wondering whether or not there is such a thing as artificial consciousness, you know, whether or not these, these machines are going to be conscious and whether or not they're going to have will and intent. And my take is usually to pull back one step and say we can already see will and intent. It's not in the machine itself, it's in the very arms race that is bringing it about. Because you know, it is wild to think that we're following people that are predicting our downfall and just kind of doing it as if this is a normal thing to do. But in that space, that's what I see, I see like a will that is bringing this about, that's kind of bringing this body, you know, to fruition. But there is, in that strain there is also the reality which is that it doesn't depend on any of those people. And so, and there is that reality which is, can be a cynical take but is nonetheless true, that if we don't do it, someone else will. Like if, if, if we don't do this, then China will. And which one would you rather have? Would you rather have the American AI or the Chinese AI? And so how do you see all of that?"}
{"episode_id":"SW - #389 - 2025-04-29 - Joe Allen - Transhumanism and the War Against Humanity","start":1693.55,"end":2104.93,"speaker":"Joe Allen","text":"The hardest question is the question of competition, international competition or even within our own country, right? If, if Harris and Walls had won, aside from having transgender children everywhere and stoked, stoking racial animosity and empowering it, you would have had the OpenAI's, Microsoft's, Google's, they would have had the favor of the administration. It would have been a kind of rainbow colored singularity, so to speak. And instead we get the rate, the red, white and blue singularity. Now I should be clear too, by the way, I'm not A singularitarian. I get it, I understand it. I don't. Metaphorically. I think in a sense, we are in a vert or vingy version of it, seeing that take place. But anyway, just to say that I'm being kind of half joking when I say it, but instead we get this red, white and blue singularity, right? We get Musk at the forefront of it, or we get the same tech overlords, but they are, at least they've been brought to heel to some extent. They have to pay homage to Trump and therefore to America, who by and large, they seem to be very condescending towards. Or then outside of that, you have China, right? And China has been this perpetual specter driving American acceleration. Even a kind of liberal like Eric Schmidt is always talking about how it has. It needs to be an American AI revolution, not a Chinese one. Well, China has always been nipping at our heels, so to speak. You know, I say our. I'm not making this stuff America's heels. And China, yes, they. They have actually done some impressive things. Deepseek R1 was more efficient, but they probably lied about how much compute they used to create it. They probably lied about how much money they poured in. And all these statements that, you know, its capacities are better than OpenAI's or even, you know, Xai's products. Not really. This is leaner. But just all this is to say that China is only keeping up with us. And because of all of the technology transfer and IP theft mostly, most of what they do is derivative of us. So, like, we're creating it, they're copying it. And so this arms race is entirely centered in America, right? Like, we're just. We're at the forefront of it, and we're basically, you know, through diffusion, spreading it around the planet, with a few exceptions, with a few systems and a few techniques. So, you know, you know, you don't want Communist China to develop godlike AI and start telling us what to do. But ultimately, it is an American thing, it's an American issue. So therefore, it's an American responsibility. And I think what I would like to see, okay, maybe there is no stopping it, right? Maybe genie's out of the bottle, so to speak. You know, cows out of the barn, ship done sailed. Okay. If that's the case, at the very least, what we need is leadership that is always talking about it in terms of defending human dignity, defending human freedom, and defending humanity in general from this. And that's not what we're getting from Trump and Vance at all. They are either naive or something else. But that's not what we're getting, and that's, at the very least, what we want. Now, ultimately, I think what I'd like to see would be some sort of kind of global awakening around this. Not to lead to some Kaczynskiite violent revolution, but absolutely to. If you have most people on the planet who understand that whatever gets spit out, whatever deformed being is spit out the other end of this process, that it is not necessarily your friend, right? And to the extent it's not conscious and it's just a mechanism, it's not anybody's friend. It's this bizarre, soulless golem. And that needs to be, in my opinion, at the forefront of everyone's minds as we undergo this. Because reality is that ship has sailed and is sailing faster and faster. And stopping it is probably an unrealistic option. And so surviving it, living with it without succumbing, without losing our own souls, without losing our own dignity, has to be a top priority. And it's not going to happen if, you know, the top leadership is allowing Elon Musk to drive the kind of mythical vision of the world or of the country. And, yeah, so the competition thing is very difficult, especially in regard to warfare, because if it is true that advanced artificial intelligence will dominate the battlefields, drone swarms and AI guided missiles that spin a bazillion different directions and find their target, nuclear armaments, that both the detection systems and the retaliatory strikes are under the control of artificial intelligence, if it turns out that that's where we're heading, then, yeah, you don't want China to be at the forefront. You don't want Russia to be at the forefront. Do you want America and Israel to be at the forefront? I mean, if you're an American or an Israeli, you know, maybe. But again, who knows what the future holds? Who knows if in the future these sort of automated armies really are superior to well trained, well coordinated, technologically enhanced, but not totally robotic human beings? Who knows? We'll find out. To me, the really important thing is it's not about who's going to win, because it's very clear who's going to win. Billionaires and the machines at their behest. What needs to be done, to me is just a kind of fundamental shift in the general attitude of the populace, so that they are not looking to these people for salvation, nor are they trembling in fear at the possibility that they're going to wreak destruction on all of us. But to try your Best with a kind of dark background to your world. And as humanity has done throughout history, to try to be that brave Hebrew in the desert with Egypt at your, your heels, to be that brave Christian under Nero, you know, or you ain't going to like this one, but to be a Cathar under the Orthodox church and understand that you're not going to be in alignment with the powers and principalities, but you will be able to live out a life of dignity and your soul is going to go on anyway, but perhaps even out down here on Earth, your children or your mind children will also survive. But, you know, I've never been one for good pep talks. I'm trying."}
{"episode_id":"SW - #389 - 2025-04-29 - Joe Allen - Transhumanism and the War Against Humanity","start":2105.89,"end":2223.82,"speaker":"Jonathan Pageau","text":"It's good, it's good, it's good. So the difficulty is, I guess I'm gonna have to. I will dampen your pep talk. You know, so one of the issues, of course, with technology is that, you know, nobody ultimately will ends up owning it. That is, as soon as the power is there, then the power is available to whoever has the capacity to wield it, you know, and that's, that's one of the biggest issues with technology ever. And it's also true of AI. And so, you know, we saw already not that long ago in Covid what the fusion of tech and corporate interest and attention and, you know, power, how that comes together. And like, at least here in Canada, one of the things that we did see is that the only reason why their desire to create absolute control through digital identity and digital passports and all this stuff, the only reason why it failed is because they're the government and they suck at, at their inefficient, like, they're completely inefficient and they're corrupt. And therefore because of that reason, they were never really able to instigate the, the, the system of control that they were trying to put into place. It's funny because now, like the app that they used, you know, to kind of, kind of control everybody during the, it still exists. And when you go to the airport, like, nobody even wants to use it. Like, you can see there's like a line for people that have used the app and nobody wants to use it. But what I'm, what I'm saying is that as this technology becomes more and more, you know, maybe now with, with, with Trump in power, maybe we won't have that, but maybe not just maybe. Certainly, you know, in the next four, if not eight years, then things swing and then we get another, another, you know, way of thinking that has the same power that it has. All the efficiency that Elon Musk brought to the government, you know, now at it, like under its. In its hand."}
{"episode_id":"SW - #389 - 2025-04-29 - Joe Allen - Transhumanism and the War Against Humanity","start":2225.36,"end":2400.42,"speaker":"Joe Allen","text":"Yeah, it's, you know, that point in particular, you build a machine, it's not assured that you're going to be the one piloting it in the future. Someone else can get control of it. And that you saw that after 9, 11, you know, it could be argued that there was a kind of Uni Party, the Patriot act and mass surveillance and all that was a Uni Party effort. And that's true. But it was, you know, I'm not one to say that it's like one single cabal, you know, it's a lot of different cabals. So. And you did see that shift in power. You're now seeing it with Trump. You had. It was very strange, the whole 2020. I know this is going on YouTube, but be very careful with my words. But the so called Great Reset, right? You know, Klaus Schwab, World Economic forum chairman, described 2016, the fourth industrial revolution, which is basically like cheap corporate pamphlet version of transhumanism, right? The fusion of our physical, digital and biological identities. And, you know, so it was very strange then you had the Great Reset, basically arguing that this is a narrow window of opportunity to in essence either entice or force people to adopt all these technologies we would have never wanted to, to begin with. Digital identity, mass surveillance, contact tracing, forced medication. And it's very weird, you know, I've been joking lately, because you had all these voices rising up, not just against leftism or globalism or socialism, but the evil transhumanists. At the World Economic Forum, there was this constant, I don't know what you would call it. It was kind of a slogan of sorts, certainly a smear. And it was very weird because, you know, the difference between evil transhumanism and good American technology, so far as I can tell, is about six months, you know, all the same people who talked about it in terms of abstract either moral or pragmatic dangers of this, you know, fusion of human beings with artificial intelligence and the brain chips and the, you know, genetic engineering and the robots and all this. And like, not everybody has jumped on board, but like, without calling out all the names, a lot of people suddenly it's like, oh, no, this is Elon Musk is in control of it. Trump will make sure that nothing bad happens. Like, dude, do you not remember 2020? He's not gonna, he's not magic, you know, and if he is, it's not necessarily white magic. So you can't trust that. It's very, very strange. I feel like I've kind of riffed myself into a corner here. I'm not really sure where I was going other than to say that, you."}
{"episode_id":"SW - #389 - 2025-04-29 - Joe Allen - Transhumanism and the War Against Humanity","start":2400.42,"end":2452.74,"speaker":"Jonathan Pageau","text":"Know, no, but I think what you're trying to suggest is that there, it feels sometimes that a trick has been pulled on us, that we've, that we've had a trick, we've had this. The people that were against all of the transhuman tropes in culture have now, because their political allies seem to be embracing ultimately, exactly the same tech and exactly the same vision have now come on board in a very odd way. You know, it's, you know, that the person that complained that Covid was about, you know, digital identity and, you know, the idea of, of fusing humans, like making them kind of cyborg type creatures, are now embracing someone who wants to put chips in your brain. And, and so it is. I agree, I don't totally understand what it is that happened and how, how it's happening."}
{"episode_id":"SW - #389 - 2025-04-29 - Joe Allen - Transhumanism and the War Against Humanity","start":2452.9,"end":2616.15,"speaker":"Joe Allen","text":"And also. But just on that note, with Musk at scale, people are always like, oh, he just wants to heal people. He wants to, you know, make the lame walk and the blind see. Yeah, he does want that. But he's very open that the kind of transhumanist formula of from healing to enhancement is the goal. And in his discussion with Bibi Netanyahu the spring. Sorry, this is September of 2023. And he's repeated it elsewhere. You know, he's like, yeah, if 100 million or billions of people, if hundreds of millions or billions of people got a direct brain interface to their AI tertiary self, that would be better for the world. That's not about healing. Like, you know, this vision is abhorrent at best and stupid at worst. Like, who's to say that it'll even work? Like, if you have the popula. This is, this is one of my biggest nightmares, right? It's not that the singularity will hit and suddenly the machines will take control and we'll just be riding along. My biggest fear is that like so many other technical advancements in human history, the downsides are tremendous. And oftentimes the upsides really aren't there. And oftentimes it's just. It's stupid. It's like really, really stupid. The rollout of television, for instance. I mean, yeah, it's great. I like TV and all, but I mean, not really. But to me, it can't be denied that that ended up turning an entire generation or a huge portion of an entire generation into couch potatoes. The advent of junk food. That represented technical progress. Oxycontin, that was technical progress. But what did it do? And so in the same way, with artificial intelligence and the mythos around it, the mythos that you. Every dream you had of becoming something in society, some vocation that you are passionate about, whether it's an artist or an artisan, whether it's a machinist, whether it's a programmer, that is futile. Soon the machines will do it for you. And so you've demoralized an entire generation and told them that they can look forward to basically being pets to the machines or to billionaires with machines. Okay, if that actually comes true. Nightmare. But if it doesn't come true, then you've enfeebled this generation. They did not hit the ground running. And so that is even worse to me, right? Like you never get the godlike AI, you never get the super power brain chip. All you get is, you know, a fluffy dream and a whole lot of atrophied human beings. That's the real nightmare. And that's what I hope can be countered. And it can be. I really do believe that."}
{"episode_id":"SW - #389 - 2025-04-29 - Joe Allen - Transhumanism and the War Against Humanity","start":2616.79,"end":2642.57,"speaker":"Jonathan Pageau","text":"Hello, everyone. I am here to invite you to the Orthodox Arts Festival. Richard and I are going to come down to Dallas. It is on the first weekend of May. It is going to be an absolute blast. I will be giving a keynote. I'll be also participating in a Q and A. Richard will be speaking. I've heard that Justin Marler of Death to the World fame will be there talking about Death to the World things. And who else? Richard."}
{"episode_id":"SW - #389 - 2025-04-29 - Joe Allen - Transhumanism and the War Against Humanity","start":2643.13,"end":2645.53,"speaker":"Joe Allen","text":"He'll be talking with Bishop Gerazim."}
{"episode_id":"SW - #389 - 2025-04-29 - Joe Allen - Transhumanism and the War Against Humanity","start":2646.41,"end":2647.13,"speaker":"Jonathan Pageau","text":"That's amazing."}
{"episode_id":"SW - #389 - 2025-04-29 - Joe Allen - Transhumanism and the War Against Humanity","start":2647.62,"end":2680.4,"speaker":"Joe Allen","text":"Yeah, yeah. So that'll be super cool. Yeah, it's a festival. There's going to be a lot of. I'm going to be there speaking about writing fiction as an Orthodox Christian. We're going to have a concert from the St. Cassiani Chorale, which is sort of our local DFW area, North Texas Pan Orthodox Choir. There's going to be food, there's going to be dance. It's going to be just a really incredible three days. So it's the first weekend in May, so the second through the fourth. And you should come."}
{"episode_id":"SW - #389 - 2025-04-29 - Joe Allen - Transhumanism and the War Against Humanity","start":2680.48,"end":2681.2,"speaker":"Jonathan Pageau","text":"Where is it?"}
{"episode_id":"SW - #389 - 2025-04-29 - Joe Allen - Transhumanism and the War Against Humanity","start":2681.92,"end":2692.48,"speaker":"Joe Allen","text":"Yeah, that's a good question to ask. It's at Saints Constantine and Helen Orthodox Church, Antioch and Orthodox Church in Carrollton, Texas. So North Dallas area."}
{"episode_id":"SW - #389 - 2025-04-29 - Joe Allen - Transhumanism and the War Against Humanity","start":2693.12,"end":2722.74,"speaker":"Jonathan Pageau","text":"And so, I mean, so all the artists, if you are interested in Orthodoxy and culture, interested in either liturgical art or how Orthodox thinking, how the Orthodox symbolism can also be applied to other aspects of culture. This is the place to come. You know, we're hoping for a lot of wonderful, intelligent people to be there. So it won't just be us giving conferences, but we'll be around, we'll be involved in the conversation. You know, we'll be hanging out with everybody. And we hope that a lot of fruitful things will come out of this."}
{"episode_id":"SW - #389 - 2025-04-29 - Joe Allen - Transhumanism and the War Against Humanity","start":2722.9,"end":2736.2,"speaker":"Joe Allen","text":"And there will be also children's activities on some of the days. So you can look at the website for that. It's orthodoxartsfestivaldfw.com all right, Orthodox Arts Festival."}
{"episode_id":"SW - #389 - 2025-04-29 - Joe Allen - Transhumanism and the War Against Humanity","start":2736.2,"end":2739.64,"speaker":"Jonathan Pageau","text":"Dfw.com Everyone. We cannot wait to see you there."}
{"episode_id":"SW - #389 - 2025-04-29 - Joe Allen - Transhumanism and the War Against Humanity","start":2740.04,"end":2740.68,"speaker":"Joe Allen","text":"See you there."}
{"episode_id":"SW - #389 - 2025-04-29 - Joe Allen - Transhumanism and the War Against Humanity","start":2741.4,"end":2758.97,"speaker":"Jonathan Pageau","text":"All right, this is going to be my last question. It's going to be the wildest one and the one that I also am still kind of figuring out. You know, one of the things that hit me the most in the past few months is, you know, around the time of the inauguration when Trump stood there with Altman and Ellison and the."}
{"episode_id":"SW - #389 - 2025-04-29 - Joe Allen - Transhumanism and the War Against Humanity","start":2758.97,"end":2761.01,"speaker":"Joe Allen","text":"I forget the other one, Matsuyoshi Son."}
{"episode_id":"SW - #389 - 2025-04-29 - Joe Allen - Transhumanism and the War Against Humanity","start":2761.01,"end":2793.38,"speaker":"Jonathan Pageau","text":"Yeah. And he announced Project Stargate. And I couldn't believe that they were naming this AI infrastructure project Project Stargate. And so, I don't know, I mean, what's your insight? What the hell are they doing? Why, like there is a kind of conspiracy theory mythology about the connection, you know, between CIA's remote viewing project, the AI stuff, the UFOs, UAP stuff. All of this is there. It's kind of bubbling around in the conspiracy space. And here they are naming this, this infrastructure project Stargate."}
{"episode_id":"SW - #389 - 2025-04-29 - Joe Allen - Transhumanism and the War Against Humanity","start":2793.38,"end":2951.89,"speaker":"Joe Allen","text":"What are they doing, you know, as one of many. They're playing with fire, both temporal and eternal. So the. I met someone who. Anyway, I'm going to leave that aside. Stargate, conceptually speaking, you've got three different zones. You've got the Stargate Project, Larry Ellison of Oracle, Sam Altman of OpenAI, and Masa Yoshi San of SoftBank, all three of which say they believe that artificial general and then artificial super intelligence is just around the corner and they are going to be the ones to build it. Digital gods, right? Some of the wealthiest, most powerful men on the Earth building digital gods. And you've got Larry Ellison, who, you know, Oracle has its origins with the CIA. Many contracts with the CIA now, and Ellison openly saying in a. I think it was in an analyst or it was some sort of Oracle Financial meeting last fall and then more recently in Dubai and other venues, saying in essence that one of the good things about artificial intelligence is mass surveillance. That you would be able to rake in. You're already sucking in all this data. It would give you the capacity to make sense of it for the purpose of making people behave better. Again, the role of gods, traditionally, except for this, is much more tangible and comes with a subscription plan. And then I think probably one of the more disturbing elements, too, is the megalomania of it. Ellison recently was talking about how ideally, you would have one centralized hub for an AI or AIs, where all the data in America would be centralized so that you could, of course, cure cancer and make everything better. But also, ultimately, you're talking about building a kind of mind of God on Earth. This is classic. Like, when you think of AI agents, you should think of intelligence agents, as in spooks, as in, you know, some. It should always feel. Whenever there's a device around, it should always feel like there's some weird, pale dude sitting in the chair next to you, watching you and taking notes. You know, you hit the bathroom, you hit the bedroom. This guy's like, he's behind you every step of the way. It should always feel like that. In the back of your head. He should always be in your mind. So that's what they're talking about. What's. How does that relate to the project Stargate, right, Of the. The remote viewing program that even just."}
{"episode_id":"SW - #389 - 2025-04-29 - Joe Allen - Transhumanism and the War Against Humanity","start":2951.89,"end":2954.97,"speaker":"Jonathan Pageau","text":"The movie and the TV series, like, it's just these. All these images."}
{"episode_id":"SW - #389 - 2025-04-29 - Joe Allen - Transhumanism and the War Against Humanity","start":2956.17,"end":3089.46,"speaker":"Joe Allen","text":"How does it relate? I mean, what was the purpose of those remote viewing programs? To take human beings, you know, capitalize on or exploit their psychic powers, purported psychic powers, so they could spy at a distance on adversaries so that you would have this superhuman ability or. Or a human ability that most people don't have to see things that you're not supposed to see and invade the privacy of others that you're not necessarily supposed to, whether it's a, you know, a nuclear arsenal, the stockpile, or, you know, Vladimir Putin sitting on the toilet, whatever it is. And so, like, conceptually speaking, it's basically the same thing. You go back just real quick. I'll tie this up real quick. You know, the Stargate conspiracy and then the Stargate film. Right. I saw your talk on this, by the way, and I agree. Stargate, the film was really cheesy. Although when Ra finally does emerge, it is kind of creepy. But this notion of these portals to other worlds, alien worlds, and you are bringing aliens, who we call gods, into the earthly realm, you know, it kind of. It fits all of those, because they always talk about this in Terms of like an alien intelligence. And it is ultimately an alien intelligence. And they now you've got the Ellisons of the world and the musk of the world and so on and so forth. They're not talking about it as like an alien intelligence. You're going to, you know, jerk out of his flying saucer and turn him into a slave. I mean, some do, but more and more they're talking about like you're going to, you're going to bring that flying saucer down and you're going to beg for your life. And again, the weirdest sales pitch ever. I can't even believe this. You know, people haven't already risen up and said, no, no, enough is enough. But you know, I guess one of the great things about being in control of the technological surveillance apparatus is you always know what people are thinking, you know, at least in the aggregate. And so it's pretty easy to tailor your rhetoric and your behavior to that psychological profile. It must be really invigorating. Must be very easy to sleep at night when you think you know, what everybody's thinking."}
{"episode_id":"SW - #389 - 2025-04-29 - Joe Allen - Transhumanism and the War Against Humanity","start":3090.42,"end":3177.7,"speaker":"Jonathan Pageau","text":"Yeah, but man, I get it though. Like the, how can I say this? Like, I just, I mean, I've been trying out Grok 3, you know, for the past few days since it's been out. And my goodness, like, it's hard not to be fascinated because it is, it does feel like you're, it does feel like all of a sudden you're like, like a magician with all these powers. Like it, it, it is like giving you these things on the tips of your fingers that, you know, as a, as a, as someone, like a 19 year old person in college, like you had to work for entire weeks just to, to touch, you know, and so there is this like weird fascination that is hard to deny. Even though I obviously, obviously I agree with everything you said and you know that I agree with that. But I'm trying to, obviously always trying to kind of understand what's happening. But I, you know, I can see how it really is in some ways, you know, it is in some ways the image of sin or the image of the magician's nephew, which is, you know, it's this capacity we have to, to trade immediate power, you know, and, and discount the future and to like, and to not want to look at what it's going to do. It's like, it's like when you're, you're having that fourth drink or whatever and you're like, you're like all now and nothing tomorrow. Like, I don't want to think about. I'm going to wake up tomorrow morning. It's just, it's just like this is real, like this is happening and is giving me this power now. So, you know, so I kind of get why people are just, just moving blindly into this. Because it is doing things."}
{"episode_id":"SW - #389 - 2025-04-29 - Joe Allen - Transhumanism and the War Against Humanity","start":3178.26,"end":3426.59,"speaker":"Joe Allen","text":"You know, the greatest power that AI offers the average man is to become one dead battery away from being a moron. Just outsource that. Outsource all of it completely. Yeah. You're nothing but a host to the algorithmic parasite. It's great. It's the future, man. Yeah, I, I, I myself, look, we're, we're on the same wavelength on this, that it's really important to preserve the, the body and the mind, the brain. But what this really, what we're really seeing unfolding is, you know, the reality of divinity is the ultimate. All of this is going to fall away. This is ultimately an illusion because it's not going to last. It will be as if these bodies didn't exist. The most important is the divine and all of the powers and intelligences that descend from the divine. And this physical world is just kind of. Now, I don't want to get too far out in assuming how you think about this, but this physical world is a manifestation of far more pristine and beautiful forms, and that's why it's so beautiful. But it's physical and so it rots and it smells weird, and so it's, you know, there's a downside to it, but what we see with the creation of humanoids, of these alien intelligences, and in a more, I guess, visceral sense, like with the creation of right now, phenotypically modified humans, but maybe in the near future, actual genetically modified humans at scale, what we're seeing is kind of weird black mirror, weird reflection of those divine forms that, you know, right now it's like we look down into Grok, we look into the eyes of Grok, which is basically, you know, a soulless black mirror in our hand, and we see ourselves reflected in it, humanity as a whole, or at least big portions of it. And it has the feel of something because it is immaterial and immaterial intelligence. But what I see is just in the same way that the, you know, I don't want to. Again, I'm not, I'm not a hard Neoplatonist or anything, but I. In the same way that these forms have become instantiated in the physical, here, they're being driven ever deeper. These intelligences are basically becoming Ever more material now in data centers and in silicon and electrons flying around in them. And it is ultimately, if I can leave you with this, I think, obvious Antichrist material, right? This is, you know, if you look at the root of Antichrist, yes, against Christ, but also in place of Christ. And what this is, is a material replica of everything Christ is supposed to be. Infinite knowledge, infinite wisdom, healing, even kindness and compassion. Ultimate unity. All these sorts of things, or at least, you know, depending on your denomination. Unity of many and the burning of the rest, which is kind of what this feels like, this new Antichrist version of it. And I think that, again, like, it's. Who knows how powerful it'll get? Who knows how real these predictions will actually be in the physical world. But so long as that is the defining mythos of the developed world, that the ultimate achievement is to create digital God and to transform humanity accordingly, then it is the spirit of Antichrist made so utterly real that you shouldn't necessarily go into the woods and disappear into a bunker, because we'll miss you. But you definitely don't take the mark. Okay? Just don't do it. This is my parting recommendation to your audience. I know many were probably planning on it. Just, you know, don't do it. That's all I'm saying."}
{"episode_id":"SW - #389 - 2025-04-29 - Joe Allen - Transhumanism and the War Against Humanity","start":3427.15,"end":3452.22,"speaker":"Jonathan Pageau","text":"All right, Joe, this was. This was a lot of fun. I really. I really appreciate it. And we'll definitely look to another time to talk about all this. As we see this is happening so fast. Everything's happening super fast, and so we need to pay attention. So everyone, you know, check out Joe's book, Dark Ion. And, you know, he's also on Bannon's War Room. And do you have a website, a place where people can get all your. All your stuff?"}
{"episode_id":"SW - #389 - 2025-04-29 - Joe Allen - Transhumanism and the War Against Humanity","start":3452.54,"end":3467.81,"speaker":"Joe Allen","text":"Yeah. JoeBot XYZ. And if anyone in the audience is interested in the book Dark Aeon or Eon or Ion. Dark A E O N xyz. Signed copies. I'll even draw a cartoon if you ask."}
{"episode_id":"SW - #389 - 2025-04-29 - Joe Allen - Transhumanism and the War Against Humanity","start":3467.89,"end":3470.13,"speaker":"Jonathan Pageau","text":"Awesome. All right, thanks, Joe. It's good to talk to you."}
{"episode_id":"SW - #389 - 2025-04-29 - Joe Allen - Transhumanism and the War Against Humanity","start":3470.37,"end":3473.57,"speaker":"Joe Allen","text":"Tremendous respect for you, Jonathan. I really, really appreciate you having me."}
{"episode_id":"SW - #389 - 2025-04-29 - Joe Allen - Transhumanism and the War Against Humanity","start":3474.29,"end":3489.38,"speaker":"Jonathan Pageau","text":"If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase, so go to the symbolicworld.com and thank you for your support."}
{"episode_id":"SW - #389 - 2025-04-29 - Joe Allen - Transhumanism and the War Against Humanity","start":3490.26,"end":3551.3,"speaker":"Laura Diaz","text":"Tucson the weight is over Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down. The days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight and serious risks. At mediweightloss, I got the same medication but with a customized plan, weekly check ins and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com."}
