{"episode_id":"SW - #015 - 2018-09-06 - On How We Dehumanize","start":0.64,"end":74.52,"speaker":"Jonathan Pageau","text":"I'd like to welcome you to episode 15 of the Symbolic World Podcast. In this episode, I'm going to play for you a video called On How We Dehumanize. It is something that I posted on my YouTube channel about a year ago. And in it, I look at how both extremes, we could call it both of the political extremes, end up using similar tactics, dehumanizing, and in a certain manner, we all tend to do that one way or another. But I tried to show how even those who accuse the others of dehumanizing end up doing it despite themselves by using similar tactics. And so I have to apologize for the audio. I promise you that the audio will get better as these podcasts move forward, as we get closer to the time where I bought a better microphone. And so. So, yeah. So enjoy. This is Jonathan Peugeot. Welcome to the Symbolic World."}
{"episode_id":"SW - #015 - 2018-09-06 - On How We Dehumanize","start":86.14,"end":1074.03,"speaker":"Jonathan Pageau","text":"With the growing chaos around us, I thought, well, wondering what I could do. And I thought maybe I could give the symbolic structure of how and why we dehumanize aspects of humanity. So my hope in showing this pattern to you is that our capacity to dehumanize, to demonize, be seen for what it is. Not a question of sides, not what our enemies do, but something which is a deep and integral part of what we could call, let's say, our fallen selves. So the key to this, like the key to so much, can be found in our stories. And when looking for a pattern, it's always best to look to Genesis first, first, and then to move from there to move towards Christ, where usually the resolution to the pattern is found. So I want to do this as another example of how this works in general, of how these patterns I keep talking about fit together, but also a way to address both sides of a growing and radicalizing conflict. So, in the Bible, there is a state of things before the world is spoken into being. This is the primordial chaos, primordial ocean, out of which everything emerges. So this primordial chaos is darkness. It's the impossibility of life. In a way, it's before the origin, before the Logos begins the ordering process. So the Word out of this original emptiness, out of this original. In the Bible, it's Tohubohu, which is this emptiness and void the Word creates and separates so that the world comes into being. So if we skip further, after Adam and Eve fall in the Garden of Eden, they're chased out of the ordered place, the garden with the tree of Life in the center and with the wall surrounding and protecting it, moving towards the Outside was a moving into death, where a progressive chaos emerged. Now, this progressive chaos can be seen as a moving forwards in time towards an end. Let's see. So the generations of Cain advanced after Adam and Eve. Those generations became more and more complex, but also more and more corrupt until we reach the story of the flood. And the flood is a return to that primordial ocean, that primordial chaos which was there before the beginning, we could say, at least before the manifestation of identity, of logos, of the Let there be such and such an identifiable thing. There is, of course, a strong relationship between logos and identity. Naming things being the most obvious and the most explicit version of this. So anyway, so this cosmic form can be seen in time. So also, not only as we move further in time, but as we move further away in space, things also start to be more and more chaotic until we reach the edge of the world. And there, you know, the traditional representation of the world, let's say, the kind of symbolic representation of the world is that the world is this, this giant island, and then on the edge of the world is this eternally flowing ocean, which is the same ocean, if you will, the same primordial ocean as what was there before the beginning of the world. And in that ocean is this unpenetrable chaos where, you know, where all the sea serpents and all the monsters are. Now, there's also an individual vision of this structure which echoes the cosmic one. So as human beings, as we move forward in time, we're also coming closer and closer to our personal death as the end of that movement. And on the edge of the human being itself, we find, you know, hair and nails and a layer of dead skin, which is the spatial equivalent, if you will, of the temporal movement towards death. Okay, so in the Bible, this, and in the Church Fathers, this is represented as what's called the garments of skin. This is a layer of death, of animal skins, which God placed around us like a kind of vaccine, a layer of death to protect us from death. So no notice how what is placed around our periphery, placed as the edge of our being, is what came before us. In the order of creation, God created all the animals and then created Adam. So in a way, it's analogical to those primordial waters which are both before the world in terms of time, but also on the edge of the world surrounding the world. Okay, okay. So now, one last analogy to cinch this for you is that in the tradition of the Church, in the Christian tradition, we also have, as individuals, we also have these desires we have this multiplicity of desire which is also, in a way, the edge of our being. These competing desires which fight for our attention, you know, fighting even amongst themselves. And these desires must be mastered or transformed so that they don't lead us away from our heart, from our own center of consciousness, and give us a way to be devoured by these animal passions, let's call them. So what I want you to mostly get from that from now is that in this pattern, death and chaos are discernible in what could be found before the origin of order, which is identity. So before my origin as a human, but also before the garden, before the city, before the country, before a civilization, okay? But at the same time, death and chaos, which is also animality, danger and wild desires, also lie at the edge. The edge and the end of the order with which I identify, okay? So in terms of the preceding chaos on a cosmic level, you know, that's why, for example, in Greek mythology, the Titans were there before the gods of Olympus. And in many cultures and in many mythological stories, there's a generation of giant monsters which exists before the arrival of the civilizing God. And a battle must be fought to establish a livable world within that chaotic world, okay? And usually that, and often that, that livable world will be made from the cutting up, literally cutting up one of these primordial, chaotic gods and using the pieces as the building blocks for the world, okay? And in some versions of these stories, the giants and monsters are then, once the world is established, are then pushed out into the margins and are seen as living on the very edges of the world. You know, like the Atlas Mountains, that acted as a barrier all the way to the ocean. In the Mediterranean world, in the Bible, we have this image of Gog and Magog, a reference to these nomadic tribes up in the north, but them also, strangely, at the same time, being like these demons. And according to legend, these tribes were blocked out of the world by Alexander the Great, sealed up north, let's say, by these Caspian gates, this image of these huge iron doors that Alexander the Great would have built to keep these hordes out of the world. And then at the end of the world, these devouring tribes would be let out and would descend upon the world to consume it. So see once again, this relationship between the edge, a door, a wall, limit, and the end, the end of the world where those limits fall apart. So you can see that as you move away from the center, let's say the center of space and the origin of an identified epoch or a humanity One moves away from order to chaos, from city or the garden, out to decomposition, fragmentation of the city, or else to wild nature, a form of wilderness, being prey to the beast of the fields, and coming finally with the limit of manifestation, which was this unending ocean. Okay, so I've talked about this and I've actually written quite a bit about this before. And so if some of you want more details on this, I'm going to link to some more talks and some articles that I gave that touch upon this structure, on this structure before. Okay? These patterns are a little bit difficult to assimilate, so I'm hoping people are starting to see what I'm talking about. So in the Bible there's this flood, the flood of Noah, at the end of the lineage of Cain, which is a return to the primordial ocean, as I've said, which was where, which was there before the world existed. But the ark, but the ark in that story is a smaller version, is a contained version of that larger event. And so the ark is a container full of animals. Okay? It's a container which is made out of that which my own garments of skin are made, an image of my limit, of my death. Right. But also the animals which precede the creation of man in the creation narrative. So you can see how there are these embedded self replicating structures within the story. Patterns within patterns within patterns. The water precedes and surrounds the world just as animality proceeds and surrounds man. Okay, so I think I repeated myself enough, so hopefully this is under sufficiently understandable. There are some subtleties in there and that I haven't mentioned and hopefully I can touch on them as I lay this out. Okay, so this structure helps us to see how in ancient societies, the men, the human were usually those who were calling themselves that, usually those who are speaking, that is we, whoever we are, are the humans. We are the men. And further and further we move away from ourselves, we come to encounter barbarians. A barbarian is someone who barks like a dog. We encounter people whose humanity I can see with more and more difficulty as I move away from myself. I mean, that's a pretty understood concept. So you can imagine the Chinese considered themselves the kingdom of the middle. And around them they put up walls to stop the chaotic nomads from pouring in. Okay, so the Greek cities had the umbilicus mundi, they had the navel of the world, and they were surrounded by more and more foreign barbarians. Right? Mesopotamians were this balance between the two rivers, etc. Etc. So in disguise the foreigners are like Dogs, they appear as beasts and monsters, right? And we see that in the ancient description of the faraway races, a kind of breakdown of categories where the further you get away from whoever it is that's speaking, the more the races that are talked about are fantastical and impossible and a kind of chaotic manifestation, okay? So there was a kind of constant informal capacity to dehumanize those that are far away, to see them as monsters, as decadent, as animalistic. This is something which is universal. And this capacity was not just a geographical structure, but it's also a social structure. And so this capacity to dehumanize can happen on a social ladder. And the bottom of the ladder being akin to the lands far away from the center, let's say, where the lower caste, especially the slaves, are seen, are less than human. This is heightened by the fact that slaves were often taken from vanquished foes far away. Now, this capacity that we have to dehumanize is really universal. And you can see it rear its ugly head as much in Western colonialism as you can see it in how the Irish were demonized by the English, how the Jews were often demonized by Christians, but also how the Tutsis were demonized by the Hutus, or how in Central Africa, the Pygmies, for example, are often seen by the Bantu tribes that are there as being less than human. And here in North America, through the recent history of slavery, we have, of course, seen many horrifying examples of this relationship people make between Africans and apes and all these types of relating other races to animals in one way or the other. But we also have to. We have to remember, right, that this echoes in a way our own human structure with our animal aspect as a kind of periphery on our edges, representing our own passions or our own more or less repressed excesses, let's say. So it's a strange way. It's often the case that the foreigners not only were seen as less human, less intelligent, but we're also seen as a kind of mirror onto which to project our own peripheries, let's say our own dark sides. And so the foreigners are all often represented as decadent, you know, as giving in to all kinds of strange passions. They're often hyper sexualized, hungry, greedy, scheming, you know, tyrannical, cannibals, incestuous, vestral, you name it. Whatever dark tendency we can find on our edges, we're able to throw on these further and further away groups. Now, the thing about experiencing the foreign as a place where Our dark passions are projected is something which we can be disgusted by or maybe fear or despise, but it can also be something we revel in."}
{"episode_id":"SW - #015 - 2018-09-06 - On How We Dehumanize","start":1074.11,"end":1074.67,"speaker":"Jonathan Pageau","text":"Okay?"}
{"episode_id":"SW - #015 - 2018-09-06 - On How We Dehumanize","start":1074.67,"end":2411.17,"speaker":"Jonathan Pageau","text":"And the best example I like to show is how in the beginning of the 20th century, because of European colonialism, all these statues and art objects from Africa and other colonized countries started to pour into Europe. To the Europeans, these statues appeared as truly monstrous, you know, with pointed teeth and scarifications. And most people were somewhat taken aback as these statues presented traits and aesthetic categories which were so far from our visual standards that they broke our visual standards cues. Right? But others saw in these statues and art, you know, a kind of animal passion, a kind of sexual energy. And so Picasso, for example, used African masks in that way, placing them on prostitutes in his Demoiselle d'. Avignon. And the Dada artist would prance around naked to the sounds of drums, you know, whipping up a kind of frenetic sound, sexual energy, and making chaotic gibberish noises. But of course, for the African cultures themselves, these statues and masks, you know, and these forms were rather means to reinforce their own stable and very strict sexual taboos and practices, and were not in any way revolutionary in the way the Europeans used them. It was their appearance as misunderstood forms, objects adrift without meaning, that could lead Europeans to project into them whatever was lying in their own dark corners. There's also another way to dehumanize the foreigner, and that is to see them as more than human, sometimes imaged as spirits or ghosts or even as kind of metahuman exemplars, let's say. So, for example, that's how the Roman historian Tacitus played up the German people who were, for the Romans, barbarians, played them up as being superior to his own people in his famous book Germania. Or how even today people would think, you know, some people think that anything foreign, be it Buddhism or shamanism, is a kind of foil on our inadequacies, you know, having everything that we lack. I mean, it's of course, as easy for something far away and unknown to contain everything we hate and despise as it is for it to contain everything we admire and idealize or, you know, see as beyond us. I always say that. That if you want to get the extreme version of this, you just have to know. You just have to look at how people represent extraterrestrials in our culture. You know, either there are these demonic, invading, chaotic beings, or they are these hyper perfect, you know, technically accomplished kind of super beings. So those two extremes exist in Our descriptions of those things that are far away, even those that are beyond our human experience, but happen in the story realm of our existence, let's say. And so often these more than human forms, let's say, or these two high forms can appear sometimes as kind of vengeful spirits. You know, in Europe, we had the Huns and the Mongols, which were seen by Europeans as this fire, this scourge of God coming down from the north, you know, to punish us for our sins, let's say. Or basically, you know, every single novel by Stephen King, you know, where some Native American spirit comes to wreak vengeance upon our society. So although. Although this capacity to dehumanize into spirits or foils, might seem to contradict the first way to dehumanize, but these are just really two sides of the same coin. You see, in the story Genesis, there's a second part of this idea of chaotic waters, and it's called the separation of the waters. And so apart, the waters are separated to make space for the world. And then there's the waters above, and then there's the waters below. And this is, of course, one of the most misunderstood aspect of the Genesis story. But it has something to do with how chaos or change or potentiality can, like a turning wheel, give rise both to the lowest and the highest states. Right? And what is on top can flip over and find itself below. The best example, of course, being the fall of the angel, especially this. The fall of Satan himself, who was the highest angel, but then fell to the lowest state imaginable. The opposite is also true, where Christ descends into the pit, descends into death, but then ascends into heaven and sits at the right hand of the Father. Okay, but we'll see a little bit more about that later. Let's just start by saying that this tendency to dehumanize foreigners in this other sense is everywhere around us as well. You know, from Rousseau's Noble savage to the African or South American perception that Europeans were these ghosts or these spirits coming down on them. This is, of course, a kind of spatial definition of the foreigner or the stranger. But there's also a temporal version of the same structure. And this version is more difficult to understand in some ways, but I think it's primordial to understand it if we want to be able to see all sides of this question. As I said at the beginning, the chaotic waters appear as that which precedes order, precedes the manifestation of Logos. So just as the foreigners on the edge of the world are experienced as versions of Chaos. So too, the state of affairs which was there before us, however we define that, is also framed as a kind of chaos, a kind of projected space for the subhuman or the demonic. I mentioned that this could be clearly seen in the stories of generations of gods, where the first generation of gods is seen as chaotic and destructive, you know, these giants or whatever, and unto which the new order of gods imposes order, sometimes that which was there before is pushed to the edge. So the two types of demonization, let's say, echo each other. But even when the two things might inhabit the same space, the temporal relation of a founding or origin or a state, an identity, a religion, whatever, cast what was there before in the same guise as the faraway foreigner. So that was the case when, you know, the Greeks replaced the Minoan culture and kept a story of the cannibal Minotaur, how the Celts became demonized by the Anglo Saxons and were associated with dark forest spirits and whatnot. And so too the Jews often took that role for Christians. The Native American took that role for European settlers. And like I presented before, the Pygmies, who were the original peoples of sub Saharan Africa and were subjugated by the Bantu, so that they became to the Bantu a strange mix of subhuman and terrifying spiritual force, so that the Bantu both often, not always, but often look down on them, but also fear them because they have these kind of strange, chaotic spiritual powers of nature. And just as the spatial version, there are moments when what was there before you is seen not so much in lower terms, but as being higher, more lofty than what you are today. And sometimes there is even a strange revolutionary wheel, right, where someone can reach back before the origin of a people in order to replace the current order. So, for example, when the Christians replaced the pagans, they sometimes tended to demonize the ancient gods and put in them all perversion and excess. But then when the Europeans of the Renaissance and the Enlightenment wanted to topple the Christian church, they reached down, if you will, you know, reach down at what was there before Christianity and attempted to prop it up above Christianity, make paganism a new ideal upon which to strive, and then in their turn, demonize the church as backwards, superstitious, dark, and in its own way, less than human. You can see an echo here of how the modernists, like Picasso or the Dada, used foreign art as a kind of weapon to destroy the established order. So the same happened also with Egypt and, you know, all these esoteric thinkers who, by projecting their ideals into this long lost civilization that they could barely know anything about. They could lift that projection, that idealization of something before the origin. They could lift it up above Christianity and, and lord over Christian civilization in that manner. And this tendency was also there in Protestantism, who, wanting to topple Rome, reached into a mythic and little known, you know, apostolic age before the conversion of Rome. So you see so many examples, and you see so many examples of that today, whether it be, you know, messianic Christians who idealize Judaism, who, people who idealize native religions, Scandinavian gods, Druidism, I mean, you name it, Anything that is long lost can be propped up above what represents order in the here and now. And we all, we all seem to be prone to this. I mean, I am certain that a form of fascination with Eastern mystery, you know, played a part in my own conversion to Orthodoxy, and God forgive me for that if that's part of my story. I mean, it's very difficult to avoid these structures, even if we see them as a consequence of the fall, let's say, as a symptom of our broken incapacity to bring all things together in a true and forthright manner. Now, one of the occurrences of the modern age is that this process, which in a way was. Was organic and flexible. It wasn't something that was clear cut. And so maybe a foreigner wasn't a fully fixed thing. A foreigner is a category like friend. It's not an actual person. It's a category of experience. And so maybe the foreigner today could become a friend tomorrow in the same manner that which is before my origin. Although I see it as dangerous, for example, I might preserve it and protect it nonetheless. And we see how this happened with Christianity's preservation of antiquity, despite how it marginalized it and even in how Christians protected and preserved Judaism, all the while still sometimes marginalizing it and persecuting it. Okay, but in the modern age, there's a kind of systematic systematization of this process of marginalization and dehumanization. Let's say some of the things that happen in the modern age is that we merge this form of dehumanization with biology, with something that is fixed, and that's what we would call racism today. So, for example, if you were a Jew that converted to Christianity in the year 1000, that meant that you were no longer a Jew, you were a Christian. But in the year 1800, that was no longer the case. Your identity became biology and unchangeable. Right? And at the same time, the rather fluid relations between people that existed in empires were now set in stone with the creation of clear borders and ethnonation states. And we know what this led to. So sadly, the late Middle Ages gave rise to regional and occasional deportation of Jews, for example. The modern age has led to massive ethnic displacements, deportations of people and creations of ethnic nation states, India and Pakistan, Turkey and Greece and many more. And there arose forces that not only wanted to get rid of certain ethnic groups from their midst, but wanted to eradicate them altogether from the face of the earth. That was certainly new and a kind of totalizing version of what before was a more fluid process. And we've heard echoes of that recently, haven't we? Identity and space, blood and soil. Now there is a flip side to this, which is the systematization of the other type, the kind which is framed in time and a kind of destruction of identity and space. If in the ancient world there was a tendency to marginalize all that came before your own origin with the idea of social progress, the usual stopgap process of seeing chaos in the pre originate past became a continual process where with each incremental movement forward gave one the right, nay, the prerogative to speak of those behind you as regressive barbarians, less intelligent and doomed to the trash bin of history. And of course, we saw this, for example, in the French Revolution. Whereas the Revolution radicalized the radicals of yesterday, could be the dangerous conservatives of today, and fit only for the guillotine. And we see the same now, where if one does not agree with the latest social fad of emancipation, or one is immediately branded as a radical right, sexist, racist, transphobe, Nazi, you know, and many of the feminists, let's say the early feminists of the 60s, are now seen as part of the problem and not with the times. And to insult, to attack, to destroy those that are not with the times is not only possible, but can be seen as a duty to the future. Now I focus on the second aspect because it is far more acceptable in our society. But pay attention, because when you hear people speak of those they do not agree with as regressive as stuck in the Middle Ages, implying without saying it, that they are somehow less intelligent. We've seen a lot of this with Americans mocking and disparaging Southerners on which they were able to establish their own powerful identity, we've seen it with atheists mocking religious people. They see themselves as more forward in time and less stuck in the past. This is a form of lessening, of placing oneself above, and it is couched in Social Darwinism, just like the Nazis. But instead of racial differences, it's rather an emphasis on time, on the progressive evolution of complex organisms from simple ones. So what the so called progressive is invoking is that he, as a progressive, as the one who is on the cusp of this constant revolutionary progress, is closer to, let's say, evolved man and further from the apes. That's it. And it's the same structure as comparing other races to animals, the same structure which repeats and accelerates the structure of dehumanization I've been presenting since the beginning of this, where the chaotic waters are always that which precedes my origin. It is the same structure which justifies abortion, for example. And just because the progressive version of dehumanization has become acceptable in our culture doesn't take away that it plays out the same pattern in different guises. So the first kind of limiting a kind of identity based on center and margin can lead one to saying something like, we're going to build a wall. The other, let's say time based identity, can lead someone to saying something like, because it's 2015, and use that argument to enforce, you know, with force, whatever change that person sees as moving from towards the constant progress of the human species. Hopefully you can see that I am not justifying any of this, but rather I think it is important to perceive the scope this human tendency can have in all of us, that it is almost impossible to ignore, that if we look down upon those who demonize far away foreigners, for example, we at the same time might be the exact type of people who demonize those who are regressive, who are behind us in the times. So what is the Christian answer to this? And as I've said, Christians have not been innocent of this in any way. But what would be the truly Christian answer to this problem? Because you see, although we can see that we all engage in such thoughts, that we all catch ourselves with such thoughts and with such a tendency to put ourselves above others, there is a nagging part of us which strive for completeness, a part of us which yearns for wholeness. So in a way, I'm asking, what is the Christian answer to the Fall? What is the Christian answer to dehumanization? I think in part it is to plunge into it. First of all, we need to see that Christ himself is both the origin, the logos which structures the world and judges the world. He is the king who sits at the cosmic throne, but he is at the same time the accused criminal who died on the cross outside the city right on the hill of the skull who was abandoned by all, betrayed by all by his own people, by his friends but also by the foreigner. So Christ is both the king and the judge while at the same time being the scapegoat. So in order to reach the completeness, the totality Christ has to be both, both the inside, the standard, the rule but also drink the entire ocean of chaos take upon him the entirety of flesh and death and suffering so that he could be all in all. So too as Christians we are called to be both little Christ in the world, both shaping and forming order out of chaos, called to be lights, pillars in the world preserving the integrity of the world. But we are at the same time called to embrace suffering, embrace death, to take on to see ourselves as being the stranger, the foreigner in a foreign land. Those two things at the same time. No one said it was going to be easy."}
