{"episode_id":"SW - #096 - 2020-04-04 - The Symbolism of Epidemics","start":0.72,"end":1790.19,"speaker":"Jonathan Pageau","text":"In the past few weeks, we've seen major disruption in our lives. Everything is cancelled, everyone is bunkering down due to the coronavirus outbreak. Because part of the pattern of disease, especially infectious disease, is about a breakdown of normal order. We're seeing this play out at all levels of reality, of course. It is a breakdown of the body as people get sick and some die. It is a breakdown of society as things get shut down. Schools, workplace, churches, even fragmentation and isolation is happening at all levels, from the quarantine of people to families, to the stopping of travel and the shutdown of borders. But the breakdown is also a breakdown of meaning, which appears as uncertainty, as confusion, an incapacity to know what is true and what would be panic. The measurements and predictions, the planning we usually make in our daily lives, break down as we face something unknown and unprecedented in our experience. We've seen a lot of crazy things, from the talk of bat soup to the hoarding of toilet paper, but all of it makes sense when we see this event with a basic pattern. So I want to look at the symbolism of plagues and epidemics, using our current crisis as a basis. But we'll also look at the basic structures, examine and hopefully make sense of the very strange example of epidemics in the Bible. And hopefully we can shine a bit of a light on this moment of uncertainty. And as you already seen, I have written down this talk. Usually I've been improvising, but just to make sure that I say everything I need to say and that I don't misspeak, I've decided to write this down. This is Jonathan Peugeot. Welcome to the symbolic world. Now, in order to make sense of what is happening on a social level, why people are pushing for this or that measure, emphasizing this or that phenomena, we need to understand what is at stake in terms of narrative and in terms of cultural struggle. The disease is real. Of course, we don't really know what it is. We know what it is scientifically, but we don't know what it means for us, because it's happening now. Because we don't have the hindsight or external view of what the scope of the disease is, we can't fully understand the danger and ramifications of the situation, the true danger of the disease itself versus the danger of the ramifications of overreacting to the disease, we can't seem to know which one is best. We know that an excess on both sides can cause massive damage to our fragile world. And so what we're seeing is truly an acceleration of a breakdown in meaning. And like all breakdowns of meaning, the questions which will arise will be the most basic ones. Integrity, identity, the relationship between the inside and the outside, the limits we set between the two, and the question of how solid or flexible those limits should be. You see in the most basic questions, the questions of who we are, of what we should do and how we should relate to others. Humans have two basic modes of being. There is what we could call a connected mode, which is the movement towards the outside, the adventure, the openness, the diversity, the flexibility, the love of change and of novelty, building bridges. And all the buzzwords we've been hearing from one side of the culture war. The other mode of being we could call the separation mode, a move towards the inside, a return to our roots, our identity, the celebration and participation in our unique quality. And this also involves a level of differentiation from the outside. Nation, family, religious identities, building walls, all the buzzwords we hear from the other side of the culture war. Now, what is at stake in this epidemic is not so much the disease itself, but it's mostly a fight between two modes of being. And it's very difficult to limit these modes from manifesting themselves at all levels of reality. And so as all of this progresses, we will see some very strange swings in discourse. We will see very disturbing contradictions playing out. We'll see positions flip one side to the other and then smashing against each other, and all of it increasing the confusion. And so you might have noticed the same person who just a week ago was screeching about being racist and how horrible it was to ban strangers from coming to your country and how this is unacceptable, is the same one today who is telling you that you have to isolate yourself completely socially. But the problem is that as we are engaging these modes of being, it's impossible, it's very difficult for them not to move from one level of reality to the next. And so just the other day, I watched my own prime minister, the post national infinite openness, Diversity is our strength. Justin Trudeau, I watched him close down our border. Now, the dirty little secret of an infectious disease is that it always comes from the outside. It doesn't matter at what level you see it. If you're always alone, you will not get an infectious disease. You might get some other illness, you know, but not an infectious one. You'll get that from someone else, a visitor or a stranger in a public place. And this is universally the case. And if you can imagine a normal hierarchy of a society with the source of your identity in the middle, a form of communion which binds the elements of your being, but also binds you to your family, to your people, to your nation, no matter at what level you see it. And as we move out from you, we have these different levels of not you. You have friends, acquaintances, strangers. Ultimately you have your enemies. But then you can go in further and you can identify animals on the very border of humanity, in a traditional world, on the edge of the world, you will find monsters and ultimately chaos and death. So just like on your border, you have your own animal flesh, your own body of flesh in which death will occur. And so too infectious diseases will always come from different levels of outside, you know, a visitor, a stranger, and ultimately an animal. So in the case of the coronavirus, it's not surprising, like all other plagues, that it came from somewhere else, like China, and that there it is identified as coming from animals. You see for them as well it comes from the outside. And so many infectious diseases are identified with animals or vermin, the rats and the fleas of the Black Death, the swine flu, aviary flu, etc etc and even HIV was rumored that it came about because of some intercourse with monkeys or apes. Of course people will say there is no proof, these are just stories. But that is the point. Stories help us understand what something is. They click and reveal an identity, even though we don't know even it's hard to know whether they're factual or not. If someone had said that AIDS started from someone driving their car on a Monday, it would not have. It wouldn't stick to our memory. It doesn't sound reasonable, it doesn't sound like something that can exist. And so it makes no sense in terms of narrative. And so here is where we get the story of the bat soup, right? It's not that relevant to know whether this is factually the origin or not. Maybe it is, maybe it's not, but you can't know that. And you have to trust someone who will know that, I guess. But understanding how it shows us the basic pattern, you know, and you can see how it follows the basic thing, especially a bat, because bats are some of the very few monsters left in the world. You know, most of the ancient monsters have been relegated to the imagination with the advent of modern science and let's say, the obsession with categorization. But there are still some creatures that seem to inhabit an in between space and give off what we could call a monstrous vibe. There are of course whales, there's something like the duck billed platypus. And yes, of course there are Bats that appear to us like strange curiosities that are in between or on the edge of categories. And in reaction to the axis and its values, the Western world has emphasized what we can call a connected mode of being United nations, the idea of the global village, cosmopolitan internationalism and trade and culture, multicultural states with mass migration. The story of acceptance of the other has been almost religious in its tone. And as we watch an epidemic forcing us to isolate ourselves, the pain of changing the narrative is palpable. We're watching European countries reinstate their borders. All of this is very difficult in a world that was based on openness and exchange. But the reality is that in a normal world we must always find a balance between the connected mode and the separated mode. You have to imagine it as a kind of breathing in and breathing out. You always have to do both. You have to breathe in and breathe out. You have to connect and you have to separate. We cannot live in total abandon of our identities, as this will ultimately lead to breakdown, to chaos, to conflict, and yes, it will also lead to, to disease. For example, I've often been astounded at the naivete of people who insist that xenophobia is inherently evil or who want to equate xenophobia with some kind of racism, full stop. This is a sign of blindness to patterns because everybody practices xenophobia. When we tell our kids to beware of that stranger with candy, when we lock the doors of our house or of our cars, when we decide not to chew that piece of gum that we find under the table. And also even just having borders or armies, for the same reason that you would not be careless when walking through a dark room. It is normal to have healthy caution towards things we don't know. The problem is rather a question of balance because you, you know, we, we don't want to completely isolate ourselves from others. This is no better because it will cause a kind of asphyxiation and a weird incestuous self reference. If you pull too hard on one side, you also risk of creating an excessive side effect. Now we see this in the case of immune systems, where if you're too cautious about foreign, foreign germs, you know, if you use all these disinfectants and you stay really, really, really clean. And if you, and if you're not in normal contact with others and with other people's germs, you will develop either develop allergies where your immune system is not used to being contact with strange things. And so you'll interpret every single foreign body as a threat, or else you will also. Or you'll develop an extreme version of the disease because you have no antibodies. You haven't developed a resistance to the effect of strange things. You might get an extreme version of. Of a disease who, for other people would not be a danger. And this is the same on a social level. You can imagine someone like a recluse who lives in a gated community. All of a sudden they will fear all strangers, and they'll tend to see them as an immediate threat to their cohesion. As we enter a different mode of being because of the disease, a mode of isolation and protection, it's almost impossible to avoid the pattern playing out at different levels of society. So as you avoid touching too many strange places, as you avoid coming close to others in public places, it would also mean that borders will close, that more encompassing levels of organization will mirror what you're called to do on a personal level. And so if only a week ago, those of us on the connected spectrum, those that were on the connected spectrum of society, were accusing the US President of being a racist for stopping flights from China. Very soon, and I guess it's already the case, such cries will stop and the protectionist separate mode will take over everyone. You see, there is an analogy between the disease itself and what it causes inside a society. Just as the infectious disease breaks down our body and its functions, just as it isolates us from others through things like quarantine, the disease does the same thing in society as a whole. So we have both a breakdown and fragmentation and a fallback on these basic identities like family or self. And as we enter this separate mode, the fragility and the downsides of the connected mode will become more and more apparent. We had created a world so far reaching, you know, so dependent on the interrelation of faraway parts on travel and on exchange. And as we have to fall back on ourselves, the entire system will appear that it might break down. The emphasis on these interrelated, you know, specialization at all levels connected by exchange and transportation, and has made the entire system extremely efficient, but also extremely fragile. If the connections break down, we will have accelerating fragmentation, a form of decomposition, just as the body's functions break down in depth. This will appear clearer and clearer as the isolation takes its toll in order to understand epidemic and infection, which we also need to understand purity. And looking at how purity works in Scripture will be a useful thing to do. The thing is that for about a century or so, maybe even more, we've seen this pernicious narrative regarding Scripture and its purity laws. People have tried to explain the purity laws in the Bible. The laws about hand washing, about not mixing different materials, mixing animals, mixing levels of reality. They explain this as some kind of primitive and clumsy hygiene. I've seen a resurgence of that quite recently. This is a complete upside down understanding of the world purity. Both its advantages and disadvantages appear at all levels of reality. If you wash your hands to get rid of what is foreign on your hands. Acts of purity also play out at a social level. Imagine, for example, that Russians would assign spies and agents to sow discord in your country, to spread rumors, or to influence your elections through this or that manipulation. If that is the case, you want to identify these foreign influences, you want to root them out, and you want to prevent them from infecting your country. And the same thing can happen at any level of reality. If you discover that a person is sick with an infectious disease, you will want to isolate yourself from them. It is not just a question of hygiene, but one of borders, or just saying goodbye to your guest at the end of the evening. Purity happens at all these levels. It even applies to the very simple act of distinguishing between any category. It is an act of purity to differentiate between a raven and a writing desk. Understanding how purity is a basic pattern of reality will help us identify when it happens. And it would also help in preventing us from letting it manifest itself in an unwieldy, unconscious manner. Such incapacity to see patterns is what brought about the maddening spectacle in the United States of that you had these same people who were screaming about Russian interference inside the US election, you know, simultaneously advocating for open borders and for non citizen vote. And because people are so unconscious, as we watch the mode of being change from this kind of connectivity to separateness, because it is inevitable that infection comes from the outside. There is a risk of great excess where there is a risk that we're going to see scapegoating and demonizing, which will bubble up in an unconscious manner. And it might happen in the very same people that were saying the opposite two weeks ago. Because as the mode of being changes, people forget what it was like to be in the mode of being before. But through all of this, there is also a danger that this state of fragmentation, that someone can use this state of fragmentation, that the breakdown of all these intermediary groups like workplaces, like community groups, like churches and businesses, all these intermediary communities, you could say, you know, could be the basis for creating even more encompassing systems of control at a higher level. So we have to be attentive to that as well. One of the most fascinating aspects of the recent virus is, of course, its name, the crown virus seems like a strange appellation. And of course, what could point to the mechanical causes of. And how, if you look at the virus, you can see these protrusions coming out and looks like an aura or a crown. But there is also an explanation which is related to meaning. I've often pointed out that there is a strange relationship between death and glory. And even the word crown has the same origin as the word horn. And that animal horns, which are these dead protrusions at the top of the head and which are also a weapon, are related to the notion of the crown. You could say one is glory, the other is death. But more profoundly, it shows us how they are linked together. If we look at the pattern of infectious disease, and we'll see a little bit about how there is this weird relationship between glory and death and how one changes into the other. We can see that in the stories that talk about infections in the Bible. For example, in the book of Samuel, the Philistines, who are this great enemy of Israel, home of the famous giant Goliath, they steal the Ark of the Covenant and they bring it into the temple of their God, Dagon. And bringing in this foreign object, bringing in something which is sacred and holy for the Israelites, appears rather as a sacrilege. When it is in the temple of their God, the ark shatters the statue of Dagon, but it also causes the God of the Israelites to plague the Philistines with an epidemic. The word used to translate this disease has different renderings. It has been called hemorrhoids or tumors in the hidden places. And anyway, so they developed these outgrowths where the sun don't shine. And at the same time, there was a plague of rats or a plague of mice. And already we can see all the elements I have discussed lining up. The disease comes from the outside, the Ark of the Covenant coming into a foreign land. This plague is also an excess of flesh and is related to animals like rats. It's not hard to see the analogy between this story and the story of the bubonic plague in the Middle Ages and in the early modern period. These plagues, these bubonic plagues also came from. From China and were caused by rats and manifested themselves through these large buboes, these large kind of protrusions that were swelling of the lymph nodes, mostly in the groin and in the armpits. And so it's not even necessary to postulate that these are the same disease. It doesn't matter. But we can notice that symbolism happens. Now, in order to get rid of the plague, the Philistines had to return the ark of the. Of the Israelites, of course, but they also had to do something else. They had to make golden versions of the hemorrhoids and of the rats, and they had to offer them up to God. And at first glance, this appears as the most insane thing in the world. One of the strangest stories, which is why nobody knows about it, because everybody, no one wants to talk about the story. But it is very important to understand it. This story is very similar as the same pattern as the story of the bronze serpent, you know, which Moses made in the desert. The glory of the ark had become death to the Philistines. And now in order to flip it back, they have to make a golden virgin of their death, of their disease. They have to make them into ornaments, something akin to a crown and something useless that is made of gold, is like an ornament. And then they have to lift up that aspect of the disease in order to heal themselves from the plague. Now, of course, in terms of pattern, anybody with a bit of attention will notice that that is still what we do today, right? That's exactly what a vaccine or an antidote is. It is an aspect of a disease which is understood and which is used meaningfully, and it's taken as a supplement. For those who've watched my other videos, I've talked about the relationship between the supplement and the ornament. And this can make you immune from that very disease. There is another plague in the Bible which can help us understand the pattern as well. King David wants to know how many warriors he can muster to attack his enemies. And so he does the census. He makes a census on the population. This is seen as a great sin in the story. So biblical scholars will argue over the technical reason why it was considered a sin. But it doesn't matter so much to us because in terms of the symbolic structure, we can see how David wanted to account for everything with the purpose of attacking his foreign enemy. This is difficult for some people to understand, but the desire to account for everything is an overreach of the system, order, trying to contain everything and, and not leaving a chaotic margin, not leaving a buffer on the edge. In the biblical law, you always have to leave a remainder for the foreigner. You see that in the law about leaving the corners of your field for the people who are marginalized and for the foreigners. And we see an example of exactly this in the New Testament in the Book of Revelations, chapter 11. During his vision, St. John receives a measuring rod from an angel. And the angel tells him to go measure the temple. But he warns him, he says, measure the sanctuary, measure the place where the people worship, but do not measure the outer court. For it has been given to the Gentiles, it has been given to the foreigner. It has to remain unaccounted for, unmeasured. You need to leave a fringe on the edge. And so David has tried to completely contain all his people in order to protect himself from the foreigner, right? So you can see it as someone who has kept his house completely clean and fully germ free for years. And the result of that, for David, is that he is given three choices of punishment by God. God says that he has to choose between three years of famine, three months of falling under the sword of his enemies, or three days of pestilence. Now, the lady who tried to prevent all contact with germs for years has made herself weaker than before, you know, and all of a sudden, because she isn't exposed to the margin, she will get a much larger version of the disease she was trying to protect herself from. So David, he chose the pestilence. But if you look at the three choices, you can see especially because they're following the rhythm of threes, each of them, and related to death are the three days of Jonah and the whale, and for Christians, ultimately, the three of Christ in the tomb. And you can see how these three punishments are analogically the same. They're related to death just at different scales, different levels of reality. And so, having said all of this, hopefully some of the stranger aspects of what is happening is now clear. So why are we hoarding toilet paper? Of course, once again, we could point to mechanical reasons. Toilet paper is bulky, so you know, when you put it in your cart, other people will notice this and then think of getting some. And as people, the stocks go down, everybody notices and starts to panic and starts to imitate everybody else and hoards it. Fine, that's fine. But there is also an explanation which is related to meaning and is completely coherent as we fall into separation mode and protection mode. Intuitively, even though there is no relationship between the virus and the bathroom in the scientific manner, intuitively we know that the bathroom is the basic place where we define what is alive, what is dead, what is us, and what is not us. It is the most basic place where one reaffirms one's identity through an act of cutting off, of elimination and of cleaning. And that is why the question of the bathroom seems to keep coming up in modern discourse. That is why, you know, it appeared in all the transgender debates, because it's about identity and about delimiting or smudging over clear categories. And understanding this symbolism can help us all, I hope, keep a clear head as people. You will watch them, you'll see them even in your own entourage will flip flop from one side to the other in their narrative. They'll go from don't be a racist to isolate yourself from everyone. We need to see clearly what is happening to prevent unnecessary panic, but also unnecessary naivete, but rather navigate a balanced perception of what is happening around us. So in the end, I wish you all a calm and productive quarantine for those who are doing that. And as we are during Lent, even though the churches have all been closed. And that's pretty crazy if you think about it. When I talk about the problem of breaking down intermediary these other communal moments, it's very fascinating. But nonetheless, this isolation be an opportunity for prayer and for fasting to avoid all the noise of the crazy world and hopefully to learn to trust God once again for what is to come, no matter what it is. So I hope this discussion on epidemics was useful. There are a lot of things I could have still talked about. I will probably make another video on the question of the golden tumors and the mice and show how it is a cosmic pattern. And I might put that out as a patron video for this month. As you can imagine, all my events for the near future have been canceled. And so I will be giving you more news on that later. Thanks to everybody for your support and stay safe. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially. Going to www.thesymbolicworld com support or else on Patreon Pageau videos as well, and on Subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
