{"episode_id":"SW - #412 - 2025-10-03 - The Age of Self-Esteem","start":0.16,"end":61.01,"speaker":"Laura Diaz","text":"Tucson, the weight is over Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight and serious risks at mediweight loss. I got the same medication but with a customized plan, weekly check ins and a licensed physician guiding me every step of the way. And the cost the same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com."}
{"episode_id":"SW - #412 - 2025-10-03 - The Age of Self-Esteem","start":72.53,"end":1683.15,"speaker":"Jonathan Pageau","text":"This is Jonathan Pedro. Welcome to the symbolic world. I recently recorded my interpretation of K Pop Demon Hunters. And watching that movie and thinking about what was going on in it and what it meant and you know, what were the strengths and the weaknesses of really made me reflect on the question of self esteem, self esteem, culture and how it, you know, the problem that it. That that are in that vision and how it is the same and how it is different from what I believe is kind of the true Christian ontology, the true Christian way of being. So I thought we could explore it for this month's Patron video. And so before we start, thank you for supporting what I'm doing. And it's really through your support that I'm able to, to be able to do this. And it's given me a lot of latitude to, to start the press, to do all the things that I'm doing. So I truly appreciate it. And so these extra videos are worth it and are fun for you. So since the 1960s, there's a really wonderful documentary called the Century of the Self. It is definitely worth looking into. And that documentary, what it does is it talks about a shift that happened in the 1960s that was started a little bit before where in some ways Freud's vision was inverted. And this idea in some ways of the repressed person, the idea because when Freud talked about repression, he Talked about all these desires that we had to. That we had. He was suggesting that we had to repress it. He could see that. That our desires were being repressed by the. By the ego, you know, and the super ego. But he. He said that this was absolutely necessary in order for society to function. What happened in the 1950s and 60s, that in some ways this vision got revers and we started to develop the idea that, you know, you should express those inner things. You should not repress your desires, you should not repress your. Your inner identities and your urges and all these things, but that you should, in fact, you know, embrace them, express them. And so it shifted. It kind of switched. It used a very similar structure as the one you could say Freud was using, but it flipped it upside down, and it turned the idea of, you could say your desires, your idiosyncrasies, your differences into something that should not be hidden, you should not be ashamed of, but rather that you should put out there and express. And this transformation is a massive transformation, and it infects Christian thinking, and it leads us to, you know, how can I say this like. It leads us into very strange directions where Christians don't realize what it is they're embracing, yet they embrace it nonetheless. Hopefully, at the end, I'll try to explain what I believe is the true Christian understanding of this. It is in some way a fusion of the two or, you know, a mix of the two. Of the two understandings. But one of the shift that happened where all of a sudden, you know, we are meant to embrace our difference. We're made to embrace our desires, we're made to embrace idiosyncrasy and not embrace it, but express it, led to all kinds of phenomena which at first might seem disconnected, but that are all kind of connected together, of course, at the outset is the spirit of rebellion, right? The. The spirit of rebellion which informs things like rock and roll, which informs the hippie culture, because you kind of understand this. This vision of rebellion as a way in which, you know, my secret desire, my. My direction, the thing that motivates me is being stifled, right, by society, is being stifled by the system, being stifled by social norms. And therefore, I have to break free. I have to free myself from that system, and I have to. To be authentic and express myself. But what we mean by authenticity and expressing ourselves, it would be different than what ancient people would have thought as authenticity. It is rather, you know, because in authenticity. Christians believe in authenticity in the sense that you have to become your true self, but your True self is not identified with your thoughts, with your desires, with your passions, with, with all of that, but is identified with Christ in you. That is your, that is your authentic self, right? It is, it is the goodness that you can move towards. That's what makes you truly yourself. But now we have this change which is really this kind of embracing of all your little quirks, your, your, your, your differences and all of that. So that, so there's that first thing, if you think about the hippie rebellion and all of that is part of it, but the other part, which looks like it's contradictory but is actually the same is mass consumer culture. So mass consumer culture is the same because mass consumer culture says your desire is you. Right? The thing that you want is what makes you, you. In the old, in the ancient times you would have thought that like your identity in the sense that your participation in society, you're a man, you're. I'm a Canadian, I'm a, you know, I'm a orthodox, I am, you know, I have these roles and those roles are the ones that would confer an identity on me. But when we move to this weird kind of self. Expressive self identification, one of the things that happens is that you have to embrace your desires. And the embracing of those desires turns into consumerism and consumerism. This idea that your desires are who you are is of course related also to, to sexual emancipation. These two things are very much in the same vision of this inversion of Freud's basic idea of repression. Because in some ways the idea, the ancient idea of sexuality is that in some ways you have to restrain your desire, you have to kind of constrain it, you have to, to bring it together and focus it so that it serves society in a marriage and having children in all of that. And that the other aspects, the other thoughts, the other desires that you might have and that we know that everybody has, you know, the desire that you could have for someone else's wife or for someone of the same sex or for whatever other weird thing that you could, you could, could have thoughts over that flighting desires could come into your mind about. Then those have to be, they have to be dealt. They cannot be, can I say this? They cannot be engaged in because they lead to dangerous things. This is, will already help you start to see the difference between the Freudian vision and the Christian vision. Because the Freudian vision is that you have to repress those. You have to basically push them out. You have to some ways almost pretend that they're not there. You know, you have to act as if they're not there and kind of put them in the, you know, push them into the unconscious or let them exist in a semi conscious realm. Whereas in the Christian vision, that's what it is. In the Christian vision, you kind of see both in the some, in some ways you have to be able to see them. You have to be able to identify these thoughts and see them coming at you. And then you have to let them go, then you have to confess them, then you have to kind of, you know, consciously move away from them. And that is very different from repression. Repression is the semi conscious behavior of like, no, not that. And then you just try to hold things away from you and pretend like that's not you and get offended and react and say, you know, and say, oh, I'm not, you know, I'm not gay, or I'm not this, or I'm not, I'm, you know, and then you, you have these thoughts that exist in the periphery that are pressing on you and you try to push them away. And you can see this if you watch American movies. They love to represent the repressed person. Especially as we began to embrace the expressing and the, and the embracing of all these desires. They love to represent a repressed person as someone who's not fully realized. And a fully realized person is someone who embraces all of that and is willing to kind of integrate it into themselves. This can be of course formulated in a Jungian sense of integrating the shadow, of course, which is also not a Christian vision of how to do this. But you can see how all of these things are kind of applying together and it leads to a social narrative, a social narrative that will, like I said, lead on the one hand to this worship of originality. You know, the, the, the worship of rebellion, this idea of the consumer, the consumer human and then also the liberated sexual person. And all of these will go in directions that sometimes looks like they're fighting with each other, but they ultimately are actually, they're actually based in the same, in the same vision. Part of that whole kind of reversal and that whole transformation is of course the idea of be yourself right, and self esteem. And you have to find your true self and you have to be able to express your authentic self. This is something that happens in all the, every single movie. And then the idea that in some ways this true self or this real self is in opposition to your family structure. Therefore, the exacerbation of teenage rebellion in society, where we think that teenage rebellion is a, is a normal thing that Happens in every. In every society, all around the world. The way it happens here. It doesn't. That is not actually true. There are tendencies, of course, in, In. In. In teenagers, which is that they, in fact do want to become something. They want to transition into a role. But in many societies, that would be managed through initiations and through incorporation into society to giving responsibility, to kind of stop it. No longer treating the child like a child, but rather start to treat them like an adult. And therefore they create that transition and then they become their authentic and resolved self. But in a world where we have this weird inversion of desire and of authenticity that leads to the pattern of teenage rebellion, which is the teenager wants to be their authentic self, but their authentic self is. Is. Is represented in people like what is it that you want and what is it that you feel? And all of these things. And of course, as a teenager, that is an absolute chaos, right? It's in a. It's in a kind of chaos. And so we represent the family, the social norms, the. The school, all of these things as trying to repress the. This authentic self, right? The greatest image of this, and it's horrible because it's a great movie, but the greatest image of this is the Breakfast Club, where you really get that idea. You kind of have these broken teenagers that are all being in weird ways, oppressed by their parents, oppressed by the school. And now they have to be willing to express and discover their true self, you know, and to be free from the constraint of society, free of the constraints of their family, you know, you can add to that, of course, free of the constraints of religion, et cetera, et cetera. Now, the thing is that human desires and human thoughts are indefinite. The things that can go through your mind and the desires that you can have, the desires that can capture you, they are in fact indefinite. And once you start to embrace the idea that all your thoughts, that all your desires, that all the things that are capturing you and going through you, that those are you and that are. They are something. There are things that are part of your authentic self. Then if you follow down that road, it leads to all kinds of insanity. It leads to all kinds of problems. It leads to addiction, Obviously, the first step, it leads to sexual degeneracy in the sense that, you know, fetishization becomes part of your vision. And the idea that you have these fetishized desires that express themselves in all kinds of weird ways, whether it's the hyper specialization of porn, whether it is, you know, kind of S and M and all of These, these, these types of, of practices that are, you know, the result of embracing more and more extreme desires for either power or being acted upon, all of these things. And you know, you can see all of the weirdness and then also the consumerism. And so obesity is downstream from the same problem, right? This idea of consuming as being real, the idea of what your desires are, that is who you are. And therefore to deny your desires and to deny yourself yourself is, is to die, right? It is in some ways to die, to deny yourself. And it's weird because those, the people, you know, it's like the, let's say the kind of really capitalistic fast food culture person is not necessarily, is maybe hated by the highly fetishized, you know, sexual deviant, but they have, they are representation of the same basic issue, which is this weird reversal that happened after World War II in the 1960s of what it is that makes you, you, you know, and what it is that makes you authentic. This of course the hardest one to talk about, but it's important that we talk about it is the mental health issue. The mental health issue is also downstream from this problem. The idea that you identify with your, let's say, mental illness, this is the extreme version of it. And so the idea that you need a diagnostic, right? And people, these young people, so many of them are like that, they're looking for a diagnostic, they want something to name their mental illness. And then our mental propensities, whether it is to be distracted, whether it is to be hyper obsessed on certain details, etc. Etc. And all these, these panoply of possible, let's say idiosyncrasies, people dive in and then identify with their diagnostic and then they, you, you hear people all the time like, I'm adhd, I am ocd, I'm autistic, you know, all of these things. Now it doesn't mean that there aren't extremes of mental practices and we all have our, our idiosyncratic mental habits. But, but the idea of all of these things now becoming your identity, what it does is it exacerbates it for sure. Just like it exacerbates sexual desire, just like it exacerbates consumerism, just like it exacerbates all these other phenomena and it leads to this weird kind of obsession people have with their bugs, with their idiosyncrasy and in some ways their desire to, you know, identify with, embrace, you know, put that forward. You know, people who, who put forward their, especially young girls, I've noticed they all are Trying to. That they put forth their diagnostic in society. And of course, the, you know, the final one is, of course, the LGBT stuff. The LGBT stuff is in some ways, because it's so symbolized, because it's the rainbow, because it. It is a kind of movement. It in some ways culmination of this entire way of thinking. The entire way of thinking that started in the 1960s culminates in Pride, right? This idea of being proud of your idiosyncrasy, of being proud of your idiosyncratic desire, of being proud of the way you're different, the way you're fluid, the way you're not fixed, the way you're free from any type of gender conformity. Free from conformity. And so the end. All of that, that kind of rock and roll punk aesthetic ultimately culminates in this. In this final vision, the solution, you could say people see the problems of some of these, right? So the. In some ways, pride is a solution to the problem. So people see the issues of, you know, identifying with your mental illness, although they do it identifying with their desires. Get trapped by your desires, get trapped by your anxieties. People identify with their anxieties and just let that, you know, let that foster and hyper focus on. On their anxieties. And that increases, of course, the anxiety when you hyper focus on it. The solution is something like the image of, you know, taking care of yourself. The image of. Of self. Self care, right? This whole obsession with self care, and then ultimately the idea of self esteem, you know, and the idea of constantly affirming others in their identity, but their identity is this, like, idiosyncratic expression. So it's like, well, have to. I will affirm you in your thing in order to help you not be swallowed by. By. By this, but not be swallowed by. The mental health cries out, will affirm you in it. But all of this is like a feedback loop. Any. It all feeds back into each other and creates, of course, the problems that we're in now. It's very difficult to break out of it because even Christians are taken up by this way of thinking. Even Christians will talk about. You see that Christians not so much talking about sin anymore, but talking about the Fall as almost like as if we're victims of the Fall, as if we are, you know, we're broken and we're all. We all have our mental health problems, and we all have our relationship problems and all of this. In some ways, we are victims and we have to free ourselves. Like Christ says, you know, the truth will set you free and therefore, you know, the coming out as becoming an almost a parody of Christian thinking. But the coming out, you know, this kind of like I'm going to express my true self, which is actually this weird thing that's different from everybody else and that I've been hiding until now, that I've been repressing. Now I'm going to express it. This has totally. That's filtered in, it has filtered into Christian culture. And even people that don't fully embrace the full pride version of it, they tend to think that way, I tend to think that way. It's like it's very difficult because this is the way, this is the world we live in. This is the world we've been raised in. You know, we want our children not to be ashamed of their idiosyncrasies. We want our children to be, be. To be. To have self confidence and to have self esteem. Right? You know, you think of that word self esteem, it's really interesting. It is really is not a Christian word. And so what is the solution? What is the Christian solution? And so the Christian solution is interesting because it's humility. And humility isn't the same as you could say anxiety and humility is also not the same as self. The kind of self deprecation that leads someone to suicide, for example. Humility is not the same. Humility can never lead you to suicide. Why is that? Because the problem with a lot of the self abasement or the, or the kind of feeling of that people have of having a bad self esteem is because they think they, they actually are great. That is they, or they think that they should be. They're disappointed in their faults. Like they're disappointed in the way that, that they're broken and, and they can't stand it. Like people can't stand to, to realize that they're not what they think they are, right? They're not the hero, they're not the super person. They're not. And therefore that leads to a disconnect between what they think they should be and what they truly are. And that is the self esteem problem, right? That is the, that is the problem that can lead someone. Not one, not the only problem. It's one of the problems that can lead someone through self deprecation to a kind of mental illness or a type of suicidality. That is very different from the type of humility that the fathers teach that Christ teaches that the Bible teaches. That type of humility is rather not owning anything. Right? You don't have self Esteem. You try to focus your attention on that which is above you. You try to focus your attention on the place from which you've received the gifts that you have and you are honoring of that right. The idea that you abase yourself and say this doesn't come from me. Whatever I have is given to me from heaven. Whatever quality I have, whatever you ability I have is given to, is given to me from heaven. And hopefully by God's grace I can submit that to a higher good. And if you take up that position, your vision of yourself and your humility will be very different from the, the kind of self hating teenager. Because this form of self hate or this form of, of not wanting to attribute, of being or not being pro my thing, it orders everything properly. And therefore you can see when you do that what qualities you have that are in service of something higher and can be in service of something higher. And you also see in that stance, you could say humble stance, what qualities or what characteristics you have which are leading you astray, which are leading you towards misery and leading others towards misery as well. And therefore humility is Christian. Humility is a right position, it's a right positioning. And you have, you actually have to stop thinking about yourself. If you really didn't care about yourself in, in the real way that that humility teaches you to do, why would you kill yourself? Because do, if you, do you care about yourself or do you not care about yourself yourself? Because if you care about yourself but you're not what you think you should be, that's when you really want to commit suicide. But if you, if you don't really care about yourself and your eyes are focused on God, then in what happens usually is that you know, you find your right place and you, you, you know, you are thankful for the opportunities you have, for the skills you have and you, you try to do the best you can with that which you have. You know, knowing that you can't do it on your own, knowing that you don't own anything, knowing that you will fail, that you will make mistakes and you don't. You're not proud of your mistakes, you're not proud of the things, of the things that you mess up, but you know it's going to happen. And every time it does, then you, you become humble again and you ask for forgiveness and you, you continue on. And that creates a completely different mindset, right? A completely different mindset from the, the self esteem mindset you could say. But it is difficult to embrace that. It's difficult to engage in that way of thinking, you know, I, I like Breakfast Club, right? I grew up on it. I, I have of course the natural tendency to do that and I have to constantly remind myself what, what is the, the true position and how our humility should be. A joyful gratitude for the gifts we have and a desire to put those in services of others and in the service of God. So hopefully this was a good exercise to help you disambiguate our world and you know, as the K pop Demon Hunters video is going to come out, you'll see I treat that and how in fact, in that video, in that movie, this is where the mistake is, right? The mistake is that they understand that these ideas of demons and possession and soul taking is related to attention. It's related to singing in the sense of pattern making and participation in, in pattern participation bodies towards. Towards, you know, towards single points that bring us together. But they reduce that to self esteem and to celebrity and to the celebrity culture. And so because of that it comes to. It comes to the door and then it doesn't. It doesn't actually deliver on what it could be. So, so thanks everybody for your attention and again thanks. Thanks for your support and I'll talk to you very soon. Bye Bye. If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase. So go to the symbolicworld.com and thank you for your support."}
{"episode_id":"SW - #412 - 2025-10-03 - The Age of Self-Esteem","start":1683.71,"end":1754.44,"speaker":"Laura Diaz","text":"Tucson the Weight is Over Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me, this is. Is it just another weight loss clinic? I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication, but with a customized plan, weekly check ins and a licensed physician guiding me every step of the way. And the cost. The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweightloss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com we're chatting with our guest, 811 megaphone man. You never stray from your mission of letting homeowners, landscapers and excavators know you."}
{"episode_id":"SW - #412 - 2025-10-03 - The Age of Self-Esteem","start":1754.44,"end":1759.75,"speaker":"Jonathan Pageau","text":"Should always call 811 before you dig. Dig. Call 81 1. Brought to you by Southwest Gas."}
