{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":0.16,"end":57.98,"speaker":"Iain McGilchrist","text":"There is an immediate reflex in many people's minds now to shut down as soon as one mentions religion. And in this country, which is a godless country compared with America and no doubt Canada, if you ask people, do they belong to a religion, about 13% of them say that they do. So 87% are not. But if you ask people, do you think there's more to this life and to this world than is accounted for in the reductionist, materialist picture, 95% of them say yes. So people are missing something extremely powerful. And what is wonderful in what you said, and I completely endorse and have written about in a number of places, is this idea of being attracted forwards to something that we wish to imitate. It's in complete contrast to the mechanistic universe in which we are the playthings of causality."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":69.56,"end":70.76,"speaker":"Jonathan Pageau","text":"This is Jonathan Pedro."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":71.24,"end":73,"speaker":"Jonathan Pageau","text":"Welcome to the symbolic world."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":83.24,"end":97.83,"speaker":"Jonathan Pageau","text":"Before we start, maybe I think that I would really like to. Most of your interviews I've seen have been very much about the brain and about the left, right hemispheres. But when I read. I haven't read your recent book. I read the Master and His Emissary."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":98.79,"end":101.83,"speaker":"Iain McGilchrist","text":"You can be forgiven for not reading the latest one. It's rather long."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":104.47,"end":140.08,"speaker":"Jonathan Pageau","text":"So a large part of the book does discuss art and art history and culture. And I think, of course, that's the aspect of your work that interests me the most. And so if you're okay, I think we will talk about. I mean, obviously we will touch on. On the brain difference, but I will focus mostly on the question of culture and the problem of something like the problem of alienation of the modern experience and how you try to trace that through history and everything. And you'll see we probably have some similarities and differences in the way we see it. And so hopefully it'll be an interesting discussion."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":140.72,"end":200.3,"speaker":"Iain McGilchrist","text":"No, that's fine. I should just mention that the new book doesn't have much in the way of cultural history in it, because I felt I'd done that one. Instead. What it is is an unpacking of the philosophical consequences of two bits of our brain, as it were, giving us a different phenomenological world to live in. And so if we're asking questions of truth, like what? You know, who are we? I start this new book with plotinus question. But we. Who are we? Because I feel we've completely lost any sense of what a human being is, what the world is like, how we relate to it. So if one's going to answer those questions, then the question of which one of the hemispheres is telling us something we can rely on better becomes important. And I just unpacked that. So a lot of things that you are very interested in, I deal with in part three of the new book. Things like consciousness, matter, values, sense of the sacred and all those things."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":200.38,"end":265.41,"speaker":"Jonathan Pageau","text":"Well, maybe we can actually start there then. Because I think one of the biggest effects that you're. Your book has had and your influence has been to reverse the reverse the hierarchy of what is primordial in terms of what it is to be human and what it is to be. To have a human experience. In some ways it kind of overturns the reductive scientific vision that we've. That we've lived with on and off, I guess, since the Enlightenment. There's a competition, it seems, between different visions. But definitely that's the one that seems to have pervaded popular culture. You know, this kind of reductive aspect idea that we're. That we are almost just machines, basically soft machines or something like that. But you really have been able to bring about the primacy of consciousness and the embedded experience as being something. You constantly emphasize the notion of context and how things, the interrelation of things. And that is how we actually experience the richest part of our experiences. In that maybe you can start a little bit with that and we can move on to the art and culture a bit afterwards."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":265.73,"end":335.99,"speaker":"Iain McGilchrist","text":"Absolutely, we can start anywhere and go anywhere that you like. I mean, of course it's very nice of you to say that I've effected some sort of a shift, but of course I'm just part of a lot of people who've got rather tired of being served up this incredibly simple minded idea, the reductionist, materialist position. And so I'm very glad to be part of a movement for something a bit more sophisticated and more likely to be true. But you touched there on the very important point of context. Because it seems to me that context is everything. It completely changes the meaning of what one's dealing with. The context of a word alone can make it mean something quite different. But all the things that are really most powerful for us, things like the sense of the divine, of nature, of love, poetry, music and the rest can't easily be just made into explicit sentences in prose. The only way we can approach them using language seems to me to be obliquely."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":336.79,"end":377.08,"speaker":"Jonathan Pageau","text":"Definitely. And the way that I like to approach it is there is a sense in which analogy is the basic mechanism by which we understand or by which we engage with the world. And so analogy has this Play between identity and difference. Like there's this constant play where you see the pattern, but you also notice the difference. Dionysus, the Areopagite really talks about analogy as he pulls it into God, into these two extremes, you know, of complete apophatic difference, but then also fullness of participation, you could say. And so you use the word metaphorical. At least in the book that I read, you tend to use the word metaphor in terms of that process."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":377.96,"end":460.99,"speaker":"Iain McGilchrist","text":"Yes, I think it's a reasonable one, because the metaphor is which one is saying something like, he is a lion. And interestingly, it depends on the fact that he's not a lion. If he was, it would be a very benign remark. But the whole point of a metaphor is that you are bringing together two things that are simultaneously true in one way and not true in another. And I would entirely agree that metaphors or models and models are just sort of more elaborated. Metaphors govern how we think about things and are behind what we mean when we say, oh, I understand that, including in science. So when people say they understand something, I think what this means is that they can approximate it in their minds to something else that they already know and think that they can believe. So it's really always an analogy, as it were. But the analogy is interesting because of the difference as well. And what I particularly am concerned about is that when one uses a model, such as a machine, to liken anything, you make it look machine like. Only the bits that correspond to a machine stand out, and all the rest retires into the sort of dark, into the penumbra. But those are the things we really need to be attending to. Otherwise, all we do see is the confirmation of our own model. Yeah."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":460.99,"end":505.9,"speaker":"Jonathan Pageau","text":"And I don't know if you thought a little bit about the obsession with artificial intelligence at this moment, and I seem to notice exactly what you're saying, is that our obsession with the technical, with computers, with artificial intelligence, is actually transforming the manner in which we see ourselves. Although we praise it as trying to notice the resemblance between artificial intelligence and human intelligence, there's a manner in which we've reduced the human being to aggregation of information. We've reduced the human being to being a kind of dictionary, and we've reduced consciousness to what it is that we can see on Google, let's say, or the manner in which we engage with our machines. I don't know if you've noticed that in terms of the shift in the way people see the human person."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":506.38,"end":537.27,"speaker":"Iain McGilchrist","text":"Oh, I have very much, yes. And I suppose 20 or 30 years ago, cognitive psychologists were consulted about ways in which one could try and make a machine smarter by making it like a person. But nowadays the emphasis is how can we make persons smarter by making them more like machines? Unfortunately, we won't make them smarter. And all around me I see the evidence of what I call artificial stupidity, which is the reduction of human intelligence."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":537.99,"end":792.41,"speaker":"Jonathan Pageau","text":"And so I want to ask you the biggest question I want to ask you. I want to get into the cultural question. And I think that, you know, when I read the Master and His Emissary, I think for me it was a very intense experience, because it was the type of intense experience that you get from coming close to someone, very, very close, but then also, also noticing things that, that, that. How can I say this? It's like I wanted to get into a fight with you reading that book, and that really happens. Like, but I wanted to get into a fight with you the way that I would fight with my spouse or with my good friend. Because, you know, it was like, he's like, ah, you know, sometimes I feel like he's coming, he's right, he's there, he's there. And then I'm like, no, no, not that, not that, not that, not that. So that's the feeling that I got. And the biggest sense that, for example, I mean, I love so much of it, but the biggest sense, the thing that I want to bring up to, you know, hoping that, you know, how much I appreciate it and loved it, was what I found to be a profound misunderstanding of the Middle Ages. Like, to me, that was a. Because if you know, my work, you know that it is steeped very much in the medieval vision. And all the time when you were talking about the Dark Ages, I thought, oh, there's something of like, I understand the kind of enlightenment line that we have this vision of what the Middle Ages brought, but I felt like there was a deep misunderstanding. And maybe, if I can phrase it, the misunderstanding, maybe you can. What I thought is a misunderstanding. Maybe you can maybe untangle it for me or help me understand. There's a sense in which you talk about this idea of context, of integrated meaning, how we gather meaning from all these related intermoving parts. And so the left brain tends to want to isolate and to focus and to name and to kind of contain. And the image you use is the representation of the face through the ages, one of the images you use. And when you come to the Middle Ages or to the. More to the end of the Roman Empire and enter the Middle Ages, you See the lack of the personal, let's say, in the face. And to me, there's something about that which I feel like actually the crystallization of expression, of human expression is very scientific. There's a very precise science to crystallizing an expression. Whereas I feel like the mimetic aspect of the face is something that we imitate through the face. That is, we imitate this emotional transformation that we feel in the other. We actually imitate it through our own faces. We don't imitate it through a pen, we imitate it this way. But when we come to imitate nature with a pen, we have to imitate nature within the space that we're imitating. The mimetic aspect of medieval art is a good example would be a medieval manuscript where you have in the center of the image, something highly focused and highly orthodox. You have an image of the Annunciation, for example. Then you will have some, let's say, flexibility in that image as well. But as you move towards the margin, then you find all the wonder and. And idiosyncrasy that would be in the margins of our perception, but would also would be just in this kind of metamorphosis that you find in Ovid and all of these types of transformational beings that you see. And so when you go into medieval manuscript, you look into the borders, you find every single possible imaginative thing you can think of, every idiosyncrasy, inversions, humor, body, humor even, you know. And so I felt like there's a sense in which, in order to truly understand medieval art, we have to understand it always contextually itself. And so a medieval sculpture doesn't exist on its own. It exists in a church. It exists with the, you know, within an architectural milieu, within the participation of a person. And so another example would be, like memento mori in the medieval mind wouldn't have been, let's say, a. A highly, you know, highly whimsical use of anamorphosis in. In. In Holbein's skull, for example, but would be the actual skull of a saint that you would kiss and that you would venerate and that you would come to."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":792.41,"end":792.85,"speaker":"Iain McGilchrist","text":"You know."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":792.85,"end":829.28,"speaker":"Jonathan Pageau","text":"And so there's a sense in which that is what I think that that's where I found it difficult in terms of the Middle Ages, which is that the. The way to understand medieval life and medieval is through the liturgy, not so much through the art, it's through the life of the people. And when. And if you look at ritual and you look at celebrations and you look at that. Then you find something which I feel was much closer to this kind of ideal world of connected participation. And anyway, so I think that was the biggest thing that I felt when I was reading your book was like, I totally agree with your conclusion, but I felt like in terms of the images you use, there were some that I disagreed with."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":829.68,"end":831.04,"speaker":"Iain McGilchrist","text":"I could feel pressure."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":831.04,"end":834.24,"speaker":"Jonathan Pageau","text":"Go ahead, go ahead and knock me down. I'm totally comfortable."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":834.24,"end":1092.87,"speaker":"Iain McGilchrist","text":"No, no, not at all. It's absolutely not, I hope, a. Of anyone knocking anybody down. And interestingly, I would not differ from. I can't think of anything you said really that I wouldn't really accept. Certainly I think the way in which we understand another person, including their face and so forth, is not by a matter of decoding signals, but by a matter of inhabiting, if you like, so that we feel our way into what it is like for this person. And so I completely agree about that. Of course, that's a timeless remark. It has nothing to do with movements in the history of ideas. It's simply how we do the business of empathizing. But what I was talking about was the different ways in which the history of ideas has taken cataclysmic turns. And I suppose I absolutely love very much that comes out of the Middle Ages. And indeed it was at my school, which was in a 14th century school with a 14th century cloister and church and so on, that I first felt in that inhabited way the reality of that medieval world and its music and its poetry and so on, which I studied. So all of that I completely accepted. But my point was not to try and survey the entirety of the history, but to look at the big crisis points. And I think that the Middle Ages, I mean, they can be seen as being very different from the foregoing centuries, but effectively after the fall of Rome and through to the early Renaissance, there was something entirely continuous going on. And it's with the Renaissance that one sees a big shift. And so I'm interested in those big shifts because I think they're associated with hemispheric shifts. But this has nothing to do with disparagement. And while I think it's true that to look for the expression of the medieval soul, one might look literature rather than in art per se, that in itself tells you something, because I wouldn't necessarily say that was true of the Renaissance. I mean, there were wonderful things to do with the liturgy going on continuously, but not in quite that way. And I love the great business of the medieval mind is the seeing of the multiplicity of things. There's a tendency, once one moves on in time, to try and make everything consonant. But there's something rather wonderful about the suggestion of rampant individualization in the medieval mind and all the detail and fascinating little jokes that are in the sculpture and in the manuscripts. You mentioned memento mori, and I thought of this. If you don't know it, I have to pass this on. A wonderful marginal remark by a French monk who was transcribing something. And, you know, there is this moralizing saying, habe mortem PR oculis. Have death in front of your eyes. And said with a French accent. This sounds like Abb. Mort unprez oculis. And that can be read as the abbot is dead in a field and a lily is growing out of his arse. So the scribe actually draws the abbe prone in the field with the lily coming out of his ass. So I think this is totally wonderful. One can. Bringing in every kind of imagination, including the humorous there. So I don't think that I'm somehow down on the richness of it, but I do think that the emotional expression in the face, at least in the west during the Middle Ages, was not anything remotely like what came afterwards. And I say in the west because, as you know, in the Master and His Emissary, I use that extraordinary image of Christ and his mother from the Saint Savior in Chora Church in Constantinople, now Istanbul. And that was what, 12th century?"}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":1092.87,"end":1093.55,"speaker":"Jonathan Pageau","text":"12Th century."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":1093.87,"end":1097.39,"speaker":"Iain McGilchrist","text":"But yes, an amazing thing. Yes. Yeah."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":1097.47,"end":1218.06,"speaker":"Jonathan Pageau","text":"I mean, there was in the Byzantine world, but there was. The thing about the Western medieval spirit is that it's so difficult to contain, you know, because what was happening in Spain, what was happening in Northern France, was actually quite different. We tend to homogenize it, but there's actually quite a lot of variability. But it's true that there was a moment in the Byzantine, towards the end of the Byzantine Empire, where there was this high emotionalism which kind of was brought into the church, and the high expressive use, almost caricatural, you know, facial expressions. And in that church in particular. Yeah, definitely. And so I think that. That. That for me, but I think that. Okay, so. So let me bring it back to the other part, which I think related to the Renaissance as well, because in the Renaissance, what we have is highly. But which become more and more passive in terms of the viewer. And so the development of opera, the development of ballet, the development of all these arts, which are wonderful and beautiful, they actually bring the viewer into a position of just passive aesthetic contemplation. And although you can have internal emotions while you're watching. At first, maybe the opera, there was some participation. We were allowed to scream at the opera, maybe throw things if you were annoyed. But it gradually was moving towards what we have now, which is the concert hall, which you sit and watch. Whereas that's why I wanted to bring out the liturgical part, which is that the liturgical aspect is always participative, right? The processions, the celebrations as well, you know. And so you celebrate the feast of this saint, which is the feast of your local saint, and people dress up in certain colors. They dress up the statue. There's this really kind of dirty, you know, something which is very formal in its purpose, but ends up being very messy and organic in its implementation, which is something that I feel gets lost in the furthering centuries. And that leads to Netflix, ultimately, which is just this. When you sit in front of a screen and you just watch something, let's say."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":1218.14,"end":1315.48,"speaker":"Iain McGilchrist","text":"Well, I mean, that might be a bit of a conflation, but even to be talking about opera and ballet, we're pushing things forward, forward centuries from where we've just been. And I absolutely agree that what's wonderful about the medieval church is this participatory and celebratory nature of it. And I contrast that, in fact, in the book with what happened with the rise of Protestantism. The abstraction, the verbalization of experience, and not the embodied rituals which contained experience that has deep meaning. So that's, in other words, a move towards being explicit, I would say, over implicit meaning. So I don't think that, you know, once again, I'm sorry to disappoint you, but I don't think there's anything here that we're going to come to blows over. But I do think that there are some significant differences, I don't know about this observer who's not really taken up into it. I mean, even for the sake of argument, let's move forward a few centuries and talk about opera and ballet. And my own experience of them is profoundly moving. I mean, the things in life that can really earth shatteringly move me are in fact occasional experiences in opera and ballet. So I'm not sure quite what you mean. You said internal emotion, and I didn't know quite what an external emotion was, but maybe I misunderstood."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":1315.88,"end":1405.65,"speaker":"Jonathan Pageau","text":"No, I think what I mean is that. So I think that opera probably can, let's say, call you to transformation. Like there's some aspect of opera which calls you to transformation. But the liturgical life is very much all about transformation, a transformation of the individual Transformation of the community through this, let's say, common action, where we are not dancing, per se, but we are processing together. We are venerating the same things. We are celebrating, you know, that that is transformational, is binding the society together, you know, as it is expressing also the little idiosyncratic realities of being in a village in Spain, or being, you know, because all these liturgical acts would also have been somewhat universal because you could recognize them, but they would also have had a very, very local flavor with whatever idiosyncratic practice that someone in a little village would develop. And so that's what I mean by this kind of. This call to participation, which is not something that you even only experience alone, but we experience together in the way that we are together, that is, as a village, as a community, not as people sitting in a room watching the same thing, but as the manner in which I have to forgive my brother. I have to deal. I'm here with my mother that I fight with all the time. But now we're celebrating this saint. There's something about that that's pulling me towards something more than just my experience."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":1405.81,"end":1476.16,"speaker":"Iain McGilchrist","text":"Let's say there were two things that you described there that seem to me very important nowadays. We might think of them as contraries, but they are not. They need to coexist. One is the sense of being together over time and space. And the other was of the idiosyncrasy or the idiom of the local place, which embedded you in that particular context. So in Spain or in France, there was something different, but it was still the same liturgy and the same tradition and so forth. And the other thing was this idea of transformation, because, of course, the other way one can see religious ritual is in continuity and confirmation of what there is, that it eternally continues. But that doesn't, of course, mean that it can't involve, and that it should not involve transformation, personal transformation. I keep thinking in terms of the coming together of opposites, because it's a big theme in my latest book, the Matter with Things. But Heraclitus says this rather mysterious thing, by changing it, remains the same, which I really understand. So, yes, I think all those things are. Are wonderful and important. Yeah."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":1476.16,"end":1528.79,"speaker":"Jonathan Pageau","text":"And I think that's definitely what I got from your book, is this powerful understanding of how the one and the many need each other in order to exist. There is. You can't separate them. They have to. They define each other. And we see that in our smallest experience of anything we view as having unity. We can immediately see its parts and Its unity. And it. There's this breathing back and forth between the two aspects. And we tend to overemphasize, we tend to radically think, to think that, oh, we need decentralization, we need to be personal and original and everything, or we need to all be the same and everybody have a number. So there's this radicalization in the modern world which takes away from this organic relationship between one in many, let's say."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":1529.03,"end":1556.55,"speaker":"Iain McGilchrist","text":"Yes. I mean, first of all, what look to us like parts in one context are holes in another. And what looks like, for now, a whole is also a part of something else. So this movement backwards and forwards between what we see as the whole and the parts is terrifically important, including if we pride ourselves on being able to see the whole. This is not achieved by excluding recognition of an awareness of the parts. It must actually involve that at the same time."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":1556.91,"end":1586.03,"speaker":"Jonathan Pageau","text":"Yeah, definitely, definitely. And so I think my biggest question then, after these few little escapades on the Middle Ages, is what do you see as the way forward? Because on the one hand, we have an analysis of the problem and maybe an abstract prognosis of what it is that should happen. Let's say that we should rediscover this. But in practice, how do you see the way forward for us?"}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":1586.43,"end":1902.19,"speaker":"Iain McGilchrist","text":"That's a very good question. And in a way, you suppose there, which some of your listeners or viewers may not know, that the Master and His Emissary ends with my attempt to portray what the world would look like if we only listened to the sort of things our left hemisphere can tell us. And very few people have failed to spot that it's a picture of where we are now. And why that's important is that as I show in the new book that Matter with Things, the right hemisphere sees a much more veridical picture of the world, takes in a vastly richer picture than the map that the sort of skeletal theory of things which is available to the left hemisphere. I've just been reading Matthias Desmet's book the Psychology of Totalitarianism, which I think is very good. And one of the things he says, which is exactly what I always feel is important, is there are not a few fixes, there are not a couple of things that we ought to practice and make sure we do these. Often when I've given a talk, people want to know, so what are the sort of four things I need to do? And there really aren't four things, as it were. We need a complete shift in consciousness. That is the point. And in my terms, this means being Aware of all that the right hemisphere can see that the left hemisphere rules out. But to be more specific, in the last part, the third part of the matter with things, I paint a picture of a cosmos as it would come to us if we could attend both with the right and the left hemispheres. One in which the coincidence of opposites is central, in which this tension between the one and the many is not to be resolved, but actually is valuable only because we can hold that tension so often it's not collapsing into one or other pole, which is the modern tendency when we see two things that we think are opposed, but actually holding them both in tension together. And to understand that, I'd refer sometimes to Heraclitus's idea of the taut string of a lyre that gives the note or the taut string of a bow that allows the arrow to fly. If you let that tension between two things pulling apart go, the string would just collapse and there would be no arrow and there would be no music. So we need those things together. And then I change the way in which we think, I hope about the so called building blocks, I mean about things like time and space and matter and consciousness, but also putting at the front of things what a lot of people would think rather surprising as choices for constituents of the cosmos. Values, purpose and a sense of the sacred. And I think the loss of these, because we've swallowed this very simplistic, mechanistic ideology which I'm afraid only leads, as Desmet suggests in his book, to a state of anxiety, fear, loss of the sense of meaning and cohesion which causes people to flock towards totalitarian solutions, control and so forth. So what we need is to regain some sense of the values that I believe are there in the cosmos. The sense of it having a drive, which I think undeniably it does, unless you're brainwashed into believing you can't see such a thing. And this all important sense of the sacred. So if you wanted a single phrase, it would be to re sacralize our values, to certainly think of our values as core parts of any reality that we have and examine what it is we are valuing. And I draw here, as I do in Le Maistre and his emissary, on an image which I find particularly helpful, which is the pyramid of values suggested, the hierarchy of values suggested by the German phenomenological philosopher Max Scheeler, who I think is very profound. And he describes these different tiers of value with at the very bottom, layers of utility and pleasure, and at the top, the sense of the sacred. And it seems to me that we live in a world in which you've totally inverted these things and all that matters is utility and pleasure. And that all these other things which don't just include the sense of the sacred, but just under the sense of sacred is the idea of beauty, truth and goodness. My goodness. I'm going to say, what has happened to truth in these times? What has happened to goodness? What has happened to beauty? And below that, but still above utility and pleasure, values such as courage, magnanimity, generosity, fidelity. These things, it seems to me, are also part of the bonfire of things that we think we can do without, but actually are part of why life is worth living at all."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":1902.27,"end":2005.83,"speaker":"Jonathan Pageau","text":"Yeah. And so I don't know in your thinking about this, if you thought a bit about Dante, because one of the elements that I tried to bring about is first of all the element of imitation and then the element of celebration. And so one of the things about humans is that we don't celebrate values. We celebrate people, we celebrate places, we celebrate events, we celebrate memories, we celebrate things that participate in our life. And so the reason why I bring up Dante is that what Dante seems to do is that he seems to join this hierarchy of virtues with a ontological hierarchy of saints and angels. And so it's not just about celebrating the virtue, but it is about finding imitation. You know, and so being pulled up by Beatrice, being pulled up by Bernardo Clairvaux, and it's by. And it's through these celebratory imitations that we actually are pulled into participation. And there's something, you know, there's something about the. The Platonic way of formulating it, which I think is. Makes it difficult for humans to. To do that. And that's why, I mean, I guess that's. As you know, I'm expl. I'm very much a Christian, and I. And I think that in the, in the Christian participation, they were able to take what was best of the Platonic good and these. This hierarchy of virtues, but then join them to actual imitation and celebration and participation. And so I guess my big question is, do you think that the way back to this is religious or do you propose rather a irreligious or a religious way for us to re. Embrace these ways of being?"}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":2006.39,"end":2176.06,"speaker":"Iain McGilchrist","text":"Well, I think that fundamentally we do need a religious cast of mind. I have to be careful because. Which is why I wrote a very long book showing people what I'm not saying, because there is an immediate reflex in many people's minds now to shut down as soon as one mentions religion. And in this country, which is a godless country compared with America and no doubt Canada, if you ask people, do they belong to religion, about 13% of them say that they do. So 87% are not. But if you ask people, do you think there's more to this life and to this world than is accounted for in the reductionist, materialist picture, 95% of them say yes. So people are missing something extremely powerful. And what is wonderful in what you said, and I completely endorse and have written about in a number of places, is this idea of being attracted forwards to something that we wish to imitate. And it's in complete contrast to the mechanistic universe in which we are the playthings of causality, in which things, from behind, as it were, push us forward. And I contrast this with the idea of an ideal, of something that appeals to us, that draws us forwards. We may feel a huge gap between us and whatever that ideal might be. I mean, in the Middle Ages, the imitatio Christi, the imitation of Christ, Christ, the sense of an ideal, of course, one's not asked to be those ideals because that's not possible, but to feel the pull and never to disparage that pull and to live in the full meaning of that gravitational force on one's life. So I think that's a brilliant idea. And just to finish, because you mentioned so many things, Plato, I mean, in one sense, of course, what is common there between that picture and the one of medieval Christianity with Dante and Plato would be the idea of these attractive ideals, because I think Plato thought that we were called forwards to these things. We sensed them and we wanted to be with them and like them. But the bit that is not. Is the disparagement of all that is material of the whole business of the incarnate world. And my God, the whole point of Christianity is that God became incarnate. I mean, it's absolutely the central part of that religion and along with it, the much misunderstood idea of redeeming carnality, taking it back into heaven in the idea of resurrection."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":2176.22,"end":2197.23,"speaker":"Jonathan Pageau","text":"Yeah, no, definitely. I think that that's. That's something. When people point to the very. To the Platonic vision of Christianity, which. Which, we have, to be honest, does poke its head up once in a while, where we do have a disparaging of the body and we do have a disparaging of this incarnate principle, but I think that's in a while. No."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":2199.31,"end":2204.03,"speaker":"Iain McGilchrist","text":"It'S a central part of Christianity to Our consternation, but there we are."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":2204.03,"end":2264,"speaker":"Jonathan Pageau","text":"Yeah, but I think that there's also a difference between, let's say, a tendency towards asceticism, which we definitely do see in Christianity, but then that, let's say, the bodily celebration will happen in the forms like it'll happen in the colorful processions. And if you think about. We often have a very strange image of what the Middle Ages were like. In the Middle Ages, everybody belonged to all these associations and groups, and they all had all these very strange practices. And there was something about, you know, holding the relic of a dead person having this. There's this direct connection to embodiment and mortality, which was, you know, the whole idea of the miracle at the cathedral. The miracle of. Why is it that I forget the name of the name. I'm sorry, I forget the name of the saint. The saint that was killed in the cathedral by the king, Thomas Habecki. Yes. So the miracle."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":2264.22,"end":2264.34,"speaker":"Iain McGilchrist","text":"Right."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":2264.34,"end":2305.78,"speaker":"Jonathan Pageau","text":"He was. It was his body that was plunged into a tub and they had killed him, and then they would leak the water out of that tub and people would drink it to their. And it's like, that is not the incarnation. That is actually quite scandalous, almost tantric vision of like. Of the body and our participation in it. So I think that it's true. I do see that there is in. There has been a tendency towards a kind of dualism in the Christian tradition, but there is also a lot of space to bring out the incarnational aspect more. So I think also in the Eastern tradition, there really is this celebration of the transfiguration and the Resurrection. Very much so."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":2306.5,"end":2318.18,"speaker":"Iain McGilchrist","text":"Exactly. I was just going to say all this is much more present, at least now, in the Eastern tradition of the Greek and the Orthodox, Russian and Romanian Orthodox churches."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":2319.12,"end":2319.36,"speaker":"Jonathan Pageau","text":"So."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":2320.48,"end":2397.09,"speaker":"Iain McGilchrist","text":"Yes. And of course, what one needs to be able to preserve, if possible, is the sense that, you know, flesh is not something simply to see as abject and to be, as it were, if possible, got rid of, but also not to see it as central or absolutely essential to whatever it is one means by the living spirit or soul of the person. So, again, it's one of these holding together of things that don't seem immediately to cohere. I don't know whether I can call myself a Christian or not. I'm rather loath to make such a grand claim. And I know that it's perfectly all right to acknowledge one's complete failure to be a good Christian and still call oneself a Christian, but I certainly draw enormously, spiritually, from the Christian tradition. How could one? Absolutely not. It's so fantastically rich. And it was that really that drew me to it in my teens, having been brought up in a family where religion played no part at all. So much so that by the end of my teens I planned to become a monk, which was really."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":2397.73,"end":2398.77,"speaker":"Jonathan Pageau","text":"I didn't know that."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":2399.17,"end":2450.94,"speaker":"Iain McGilchrist","text":"No, no. My idea was to go to Oxford, study philosophy and theology, and then probably go into a monastic order. Fortunately, for any monastic order and for myself, this plan changed and I don't think I'd have fitted in very well. But really, the only reason I'm sort of mentioning that is to say that I suppose my position, which I think is a very important part of the way I look at things, is a panentheist position, not pantheism, which simply, as you know, means that everything is God and God is everything. That's the sum of everything. But that God is in everything and everything is in God, which leaves room for God to be more than we can know or say by just summing everything that we believe to be real."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":2451.84,"end":2493.4,"speaker":"Jonathan Pageau","text":"Yeah, I think that that position is definitely in tune with the more mystical aspect of the Eastern tradition. You really do have an apophatic vision of God which is central to all the mystical practices in the Eastern church. But then there is also, like you said, there is this filling up, which I think that's what you see in Dionysus the Areopagite so clearly is that he does these two extreme movements where he. He says, no, you cannot say anything which touches God. God is beyond all definition, all name, all being, non being. He's beyond all things, but at the same time he is to be found everywhere and hidden behind all phenomena in all things."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":2494.04,"end":2576.99,"speaker":"Iain McGilchrist","text":"Yes, I must say I'm probably more than you adherent to the idea of apophysis of the apophatic tradition, which presented me with a problem because at the end of the recent book which occupied me over the last decade or so, the matter with things, at the end I have this chapter on the sense of the sacred, which is, I think, over 100 pages long. So it's really a short book. And I started it knowing that anything that one says about God is going to be wrong. And that therefore whatever I said was going to be in some ways either an idol that got between one and God, or at least a distraction and a falsehood. But the alternative was to say nothing at all about it. And that seemed to me actually a greater betrayal of it because it's better to, as it Were fail the best you can and acknowledge the extent of your failure, than to say nothing. Although I was advised by very kind friends and colleagues, don't include this chapter. You know, the book contains a lot of interesting philosophy, but people will stop taking you seriously if you write a chapter on the sacred. Anyway, at the end of the day, I did. So there we are."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":2577.07,"end":2630.5,"speaker":"Jonathan Pageau","text":"Yeah, But I think we're in an interesting position right now in terms of. Of the current, let's say, intellectual space where the notion of apophaticism, when you look at the developments in cognitive science and the way in which people are seeing the limits of definitions and are talking about complexity and emergence, the notion of apophatic thinking is just. It has to rush back in because we realize that there's almost like a fractal apophaticism where although we tend to talk about apophaticism in terms of God, there's also a phenomenological apophaticism, which is that all things present themselves as always, more than what. Than what they are. And so they all called you. There's this calling behind all phenomena, which I think Heidegger was wanting us to get a sense of with his idea of Dasein. And so it seems like it's a good time to talk about that."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":2630.74,"end":2657.38,"speaker":"Iain McGilchrist","text":"No, I agree completely. And of course, interestingly, the apophatic path is the path that is taken by science itself. Science can never say this is the case. It can only say that as we see things now, we can say that the following things are not the case. So in other words, it's always alerting us to things that we should not prefer, but is unable to say. This is the truth. Yeah."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":2657.38,"end":2674.21,"speaker":"Jonathan Pageau","text":"And that's interesting because although that is ingrained in the scientific method itself, it's always betrayed in its popular. The way it's presented in popular world. It's always about science says this. And so now we follow this line."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":2674.21,"end":2706.78,"speaker":"Iain McGilchrist","text":"Yes. I don't know if you agree with me, but I think that a lot of this is due to the prevalence of talking heads from the biological world. I'm very impressed by the modesty of physicists and their utter readiness to acknowledge the extent of their un. Understanding. But there are a number of people who've become used to the idea that they're obviously very good at molecular biology and that this gives them the authority to pronounce on whether there's a God or not."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":2707.02,"end":2707.5,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":2708.86,"end":2712.66,"speaker":"Jonathan Pageau","text":"Who won't name any names. I think you're probably right."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":2712.66,"end":2713.58,"speaker":"Iain McGilchrist","text":"Absolutely not."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":2714.38,"end":2730.61,"speaker":"Jonathan Pageau","text":"I think you're probably, probably right. There is something. I mean, during the entire 20th century, there's a sense in which some of the physicists had very deep mystical, at least insight, or at least a kind of mystical reserve facing the way phenomena was presenting itself to them."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":2731.01,"end":2797.74,"speaker":"Iain McGilchrist","text":"Yes. In discussing matter and consciousness, I quote many of the great physicists of the last century. And as you probably know, there's hardly a single one. In fact, I can't think of, of one who doesn't really embrace this idea that consciousness is ontological primary, which doesn't necessarily mean that it is prior to matter, but that it is an ontological primary in the sense that you can't get behind it and say that it's derived from something else. I think to have a dispute about matter and consciousness may be a mistake if one's arguing that consciousness is prior to matter. I think that case can be made, and I'm sympathetic to it. But I think at the moment, what I hold is that they are in fact different phases of the same phenomenon, much as ice and steam and the flowing liquid are all manifestations of water. If you say which one is the real water, which came first? Well, there isn't an answer to that question. They're all completely different manifestations of the same thing with utterly different qualities, but they are effectively the same. Yeah."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":2797.74,"end":2837.52,"speaker":"Jonathan Pageau","text":"And I mean, a simple formulation of that would be either you see in Scripture that it says in the beginning God created heaven and earth. And those two primary categories, whether you see it as the dao or as the yin yang, for example, as these two primary categories, they don't, you know, they are in a way a manifestation of something apophatic behind it. But as they appear, they appear as two opposites in attention that play with each other and that one expresses the other and the other finds body in the other. And there's this interplay. So I think that that's something. Absolutely, yeah. It's something that is there in basic, just theological thinking."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":2837.52,"end":2861.93,"speaker":"Iain McGilchrist","text":"I think it is. And it's embraced by the idea of panentheism and in my thinking, the idea that the cosmos and the divine principle are constantly in an act of co creation. That's very important. This is an idea that was articulated by Alfred North Whitehead, who I hold in considerable esteem."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":2862.97,"end":2915.22,"speaker":"Jonathan Pageau","text":"Yeah, I probably struggle a little more with Whitehead in the sense that I think that there's a manner in which, let's say, the revelation of the divine principle, at least for a Christian, from a Christian perspective, the revelation of the divine principle will happen in this almost like intercourse, right. You have this almost sexual imagery in Scripture between the bride and the bridegroom, between the two aspects. But that there is, let's say, the infinite is behind that. Or, you know, there is an apophatic emptiness or source out of which this play kind of comes into being, which, at least in Scripture, is represented as, let's say, the first moment of creation. And so you have heaven and earth, but you have something which is beyond behind that is the source of both, of that opposite. Just so we don't fall into a kind of duality, a dualism."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":2915.3,"end":2963.7,"speaker":"Iain McGilchrist","text":"No, I think one ought not to, exactly. I suppose my belief about the divine are processual. So I believe that the divine creation is a process. In fact, I believe that all things are processes. What we call things are in fact, ways of nominalizing processes and making us think that they're somehow distinct and separate from other things, other processes. But I think what you're possibly trying to do, which I would sympathize with, is maintain the possibility because after all, we agree that ordinary language won't encompass the. The divine. That we can have an idea of God as eternal and as something that is constantly coming into being."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":2964.74,"end":2998.08,"speaker":"Jonathan Pageau","text":"Well, yeah, I think so. Well, at least that's the way that I would see it. And I would see, let's say, the divine story or a good image that you see in Scripture. You have this grand story, right, where you have this movement from the garden to the city and this filling up of the world with presence. And so it starts with the seed, with a tree in the natural world, and it ends with this glorious, shining filling up of even human activity with this. With the divine presence, you could say. But it is like an idealized vision of this process of filling up of the world with the divine principle."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":2999.68,"end":3042.38,"speaker":"Iain McGilchrist","text":"I don't know about, perhaps, I question, but I don't want to get into legalistic manner of procedure, but I don't know about filling up, suggesting that at some point it wasn't filled. I mean, my idea of process is not that something becomes to a greater degree divine, but that the divine becomes to a greater degree what it is, if you see what I mean. So it's not a matter of filling up something that was formerly an imperfection by adding in some more divinity, but instead the divine is itself something that is eternally something that can be unfolded without in any way damaging its integrity."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":3042.7,"end":3132.83,"speaker":"Jonathan Pageau","text":"Yeah, no, I definitely agree. And you could see it almost like as a. You could see the story as an intersection within. Within God, like It's like you see it. We see it as a slice of something which is eternally happening and eternally true. But because of our. Because of our position, you know, we just see this as this line. A point there and a point there and the through line. But ultimately, it is something which is eternally happening. The word happening even doesn't account for what it is we're trying to talk about. And so I guess let's say if you had advice to give to the people that are listening. In terms of what you feel that they should be attending to or doing or. Or because it's the project of having a radical change of consciousness. Is a pretty big project. And I think that it can seem so big that for people reading or for people listening. They'll feel like, well, what am I going to do then? Because it seems like especially in the last few years. Things have gotten much worse with COVID And the reaction to Covid. And the totalitarian spirit. Has felt itself very pressing down into us. And we've also felt a willingness to embrace it. Out of a fear of anxiety, of danger and anxiety of uncertainty. And so what do you suggest for people that they could do in their lives?"}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":3133.31,"end":3397.59,"speaker":"Iain McGilchrist","text":"Yes. Well, what I'm going to say is probably not terribly satisfactory. But I do rather hold with Desmet that. I mean, I'm very glad to hear him say specifically what. I also believe that it's no good thinking of one or two things we can do. We need to move to a different vision of who we are and what the cosmos is. Which will enable us to rediscover the integrity of experience. To rediscover the sense of value, purpose, direction. Which is not something, I believe, that we paint on to the universe. Something inside our head. We wallpaper it in a pleasant way. In order to make ourselves feel better. About being in this terrific prison of the skull. I don't believe that at all. I believe that we are, in fact, when we're experiencing. We are in touch with something that is entirely real. We only see part of it, of course, a very small part. But the part that we do see is nonetheless real, even if it's not all. And that these things can be rediscovered but not piecemeal. I mean, the nearest I can get piecemeal is we'll try mindfulness meditation for half an hour every day. But that's not a very satisfactory answer either. So I'm going to give them the most unsatisfactory answer. But quite honestly, the best answer. I'm sorry to say this, but it might be worth reading the matter with things, if you can bear to. Because the whole point of that undertaking was precisely to take somebody who couldn't see anything here beyond the reductionist, materialist paradigm and take them by logical steps that they can acknowledge to a place where instead of thinking only somebody with lack of education or very simple minded would believe in the sacred and the divine nowadays, I want them to arrive there and think that only somebody who's rather simple minded or not very well educated would jump to the conclusion that there's nothing in this sacred, that one really needs to try and approach it. And of course, one will never know it unless one puts oneself in the way of doing so, which means opening oneself to it. So it's no good waiting for it to come and knock on your door. You have to do what I call active receptivity. So you have to attend in a manner that will allow something to come into being in the space that you have opened by your receptive attention. I believe this is how artists are able to conceive their works of art. And I believe it's how we get to understand the existence of the sacred. I think it's what is meant by prayer, probably this attention, this open attention in which one's not talking to or about God, but actually listening. I think this is a very important thing. Attention is at the core of it. And I know you yourself think attention is very important. I call attention a moral act because the kind of attention we pay changes the world. Change, it changes what is there to find. And it also changes us in the process of attending. And I think here of two French philosophers of the last century, one very well known Simone Weil, who said that attention is, you know, to pay attention is the greatest act of generosity and that it mediates our ability to understand what comes to us through prayer. And Louis Lavelle saying that love is a pure attention to the existence of the other. I think this is brilliant and important, and so paying that attention is necessary. How to do that? What I'm hoping is that after reading what I have to say, people will feel that experience. And I'm emboldened to say this by the fact simply that people keep writing to me and saying, since reading your work, I can't not see the world in a certain way. It's changed my sense of my life, it's changed my relationships, it's changed my work. And now I see everything through this different lens. So if somebody says, well, can you hand me the lens? I say, yes, it's out there."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":3397.75,"end":3438.84,"speaker":"Jonathan Pageau","text":"Yeah. And I think that what you're saying is the idea of attention is a very simple and perfect way to help people understand. Because like you said, you, you can explain it for a certain amount of time, but then everybody knows what it means to pay attention to, at least to a certain extent. But if you start to practice it. No. And you can see the difference, especially if you have a family, if you have kids, you know, you can. You pay attention to your kids, like real attention? Yes, that it's transformational. And then they don't. People say you need to spend time with the kids. Like, no, you can pay attention to your child for 15 minutes and they will go on their way and play alone. They'll be happy because they will have gotten that connection that they're looking for."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":3439.4,"end":3522.31,"speaker":"Iain McGilchrist","text":"It's a kind of magic. It bestows something on whatever one is attending to. It brings it to life. And the trouble is that one's attention is valuable to capitalism. Everybody wants a grab of your attention to buy their thing. But this is to reduce one of the greatest things that exists, to desecrate it, to trail it through the mud and say, no, it's just about listening to what I've got to say. What you've got to say. This jingle, this message from your machine, the way to achieve it is to switch all that off and empty your life out. I mean, I'm not saying certainly that I've got anything, you know, to model. I, I'm not very good at any of this, but I do actually live in a place where I can't get a mobile signal at all. You can't get a television signal or you could, I suppose, with a satellite, but I don't. And so I have an enormous amount of peace outside. There is a very beautiful world in which things are speaking to me if I allow them to speak and don't over explain or talk to them, but just open to their being. So there is some kind of commerce that is vivifying that comes about through one's attention to the world. And as you say, it is a generative act."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":3523.43,"end":3540.6,"speaker":"Jonathan Pageau","text":"Well, I think that that's a beautiful place to finish our conversation. I think people can leave with a nice little nugget of wisdom that they can apply in their lives. So, Dr. McGilchrist, thank you so much for your time and for meeting with me. It was a wonderful conversation."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":3541.08,"end":3543.72,"speaker":"Iain McGilchrist","text":"Well, thank you so much. I very much enjoyed it."}
{"episode_id":"SW - #243 - 2022-07-22 - Dr. Iain McGilchrist - Beyond Materialism - The Matter With Things","start":3544.52,"end":3606.57,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon, the Pageau videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
