{"episode_id":"SW - #050 - 2019-08-17 - Beauty Among the Ruins","start":0.88,"end":2.52,"speaker":"Jonathan Pageau","text":"On this episode of the Symbolic World."}
{"episode_id":"SW - #050 - 2019-08-17 - Beauty Among the Ruins","start":2.52,"end":42.84,"speaker":"Jonathan Pageau","text":"Podcast, I'm playing for you a conference I gave in Saskatoon last year called Beauty among the Ruins, where I look at the resurgence of liturgical art today, you know, at the difficulties that people all over Europe went in terms of sacred art, but how it is being reborn today. You will find that some of the discussions will revolve around images. And so I encourage you, if you want to see those images, to check out the. The YouTube video which is associated with this. You'll find that link in the description below. Just to remind everybody that all that I'm doing here online is due to your support. So go check out www.thesymbolicworld.com to see how you can support this podcast."}
{"episode_id":"SW - #050 - 2019-08-17 - Beauty Among the Ruins","start":42.84,"end":45.56,"speaker":"Jonathan Pageau","text":"Of course, sharing, of course, subscribing and."}
{"episode_id":"SW - #050 - 2019-08-17 - Beauty Among the Ruins","start":45.64,"end":50.84,"speaker":"Jonathan Pageau","text":"Leaving a review wherever it is you listen to. Podcasts, I hear is extremely useful in."}
{"episode_id":"SW - #050 - 2019-08-17 - Beauty Among the Ruins","start":50.84,"end":72.5,"speaker":"Jonathan Pageau","text":"Getting the word out there. So please, please do that if you can, and enjoy. This is Jonathan Peugeot. Welcome to the Symbolic World."}
{"episode_id":"SW - #050 - 2019-08-17 - Beauty Among the Ruins","start":82.99,"end":163.28,"speaker":"Jonathan Pageau","text":"It's great to be in Saskatoon. I had never been to Saskatoon before, and I got this very strange message from Troy who said, you know, we want to organize an icon carving class in Saskatoon. And to be honest with everybody, I get those kinds of messages all the time. People who ask me and say, oh, we want to organize this thing with this event, this workshop or whatever. And most of the time, you know, people have good intentions, right? So most of the time, you know, it doesn't. Doesn't pan out. And it's not that easy to find people who want to learn to carve icons. It's a bit of an esoteric art. It's not that known. And so Troy, he says, we're going to have this icon carving class. Would you come? And I said, I usually. I just say, sure, organize it and I'll come. And then usually I never hear from the person again. And so it's a conversation, you know, and it's a good way. It's a good way to do it. But then Detroit keeps writing me. And he says, well, how many people would you like? And I said, well, if there's a minimum of maybe seven people, I remember, I forget what I said, then I'll do it. And then he said, no, but what's the maximum you want? He's like, well, maybe 10 people is a good number. Maybe 12 would be max. He says, well, I don't think we'll be able to do under 15. And he said, and then maybe we'd have kids there. So I'm thinking about 20. And I was like, who are these people?"}
{"episode_id":"SW - #050 - 2019-08-17 - Beauty Among the Ruins","start":167.74,"end":167.98,"speaker":"Jonathan Pageau","text":"Been."}
{"episode_id":"SW - #050 - 2019-08-17 - Beauty Among the Ruins","start":168.14,"end":2487.76,"speaker":"Jonathan Pageau","text":"It's been a joy, really. It's been a joy. Tomorrow is our last day. It's been a joy to be here and to discover these large Catholic families. And they're amazing kids who are able to spend from 8 to 5, you know, working on an icon. You know, it's astounding to me. So it's very encouraging to me, and it gives me hope to find this community. And so I guess that's what I then I wanted to kind of offer back maybe, or to talk about, is to talk about hope and to show some glimmers of hope. For those of us who love the Christian tradition, for those of us who love the beauty which has been developed in the Christian story and have sadly seen our world move away from it, have sadly seen our world embrace a almost cult of ugliness. But there is this glimmer of hope that we've seen in the past few years. And so that is what I wanted to talk about with you tonight. So if you look at the screen, the first image that I am presenting to you is in 1931, Stalin finally had enough power to destroy the largest church in Russia, Christ Savior's Cathedral, and he blew it up. And so this is a picture of the actual explosion and fire due to Stalin destroying the. The cathedral. They estimate that the Communists destroyed about 30,000 churches during their time. Burnt, blown up, turned into stables, turned into whatever, decimation of an ancient tradition. And so in our world, we have been lucky. We've had freedom, and we haven't seen this kind of persecution, at least not, you know, maybe since the French Revolution, we haven't seen that type of destruction. But what we've been faced with is rather a. Is rather a kind of suicidal desire for ugliness. And so instead of having our church blown up, our churches blown up, we are given these churches, these. I don't know. I don't even know where that is. And I don't think. I didn't really want to know. We have a church in Quebec, and when they built it, it was this beautiful futuristic project of this modern building. And everybody was happy about it, but the people in the city basically said, you know what? It looks like a handbag. And then from then on, this church has been known as the handbag church. You go online on Wikipedia if you want to learn about this church, right? L' Eglise Sakosh, the handbag church. And so this is what we've sadly been faced with. And we've seen it not only we've seen it within Christian culture, but obviously even more we've seen it in the secular culture, where we've actually seen an assault upon the entire tradition of our fathers, the entire tradition of Christianity. I don't want to dwell on the ugliness, but here, of course, is an image by Francis Bacon representing the Pope, as was a famous painting of the Pope by. Think of. By Titian, making him into a monster and putting him in this space with dead carcasses. And this is. This artist, Francis Bacon, is a great example, is a great example of this lauding of decomposition and this praise of death, of ugliness, and also of shock value. That's one of the things that is the most difficult for people to understand, especially in when we look at all the modern churches, which were, oh, so modern in 1950 and now look, oh, so dated in 2019. It's because we began to mistake the titillating feeling we get when we see something we've never seen before, this kind of desire for novelty and for surprise. We've confused that with actual beauty. And that's why all these modern churches age so badly. Just like shag carpeting or anything that was very much in fashion and then quickly went away from fashion because it was appealing to that desire for the new. And if you look at. If you read the Church Fathers, you read the Ascetic Fathers, they actually describe this passion and they link it to a sin. They would call it acidiyya. And it was this boredom, this kind of desire to be titillated, this boredom with what we have and a desire, constant desire for the new. I mean, the demon of our world is basically acidiyya, the demon of acidiyya. And so we've had to face that. And then the final type of ugliness we've had to face is just the ugliness of the, you know, this ugliness, the ugliness of the banal, you know, strip mall, highway with signs, random whatever, with everybody trying to get your attention to buy something, and no sense of proportion, no sense of beauty, but just really a kind of. And, you know, it's so funny because we're so used to it, right? We're so used to it. Anybody who, for example, has taken the time to go to Europe to visit an old city or to even go to the old part, you know, of Montreal or Quebec City, in all of a sudden you are surprised and you see this harmony, this organic harmony which just coexists, and this natural beauty which is both planned, both organic, both hierarchical, but also very. A little bit of chaos. Nothing like the kind of madness that we have to face every day that has become our landscape, basically. I just want to give one more example. And then within the church we've had these assaults and some of them are like this. I'm sure the person who made this image was well intentioned that it was not out of hostility to Christ or hostility to the church, but it does end up looking like superheroes, I don't know, flying around. I'm not sure exactly, exactly what it's supposed to represent. But even within the Christian tradition, we've had hostile images that are presented. I want to show you an image. This is called Christ with hangers. And you can see it's actually right now presented in a church by an artist called David Mak. And it's just, it's what it says, it's what it is. It won a prize, you know, in a contemporary art competition to have Christ on the cross made with, with coat hangers. And there's a little pun in there, I guess he's hanging on the cross. It's disturbing to the utmost extent and to think that this would win a prize of art and then would be put into a church. Yeah. All right, so I want to bring you back to this image, this image of this destruction of the, of the, of the cathedral. And the talk, the talk that I gave today was, was the title was given by Troy because I was, I was not answering his emails and he said, I'm just going to give the title for the talk. And he said it would be Beauty among the Ruins, I think was the title. And that really evoked for me the image of this situation. And as you know, I came into the Orthodox Church and so this is what the Orthodox Church had to deal with, this attack, this desecration, the near destruction, but not only destruction, but infiltration of the Orthodox Church that happened in the time of communism. But in that death, in that rubble, in that moment of deep despair, that's where also this seed of hope is born. That's also where all of a sudden these little lights, these little flickers appear. And because of the darkness, because of the rubble, those lights, those little seeds, they seem so much brighter at the same time. And so in the, at this time around 1930, up to about 1950s or 1960s, there are almost no artists, Christian iconographers in Russia or in Greece, it was dead. There was almost nobody. The only people who were able to keep, let's say, the tradition of icon painting alive were what we call the Old Believers. They're actually a schismatic group that were constantly hiding from the church and hiding from the authorities, but they were able to somehow preserve this tradition and, you know, within this attack. And so some of the emigres who left Russia during the revolution and because of the revolution, ended up in France. And among those emigres, this new little bastion of thought, this new little bastion of creativity began to be born. And among those intellectuals, a lot of the Orthodox theologians we know today come from that time, from that Paris, we call it the Paris school. And among those, there was a man named Leonid Uspensky. And Leonid Uspensky took it upon himself to renew the art of iconography. And they scoured old books. He tried to meet with old people, tried to find what he could, the writings that he could, the council that he could, whatever it is that he could find, to try to reinvigorate this almost completely abandoned, forgotten art. And so he tried how he could. He didn't completely know what he was doing. He wasn't even trained by a master. He was figuring it out. And he wrote some books, books about interpreting the icon, book about the theology of the icon and painted icons. And he did that his whole life and remained a rather poor individual his entire life. But there it was, there was that little seed, that little seed that at first looked like nothing. It looked like this one man who. Here he is writing these books. Here he is in his garage in France, leaning over his table and painting these little icons. But what he would light would become this raging fire. And we're going to see it happen before your very eyes. That's what I'm going to show you tonight. And so among those people there, there was also another priest, his name is Father Gregory Krug, who also tried to find a way to paint these icons once again. And interestingly enough, Father Gregory looked also as much. He looked at the ancient arts of. Of the church. He also looked at modern art as well. So there's a little bit of modern art in what he's doing, but trying to keep it very tightly held by the traditional canons of the church. So there's this interesting thing that's going to happen. You're going to see it develop. Also in Greece, there was a little mirror of Uspenti in Greece, His. His name is Fotis Contoglou. And Photis, same thing. On his own, alone, with no one, was a secular artist. He had learned to paint in school. There were no Icons left, pretty much no icon painters left. And he, on his own, decided to start up. And he started with this style that was a little more naturalistic. And as he moved on and he discovered, and he studied and he looked at the ancient masters, he went towards this more hieratic, you could say, or more kind of abstract style. And if you look at an icon like this here, you'll find that if you go to many Greek churches, if you go online, if you look, you'll find icons painted in this style today, all the time. And this is all due to. And so in the west and in Russia and in Greece, and then there are few others. Some. Some in Georgia, some in Romania, these little seeds, these. 1. It's always the same story. One man, sometimes one woman, who, for example, I teach at a school of iconography which was founded by a woman named Pokrovsky. And this woman was a chemist in Russia. And because she was a chemist, she was hired by the Kremlin to restore icons, restore the ancient ones that they had ripped out of the churches, put in museums, but they were falling apart, so she was hired to restore them. So she had to study them, she had to cut them up and look at the different pigments and look at all the different things. And so she discovered how the ancient icons were painted. And then while she was being hired by the Communist government to restore icons, she was secretly painting them and secretly teaching others to do it as well. So they would meet in basements. They would meet, you know, in a very. In places where they wouldn't have the ears of the government. And there, you know, in the guise of her official role as a restorer, as a. As someone who worked for the government, then she was able to light those little flames. And so as we come to the fall of the Wall and the. Let's say that the freeing of the Eastern bloc, we hear, And a lot of people, we hear about this renewal of Orthodoxy, this renewal of Christianity in the east, in Russia, Romania, Serbia. And the way that it's portrayed for us in the media here is usually that it's all political. It's all Putin. It's all this political ploy to control the people and to make them do what Putin wants. Maybe. I don't know. Despite that, to the last of my knowledge, in terms of counting, since Putin has been in power in Russia, they have actually built 20,000 churches. And so Stalin destroyed 30,000. Putin built 20. So he's not done yet. Maybe he'll. He'll replace all the ones that were Destroyed by salad. But I want to tell you a little story to maybe help you understand how that little flame of love, of beauty and the love of liturgical art can be rekindled. There's a church outside of Moscow. Moscow. It's called the Church of the Protection of the Mother of God in Jasenevo. It is a gigantic church. It's one of the biggest churches in Russia. And inside it is covered in mosaics. It's covered in gold mosaics, like in Venice. Gold mosaics with figures everywhere. The entire church is covered. I think it's the second most covered church in terms of its interior of mosaics. And interestingly enough, the model for their Christ is actually the image which comes from Sicily, from those churches built with a mix of Romanesque and Byzantine style that we find in Sicily. So the floors are all marble floors in 12th century Cosmati style, you know, everywhere it's gold. There are chandeliers everywhere. I'll show you some pictures of the dome and some of the marble revetments. There is no single large donor for this church. They received donations from 800,000 people to build this church. They did not have enough money to hire all the artisans or all the artists or all the people they would need to build a church. And so the entire church, all the marble, all the mosaics, were all done by volunteers. People would show up in the morning, and then there was one person who was hired and who would give them the task for the day. And the whole thing was made by volunteers. They didn't have enough money to buy the tesserae, those little glass tiles that you get from Italy, which are quite expensive. And so they made their own. And for the gold tesserae, people would send their earrings, their rings, their jewelry through the mail to the church, and they melted it down and they built this church. And so that is a miracle. And that is something which you can't. Can't fake that you can't convince me that this is a psyops. It's an amazing testimony to the faithful who have awoken to their faith and awoken to the beauty of that is possible. Now, to be. To be honest, the Christians in Russia are still the minority. The Christians in Russia are not the majority. There's still a minority. People who are baptized are still minority. People who are married in the church are still a minority. But they have the fire, right? They're the ones with. They're the ones who are moving. They're the ones who are making things move because they have something to. Something to fight for they have something that has value. You know, they're not just sunken in their nihilism, as so many of us are around us today. When was it built? It was built not very long ago. I think it was finished about four or five years ago. I don't think it might not even be totally finished. Like the outside, it might not be totally finished. And so this is one example. But all over Eastern Europe, there are churches being built. These monuments, crazy monuments. This is a church. This is the cathedral in Montenegro. And it is completely traditional in its structure. It has beautiful ornamentation. But the architect created this hierarchy of materials where he started out with these very raw blocks of stone. And then as you ascend the church, the stonework becomes finer and finer until at the top, you have all these very little stones that are all, you know, hand carved and all done. So it's an amazing church. I'll give you a sense of the size of the church. And all around the outside, this, they have all these. I'm just showing you that for me, all around the church, they have all these beautiful carved icons that are on the outside because they're stone, they can survive the outside. So they have all these. In these kind of raw blocks of stone, you'll find all these different carved icons on the outside. And on the inside, it's all, once again, gold. I don't have pictures. It's all gold painted icons and. And chandeliers. It's a stupendous thing. I want to show you a picture of the cathedral in Bucharest. Maybe some of you have seen it. It's not finished yet, but this is just what it looks like as it's being built, to give you a bit of a sense of what's going on here. And so this is something that is happening. It's happening now. This is happening right now. It's happening all over. And that little flame that was lit by those first iconographers, those first people who rediscovered liturgical art and wrote about it, talked about the sacred meanings, talked about these sacred patterns that we find. This relationship between the liturgy and the architecture and the icons, and how it's this giant dance, this giant pattern puzzle that all comes together and that you can't separate it, you can't pull it apart. You can't completely separate the architecture of the church from the liturgy, from the things that are represented in the church. It all goes together like one giant cosmic dance. And so from that, there is this whole flowering of iconographers, of painters, and there was that first generation that I showed you Uspensky and Kontoglu and a few others in Russia and in Greece and a few other countries. And now we have entire schools of icon paintings. We have masters who show the way, and people follow them in different directions. So there's a variety of styles and a variety of explorations happening, but all really tied into that traditional spirit and a desire to revive this traditional art. So I'm going to show you a few examples of. Of these artists, and then I'm going to start to show you a bit of my work. So this is Father Zenon. So Father Zenon, he is one of the visionaries of liturgical art right now. He is a. He's an amazing artist in the. In the strict sense. He can. He's a. He's an amazing draftsman. He's a virtuoso in terms of painting. He's just an amazing artist. But what he's doing is he is plunging into the entire history of Christianity. And so he is. So, for example, in this image, you'll see a more kind of traditional Byzantine, Russian image. And then this icon that he painted, the other one of Christ entering into Jerusalem is based on Armenian art. And so he goes into Armenian ark. He went into Russian Byzantine, he went into medieval. He painted some churches that have Romanesque style that are very simple, kind of like Spanish Romanesque. That's very abstract. And then he kept going and going and going, and he started to paint in 6th century encaustic, and he started to paint in frescoes that look almost as if they were in the catacombs. And so he's plunging into the entire history of art and just exploring like a little child, you know, who's just exploring and saying, oh, this, that, and this and that and this. And he does everything with absolute virtuosity and working towards what I believe is to be a synthetic language, to work towards a synthetic language of Christian art, which takes into consideration all the best aspects of this iconographic style as it presented itself all over the world, and trying to bring it together and show the threads that connect everything together. So he's an amazing. He's an amazing artist. I'm giving you all these names and you can all look them up, you know, on your own afterwards if you want. One of the most surprising revivals of liturgical art has been in Georgia. Georgia has a very particular style, a very kind of bold style, which looks a little bit like, let's say, early medieval art in France or in Spain. Spain. It's very bold and very abstract. So there's been a whole revival of painters and artists. Here's an example of a dome mosaic. You can see, in a sense, of the size of the mosaic, and you see the person standing into it. You know, I have not seen as bold an image of Christ. If you look at just the expression on his face, that strength, we're so afraid to show that now. Like, we're so afraid. We want Jesus to be nice. Jesus is nice. Yes, yes, he is nice. But he is also the Lord of all and the King of Kings. And so to see, to me, to see that face that has a certain severity and a certain presence to me, that see, that gives me hope myself. And one of. And let's say the kernel of this movement, like I said, it always starts with one person. And his name is Amiran Goglidz. It's hard to. I didn't write his name, so Goglidz. And he had the same story as so many. He started by restoring icons for the government and then slowly falling in love with this language and learning the inner workings of the language and coming to create a very, very beautiful style that joins the best of Byzantine art with the Georgian ark. And Amaran was commissioned by Pope Benedict to replace the icon not made with hands. Because the icon not made with hands, the Veronica's veil has become so covered and so dark that you can't see the image anymore. And it was always taken out at Easter, during the Easter service. And so the Pope commissioned Amirah to make the icon which would serve liturgically at that moment. And so this is the image that he made. So in Romania, we have everything from an exploration of a very deep classicism and this kind of virtuosic, luscious classicism that we see in some artists. This is Father Ilie Bobayanu, and I'm going to forget his name, Daniel Nekulai here, everything on that side. And then we also see certain strains that actually kind of are exploring a little bit of a modernist sense, a little bit of those modernist, let's say, composition and certain sensibilities which are not as traditional, but are still interpreted within the traditional frame and within the traditional, let's say, canonical world. And so obviously, these types of images will provoke discussion, will provoke a lot of people. Some people are fine, they go too far. But the discussion is a real live discussion that's happening, and people take sides and people talk about it. If you're interested in this discussion, I edit a journal called the Orthodox Arts Journal, which is online, and we feature a lot of all These artists, from the most traditional to those that are pushing the limits and are trying to see how we can connect iconography to, let's say, more modern art. And so that kind of brings a story to me. The as just as this happened, this kind of, let's say, awakening out of the ruins of the modern world, and we see this flowering now all over Eastern Europe, my little experience was something similar. I grew up. I was a Christian. I grew up a Christian in an evangelical church. And obviously, there's a poverty of art in the evangelical church. Everybody knows, even evangelicals know that there's a poverty of art in the evangelical church. And I went to school, studied contemporary art, and I just couldn't get it to work. I just. I was studying contemporary art. I was doing really well in school. I finished. Actually finished first in my arts program, but I just couldn't get it to work. I couldn't. I couldn't connect being a Christian, making contemporary art, which is always so cynical, so removed from what they're doing. You always. In contemporary art, you're always making a comment on a comment on a comment of something, but that's not what I want. I didn't even know what I wanted yet. I didn't even know what I wanted. But I had this yearning to. To somehow connect my faith with the art that I was doing, and it just wasn't happening. I spent my entire bachelor's degree trying to do that, trying to find symbolic ways of representing different stories from the Bible and trying to fit them together and to create all these images. And it's very funny because on the very last day of my degree, the professor who was kind of supervising me, they were giving us, like, a final evaluation. And she sat me down and she said, you know, Jonathan, she said, don't worry, you know, you'll get. You're getting all A's, you know, it's fine. Don't worry. But what are you doing here? And she said, you really don't. You really don't belong here, and you should go to seminary or something because, you know, you just. It just doesn't work. And it's so funny, because I was 21 or whatever, it just rolled off my back. I didn't take it. But she was right. She was so right, she doesn't even know how right she was. She actually gave me the greatest service by telling me that. Yeah, little did she know that I would really take her recommendation seriously. And so, you know, having. Let's say, having. So having, let's say, struggle I decided, I'm going to give up art. Just going to. I'm going to. I was married at that point. You know, I found a job and I said, I'm just going to be a regular person, just nine to five, just going to throw. I'm just going to throw art out the window. That'll be it. Because I just can't. I can't take this anymore. I destroyed all my paintings, closed down my workshop. That was it. And I remember, it's funny because my wife, she just laughed at me. She's just like, yeah, Jonathan, whatever. We'll see. For now, we'll see what happens. And then almost immediately, strangely enough, after I kind of did that, almost immediately, I started to discover this tradition that we all share, this beautiful, amazing story of Christian art, which developed. If you had gone into a church in the year 1100, let's say, if you had gone to a church in Spain or a church in Syria or Constantinople or Sicily, you would have seen pretty much the same thing. Obviously, there would have been differences, you know, based on local styles or local, you know, local saints or whatever, but you would have recognized Christ, you would have known. Recognized his mother. You would have recognized several of the scenes that you were seeing, because very organically, very naturally, a whole language of visual relationships developed in the Christian story. And there was a what you can only call a universal language of Christian art, Christian imagery. And it's astounding. And so at that time, I just stumbled onto this medieval art, looking at these medieval images, and I'm seeing that. Wait a minute, this is. There's something going on here, first of all, visually, and second of all, all these images are all talking to each other. There's this pattern between the different images, and there are these. There's these, let's say, these codes. You could call it kind of a sacred algebra of imagery, of things relating to each other. So it's basically a language. And I realized, this is it. Like, this is what I've been looking for all my time in university, and this is it. This is what I want. And at first, of course, I was like, well, too bad. The Middle Ages have been finished for a long time. So I don't know. I'm not sure what to do with that. Maybe I could make contemporary art with medieval. No, that's not happening. And so that's when I discovered the icon and when I discovered Leonid Uspensky, who I talked to you about at the beginning, this Russian man who rediscovered the icon, who wrote about it, who wrote about its theology, who wrote about its history, and who painted icons also. So reading that book, following some priests who were encouraging me in that direction, I discovered the icon and I discovered Orthodoxy. And I remember when I discovered medieval art and looking through all these paintings, looking through all these objects, too, not just paintings, but obviously the reliquaries and the, you know, the jewelry, everything about it was just so beautiful. And the architecture. I thought I had the secret prayer and the secret prayer that I could make, that maybe one day I could make liturgical art. But it was very secret. I didn't tell anybody, because who makes liturgical art that doesn't happen today? I'm not going to tell you the whole story of how it happened, but slowly, that's where I ended up. And so here I am today, strangely, making sacred art as a job. So I'm going to show you some of my work and hopefully talk about it a little bit. And so when I had this strange little prayer that I had, and I kind of secretly asked God that I would be able to make liturgical art, I also had a strange list that I had. And I had all these things that, you know, if I could just make all these things, if I could make these images, if I could make a reliquary, if I can make a crozier, if I can make a. An altar, if I could, like, I had all the things, if I could make those, if I could just make one of each, that'd be amazing, you know. And so what's interesting is that I'm almost done with my list. I think there's just a few things. I haven't made an altar yet, but I'm making a crozier right now for the Catholic Archbishop of Montreal. So that's going to go off my list. I'm working on that now. And so slowly, I'm working on my list. So here, this is an image of, for those who. Who don't know iconography, this is an image of the baptism of Christ. So the image for theophany and the image for the Nativity. And so this is carved in wood, and this one is carved in stone. So one of the things that happened in this kind of revival of liturgical art is that at first it was painting. It was the painted icon, because that's the main art of the Orthodox Church. But then the second generation, or maybe the third generation, then it became carving and embroidery and mosaics and all these secondary arts, you could say, also started to revivify. So I'm like, in the third generation of. I didn't have a teacher. So in terms of icon carving, I'm the first generation. There was no, there really weren't any. The people who were doing it professionally when I started, they were also all self taught. And so it's like this. There's a new beginning, you could say. So here are a few more icons. So these both are in song. Can everybody do you know, Everybody knows what that is? Yeah. So it's an icon of Jonah and St. Michael killing the dragon. So here I wanted to bring a few more. These are more kind of, these are based more on Western types. And so there's Christ kind of represented as a Frankish king, maybe you could say. And then this is the creation scene from the church in Palermo, Sicily. So this is the mosaics that is, that is on in that church. So I also started to make miniatures. That was also part of my, my hope that I could maybe one day make some miniatures. These are pendants for priests. So just to give you an idea, that's maybe about three inches. Three inches. And that's carved those. Both those are carved in foxwood. All right, so these are, these are stone carvings that have in them semi precious stones that are inserted as well, and then some gilding to go with them. And what's interesting about these images, it kind of shows you also the way that tradition works because no one has ever made images like this. There's never been anybody who has made, you know, like let's say marble or stone carvings and semi precious stone inserts with gilding, you know, and then also some metal. That's just not. Just not something that happened. But if you look at it right, you think, right. You could think, I mean, this is the impression that I get. I think like this could be a thousand years old."}
{"episode_id":"SW - #050 - 2019-08-17 - Beauty Among the Ruins","start":2487.76,"end":2488.44,"speaker":"Jonathan Pageau","text":"You wouldn't know."}
{"episode_id":"SW - #050 - 2019-08-17 - Beauty Among the Ruins","start":2489.08,"end":4091.64,"speaker":"Jonathan Pageau","text":"But then no one has ever made that. So there's something about a traditional view, vision of the world, something about a traditional way of engaging the world which unites the present and the past together. And so there's nothing nostalgic about these images. There's nothing sentimental where I'm hoping for a time past. These images are used in churches by people, they're prayed with, they're part of people's life. They're not for museums. I don't want to make images for galleries or for museums. I refuse to do that. I want to make images for people who will use them in their prayer lives, who will give them to their priests, to their newly baptized nephew or godson. It's like that's real Art that's art that actually exists in the world, that isn't just a fetishized object of commercial exchange or prestige. So some of the things that I wanted to make, of course, also were liturgical objects. And so this is an altar cross, which was made with a good friend of mine named Andrew Gould, who's a liturgical designer, and he also designs churches in the U.S. you know, here in the North. So this. It's interesting because here in the north, where all the churches in Quebec, all our churches are becoming whatever, bars, condos, who knows? They're all being gutted, you know. But even in the south of the US that's not quite what's happening. So my friend who designs churches, that's what he does for a living. He designs churches and he builds these churches in the US he built a Catholic church, a brick basilica. He designed a brick basilica for a Catholic parish in. What is it, Columbus or Columbia? I forget. Columbus, in Greenville, South Carolina. So you can find it online. It's quite beautiful. So gospel covers, and I also had the chance to have Catholic patrons who have asked me to do some statuary. So I don't make statues for Orthodox patrons, but when I get a Catholic patron who wants me to make some statuary, I'm quite happy to do so. And so, obviously, diving into the medieval imagery, diving into the medieval aesthetic, but then also with a hint of Byzantine, let's say, flair to what I'm doing. And so this statue could never have existed. There's nothing. It's not a copy of anything. It's a traditional image that is not a copy of something. So that is the little message that I wanted to give everybody today. Hopefully it is a small message of hope. And it is also, I think it's a message to remind us that it's us. Right? It's us. We're the ones. There's no one else. There's no one else who are going to do this. If we want an awakening of beauty, if you want an awakening of. Of a remembering of all that our ancestors gave us, of all this amazing. This amazing language that was handed to us over the centuries, that's it. It's us. And all it takes is one strange Russian emigre in Paris or some lady who's a chemist in Moscow who just starts to take it seriously and to teach other people to do it. And, you know, and 30 years, 20 years later, it's a blazing fire. So hopefully that was my. Hopefully I'm bringing you a bit of hope for that. So thank you very Much. Okay, so before I start, there's a nice lady who came to see me, and she was very distraught by the fact that I spoke of Putin in a certain manner and wanted to remind me that Putin is a very ruthless politician, to which I completely agree. I do not want people to think that I approve of his methods or of his intentions. And I mostly wanted to show what had happened since the end of communism and especially contrast it to the fact that it is presented to us, as in the media, as only a political play. Whereas I do believe that there is some of that happening. But there's also these beautiful, authentic stories like the one I told you about the church in Yasu Nibo. So hopefully that is clear. All right, so some religious traditions design the architecture to accommodate their music, which is how much is the acoustics a part of determining architectural designs. Your focus is visual art, it seems. Is there also a musical revival that is influencing how churches are now designed? And so, yes, the design of churches in the Middle Ages were extremely influenced by acoustic. That's something that is being discovered even more now. In recent times, there have been some really fascinating studies that may be a little bit out there, but are fascinating to think about where people have been comparing the iconographic program of churches to the architecture. And so, for example, they had certain domes that were made in a certain manner, and then if certain tones were sung, then the sound would bounce off that particular dome and would sing to emanate out of the image. And so there's this idea that somehow that representing, like, it would represent angels or something like that. And so then this singing of the choir would resonate in a certain manner that it felt like it was coming out of the angels on the wall singing. And so this is a theory that has been proposed recently. And there's more study that is being done on the relationship between the acoustics, the architecture, and the iconographic program all working together, this kind of, you know, this kind of whole. Now, in terms of designing a church for acoustics, I have a friend, his name is Andrew Gould. I mentioned him, I think, during the presentation. And he designs Orthodox churches. He is also a choir director, a musician. And one of the things that he does is design his churches for acoustics. It is part of the way that he designs the church. And luckily, we have an entire tradition. It's not mystery. You know, the basilica structure, the apse, the dome, all of these elements of traditional church architecture are also, even though they have a powerful cosmic symbolism in terms of representing the dome of Heaven, which Sand, which is on earth. They also participate in the acoustics of the, of the church. And to the answer, is there a musical revival in the Orthodox Church? There is it? Yeah, there's a massive music revival in Georgia, Georgian chants in Russia, all over. Even in the US There are some composers who are composing new Orthodox music, who are interpreting Orthodox music. And so it's a, it's an interesting. Yeah, it's an interesting time. And for parishes, music is the first reality in an Orthodox setting. It's more important than even the icons because it's every week, it's all the time. So getting the music right, they have massive conferences in the US for choir directors for composers to come and participate in this, trying to get the music right. And what does that mean in America, in North America, which tradition are we going to follow? The Byzantine tradition with all that chanting or the Russian tradition with four part harmony? And so there's all this discussion happening right now. So how did the artistic tradition first go off the rails? And what role did neon Battista Alberti play? And so my question is, I'm not sure Alberti is the one who developed perspective, is that right? Whoever wrote this question, is that right? All right. Okay. Yeah, well, you want me to make enemies here? Okay, I do. I do think, and so many of you will not agree with me, and that is totally fine. I do believe that the artistic tradition began going off the rails in the Renaissance. I do not believe that the Renaissance was a, was at its foundation the Christian movement. I believe that at its foundation it was a revival of pagan thinking and a revival of pagan imagery, which now it doesn't mean that there weren't beautiful things that were produced at the time. And that doesn't mean that everything that comes out of the Renaissance is bad. But I do believe that that's where things started to slowly go wrong. And then you have these pendulum swings that start to appear. And so you have the Renaissance and this crazy one point perspective. And then right after you have mannerism and a kind of excessive elongation of the figure and a kind of weird expressive movement, then it goes to Romanticism, Neoclassicism. And so you have this pendulum, it swings and swings and then goes into modernism and, and from Abstract Expressionism to hardcore linear modernism. And so I think that that's sadly where it started. And you can see it. It's not just a visual also. That's the place where the traditional, this universal language of signs or this universal language of ways of representing scenes that had very powerful symbolic meaning. Started to break down as the artists wanted to show their virtuosity, wanted to show their capacity to innovate, and didn't seem to understand the structures that were there in the Middle Ages. If you look at iconography in the Middle Ages or all over the Middle Ages, the images speak to each other, the images refer to each other. And so certain signs that certain elements which appear in one image will reappear in another, and then other elements will come in this one. And so you have this discussion that's going on. So the way that it's represented is completely creates this symphony. You could call it like a visual symphony. And within the church, for example, in a church, the way that the images would be represented when they were painted was also related to the actual space. So certain images go in a certain place and other images go in another place. It's not fixed. It can vary. But there is that whole thinking of how these images talk about the space. So that's something which started to become more and more arbitrary as time went on to a point where we just forgot what these images were about and what was. Was part of them. So, yeah, all right, so if a person wanted to be part of a reviving Christian art, would there be any other root other than iconography itself? Is it really the traditional, beautiful language that can transform any medium, any type of art? Okay, so I believe there's a. I call it a hierarchy of art. I think that liturgical art is the root. That is, it's the most important art because it is the art which is made expressly in the service of God, which is made expressly to serve the sacramental life, which is meant to hold the body and blood of Christ, which is meant. So all these objects that are made by us within the liturgical life, I believe that's the highest. That's the highest form of art, because that's what's most connected to our lives. And then also pointing towards the divine within, that is also the whole liturgical life. It's not just the paintings. Right. It's also the yearly cycle of us celebrating all these different feasts of celebrating the Pentecost, of celebrating the Ascension of all of this all goes together. So that exploring that, exploring all those relationships, exploring how they represent, how they manifest themselves in the. The visual realm, in the hymnography, in also how they recast a lot of the patterns that are already in Scripture. I think that is, if you want to revive Christian art in any way, if you want to write novels, if you want to make movies, if you want to make comic books. That's where you need to go, no matter what it is you want to make. If you don't want to make liturgical art, that's fine. But you need to know those stories. You need to know your Bible. You need to know the lives of the saints. You need to know all those beautiful patterns so that when you end up writing something, you can write a story that's not at all Christian. We were talking about this yesterday. I forget who it was with. Tolkien wrote this book, Lord of the Rings. There's nothing Christian about. Doesn't talk about Jesus, doesn't talk about God, doesn't talk about anything. But then every Christian reads it and recognizes these patterns that remind them of their Christian tradition. He has integrated those patterns so deeply that he can write a fantastical novel that has no characters that you recognize, but you recognize that way more as a Christian story in parenthesis than going to see some, you know, horrible Christian movie, you know, about. I don't know, like a horrible moral tale about that, you know, that you rent. It's just bad stuff, okay? And so that's it. Like, we have all these stories. They're so powerful, and we've forgotten them. So diving into that is what I think is the key. So what do you consider to be your greatest achievement in your life? Oh, my goodness. Horrible question. Can I answer that on my deathbed? Is that okay? I mean, except for having kids and my family, I would say that would be my greatest achievement in my life. But, I mean, I don't know. That's a very odd question to ask. I think that. Let's say this in terms of. Professionally, you could say the thing that I'm the most joyful about is the fact that I can do this. You know, if you had asked me 10 years ago, do you think you could make icons and then make a living and support your family? And I would have laughed in your face because, yeah, who does that in America? Like, how is that even possible? So I think that, to me, I would say that that's the greatest blessing in my life at this time is to have this opportunity that has been kind of presented to me that I can engage in the world in this way. So. All right. Is there something symbolic in the way icons. This one has drawings on it. Very funny. Is there something symbolic in the way the icons hold their hands and especially fingers. Spaces between fingers? There's a drawing of a hand and the word space between fingers. Okay. So there is sometimes a symbolic meaning in the way that icons hold Their hands. Not always. You know, there is, obviously, if you look at an icon of Christ, often you'll see him blessing with his right hand, you know, and if you see. Often. I don't know if. I don't know if priests still do that today, but, you know, traditionally that the priest would bless with the same gesture that you would see in the icons of Christ. And so there are different. There are also different types of blessings that you see in the. In the icons. There are also. There are also. How can I say this? There are gestures of supplication in icons, too. If you see a saint who have their hands out like this, that's a gesture of supplication. If you see a saint that has their hands covered, it's a gesture of submission. So you often see that. Sometimes you see angels, they have all their hands covered, and they're kind of bowing and they're holding this cloth. So that's a gesture of submission. So there are all these little symbolisms of how hands are held. All right. And what is the deal with the big circle around the people's heads? What's the halo anyway? Okay, I can answer that. So the halo and halo is a. It's a. The glory. It's the glory of the. Of. Of the person being represented. You know, it's a. Think of it as a circle of light or it's. What's. It's the. It's a visual sign, you know, of the. That person's holiness. And it didn't. It came from pagan times. It's not a Christian invention. The Romans represented halos around the emperors to show exactly that, to show their glory. This is the. This is the emperor, and he's a glorious person. And then Christians took that, and there was some hesitation for a while where they also had it for emperors and saints, and then finally only for the saints. And so. And so today we only have halos for the saints. And so you can think of it as a. Even as a crown, maybe, you know, something akin to a crown, this round golden thing that surrounds a person's head. And in Christ's halo, we always place the cross first to identify Christ. So you make sure you don't confuse. Because obviously Christ is different from all those other people. He's not at the same level. And so to be able to recognize Christ put a cross in his halo, but also to remember, to remind us of the cross and also to remind us of this idea that he's the. He's that middle. He's in the center and the cross is around him. You can almost think of it as the four directions of space with Christ in the middle, like a church. That's a cross. And then there's the middle under the altar. You see Christ in the dome, in the middle of the church, in the middle of that cross. So it's kind of like the same idea. So how does one approach the question of relativity in the idea of beauty? How can one be sure of an objective standard by which to measure beauty? Well, beauty, like beauty, has a objective aspect and it also has a subjective aspect. Okay, let's say it this way. To the extent that we are in communion together, that subjective aspect is going to mitigate itself and move towards the objective aspect. And if we are in a society that is fragmented and is fragmenting, then the opposite will happen. We will become more and more capable of seeing the communal beauty, we could call it, or the beauty that binds us together. And we'll only be able to notice the beauty that titillates our individual passions. You could say. And so that's one answer. The second answer is that human beings are beings of pattern. That's how we exist in the world. We are pattern recognizing machines. Everything we know, everything we see, we are always seeing patterns. We see meaning. That's what we are, we are meaning creatures. And that's what makes us, in the image of God, that's what makes us different from the animals, is that we are always seeing patterns. And so the objective aspect of beauty is that the, the aspect of beauty which will be manifesting the cosmic patterns, the same types of patterns that actually appear and we can notice in nature that we can notice in these geometric patterns that we see in a flower that we see in, in that, in, in nature, a flower has a. As a pattern, we can see it and then we can extract from that the, the pure pattern, you could say, because the pat. The flower also has a chaotic aspect to it, right? It has a. Has an individual particular to it. So we could abstract that out and then we can put it up, we can make a stained glass rosas and we can say that's a flower, but that's not the same flower, right? It's a purified flower. And so it participates in the same types of patterns that we find in nature. But it is refined and we've pointed to the pattern and that's how people recognize beauty. So it's variable. It's not just one thing. There's not just one thing that's beautiful, but our capacity to engage in patterns and to see patterns and to be attracted to patterns is the objective. You could say aspect of beauty. So hopefully that helps. All right, so what would you say to a parish that is planning to build, but is experiencing tension between those who would spend more on a building and those who would rather see those funds given to the poor? So that's a. That's a. That's a. That's a real tension, you know, and it's a tension that's been there from the beginning. It's been there forever. There are homilies by St. John Chrysostom where he complains about churches that are too fancy. And he. And he says that we should be, you know, we should be giving to the poor. Then he ends the homily by saying, you know, what if there's gold in the end? Like, there's gold left over, then obviously that should be on the altar. It's like. So he doesn't totally say it's horrible, but he's saying, you know, you should. There's a story I was telling at the table relating to this. There's a story of Justinian, Emperor Justinian, who, when he built Hagia Sophia, there's this legend that he wanted to build. I think it's the actual doors of the church or the doors of the altar area, something like that. He wanted to build them out of gold, completely out of gold. And the Patriarch said, okay, you know, you can build that out of gold, but if there's only one beggar left in Constantinople after you've done that, then you'll have to answer for that on Judgment Day. And so the legend says that he just made them out of silver, so he got out of that one. But that tension is real. And, you know, being a Christian is a complicated thing. It's not easy to be a Christian, you know, we need to be attentive to the poor, as Christ asked us to, and to show love to those who need that attention. But we also are liturgical beings, and we also glorify God by our hands, by the things we do, and we also show God's glory to the world by doing that. And for some reason, you know, our ancestors, you know, in Quebec, you go up the coast of Gaspee, you go up this coast, and there are all these villages one after the other. And, you know, these villages must have had, like, I don't know, a thousand people, 500 people, who knows? But every single village has a more and more beautiful church as you go. It felt like it's almost like this competition about building Beautiful churches. So our ancestors, these poor farmers and woodsmen who. My ancestors who were on the coast of Gaspe, who barely had anything, they still wanted to build a beautiful temple for God, despite all their difficulty, despite having 14 kids, that was still one of their priorities. And so we need to do it all. That's the problem. We just need to do both. I don't know how to help the actual practical part of that, but I think we need to do both. Okay, tell me when you're tired of this, because I could just keep going here. Okay. You showed an example of icons with a modern influence. What does modern mean in art? Is it the comment on. The comment on the comment that you mentioned? So when I use the word modern, I meant it most. At the beginning of the century, there was a movement that was really a break of kind of neoclassicism and late romanticism. The reason why some artists are looking to that period is because although there was a destructive aspect to their work, there was also a desire to show spiritual aspects in their work as well. So there was this kind of desire to. To kind of call forth something spiritual in their paintings. So you have artists like Kandinsky or Mondrian and several other artists. That's what they wanted because the art had become just this strange photographic representation where we tried to represent visual reality to the best that we could. And it was this feeling that there's something missing. There's something missing. And so some iconographers have the sense that if you look at into modernism, there are little strands of things you can pick in that you can take and that you can maybe use to integrate into icons. But it has to be subtle. Those that do it in extreme way, they'll just be. They'll just be rejected. It's not. It's not going to hold. But there's that little discussion happening. I think we're probably done, huh? Everybody, Everybody, thank you so much. Thank you for coming."}
{"episode_id":"SW - #050 - 2019-08-17 - Beauty Among the Ruins","start":4097.9,"end":4153.63,"speaker":"Jonathan Pageau","text":"Thank you for listening to the Symbolic World podcast. As you know, this podcast is, for now based mostly on my YouTube videos, which I am transferring into audio format. Please go ahead and visit my YouTube channel. There are more videos there on different subjects that I'm not going to put into audio. And please share this to your friends. I know a lot of people know about the YouTube content, but not so many people know that this is also a podcast. So share it to your friends, Share it on social media. And if you can, feel free to support this financially as well by going to my Patreon page, which is Peugeot videos. Strangely, you can go there and you can support it at any amount that you want. A month for all the patrons. I do a monthly Q and A live Q and A in which people can ask questions in the chat, and I try to have a more personal connection with people. The YouTube comments have become difficult to follow and to answer. I'll see you soon."}
