{"episode_id":"SW - #036 - 2019-05-24 - The Problem with Monotheism - Santa and the Tooth Fairy Pt. 2","start":0.64,"end":65.06,"speaker":"Jonathan Pageau","text":"On this episode of the Symbolic World podcast, I start to explore some of the ideas of principalities. A lot of the notion of what principalities are, angels, demons, all these ancient ideas of beings that exist above us or that control the world to some extent or have influence on the world, is something that is very difficult for people to understand. And so, riding on the coattails of the Santa Claus and Tooth Fairy discussion that we had last time, I look at how principalities exist and how when we talk about Christianity in terms of a monotheism, in terms of having only one God, we run the risk of deluding ourselves in not understanding that although we do believe that God is one, that there are also necessarily a hierarchy of principalities which govern the world and which engage with the world. And so I hope that it is a difficult subject to talk about, especially to modern listeners, but I hopefully it will be enlightening for you."}
{"episode_id":"SW - #036 - 2019-05-24 - The Problem with Monotheism - Santa and the Tooth Fairy Pt. 2","start":65.06,"end":65.94,"speaker":"Jonathan Pageau","text":"So please enjoy."}
{"episode_id":"SW - #036 - 2019-05-24 - The Problem with Monotheism - Santa and the Tooth Fairy Pt. 2","start":79.86,"end":83.54,"speaker":"Jonathan Pageau","text":"This is Jonathan Pageau. Welcome to the Symbolic World."}
{"episode_id":"SW - #036 - 2019-05-24 - The Problem with Monotheism - Santa and the Tooth Fairy Pt. 2","start":93.6,"end":610.91,"speaker":"Jonathan Pageau","text":"So for those who haven't seen the video, the Sant and the Tooth Fairy video, I'm going to lay it out for you very quickly. The notion is that we have this idea of things that exist. And usually, especially in our very materialistic world, when people say that something exists or that something is real, what they usually mean is something that is phenomenological and can be contained. And so it's like, I know that a rock exists because here it is. I can measure it, you know, I can predict how it's going to act, you know, in a very kind of scientific way. But the problem is that there are many things. There are many things, even for the most materialistic person, that do not exist in the same way, that do not exist as much in that very immediate way, that rather exist in a different way. But even the rock itself is not as stable as you might think. But let's leave that aside from. For a second. And so the idea was that I was just explaining how obviously to say that Santa Claus doesn't exist is absurd because Santa obviously exists. You know, we know what he looks like, he appears in malls. You know, you can write to Santa, you can talk to Santa, and then Santa answers through these people that are disguised as Santa Claus. And so obviously Santa Claus exists. He just exists in a different manner. Then, you know, my pen exists or that my food exists or whatever. And so it was really interesting to see some of the reactions in the comment section. The main opposition to what I was saying was that Santa Claus exists as an idea, and so a rock exists as an actual thing. But Santa Claus exists as an idea. And I thought that that was. I understand why people would say that, but I thought it's very. It's a. It's a little problematic because, for example, the idea that a rock doesn't exist isn't. First of all, an idea is rather difficult because I would like you to tell me what exactly is the objective difference between a pebble, a rock, a boulder, and a mountain? That's not an obvious thing. That is obviously an idea which is creating those differences between those different levels of manifestation of what is essentially the same thing, or at least shares many things in common. Okay, but let's leave that aside for now. Let's talk about whether or not the idea that Santa exists only as an idea. Now, this is very problematic because Santa doesn't exist just as an idea. If he existed only as an idea, we wouldn't know what he looks like. We wouldn't know how he speaks. We wouldn't know how he answers. And then we couldn't interact with him in the world. Obviously, we can interact with Santa in the world. And so obviously, Santa Claus exists as more than idea. And it's really important to understand that because you as a person have not exactly the same structure as Santa. I explained that your structure is maybe a little more contained, but it's not as contained as you think. You know, I was pointing that out to some people in the comment section that, you know, why is it that I can interact with you through these comments in YouTube? Because obviously, if you're writing me a comment, then I am answering. That comment means that you as a person are. Are not contained to your body. You have extensions. You have manifestations of you which. Which. Which overflow your body. You know, pictures of you online. You know, through pictures of you online, I could, you know, I could see a picture. I imagine some teenage boy sees a picture of someone online, you know, and he falls in love with her. That is absolutely possible, you know, and so there are these extensions of you in. In, let's say, like I said, for example, writing messages in your. And I can answer a message that you've written that is me responding to you in a manifestation of you which is outside you. But that's not the only way. There are more ways in which your self extends out of you. Like your being can extend outside of your body. There are so many ways. One of the greatest ways is your children. You are aspects of you are being imprinted and are manifesting themselves in your children. And it's Pretty intense. Sometimes you look, you hear your child say something, and it's actually this crazy revelation. You actually see yourself in the child. Or, for example, like, I'll see my wife in my child when my child says something or acts a certain way. And all of a sudden, you know, it's like I'm seeing. I'm really seeing her through the child. And you can't. You cannot totally deny that, you know, and just for the same reason that you cannot deny that I can look at a painting of Picasso and I can say, that's a painting of Picasso, right? His being extends itself out of his body into his art. And the same way it can happen in people, your being can extend yourself out of yourself into your children. You know, for example, the leader of a group or the leader of a church, or the leader of a community, his will will extend itself out into the people that are submitted to him. In the same way for a company, right? And so we somehow we can participate in the being of someone who is above us. We become extensions of his will. If I hire a secretary, that secretary is in some manner becomes an extension of my being. You know, she participates, she somehow participates in my being to a certain extent. She's extending my capacity to act out in the world. And you can recognize me. If my secretary works well, you'll be able to recognize me in her actions. She'll learn how to write the way that I want her to write. She'll learn how to. To call people the way I want her to call. All of that is going to manifest my being out into the world. Now, it's really, really important to understand that way of seeing if you want to understand the Bible, because that is really how it is presented in the Bible. I'll give you one of the best examples, is in this notion of there's a story that Christ says that Christ tells about the rich man and Lazarus. And in this story, Christ talks about this rich man who was really selfish and wasn't helping a poor man. And then after they died, the rich man found himself in a place of suffering. And then the poor man, Lazarus, was in the bosom of Abraham. And there's a whole part of the story. You can look it up if you want. But what's important is to understand this idea that the poor man is in the bosom of Abraham. Like, how weird is that? What exactly would it mean for someone to be in the bosom of Abraham? If you don't understand the way I'm trying to explain to you this notion of ontology. It's going to be really weird for you to understand that after this person's death, he returns to the bosom of Abraham. Now, why would he return to the bosom of Abraham? Well, because he is an extension of Abraham, right? And that's how it's viewed in the Bible. And so a father has children, and those children become extensions of his being. They make his body bigger, okay? And so out of Abraham came these people. And these people extend Abraham out into the world. And Abraham becomes a principality. He becomes the head, the chief, the principality of that. What do I mean when I say principality? He is the thing that holds those people together. Abraham is the principle which holds the people of Israel together. Right? One of the principles. Obviously there are higher principles as well, but that's one of the main principles that holds the people of Israel together. And so they are extensions of Abraham."}
{"episode_id":"SW - #036 - 2019-05-24 - The Problem with Monotheism - Santa and the Tooth Fairy Pt. 2","start":610.99,"end":611.43,"speaker":"Jonathan Pageau","text":"Okay?"}
{"episode_id":"SW - #036 - 2019-05-24 - The Problem with Monotheism - Santa and the Tooth Fairy Pt. 2","start":611.43,"end":799.82,"speaker":"Jonathan Pageau","text":"And then in the Bible, you'll see, for example, in the prophecy of Abraham, Abraham, at some point he. He gives this prophecy on his sons. And then he prophesizes on each son. And you have to understand that he's not just prophesizing on the. On those sons, he's prophesizing on. He's. He's prophesying on the tribes that those son will then give birth to. And so when, for example, in the Book of Judges or even in the Book of Kings, in several books in the Bible, when they talk about the tribes of Israel, they don't talk about tribes, they just name the person. So it's like in, you know, it's like in Reuben, in, you know, and so in Reuben means that it's like the tribe of Reuben is an extension of Reuben. Right? And so Ruben has continued to manifest himself in the world, okay? And so it's really, it's. It's super important to understand that, but it's also important to understand it in your practical life, because that's what happens also in your life. If you, if you're attentive, you will see that your children become these manifestations of you to a certain extent. And sometimes, not always your, let's say, your good sides. You'll see these weird things, these weird programs that are kind of popping up in your children and that you're the cause of, but that they're not always good. Sometimes, you know, they'll actually emphasize. There'll be like a specification of a more, you know, of yourself. And so a little part of you is going to appear in your children, you know, and it could be a bad habit it can be a way that they inter. That they interact with others, which is problematic. And so. And then you'll. You'll see it and it'll be pretty. It can be pretty intense and all. And sometimes the really good things too. We'll see. You know, like, I'll look at my daughter. Then I'll see, you know, certain aspects of my wife, like a certain aspect of compassion or certain aspects of a way of interacting with her sister. Like, she'll reproduce some of the ways that. That my wife is interacting with. With her sister, okay? So all of that is actually describing how the. How the world lays itself out, okay? And seriously, I can't overemphasize how important it is to understand that, because that is also how a city works. That's how a country works, okay? And so you have these principalities, okay? You can have a principle, let's say, that is visible, like a king or a president or, you know, some leader. But then there's also. Sometimes you can actually understand that there is a spiritual principality which is above that, which is manifesting all that. So that even if the leader, if the leader goes away, then that continues to exist. It's like, why does it continue to exist? Why is it that when the king dies, the country continues? It's like, yeah, the king is dead."}
{"episode_id":"SW - #036 - 2019-05-24 - The Problem with Monotheism - Santa and the Tooth Fairy Pt. 2","start":799.82,"end":800.82,"speaker":"Jonathan Pageau","text":"Long live the king."}
{"episode_id":"SW - #036 - 2019-05-24 - The Problem with Monotheism - Santa and the Tooth Fairy Pt. 2","start":800.82,"end":913.23,"speaker":"Jonathan Pageau","text":"Because the principality of kingship, or the principality of England or France, the angel of England or France is still there, even if the king, the individual who's the king dies. Once the king is replaced, then he enters into that. That hierarchy of being by which the angel of France is still there. It's still holding. And in the Bible, there are so many places where we see that. For example, that's why Christ can in some places judge cities where he says, woe to you. It'll be horrible for you. On the Day of Judgment. He's talking about a city, you know, he says, it'll be better for Sodom and Gomorrah than your city. And so why is he able to judge a whole city, you know? Well, because cities fall under principalities. And if the principality becomes. If the principality falls, if a city that you participate in falls in, that city can be judged, you know, and the judgment can be on the city, but then it can also be on the individual. It doesn't mean that if you say something like, you know, I don't know, Chicago is corrupt. And you can say that, and it can be totally true that Chicago is corrupt. Chicago is corrupt. It's going to hell or whatever. But then it doesn't mean that every single individual in Chicago is corrupt. And you, you can make that difference in your mind, no problem, right? It's not because you say Chicago is corrupt that you think that every individual is corrupt, but you can make that corporate call, and it can be absolutely true because there is something which gathers all the multiplicity of Chicago into a unity. And when you look at that unity, when you kind of pull out and you look at that unity, you're able to see that it's corrupt."}
{"episode_id":"SW - #036 - 2019-05-24 - The Problem with Monotheism - Santa and the Tooth Fairy Pt. 2","start":913.31,"end":913.87,"speaker":"Jonathan Pageau","text":"Okay?"}
{"episode_id":"SW - #036 - 2019-05-24 - The Problem with Monotheism - Santa and the Tooth Fairy Pt. 2","start":914.11,"end":1008.4,"speaker":"Jonathan Pageau","text":"Now this point that I'm trying to make brings up a very important point, and it's something that I talked about in the August question and answer period for the. For the Patreon supporters. But I'm going to go back into it now. I'm going to try to explain it as well. Is that one of the problems that we have is this opposition between monotheism and polytheism. That is really a problematic way of seeing the world. When you see the world in terms of monotheism and polytheism, you know, when we have this idea that Christian, Jews, Muslims, we're monotheists, and then the other, you know, before, or the Hindus or all these other groups, they were polytheists and we only have one God and they have many gods, that is a very. It's not helpful to see the world that way. What people traditionally call monotheist, classical theism, you could call it. What's important in classical theism is that there is. We. We. We turn ourselves. We are. We are together and we worship, okay? We are grateful to. We are submitted to the highest possible thing, the highest possible. It's not even a being. It's the infinite, right? It is beyond being. God is beyond being. God is the infinite itself, okay? And so this notion that we can turn ourselves towards something which is above everything, which is. Which is the highest of high right, which is."}
{"episode_id":"SW - #036 - 2019-05-24 - The Problem with Monotheism - Santa and the Tooth Fairy Pt. 2","start":1008.4,"end":1008.96,"speaker":"Jonathan Pageau","text":"Which is."}
{"episode_id":"SW - #036 - 2019-05-24 - The Problem with Monotheism - Santa and the Tooth Fairy Pt. 2","start":1008.96,"end":1401.21,"speaker":"Jonathan Pageau","text":"Which is infinity itself. Not infinity in terms of time or space, but infinity even in terms of categories, right? In infinite, complete infinite, right? Beyond being, okay? So that's how we talk about God. And so then under that, we could say uncreated, right before the origin, like that's maybe a way that precedes all origins, okay? And so then after that, in the created order, in the order of things that have being in a more strict sense, then there are all these angels, right? There are all these principalities. That is, there are principles that rule over certain categories of. Of existence, okay? And so under God, we have all these Angels. This whole idea of just like that, it's me and God and I have, you know, it's a really. That's a really difficult way of seeing the world. It's very modern and it. And it's very. It's very problematic because. Creates a kind of arbitrariness about the world, which is actually not the case at all. The world is. Is not arbitrary. The world is. We talked about this so many times. The world has to be filtered through consciousness. There is no other way for the world to exist. If the world exists outside of the filter of consciousness which we engage the world with, it's like. I don't know what it is. It's a quantum field. Even when I say that it's already filtered, it's a field of possibility. It's chaos, basically. Maybe chaos is the best way to think of the world which. Which exists or doesn't exist or is there under how we engage the world with consciousness. Okay? So because of that, because that's how the world exists, the world exists through this filter of consciousness, then this consciousness, these consciousnesses, they end up stacking up. They stack up. And so just as you gather all these little personalities inside you, you gather all these personalities inside you, and then you become one. You're one thing, I can say you, Matt or Joe or Susie, you know, the way that. That works, that's also the way a city works. We've talked about this. The city joins all these multiplicities. And then there is. There is a principality that is above that. And that. You could describe that principality as a form of consciousness, you know, and then that would be something we called like an angel. An angel or a principal or whatever, okay? And so ancient world, let's say those that we call pagans, they had the same thing. They called them gods. They had all these different gods that were. That were. That ruled over different aspects of the world, you know, that manifest. That were kind of the principalities of these different aspects of reality. The difference between polytheism in quotes and monotheism, even though, like trying to tell you that's not the right way to understand that, is that these gods, they don't point towards something which transcends them. They don't point towards the highest of higher, the infinite which is beyond their principality. And so they don't end up being well submitted to the highest principle, okay? And so because of that, it causes serious problems, right? It means that certain cities, you see it in the Greek times, certain cities will be submitted to certain gods, and then These cities will end up fighting. And it's like, you can imagine that it's all these gods fighting. So the Greek cities, they were constantly fighting. They were constantly at war amongst themselves, you know. And so, and so it's not that in, in the Christian times, there wasn't. There weren't wars, obviously there were wars, but it wasn't like this constant warring. Every year, the Greeks, the wars would go out to fight with these other different cities, you know, whereas in the notion, in the Christian notion, things kind of bring together. So in the same way, in, for example, in Israel, you see that the different tribes, you know, they, they do end up fighting amongst each other. But there is this idea that, like there is this idea that's presented that there could be this unity, this thing which unites us all, which brings us together towards the highest of high, right, towards the God of Israel. But the God of Israel becomes, especially in Christianity, but I mean, even already in Judaism, is actually the God of all. It's the transcendent itself. It's the infinite itself. And so in paganism, the. The problem happens is that you end up having all these principalities that. How can I explain this, that you end up having to placate all the time. Why do you have to placate the principalities? I can explain it in a way that you can understand very easily. Always use yourself as a way to understand this, okay? Because there's an analogy, always an analogy between the way that we exist as a person and the way that, let's say, societies exist, right? There's this strict analogy, and it can help us to understand how that works. And so you yourself is the same in you. You have all these thoughts, you have all these desires, you have all these personalities, okay? You have multiple personalities inside you, okay? And you have all these crazy thoughts which don't fit together, right? You can hate someone and. And love them. Sadly, that can happen almost at the same time. You can have all these contrary things inside you that manifest themselves all at once, okay? And so ideally, what you need to be able to do is you'd be able to submit all those multiplicities to your heart, right? A good way of seeing it is to Christ in you, to the transcendent of which you are an image, right? If you can do that, then everything will lay itself out and will. Will kind of exist in the way it's supposed to exist, right? And so a good way to understand, let's say these. This idea of principalities which, which do not submit themselves to A transcendent."}
{"episode_id":"SW - #036 - 2019-05-24 - The Problem with Monotheism - Santa and the Tooth Fairy Pt. 2","start":1403.05,"end":1403.33,"speaker":"Jonathan Pageau","text":"To."}
{"episode_id":"SW - #036 - 2019-05-24 - The Problem with Monotheism - Santa and the Tooth Fairy Pt. 2","start":1403.33,"end":1543.92,"speaker":"Jonathan Pageau","text":"The transcendent is to see it the way the church father said it. So what they said when the Hellenistic world became Christian, they to say that the Greek gods were demons, fallen angels and demons, all these. This type of imagery. And that's really the best way to understand it, right? So there are all these principalities that manifest different aspects of the world, okay? And so in Christianity, we had this idea that there was a war in heaven, right? So there's this war in heaven, and some of the angels submitted themselves to the highest, and some of the angels rebelled against the highest and, and went their own way and did their own thing, okay? And so that's really the best way to understand it. You know, there are all these principalities. And the principalities which submit themselves to the highest, they end up manifesting the positive aspect of that, of that principality. And so they lay themselves out in a normal hierarchy pointing towards that infinite, okay? But those that didn't, they pull the world apart, okay? So different principalities, if they're seen as competing with each other, will pull the world apart, right? And so let's say Athens, you know, this idea of, let's say reason and democracy and the individual, right, on one side. And then you have Sparta, which was will, strength, you know, power. And then those two. If those principalities cannot be seen as both being, let's say, both being two different aspects of something which points towards something higher, what's going to happen? They're going to fight, right? They're going to fight and it's going to pull the world apart. Now, in you is the same. So this can help you understand so many things about the Christian tradition. These fallen angels, right, these demons, they become aligned with, they become representatives of your passions. And that's why we say things like the demon of gluttony, right? The demon of pride, the demon of luxury, okay? Because that's exactly how it manifests itself in you. So you, in you, you have all these desires. You have a desire to eat, you have a desire to have sex, you have a desire to protect yourself, right?"}
{"episode_id":"SW - #036 - 2019-05-24 - The Problem with Monotheism - Santa and the Tooth Fairy Pt. 2","start":1543.92,"end":1544.24,"speaker":"Jonathan Pageau","text":"To."}
{"episode_id":"SW - #036 - 2019-05-24 - The Problem with Monotheism - Santa and the Tooth Fairy Pt. 2","start":1545.19,"end":1889.61,"speaker":"Jonathan Pageau","text":"To not let yourself get killed by other people. All these desires exist in you, okay? When those desires are not united to Christ, in you, to the higher aspect of yourself, okay, Then what's going to happen is it's going to pull you apart and what are you going to have to do? You're going to have to placate those demons. And you experience this all the time, right? I always use the idea of the. The idea of the belly. The belly is really the most immediate way to understand it. You know, you have. You want to eat chocolate cake, right? And you, you know, you know, you're a little bit overweight. You know, that, that, that, you know, you don't need it. You're not really hungry. You just want to eat that piece of chocolate cake, okay? And so what do you do? This desire is pulling you, right? This principality, right? This little personality, this demon is pulling you. And it's a demon, right? It's a demon because it's not just you. It has a cosmic reality. Because I know that Joe can experience the same thing. And you know, Susie can experience the same thing, you know, because we share. This demon manifests itself in different ways. It has a coherence, okay? And so this demon of gluttony, this principality of gluttony, is pulling me to eat the chocolate cake. Now what can I do? Now I'm in attention now either if I'm able to surmount my desire and to submit it to the higher aspect of myself, right? Then I am going to make. I'm going to submit that principality. It's going to become a normal. It's not going to be ruled by the demon anymore. It'll just be normal desire. Because eating is a normal desire. There's nothing wrong with being hungry. Being hungry is a completely natural desire, right? But another way to get rid of that desire, what is it? Everybody knows what it is. To eat that chocolate cake is to placate the demon, right? So if I placate the demon, then the demon goes away for a while. But it's a dangerous game because if I placate the demon, the then I know that it's gonna come back, right? And so it's like I'm actually. I'm dealing with it right now, but I know it's gonna come back, okay? And so, guys, that's how the world works. Now think of it at the other level. Think of it at the level of a family, right? So I'm the principality, okay? I'm the principal of as a father, I'm the head of the household, right? I'm the principle of the family. And so then I have these manifestations which extend out of me, these smaller principles which are my children, right? And so those children, when they're united, when we're all united and we're actually not, they're not just looking towards me, but they're looking towards me as I'm also looking higher and trying to bring my family to virtues into Virtues and into something that's higher than me, then all of that is going to make it work. But then I can have the, let's say my child who, let's use the same example as the candy. It's like, dad, can I have some candy? Dad, can I have some candy? And it's like, I know that they don't need the candy because they've had enough and you know, it's fine. And I know that if they eat the candy, it's not good for them. And also it's gonna make them excited, it's gonna make them annoying. But it's like I have the same problem. I have the same problem. It's like I can either bring the child and it's going to be. It might be difficult, I have to bring the child into alignment, or I can placate my child and I could just give him the candy. And I know, and I know, I know that if I do that, I'm going to solve the problem for now. But what I'm going to do is I'm going to set it into a loop and it's going to come back and then I'm going to have to placate the kid again. And that's how you get spoiled children. And then those spoiled children will. What do they do? They rule. They become like demons. Sorry, not saying kids are demons, but they become like demons in the sense that they're able to then not because they're a wild principality, they end up pulling you and they're going to. They could even rule over you, right? They could even become like a, like a. Something which is not supposed to rule over you, but then will totally rule over you. And, and that you will. It'll be like an upside down world where you will be submitting yourself to your children's desires and everything you do will be there to placate their desires. You're gonna have to feed the monster. Okay? And so it's really important to kind of understand how that works. And so when I, when I. It's more important to understand this basic way that the world exists, right? And not get too caught up on the idea of Santa Claus or the Tooth fairy, though obviously Santa Claus exists and the tooth fairy exists. But it's mostly important to understand that, you know, when we talk about God and angels and demons and all and all these things, you know, it's not arbitrary. This is really how the world exists. And you can understand that that's how the world exists because it's like the language that language has been so ruined for us that we need to look closer to us. We need to look at our families, at societies, how societies lay themselves out, how we are extensions of higher beings in the terms of societies or in terms of families, because a family is a higher being than the individuals of the family. When we can kind of understand how that works, then we can start to see once again what it is that."}
{"episode_id":"SW - #036 - 2019-05-24 - The Problem with Monotheism - Santa and the Tooth Fairy Pt. 2","start":1889.69,"end":1890.09,"speaker":"Jonathan Pageau","text":"These."}
{"episode_id":"SW - #036 - 2019-05-24 - The Problem with Monotheism - Santa and the Tooth Fairy Pt. 2","start":1892.42,"end":1945.04,"speaker":"Jonathan Pageau","text":"These angels, these demons, what is it that they're referring to? And how is it that if the hierarchy of angels, which is presented in the Dionysian corpses, in the Areopagite, how that is really an example is really showing us how the world lays itself out and how the effect of understanding that consciousness is the key, consciousness is the key. Once you understand that the world exists through consciousness. And then all of a sudden this type of language is going to start to make sense to you once again. And it's not just going to be something arbitrary that you have to believe in, like you believe in some arbitrary divine being. No, that's how the world exists. Alright, guys, I will see you soon."}
{"episode_id":"SW - #036 - 2019-05-24 - The Problem with Monotheism - Santa and the Tooth Fairy Pt. 2","start":1946.4,"end":1973.04,"speaker":"Jonathan Pageau","text":"Thank you for listening to the Symbolic World podcast. As you know, this podcast is for now based mostly on my YouTube videos, which I am transferring into audio format. Please go ahead and visit my YouTube channel. There are more videos there on different subjects that I'm not going to put into audio. And please share this to your friends. I know a lot of people know about the YouTube content, but not so many people know that, that this is also a podcast. So share it to your friends, share."}
{"episode_id":"SW - #036 - 2019-05-24 - The Problem with Monotheism - Santa and the Tooth Fairy Pt. 2","start":1973.04,"end":1973.88,"speaker":"Jonathan Pageau","text":"It on social media."}
{"episode_id":"SW - #036 - 2019-05-24 - The Problem with Monotheism - Santa and the Tooth Fairy Pt. 2","start":1974.12,"end":1977.92,"speaker":"Jonathan Pageau","text":"And if you can, feel free to support this financially as well by going."}
{"episode_id":"SW - #036 - 2019-05-24 - The Problem with Monotheism - Santa and the Tooth Fairy Pt. 2","start":1977.92,"end":1980.2,"speaker":"Jonathan Pageau","text":"To my Patreon page, which is Peugeot."}
{"episode_id":"SW - #036 - 2019-05-24 - The Problem with Monotheism - Santa and the Tooth Fairy Pt. 2","start":1980.2,"end":2002.28,"speaker":"Jonathan Pageau","text":"Videos, strangely, you can go there and you can support it at any amount that you want. A month for all the patrons. I do a monthly Q and A, a live Q and A in which people can ask questions in the chat. And I try to have a more personal connection with. With people. The YouTube comments have become difficult to follow and to answer. I'll see you soon."}
