{"episode_id":"SW - #363 - 2024-11-06 - The Double Symbolism of St. Peter - Shepherd and Satan","start":0.16,"end":62.53,"speaker":"Laura Diaz","text":"Tucson, the weight is over Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight and serious risks. At mediweight loss. I got the same medication but with a customized plan, weekly check ins and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com so hello everyone."}
{"episode_id":"SW - #363 - 2024-11-06 - The Double Symbolism of St. Peter - Shepherd and Satan","start":62.85,"end":618.68,"speaker":"Jonathan Pageau","text":"Today we are going to talk about the double symbolism of St. Peter. This is of course related to my last video on symbolism, which is the video on Lucifer and the issue of how a representative, a vicar who. How someone who represents someone else who gets their authority from someone else is always in a difficult situation, a kind of dual situation where they can take that role for themselves and become the opposer or can also be a proper messenger, a proper representative and then become what we could call the vicar of that person. And so we're going to look at all that. And if you haven't watched my last video on the symbolism of Lucifer, you can do that. But I think you know, it's pretty basic and hopefully you can understand everything we're going to talk about today. So before we do that, don't forget that you know the symbolic world. We really appreciate your support. If you can, you can go to the symbolicworld.com and you can sign up. You can become a free member and participate in the community, but you can also support us financially. We are also right now we reopened the store there and we are selling in a pre sale the new book, the new fairy tale book, Jack and the Fallen Giants, which I'm extremely excited about, which as you can tell by the title, tries to allude to the manner in which the story of Jack and the Beanstalk is related to the Nephilim. But don't worry, this is definitely a story for kids, you know, and it's only all of you symbolic masters that will be able to perceive, you know, what it is that we're doing in this story and connecting it to biblical symbolism as well. This is Jonathan Pedro. Welcome to the symbolic world. We want to look at this, the symbol of St. Peter. And so in order to do so, I think the best place to start is in the text that brings the symbolism together, I think, in the most concise way. And it is of course, in the place where St. Peter recognizes Christ. Alright, so this, of course, in Matthew 16, this is where we're going to look. And so he said to them, Christ said to them, but who do you say that I am? Simon Peter answered and said, you are the Christ, the son of the living God. And So here is St. Peter being the disciple, the first disciple to recognize that Christ is the Messiah. Jesus answered and said to him, blessed are you, Simon bar Jonah, for flesh and blood has not revealed this to you, but my Father who is in heaven. And I also say to you that you are Peter. And on this rock I will build my church, and the gates of Hades shall not prevail against it. And I will give you the keys of the kingdom of heaven. And whatever you bind on earth will be bound in heaven, and whatever you loose on earth will be loosed in heaven. Then he commanded his disciples that they should tell no one that he was Jesus the Christ. And so then things get weird from that time. Jesus began to show his disciples that he must go to Jerusalem and suffer many things from the elders and chief priests and scribes and be killed and be raised the third day. Then Peter took him aside and began to rebuke him, saying, far it be from you, Lord, this shall not happen to you. But he turned and said to Peter, get behind me, Satan. You are an offense to me, for you are not mindful of the things of God, but the things of men. All right, so this is the first place where we look at the symbol of St. Peter. And you can see the entire structure of the story is represented as a kind of reflection. You can imagine it like a reflection in a mirror where two opposite scenes are presented and the terms of the scenes are presented very clearly, you know. And so at first, St. Peter recognizes Christ, and then Christ says, this isn't from you, this isn't from flesh, it's not from below, it's not from flesh. This is something that comes to you from God, you know, and then because of that, he named St. Peter the Rock on which he will build his church, you know, and this has been taken in the history of the church as this sense that St. Peter has a special position because he is the rock on which the church is founded and he's given the keys of the kingdom. You know, there are other texts where Christ gives the keys to all the disciples, but it's important to see that in this particular text he gives the keys to Peter. Peter is clearly a special person. Who is the stone on which, that's why he names him Peter, because he names it as the foundation stone on which the church will be built. And he gives him the keys to the kingdom of heaven. But the reason is because he received this from God and not from men. And so then we have right away, in the same chapter, the next scene is Christ talking about how because he is the Messiah and the incarnate, you know, the Son of God in the world, he has to die, he has to go to Jerusalem and die. And then St. Peter doesn't understand that, he doesn't understand this aspect of Christ and says, no, far be it from you, this shall not happen to you, you will not die. And then because of that, Christ says, now gives a statement which is really structured in the opposite way as the statement that was just uttered just, you know, just a few verses ago. He says, get behind me, Satan, get behind me, you opponent, you are an offense to me, for you are not mindful of the things of God, but the things of men. So he flips it. He says, before, the reason why you recognized me as the Messiah was not due to you, but it's something that came from heaven to you. And this is now why you can receive this authority, special authority in the church. But now because you are not willing to understand the humility aspect of Christianity, the self sacrificial aspect of Christianity, because you don't understand that now you are the opponent, right? So from the vicar to the opponent, from the representative to the opponent, says, and the reason is because you're not attentive to the things from above, but you are attentive to the things below, right? So it's the opposite of saying you haven't received this from flesh, but from God, okay? And so this is of course the structure of St. Peter and it's very important to understand it. It is a continuation of the symbolism of Lucifer that I presented at the outset. It is the continuation of the symbolism of the representative, I.e. someone who is given authority from above and represents that authority. That person has the keys, you know, they have the keys to make others be able to participate, just like, you know, just like any authority at their. Like a policeman, you know, has the keys of the. Of the law and is able to decide who goes to jail and who doesn't go to jail, is able to decide who gets fined and who isn't. But the policeman only has that authority from him if he respects the fact that he receives it from above. If he submits to the law, if he submits to his commanding officer, he submits to the thing above him. But if he takes that authority on himself, then he becomes an opponent, he becomes a Satan, because now he takes the power for himself and he's worried only about his own interest in the things of men. And because of that, he loses the keys to the kingdom and becomes a Satan, becomes an opponent to his own hierarchy of structure. Right? And so this is what is being presented, and it's very beautiful because it is in some ways a good way to understand all of the symbolism. But what's going to happen with St. Peter is he's going to take that route several times. In some ways, that is the route that represents him. And that is why at the outset, Christ clearly identifies him. This is the only place I think he identifies in this way. And he says, simon, son of Jonah. Hello there. This is Martin Shaw inviting you to come and join me for Christian Wonder Tales, my first online course with Symbolic World. It is a secret history of things that we're going to be exploring from the early Celtic saints and heroes of antiquity all the way up to the chivalric tradition of Arthur, Round table, Merlin, the whole thing. What do stories like that have to tell us about the mosh pit of our own modern lives? Well, over four gatherings, we're going to find out. I promise you this. It will not be Tucson."}
{"episode_id":"SW - #363 - 2024-11-06 - The Double Symbolism of St. Peter - Shepherd and Satan","start":618.68,"end":681.15,"speaker":"Laura Diaz","text":"The weight is over. Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iHeartRadio. And you can trust me, this isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks@mediweightloss. I got the same medication, but with a customized plan, weekly check ins and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way. Mediweightloss Ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com looking for your next Go."}
{"episode_id":"SW - #363 - 2024-11-06 - The Double Symbolism of St. Peter - Shepherd and Satan","start":681.15,"end":748.06,"speaker":"Announcer","text":"To Smoke Shop Stop scrolling. I've got you. Headshop.com is the number one online smoke shop already trusted by over 100,000 happy smokers just like you. They've got it all. Dab rigs, vaporizers, glass bongs, smoking pipes, even THCA flower all in one place. Need a new daily driver? Grab a smooth glass bong or a classic smoking pipe. More of a concentrate fan. Their dab rigs, E rigs and wax accessories are designed for smoother, harder hitting sessions. And yes, they've even got legal THC flower. Best part? Every order ships fast and discreet, which is why thousands of smokers keep coming back. So don't waste time time hopping between shops. Shop the best in dab rigs, vaporizers, glass bongs, smoking pipes and thca flower right now@headshop.com the number one online smoke shop headshop.com has what you need. Check it out today. Oh, and because you're listening right now, you get 10% off your next order when you use the coupon code HSHOP at checkout. Go to headshop.com now and smoke smarter. Boring."}
{"episode_id":"SW - #363 - 2024-11-06 - The Double Symbolism of St. Peter - Shepherd and Satan","start":748.94,"end":1281.15,"speaker":"Jonathan Pageau","text":"Right? And so we'll see that the story of Jonah will manifest itself in this. In this, in this structure. And so how in some ways the person who is the who receives the authority from above, receives the commission, receives something that they must do is a messenger from someone else can become the person to deny, to oppose the the one that is sending him. Because someone who's not sent cannot deny someone who is not, let's say in the hierarchy of authority of the police officers cannot betray, cannot deny, cannot oppose because they're not in the structure. And so it is conducive to people who are in a structure of authority to be able to do all of those things, right? It's only because Jonah receives a commission from God that he can deny it and he can go down to the bottom of the water. And this is in some ways the story of St. Peter, right? So before we go into some of the other stories, you know, I've mentioned several times that the image of St. Peter who walks on the water, this is a repetition of this pattern in his story, which is that St. Peter walks out on the water because Christ, you know, calls him, and he says, I want to walk with you, Christ. I want to follow you. I want to be with you. So he walks out onto the water. But then when he's on the water, he stops to look towards Christ. And now he starts to be distracted by the things of men, by the things of the flesh. He's distracted by the wind, by the waves. And because of that, he sinks, right? And this is what Jesus said would happen to him, is that if he doesn't have the right attention, he's going to become the opponent. And one of the things is, like, Jonah is going to sink to the bottom of the water. Now, in this beautiful image, of course, Christ shows that in some ways, he is renewing the story of Jonah. He's kind of showing you the final chapter of the story of Jonah, which we, you know, is that God is going to just. God takes Jonah out of the waters. And in the same way, Christ grabs Peter and is able to take him out of the water. So that's St. Peter's Ark, right, in all of his stories. And so we see the same story, of course, happening in the moment when Christ is arrested and when Christ is taken away. So St. Peter, for example, just before Christ is taken away, he's the one who brings the sword. He's the one who says he's going to follow Christ until the end, you know, that he's going to. And then when Christ says that he'll deny him, he says, no, like, I'm going to follow you to the end. You know, I'm even bringing, you know, I'll bring. I'll bring the sword. He tries to defend Christ at the moment of his arrest. But then ultimately. And then not only that, but Peter is the only one who follows Christ into his judgment, who hides and tries to see what's going on. And so, you know, he's got that kind of. He's got that thrust of the person who is the follower, the person who moves towards the higher purpose, who is, you know, you can imagine, again, the young policeman who is really keen and is really doing his job well and really wants to do the thing the best. And so because of that, he's promoted, you know, to become a higher. To have a higher place in the system. But then, of course, because of. For that exact reason, he is the one who is in danger of denying. And that's what we see, of course, in the story. So this is in Luke 22. This is St. Peter now, who's there, as Christ is being judged, and he's hiding among the people. And it says then a servant girl, seeing him as he sat in the light and looking closely at him, said, this man also was with him. But he denied it, saying, woman, I do not know him. And a little later, someone else saw him and said, you are also one of them. But Peter said, man, I am not. And after an interval, about an hour, still another insisted, saying, certainly this man also is with him, for he too is a Galilean. But Peter said, man, I do not know what you are talking about. And immediately while he was speaking, the rooster crowed and the Lord turned and looked at Peter. And Peter remembered the saying of the Lord, how he said to him, before the rooster crows, today, you will deny me three times. And he went out and wept bitterly. And so this is a beautiful image, right? In the sense that St. Peter denies Christ three times. This is, of course, related to Jonah who spent three days in the fish. It is, of course, related to Christ descending in the tomb. But in this sense, Peter is not. How can I say this? Christ is the redemption of Jonah, right? Christ plays out the story of Jonah in a redemptive way, where he transforms it. Because Jonah's story is a little trickier. You know, he descends into death on purpose in the story of Christ. And he goes down into the belly of the fish on purpose, and then he is brought back up. Now, Peter is more like Jonah himself. He really is the son of Jonah, because he denies and he goes away from the commission that Christ has given him. And therefore he is taken down into the belly of the whale three times, three days until the end of the night, when the new beginning is about to start. It's like the end, right? So he's at the end, and this is where all of this is happening. But you can see how it kind of repeats the pattern that we already saw in the story of Peter. Now, it's really important to remember this part of the story, because then the next time that St. Peter encounters Christ, after the resurrection, when Christ calls out the fishermen, this is the end of this story. It takes the story of Peter denying Christ three times, kind of Jonah going down into the bottom of the water, and now takes it and finishes the story in a very beautiful and powerful way. So we can look at it Here. All right. So John 21. This. Therefore that disciple whom Jesus loves said to Peter, it is the Lord. So he's in the boat, and he sees this character that is on the side of the water. And now it's not Peter who recognizes him first. Now it's St. John who recognizes him first. But when St. Peter heard that it was the Lord, he put out his outer garment, for he had removed it and plunged into the sea. But the other disciples came in the little boat. For they were not far from land, but about 200 cubits, dragging the net with fish. And so they're taking these fish with them. They caught this miraculous amount of fish, and they're bringing the fish up to the shore in order to participate in the meal, right? They've got all this potential from death. Now, St. Peter jumps into the water and goes down into the water, so it says. And then as soon as they had come to land, they saw a fire of coals there and fish laid on it, and bread. And Jesus said to them, come, bring the fish which you have caught. Simon Peter went up and dragged the net to land full of large fish. 153. And although there were so many, the net was not broken. Jesus said to them, come and eat breakfast. Yet none of the disciples dared ask him, who are you? Knowing that it was the Lord Jesus then came and took the bread and gave it to them, and likewise the fish. So when they had eaten breakfast, Jesus said to Simon Peter, Simon, son of Jonah. Again he says it. I thought he was the only. He says it there. Simon, son of Jonah, do you love me more than these? And he said to him, yes, Lord, you know that I love you. And then he says, feed my lambs, right? He's saying, think about what's going on here, right? So he is the son of Jonah. Now, this is the opposite. This is what makes it so crazy, is that until now, St. Peter sinks, right? He denies. He says he's going to do it. And then he gets taken down into the water. Christ tells him, the good things you have, you've received from God, and that's why you have authority. But if you now deny the humility of Christianity, then you lose that power. Then you become an opponent to me. You become a Satan to me, if you. And you care only for the things of the flesh and the things of men. And so now St Peter purposefully dived into the water, jumped in, went under, you know, assumed that humility that Christ is asking him to have from the outset of not taking that authority. Upon himself, diving into the water and then coming back out. And then when he does that, then Christ puts him back in his place."}
{"episode_id":"SW - #363 - 2024-11-06 - The Double Symbolism of St. Peter - Shepherd and Satan","start":1281.19,"end":1281.35,"speaker":"Announcer","text":"And."}
{"episode_id":"SW - #363 - 2024-11-06 - The Double Symbolism of St. Peter - Shepherd and Satan","start":1281.58,"end":2043.34,"speaker":"Jonathan Pageau","text":"And he says, feed my lamb. And then after that, he says, tend my sheep. And he does it three times, of course, with the three denials for the three days from all of that. And he says this because he's saying, do what I tell you. It's not just that. It's also that he, as a leader, has to be humble and care for the things that are his body, the things that are under his authority. But he's also saying, you are my representative. Do what I say. You do not do what you want to do. You do what I want to do. And in doing that, you will retain all your. You will get all of your authority and your power. But you are in that position. You're always in danger. You're always in danger of doing the things that you want to do and of taking that power for yourself and that authority for yourself, which is, of course, course, it is the rebellion of Adam and Eve in the garden. It's the rebellion of Satan in the Christian mythology. It's this idea, right, of trying to make a name for yourself, like the people who built Babel. And so Christ is saying, tend my sheep. Do what I say. And if you do that, then you will be what I made you. You will be the rock on which the church is founded. And then he gives a prophecy. He says, most assuredly, I say to you, when you were younger, you girded yourself and walked where you wished. But when you are old, you will stretch out your hands and another will gird you and carry you where you do not wish, so someone else will control you. And he says this, he spoke, signifying by what death he would glorify God. And when he had spoken this, he said to him, follow me. Which pretty much, that's all this is about. Now, all right, now we need to get into the important stuff. We kind of need to understand that this symbolism of St. Peter is the symbolism of St. Peter. And so this is going to be hard for more secular people to kind of get, which is that if you take upon yourself that image, if you become the Church of St. Peter and you take that upon you, then you will be subject to this pattern. This pattern will play itself out in you, the story. And then you could say it in another way, which is that Christ seemed to have known that this aspect of Christianity, this aspect of authority, will play itself out in the Church. And therefore, this is why he chose St. Peter. And this is why the story of St. Peter looks the way it does. So you can see it in both ways. You can understand that if you take on that mantle, then you will participate in the symbolism. And this is, of course, something that we have to understand about The Church of St. Peter, if we have to understand about the Church of Rome, because the church of Rome sees itself and was seen by the early church as the Church of St. Peter, as the continuation of St. Peter's ministry of St. Peter's authority. And so because of that, it necessarily has all that symbolism within it. And therefore, if you want to understand what is happening in the Roman Church and why it seems to manifest this duality than it is in the story of St. Peter that you can understand it. Right? So, I mean, think about even some of the weirder, more subtle aspects of this, you know, and so, for example, the origin of the upside down cross in Christianity is not Satan. It's not Satanism. This is ridiculous. Like, the origin of the upside down cross is the cross of St. Peter. So if you go to Rome today and you go to the Vatican or you go to churches where there is a papal represent, you know, like a kind of heraldic, papal representation, then you will see the upside down cross represented all over the place. This is a normal thing because when St. Peter died, he was crucified upside down. And this is, of course, in some ways what Christ is referring to in talking about St. Peter's death, but also talking about, how can I say this? But also seeing that St. Peter, when he was crucified upside down, he did it out of humility. He did it because he felt he was not worthy of being crucified in the same way as his Lord. And this is a beautiful image of St Peter taking on the right role, his right position. Position. But there's another way of understanding the upside down cross, and this is in the more satanic way, which is that it is an upside down version of Christianity. So you could say that St. Peter and everything about St. Peter, in the moment when it tries to take power on itself, when it tries, when it cares too much for the things of men, it has a tendency to become, you know, the opponent of God. It has a tendency to become the Satan. And this is what Christ says, like, this is what. How Christ talks about St. Peter. You know, the only person that's called Satan in the New Testament is St. Peter. That's the only place where you'll find that, you know, that appellation is St. Peter. And so he's the only person that's called that. And so you could think that. So the upside down cross is both the image of humility and of a reflection, of a reflection of Christ that is willing to be his upside down reflection through humility. But it also can be an image of inversion and an image of opposition. And this is something that will happen all through the symbolism of St. Peter. And so, I mean, a simple example is that it is not surprising, and it is not surprising that even within Catholic and Western Christian mythology, in the legends that come up in the kind of informal prophecies that appear and all of this stuff, that there is this image of the Pope of Rome becoming Antichrist because St. Peter is the Antichrist in the Gospel. He's the Antichrist in both ways that we use that term in the sense that he is the pendant of Christ. He is the one that is far away from Christ in the sense that he reflects Christ in the world. But he can also become Antichrist in the way that we more generally understand it if he takes his power and his authority for himself. And so, you know, I don't want to go too much into this, but you can just meditate on that and understand that, you know, when, for example, Christ says, when you were young, you girded yourself and walked where you wished. And he says, when you're old, you'll stretch out your hands and another will gird you and carry you where you do not wish. You can see that, of course, as a prophecy about how St. Peter will die and glorify Christ. But you can also see that as another prophecy, a bigger prophecy, which talks about the Church of St. Peter, which is that for all the reasons I've said before, you know, and in the end, at the end of the story of the church, someone else will take the power of the church and will guide it where you do not wish, will guide it where it does not want to go. And so suggesting that it is possible for the Church of St. Peter to be, let's say, dominated by other things besides its humility to God, Right? And so take all of those patterns together and understand that I am not saying, by the way, that the Roman church is not a church, or that St Peter is not the vicar of Christ, or that Christ did not say, you know, on this stone, I will build my church. A lot of people try this weird thing about interpreting the text and they try to not make it that that's what it says. You know, the early Christians, the early church understood the primacy of Peter they saw it very much so in. In the early centuries of the Church. But the reason why they saw it was because they saw that St. Peter was the shepherd that was shepherding the sheep. And that's why they recognize. But if St. Peter tries to impose himself and tries to make himself the vicar of Christ and the prince of the Church and the bishop of all the bishops, then he becomes an opponent. He becomes an opponent to Christ. You know, and this is, of course, the way the Orthodox have always in some ways understood it is that, yes, we recognize that the Pope and the Vicar of Christ and The Church of St. Peter had a primacy, but that primacy was exactly what I said. And at the moment where this character started to want to impose himself as a kind of king on all the church and wanted to take that power for himself, then that is the moment when the Orthodox Church started to identify, let's say, aspects of St. Peter that we see in the story, aspects that oppose Christ. And so hopefully this is helpful. And like I said, I want you to be very careful. I'm not saying that the Catholic Church is the church of the devil, the church of Satan. I'm not saying any of that. I believe the Pope continues to be the Bishop of Rome and continues to have a function in the biggest story, you know, and there's a mystery, you know, in the story of St. Peter, which is that it seems like this is the pattern that it was supposed to take from the outset. That in some ways The Church of St. Peter was always predicted to at some point, let's say, wander away or make. Move away from its original role, but that in the end Christ will reach down like he did when St. Peter walked on the water, like he did when he restored him after the miraculous fishing and will restore him to his role. But think about that beautiful and crazy story, the crazy story of how nonetheless, despite the fact that St. Peter had. Despite the fact that St. Peter had to some extent denied Christ. Well, not in some extent that St. Peter had denied Christ, that St. Peter had moved away from him. He still brings in all the fish. And, you know, because Christ still continues to guide him despite himself, and he still brings in all the fish before Christ fully gets him to repent and to. And to do what he's supposed to do. And so I would say that is my. It's a good way to kind of understand how subtle and complex symbolism can be and how the story that God wants to happen is going to happen despite us. And we have to be careful not to get too caught up in the short range and not to be too taken up by the fact that you things are going awry now in many instances, but that in fact, you know, the story has a happy ending and in the end Christ restores all of it. And so I hope this was helpful to help you understand to help you understand how subtle and complex symbolism can be, but also maybe give you a little bit of a perception of some of the things which seem to be happening in our world today. So I thank everybody for your time and I'll talk to you very soon. Bye bye. If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase. So go to the symbolicworld.com and thank you for your support."}
{"episode_id":"SW - #363 - 2024-11-06 - The Double Symbolism of St. Peter - Shepherd and Satan","start":2043.98,"end":2103.32,"speaker":"Laura Diaz","text":"Tucson the Weight is Over Mediweight Loss they're officially open on North Oracle Road. That's right, no more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project. Ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight and serious risks. At mediweightloss, I got the same medication but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, Medi Weight Loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today."}
{"episode_id":"SW - #363 - 2024-11-06 - The Double Symbolism of St. Peter - Shepherd and Satan","start":2103.32,"end":2172.38,"speaker":"Announcer","text":"That's mediweightloss.com looking for your next Go to Smoke Shop. Stop scrolling. I've got you. Headshop.com is the number one online smoke shop already trusted by over 100,000 happy smokers just like you. They've got it all. Dab rigs, vaporizers, glass bongs, smoking pipes, even thca flower all in one place. Need a new daily driver? Grab a smooth glass bong or a classic smoking pipe. More of a concentrate fan. Their dab rigs, e rigs and wax accessories are designed for smoother, harder hitting sessions. And yes, they've even got literally legal THC flower. Best part? Every order ships fast and discreet, which is why thousands of smokers keep coming back. So don't waste time hopping between shops. Shop the best in dab rigs, vaporizers, glass bongs, smoking pipes, and thca flower. Right now at headshop.com the number one online smoke shop, headshop.com has what you need. Check it out today. Oh, and because you're listening right now, you get 10% off your next order when you use the coupon code HSHOP at checkout. Go to headshop.com now and smoke smarter."}
