{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":11.52,"end":15.04,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the Symbolic world."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":25.93,"end":269.6,"speaker":"Fr Patrick O'Rourke","text":"Good evening. As our lovely director of this wonderful institution said previously, I am Father Patrick o', Rourke, the dean of students here at Hellenic College, Holy cross. But about 12 years ago, almost 13 now, I was Scott Patrick O', Rourke, a wayward college graduate who had just completed a postgraduate fellowship in Philadelphia and who had just moved for a summer to Charleston, South Carolina, to live and work with master craftsman and artisan Andrew Gould. Andrew. If you're unaware, Andrew designs Orthodox churches. He designs everything that goes inside of a church, from economistasis to vestments to windows. But I didn't go there to work on architectural things alone. One of the things that Andrew asked me to help with was my most recent professional endeavor, which was journalism. He asked me to come and help establish the Orthodox Arts Journal. And he told me that it would be a three person team that would start this Andrew, myself and some guy up in Canada named Jonathan. Jonathan Pajo is how I used to say it before I learned better. And so 12, almost 13 years ago, I met Jonathan through the phone. We've had many conversations, we've worked on a few different projects, and I've even helped him with some of the things that he's done recently. For those of you who are unaware of Jonathan's full trajectory, he was very much what you would call a starving artist as an icon carver. And the Orthodox Arts Journal was his first foray into expressing his thoughts and his interpretations of symbolism within the confines of ecclesiastical art, primarily in iconography. And for about five years, Jonathan did that and was well received. He went from being Jonathan Pajo, a guy in Canada that I talked to on the phone, to somebody whose thoughts and insights I deeply valued and took into myself and started to look at the world through the lenses that he was giving myself and others. He took that as a springboard to create what now everyone knows as the Symbolic World, a series that started off primarily online, which has now grown into an IRL presence in real life with a recent and very successful Symbolic World Conference. Jonathan has a wonderful way of expressing these truths that symbolism helps us digest and understand from within the church, but now outward into the world. And in that way, I think he is a wonderful paradigm for all of us to learn, to internalize and then to share outside of the confines of our own ecclesiastical environment. So I hope and I pray that tonight, through his wisdom and his words, each of us may take in some of these insights and start to form our vision of the icons of Holy Week so that we can encounter them through their symbolism, being transformed by them, then we can share those truths in symbols with the rest of the world. With no further ado, it is my joy and my honor to introduce to you a friend that I have now made after 12 years in real life, Mr. Jonathan Peugeot."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":277.6,"end":2644.84,"speaker":"Jonathan Pageau","text":"So it is. It's a great joy to be here. For several years now, I've wanted to come and visit Holy Cross Hellenic College. And so this was a great opportunity to come. I want to thank especially Dr. Timothy Petitsa, who I've become friends with over the past few years, whose thought is. I feel very, very close to mine, expressing the deep truth that we find in our tradition in a manner that can also help to heal the world through beauty and through these patterns of being. And so, on my YouTube channel, I talk about all kinds of things, but obviously, what I really love to talk about is icons and the powerful symbolism that we find in them. That's where my root is. And so, you know, if I'm going to speak at an Orthodox college, obviously I'm going to talk about icons. And so, as we have Holy Week coming towards us very soon, I thought it would be wonderful to go through the icons that we see during Holy Week as they follow the story of the Passion, of course, but also that I believe that the succession of the icons and we find in those particular icons, they reveal to us a mystery about the Passion, about the Incarnation itself, one that we also find in the hymnology as well. And it's something of the deep paradox of the Incarnation, the deep paradox of Christ, how he is both the God man, but. But also is the one who ends up horribly crucified on the cross. And so in the icons, we kind of see that. We see these extremes being put up against each other. And so we're going to go through some of the icons and look at the symbolism that is shown there. And so we're going to turn it on. There you go. All right. And so we're going to start with Palm Sunday, the entry into Jerusalem, you know, and here we really see there are different aspects of the way we represent Christ. The iconography of Christ is to represent him as an emperor, really, to represent him as this glorious character. The way that Christ is dressed in our icons, he's dressed as, like a Roman senator or, you know, a Roman nobleman. Jesus was probably not dressed that way in first century Galilee with the clavi, this sign of nobility on his cloth. But it was in some ways, as Christian art started to develop, it was a way to Signify that he was the king. He was the king of kings and the lord of lords. And so in icons like the entry into Jerusalem, this is what we're seeing. The image of the entry into Jerusalem is based on the images of the. Sorry, let me get this water. The images of the triumphal entry of emperors. So if when you look at the images of the. Of the triumphal entry of different emperors into Rome after their conquest, this is the pattern that they would have. You would see him on a horse coming in and the people greeting him as he entered into the city. Of course, it's not a stretch because that is how also how it's described in the Gospels, because that is what platform was happening. The people were. Even if in a very kind of tenuous way, it seems that they were welcoming their king and they were treating him as a king and as an emperor as he was entering into the city. This image of the. Of the entry into Jerusalem is really one of the oldest images. As soon as Christian art starts to flourish, we already have the type appear right away. So this is a 4th century image of the entry to Jerusalem on the sarcophagus of Junius Bassus. And we see that almost all the elements that we still have today in our icon of the entry, Jerusalem is there. You have Christ coming in, sitting on a donkey. You have someone climbing up in a tree that is going to cut down the branches. And then you also have a child putting his vestment under the feet of the. Of the donkey. So this is what we're seeing here. Christ is coming to the city. He is the glorious emperor. And what's interesting about this as well is that Christ is sitting on a donkey. Now, why is he on a donkey and not on a horse? There are different interpretations, but the one that I find the most interesting is actually the one that is parallel to the interpretation that is still current among Jews today. It's the one that Origen, you know, kind of teases out as he was in contact with rabbis of his time, which is that the Messiah sitting on a donkey is. He's sitting on an impure animal. And what that means is that he's actually sitting on the nation of the Gentiles. Like he's ruling the Gentiles, he's ruling the impure folks, the people that aren't us, and that ruling them, he is now coming, having conquered them, you know, into Jerusalem. And this is the interpretation that Origen takes. And it's one of the interpretations that is kept in the church fathers after him. What's fascinating about it is already in this image and already in the way that Christ is writing the foreign nations into Jerusalem. There's already the paradox of what it is that Christ is going to do and what it is that Christ is going to be. Because, you know, you often hear, you know, the more cynical, the more cynical Bible scholars who say everybody was expecting a king that would deliver. That would deliver the Jews, and what ended up happening was that he was killed and therefore the promise wasn't fulfilled. Right? That's what they were expecting. But the truth is that Jesus did conquer Rome. I mean, it took 300 years, but he did conquer Rome. And he did it in a manner that was very different from how people usually conquer cities. He did it from the inside through a type of transformation which was not a military conquest, but was a deep inner transformation that was related to what it is that Christ is going to show all during Passion Week. But what we do see in the image, of course, is this powerful image of the king that is coming into the city and is being received by the people celebrating him as the king. Now, in my opinion, one of the best ways to interpret icons is to interpret them together is not to isolate the icons and interpret them separately, but to interpret them as they relate to each other. And in the liturgical cycle, what comes after the entry into Jerusalem is the bridegroom matins. And for the service of the bridegroom matins, we bring out this icon, which is the icon of the. We call it the icon of the bridegroom, but it's based on several other icons. We'll go through them a little. But now all of a sudden, what you see is this humiliated, beaten, tortured man. And so the contrast is very strong between the emperor that comes into the city and then suddenly right away. And in some traditions, this icon will be brought out on the Sunday, on Palm Sunday, and will be put into the church right after the services that celebrate Palm Sunday. And so you have this contrast which is, here's the emperor, and then here is this beaten, tortured man. Now, again, in this icon, although it's like the opposite, you could say, of the entry to Jerusalem, just like in the entry of Jerusalem, there's this strange paradox about how it is that this king is going to end up ruling. Now, again, you see the same. He's obviously not just a tortured man, but he is a king, right? He is wearing a crown, he is holding a scepter. He is dressed in the purple. And so he is this king that has come into Jerusalem to rule. And so we see in this image the deep irony that is going to happen in Passion Week, these clashes of meaning that are going to be brought together, that we discover in our hypnography. You know, the opposites coming together is what we're seeing. And this image, it's interesting because this image is a rather late image. And there are even iconographers today that refuse to paint it because they say that it's a Western image. It's based on the Ecce Homo image that was developed in the west, where you see Christ is taken out and here is the man. But it is nonetheless, even though it's a late image, it is based on. On very early types, which we call the King of Glory, which are similar, but show Christ going down into the tomb and having the elements of the crucifixion with him. And so they wouldn't have been related at the outset with bridegroom matins, but the elements of the bridegroom icon are there. And so what's fascinating about the bridegroom icon as well is that, you know, when you look at bridegroom matins, there's an eschatological motif, right? It's the parable of the 10 virgins that have to have the oil in their lamps, and they have to be ready for the coming of the king. And there's this idea, right, of this final moment. There's this eschatological reality about it. But the icon that we use to celebrate it is this image. Here is your bridegroom, right? Here is your king. And the deep irony is present. And we'll see that go through all the icons of Holy Week. And that's the way that I want you to start to think about what happens during the Passion and what we see in the images of. Of the icons of Holy Week. The next icon that we usually encounter in Holy Week is the washing of the feet. Again, in this image, we have this strange moment where the king, right, the same king that came into Jerusalem, is now humiliating himself and making him the servant, his disciples. And we see this paradox again represented in the image I love. And, oh, by the way, some of these are my carvings. I'm not good at pointing them out. Every time you see a carving, it's one of mine. Just, I thought you could see some of the things that I do. And so here in the story, of course, of the washing of the feet and in the image of the washing of the feet, you really have. You're playing with this tension. And it's a tension that's hard to. Even in the decisions of the iconographer, it's difficult to know sometimes even how to do it. So Christ removes his garment and then washes the feet of the disciple. But in most of the traditions of this image, we also try to find some physical way to show that Christ is standing. And so in most of the images, he's standing. And they stack the disciples up, or they do. They find some way to do it so that, you know, we don't. We don't know how to deal with this problem of, you know, which one is it? You know, is he the king? Is he the humiliated one? How do we do this? Because, you know, he is the Lord of Lord, he's the King of kings, he's the Son of God, he's all these things. But now he's washing the feet. How do we signify that in the image without betraying something? Without, you know, without going too far in one way or the other? And so you see in most of the images of the. Of the washing of the feet, Christ is standing, disciples are sitting, and he is washing their feet, though he's not completely prostrating himself before the disciples. And then you see, of course, in St. Peter's face that a wonderful expression of dismay where he is completely dismayed at what is happening. You know, he cannot understand what is going on. And again, this is. This is ultimately is the mystery of Holy Week. I think that in this image, we have the entire mystery of Christian hierarchy. Like, how does Christian authority function? Because we have this problem, and we're going to see it all through the icons. We have this problem when we think of Christ, when we think of authority. How do we deal with it? We have on the one hand, the image of Christ as the one who is the King of kings and is this regal figure, but also Christ who goes to the marginalized, who helps the poor, who heals the sick, who's constantly going to the lost sheep. So how do we. How do we reconcile this in the image? And I think in this particular image, we have a powerful vision of Christian hierarchy, which is that Christ tells his disciples that he is going to wash their feet. And then the disciples don't say, well, it's about time, right? Just like, you know, it's like we were waiting for this. You know, finally he comes down from his. From his high horse. No. The disciples are dismayed and are saying, no, no, no. Like, you can't wash our feet. You know, we should be washing your feet. That's. That's how it's supposed to be. And then Christ then does the most wonderful thing ever, which is that he uses his authority to then serve them. He says, no, I'm the boss. I decide now shut up and let me wash your feet. Right? And so I think that that is one of the most powerful images of what authority in the Christian vision is, which is, on the one hand, those that are our leaders, they in love, want to serve us. But we, as those who see our leaders, we also want to serve them as well. And if we have that, if we can keep that deal going, then things go well. If they move too far in one direction or the other, then things start to. To go off track. And you see that in a family, it's like my children have to submit to me. But, you know, I'm supposed to love my children. If I. If I. If my. If I don't love my children, at some point, it's difficult to blame them from not wanting to listen to me, you know. And so that balance is a very powerful. And it's an image, I think, of everything that happens in the icons of Holy Week and in Holy Week in general. And so I want to give you. Just take a little detour and tell you about, you know, my own. So when I made this image, because I was thinking about this problem, and so I did decide to make Christ kneeling. And there are some precedents for it. You know, you can. You know, when you're making icons, if you're going to do something a little different, you really have to shake. You have to be a little in my. For me, at least, you have to be tentative and nervous about it. But I really felt like I wanted to show Christ kneeling as he washed his feet. We have examples in early, early Renaissance images of this. So this is an image by Duccio where you see Christ kneeling as he's washing the feet. And then one of the things, for example, that I wanted to do, which I hadn't, which I've seen in other images, was of course, to have Judas walking away as Christ is washing everybody's feet, and to kind of show him in side profile, which is one of the tropes that we see in icons. And so then the next image we have is an image of the Last Supper. Now again, we move in these extremes, which is, on the one hand, you have Christ who humbles himself, who comes down and serves his disciple and becomes the servant of all. And then again, he becomes, now again the head of the table. He becomes the high priest. He becomes the One who's running the show, and he's offering the meal to his disciples, and he's telling them what's going to happen. You know, he's telling even St. Peter to take a sword. He is acting as the leader again. And so you see right in the. Even in the same event, right in the same evening when they're in the upper room, that this deep paradox of Holy Week is playing itself out in the story and is then also playing itself out in the images. This image that I carved, it's one of my very first commissions. I think it's like in 2012 that I carved this. This icon. And so it was very, very early, so I made it a strict copy of a famous icon from Vatopedi that I loved, that I've loved for. You know, I'd love for a decade before that I finally was able to carve it. And I was very, very grateful this year to have the chance to see the fresco at Watopedi. You know, just kind of stood there in front of it for way too long because, yeah, the monks, they're not used to people just looking at the icon at some point, become a little nervous. Like, what is he. He's just standing there looking at the icon. But for me, it was a great joy to see it. And in this particular fresco, in some ways, it was one of those images that was the inspiration for my washing of the feet icon. Because you can see that the way that I represented Judas in this icon is almost the same as the way that I represented him in the icon of the watching of the feet. Feet with a. With a certain look, with curly hair. And then also from. On the side profile, all right. And of course, from the Holy Supper, then we come to the icon of the Crucifixion. Now, the image of the crucifixion, the entire mystery of this contradiction or this clash of extremes is in its fullest representation. You know, and we have to understand that it took quite a while for Christians to be willing to represent the crucifixion openly. You know, we do have early images of Christ on the cross from the 5th century, usually on. There's an image on the door of Santa Sabina, very schematic. And there's also an ivory. We have an ivory box from the 5th century, but it's not very. And they're struggling again with the problem. How do we do this? The first images. So here's a 6th century image of the Crucifixion from the Rubula Gospel. How do we Represent this. And people are struggling with reason to know how to represent this deep mystery that is happening. So the earliest representations of Christ, what they will do is they will show him on the cross with his eyes open and wearing a regal vestment, wearing a kind of royal vestment to cover his nakedness. And you can. You can kind of understand why they're doing that, because how do we. So what, do we just represent him naked? Is that what we're supposed to do? How do we deal with this, with this problem of the. Of the cross? Because it is. You know, we're so used to seeing crosses, we're so used to seeing crucifixes, that we forget how scandalous this image is. It is so scandalous, ultimately, what would happen. There are stories of Western Christians coming to Constantinople in, I think, like, 10th or 11th century and witnessing some of the first images where Christ is shown with his eyes closed on the cross and slumped on the cross and being scandalized, freaking out. How is it that they're doing this? Ultimately, that image would end up being the image that we represent. But we never show people's eyes closed in icons. We don't do that because it means they're dead. Like, we're showing someone who's dead on the cross. And that has. That's a very deep thing. Like, anyways, that. But on the cross and the image of the cross, we really have all of this coming together, which is that Christ in this image brings together all the stories of the Old Testament, you know, all of these extremes into one. He is the king. It says so on his. On the. On the board above his head, that he is the king. He is lifted up. You know, he's lifted up for all to see, both in glory and in shame. He is returning into the garden. And we know that he's returning into the garden because even in the icon, we'll represent him. Like I did, for example, in my version, where you see the two thieves, you see the good thief and the bad thief. And so you see Christ on the tree, discerning good and evil, right? That's what he's doing. And his nakedness is both the nakedness of the garden, but also the nakedness of shame, which comes after the fall. It's like. It's a weird clash of the. All the images together. He kind of brings it together in one. In one moment. And of course, you know, we could have. There are all these things that we could show in a crucifixion, but we have chosen mostly to show the Mother of God and St. John at his side. And why, like, why are we doing that? There are probably plenty of reasons, but one of the reason is that this is the beginning of the church. The church is being born in the moment that Christ is closing his eyes. And so the world, you know, Saint Maximus goes way further than I dare say. Maximus says Christ is creating the world on the cross, you know, and it's like. It's when. When they pierced his side and the water and the blood came out. It is the water of the Garden of Eden that is flowing from his side. It is Eve that is bursting from his side. It is all these images of the beginning that is happening in the end. You know, when Christ says, I'm the alpha, the omega, he wasn't joking. Like, it really comes together in this particular image where you see Christ elevated and humiliated all at once, you know, spreading his hands out in order to gather the entire world into himself as he is emptying himself out at the same time. And we always show. We most of the time, when we show the crucifixion, we'll show the sun and the moon in the image in mind. Is it there in the mosaic? No, it's not in mind. You'll see the sun and the moon in the Rebula Gospel, when you see it as well, if you look at the top of the image, you'll see the sun and the moon. And you can see that the early Christians knew that this was a cosmic event, that this was the center of the world, right? That the cross of Christ is the mountain, it is the pillar. It is the pillar that God was in. In Exodus. All of these images of anything that connects heaven and earth is ultimately brought together in the image of the cross. And then we show that in the icon, because what we show is the. You know, we show the. The sun and the moon above with the angels above. You know, we. When you see angels above, you always have to remember we're so used to these images, right? So we have. We have the angels above, and then below we have the skull of Adam, right? That is down below. But you could see that as the skull of Adam, of course, but you could just see it as death, as death itself. Death is down below and above you have the angels. These are the same angels that sang at his birth. They're the patterns of the music of the spheres, the patterns of the heavens. Everything that is above is there, witnessing this cosmic event which connects that world with this world below of death and is just crashing them together in one Image. But this image is mostly, of course, an image of a man being tortured on a cross. And so what will happen, I think, inevitably, is that we will ultimately lead. This will lead to the image of the anastasis, which we'll see. And those two have to be kind of held together in attention. You know, we'll look at them when we get there. Now, these images, now the images of the descent of the cross are in some ways even more scandalous than the cross itself in terms of what is going on here. Here is the God man being taken down the limp body. And ultimately this image, I think, is probably one of the most difficult ones. Once again, we never show people horizontal in icons, right? Because when we show people horizontal in icons, it means that they're dead. And we usually don't show dead people in icons. I know that sounds weird, but we usually show icons have an eschatological quality. We tend to show people alive in icons because we represent their being. And so these images are very, very paradoxical and mysterious. To show Christ, you know, lying down on. On the. On the tomb or lying down on the stone is to. Is to really show the mystery of. Of the Incarnation and ultimately what is. What it's coming. I think the only other image that we have that's similar to this is the Dormition, where we have, you know, the Mother of God lying down. I'm trying to. I'm probably going to find more as my scan in my mind would. We very rarely show people really just dead in icons. And of course, people have pointed out that this, the image, sadly, I didn't bring one, but that this image of Christ lying down on the stone as he's being wrapped and being put into the tomb is parallel to the image of the Nativity, where Christ is also wrapped already in the cave, you know, as a. As a prophecy or a promise of what the Incarnation is about. And of course, as we know, this image is going to be used during the. During the paschal, during the funeral procession, where we have this icon which is stitched on a piece of cloth, and. And then we carry it as we carry the body. Those. I mean, most people here are probably Orthodox and you know that, but that this ends up being this, the very body of Christ that is. That is cared for, that we take, that we venerate, that we bring out into the church to be venerated. And so it has a liturgical function in itself. It's not just an icon that we see on the wall like a fresco or a painting, but it Is a. Becomes the very object is part of the liturgy. It becomes the stand in for the very body of Christ that we carry out and we bring out in order to be buried and to be venerated. And this leads, of course, to the image of the anastasis. Now, I think again, this image of the anastasis shows us the same problem or the same problem of Passion Week, which is we show Christ on the cross and then we show that there is death below. Often we'll show you can see the blood of Christ that is flowing down onto the skull of Adam below. Right? And so what that's signifying is that what you're seeing on the outside here, what's secretly happening is this, which is what's visibly happening on the outside, is Christ being humiliated, being subject to death. But that secretly he is now again the great conqueror. He's now the emperor, he's now the king. And he is coming down into death as a hero, as a conqueror, as the emperor that's coming into his city in order to gather all of his and to take them out of death. And so you have this contrast again of on the one hand, the deep humiliation, but on the other hand, the conquering that is happening simultaneously. And we always have to remember that on the cross, what you see with the blood dripping on the skull of Adam is Christ going down into death to get Adam. That's what's happening on the cross already. And so we separated, of course. We have the icon of the descendant to Hades and we have the crucifixion. But those two are happening simultaneously, right? This is what is happening on the cross. The cross brings it all together. And now we separated again. But here we really have. If you look at the image of Christ, he is. He is a superhero in this image. You know, if you. If you kind of. You see him like, with often like the cape floating, if you try to imagine the scene the way it's represented, you know, he's like flying into death and grabbing people, like, you know, like just pulling them out of Hades, you know, and breaking the door open. And all of this really dramatic imagery of the conqueror of death coming in, coming into to Hades to get his. But that is ultimately all the images are playing between these two realities and how one ultimately is the reason for the other. And this is what I mean when I say that it's captured to some extent in the washing of the feet. It's captured to some extent in the image of the crown of thorns, you know, the image of the crown of thorns is. Is also to me, one of the most mysterious images in the Bible. Because the crown, the thorns are a consequence of the fall, right? So when Adam and Eve sin, God says the world, the earth will produce thorns. So they're a consequence of death. They are in some ways a reaction to death. Think about it like what thorns are. They're basically a defense mechanism. They're the plants protecting themselves from a dangerous world. And they're also the opposite of like a mountain or a point. There are many, many. They're a breakdown of points where instead of having one point, you've got all these different points that are going in all kinds of directions. They really are an image of fragmentation, of violence and all of that. But then Christ takes that and. And then makes it into his crown, you know, and it truly is a crown. It is a crown of glory. So you see that. You see this contradiction hinted at. And I think that really, that this is. I mean, really is the mystery of what Christianity offers. And it's not. When you see it, you know, once Christ offered that to the world, it's understandable that it's a complete scandal. It's a complete scandal to present this. It's like, okay, so this guy who's tortured and mocked this deep irony where we pretend he's the king, all of these. This strange. This strange giving up of himself, and then he's the king. Like, how does that work? But when you look at the image of the washing of feet, you can see that that's actually how reality works. Christ is actually exposing how the world functions. It's not like. It's not just this arbitrary thing that we have to believe just whatever, to be saved. But he is showing. He's revealing to the world how creation functions, which is that in order for someone to rule, they necessarily. In order for anything to rule, in order for it to rule properly, it necessarily has to empty itself. There's no other way for that to happen. And Christ is doing the opposite of what, obviously what Adam and Eve did in the garden, which is instead of saying mine, instead of saying, I own this, I'm in charge, I'm the one, you know, I've got divinity. I can take it. He did the very opposite. Although he was God, he emptied himself and he emptied out his presence into the world. And ultimately that's why he can be king. And it's in some ways, the only legitimate king is the one that does that. Or else we have the problem that we have all the time, which is corruption, which is Tyranny, which is all of these things. We have to deal with this as humans all the time. But we know, even in our own tradition, we know that the best bishops are always the ones that didn't want to be bishop. You know, the story of the monk that gets dragged out of the desert. We have so many of those stories in. In our tradition. And we know that that's actually how the world works. And what's amazing is in the juxtaposition of the icons of Holy Week, you seem to have this play between the two, which is, on the one hand, the glorious king, and on the other hand, the one who empties himself, who humiliates himself, who descends, who becomes the smallest. And those are played against each other all during Holy Week to try to help you see the mystery of what is happening, which is that that is actually how reality functions. So, of course, the last image of Holy Week is the myrrh bearing image. And again, you know, you have these images of. One of the things that I love about this image is how humble it is. We actually don't have a tradition of a resurrection icon in Orthodoxy. Everybody kind of knows that we have later images like 19th century images, but we don't actually have a tradition of a resurrection icon. And. And it's very fascinating because I think it, again, plays with this mystery of that which is this glorious aspect, which is hidden in the humble, which is hidden in the small, which is hidden in something which at the outset looks like the very opposite of what it is. And I think that it is captured in our icon of the Resurrection, which is. Our icon of the Resurrection isn't. You know, we could. Our icon of the Resurrection could have been the icon of Mary Magdalene, for example, seeing Christ in the garden. Although that icon kind of exists, it's not the one that's most liturgically used. This is the one that we celebrate with the Sunday of the myrrh bearing women. And it's like, that's it. That's the image. There's a weird anticlimactic aspect to it, but I think that that anticlimactic aspect is part of, again, the mystery of what the Incarnation is doing, and that our image of the Resurrection is an image of the empty tomb, is an image of Christ no longer in the tomb. And if you think about what we were shown before this image and this and this image, we can understand how this image of the empty tomb is this little sigh of relief in the end, this little. And the fact that it's the women also that are there. You know, it also has to do. I do believe it has to do with something about the secret of the resurrection, because even in Scripture, the resurrection isn't described. You know, it doesn't say, he was lying in the tomb and then he got up and he left. No, it's always described from the outside, and it's described in ways that is even contradictory."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":2644.84,"end":2645.08,"speaker":"Fr Patrick O'Rourke","text":"Right."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":2645.08,"end":2932.29,"speaker":"Jonathan Pageau","text":"You know, it's like the disciples don't recognize them. And then, you know, they don't recognize them on the road. They don't recognize them. There's this way in which they were trying to diffuse even the resurrection itself, which is the central. Our central teaching. But there's something in the Gospel that is wanted to say, hey, don't think you've got this. Like, don't think you master this. Like, you don't. You don't control this. This is something that is that you have to approach with the type of reverence and hesitation and almost fear that you see in the women in the icon of the myrrh bearing women. So what I want to propose to you is that in some ways, these two aspects that I mentioned to you, they are the key to understanding much of our iconographic tradition, which is, on the one hand, we have images in our iconographic canon which are images that represent Christ as the glorious one, that Christ as the light that is shining, that everybody is seeing. We can think of the transfiguration, we can think of the icon of baptism, Theophany. There are many images like that that represent this kind of glorious aspect of Christ. But we also have other images that seem to represent the making small or the going in. And in that, we have, of course, the icon of the Nativity. We have. Actually, the icon of Theophany has a bit of both, right, because he's naked in the water. So there's something about that that is also this kind of mystery. But you can understand these two extremes of Christ, which is both Christians in the dome of the church as the great judge, the one who comes in the end and rules over all of reality. But then at the same time, he is the innocent victim who was destroyed by authority. And that's the paradox. And that's in some ways why he can be the great king and the great judge is because he went through all the injustice of what authority is. Because we, you know, we have this problem right now in North America, in the world as well, and even in Christianity, is that we have our own. We have our Jesus. A lot of people have their Jesus. And Many people like the victim Jesus, you know, it's like the Jesus who is an unjust victim of a tyrannical, corrupt system, and the Jesus who is friends with the prostitutes, friends with the marginal people, you know, and that is definitely Jesus. And there's some people who like the other Jesus who like the, you know, he's the Logos. He's the divine Logos. He decides what's true. He decides what's real. He rules over all reality. All knees will bow. Everyone will come confess that he is the Lord. And so you have these. This tension, but the reality is that they're the same. And if with only one, you don't get the full image of Christ, and with only the other, you do not get the full image of Christ. And if you don't have them together, then you have perversions of Christianity ultimately on one side or the other. And so we have this powerful testimony of. Of Christ and even the eschatological Christ in the image of the heavenly Jerusalem. It's described that the Son of Man is ruling over the city. And there's this description of the Son of Man as the one sitting on the throne, you know, and is ruling over all of reality. But also he is also paired, you know, with the Lamb that was sacrificed before the foundation of the world. And those two are together. They are the. They're the same person. And we need to kind of. We need to keep them together, because that is. That is the testimony that Christianity offers. That is a testimony that we have for the world. And it is the only manner that we as Christians can find each other. Because even we have to be able to see in others. If one of us is the Christian that likes the King Jesus, we have to know that the Christian that likes the victim, Jesus, he's right. And the other way as well. And if we're able to do that, I do believe that we will find in the church a great solution to many of the problems that we're facing today. So thank you for your time."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":2953.49,"end":2989.34,"speaker":"Event Moderator","text":"Thank you so much, Jonathan. Now, this portion of the program is going to be a Q and A with Jonathan and Dr. Timothy Batites, who we met, mentioned earlier. He's the dean of Hellenic College and a professor of ethics, also the author of the Ethics of Beauty and co founder of Beauty first films. And maybe Dr. Tim and Jonathan can talk a little bit about how they know each other or other topics. And then after that, we'll take a few questions from the audience, but just a few to keep our spirits high. And then we'll have a nice reception outside where you can have a chance to share your thoughts afterward. So thank you all and let's continue."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":2992.14,"end":2992.82,"speaker":"Dr. Timothy Batites","text":"Fantastic."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":2992.82,"end":2994.14,"speaker":"Jonathan Pageau","text":"Well, thanks, Tim."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":2995.58,"end":3007.02,"speaker":"Dr. Timothy Batites","text":"Do you want to say more right off the bat about this idea that it's just reality, that the only one, that nothing can rule except it empties itself?"}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":3007.02,"end":3202.61,"speaker":"Jonathan Pageau","text":"Yeah, yeah. No. So this is. I mean, this is really. I didn't want to go into it too much, but it is in some ways a technical leech. True description. And this is something that I think the more that people study complexity and they study also patterns of cognitive science, they're realizing that that's actually how identity functions. That in fact, for things to exist, they always have to fit into higher participations. And this is. As Christians, it's like, oh, yeah, we know that's true, but it's not just true morally, where we know that our goods have to stack up and we have to. Let's say our goods have to participate in higher goods or else they become idols that we can worship. But that seems to be actually how reality works itself. Because a simple example, like, you know, it's like if I have a steering wheel and the steering wheel doesn't give itself to its participation in the car, then it's ridiculous. It's a fetishized object that has no purpose. And that's how all things. They always have to kind of give themselves up, empty themselves into their. Into their higher participations. And that seems to be. That seems to be actually the way that we perceive reality. And we're constantly moving as we engage with things. We're constantly moving between the particular of an experience. Like, you know, if I'm. If I'm drinking water, I have to both attend to my fingers, you know, around the thing and the right pressure and everything. But ultimately I'm also attending the fact that I'm thirsty. And ultimately I'm attending to the fact that if I don't drink some point, I'm going to die. There's a kind of hierarchy of goods that stack onto each other. And I think that this is the amazing thing about. I think what Christ is revealing on the cross. I don't want it to feel like I'm diminishing what Christ is revealing. I think, to the contrary. Christ, everything that we say morally about the cross did is true, but it also happens to be a description of how the world works. And also things also have to give themselves down. They have to give themselves up into higher participation, but they also have to kind of give themselves down in A kind of flexibility towards variability. And so I know it sounds technical, but it's like for a steering wheel to exist, it has to allow for variability of its existence. It has to allow for all kinds of steering wheels to exist. There can't just be one steering wheel that there has to be like a million possible steering wheels, you know, but they all. We all recognize them as a steering wheel, even though they're all different from each other. So identities always kind of give themselves down into their variability, but also give themselves up into participation into higher. Higher identities. And so I think that the incarnation, you know, when St. Maximus talks about the fact that we all. Everything has a logos, everything, all the logi are hidden behind all things in creation. There's a way in which right now, in these different fields, they're discovering this to be true just about our experience of the world in general. It's a fractal, right? The fractal, sure."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":3203.49,"end":3241.25,"speaker":"Dr. Timothy Batites","text":"I'm going to ask another question. We'll see if there's any relation before we get to the audience. You hinted at this, or you stated it, that at the moment that the Roman soldiers thought they were mocking Christ by he's a fake king, they actually were revealing who he really was. Does that work in our lives? Or does that work, I mean. Or does that work in the lives of saints? That a moment where they're rejected or. Because when I think of, for example, St. Nectarios, because we've seen the movie man of God, everyone's seen it. When he's rejected, how does that reveal that he's."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":3242.29,"end":3413.22,"speaker":"Jonathan Pageau","text":"Yeah, yeah. So Jesus, Jesus uses these images, you know, he talks about the idea, right, that the stone that was rejected by the builders has become the head of the corner, has become the cornerstone or the. I always think it's a keystone. That's the best way to think about it, right? It's the stone that doesn't look like the others. And then once you finish the arch, then you. Oh, that's where it goes. It just holds the whole thing together. And so you have this image of the stumbling stone and the keystone or the cornerstone. And that also seems to be a feature about reality, which is that the higher identities, like the higher things, when they peek into the world, they don't look like the flat world, they look different. And so they look like. You can see it like the pearl in the field, right? You need the whole field. And then when you buy the whole field, then you can get the pearl. But the pearl isn't like the rest of the field. The field is full of rocks. But there's more. One thing in the field that shows its allegiance to some more value. And that's the. I think that that's one of the problems that happens is that people don't recognize that because people are looking flat, their eyes are like this, and they just see the facts, but they can't recognize the one shining fact that is revealing the higher purpose of something. And so because of that, people tend to. Tend to reject it. Right? It's like the logo shines into the world, but the world does not recognize it. And that seems to be a sad fact of the fall that we struggle to be able to capture. You know, we get stuck in the mire of what we're doing and we struggle to see the purpose. So I don't want it to sound. I hate when it sounds woo when I say sounds woo. So this is something that you deal with all the time, right? Imagine you're in a job and then people get caught up in the tasks that they're doing and they forget the reason why they're doing something and they don't know, but they're dying. And they don't even know that they're dying because they're busy and they're doing all these things and they're super busy. But because they've forgotten their allegiance to a higher purpose, they're dying. So you need someone to come, a prophet, even in your business, like a little profit. Not a profit from God, but like a prophet from the purpose of the company to come in and say, hey, wake up, folks. You're supposed to be doing this for this reason. You're not just doing a bunch of stuff like there's a reason, you know, but sometimes people hate that. They hate it because it's annoying. Because I'm busy and I'm doing all these things. Why are you bothering me with this, the up and down stuff, you know, and so, you know, what Jesus described is something that we. There are things that we deal with all the time."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":3414.1,"end":3419.74,"speaker":"Dr. Timothy Batites","text":"I thought that would be a great T shirt. People are dying, but they don't know they're dying because they're busy."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":3419.74,"end":3420.5,"speaker":"Orthodox Priest","text":"They're busy."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":3423.7,"end":3428.86,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah. And you see that, you know that that's definitely something that's happening."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":3428.86,"end":3432.18,"speaker":"Dr. Timothy Batites","text":"You definitely get some looks as you went through the theme park or wherever you're dying."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":3433.45,"end":3433.93,"speaker":"Jonathan Pageau","text":"That's true."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":3435.69,"end":3447.13,"speaker":"Dr. Timothy Batites","text":"So that sounds a little bit like the Ugly duckling, right? Like the reason the duckling is ugly because it's a swan. Sorry if I gave that Away to anyone who doesn't know the story. Spoiler alert."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":3447.85,"end":3448.49,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":3450.01,"end":3469.51,"speaker":"Dr. Timothy Batites","text":"But I recall a story of a Romanian abbess who was absolutely loved and regarded as holy and would disappear one day a week. And someone. Someone followed her to another part of Bucharest where a very sort of rundown place where she sat in a gutter and people would just spit on her or something and say, what's that?"}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":3469.51,"end":3469.79,"speaker":"Jonathan Pageau","text":"About?"}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":3470.83,"end":3472.43,"speaker":"Dr. Timothy Batites","text":"What was going on in her psychology?"}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":3473.07,"end":3497.76,"speaker":"Jonathan Pageau","text":"No, the thing is that we have to be careful. So you see it in the image of Christ. In the image of Christ, you see the both. Christ always showing the both. It's like when. When Christ comes in Jerusalem, people love him, people recognize him, people see him as the king. And so sometimes that happens. Like, we have saints that don't. That are just saints, and everybody sees it, and they don't get persecuted, and they don't get, you know, and then."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":3497.76,"end":3498.92,"speaker":"Dr. Timothy Batites","text":"That'S my kind of saint."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":3499.08,"end":3531.69,"speaker":"Jonathan Pageau","text":"That's what I want to be. I want to be that saint. I want to recognize his whole life, like St. John Chrysostom. People just, you know, loved him. And I mean, obviously he did get killed by the emperor, but it's like people loved him, and people recognize them in people. So you have. Both of those stories are possible. And I think in the story of Jesus, you have an aspect which shows you people seeing the king and recognizing the glorious one, and then also people being blind to them and being caught up in their passions and in their own distraction and then not seeing him."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":3534.09,"end":3542.02,"speaker":"Dr. Timothy Batites","text":"And that story, by the way, it seemed like the nuns then sort of rejected the abbess on that basis. Like, at least mentally for a moment. Like, what is she? What is this? Yeah."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":3543.86,"end":3614.05,"speaker":"Jonathan Pageau","text":"Like, why is it that saints tend to take the contempt, like, to take that on? I mean, they're definitely. They seem to be acting like Jesus, you know, and that there seem. We do seem to have the capacity to participate in what Jesus did. I hate to say it, because I don't want to do it, that. But they seem to be able to take people's sins, and in taking them and forgiving them, they are healing the world somehow. And you see that. I mean, you see all these crazy stories of, you know, of abbots, you know, or, you know, abbots of going and confessing sins to the novice. But it's there. It's the sin of the novice, and then the novice is hearing his own sin being confessed by the abbot, and he's taking the sin of the. And you hear all these stories of saints who take the blame for other monks and stuff. So it seems to be part of reality. It's kind of scary, though, because, like I said, I really don't want to do that. It's like, when I see it, I'm like, oh, that's amazing. But that's rough."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":3617.18,"end":3624.06,"speaker":"Dr. Timothy Batites","text":"Should we go to the audience for questions now? Because I don't. I think they want. They want to come to you directly, and I'll."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":3625.1,"end":3739.42,"speaker":"Jonathan Pageau","text":"So does anybody. Does anybody have a question? I think there are two mics going through. So it sounded like you said that the resurrection in the iconography and the. In the scripture, it's not, like, directly portrayed often. But to me, it seems like, at least in the hypnography, it's very direct, you know, it's very explicit, you know. You know, the hypnography of Pascha, of course. You know how many times we say Christ has risen? Of course Christ is risen. Yeah, of course Christ has risen. Yeah. So can you talk about, like, why in the hypnography, it's like, so. So direct when the other. In the iconography. No, what I mean is that the resurrection itself is not portrayed. And so we. Of course, Christ is risen. And of course, he does appear to the disciples and ultimately reveals himself completely, fully where they all recognize him. But there seems to be something left of a mystery in the mechanism. It doesn't want to simplify the fact of it. Like, it doesn't. In scripture, it doesn't say, you know, knocked on the door. I don't know, like, what he could say, like, that he opened the. That he opened the tomb and he walked out. Or you see some Jesus movies that do that. It's not good. Like, there are some Jesus movies, they actually show him, like, in the tomb and then, like, sitting up. It's like, ooh, bad stuff. That's bad stuff, you know, and so. Yeah, and I think. I mean, I can't completely explain why that is, but there seems to be. Be. There seems to be something about the resurrection that is meant to be kept mysterious. Not that it didn't happen, but that it's not. Can be reduced to a phenomena that we can. That we can reproduce. Let's say that we could analyze and put it in a laboratory and say, here's how the Resurrection works. Thank you."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":3739.42,"end":3740.18,"speaker":"Orthodox Priest","text":"That makes sense."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":3742.98,"end":3744.02,"speaker":"Jonathan Pageau","text":"Thank you, Jonathan."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":3745.87,"end":3746.47,"speaker":"Orthodox Priest","text":"Great to see you again."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":3746.47,"end":3747.71,"speaker":"Jonathan Pageau","text":"It's good to see you, Father. Yes."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":3748.75,"end":3825.89,"speaker":"Orthodox Priest","text":"I think you gave the answer in your talk, and you were trying to keep that tension between the two. In other words, is he the king? Is he, the humiliated one. And I think the reason the Church doesn't show. And when you say resurrection, you may mean his resurrection coming out of the tomb. And I think there's a good reason for that. And the reason is exactly what you showed us, because there's a danger of that becoming a form of historianism. Why? Because when you see the resurrection, you don't have the other image that you showed. In other words, the humiliate humiliation. Because the whole thing is that it needs to be. That's why the earliest icons of the resurrection were the crucifixion, like the Rabula depictions, where you have the crucified and risen one. In other words, the danger is to, like you said, if you get rid of that balance, you have heresy. The danger is to say, okay, he's divine and human, and the human part died, and then the divine part by itself rose up. Of course he rose because he's God."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":3825.89,"end":3826.41,"speaker":"Jonathan Pageau","text":"He's God."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":3826.41,"end":3846.65,"speaker":"Orthodox Priest","text":"But then, first of all, you're dividing him into two people, in a sense. But also the Church, I believe, sees there's a danger there because then it doesn't matter to us. In other words, that's his thing. It's not our resurrection. And the resurrection icon that finally came about basically is our resurrection."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":3846.65,"end":3847.09,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":3847.09,"end":3892.15,"speaker":"Orthodox Priest","text":"So because you said the eschatological aspect is always there, and that's very important, because art historians want to always look from a Western point of view, a Renaissance point of view. Oh, it must be a picture, must be a depiction of something in the past. And therefore they say, because you never see that, it always is anastasis. Anastasis means resurrection. And resurrection is a physical resurrection. And he's not alone in the Orthodox icon, whereas the Westerners will have the banner and he's all by himself. But that's not described in the Gospels for good reason. And you have earlier, before the final anasis icon developed. You have. Besides the empty tomb that you showed, you have other depictions of basically an empty tomb, like a house."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":3892.15,"end":3892.51,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":3892.51,"end":3922.05,"speaker":"Orthodox Priest","text":"Maybe you've seen it. The old marbles of that. Again, you don't have Christ by himself resurrecting, because that can be misconstrued as, oh, of course, he's God. And that's. That doesn't affect me. So in a sense, it's the danger of that separation of the one mystery. Because our theology starts from, as your icon so beautifully showed, he is the crucified and risen one in. In one action, you know, traveling upon death by death."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":3922.05,"end":3922.41,"speaker":"Fr Patrick O'Rourke","text":"Yeah."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":3922.41,"end":3924.17,"speaker":"Orthodox Priest","text":"And that's why all your icons showed both."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":3924.17,"end":3924.61,"speaker":"Unregistered: Roman History Scholar","text":"Yeah."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":3924.86,"end":4006.33,"speaker":"Orthodox Priest","text":"And once you separate that, then you have a problem because then it becomes something that is made superficial in the sense that you lose that radical newness. Well, Western, I'm not pointing fingers, but it's a theological statement. When you don't have this in the Pascha, the Easter just passed. Did you know that it happened? I mean, in a sense, you see bunny rabbits, you see chocolate. But is it an existential event? It's not. Because if you have Christ coming out of the tomb, then in a sense it's his thing. See, I got back at you guys. I'm God, of course, and I rose. But that other side, the humiliation side is not there. So I think that's what the church is always keeping those two things together. And the earliest celebration of Pascha was a one night vigil where all these things were celebrated together. You know, the crucifixion, the death and the resurrection. And that's why we say trampling upon death by death. And Pascha means suffering. Pascha also means resurrection. And that's why all your icons showed that whole mystery being always depicted together, words held together. And you made that point. And I think that's the answer to the question. Really?"}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4007.13,"end":4028.27,"speaker":"Jonathan Pageau","text":"That's a great insight. And I love the idea that the Anastasis icon is our resurrection, because when you look at images of the Last Judgment, you see like when Christ picks up Adam and Eve, he's bringing them to the Last Judgment and you see them in the icon of Last Judgment kneeling before the prepared throne. It's like, that's it. It is already our resurrection. Resurrection."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4028.27,"end":4032.07,"speaker":"Orthodox Priest","text":"You've seen the depiction. I think it's Torcello or Porch, one of the near Venice."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4032.07,"end":4032.39,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4032.39,"end":4032.67,"speaker":"Orthodox Priest","text":"Where."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4032.75,"end":4034.19,"speaker":"Jonathan Pageau","text":"Yeah, I did a whole talk on that."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4034.19,"end":4034.55,"speaker":"Dr. Timothy Batites","text":"Yeah."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4034.55,"end":4060.2,"speaker":"Orthodox Priest","text":"And on top is the resurrection. So it, it's the end times. Yeah, it's all. And plus, you're never going to see that emblem. You know, it doesn't exist. It's a nascar. Resurrection means a resurrection. And he's pulling them, you know, you're an artist. He's pulling them behind the wrist. It's physical. They're heavy. In other words, it's a physical resurrection because then we spiritualize it and then becomes chocolate and money rabbits."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4065.72,"end":4066.2,"speaker":"Dr. Timothy Batites","text":"Hello."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4066.36,"end":4130.44,"speaker":"Unregistered: Orthodox Student","text":"Thank you for coming today. It was a very compelling talk to kind of bounce off what you said earlier and to continue, Father's point of splitting the Christ, the image of Christ as being the king and the servant. And that kind of sparked to mind, like how sometimes in Catholicism they overemphasize the servant part with, like, for example, Francis of Assisi and the over exaggeration of, like, the imagery of the suffering. And then also with, like, bringing to the Protestants the overemesis of the king, the judge, the one that rules everybody. And it seems like an Orthodoxy. It's like, I always bring it. They bring it together. They have the two in unity. I feel like that's kind of a theme in, like, the other, the other faith, like, nominations is like the Catholics and the Protestants kind of take one thing from Orthodoxy, but they don't have the complete truth. It's like a form of historianism. They split them. And I was wondering your thoughts on that."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4131.01,"end":4182.37,"speaker":"Jonathan Pageau","text":"Well, I would say it depends. Like, Orthodoxy has had a tendency to focus on the imperial aspect, especially when Byzantine Empire was quite strong. The image of Christ as emperor was more prominent in the east and the cross was less prominent. And so I do believe that in the theology and in the mystery, we do have that. That joining together. But we're not. The orthodox are not immune from excess. Sadly, we wish we were, but, you know, the Holy Spirit does the work over the long term and kind of brings things together ultimately. But there are moments when we have tended to emphasize the imperial aspect of Christ quite, quite a lot. Oh."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4182.53,"end":4184.09,"speaker":"Biblical Hebrew Scholar","text":"Oh, hi."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4184.09,"end":4184.45,"speaker":"Jonathan Pageau","text":"Hello."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4184.45,"end":4262.49,"speaker":"Biblical Hebrew Scholar","text":"Thank you so much for your speech. One of my question is kind of relating to that, but if we take the Hebrew, the biblical Hebrew and bring the Hebraic emphasis onto this. So, for example, the word gospel comes from basar, and basar literally means flesh. So the word gospel is tied to this Hebrew idea already that is existing in the Old Testament. So the fleshiness of God, the blood, the water, the thorns, all the imageries that you mentioned from the Old Testament, maybe now that we have a chance to have concordances in the way that the fathers and some of the iconographers did not have a chance to. So if we reread the Passion Week, but using the Septuagint, but referring back again, again and again to the Hebrew words, because that's the foundation of whatever is happening in the New Testament. So do you think icons and our perception or what, we're being scandalized about seeing too much of the fleshiness? Maybe. Or maybe we're ignoring the imperial side too much. What do you think bringing the Hebraic direct Hebrew words onto the Passion narrative, how that would affect iconography? Thank you."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4262.89,"end":4318.64,"speaker":"Jonathan Pageau","text":"Yeah. Well, I believe that we do have the. I think that we do have that tradition in the Church. I mean, through the Syrian Fathers, we have this whole Hebraic thought that fed into the orthodox world, you know, and if you read Saint Ephrem and you read Saint Isaac, you see that they're deeply thinking in Hebraic terms. So I think it's there in the church I'm always worried about. Our gospel is written in Greek. And so I'm always worried about attempts to want to then too simply speculate about what it's translating in Hebrew. It's not completely useless, but I'm always careful because, you know, it's. It is a bit. It is a bit speculative. And I would tend to take, you know, I have a great love of Saint Ephrem."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4318.64,"end":4318.88,"speaker":"Fr Patrick O'Rourke","text":"He's."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4318.88,"end":4331.88,"speaker":"Jonathan Pageau","text":"He's obviously one of my, my great go to people. And so that's how I tend to do it, you know, and, and see, you know, but I'm not, you know, I'm not against the idea, but I would say it had to be done cautiously, you know."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4334.28,"end":4337.25,"speaker":"Unregistered: Roman History Scholar","text":"Yeah, thanks for the great talk."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4338.29,"end":4339.01,"speaker":"Jonathan Pageau","text":"Yeah, sorry."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4339.25,"end":4348.81,"speaker":"Unregistered: Roman History Scholar","text":"Yes. So you started your talk by. Talk by saying that Jesus came to conquer the Roman Empire. And then you had my attention because obviously I'm interested in the Roman Empire."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4348.81,"end":4349.49,"speaker":"Jonathan Pageau","text":"Yeah, of course."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4350.21,"end":4411.72,"speaker":"Unregistered: Roman History Scholar","text":"Yeah, exactly. But I also, throughout the talk, I tried to look at the images as somebody living in the first, second, third century. And of course, these icons didn't exist, but the mental images existed and were circulating. So I thought that the images themselves are very controversial. Right. Because you have this Roman Empire that portrays emperors and warriors as godlike. And then you have somebody, Jesus, that is exactly the opposite. And we had also earlier somebody brought it up, and you also that many people prefer the humiliating Jesus. So I was asking myself, and I want your take on this. Did he conquer Rome as a king or as somebody who is humiliated?"}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4412.04,"end":4538.91,"speaker":"Jonathan Pageau","text":"No, he did both. I mean, it was both at the same time. You know, when St. Paul, it's so crazy to read, you know, for example, to know that these texts were written, you know, hundreds of years before rome became Christian. St. Paul, I forget in which passage he says, he says right now he is ascending. He is conquering the principalities. He's saying, like Christ, you don't see it, but Christ, right now, he's conquering the world. He's actually going up the hierarchy. He's subjugating all these principalities to himself. All of these kingdoms are being submitted to him. And you don't see it, but it's happening. And then ultimately, a few hundred years later, the fruits appear. And we have to remember that the Image of the kingly, like the Son of man. Image is not, not just in Revelation, right? It's there all through the prophetic literature. But the mystery of Christ is to join the image of the suffering servant. And all of this image of the lowly descriptions of the Messiah in Scripture. So like Joseph, so Joseph gets cast out into Egypt. He persecuted his wise brothers, He Shakespeare, you know, his brothers want to kill him. All of this stuff is going on. You know, he's end up being a prisoner in a foreign land. All of this is happening. That's an image of the Messiah, okay? And then it's like, oh, then there's also this David figure who is like, he's the. He plans the temple. He's the ruling king. He's this great conquering hero. It's like, that's also an image of the Messiah. And it's like, okay, well, how do you fit those two together? You know, and that's. That's one of the mysteries of Christ, is that he shatters that. You know, he brings it all together into one opposite with these two opposites together. And so I do, I believe that Christ, you know, that Christ conquered the Roman Emperor both as a servant and as a king, just like he did in his, just as he was in his own life."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4541.07,"end":4557.52,"speaker":"Dr. Timothy Batites","text":"The images of one sows and another reaps. Although in this case, Christ is the sower and three centuries later, the reaper. I think we have time for one or two more questions, so I can't. Wherever. You're doing a great job, microphone people, keep it up."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4557.84,"end":4559.24,"speaker":"Unregistered: Orthodox Student","text":"Thank you, Jonathan, for being here."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4559.24,"end":4560.72,"speaker":"Jonathan Pageau","text":"We all look forward to it, and."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4560.8,"end":4563.04,"speaker":"Unregistered: Orthodox Student","text":"We hope to see you back very soon again."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4565.12,"end":4566.68,"speaker":"Jonathan Pageau","text":"I wanted to see if you would."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4566.68,"end":4574.21,"speaker":"Unregistered: Orthodox Student","text":"Comment on the bridegroom icon, specifically the image of the reed and the icon."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4574.21,"end":4575.29,"speaker":"Jonathan Pageau","text":"So I know we have the other."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4575.29,"end":4589.57,"speaker":"Unregistered: Orthodox Student","text":"Prophecy in Isaiah about bruised reed he shall not break. But is there anything specifically about the reed and the scepter and the properties of those two things that make them fit for that icon?"}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4590.45,"end":4620.07,"speaker":"Jonathan Pageau","text":"Yeah, I never thought about it enough. I don't think I have. There's definitely something there. There's definitely something. There has to be an analogy between the crown of thorns and the kingly crown and the reed and the scepter. There has to be an analogy there, but I don't. I'm afraid that I don't completely see it. But I'm onto it now, so I'm going to think about it. But there has. There has to be because it's so, so striking, you know."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4620.79,"end":4624.11,"speaker":"Dr. Timothy Batites","text":"Do you have to footnote that question when you write it out. Yeah, I put it back."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4624.11,"end":4625.35,"speaker":"Jonathan Pageau","text":"I just put it back in there."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4627.19,"end":4627.67,"speaker":"Dr. Timothy Batites","text":"Yeah."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4627.67,"end":4630.15,"speaker":"Orthodox Priest","text":"So I was noticing when you were talking about."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4630.15,"end":4630.75,"speaker":"Dr. Timothy Batites","text":"Sorry. Right away."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4630.75,"end":4631.19,"speaker":"Jonathan Pageau","text":"Sorry."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4632.87,"end":4637.39,"speaker":"Orthodox Priest","text":"When you mentioned earlier about Christ emptying."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4637.39,"end":4642.95,"speaker":"Jonathan Pageau","text":"Himself and how that makes him the only legitimate king, it occurred to me."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4642.95,"end":4646.2,"speaker":"Orthodox Priest","text":"That that has a lot of parallels."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4646.2,"end":4650.76,"speaker":"Jonathan Pageau","text":"I don't know how familiar you are with Daoism, but there's a number of parallels there."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4650.76,"end":4654.96,"speaker":"Orthodox Priest","text":"I was just hoping maybe you would talk a little bit about some of."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4654.96,"end":4787.62,"speaker":"Jonathan Pageau","text":"Those parallels and kind of reconciling that continuity. Yeah, I don't know Daoism enough to be able to make that comparison. I know that there's a wonderful book on Christ and the Dao that has been written, and C.S. lewis seemed to have seen also a very strong relationship between the Logos and the Dao. And so it is definitely quite possible that the Taoist had an intuition about. I mean, the thing about. Once you realize that Christ, that the divine Logos created the world, it's not shocking to realize that people would have had intuitions about that before he came, because that's actually how the world works. And so if there were people that were pure of heart, if there were people that were, you know, not taken up by their passions, then they would have had intuitions about the same things that we teach. To me, that's not surprising. It's that, you know, it's this whole idea of Justin martyrs, you know, know Logos primaticos, like this idea of the. Of Christ hidden in the world and hidden in reality because he is the source, he's upholding the world. And so to me, the idea that the Taoists or that other traditions would have. Would have captured some element of the Logos and how that works is not only is it not surprising, but it just seems like completely inevitable, you know, and that's why, like, you know, we have this idea of people, of Christianity imposing itself. And sometimes it has, but many, many times it didn't. It basically was like a last key to the puzzle of other people's traditions. There are even many aboriginal, you know, native tribes. When they heard the story of Jesus, you're like, oh, yeah, of course that. That fits. It's like it ties everything together. You know, we have these traditions, and then it's like, here's the key. You know, the Gallic people converted like that. We don't like right away. They just converted. And so I think that that's. Yeah, that's true."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4789.22,"end":4804.67,"speaker":"Dr. Timothy Batites","text":"I feel like there's one more person who's going to just burst if they don't ask that final question. So who is that person? Is it someone down there? Maybe in the white sweater there someone over here? And this is the final one because."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4805.71,"end":4807.39,"speaker":"Event Moderator","text":"Hi, thank you for your talk."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4807.63,"end":4809.07,"speaker":"Jonathan Pageau","text":"Nice to see you up there."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4809.31,"end":4830.84,"speaker":"Event Moderator","text":"So I just have a general question as an expert. If you could explain the relationship between iconography and for the individual in terms of meaning, and what would you advise someone new to knowing Christ, Is there a specific image that. That you would suggest looking at or anything that you've known to be really impactful?"}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4831.32,"end":4870.47,"speaker":"Jonathan Pageau","text":"Well, the icon of Christ is the central image. Everything is in that image. It's just the icon of Christ who's there, blessing with his right hand, he holds a book in his left hand. All of iconography is gathered into that image. People. People often ask me, like, I'd like to commission one icon. Which one should it be? It's like, that's. If you're going to just commission one icon, that's the icon you should commission. Because you can have an icon corner with a thousand icons, or you can have an icon corner with the icon of Christ. If you have the icon of Christ, it's all gathered into that one image. So that's what I would suggest."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4872.47,"end":4882.49,"speaker":"Dr. Timothy Batites","text":"Well, very sadly and reluctantly, we've got a wrap up for tonight. Jonathan, thank you very much for coming. I don't know if you have one last word you want to say or."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4884.01,"end":4907.57,"speaker":"Jonathan Pageau","text":"I want to thank. Thank you. Thank Holy Cross for coming. You know, it's been great. I was able to come with my wife and my daughter, and, you know, you all received them wonderfully, beautifully. I was really happy to see, you know, my family making relationships and even my daughter, you know, talking to students and all that. That's been, to me, that's been a great joy. So I'm happy to have been able to come. Thank you."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4908.05,"end":4909.57,"speaker":"Dr. Timothy Batites","text":"Thank you very much for coming, everyone."}
{"episode_id":"SW - #340 - 2024-05-17 - The Icons of Holy Week","start":4910.05,"end":4910.61,"speaker":"Jonathan Pageau","text":"Good night."}
