{"episode_id":"SW - #131 - 2020-12-22 - Tom Holland - Discussing Dominion","start":12.56,"end":91.5,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. Hello, everybody. I am here with Tom Holland. Tom Holland is a novelist, an author, historical author. He has written several books and his latest book, called Dominion, looks at the intellectual impact and moral impact of Christianity on the west and how it shaped the way the west saw itself and how it saw morality and its own identity. I finished reading the book a few weeks ago and I was very impressed. Several people kept pointing me towards the book and said, you have to read Dominion. You have to read Dominion. Because it fell within this strange post, secular, or I would say people who are questioning the way that secular society has viewed itself in the past few years. And so it felt like his book fell right into there. And so I'm really excited to have this discussion with him and to explore a little bit about his idea of what this means for. For the world today. And so, Tom, thank you for accepting to do this. I thought maybe I could start. Maybe you can tell me a little bit, just to start for people who don't know about you, what the impetus for writing this book, particular book was."}
{"episode_id":"SW - #131 - 2020-12-22 - Tom Holland - Discussing Dominion","start":93.02,"end":336.47,"speaker":"Tom Holland","text":"Well, thanks very much for having me. I guess this is a book that had been kind of brewing in my mind for maybe a couple of decades, really about. So in end of. Right at the end of the 1990s, I began writing history aimed at a popular market in the period that I'm particularly interested in, which is the classical Roman in particular. So I wrote a book about the fall of the Roman Republic, and then I wrote a book about the Greco Persian wars, so Marathon, Thermopylae, Salamis and so on. And this had always. These had always been the kind of periods that I'd loved as a child. And I'd kind of identified with the Greeks, I'd identified with the Romans in the Greek context. I'd always really identified with their gods. But the process of writing these books and having to really get inside the heads of these very alien people brought home to me just how far removed I was as someone living in the late 20th century, early 21st century, from. From pretty much everything they took for granted. And in the introduction, you kind of mentioned the moral side, the ethical side, but I think in a sense it kind of went even deeper than that. It was pretty much every aspect of classical society seemed increasingly weird. And I guess things that might seem familiar, they were kind of false friends. They kind of deluded you into thinking that just because the Romans had dinner parties or enjoyed public entertainments or kind of worried about their property, somehow they were like us. Actually, they weren't at all. And lots of things that I kind of lazily assumed were pretty sex, family, how you view society, I came to realize weren't, you know, these were not at all how people in the pre Christian world had understood things. And it was as fundamental as the problems that I had writing about them, that using the English language, I began to realize that there were so many words that were just freighted with all kinds of significations, all kinds of meanings that would have meant nothing to the Romans, nothing to the Greeks. And the more I thought about it, the more I came to realize that what was stopping me from thinking, feeling a sense of commonality with the Romans, was basically Christianity. That Christianity was like a kind of great cloud of incense that had gusted up. And although I could see through the incense clouds, I could kind of make out the shape of Roman history. It was almost impossible to get rid of this. This incense cloud. And in a way, it kind of distorted what I was seeing. And so that was something that I felt writing about the classical world over two decades now. And then also I wrote a book about the origins of Islam. So I had to kind of really immerse myself in the Islamic world in the way that Islam has kind of calibrated how it understands reality. And again, that served to sharpen for me just how deeply Christian my assumptions were. And so I wrote Dominion, basically to put that thesis to the test, see how, you know, how far back can I trace what I take for granted as a Westerner in the early 21st century? How far back do they go? And if I trace these leads back, where do they end up? And almost invariably it ended up, I thought, with Christianity. And so that's. I wrote the book not 100% certain that this thesis would turn out to be okay, but I'm just relieved that actually, pretty much it did. I mean, the process of writing it confirmed me in my kind of gut. What had been a gut instinct, it seems to me."}
{"episode_id":"SW - #131 - 2020-12-22 - Tom Holland - Discussing Dominion","start":336.47,"end":403.85,"speaker":"Jonathan Pageau","text":"I mean, this is something that I've also been thinking about for decades as well. I would call it the Enlightenment overlay of the classical world, or kind of like the influence of Edward Gibbon, especially on the way we understand Christianity and the way we understand the ancient world and the Renaissance as well. These kind of moments in Christian history, or these moments in Western history where people have tried to revive the classics, they've always done it in a way that ended up putting a Christian veneer on those classics and ended up putting a Christian veneer on there. Even though they used ancient society or this notion of the Greek city or Roman Empire as a way to criticize the contemporary world, they nonetheless were doing it through Christian eyes, and they couldn't help it. And seems like today, with postmodernism, One of the great effects of postmodernism is that because it's breaking down grand narratives, it's actually helping us see more clearly those things. Like, we have a capacity to look, let's say, at the classical world, look at it for what it is, rather than be blind at our own presuppositions as much as we did, let's say, 50 or 60 years ago."}
{"episode_id":"SW - #131 - 2020-12-22 - Tom Holland - Discussing Dominion","start":404.17,"end":611.59,"speaker":"Tom Holland","text":"Yeah, I think it's. I mean, in almost in all kinds of ways, when we look back at the classical world, we're looking at it through Christian lenses, and that's kind of obvious, you know, if you're talking about Aristotle or the idea of. Well, let's say democracy would be an example that I'm thinking about a great deal at the moment, oddly, because I'm writing a children's book. I'm writing a book for young adults, which is a history of ancient Greece. And the gimmick in this is that the gods are real, so they actually exist. And the legends that the Athenians tell about themselves are true. So the Athenians thought that they were sprung from the soil, they were autochthonous. They believed that they had to pay respect to the gods or else the city would fall to pieces. They felt that they had a particular relationship with the goddess Athena, obviously. And in a sense, there was this kind of matrix of they're born from the soil, the gods look after them. So you've got earth and you've got heaven. And democracy is an attempt to give form to that. And we translate it as people, power. But actually, demos doesn't really mean people in that sense. Demos is the kind of totality of people who live within Attica, who've been shaped by this power, kind of autochthonous origin, and who are the favorites of Athena. And so in that sense, it includes women as well as men. The role of men is to fight and to debate in the assembly, but the role of women is to tend the temples to, and in particular to kind of relate to, say, Demeter at the great shrine of Eleusis, and particularly to mediate with Athena. And if you look at democracy through contemporary eyes, secularize, then that idea seems ridiculous because we think of something called religion, which is separate to the important things that the men are doing. So what the women are doing is kind of mad stuff that you shove in a corner, maybe give a couple of paragraphs in a book, but otherwise don't think about. But if you kind of. It's about rewilding ancient Greece, if you bring the gods back, then suddenly this seems incredibly important. And you understand that the way that we understand democracy as being about rights, as being about rights that individuals have, that this is wholly alien to the way the Greeks understood it. But we think of democracy in that terms because we've been Christianized, because our understanding of democracy is about essentially the idea that every voter in a state has value by virtue of, of. Well, of what I mean, kind of essentially ideas of rights. The Greeks had no sense of rights at all. That wasn't what they were about. And so what we mean by democracy and what the Athenians meant by democracy is completely different. And we cannot really even imagine what it's like to live in a state where Athena is real. Because those gods have been banished so completely by Christianity that in that sense we are their heirs. We're so the heirs of Christianity that we don't even realize what it is that we're seeing when we look back at the pre Christian world of democracy."}
{"episode_id":"SW - #131 - 2020-12-22 - Tom Holland - Discussing Dominion","start":611.59,"end":686.66,"speaker":"Jonathan Pageau","text":"Yes, but there are new gods on the horizon right now. It seems as we look around we can see as Christianity is waning. And I think that we, like you said, we can't avoid the Christian overlay. But within that waning, we can see these new gods kind of pop up and they have a Christian veneer to them. You know, like the social justice God has a strange Christian taste to it. But there's something else going on which is. I'm not sure exactly what it is. There's also something in your text which I really appreciated. I think that the chapter that I appreciated the most were the modern chapters or the modern. When they start, when we start at the Enlightenment, because we have. The Enlightenment narrative is such an important part of the way that we're trained in school because. Because the training of our mind also has a. There's a reason why they train them the way they do. And as you talk about the Enlightenment and then at the end of the Enlightenment you talk about the Van DY massacre and then you bring in Sade, the Marquis de Sade at the end. There's this idea that as the Christian veneer starts to fade, there's also something else. There's a promise of something else on the horizon which is coming and is not necessarily what you, what you might expect."}
{"episode_id":"SW - #131 - 2020-12-22 - Tom Holland - Discussing Dominion","start":687.22,"end":851.06,"speaker":"Tom Holland","text":"Well, the Marquis de Sade is a kind of the great satirist of the Enlightenment and of the pretensions of the French Revolution, because Sardre kind of properly recognizes what it is to reject Christianity. And his contempt for Christianity foreshadows Nietzsche's, which is kind of similarly blistering that both Sard and Nietzsche are able to identify in the classical world the kind of will to power, the contempt for the weak, the kind of adoration of the strong. There was a kind of very, you know, a vital part of the way that classical culture did kind of understand the world and which we tend to shrink from. And part of what the Enlightenment was doing was kind of riffing on a kind of a Christian idea that idols have to be toppled and superstition has to be banished, which, of course, goes back ultimately to the Hebrew prophets. I mean, that's kind of a constant idea. And the early Christian missionaries in early medieval Europe are literally kind of toppling idols. They're chopping down trees, they're soaring them up and turning them into chapels. And the Protestant Reformation is riffing on the same theme, only it's now taking the Roman Church as the kind of sump of idolatry that has to be drained. And the Enlightenment is doing exactly the same, but it's now turning its fire on the whole edifice of Christianity. And so it needs something that it can look back to that precedes Christianity. And so it enshrines Athenian democracy, the Roman Republic, Greek philosophy, as the kind of model of an enlightened society that enlightened people in the 18th century should probably try and return to. But Sard is a kind of sardonic commentator on that because, you know, he lives through the French Revolution. I mean, he's literally. I mean, he's in the Bastille a couple of days before they stormed the Bastille. And Saad recognizes that this is an illusion, that there's nothing rational. You know, the idea that by kind of overthrowing churches and guillotining kings, you're somehow going back to an enlightened is folly. And it's a kind of devastating. I mean, that's why he's such a dark figure, I think. Yeah. Kind of terrifying."}
{"episode_id":"SW - #131 - 2020-12-22 - Tom Holland - Discussing Dominion","start":851.94,"end":932.52,"speaker":"Jonathan Pageau","text":"One of the. Let's say, one of my theories in the past few years that I've been trying to bring about is that Christianity is really a union of opposites. It's a union of. In the Christian idea of Christ as the union of God and man. There's this whole idea that he unifies these extremes into himself. The cross itself is both this image of a man being murdered as a criminal, but with a sign at the top of his head saying that he's the king. So it's always this union of opposites. And my theory has been that the modern world, or the modern movement away from Christianity has been a kind of the incarnation. And we are seeing the opposites pull apart. And so one of the opposites would be sad and the will to power rising up and this kind of. This idea of absolute power that comes down from above and just imposes. But the other is the other, let's say, parody of that which is the. The reign of the weak or the weak that wants justice for themselves. And so the Communists, you can see it in the opposite of the Nazis and the Communists. It's an easy way to understand it where one, it is absolute order, cutting off anything marginal that doesn't fit, just burning it off. And the other is taking all the marginal stuff and raising it up to the highest ground. And so I don't know if you've ever thought about it in those terms."}
{"episode_id":"SW - #131 - 2020-12-22 - Tom Holland - Discussing Dominion","start":932.84,"end":1217.96,"speaker":"Tom Holland","text":"Well, I think about it in a slightly different term because I. I think that the French Revolution and then the Russian Revolution and the kind of ripples out from Marx are very much going with the grain of Christian tradition. Because actually, what's radical about the crucifixion isn't the torture. It's the fact that the tortured person triumphs over the torturer. It's the idea that the slave actually turns out to be the king. That, you know, the first will be last and the last shall be first. That is what's really paradoxical, that's what's really novel. Because there's no great paradox in the idea that the strong are strong. The paradox lies in the fact that it's the weak who are strong. And that's what the French Revolution plays with. That's what the Russian Revolution play with. And even though they famously, notoriously reject institutional Christianity, they actually do it for very Christian reasons. The French Revolutionaries see the Church as an overweening, powerful institution that has kept the poor downtrodden. So likewise did the Bolsheviks in the Russian Revolution to a degree. Now, in the past summer, people who are pushing social justice causes are targeting churches and the statues of missionaries and so on, because they see them as being hegemonic, as being kind of, I don't know, heteronormative and sexist and whatever white supremacist and embodiment of what is first that has to become Last, I think that the Nazis, the fascists, let's say the fascists more properly. So looking at Mussolini before Hitler, the fascists are consciously obsessed by the pre classical world in a kind of Sardian sense. They worship its strength, its glory. They're not interested in the weak, the downtrodden, the poor. And they look to the future. They look to a supposedly, you know, post Christian world where it will all be, well, go away. Oh yeah, it'll be kind of airplanes and steel and, you know, I mean, kind of highways and the trains are run on time and all that kind of stuff. And it's a fusion of the pre Christian and the supposedly post Christian. Now of course there are Christian elements within fascism. Hitler and Mussolini were both Catholic. They were both very clearly drew on the kind of the mastery of spectacle that the Catholic Church embodied. The strain of anti Semitism in Nazis in particularly clearly drawing on the great inheritance of Christianity, anti Semitism, which has been a kind of stain right, right, right from the beginning, and the apocalyptic strain, the, the idea of a thousand year Reich, that also is part of the mix. But I think that just reflects the way in which even the Nazis find it impossible completely to get, to get rid of the Christian inheritance because to a degree that no one has done since the time of Constantine, the Nazis do succeed in rejecting not just institutional Christianity, but the entire framework of values and ethics that Christians and post Christians have upheld, of which the two major ones are precisely the idea that the first shall be last and the last shall be first. The Nazis do not believe that. The Nazis do not believe that weakness is a source of strength. They see weakness as a source of weakness and therefore to be crushed and eliminated. And the Nazis repudiate the idea which the French revolutionaries with their, their proclamation of universal values, universal rights, and the Communists with their proclamation of the universal dictatorship of the proletariat, both uphold the idea that there is a kind of commonality of human experience. The Nazis decisively reject that. They repudiate the Pauline idea that there is no Jew or Greek. Absolutely. Jews and Greeks are completely different and that's what provides them with the license to, to launch genocide. And I think that there's a sense in which the shock that that delivered to the west was so profound that now in a sense, although we remain deeply Christian, we remain Christian because we're horrified by the Nazi distortion of Christianity rather than because we're obedient to what Christianity actually teaches. So we are, we get our Christian morals and ethics from our revulsion at the Nazis. Who rejected it."}
{"episode_id":"SW - #131 - 2020-12-22 - Tom Holland - Discussing Dominion","start":1217.96,"end":1355.6,"speaker":"Jonathan Pageau","text":"Yeah, I think that I agree with most of what you're saying. I think that the only place. And I saw this when I was reading the book, there was a little. There were these little places where I wanted to push back on your thesis a little bit. And it started right away at the beginning when you mentioned that St. Paul talks about, of course, this. This passage that you mentioned that there is no Jew or Greek, there is no man or woman. But then there are other texts where St. Paul talks about a natural hierarchy between man and woman, for example, and I remember the way you phrase it was that he doesn't dare to go to the end of his own. Of his own thinking, let's say, he doesn't want to push it to the end. And I think that for me, that is the place where I'm not sure that I agree in the sense that, like I said, I see even in the story of Christ, for example, there's a reason why Christ is shown as entering Jerusalem in glory before he's crucified, that he's hailed as king and then he's crucified as a criminal. Right. Those two images are there to kind of act as this joining of opposites. So the cross is there. Yes, as this idea that the last is the first and the weak, that there's a joining of these opposites. But there's also the moment right before where he's hailed as the king and coming into the city. And we see that all through, in my vision, when we see that all through Christianity, where, for example, Christianity never does create, at least at the beginning, doesn't create a social revolution. The Christians martyrs die and they die and they die, and then the emperor converts. And now, then you find this strange balance. And you see the balance happen over and over. You know, the Germans and the northerners come in, they kill, they kill, they kill, then they convert, and then they become knights and they integrate the hierarchy, where at least the ideal of the night is to use power and authority to protect the weak. So then you have this balance of this idea that, yes, we have an hierarchy, yes, we have power, yes, we have even empire. But the purpose of empire is to protect the weak. And so it's not the weak. It's not the same as the weak take rising up and taking power. That I don't see. I don't see neither in the Christian story nor in the early church or the early martyrs or. And I see that you frame it like, for example, you frame the Gregorian reforms that kind of like that."}
{"episode_id":"SW - #131 - 2020-12-22 - Tom Holland - Discussing Dominion","start":1356.48,"end":1367.4,"speaker":"Tom Holland","text":"Well, I mean, clearly Christ's crucifixion, you know, Christ's death on the cross would be meaningless if he were not the king."}
{"episode_id":"SW - #131 - 2020-12-22 - Tom Holland - Discussing Dominion","start":1367.4,"end":1367.84,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #131 - 2020-12-22 - Tom Holland - Discussing Dominion","start":1368.4,"end":1370.52,"speaker":"Tom Holland","text":"I mean, otherwise it's nothing."}
{"episode_id":"SW - #131 - 2020-12-22 - Tom Holland - Discussing Dominion","start":1370.52,"end":1372.56,"speaker":"Jonathan Pageau","text":"And Paul just a guy dying on a cross."}
{"episode_id":"SW - #131 - 2020-12-22 - Tom Holland - Discussing Dominion","start":1373.13,"end":1627.77,"speaker":"Tom Holland","text":"Unless Christ is risen, then what we believe is folly. It's nonsense. It has no hope at all. So it is fundamental to Christ's mission that he is indeed God as well as man. Otherwise there's nothing there. So, yes, absolutely. And I completely agree that Paul is not interested in preaching social revolution. That's not what he's about. And I think that he's not absolutely certain what he is about. And I mean that, you know, that coming from other way, you know, I suppose, particularly Jewish and Muslim, the immense bodies of law, you know, whether it's the Talmud or the Sunnah or whatever. What's really striking about Paul is, is that his letters are not meant to be prescriptive like that. They are, in a sense, dramatic monologues. They are quite close to, say, Cicero's speeches. When he's writing to the Galatians, you sense what the other guy might say, as you do when you read a Cicero speech, you only get Cicero's. But what you also get with Paul is the sense that he's thinking aloud. So in that sense, that it's a kind of dramatic monologue. And you constantly feel, why I found so powerful about it. He is wrestling with something that he cannot put into words. He's struggling to compute what it means. And my guess is that whether he has a vision on the road to Damascus or not, I mean, I don't know whether we can trust that account in Acts as being a historical record. But something like that clearly does happen. He clearly does have some overwhelming experience in which he comes to realize that this crucified criminal is in some way God. And I can only assume that he comes to that conclusion because he has the revelation. And then he has to think, well, what's going on here? I mean, how. Whoa. And then he's a highly literate man, steeped in the scriptures of his people. And so he goes through and he reads the Scriptures. And it's reading the Scriptures that gives him the kind of sense of what's gone on. He interprets the Scriptures retrospectively through his experience. And so he then has to try and formulate what this means. And the letters seem to me an attempt to try and explain that, and that's why they are so incredibly fertile for future generations, is that, in a sense, Paul himself isn't entirely clear what it is that he's trying to say, but because they are kind of marinated in the incredible richness of the Jewish scriptural tradition. And also, of course, the fact that Paul is someone moving around the Roman world, this globalized world, and he has a working knowledge of. He writes in Greek, he knows about Stoicism. All of this is a kind of blends together to create this incredible. Well, I mean, I kind of think of it as a depth charge that goes off underneath the fabric of the Roman world, and it ripples outwards in ways that perhaps Paul would find completely shocking. And so that thing, you know, there's no Greek or Jew, no man or woman, no slave or free, which seems so fundamental to the way that we in the west now think and organize ourselves morally, ethically, societally. Of course, the key phrase in that is in Christ Jesus. You know, it's not a manifesto for social revolution, but. But the potential is there."}
{"episode_id":"SW - #131 - 2020-12-22 - Tom Holland - Discussing Dominion","start":1628.65,"end":1629.81,"speaker":"Jonathan Pageau","text":"Yeah, you can see."}
{"episode_id":"SW - #131 - 2020-12-22 - Tom Holland - Discussing Dominion","start":1629.81,"end":1691.99,"speaker":"Tom Holland","text":"And those ripples go spilling out and spilling out and spilling out. Or it's an acorn, you know, it's a tiny acorn from which this great oak would grow and part. Again, part of the power of Christianity is that it lends itself so prodigiously to metaphor, to parable. I mean, that's the other great thing. It's. I hope I don't just focus on Paul, because there's also the parables, the power of those parables to effect change. And in a way, they are even more influential. So the last chapter, you know, I begin with the migration crisis in Europe, where you have Angela Merkel saying, yeah, okay, come on in. And Viktor Orban saying, no, don't come in. You're a bunch of Muslims. We're defending Christian Europe. Let's put up the barbed wire fence. Merkel is clearly inspired by the. By the parable of the Samaritan. You know, the whole of this transformative, convulsive episode that had such an impact on Europe is ultimately due to a short story."}
{"episode_id":"SW - #131 - 2020-12-22 - Tom Holland - Discussing Dominion","start":1692.95,"end":1753.89,"speaker":"Jonathan Pageau","text":"Interesting. One of the questions I really wanted to pose to you, I have two questions left, I guess, is have you thought a little bit about this idea of this death of Christianity and this breakdown? Or we can see the influences of Christianity kind of spreading out and what I see as becoming opposites. Have you thought about the image of Antichrist that is given in Christianity both in St. Paul and you see it in the Gospels, obviously in Revelation, the idea that somehow the breakdown of Christianity is part of the story, that Christianity itself sets itself up to die, that it's going to die. And there's something that's going to. There's a mechanism within the very pattern which is going to upend it and going to destroy it. Or scandal is going to happen, as Christ said. Right. Scandal needs to happen, but woe to those by whom it happens. And so I was wondering if you had thought a little bit about that pattern in your thinking."}
{"episode_id":"SW - #131 - 2020-12-22 - Tom Holland - Discussing Dominion","start":1754.85,"end":1825.06,"speaker":"Tom Holland","text":"Well, okay, so two responses to that. One is the story of Antichrist, which then of course bleeds into revelation. So Antichrist first appears in, in Paul's letters, but then it bleeds into revelation and becomes a kind of entire mythology of the future, which is incredible and continues to be incredibly powerful. But it's something that I think that certainly in, in the West, Christians have become embarrassed about, and the whole kind of supernatural superstructure of angels and devils and heaven and hell has become a kind of thing of mockery. So the viral video of Trump's spiritual advisor summoning angels from Africa, I mean, people just found it, you know, hilarious. And I think that that's a problem for institutional Christianity. If all this stuff is seen as being, you know, essentially risible and even, you know, I don't know what, you know, bishops here in England, I mean, they'd rather steal from a poor box and talk about angels, I think, or devils."}
{"episode_id":"SW - #131 - 2020-12-22 - Tom Holland - Discussing Dominion","start":1825.06,"end":1825.98,"speaker":"Jonathan Pageau","text":"I mean, it's all, you know."}
{"episode_id":"SW - #131 - 2020-12-22 - Tom Holland - Discussing Dominion","start":1826.62,"end":1905.71,"speaker":"Tom Holland","text":"But I think that that is, you know, that is a crucial part of it. And I think that that's one of the reasons why the church is growing so explosively in Africa, is perhaps, you know, that dimension of spirits, of angels and devils seems much closer or why Pentecostalism is by miles the fastest growing expression of Christianity globally is because there, people do take spirits, they do take it, you know, seriously, and they kind of open themselves up to it. So I think that in a way that, you know, the Antichrist, the devil, or, you know, it's such a crucial part of the Christian story, but in a way, it's the part of it that's hardest for me to get to, to get, to get back at. I can kind of look at it as, you know, rather, you know, in a way, it's a source of great frustration to me because the power of it is so incredible. And you just have to go through Christian history and realize how, I mean, it just kind of changes, kind of everything. All is endlessly coming back. Yeah, endlessly compulsive. You know, the great thing in the Reformation is it's one of the things that joins, you know, it's the truly ecumenical thing, is both sides thinking the other are Antichrist."}
{"episode_id":"SW - #131 - 2020-12-22 - Tom Holland - Discussing Dominion","start":1905.71,"end":2068.4,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah. I think that there are keys to recapturing that. I guess I would say part of my work, part of a large part of my work has helped people recapture it in a way that is. That fits within even modern categories. And it's really. I think that going back and also understanding kind of what you see in the church Fathers, if you look at the right church fathers, Saint Maximus or Saint Gregor of Nyssa, the more intellectual fathers, you could say you find keys in there to help you deal with the problem of angels. And it has to do with the notion of intelligences and pattern and the idea that there are pattern beings above us. We know there are because cities are pattern beings above us. They. They have a pattern, and we can recognize them as existing. We can say London exists, even though it's a million of details, and you can still see that it exists. And so it has an intelligence. It has something like, I can write to London and London will answer me, right? I can write to my city and it'll answer me. I can complain to the city, and the city will answer me. And the person who's writing the letter is not the person answering me. Really. They're just a tool of the. Of the city. And so we get. As we start, as we. As we. If we're able to perceive that there are. There are patterns which exist above just material reality. And those patterns stack up from a person to a family, to a community, to. To a city, et cetera, et cetera, then the idea that, let's say the angel of New York can fall, and then that's it. New York's going to go down, right? If its spirit falls, then it's over. But we are able to recognize its spirit, right? Because I can recognize a New Yorker, even if I'm in Canada, I can recognize someone from Chicago. There are ways to recognize people who belong to corporate bodies that are higher than an individual, and those become ways to recapture. And especially with the new science of consciousness, like these new ideas that the inevitability of consciousness for reality to appear to us, right? The categories go through our intelligence. It's harder and harder to ignore that. Then we can notice these corporate beings. Of course, we can't do it like you said, exactly, yet in the same way that ancient people can, because we're so materialist that it's hard for us to encounter it. But there's a subtle capacity to encounter corporate beings. Like I said, you can you can still. You can write to Santa Claus and Santa Claus will answer you. You can write to all kinds of corporate beings and they answer. But I."}
{"episode_id":"SW - #131 - 2020-12-22 - Tom Holland - Discussing Dominion","start":2069.84,"end":2150.04,"speaker":"Tom Holland","text":"One of the. One of the chapters that I ended up not writing, basically because I know you're Orthodox, aren't you? Yeah. So I decided I couldn't. I wasn't going to go into orthodox Christianity because it was just too huge topic. If I had done. If I had done done orthodox Christianity as well, then I would have linked Dostoevsky and Nietzsche. And the obvious parable in Dostoevsky is the parable of the Grand Inquisitor in Brothers Karamazov. And I think that what that touches on is Dostoevsky's sense that there is perhaps something within Latin Christianity that has kind of inevitably moved towards atheism, that there's a progress within everything that has made Latin Christianity so dynamic and so incapable of staying still. That has ultimately kind of inevitably led to Atheism, has inevitably led to, you know, Christ returns and the Grand Inquisitor locks him up. You know, angels are irradiated, devils are banished. We get rid of everything and we end up with Auschwitz."}
{"episode_id":"SW - #131 - 2020-12-22 - Tom Holland - Discussing Dominion","start":2150.36,"end":2151.56,"speaker":"Jonathan Pageau","text":"Yeah. With a cold world."}
{"episode_id":"SW - #131 - 2020-12-22 - Tom Holland - Discussing Dominion","start":2152.84,"end":2172.97,"speaker":"Tom Holland","text":"That Europe's experience of modernity is in a way shadowed by Western Christendom's suicide. There are dimensions, you know, and it's not just Western. You know, there's something within Christianity that leads to its own inevitable termination."}
{"episode_id":"SW - #131 - 2020-12-22 - Tom Holland - Discussing Dominion","start":2173.37,"end":2217.11,"speaker":"Jonathan Pageau","text":"I think it does. Well, I think there's a resurrection, but I do think that it leads. I think there's something. There's a Christ set up, a pattern that was going to lead to personal death and then corporate death. And it was just. It's a fractal pattern that is repeating itself. And so to me, I don't like it, but I'm not surprised that it's happening because it's there in Christ's story. It's there in Christ's story and he's rejected by his own people. Like Christ is. It's Judas who betrays him. It's from within his disciples that he was going to be betrayed. Atheism had to rise out of Christianity. There was no other place where it could come from, because that's the pattern of the story."}
{"episode_id":"SW - #131 - 2020-12-22 - Tom Holland - Discussing Dominion","start":2218.39,"end":2263.66,"speaker":"Tom Holland","text":"And, you know, desacralization is often, you know, has long been applied to Protestantism. And I think that's true. I think that Protestantism does consciously kind of aims to desacralize an enormous amount that Catholicism had represented. But the whole of Christianity is a process of desacralization. I think of Milton's great poem on the Nativity, which essentially consists of all the gods going, whoa. Milton describes the Greek gods, Egyptian gods, the Canaanite gods, basically all being banished. You know, for Milton, the gods are real, but they're demons. What then happens is that Christians come to think that they never existed."}
{"episode_id":"SW - #131 - 2020-12-22 - Tom Holland - Discussing Dominion","start":2263.82,"end":2264.3,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #131 - 2020-12-22 - Tom Holland - Discussing Dominion","start":2264.38,"end":2273.5,"speaker":"Tom Holland","text":"You know, these ancient gods never existed and then that's the kind of intermediate stage. And then from that it's not that much further to go on saying, well, actually the Christian God never existed."}
{"episode_id":"SW - #131 - 2020-12-22 - Tom Holland - Discussing Dominion","start":2273.5,"end":2273.98,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #131 - 2020-12-22 - Tom Holland - Discussing Dominion","start":2275.5,"end":2279.93,"speaker":"Tom Holland","text":"So there's a sense in which Christians are sitting on a branch and sawing that branch off. Yeah."}
{"episode_id":"SW - #131 - 2020-12-22 - Tom Holland - Discussing Dominion","start":2280.01,"end":2299.85,"speaker":"Jonathan Pageau","text":"And all those gods are waiting to eat us up like the mouth of hell at the bottom. Once the branch gets cut off, we'll see. It's hard to know what's going to happen, but we can feel the, let's say we can see all the principalities now fighting to know which one is going to rule."}
{"episode_id":"SW - #131 - 2020-12-22 - Tom Holland - Discussing Dominion","start":2301.45,"end":2513.53,"speaker":"Tom Holland","text":"I think that there is, I think that people cannot survive without, let's call it myth in the non pejorative sense. Sense that there is a kind of potent story that explains things more deeply and profoundly than the shell of reality does. And in a way, all the kind of, you know, the movie franchises, Harry Potter and Avengers and Lord of the Rings and all that kind of stuff, it's kind of an ersatz attempt to fill in the gap. It's expressive of people's ache for the kind of story that the church is used to tell. I don't think that the church have the confidence to tell that story anymore. And so I think that the kind of, the cultural, the moral, the spiritual brew that the churches serve up is very anemic. It's not satisfying in the way that that story used to be. I think the same is also true of secular humanism. I think it's true of social justice movements. I think it's incredibly telling that social justice movements kind of almost despite themselves, reach after the kind of gestures and displays and narratives that clearly demonstrate that they are deriving from Christianity. They're washing people's feet, toppling statues, proclaiming that, you know, slaves have been brought into a promised land. All these stories, but because they've been divorced from the kind of fabric of, from which these stories originally emerged. You know, they've been divorced from the matrix of that. They seem to me kind of, well, a bit dull, to be honest. Yeah, kind of dull and hectoring and unable, for instance, to kind of hook into the mainframe of people's emotional and spiritual responses in the way that the civil rights movement could, because Martin Luther King, you know, he could invoke the crucifixion, he could invoke the story of Exodus, he could echo the language of the cadences of the Bible and do it in a way that didn't feel ersatz. He was summoning the immense heft of this incredible story. And I think that that's why the civil rights movement had the impact that it did, why it came to be almost so universally accepted, and why today's kind of social justice movements are far, far more divisive, because they cannot tap into, you know, not only do they, can they not tap into these stories, but they kind of set themselves against it. The echoes that they, they have within themselves of these stories are something that objectively they're guarding against. You know, the ID is, is absolutely part of it, but the ego is standing full square against it. And I think that that makes their appeal incredibly limited. And so I think that, you know, my prescription for, for Christianity to make a kind of, you know, a comeback in terms of people going to church and sitting in pews would be for Christian leaders to embrace everything that they spent the past century rejecting. The kind of, you know, Christianity in the west seems to me a pallid similarity. It used to be."}
{"episode_id":"SW - #131 - 2020-12-22 - Tom Holland - Discussing Dominion","start":2514.17,"end":2617.52,"speaker":"Jonathan Pageau","text":"Well, it's, I think that it's, at least in the. One of the reasons why I became orthodox was also because I could see, you know, I'm mostly an artist and I noticed and I learned about the pattern of storytelling and the pattern of image making. It's really like almost like a sacred algebra. And it's a self contained language that moves between imagery and architecture and music and all of this. And so in discovering that, I realized that it's. I believe that if we rediscover the stories and the legends, especially if we stop being sola scriptura, all the legends, and we, let's say we at least understand their function, we can understand the function of the legends and the function of the wilder aspects of our tradition. Then there are ways back in. They're harder. But there are ways back in using phenomenological approaches to existence. I tell people, yes, the earth turns around the sun, but the sun still gets up in the morning. You can't avoid that. And the sun still goes down in the evening, and you can't avoid it. And your day is still managed by that pattern. So that pattern is real. And the fact that our days, and let's say the liturgical cycle follows the natural patterns, those can still Be real. When you watch, when you watch the leaves fall, those are real patterns of death and rebirth that you're experiencing. So when Christ is born in the cave on Nativity and it's the lowest day of the year and it's the solstice, this is a real experience you can have of the shortest day and the seed planted in darkness which will rise again. Because it actually follows a natural pattern of nature, you can't completely get rid of it."}
{"episode_id":"SW - #131 - 2020-12-22 - Tom Holland - Discussing Dominion","start":2618.08,"end":2839.82,"speaker":"Tom Holland","text":"I entirely understand the tug of orthodoxy. I mean, I really do. But equally, what I found when I was writing Dominion, and I was kind of. It was a constant process of kind of rushing into another sweetie shop and gorging myself on sweets and then not having, you know, I had to kind of rush off and go to another one. I mean, I could happily have spent, you know, years in any of the periods that I write about, but I found that it was again and again, there were certain points where what I was writing about was personal for me. And I say Pilgrim's Progress, for instance, actually seems to me, you know, this was the most read book after the Bible in England for centuries after Bunyan wrote it. And I remember reading it as a child and returning to it. I just kind of allude to it in a single sentence, not by name, in Dominion, but it was kind of quite important in opening my eyes to reminding me of the power of the Protestant story, that kind of dissenting, non conformist understanding. And that's done through a story. And that story seemed incredibly vivid to me. Reading in lockdown, unable to go and meet pilgrims, you know, unable to go and do this walk with my brother made me think, God, how amazing it would be to go to a pub and to not socially distance with people, meet up with total strangers and get out of London and go and walk to Canterbury. And Chaucer specifies that people going to Canterbury to the tomb of Thomas Becket, because he makes people who are sick. Well, and I suddenly thought, of course, plague was endemic in London when Chaucer was writing this. And it's worse over the winter. So the whole thing about going on pilgrimage in April is you can escape the plague, you can escape the death, and you can go to the shrine and you can give thanks for the fact that you're alive, that you're out there, that you're with other people. And suddenly I had a sense of how powerful it must be to go on pilgrimage to a shrine like the one that was in Canterbury until the Reformation. And, you know, and I felt like, you know, this was, you know, this was part of my past, part of my cultural reading, part of my cultural inheritance, suddenly being given fresh life by the experience of the pandemic. So kind of sense of light coming out of the darkness and those kind of experiences is what the process of thinking about Christianity in the way that I have done for what the past five years has given me, it's kind of made me alert personally, just for me, to the incredible wealth of the different ways of seeing the world. Kind of like taking a drug that it kind of changes the way you see color, changes the way that you experience reality. And that's what Christianity gives it, this incredible inheritance of literature, of, of art, of music, of sensory experience, you know, of travel, all this kind of stuff. And I feel so grateful that I've gone through it and that I know that it will continue to give me these incredible experiences, these incredible insights and what a, you know, what a resource that is. But I do think that, you know, the questions will, what is that enough."}
{"episode_id":"SW - #131 - 2020-12-22 - Tom Holland - Discussing Dominion","start":2840.06,"end":2840.46,"speaker":"Jonathan Pageau","text":"For."}
{"episode_id":"SW - #131 - 2020-12-22 - Tom Holland - Discussing Dominion","start":2842.46,"end":2847.5,"speaker":"Tom Holland","text":"People or is it, do you need more? And of course, that's a question that I do wrestle with quite a lot."}
{"episode_id":"SW - #131 - 2020-12-22 - Tom Holland - Discussing Dominion","start":2847.98,"end":2862.59,"speaker":"Jonathan Pageau","text":"What about, I don't know, like, I don't know, let's say, your situation right now. I mean, what has it for you? Has it been enough to kind of bring you actually into church? Like, would it be enough to bring you into church? Yeah."}
{"episode_id":"SW - #131 - 2020-12-22 - Tom Holland - Discussing Dominion","start":2862.59,"end":2884.79,"speaker":"Tom Holland","text":"So I, when I was writing the book, I went to a number of churches. You know, if I was writing about the Reformation, I'd go to a Lutheran church and so on. And there's a wonderful church in London which was founded in the reign of Henry I, supposedly by his jester, who got ill and went to Rome. And."}
{"episode_id":"SW - #131 - 2020-12-22 - Tom Holland - Discussing Dominion","start":2885.03,"end":2886.23,"speaker":"Jonathan Pageau","text":"Perfect church for right now."}
{"episode_id":"SW - #131 - 2020-12-22 - Tom Holland - Discussing Dominion","start":2886.55,"end":3009.18,"speaker":"Tom Holland","text":"Yeah, absolutely. I had a vision of St. Bartholomew who told him to go back and find a hospital in a priory. So he did that. And so the church is a part of what was the priory. And the hospital, St. Bartholomew's is still a functioning hospital in the middle of London. So that's a Norman church where the Virgin appeared. It's the only appearance of the Virgin in London. And she turned up and kind of bollocked a later monks who was saying the liturgy wrong and then vanished. And then he got chunks of it, got closed down in the Reformation, sold off, and what had been the Lady Chapel became a printer's where Benjamin Franklin worked for a year. So the whole church seemed to me perfect embodiment of everything that dominion is about. So I fell very much in love with it. It's kind of beautifully done. But also I had this amazing experience in the church in the village where I grew up, where my mother still goes to church, which is very much the kind of Protestant experience of a great preacher suddenly catching fire and Pentecostal flame coming down. And it was this. This woman who, you know, it was incredibly drab service. I thought it was going to be. It was kind of about eight. Eight of us huddled in choir stools very early in the morning. And she just gave this amazing service where she talked about the dove at the baptism coming down and how the dove was sacrificial but animal in the temple. So Christ was baptized with blood as well as with water, and how this was a form of, you know, he was pregnancy, you know, giving birth. And it was so literate and it was so scholarly and it was so emotional and it was so beautiful. I just kind of went, wow, that's incredible. So I did. I have had, you know, it's. I haven't just studied Christianity as though it's a kind of butterfly pinned on a board. I have kind of experience the slipstream of it, the tug of it, very, very powerfully."}
{"episode_id":"SW - #131 - 2020-12-22 - Tom Holland - Discussing Dominion","start":3010.06,"end":3052.36,"speaker":"Jonathan Pageau","text":"Well, that's wonderful. All I can say is I looking forward to seeing where you will you end up on this path, let's say, and where you're going in these reflections. And so I want to encourage everybody to get dominion. Everybody watches. It's definitely worth it. It's very refreshing. Like I said, the chapters, especially the chapters as we move towards modernity, there really is this momentum that gets built up and you start to see, let's say, the consequence of his thesis, of Tom's thesis, which is how this is going to influence. Even as Christianity is being eroded, we see the influence continue. And so it becomes very magical as the book continues. And so, Tom, thank you. Thank you for your time and I really enjoyed our discussion."}
{"episode_id":"SW - #131 - 2020-12-22 - Tom Holland - Discussing Dominion","start":3052.6,"end":3053.8,"speaker":"Tom Holland","text":"Thanks very much for having me."}
{"episode_id":"SW - #131 - 2020-12-22 - Tom Holland - Discussing Dominion","start":3053.8,"end":3055,"speaker":"Jonathan Pageau","text":"All right, it's good to talk to you."}
{"episode_id":"SW - #131 - 2020-12-22 - Tom Holland - Discussing Dominion","start":3055.63,"end":3056.19,"speaker":"Tom Holland","text":"Thanks a lot."}
{"episode_id":"SW - #131 - 2020-12-22 - Tom Holland - Discussing Dominion","start":3057.15,"end":3122.16,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
