{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":0.08,"end":17.76,"speaker":"Brandon Dayton","text":"But, yeah, then kind of the Virgin Mary kind of appears, you know, oddly, in this very masculine way at the end as kind of this apex figure within this kind of spiritual test. And she's kind of. She's kind of like, yeah, she's pretty terrifying."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":17.76,"end":125.56,"speaker":"Jonathan Pageau","text":"There's something scary, but that's okay. You have. Definitely have traditions in the Orthodox Church itself about, you know, aspects of the Virgin which are. Are kind of terrifying. Like, she's this protector, too. Like, she has this. She protects her child. So there's something about that. You know, you take icons of the Virgin on the wall of Constantinople, when the wall. When the city's being attacked. You know, there's something about that. There is a kind of mother bear aspect to the. To the. To the Virgin. This is Jonathan Peugeot. Welcome to the symbolic world. Hello, everybody. I'm really excited to be here with Brandon Dayton. Brandon is an artist. I know him mostly as a graphic novelist. He wrote a book which, if you follow me on social media, you've seen me share it quite a few times. It's called the Green Monk, and it's a really beautiful graphic novel about a young. Let's say, a young boy who finds himself in a Russian monastery. And there's a whole kind of fantastic story which surrounds the graphic novel. It's very beautiful and airy. The story is kind of told through the succession of panels, and it doesn't need a lot of words. It really is this kind of beautiful flow of story. So I'm really happy to have him with me to be able to talk about. About the graphic novel and his. His inspirations. What brought him to make it. So, Brandon, thanks for talking to me."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":125.96,"end":128.12,"speaker":"Brandon Dayton","text":"Yeah, super, super happy to be here."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":128.36,"end":134.68,"speaker":"Jonathan Pageau","text":"And so tell us a little bit about what was the. What was the impetus behind this book?"}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":135.16,"end":285.92,"speaker":"Brandon Dayton","text":"Oh, man, that's such a good question. Because there are, like. There's always, like, little ideas that bubble up that are interesting ideas or images, you know, and so there's. I can, like, trace different threads of, like, very early on having this idea of, like, a blade of grass as a sword and then having some sort of. I remember at some point having it be some sort of, like, my chance to do Star wars the way I wanted to do it. I'm gonna be like, okay, I'm gonna tell the story of Star Wars. I want to tell it, but I'm gonna put it in this other fantasy, and instead of lightsabers, it's gonna be like this, like, grass sword. And that kind of faded away. But then when I was introduced to Tarkovsky's Andrei Rublev. That was, like, when things kind of clicked. And this is, like, going way back to college. Like, this is, like, first time I saw that was in college. And I had this character, and I was like, oh, yeah, I want to put this character in that world. And that's where things, like, really started to fall together, like, come together for me. But then there is also, like, you talk about impetus, and then there's just, like, a feeling. There's a certain feeling about a story that starts to emerge. And there was something about this character and, like, what this character represented to me that just really got to the core of, like, what really mattered to me, you know? I mean, if I could put it in other terms, it felt. There was something that felt, like, sacred about it to me. Like. And I actually remember I was. This is actually. I was. I was finally out of. It takes me a long time to make art. So this is, like, I was out of college, and I was. I was newly married and going through, like, therapy. And I remember having this thing where I was like, I have all these ideas, all these stories I want to do. I don't know what to do with my life at that point. I was, like, wanting to make movies and thinking about doing screenplays. And I remember going through this process with this therapist where it was kind of like, well, yeah, but which of these things, like, really are you most drawn to or feels, like, most important and meaningful to you? And it was like, oh, yeah, I have this story about this monk, and I really feel like it has to be a comic book, you know? And so once I landed on that, I'm like, oh, yeah, this is what. Like, I really feel this, like, warmth in my heart about this thing. I kind of put everything to the side, and I was like, okay, no more trying to make movies. I'm just gonna make this comic book and see what happens. And that was the very first mini comic. And so the very first mini comic of Green Monk was the product of that."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":286.78,"end":293.5,"speaker":"Jonathan Pageau","text":"And so what was the reaction? Because I guess you came back to it a little bit later, to the same story and kind of put it back together."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":293.98,"end":411.85,"speaker":"Brandon Dayton","text":"Yeah. So, I mean, I had been trying to. I mean, I wanted to be a big, famous, amazing artist storyteller in some way. So I'd always been, like, trying to make art and putting it out on the Internet and stuff. And I'd been to conventions, and nothing really ever connected. And then I made this book, and I started going to conventions with it, and Things like that. And the response to it was like fantastic. It was like more than I could have expected. I was like, oh, wow, this is so yeah, if you like kind of follow your heart, do the stuff that seems like most important, there'll be a good response. So it's, to this day, it's the thing that's sold the best at conventions. I mean, I remember I'd go to conventions and I'd sell like 60 copies of this. And this is as me being an artist no one knew about, you know, I had no name, no previous experience with comics and I would, for me it seemed like I was selling quite a bit of those. And I've never sold stuff like that high of a volume of books, you know, ever since then either. But it also got within that time it got nominated for the yalsa top 10 teams for book List award and was selected for their list in 2011. So, so that was a really cool honor because it was the only self published book on their list that year. And it was just cool that it got into the hands of the right people and I had a chance to talk with them and they were just like, yeah, we really want to support stuff that's not coming from larger publishers. So that happened. But I was also in the midst of working and trying to support a family and whatever the next step was there didn't seem very obvious to me. And I was working a job as a concept artist within the video game industry, which is very demanding. And so it was a big challenge to put my energies into making art during the day and then to try to come home and try to move things forward with the comic books, you know."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":412.01,"end":417.61,"speaker":"Jonathan Pageau","text":"Yeah, to make more art, like make art in your job and then in your spare time, it's like exhausting."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":418.35,"end":493.89,"speaker":"Brandon Dayton","text":"Yeah. And I'm not, I've just kind of come to realize that I'm just not. I don't have the same work ethic as other artists out there. And so it just, it just like it really burnt me out trying to do that. And finally I got to the point. I was working at Disney Interactive in Salt Lake City and I just was making tiny progress on the latest book, Blood of the Martyrs. And I finally talked with my wife and I'm like, I'd like to just quit Disney and just work on making this book. And so we talked about it. What would be the best way to do it? We had some savings. My wife was like, no, let's not go through the savings. I'll start working. And you can work on the book. And so next, I think four or five years was me working on the book. Slowly. Wow. And I was dealing with all sorts of depression and other issues as I was, like, trying to do that. But at the end of day, I did finish it. And I was very happy with how it. How it turned out, and just feels like a very authentic, you know, true part of myself. And I'm kind of proud of what it is. And it was, like, well reviewed. I mean, there's lots of people that I respect that have spoken well of it, and so that's been great."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":494.13,"end":527.67,"speaker":"Jonathan Pageau","text":"And so I'm curious about some of the elements, like, because there are some of the elements which are obvious in terms of the storytelling, and there's some which are just. It's like. How can I say this? It's very mysterious. Let's say. Some. Some elements of the story are quite clear and straightforward, and some of the elements are quite mysterious. And so I'm wondering if. So, for example, there's a scene with all these, like, giant demons. For example, like these huge kind of giant demons. And so I was wondering if you're pulling from certain mythologies or if it was really just your imagination that you were kind of pulling from."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":528.47,"end":587.6,"speaker":"Brandon Dayton","text":"Yeah. With this book, the fantastical elements of it, it's a much. It was a much more like, kind of intuitive, kind of imaginative thing. There was definitely kind of a flavor I wanted to. That you talked about, kind of the mysterious quality of it and. Yeah. Or this kind of, like, esoteric feeling, particularly. There's kind of some moments where, like, he's given kind of these clues or these, like, messages or signs, and you're not really clear exactly what they mean or how they fit together. But it's just. It's more of, like, the feeling that I wanted to get from that and kind of this, like, descent into this kind of spiritual realm. I just. I really enjoyed. And the ambiguity of, like, what is. Like, what is dream and what is reality is something that was really interesting to me as I was doing this as well."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":588.08,"end":625.68,"speaker":"Jonathan Pageau","text":"Yeah. And there's a sense in which the main character is some kind. Like you talked about Star Wars. It makes sense. Like, you get a sense in which this character is somehow chosen, but is also possibly a dark figure. It's not clear. You know, it is kind of that Luke Skywalker idea or the Skywalker idea. Um, and there's that wonderful moment where he chooses his weapon. I think that's probably the. Obviously, the high moment where it almost feels like he's Being forced to become what he is, or he's resisting, like the whole book. He's just kind of. He's resisting one way or another. Certain things."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":625.68,"end":625.96,"speaker":"Brandon Dayton","text":"He."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":625.96,"end":640.12,"speaker":"Jonathan Pageau","text":"He's reacting to different. To different things around him. And then that's the moment where even in his own. He resists, like picking the weapon. And then that ultimately would lead him to end up having the weapon that. That he didn't want to have in the first place."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":640.44,"end":642.36,"speaker":"Brandon Dayton","text":"Yeah, yeah, yeah."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":643.4,"end":656.12,"speaker":"Jonathan Pageau","text":"And so had you already thought about what the sequel would be like? Had you kind of planned out in your head or you were just kind of. You. You just kind of finished it and you were. You were. Because it feels like when it ends, like it. Like this book has to have a second. I need."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":656.2,"end":664.2,"speaker":"Brandon Dayton","text":"I know, I know it's really frustrating because I think it's very unlikely that a sequel's ever gonna happen to this book."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":666.16,"end":706.51,"speaker":"Jonathan Pageau","text":"I mean, I understand, I understand. I mean, especially if it took you. It's interesting that you're saying it took you like five years to work through it because I can see it when you say it. I can see it because every panel seems like it has been completely thought out. But also. But it's still. It doesn't feel labored at all because I think it's probably because of your drawing style. There's something about it which feels like it's just flowing through. Like the entire story just kind of flows through and the panels are flowing almost like. Yeah, like there's water rolling down and you're just kind of tumbling into the story. Especially with the character kind of falling into imaginary spaces and then coming back out and everything. There's that whole thing going on."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":706.91,"end":709.71,"speaker":"Brandon Dayton","text":"Yeah. Talking to you really makes me want to make comics again."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":710.35,"end":724.88,"speaker":"Jonathan Pageau","text":"That's great. If I can do that. That's awesome. We need you making comics. We want you making more comics because it's interesting. Because one of the things that is funny to me is like, how much did you know about, let's say, Russian Orthodoxy before you. You made this?"}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":725.44,"end":727.92,"speaker":"Brandon Dayton","text":"I knew. I knew Andrei Rublev and that was it."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":728.08,"end":729.12,"speaker":"Jonathan Pageau","text":"Right, right, right."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":730.08,"end":801.74,"speaker":"Brandon Dayton","text":"So I've read. I did a little bit of reading after that. Like a lot of Wikipedia stuff. I did another little short story that's connected, kind of tangentially connected to Green Monk, actually kind of connects the mini comic to. To Blood of the Martyrs. So it's kind of the one connecting thread is this little, like four page story I did that's much more based on Russian mythology. It's like, it's straight out of a Russian myth. But I kind of used. I had kind of two pieces from each of the stories that kind of end up in there. So that was it. Yeah, I did some reading, and that definitely kind of influenced how I looked at it. But there's other things I've been learning afterwards that have been really interesting that have given me, like, more insight onto. Which sounds funny to say, but, you know, reading more about, like. Like, kind of Eastern Orthodox traditions of contemplative practice and how that. How that affected those communities and things like that that have been. I've kind of said before that I'm kind of, like. My knowledge of, like, Russian history and. And. And religion is kind of, like, similar to Sergio Leone's, like, understanding of, like, the American west right now."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":801.9,"end":805.58,"speaker":"Jonathan Pageau","text":"It's kind of like this beautiful caricature, let's say, say."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":806.22,"end":807.42,"speaker":"Brandon Dayton","text":"Yeah, something like that."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":807.83,"end":872.77,"speaker":"Jonathan Pageau","text":"Yeah, no, I definitely. That. I mean, I definitely. Because I definitely got that in the book. Because you might not know, I'm Orthodox myself. And then. Okay, so I'm actually an iconographer. That's my prime, let's say, work. And so it was interesting to kind of go through and see your interpretation, even of the icons and kind of how you brought different elements together and how you kind of interpreted the iconographic tradition. So I find that. I found that very fascinating because even, like. So there's a sense in which, obviously, you have this feminine character that repeats, let's say, through the. Through the story, right? It starts with the boy's mother, but then appears in almost like a mythological way, and then it's kind of revealed at the end. But. And so were you trying to. Because the sense I get is that there was something of the Virgin Mary in that imagery. But you're also trying to pull in more almost like this goddess figure that was kind of being pulled into the story at the same time. So I'm curious a little bit about that in terms of that. That feminine. The repetition of that feminine character through the story."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":873.25,"end":966.02,"speaker":"Brandon Dayton","text":"Yeah, yeah, that's. That's interesting. It's. It's. That's one of the things that's really exciting me about how this story worked out. And a lot of this, some stuff is kind of intentional, but a lot of the stuff afterwards, you look back at it and you're like, oh, my gosh. This is, like, seeing these huge parts of my psyche I wasn't aware of, you know, because it's very much a story about, like, masculinity as far as this boy being raised in this this monastery and this particular form of, like, spiritual masculinity, you know, And I was. I was raised Mormon, so that has. Okay, it has its own flavor as far as, like, what does it mean to be a man and be, like, spiritual. So the whole sense of, like, being raised in a house that is a house, the Fathers, where you're just surrounded by all these fatherly figures, you know, is really interesting. And I've actually been. I've been criticized. I mean, I've had a few people criticize me to be like, hey, there's, like, no women in this story, you know, but then it's like the feminine is very much a part of this story as far as, like, obviously his mother as this figure, this, like, connection, this balance between, like, paganism and, you know, orthodoxy and how they kind of unite in his person. But, yeah, then kind of the Virgin Mary kind of appears, you know, oddly in this very masculine way at the end as kind of this apex figure within this kind of spiritual test. And she's kind of like, yeah, she's."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":966.02,"end":995.32,"speaker":"Jonathan Pageau","text":"Pretty terrifying if there's something scary. Yeah, but that's okay. You have. Definitely have traditions in the Orthodox Church itself about, you know, aspects of the Virgin which are. Are kind of terrifying. Like, she's this protector, too. Like, she has this. She protects her child. So there's something about that. You know, you. You take icons of the Virgin on the wall of Constantinople when the wall. When the city is being attacked. You know, there's something about that. There's a. There is a kind of mother bear aspect to the. To the. To the Virgin as well."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":995.8,"end":1021.92,"speaker":"Brandon Dayton","text":"Yeah, yeah. So I mean, it's really one of these things that as I look back on it, it's so delightful to look back on it. And just as a map of my own, like, interior world. And obviously, those things always map to some sort of greater, like, you know, archetypal realm, whatever you want to call it. But, yeah, that's one of those interesting things, is seeing how, like, the masculine and the feminine kind of. Kind of play out in it. So."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":1021.92,"end":1096.5,"speaker":"Jonathan Pageau","text":"Yeah, but I think it. The way that you treat the feminine characters in it is really. I think it's very powerful, you know, because there is a sense in which right now we're trying, you know, every story is always trying to. Now to replace the hero with a girl. Like, it's like every hero has to be replaced with a girl. But there's something about that which is artificial, and there's a. There's a missing of what the feminine can Be in a story and even a story of adventure, which has usually is a more masculine. Has a more masculine trope. But, you know, the image of the. The woman who is there as this kind of hidden guiding principle and is also like, this. This mysterious agent which is pulling you forward. You know, I always use the image of Galadriel and in the Lord of the Rings movies, which it's like, he's not. She's not. She doesn't feel like she's important in, like, how much presence she has in the story, but she. She cuts to the chase and is like this, like, secret figure that is motivating the characters to go to actually go on the quest, you know, and so I felt that definitely in your book as well, where this feminine character is always hiding in the background and is there to kind of pull the boy, you know, into his. Into becoming what he's going to be, ultimately."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":1097.38,"end":1123.92,"speaker":"Brandon Dayton","text":"Yeah. And her figure, I mean, his mother kind of reappears as this mystical guide, like, in his visions. And, yeah, she is always kind of pulling him away from, like, the realm of law. Like, that's kind of her, like, thing is, he's in this. This monastery that's all about law and, you know, order and all this other stuff. And she's constantly like, okay, there's this other thing. Yeah, I don't know."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":1124.24,"end":1127.52,"speaker":"Jonathan Pageau","text":"You grew up Mormon. Do you still consider yourself Mormon or not at all?"}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":1127.86,"end":1134.42,"speaker":"Brandon Dayton","text":"Yeah. So that's been an interesting thing. I left the LDS Church, which is kind of the largest denomination, probably about eight years ago."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":1134.74,"end":1135.3,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":1135.3,"end":1168.21,"speaker":"Brandon Dayton","text":"But. Which is a very, very painful process when you leave, like, a religion. But I've come to a point now where, like, that identity is really important to me. So I say that I consider myself Mormon, but it's a very, like, individualistic, like, way that I define that. Like, it's just this thing that, like, feels right for me, like, in a way that connects me to place and, you know, certain people. And I haven't. I haven't, like, figured out all the details of what that means as far as, like, how it affects how I live or whatever. But, yeah, it's something that's still very important to me."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":1169.01,"end":1173.89,"speaker":"Jonathan Pageau","text":"Yeah, but so you don't. You're not part of, like, a community, though. You kind of live it individually."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":1174.45,"end":1175.65,"speaker":"Brandon Dayton","text":"Yeah, Yeah."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":1175.65,"end":1179.33,"speaker":"Jonathan Pageau","text":"I don't know much about Mormon Church, so I'm just kind of asking these questions."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":1180.78,"end":1190.86,"speaker":"Brandon Dayton","text":"Yeah, it's one of these things where, like, I believe that I feel like Mormonism is actually, like, an ethnicity, but it's also it's so."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":1190.86,"end":1194.94,"speaker":"Jonathan Pageau","text":"Because of, like, Mennonites or Jews or Mennonites. Yeah."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":1195.34,"end":1236.12,"speaker":"Brandon Dayton","text":"The way that it kind of emerged and kind of evolved, you know, it was very isolated in the Rocky Mountains, and it was this one organization that really kind of like, tied everyone together, this one faith. And so I think now, like, nowadays, it's really hard for people to separate those two things. And to be like, oh, you can be Mormon and not be a member of this church is something that I don't think people see as a possibility, which I think is kind of a shame, because there are people that leave and they're just like, okay, like, what am I now that I'm not this thing? You know? So I'd be interested in a community of Mormons that aren't connected to the LDS Church, but I don't know what that looks like."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":1236.12,"end":1240.62,"speaker":"Jonathan Pageau","text":"A community of ex Mormons or, like, let's say, individualist Mormons or something."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":1240.62,"end":1241.82,"speaker":"Brandon Dayton","text":"Yeah, yeah."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":1241.82,"end":1265.9,"speaker":"Jonathan Pageau","text":"I don't know. I don't know if any of that exists, for sure. I don't know. So. But I'm wondering about. Because I don't. In the book, there's something very mystical, definitely, about, like, just the whole approach of the book. And so is that something. How do you perceive that in relationship to your own path, let's say, to your own. To the way that you're living out your own. Yeah. Your own spiritual path, let's say."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":1266.31,"end":1362.66,"speaker":"Brandon Dayton","text":"Yeah, yeah. I mean, I look back at it now, and it seems like there's a very clear message in it for me that I wasn't aware of. And there's very much this sense of. I mean, it comes back to kind of this, like, owning. Owning your spiritual path where, you know, you have this character that's very conflicted in trying to. Trying to somehow reconcile these two extremes that he's part of. Very, very much has a love for this community he's a part of. But then there's this deep, rich, interior world that speaks to who he is and comes out in these, like, you know, these violent, heroic fantasies that he has. And then, I mean, the kind of end is very interesting, too, because it is kind of like what comes next. And there's something there in that truth of kind of the unknown, like him walking out into the winter as far as, you know, eventually does take responsibility and he does, like, take action. And even though he's, like, made this vow to never take a life, he ends up, you know, saving his monastery by, you know, killing all of these invaders. And so that's A very exciting question to me is, like, where you end up when you decide to, you know, take responsibility for your path in life. And it's not simply like, fuck the monastery. Because for him, he's like, he's still wearing his robes. It's like, this still matters for him."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":1363.62,"end":1467.68,"speaker":"Jonathan Pageau","text":"It's interesting. I was really surprised, too, about the ending, because there's something you might not know about the Orthodox ethos of war, which is that, on the one hand, in the Orthodox tradition, there's a sense in which war, violence and combat is inevitable, that it's going to happen. There is, to some extent, the possibility that you could attain something that there is. It's not completely devoid of value completely, but it's also not totally sanctioned. And so, for example, someone who. A warrior that goes out to war, when they return from war, they're barred from communion for a certain amount of time. They actually have to go to confession and they have to do penance for their combat. But it's not like they're saying what you did, you know, they're recognizing the value of the combat, but they're also realizing that there's something about it which is due to our circumstance. Like, it's like, it's due to this fallen world in which we are. And so you have to do some penance and you have to. You have to atone for the killing that you participated in. So it's just interesting because I don't think you probably didn't know that, but there's something that comes out in the end of the book. It's something like that where it's like, he doesn't want to kill anybody, he doesn't want to be violent, and then he's forced to do it out of love for his fellow monks. But because of that, it's almost like he also now has to leave the monastery. So it's like a thing where he saved the monastery by doing this. He engages in something which is like a trespass, so he has to be exiled, but he did it for them. And so there's like. It's an interesting. It definitely is. In terms of narrative. It's a very powerful moment."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":1467.68,"end":1484.2,"speaker":"Brandon Dayton","text":"I thought, yeah, thank you. That's a really interesting, interesting perspective. When I kind of made the decision that, oh, these are like pacifist monks, that was a real speculation. I'm just like, I don't know if that's something that ever existed, you know, within, like, Eastern Orthodoxy. I know it's existing."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":1484.2,"end":1493.12,"speaker":"Jonathan Pageau","text":"Monks are not supposed to fight. Like, that's for sure, you're not supposed to take up weapons. There have been weird exceptions to that, but they definitely are not supposed to fight."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":1493.68,"end":1501.6,"speaker":"Brandon Dayton","text":"Yeah, yeah. But then, yeah, there is also at least the archetype of, like, the warrior monk, which is."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":1502.16,"end":1522.88,"speaker":"Jonathan Pageau","text":"Yeah, it's definitely more of a Western archetype, like the idea of the. But it's funny because you have that in your. In the book, don't you? You have these. You have an image of these monks, that they were Western, like warrior monks, I guess, who kind of gave up their ways to become. To become Eastern. Eastern monks."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":1523.04,"end":1524.64,"speaker":"Brandon Dayton","text":"Yeah, that's right. Yeah."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":1524.64,"end":1532.2,"speaker":"Jonathan Pageau","text":"And so. And so then it's like. Then he. So it's like you come to a point where now this. This young character is going in that direction."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":1532.2,"end":1532.48,"speaker":"Brandon Dayton","text":"He's like."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":1532.48,"end":1542.58,"speaker":"Jonathan Pageau","text":"He's going back in that direction. Yeah. In terms of narrative, I just thought it was so. It was so ripe with. With possibility. Definitely. Yeah."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":1542.58,"end":1569.15,"speaker":"Brandon Dayton","text":"And that's one of those things where it's just like, man, it's just like a tribute to how important it is to follow, like, intuition when you're, like, working through these things. Because there's never part of me that's just like, here's what my morals are, and I'm going to put it down in this book. But as you work through these things, it's just like there's something about this that just feels right. And I don't. I still don't even know why. Like, I feel like I should be giving you an explanation about, like, what it means."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":1569.71,"end":1595.31,"speaker":"Jonathan Pageau","text":"That's okay. I can, I can. I can. I'd say sometimes it's better when someone else finds the meaning because it's. You seem like to be really an artist in the sense you said. Like, artists are more like. A lot of artists are more. They're more like tuning forks, right? Like, they get the pattern right. They can tune in to the. To the harmony and they put it down. But it's like, you know, you don't necessarily know all the implications of what that is when you do it, when you're doing it."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":1595.95,"end":1633.12,"speaker":"Brandon Dayton","text":"But I do think it speaks to something. As far as how I feel about morality in the sense there's a feeling in the conclusion, just about morality is this living thing that you experience, and it's not necessarily a list of rules. And it's like you said, there's something about what you talk about. Yes, you can go to circumstances, bring you to war, but then there needs to be some sort of penance at the same time for what you're done. And kind of the complexity of morality. There's something about that that just tastes right to me, I guess. Yeah."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":1633.28,"end":1642.64,"speaker":"Jonathan Pageau","text":"So tell me a bit about. In terms of the art, let's say I'm just curious about who you see as your influences in the work. Do you have influences or you realize."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":1642.8,"end":1663.85,"speaker":"Brandon Dayton","text":"I certainly do. I can remember, at least when I was doing Green Monk, that it was something that. That changed quite frequently. And, like, I am, like, struggling to even remember some of the names right now. I'm thinking of artists and I can think of their art. But is it."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":1663.85,"end":1672.77,"speaker":"Jonathan Pageau","text":"I mean, like, is it coming from the world of traditional art, from fine art, or just from comics? Or was it a mix of different influences?"}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":1673.41,"end":1712.03,"speaker":"Brandon Dayton","text":"Lots of different things. One that comes up to me that was really big for me is Christophe Blaine, and he's a French artist that did. I was first introduced to him. He did part of Dungeon. He was part of the Dungeon series. And he is just this really expressive, very fluid artist. And I just loved his layouts. I love the way he, like, laid out pages and the dynamism in his stuff. And I remember that being a big influence on. When I was doing this. Um, and there's other. There's other artists that. Names escape me. That affected, like, how I was trying to, like, ink and stuff like that."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":1713.07,"end":1756.58,"speaker":"Jonathan Pageau","text":"Yeah, no worries if you don't. If you don't remember that at the moment. But for sure, the inking is. Is an important part of the style because it has. It really has this kind of loose, fluid feeling to it, which. Which helps in the. This fluidity of the story itself that I was saying, where it's like. It almost feels like on the. You could almost read. It's interesting. Cause, like, if you wanted to, you could read the book and, like, 15 minutes, right? You could just kind of flip through, but then you go back, and then you just slowly go through all the. All the subtlety of the changes and the character growing up and all these little reactions, and then you can spend hours with it just going through. So, I mean, it's. It's interesting that a book can be that way, because I could. I could. I can really see it. Like, it just flows like water all the way through. Yeah."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":1757.54,"end":1823.07,"speaker":"Brandon Dayton","text":"Yeah. I love hearing that. That's. That's, like, my experience with it. That's one of the really satisfying experiences of that, is having this sense of, like, a flow. Like the way, like, I did this thing where when I would finish a section, I would kind of do it in chunks when I would finish a section. I would lay out all the pages on my floor and, like, stand up on my couch and just, like, how all the pages kind of went together. And I love that way of thinking about comics. I mean, you can certainly think about them as panels, like each individual panel. But I love this idea that the subtle changes between each panel, how each panel connects, and how it becomes this big hole. And that was definitely a life for me with color. Like, the coloring of this book was something where I was thinking very, very carefully about how color transition from. From panel to panel and how that kind of tied everything together. But, yeah, there's something about that as far as, like, the flow of the story that just feels like, really important to me, particularly with this book."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":1823.15,"end":1874.37,"speaker":"Jonathan Pageau","text":"Yeah, well, definitely. I could definitely see it, you know, and so, yeah, I think, like, for me, I'm just happy that the book exists. And I hope. I really hope that. I mean, if we don't see another Green Monk book, then at least something from you. Because I. Because I really think it's wonderful. And I encourage everybody to get it. Green Monk, you can get it on Amazon. It's very reasonable. And it's great for kids, too. Like, even kids. It's, like, good. My, My. All my kids read it and they. They really liked it. You know, they didn't have to. You don't need, like, you can get all the subtlety of the changes, but you can also kind of read it as a fun story about, you know, this. This kind of rebel, that rebellious but, like, rambunctious young man who kind of finds his way. So thanks for. Thanks for the book and I wish you the best as you kind of figure it out, like, what you're going to do next."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":1875.09,"end":1879.01,"speaker":"Brandon Dayton","text":"Yeah, thank you. Appreciate that. Probably some more comics at some point in the future."}
{"episode_id":"SW - #272 - 2023-02-03 - Brandon Dayton - Green Monk","start":1879.65,"end":1941.63,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially going to www.thesymbolicworld.com support or else on Patreon the Pageot videos as well, and on Subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
