{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":0.08,"end":68.56,"speaker":"Richard Rohlin","text":"Would say that the Divine Comedy is, I think, as you pointed out at the beginning, I just want to restate, is really, really important to our universal history project because it integrates essentially everything that came before, brings in the Greco Roman world, it brings in medieval cosmology and theology and science and the old Jewish and early Christian apocalyptic traditions and all of the apocrypha. It brings all of that stuff in. There are giants, There are, I mean it's all there in the Comedy. And what's more is that it doesn't invent, but it's probably the best example for modern readers of the idea that man is a microcosm, that every, every human being is actually a cosmos. Dante's descent through the earth and his descent through the spheres is a deeply personal journey and it's one that bridges perfectly, I think, the medieval modern worlds because it, it shows us how this vision of the cosmos, this medieval model, is not merely just an external vision of things that will fall apart as soon as you put it under a microscope or into a telescope or whatever. It doesn't just adequately describe our experience of reality on a day to day basis, but it is also a map to ourselves."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":80.64,"end":138.99,"speaker":"Jonathan Pageau","text":"This is Jonathan Pedro. Welcome to the symbolic world. Hello everyone. I am back here with Richard Rowland for one more universal history episode. And this week we are going to talk about Dante's Comedy. And the reason why is because as many of you know, we are getting ready to embark on a long journey through hell, up purgatory and into heaven. Rigid. And I love the Comedy so much. And so we've decided to do, do it as three classes for the symbolic world, really going into it. And the classes will be longer than the ones we've done before because we really want to take the time, both of us, to make our commentary on this wonderful text, how it is of this powerful map of symbolism and how much insight Dante seemed to have into reality. And so Richard is going to be our guide in this. He's going to be maybe my Virgil. I don't know."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":139.55,"end":184.83,"speaker":"Richard Rohlin","text":"I'll take it. I mean, you do have to have a guide, that's for sure. And even Dante needed a guide. But the Comedy is about as confusing as the afterlife itself. In certain places there's just a lot of illusions that are difficult. Sometimes it's a little difficult to cast your mind back into the frame of why are things important to Dante that are not important to us anymore? By the way, this is the right question to ask almost no matter what you're reading. I've been reading some other stuff in preparation for some other universal history videos that we're going to be doing in the future. And I will just say, by the way, guys, Jonathan said we're back for one more universal history. It kind of sounded like he was saying, this is the last one. No, no, it's not the last one."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":185.95,"end":187.95,"speaker":"Jonathan Pageau","text":"They do this as long as they stomach it."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":187.95,"end":320.41,"speaker":"Richard Rohlin","text":"Yeah, that's right. That's right. But I've been. I've been reading through a bunch of Celtic stuff. I promise we're still getting to that symbolism of Ireland, but currently I'm stuck in Wales. So it's a whole thing. But I've been reading through a lot of Celtic stuff lately and rereading stuff and kind of refreshing my memory a little bit and looking for certain patterns as they occur and reoccur throughout Celtic Liter. And one of the great questions to ask yourself whenever you're reading something, especially something that feels so, in a way, like, deeply foreign, like some of that really old stuff, is why do they care about something? You know, the things that they care about aren't the things that we care about in our world today. Or at least that's how it seems on the surface. You get the same kind of feeling reading something like the Iliad. Like actually the whole premise of the Iliad, which is this, you know, Achilles decides to go and sulk. Like, seems like to us, it all just sort of seems like he's being a big baby. Like, why is he doing this? And why is this, like a reasonable thing for him to do? Is a. Is something that you have to grapple with if you're going to take the poem seriously. So anyway, all this to say Dante has concerns and he has interests and that are very different from ours today. If we were going to write the comedy today, God forbid that, you know, it'd be very different in these ways. So, yeah, I'm really excited at getting into all of this, looking at it together. I thought what we could do for today would be to kind of give an introduction to the comedy. And this is going to be based a little bit on the introduction that I give when I teach, when I teach the comedy. And then we can just kind of talk about it and obviously there'll be a little bit of repeat. But the class, as you mentioned, is going to be pretty long. We basically are going to have five, three to four hour classes, right? So if you want to just sit and discuss the comedy with me and Jonathan for four hours, I mean, this is going to like, bring some coffee and then maybe something else, because it's going to be. This is going to be some sessions, and I'm really, really, really excited about. Might be more than anybody can handle, but I'm just really, really excited about it. Of course, if you get the course, then you have the videos, so you can always."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":320.49,"end":322.13,"speaker":"Jonathan Pageau","text":"You can always rewatch it. You don't have to watch."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":322.13,"end":354.26,"speaker":"Richard Rohlin","text":"Rewatch certain sections and. Yeah, but I'm really, really excited about it. So let me say a few words about Dante, who he is, when he lives. I'm not going to spend too much on this. Too much time on this kind of stuff. What I try to give my students when I teach the comedy is just enough information that when we come to all of the political stuff in the comedy, and there is a lot of political stuff in the comedy, people. People at least have some idea of, like, who the major players are and what. What does this actually have to do about Dante's spiritual journey, which is really what the comedy is about."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":354.34,"end":387.34,"speaker":"Jonathan Pageau","text":"Yeah. And it's important for people to understand that the comedy itself, the way it's structured it, in some ways needs to have his personal story as part of it. Because what Dante is doing is linking his personal story with, you know, the national story and then ultimately the cosmic story. And that's actually how symbolism functions. He's showing analogies between the different levels of reality. But in. But for us, sometimes the particular aspect can be difficult because you're like, why is. Who are this. Who this count of so and so."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":387.34,"end":519.31,"speaker":"Richard Rohlin","text":"Like the Galveston, the Ghibellines and what's all this about? Yes. So you skipped to the end a little bit of what I wanted to say. But that's, that's okay. That's great. Yeah, that, that. The way that all of this becomes personal, you know, this is. This is what's really important about the comedy. So Dante Alighieri, he's born in 1265, so he lives at the end of the 13th and the beginning of the 14th century. He's a Florentine poet. We. It's. It's important to say he's Florentine, because at this time, the nation of Italy does not exist. Actually, the nation of Italy is younger than the United States, which is pretty, Pretty dang young as nations go. Up till that time, I don't know, something happened. Somebody unified Italy. All the trains ran on time. I. I don't remember. But anyway, I'm sorry. Yeah, yeah. I'm not saying Mussolini unified Italy. But anyway, it was a whole Thing Italian. Italian politics and history, actually the last 200 years. Really interesting and very. Yeah, very spicy. But so he's. He's a Florentine poet. He lives in the second half of the 13th, beginning of the 14th century. And as a poet, he's primarily famous for a work called the Divine Comedy. And the Divine Comedy is essentially what's a lot of things, but really at its heart, it is an apocalyptic vision. It has three parts. The first one is called Inferno or Hell. The second one is called Purgatorio or Purgatory. And the third one is Paradisia or Paradise. Now, Dante is part of a movement which we'll talk more about in the class. You could even say he's the leading light of this movement that wrote poetry in the vernacular at a time when everything important in Western Europe was still being written in Latin. And this, Dante, very consciously in this, ties himself to Virgil, the Roman poet who wrote his great epic in Latin at a time when everything. Which was the vernacular for Virgil at a time when everything important in Europe was being written in Greek. Right. So there's a. There's kind of like a."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":520.32,"end":552.16,"speaker":"Jonathan Pageau","text":"An analogy between him and. I think that for us, I think probably for you as well, but I know for me, Dante is one of the reasons why I wanted, you know, that Matthew and I wrote God's Dog as a comic book or as a movie. Like, we. We had this vision that in some ways, these great moments in transition are these great moments in kind of symbolic capture, recapturing. They happen in a way that tries to inscribe it, you know, in the lowest possible form, you know, as. It's alluding to all these higher forms as well."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":552.32,"end":569.12,"speaker":"Richard Rohlin","text":"Well. And what's really interesting about this is that Dante sort of invents Italian as he's doing this, like, the dialect of Italian that he's using. I mean, there's not. There's not a single Italian language at this point. Right. There are all these local dialects that are more or less. I mean, like, Italian is."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":569.12,"end":569.4,"speaker":"Jonathan Pageau","text":"Is."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":569.4,"end":574,"speaker":"Richard Rohlin","text":"You know, it's like bad Latin. Hold on. Yeah, I just had some pop over here. There we go."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":574.16,"end":575.2,"speaker":"Jonathan Pageau","text":"So it's French, you know."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":575.2,"end":824.74,"speaker":"Richard Rohlin","text":"Yeah, French. French is worse. Latin and. No, I'm kidding. I'm kidding. I'm k. Actually, guys, just so you know, like, one of the most fun things about hanging out with Jonathan is that somebody will call him on the phone and he'll start speaking French, and it's just like, what is this? This is. So. Yeah, it's. It's it's really, it's, it's, it's really cool. I, I really, as somebody who loves language, but mostly spend. Spends most of his time studying dead languages. Whenever I meet somebody who's, like, legitimately bilingual, and I, I know lots of people who are, but. But people who can just like, switch back and forth, you know, it's just amazing. It's amazing. So anyway, it's very, very fun to watch. Okay, so Dante sort of invests the Italian language. This is what I was trying to say, and what I mean by this is that the dialect of Italian that he uses is kind of. It's a, It's a literary dialect. He's pulling in pieces from Latin. He's pulling in pieces from his own Florentine dialect. He's actually also pulling in other pieces from other parts of Italy. And this goes a long way, so sort of establishing the Italian language. And there's nothing unusual about this, by the way. Obviously, in English, we have Shakespeare and the King James Bible. Basically. The idea is that, you know, if sometimes a defining literary work in your language, you know, especially anything that was written right at that time when things were moving from the medieval to the modern, right, that little handover right there, that is when. That's when your, your. That's when your great literary epics tended to have been written. And then that in turn kind of defines your language in certain ways. All right, so Dante lives in the midst of an incredibly tumultuous political time. There are basically, let's say, two primary political factions in the Italian peninsula. They're the Guelphs, and they support the papacy. And then there are the Ghibellines, and I'm not even going to try to say those in Italian, and they support the Holy Roman Emperor. And what happens in Dante's lifetime is that the Guelph party, which. So which is pro papacy and which Dante is a member of because his family is a member of it. After they drive the Ghibellines out of Florence, they split into two further parties. There are the white Guelphs and the Black Guelphs and essentially the White Guelphs, which is the party that Dante is going to end up belonging to. They want more freedom from Rome, and the black Gulfs take a really hard line on papal control. Now, all of this, the reason this is happening is it's all tied up with something called the investiture controversy, which basically has to do with kind of the Holy Roman Emperor and the Pope of Rome being basically rivals in terms of who can Appoint bishops who can, do, you know, which is what the controversy's name refers to, but who can do other things in, in the Holy Roman Empire. And so one of the things that happens in the Italian peninsula is the Italian peninsula, you know, all of these city states, you know, Milan, Florence and so on, are part of the Holy Roman Empire, but they're going to start pulling away from the Holy Roman Empire over the course of, of, you know, the next couple of centuries. And that's all part of what's going on in Dante's time politically. And let us just say that when I say that there was, this was a, an incredibly tumultuous political time, what I really mean is it's an incredibly stabby political time. Like, you can really see how, you know, these people's descendants eventually become like the Mafia. Like, it's, it's, it's, it's an incredibly violent period. Incredibly violent period. Violent in a personal way. You say human history has always been violent, but nowadays we're violent from a distance. Right. And so we have the ability to kill large numbers of people from a distance without really getting our hands dirty. This is more the kind of like, invite somebody over to dinner and then stab them in the back kind of violence. Right. You know, and so all this to say we won't get too much into this except to sort of explain who the major players are so that I think the illusions."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":824.88,"end":833.08,"speaker":"Jonathan Pageau","text":"I think for people to need to understand. The investiture controversy. I don't know if I've talked about it a lot in my videos. It's very important in terms of."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":833.08,"end":833.76,"speaker":"Richard Rohlin","text":"Let's do it."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":833.76,"end":929.28,"speaker":"Jonathan Pageau","text":"Yeah. In terms of understanding kind of the, the structure of the world and, and how things lay themselves out. And how is, what's the difference between authority and power and how these things function? Because one of the, one of the, the issues was that, you know, the Pope, in theory is the one who crowns the emperor. And this is something that, you know, started with Charlemagne but also started, you know, is, I think is also real, at least ritually in the Byzantine Empire, that is that the, that the patriarch is the person who ritually will crown the, the emperor. Now, in the west, this became a serious problem because it seems like in the west there's a confusion between authority and power. And this has to do with the fact that the Pope is in many ways left on his own and has to have an army and has to have. Act almost in some ways as often as a civil authority. And so because of that, there's this Weird confusion of what, who has the power to do what. And so the, the, the Bishop of Rome, what he would do is use the fact that he could crown the emperor to obviously try to get the emperor to do what he wants. And then the emperor would use the fact that he has a lot of people with weapons to be able to get the Pope to do what he wants. And so you have this, this tension that is not only in the Holy Roman Emperor, but Empire, but also ends up happening in France with the King of France and these different characters where you all, you have this tension between what we could call spiritual authority and temporal power, that, that it's not clear what one is supposed to be and how it relates to the other person."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":930.08,"end":971.75,"speaker":"Richard Rohlin","text":"This is the, this is the defining conflict of the late Middle Ages. And when I say it's actually not even correct to say the investiture controversy as though there was only one, because it really happened in waves. Right. So there is a, the investiture controversy that happens in like the 12th century, but then, but then that continues to have these ripple effects all through especially German and Italian political life, which is part of the reason that, that neither one of those areas even forms a cohesive nation state until the 19th century. The Reformation goes back to this, right? What do you think those German princes, you know, who backed all the reformers."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":972.23,"end":973.55,"speaker":"Jonathan Pageau","text":"What is it they really want?"}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":973.55,"end":999.85,"speaker":"Richard Rohlin","text":"Yeah, well, I mean, you don't even have to be cynical about it. Like, you, you could just say that there's like, there's already this precedent set, right. There was always already this push, pull, like. And so what they sort of saw themselves doing is sort of continuing this. Let's, let's continue to neuter the power of the Church, let's continue to, to elevate the state as the right. But that's already the controversy that controversy has going on for hundreds of years before the Reformation. Yeah."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":999.85,"end":1084.53,"speaker":"Jonathan Pageau","text":"And so, and you can look at it like, if you take the Bible as an example to kind of understand the relationship between the two in Scripture, the way that God sets up the covenant with Israel is that those that are the spiritual authority in the sense that they hold the ritual power and they are the ones who manage the sacrifices and all that, they do not have land, they do not rule over, over, over a land in Israel. And therefore their function is to be a spiritual authority. And that means that they have certain ways that they can influence the world, but they're not meant to influence them directly towards mechanical, with mechanical causes that you're not supposed to beat up people. You're not supposed to fight, you're not supposed to do that. And in that way, when that happens, then ultimately what you want is, you want then the temporal power to submit to that spiritual authority and then be, in some ways the arm of the guiding principles that are held by the priestly caste. And so they, they're the ones who enact the laws. They do the things they, you know, they have to put people in prison. They do that. And in the, in the west, there, there is that structure. Like it's there implicitly. Right. So, for example, when you hear about witch burnings, like, the Church has never burned anybody in its entire life, never happened, what it always did. If it had a problem with someone, it was. It would judge them for their spiritual reason, and then it would hand them over to the state for the state to do the action. That's the usual relationship."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":1084.53,"end":1084.89,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":1084.97,"end":1101.37,"speaker":"Jonathan Pageau","text":"But what happens in, in the west is that you start having this problem where there's a confusion at first, I think, with the Pope trying to act like a king. And when that happens, like when there's this, when there's a confusion of levels, this is the whole, by the way, sons of God, daughters of women thing."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":1101.37,"end":1102.17,"speaker":"Richard Rohlin","text":"Like, that's right."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":1102.17,"end":1114.88,"speaker":"Jonathan Pageau","text":"When the, the authority, when the people stop, try to take what's from what's below in a, in an, In a legitimate way, then it creates a, a destabilizing force and it leads to revolution, ultimately."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":1115.04,"end":1116.32,"speaker":"Richard Rohlin","text":"Yeah, Anyway."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":1116.32,"end":1118.12,"speaker":"Jonathan Pageau","text":"Yeah, that's the way to think about it."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":1118.12,"end":1164.54,"speaker":"Richard Rohlin","text":"Well, actually, I mean, I think that this is all really important. Obviously, for Dante, it's the main thing. It's the whole enchilada. And, and Dante comes down, eventually, he comes down on the side of the Holy Roman Emperor in all of this. And so he keeps. Oh, yeah, he's. He's really looking for the Holy Roman Emperor to bust into Italy and clean house. This is what he really wants and this is what he tries to prophesy, and it sort of never happens. And anyway, we'll get into all of this. But this is what Dante really wants eventually, because what he sees. And, and actually, just, just, just for fun, since this is universal history, Dante blames Constantine, you know, but, you know, which is kind of a meme these days. But the reason that he blames Constantine is because there was a fraudulent document."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":1164.62,"end":1165.1,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":1165.1,"end":1220.26,"speaker":"Richard Rohlin","text":"That was forged by the papacy or by somebody in the west called the Donation of Constantine. And, and it was used to support the papal claims of, of the, the Pope as sort of the the ruler of the west over the. The Emperor of Constantinople and the, and the Orthodox Church. And anyway, it's just a whole thing and I'm not trying to be polemic about this. Everybody knows it was forged. The west figured out that it was forged in the 14th century. So everybody knew this document was forged, but in Dante's time, they thought it was genuine. And in the Donation of Constantine, what the document basically said is that the West Empire, the Western Empire, was left to the Pope upon Constantine's death. And so the Popes were using this document to support the claim, not just against the east, but also against the Holy Roman Emperors, to say, actually we're the ones who should sort of be running the show."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":1220.34,"end":1222.34,"speaker":"Jonathan Pageau","text":"So upon Constantine's death."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":1222.42,"end":1223.42,"speaker":"Richard Rohlin","text":"Yeah, upon Constantine."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":1223.42,"end":1225.22,"speaker":"Jonathan Pageau","text":"I mean, they should have known this was a fraud."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":1225.22,"end":1353.46,"speaker":"Richard Rohlin","text":"Well, yeah, I mean, it took them a little while to figure it out again, to be fair. Like they, it was even. It was still like pre modern times when they figured out it was a forgery. So, but, but at Dante's time, they still think it's genuine. And Dante uses the Donation of Constantine. It's something he talks about more than once in the comedies we're going to see. He uses it to direct blame Constantine for you gave all of this temporal power to the Church, which has corrupted the Church. And so this is Dante's. One of Dante's major themes is that when the Church holds large amounts of temporal power, that it, it, that it corrupts what the Church is supposed to be, which is the bride of Christ. Right? So Dante, Dante is. Let me just be very clear, he's a very faithful Roman Catholic, he's a faithful son of his Church, but he also, as a faithful son of his Church, sees the way that it has been corrupted by everything that's going on in, in Italy and in Germany and in that area that's really that. That they used to call the Holy Roman Empire. So we'll talk more about all of this stuff, but I do want to kind of point out one of the reasons that it is important is because Dante is living at a time when the world is falling apart. You can say the medieval consensus is about to start breaking up in certain ways. And all of this is kind of endemic in the political strife that's going on in Italy at this time. And what Dante shows us is a way that you can take this cosmology, right, that you can take this model, what C.S. lewis called the medieval model, and integrate it into your life as a way of sort of making sense of things when you see the world falling apart. And I'll say some more about that in just a moment. Basically, after the black gulfs seize power in Italy, Dante is specifically in Florence. Dante is exiled, and he's exiled and he's actually condemned to death in absentia by his own city. And this is a. A death sentence that the city of Florence, by the way, officially revoked in 2008. So relatively recently, they actually revoked the death. The death sentence on Dante."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":1353.46,"end":1354.06,"speaker":"Jonathan Pageau","text":"That's hilarious."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":1354.06,"end":1362.94,"speaker":"Richard Rohlin","text":"Who is certainly the most famous Florentine who's ever lived. Probably. But yeah, finally, finally, finally, they keep."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":1362.94,"end":1364.22,"speaker":"Jonathan Pageau","text":"Their grudges very long."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":1364.22,"end":1398.22,"speaker":"Richard Rohlin","text":"Yes, yeah, right, exactly. Yeah, yeah. Some kind of a stereotype there. Sure. So while he's in exile, Dante, who up to this point has been a successful poet of love poetry and also a relatively unsuccessful politician, he goes through a crisis, and it's in this crisis, in this, what he calls the midpoint of his life, that he writes the Divine Comedy. So the Divine Comedy, I should start out by saying, is a comedy not because it's haha funny, although there are some haha funny moments, especially in Inferno."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":1398.22,"end":1398.62,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":1398.62,"end":1400.62,"speaker":"Richard Rohlin","text":"Where obviously you'd put all your jokes in hell."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":1400.62,"end":1401.22,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":1402.02,"end":1604.18,"speaker":"Richard Rohlin","text":"Really, there are no jokes in paradise. So actually they do put all the jokes in hell. And I will just say the jokes, I mean, this is like quality stuff, people. Like, if you were. If you were hoping to read the greatest work of Western literature, which I do believe the comedy is in which demons fart out of their butts like trumpets. You. I mean, sign up for this class. We're going to have. They're going to be butt trumpets. Like, like people in the Middle Ages. Like, these are their only two registers. Right. It's like, let's contemplate the mysteries of the Divine Trinity or. But trumpets. And there's nothing. Nothing in the middle. There's nothing in the middle. So. So, yeah, it. There, there are. There are some jokes in here. It's mostly kind of body humor, but. But a comedy or comedia. Right. Means that it's a story that starts low and ends high. So it starts out bad, but it ends happy. Right. That's the. And then there's the divine is the modifier to that. Right. That this is not just a comedy about some kind of earthly life, but this is the Divine Comedy. So it's the Comedy of this, the whole story of redemption, the whole story of salvation as experienced by one man. Right. As experienced by one man. So the Comedy has its roots in kind of Three sources. The first is the romantic poetry of the troubadours and the courtly love tradition. And this is where Beatrice comes in. Dante's actually part of a whole new movement called the Sweet New Style, which makes me feel like they're all wearing berets and smoking French cigarettes. But anyway, you know, or they're. Or they're like hip hop artists or something, I don't know. But this is where Beatrice comes in. So Beatrice is a very important figure for the comedy. I'll say a lot more about her actually in the purgatorial class. We'll do a small introduction to her in Inferno, but she really becomes important in Purgatorio and Paradisio. So Beatrice is this girl that, that Dante meets when he's. He's nine years old and she's eight. And Dante claims that they only ever met twice. They might have met more than twice, but the point is they didn't meet often. But Dante writes about the two times that they met. Once when he was nine and the other when he was 18. So nine years apart. So they only ever meet twice. And actually one of the times that they met in person, like his conduct had been so bad with like other young women in the city that she wouldn't even speak to him and she wouldn't even speak to him in the street. So. So when we say that it was love at first sight, obviously we're not talking about boy meets girl, you know, kind of, it's something, something a little different here. You. The way to think about it is that Beatrice is sort of his great muse. She's the impetus for the events that kick off the Divine Comedy. But their love was never, it was never mutual. There's nothing to indicate, for instance, that Beatrice ever knew, reciprocated or even knew about Dante's affection for her. They both marry different people. She dies when she's 25. And as we're going to talk about in the. More in the class, there's this element of being unattainable is actually a key feature of the courtly love tradition. So it's actually, it's actually like part of why it works. And what Dante is going to do is take this courtly love tradition, which is, which is a weird and almost non Christian part of the medieval tradition. It's like very. Well, it's very problematic if you want."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":1604.66,"end":1607.3,"speaker":"Jonathan Pageau","text":"It was actually declared heretical at some point."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":1607.3,"end":1686.8,"speaker":"Richard Rohlin","text":"Oh yeah, especially, especially when it was when you get into the more like the religion of love kind of thing stuff where Basically you're worshiping Eros as a God and whatnot. But Dante's gonna take that tradition and integrate it into the greatest Christian epic. He also does this with the Greco Roman epic tradition, particularly Virgil's Aeneid. We already mentioned that the Aeneid is, is one of Dante's main touchstones. You could almost say it's one of his main justifications for why he can tell a story in this way. Because Virgil already did it. And of course the Aeneid, like the Odyssey has a descent into the underworld and, and Dante will use elements of that descent, Aeneas's descent into the underworld, he'll use elements of that in the Comedy to kind of tie all those things together and then he'll just make other references to Greco Roman mythology. If you want to, if you want to get a sense of how people in the Middle Ages freely made use of and references to Greco Roman mythology in a way that freaks out, you know, like, I don't know, homeschool parents now you can. Yeah, the Comedy is, is, is really the best example that we have going. We'll talk more."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":1686.8,"end":1691.3,"speaker":"Jonathan Pageau","text":"It's also such a example to the way that people imagine what Christianity has always been."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":1691.3,"end":1691.78,"speaker":"Richard Rohlin","text":"That's right."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":1692.02,"end":1719.66,"speaker":"Jonathan Pageau","text":"This idea that Christianity was this, this, this, this closed minded thing that they got ridden of all the old stories that you know, they were just, you know, they, they really. Dante is the best example of universal history that you can find in the sense that he really tells the story, he, the story of his own people and you know, going all the way back to the, to the Greeks in a manner that is completely conjoined with his Christian, Christian faith. So it's, it's pretty and to the."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":1719.66,"end":1784.75,"speaker":"Richard Rohlin","text":"Point that he will, I'll just scandalize people a little bit ahead of time. Like he'll, he'll especially, especially in the Comedy or in the Inferno. Especially in the Inferno, which is where most of these reference. You'll find most of these references because in Hell you meet people from Greek and Roman like mythology and myth. Like you meet people from the Iliad and the Odyssey and Seven Against Thieves. Like you meet those people in hell. Right. So they're in hell. Why? Because they blasphemed God. But if you go back and look at the story of this guy who blasphemed God, it's he cursed Job, he cursed Jupiter. Right. And so yeah, it's really interesting. So we'll talk a lot more about that and look at how and why he integrates these things and why what he's doing is okay. But the other touchstone. So if you studied the comedy in college, you were probably told about the Romantic poetry and the Greco Roman epics, but you probably weren't told that There's a third touchstone, a third launching point for the comedy, and that is the. The Judeo Christian apocalyptic tradition."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":1784.75,"end":1785.31,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":1785.55,"end":1909.72,"speaker":"Richard Rohlin","text":"So in the ancient world, in ancient Judaism, especially second Second Temple Judaism, and then. And then starting with the Book of Enoch and then into Christianity, the most important Christian apocalypse is of course, the Apocalypse of St. John. Like the Book of Revelation, there is a tradition of. Of a story, and the story always starts in the middle of something really bad. Right. Always starts in the middle of something really bad. So your people are being persecuted or you're in exile or what? Right. St. John is on the island of Patmos. The Church of God is being persecuted, but he was in the spirit on the Lord's day. Right. And then he has this vision. And so then what happens is you're given a vision of, let's say, like the eschatological reality of the cosmos. So that is to say, sometimes it's the afterlife, but it's more than the afterlife because, I mean, for instance, The Apocalypse of St. John is. Doesn't really show you the afterlife per se. It kind of shows you the way that everything wraps up and comes together. So it's the eschatological vision of things. But I mean, the word apocalypse means the pulling back of the curtain. Right. Actually, if you've ever gone to an orthodox liturgy, all orthodox liturgies are apocalyptic because at the moment when we pull back the curtain and Christ is revealed. Yeah, Right. So one of the defining features of the apocalyptic tradition, let's say there are two defining features that, that almost every apocalypse has in common. There are variations on this, but they're pretty. It's pretty standard across the board. One of the things that is done is that the person who is being shown the afterlife or being shown the eschatological reality has a guide. The guide is usually an archangel. In some later Christian apocalypses, the guide is also sometimes Saint Peter or the Virgin Mary. Yeah. Dante takes this tradition and turns it on its head a little bit because he has his guide be a pagan poet. Not just a pagan poet, a pagan pre Christian poet."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":1909.72,"end":1926.6,"speaker":"Jonathan Pageau","text":"Yeah. But, yeah, it makes so much sense. It makes so much sense because obviously this. This guide is the one who brings him through that which is not in the. Let's say that's not contained in the identity of Christianity."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":1926.6,"end":1926.88,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":1926.88,"end":1944.88,"speaker":"Jonathan Pageau","text":"Everything that is outside or below or. Or ambiguous is. Is being brought about by Virgil. And then as soon as he gets to Purgatory. Purgatory is really the beginning of paradise, by the way. It's hard for people to think that it's like. Because whoever's in purgatory is gonna. Is gonna at some point, gonna make it up the mountain."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":1944.88,"end":1952.12,"speaker":"Richard Rohlin","text":"Yeah. Well, Virgil leaves at the end of Purgatory, but right before he gets into the. The earthly paradise. Which is. Yeah."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":1952.12,"end":1953.12,"speaker":"Jonathan Pageau","text":"Which is pretty amazing."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":1953.2,"end":1977.3,"speaker":"Richard Rohlin","text":"Yeah, Yeah. I mean, that's the crazy thing, like Virgil leading you through hell. Okay, that kind of makes sense to me. But then you get this idea that Virgil is not. Not only is Virgil leading you through Purgatory, but the entrance to purgatory is guarded by Cato, who is a Roman philosopher who committed suicide. So there's all kinds of crazy stuff here, guys, and I'm really excited to talk about it. Yeah."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":1977.3,"end":2008.87,"speaker":"Jonathan Pageau","text":"But also, like, the fact that even. That even Virgil can hear the voice, you know, because there's this succession of intermediaries that kind of invoke Virgil to come to Dante. You know, it starts with the Virgin, and then there's Are different saints and Beatrice, and then there's this really, this beautiful image of kind of divine procession, you know, kind of grace coming from above through the different levels that can handle it. Up to the. Up to this encounter with. With Virgil. It's very, very beautiful image of reality and a very powerful."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":2008.95,"end":2074.3,"speaker":"Richard Rohlin","text":"So that comes down because basically Virgil is sent by Beatrice, and Beatrice is moved to send Virgil by the virgin Mary in St. Lucy. Yeah. And this is getting a little bit of a head of ourselves, but let's say St. Lucy is. Is very important. She's one of the. She's one of Dante's heavenly patrons. St. Lucy is, who's actually one of my family saints. She's the patron saint of blindness and blind people, but also the patron saint of poets or one of the patron saints of poets. So Dante is a poet, but he is also struggling with a certain kind of blindness. And there's a theme of blindness and the recovery of sight, the strengthening of sight. This is one of the main themes of the Comedy. And so there's this procession down from The Virgin Mary, St Lucy, Beatrice who's also a saint in the Comedy, down to Virgil, who's then sent for Dante. But then Dante, he proceeds down through hell up the mountain of Purgatory. He gets up to the top of Purgatory. Virgil hands him off to Beatrice. Beatrice that will later actually Hand him off to St. Bernard."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":2074.3,"end":2074.98,"speaker":"Jonathan Pageau","text":"St. Bernard."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":2074.98,"end":2136.04,"speaker":"Richard Rohlin","text":"Right. And right. Because there's, like, somewhere that even actually Beatrice can't take him. Right. So now he's got to go now. Now he's got to. To rise beyond even the idea of love as Dante understands love, and into the realm of pure contemplation. So, anyway, this is. This is really cool stuff. Actually. Paradiso is probably my favorite book of the comedy to go through, because almost nobody has read it. That's not the only reason. But almost nobody's read it. People read Inferno usually in high school, and then they never get farther than that. A few people might have read Purgatorio, but. But not a lot of people have read Paradisio, I think, because holiness is less interesting to most people than. Than wickedness is. Right. Like, there's a certain, like, math in the Inferno that kind of makes sense to us. But then when you. When you get to Paradisio, people suddenly start getting very offended by the idea that there are also levels in heaven, like there are also tears in heaven, and that some people get more of God than. Than other people. And by the way, this is one of the key ideas of the comedy is that everybody gets as much God as they want."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":2136.57,"end":2137.29,"speaker":"Jonathan Pageau","text":"Yeah, exactly."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":2137.45,"end":2139.05,"speaker":"Richard Rohlin","text":"Yeah, this is one of the key ideas."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":2139.21,"end":2157.85,"speaker":"Jonathan Pageau","text":"Yeah. And this is. I mean, this is something you see, you know, taken up all the way into CS Lewis or even into a lot of orthodox visions of. Of. Of the river of fire and all these ideas, which is, in some ways, you are where you want to be. You're always where you want to be. You're not. You're not. You know, if you're in hell, it's because you actually want to be there."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":2158.25,"end":2350.26,"speaker":"Richard Rohlin","text":"And that's definitely the case for Dante. It's actually what Lewis says about Dante's version of hell is that it's locked from the inside. Right. Everybody. Everybody that's in there is in there because they want to be there because they denied God and really what it is. So let's talk a little bit about the. Each of the three books. So each of the three books has 33 Kantos. And then. And then there's. And then Inferno also has a prologue, so to make it a total of 34. So that means there's 100 cantos total. So a canto is an Italian word, means like a song, but basically think of it like chapter divisions or something, if that's helpful. And in Inferno, Dante begins a descent into the abyss on Good Friday. And this is after basically coming up, faced with his sin, and also the kind of the sins of the Florentine and Italian people that are allegorized as these three beasts, he can't get past them. And he's lost in a dark wood, as he says. Definitely know that feeling. And so Virgil is sent to guide him, but in order to save him, in order to recover him, he's got to actually go through hell first. And this is a very deep Christian understanding that you always have to go down to go up, and you always have to descend to ascend. And so he goes down, descends into the abyss on Good Friday, following the path of the heroine of Hades, the heroine of Hell, to finally emerge on Easter morning out the other side of the world, literally. And the Inferno is really about confronting sin, right? Sin ultimately, it's about confronting Dante's own sins. Right? Sin in the city of man, the way that. The way that humans sin. And there's a very particular ordering of sin in the Inferno that we're going to talk about. But one of the main ideas about sin in the Inferno is that sin erodes our personhood, so that Dante's Hell is full of people who have ceased to be people. They are people who have chosen to identify so strongly with their sins that they have essentially ceased to be human persons. And this is what we mean when we say that it's locked from the inside, right. These people have effectively become their sin. And this is the whole idea of, you know, there are all these gory, horrifying punishments in the Inferno, but none of the punishments are arbitrary. Every single one of the punishments in some way sort of shows what the person. What the person became all along. And so, and this is a, this is a feature of the, of the. This is a feature of the. The Christian apocalyptic tradition, this idea. But it's more than just let the punishment fit the crime. Right? It's more than that. What it really is is the, the punishment is really just the sinner living with himself. Right. And so. So you can. You can very clearly see what they became. Right. Or sometimes living with other people. If hell is other people. I mean, some of the people in hell, that's definitely being stuck with those people until the Day of Judgment."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":2350.41,"end":2350.73,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":2350.81,"end":2351.77,"speaker":"Richard Rohlin","text":"Is a bad time."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":2352.73,"end":2371.29,"speaker":"Jonathan Pageau","text":"I want to ask you just one question, though. Like, this is because, you know, we, we mentioned that this is part of the Christian apocalyptic tradition, the Jewish and Christian apocalyptic tradition, you know, so we have all these images, you know, whether it's the book in Enoch 3, I guess, is that the one where they. He goes up first."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":2371.29,"end":2371.85,"speaker":"Richard Rohlin","text":"It's in first."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":2371.85,"end":2387.6,"speaker":"Jonathan Pageau","text":"It's in First Enoch. In First Enoch, you have this ascent. He goes up. He sees the processes of the, of the heavens. You see that in many texts. But you know, where is there precedent for the descent into Hades? I think you mentioned Third Esdras."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":2387.6,"end":2437.75,"speaker":"Richard Rohlin","text":"Well, he does see it, and he does see it. You do see where the wicked are punished in. Actually, you see in First Enoch, going all the way back, you do see where the rebellious stars are punished. And actually the word that's also used in Jude, in Jude's Epistle, that's used in Enoch for the stars who abandoned their. The angels who abandoned their proper place for the stars. The word is planet, by the way. A wandering star. Right. That's a. Anyway, which is fun to think about because then you think about the fact that the ancient Romans and Greeks identified the planets with the various gods who are sort of like in the Enochian tradition are actually fallen angels. Anyway, that's all very fun and interesting. We'll talk about it about that one of these days."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":2437.75,"end":2440.67,"speaker":"Jonathan Pageau","text":"But so he. In, in Enoch, he sees the place where they."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":2440.67,"end":2558.74,"speaker":"Richard Rohlin","text":"So he sees the place where. He sees the place where they're being punished, and he also sees the place where the wicked are being punished. And by the way, it's freaking. Like, it's. It's weird. Like, it's like he's describing like a gravity well or something. Like it's a really. It's a really evocative description in First Enoch. So. But yes, in. In our last video, I said Third Esdras, but I, I was wrong. It's actually Fourth Esdras or Second Esdras, because those are the same book for various reasons. So you can see how one bite confused these things. So in 4th Esdras or 2nd aka 2nd Esdras in some numberings, you have a very clear descent as Ezra is taken down into the underworld, he's taken down into Sheol, and he's shown very clearly the famous sinners and the ways that they are punished. Right. And I, I've sort of. I. I sort of situate the beginning of that particular tradition with that book. Yeah. And then it. There's something that gets riffed on, especially in the. There's some later Christian apocalypses that were very popular in desert areas, let's say, because people who live in the desert seem to like extreme stuff. I don't know what's going on with that, but it's one of those. One of those things is like, yeah, the Most extreme forms of Christianity always came from people who are living, you know, just like, you know, in constant danger of starvation and being killed by wild beasts and whatnot. But so there's the Apocalypse of somewhat sometimes called the Apocalypse of St. Paul or the Visio Pauli. But it's also that text is part of like a whole cluster of similar texts that are related to each other that were very popular starting in about the 2nd century A.D. so anyway, all of that to say we actually talked about one of those. We talked about the Visio Pali in the Ve class, but it's also related to Dante. So, see, it is all connected."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":2558.74,"end":2585.27,"speaker":"Jonathan Pageau","text":"It's all connected. Yeah. So there. So what's important is to understand that this image of dissent, there's a precedent for it. There's obviously a precedent for it in the Apocrypha, the Gospel of Nicodemus, like the Apocrypha that shows Christ going down into. Descending into Hades, descending into Hades and kind of freeing the, The, the, the people there. So I have a big question for you, because actually, I don't know the answer to this."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":2585.27,"end":2586.23,"speaker":"Richard Rohlin","text":"Like, go, go for it."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":2586.63,"end":2621.99,"speaker":"Jonathan Pageau","text":"We often in, in orthodox thinking will say there's a difference between Sheol and Gehenna, right? So it's like there's a difference between the idea of, of the, the realm of the dead that does have some. Seem to have some aspect of. Of suffering of, you know, or of a lack of personhood. Like, and then they're the image of the, the fire that comes from the throne of Christ at the end of time. So one of the impressions that I have when I read, when I read Dante was that that all gets, that all gets kind of joined together, like it's just all the same. I don't know if you have that."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":2622.71,"end":2675.33,"speaker":"Richard Rohlin","text":"So sort of, if Dante makes it very clear throughout the Comedy that everybody in his afterlife is still awaiting the general resurrection, okay. And the Last Judgment. So these, these people are still awaiting the general resurrection and the Last Judgment. And this actually comes up in particular because there's some sense that maybe suicides won't get their bodies back at the general resurrection because they've already rejected their body. And so this kind of comes up because Dante's like, asking about, well, what happens to suicides at the resurrection if they've already. Yeah, so. So everybody in Dante's version of hell is awaiting the general resurrection and some other fate. So he still, he still has that, like, especially important, slash troubling when you're, when you start talking about limbo. Right. So the people in limbo are the righteous pagans, also unbaptized children and."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":2675.33,"end":2678.89,"speaker":"Jonathan Pageau","text":"And the righteous Muslims even. Not just ancient pagans, right?"}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":2678.89,"end":2680.81,"speaker":"Richard Rohlin","text":"Yeah, yeah, yeah, yeah, yeah."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":2682.09,"end":2684.73,"speaker":"Jonathan Pageau","text":"Not that big, which is a big deal to me."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":2684.73,"end":2687.37,"speaker":"Richard Rohlin","text":"Not that Dante is at all soft on Muhammad, by the way."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":2687.91,"end":2688.79,"speaker":"Jonathan Pageau","text":"No, no, no."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":2688.87,"end":2690.79,"speaker":"Richard Rohlin","text":"We. Yeah, we're gonna see what happens to him."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":2690.79,"end":2692.99,"speaker":"Jonathan Pageau","text":"Yeah, I think it. Was it Saladin."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":2692.99,"end":2698.79,"speaker":"Richard Rohlin","text":"Saladin, yeah. Which who everybody really just, like, had a huge crush on in the Middle Ages."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":2699.03,"end":2702.95,"speaker":"Jonathan Pageau","text":"He was a better. He was like a better knight than the Christian knights. Like, he was more virtual."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":2702.95,"end":2865.85,"speaker":"Richard Rohlin","text":"Right. Yeah. Very, very honorable man by, you know, at least, you know, according to the standards of his time and the way that people in Western Europe thought about him. That's a very interesting. Actually, that's a hugely interesting study. Somebody wants to do like a master's thesis or something. Look at the ways that the Crusaders wrote about Saladin. But anyway, okay, so you've got these sort of like, righteous pagans and these other categories of people. Basically, people who were not baptized, people who didn't have an opportunity to be baptized, etc. They're in limbo, which is the first circle of hell. But it's pretty nice. Like there's no torment. Yeah. Their only torment is that they don't have hope. And when we say hope, the Christian virtue of hope is in. It is not. I just. We're going to talk about the virtues in the class because the. The. There are certain things that you need to understand to read medieval literature. I have a little list. It's almost like a little catechism that we're going to go through. And one of the things is, these are the seven medieval virtues. Right. And here's the deadly sins and here's the stuff like this. You gotta know these things. At some point, this was part of everybody's education, like religious, academic, whatever. And then at some point people stop. Stop learning about this. But the Christian virtue of hope is not a vague, I hope things will get better. It is a hope in the resurrection in particular. Actually, Christians, we don't expect things to get better in this life. Not really. Right. But the thing that we're looking forward to is in particular, I look for the resurrection of the dead and the life of the age to come. That is the Christian virtue of hope. So these people live in relative ease. It's basically. It's basically the same place where the righteous, or let's say where the virtuous are in. In Virgil's Aeneid, like when. When Aeneas goes to the underworld and he meets his ancestors and they're there and they, they get sort of like they, they've forgotten the, their earthly sufferings and things like that. Right. So that's where they are. That's what limbo is. But they don't have any hope, that is, they have no hope for the resurrection. So what does that mean? What are the long term implications for those people? That's one of the things that we're going to talk about in the class. And I'll just say like, obviously Dante is a particular person writing at a particular time and a member of our particular, of a particular church. Not all of Dante's theology is my theology. Obviously I'm an orthodox Christian. We're going to disagree on some things. Will you agree on more things? Obviously. But what I want to, what I want to focus on is what is, what does Dante think? What is Dante saying about the world?"}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":2866.49,"end":2892.71,"speaker":"Jonathan Pageau","text":"I also think that there are some really interesting images that he uses. So he says certain things and then he also alludes to other things by some of the images. Like in Limbo, there's this is image of them going up a little. Like they go up a little and then there's like they have some light that comes from above. And I'm thinking, yeah, that's a very interesting image that he's using right there in the, at the portal of hell, you know, as he, as he talks."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":2893.11,"end":2905.19,"speaker":"Richard Rohlin","text":"There are also so many weird exceptions to even Dante's own rules, you know, where, where, where, where Dante is like. And what it really is, is Dante is wrestling with things in the tradition that seem to be incongruous. And he's trying to put it all together."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":2905.19,"end":2905.67,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":2905.99,"end":2922.71,"speaker":"Richard Rohlin","text":"So I'll just like a little spoiler. You're gonna meet Trajan who's a pre Christian Roman or was not pre Christian. He, he persecuted Christians. Right. In fact, the Emperor Trajan's daughter is a saint and he killed her because she was a Christian. Right. So you're going to meet him in paradise."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":2923.27,"end":2924.87,"speaker":"Jonathan Pageau","text":"Yeah, well, because of that story."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":2925.27,"end":2926.23,"speaker":"Richard Rohlin","text":"Yes. Don't tell people."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":2926.39,"end":2927.59,"speaker":"Jonathan Pageau","text":"Oh, sorry, sorry, sorry."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":2927.83,"end":2943.5,"speaker":"Richard Rohlin","text":"Spoilers. Don't tell them spoilers. Spoil it. Yeah, no, there's, so anyway, there's, there's a, there's a, we'll leave that one as a teaser. Obviously people can just go look that up, but you can't actually spoil something that's more than, you know, a thousand years old."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":2943.82,"end":2944.62,"speaker":"Jonathan Pageau","text":"Yeah, exactly."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":2944.94,"end":3001.52,"speaker":"Richard Rohlin","text":"But, but the, the, the, the, my point is that Dante is wrestling with incongruous things in the tradition. And so sometimes. And the important thing is for people to understand is that Dante is not writing a manual that says the afterlife is exactly like this. He was so successful. And this often happens with. It happened in the English language with Milton as well, where. Where something is so artistically successful that it just takes over the imaginations of everybody. Right. And. And this causes all kinds of weird things downstream, especially when it comes to Purgatory. Yeah. Which we'll talk about when we get there. I. Everything, almost everything that modern people. And here I'll say orthodox Catholics, everybody thinks about. Purgatory would have been completely unrecognizable to people in the Middle Ages."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":3001.52,"end":3001.96,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":3002.12,"end":3013.24,"speaker":"Richard Rohlin","text":"And even Dante's version of Purgatory is like very innovative in certain respects. And it's because he's got a particular purpose. He's not saying Purgatory is actually like this. He's. He's got a particular purpose to what he's doing because he."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":3013.24,"end":3042.12,"speaker":"Jonathan Pageau","text":"I mean, he is. He's actually making a map of. Of reality and of the process of transformation. But then also the way that things lay themselves out in terms of. Of a hierarchy of virtues, you know, and then ultimately as vices, as their. Kind of. As their flip side. But, but that's. It's. So it's more about the ontological structure than it is about the idea of that he's just accurately describing the afterlife, although he's obviously talking about the afterlife. The way that he places beings at different levels."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":3042.12,"end":3042.52,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":3042.52,"end":3050.8,"speaker":"Jonathan Pageau","text":"More to help you understand this ontological hierarchy of being and the way that kind of God manifested himself at different levels in reality."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":3050.8,"end":3565.87,"speaker":"Richard Rohlin","text":"Mostly. What I mean by the way when I say this is that Dante's version of Purgatory is the nicest one anybody ever came up with in the Middle Ages. Previous versions of Purgatory. And I will read some excerpts. All right. Are pretty R rated. They're pretty horrifying and just really terrifying stuff. Actually, Dante's version of Purgatory is very nice. It's very, very kind of fluffy compared to. Not that. Not that it seems great either, by the way. Like some of the. Some of the things that people are dealing with. But also it is great because everybody. So here's the thing. Everybody in hell wants to be there also. Everybody in Purgatory wants to be there. Yeah. And so they're all happy to be going through what they're going so that they can be purified from their sins. But anyway, we'll talk about all of this. But I Think one of the things that I want to point out that we'll talk a lot more about is the, is the, the different ways of thinking about sin that you get between Inferno and Purgatorio. So as you mentioned, there's Dante's giving us a vision of the way that the world lays itself out or the way that reality is structured. But sin is you. Sin is kind of like an anti. Reality. And so it has its own higher. There's, there's a sort of a hierarchy to sins in the way that they, that they destroy or dement ontological hierarchies. And so in Inferno, sins are that. You could say that the defining metaphor for sin throughout the entire comedy is that sin is weight. The worse a sin is, the heavier a sin it is, the more it pulls you down, right? You don't want to go down, you want to go up, right? So the heavier a sin is, the worst the sin is, the more it pulls you down. Well, in Inferno, the heaviest sin is treachery to your Lord, right? And so at the very bottom of Hell, you have the devil, and the devil has, is chewing on the heads of three famous traitors, right. The least worse sin for Dante is actually like adultery. Now I always like to ask people like, so if you were like structuring hell, where would you put adultery? Obviously right down at the very bottom, because we're hyper focused on these sorts of sins in our society. Right. And it's actually because of the dominance of the courtly love tradition, by the way. So the idea that you would. Yeah, anyway, so, so Dante and the Dante arranges all of these other sins like somewhere in the middle there. And basically there are two categories in Inferno. The first category is, is sins like animals. If you sin in this way, you become more like an animal, right? And the second category is sins like a demon. If you sin in these ways because you're using your rational self, you become more like a demon all the way down to Satan. Well, in, in Purgatorio, Dante does a totally different scheme. Sin is the weight. But now he's, he's just following the seven deadly sins. But if you take a look at. So there are only seven, there's seven tiers to the mountain of Purgatory, whereas there are nine layers to hell, right? But as you ascend the mountain of Purgatory, what you start to realize is that the heavier sins are still like the more demonic ones. So pride's at the very bottom. It's the first tier of Purgatory because it's the first sin you have to be purified from. And it's also the worst sin. It's the sin that makes you the most like Lucifer. It's the sin that makes you most like the devil, right? So you. So. So he actually keeps the same scheme in both places, but. But, you know, you're. You're. You're encountering it in two different orders in two different ways. It's. It's one of my favorite things. And the big. The big focus in Inferno is Dante has to confront sin. So at first, in Inferno, Dante, the character feels really bad for all the people in hell, and he keeps, like, fate swooning, like, fainting, because he feels really bad for how they're suffering. And he. He's. And eventually Virgil rebukes him. We're gonna see this. Virgil rebukes him, and he makes a great pun in Italian on the words pity and piety, which are the same word in Latin, right? In Virgil's great epic, the Aeneid, Aeneas's dominant heroic trait is his pietas, which is. Which you could say is in the Latin mind, is something like his right attitude towards an understanding of his responsibilities towards the gods, towards his family, towards his people. So he's frequently. In English translations, you'll usually see him referred to as Pius Aeneas. Pius Aeneas, right. But that word pious can mean that, but it can also mean. But it also comes to have a connotation that we think of when we think of pity or, or. Or. I mean, depictions of Christ, you know, in the arms of his mother, being taken down of a cross are called a pieta, right? And so it's, it's, it's all. It has all those images contained within it. It's a really robust word. And Virgil will say, if you had real pity, you would actually be glad that these people are in hell. And the reason he says this, right, is he's making. He's punning on this word. He's saying, actually, if you had the right. A rightly ordered relationship with the cosmos. So there's something wrong in Dante's soul, and that's why he's here in this. In this dark wood to begin with. There's something disordered in a soul where he can't. Where, like, he hasn't been able to turn away from sin. He hasn't able to become a holy person, right? And so what. So what Dante, what Virgil is saying is that basically, if you really knew what sin was, if you really knew what sin was, you'd Be happy to see it punished. This is a hard pill to swallow for modern people. But we'll talk about it when we get there. But then. So Inferno is about rejecting. Is about. Is, let's say, confronting our sin and seeing it for what it really is and ultimately seeing ourselves for who we really are. Purgatorio is about rejecting that sin and becoming purified. And there's this beautiful, beautiful sense in as. As Dante is. As Dante is ascending the mountain of Purgatory, he has seven P's inscribed on his forehead, like, burned into his forehead by an angel. And they're for picatuum, for sin, the word for sin in Latin. And as he's ascending the mountain of purgatory, they. They start to fall away. And one of them falls away just like. Is like brushed by an angel's wing. And it just, like. It's just. Oh, it's so beautiful. It's heartbreakingly beautiful. And then Paradisio is about something which is almost impossible for any of us to even get. I think it's even a struggle for Dante. Like, the final cantos of Paradisio are going to become, like, increasingly difficult for us to understand because Dante is trying to wrestle with. With, I think, a very real vision of cosmic realities and of holiness. And basically it's about Dante's sight being strengthened so that he can be prepared for this ascent, so that he can finally achieve the vision of God. And that's what Paradisio is. But we got to go through hell to get there. So just to kind of wrap all this up, maybe we say that the Divine Comedy is, I think, as you pointed out at the beginning, I just want to restate. It's really, really important to our universal history project because it integrates essentially everything that came before it. It brings in the Greco Roman world. It brings in medieval cosmology and theology and science and the old Jewish and early Christian apocalyptic traditions and all of the Apocrypha. It brings all of that stuff in. There are giants, There are. I mean, it's all there in the Comedy. And what's more is that it doesn't invent, but it's probably the best example for modern readers of the idea that man is a microcosm, that every. Every human being is actually a cosmos. Dante's descent through the earth and his descent through the spheres is a deeply personal journey. And it's one that bridges perfectly, I think, the medieval and modern worlds because it. It shows us how this vision of the cosmos, this medieval model, is not merely just an external vision of things that will fall apart as soon as you put it under a microscope or into a telescope or whatever. But that it's actually something which, it doesn't just adequately describe our experience of reality on a day to day basis, but it is also a map to ourselves and to our movement through reality. Right. Our struggle to become holy people. So I'm very excited to be able to go through this with you and with the whole symbolic world community."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":3566.59,"end":3586.35,"speaker":"Jonathan Pageau","text":"Yeah, this is going to be. This is going to be great. I mean, I can't wait. And we're really going to be. Can I say this? We're not gonna, we're not gonna hold back. We're gonna, we're gonna. We're gonna take our time and really enjoy the. You know, I've been. Now obviously I'm diving back into it. I haven't read it in a few years and I just can't believe it. Like, the first Kanto is just."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":3586.83,"end":3586.99,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":3586.99,"end":3591.35,"speaker":"Jonathan Pageau","text":"I'm thinking we can just teach a whole class on the first, like three Kantos."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":3591.35,"end":3593.15,"speaker":"Richard Rohlin","text":"Well, we have to get through eight in the first class."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":3593.47,"end":3601.11,"speaker":"Jonathan Pageau","text":"I mean, the analogies that he's able to bring together, like these powerful analogies of all that which is low in scripture."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":3601.11,"end":3601.43,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":3601.43,"end":3629.22,"speaker":"Jonathan Pageau","text":"So like the, the wilderness, the. The waters, the, the animal aspect of it. Like all these images that you'll find, for example, in St. Gregory of Nyssa or in, in, you know, in the spiritual descriptions of what it, what it means to be low as analogies, but also just ease it as a, like, as a story, as a story trope of someone who's going through this. Through this is. I mean, I can believe it. Like all the lines. I was like underlining every word. Like, you can't underline every word because then what's the point of underlining?"}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":3629.22,"end":3629.5,"speaker":"Richard Rohlin","text":"So."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":3629.5,"end":3631.58,"speaker":"Jonathan Pageau","text":"So I can't wait to get into this. It's going to be wonderful."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":3631.58,"end":3651.35,"speaker":"Richard Rohlin","text":"Yeah. All right, so people, sign up, join the class. I think that for people who wanted it, this is something people asked for last time. The Beowulf class, there are like payment plans and things like that. So we've done our best, you know, to make it accessible. Unfortunately, to do something like this at the level that we're going to do it at, we do have to, like, you have to charge money because."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":3651.51,"end":3653.35,"speaker":"Jonathan Pageau","text":"Because so much time."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":3653.59,"end":3679.95,"speaker":"Richard Rohlin","text":"So much time. But I promise it'll be worth it. And like I said, we've done the best that we can to make it accessible to everyone. Even if you can't join for the live classes. If you buy the course, you'll have access to the videos and the discussion boards in perpetuity. So there's, there's absolutely no rush to like, feel like you have to be there present for every single class. But, but sign up as soon as you can. Join us and I'll see you all in hell."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":3681.47,"end":3688.91,"speaker":"Jonathan Pageau","text":"All right, everyone. And, and then for us, I think we'll see everybody after Pasca. So it'll be a weird paradox. We'll see."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":3688.91,"end":3689.31,"speaker":"Richard Rohlin","text":"I know."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":3689.39,"end":3691.75,"speaker":"Jonathan Pageau","text":"For the Dante class. And we'll see you in the ideal."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":3691.75,"end":3706.06,"speaker":"Richard Rohlin","text":"The ideal way, Jonathan, would be to start Inferno during Holy Week itself and then finish by, by the whole thing. But, but that's essentially impossible to do for people who don't know Orthodox Holy week is like 40 something hours of services."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":3706.38,"end":3706.74,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":3706.74,"end":3719.1,"speaker":"Richard Rohlin","text":"And it's just, it would be impossible for us to, to, to, to be able to do it. But. Yeah. So it is going to be a little weird. But also I'll be, I'll, I'll at least be in the mood to be like, oh, yeah, we totally, we totally harrowed this place."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":3719.18,"end":3724.14,"speaker":"Jonathan Pageau","text":"Yeah, exactly. So don't worry, folks. We're out of, we're out of there. We're just. This is just back."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":3724.3,"end":3725.56,"speaker":"Richard Rohlin","text":"That's right, that's right, that's right."}
{"episode_id":"SW - #339 - 2024-05-08 - Richard Rohlin - Universal History - The Greatest Work of Western Literature","start":3726.35,"end":3729.71,"speaker":"Jonathan Pageau","text":"All right, everyone, so we'll see you there. Looking forward to it. Bye. Bye."}
