{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":0.4,"end":105.89,"speaker":"Nathan Jacobs","text":"And if it's true, if realism is true, and that somehow these structures are divine in nature, they originate from God, whether you're a pantheist or you're a theist or you're a panentheist, you're a pagan, you're a Christian, you're some form of realist in this way, then what happens is that basic perception is already a mystical experience. So you want a mythologized world. You're already in it the moment you embrace realism. And now the reason I think that's so important is because rather than saying, well, there's a mystical side where we think about the occult and all that sort of stuff, and then there's a materialist side, rationalist side, and you create them, separate, you treat them separately. I think the key is once you really embrace realism and you understand a realist metaphysic, you realize that it's all mystical. The world is mythologized. Yes, sure. It's haunted with spirits and angels, demons, God, all this sort of stuff. Yeah, that's real. You're a spiritual being, afterlife, all this sort of stuff, sure. Morality, all the rest. But even prior to that, just at the basic level of you existing in a structured way and you perceiving those structures, that basic level of existence is already mystical. And I think if you can grasp that now, reason can begin to come in and provide some guidance, some discernment about what are the structures of morality, what are the spirits I should be talking to and shouldn't be talking to. Reason can start to have that say that's been sort of pushed to the side without in any way nullifying the pursuit of the mystical. So that would be my pitch."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":117.55,"end":180.32,"speaker":"Jonathan Pageau","text":"This is Jonathan Pedro. Welcome to the symbolic world. Hello, everyone. I am here. I'm back with Nathan Jacobs. Some of you follow my channel. Have seen him before. Nathan is one of the most fascinating people I know. He is a philosopher, he is a teacher. He is also an artist, very much in different mediums, writing, you know, visual art. And so I thought that we would talk a little bit about this moment because Nathan has been working on some fiction projects and also still continuing to work on his. His philosophy. And it seems like, as so many of us, a lot of creative people are kind of working towards reimagining and representing Christianity, but also the ancient world in different ways. I thought we could expand, explore his vision of realism, his vision of storytelling and how that all fits together. So, Jake, Nathan, thank you for joining me."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":180.48,"end":185.04,"speaker":"Nathan Jacobs","text":"Thanks for having me, Jonathan. That's a Great intro. Wow. I'm flattered. I hope I live up to it."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":185.76,"end":219.1,"speaker":"Jonathan Pageau","text":"So it's. It's. But it's a tall order. I'd like to talk about all that, you know, because, you know, one of the things we've seen, and, you know, you've been aware also of things like Michael Heiser and the Lord of Spears podcast, you know, the things that I'm doing, a lot of other stuff that's going around, you've been also part of that in some ways, you know, circling around, around that circles. And what do you think is happening? I mean, what. What is the change that's happening in people's mind that is making it possible for these types of stories to enter people's imagination again in a way that doesn't seem completely crazy?"}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":219.58,"end":323.83,"speaker":"Nathan Jacobs","text":"Yeah, so I. I think there's several different things that are going on, and one of the. One of the sort of things that first clued me into this, and I think. I mean, it's been a while since we had our. Our last, you know, sort of talk on your podcast. We talked before between them, but I think we talked maybe a little bit about becoming truly human. And the work that I did on the religiously unaffiliated or the nuns. Right. People with no religious affiliation, but, like, hearkening back to that, that was one of the first things that awakened me to an interesting trend in culture, which is that, you know, so by way of context, for anybody who's unfamiliar as. As a. I. I did a. A documentary at some point years back related to the religiously unaffiliated. And I was asked to do that because some folks approached me and they were basically like, hey, you're a philosopher, you're a theologian, you're an artist. You also, at the time, I was a college professor. I've stepped away from that for filmmaking now. But, you know, I'd also already been moving into filmmaking. And they're like, well, maybe you could do something related to this demographic to engage them, to look at them. And so, anyway, I ended up pitching this sort of odd documentary project of saying, well, yeah, let's look at that demographic, but let's humanize them. Let's let them tell their stories, let's hear what's really going on with them, let's put them in conversation with each other to get sort of the dynamics of the worldview and so on. But as part of doing that documentary, I ended up, you know, interviewing all these different, you know, nuns. Right. Religious. And again, I should probably. I should probably N O N E S. Not like Catholic nuns, Orthodox. It's like the worst branding."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":323.83,"end":324.27,"speaker":"Jonathan Pageau","text":"I know."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":325.55,"end":327.63,"speaker":"Nathan Jacobs","text":"It's so bad because everybody's like, wait."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":327.63,"end":330.31,"speaker":"Jonathan Pageau","text":"It'S the opposite of each other, right?"}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":330.31,"end":470.02,"speaker":"Nathan Jacobs","text":"It's like, wait, nuns that don't believe in God? Like, what? And so like no nuns, as in no religious affiliation. It's none of the above on religion surveys. So these are not like Catholic or Orthodox nuns, right? Like, these are people who just don't identify with any specific religion. So anyway, and in doing the sort of initial interviews with those folks, there was this weird data point that didn't show up in the documentary. And it was one of the first things that awakened me to this sort of hunger for a remythologized world. Now, like. And this sort of oddity that I'm referring to is that when I interviewed the nuns, what emerged was that all of them, 90% of them at least, believed in ghosts. So it was really sort of strange, right? Because I think a lot of the general perception, and maybe to an extent my perception too, before I really delved into, you know, inter all these interviews, was that, well, maybe what's happening is there's like this apologetic discussion going on between like, Christian apologists and new atheists, and maybe the new atheists are winning. And so all these people are abandoning religion to become atheists. Right? And that's what it is. And then when I interviewed all of these folks, you know, I did like 60 plus, you know, sort of pre screenings of different folks from all sorts of different places, backgrounds, whatever, and I was shocked to find that it just kept on coming up that they're like, oh yeah, ghosts. Totally ghosts. And I was like, huh, that's really weird. And actually, I think the one that encapsulated it the most for me was that there was this one couple from New York that I was interviewing. I really wanted to have them in the documentary. It didn't work out, but they had been married for three years. And I was just going through my usual questions with them, like, oh, what was your upbringing? Like, okay, were your parents religious? Did you go to church? You know, these sorts of background sort of questions. And then I get to the point where I'm like, do you believe in God? And the husband's like, oh, absolutely. And the wife's like, no way. And then they looked at each other and they're like, what you do? You don't. And apparently they had been married, married for three years and they never had a conversation about whether God exists."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":470.02,"end":470.38,"speaker":"Richard","text":"Right."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":471.09,"end":568.44,"speaker":"Nathan Jacobs","text":"But I was like, oh, man, gosh, that's crazy. Well, this is going to be a conversation when we're done here, I'm sure. Hopefully I didn't disrupt your marriage. But what was also the bigger oddity for me was that somehow, and I don't even remember how it emerged, ghosts came up, right? Paranormal ghosts. And all of a sudden, the gal who was like, oh, I don't believe in God. Science, science, science. My apartment is haunted. I thought, huh? So no God, but spirits. Okay, that's interesting. And then what I. And this kept on happening again and again where I was like, oh, man. Like, these folks don't just believe in ghosts. They're like, I'm a sucker for ghost hunter shows, right? Like, or I'm into the paranormal. So it was like an enthusiasm. And then that's when I found. I was like, is that just an odd sample? Like, did I happen to find the 60 people? But Supernatur not in God, right? But then I found the work of Clay Rutledge, who's a sociologist, and he did an entire book on this where he was talking about the fact that the folks who abandoned religion were not abandoning it for a secular, materialist, atheist worldview. They were abandoning it largely for toying with the occult. And then I was looking at Pew stats, and Pew was finding the same thing where they were finding that people who had abandoned religion were actually more likely than religious people to believe in ghosts or paranormal phenomena."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":568.44,"end":594.57,"speaker":"Jonathan Pageau","text":"Which, by the way, is important to mention that this is not something that's just happening now. It is something that's been happening from the beginning of the Enlightenment. And it's something that I've argued very much that there is a dark side to the Enlightenment that's there right from the outset and can be, can be seen in all the seances, all the magnetism, all the Edward case, all that nonsense, 19th century materialism, flipping into this weird esoteric kind of occult culture."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":594.89,"end":645.49,"speaker":"Nathan Jacobs","text":"That's. You're absolutely right. Like, so this is one of the things that's really bizarre that a lot of people don't pay attention to that. You have like, certain philosophers like Jacob Boehm and people like that who are like, sitting there like, trying to talk with angels, right? Like, they're trying to contact the spiritual side. So that's sort of this weird sort of. It's strange the way the myths, like the storytelling in our culture about the history of ideas evolves, right? Where it's like, you know, the story of the Enlightenment is typically that you had a bunch of like, yeah, you just got a bunch of backwater hicks who are dumb religious people who haven't decided to use their mind in a while. And then there's a bunch of scientists who come along who are like, what if we poked and prod stuff? And then all of a sudden they became materialist atheists and all the religious stuff went away. And it's like, that's not the narrative at all. Like, all those things are wrong about that narrative."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":645.49,"end":661.17,"speaker":"Jonathan Pageau","text":"Hegel reading Swedenborg. And then. And then, I mean, there's so much dick cop trying to contact the Rosicrucians. Like, there's all these examples of all these Enlightenment philosophers, you know, basically being attracted by kind of weird esoteric occult stuff."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":661.41,"end":662.21,"speaker":"Nathan Jacobs","text":"Absolutely."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":663.09,"end":680.45,"speaker":"Jonathan Pageau","text":"On August 27, we are going to start to ascend the mountain of Purgatory, Richard and I. That's right. And continue on the second Dante class. So you can please go and sign up. You know, the first class was just an absolute blast and everybody really enjoyed it. So we're hoping that everybody will continue on the track with us."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":680.93,"end":780.22,"speaker":"Richard","text":"And yes. So we're, as Jonathan said, We're starting August 27th. You can get the course now at Symbolic World courses. There are payment plans and everything there to make it convenient for you. It's going to be incredible. Purgatorio is actually my favorite book of the whole comedy to teach. It's the one that most people, when you're in school, you start, you read Inferno, and that's all you read. If you read Dante at all in, like, high school or college, you probably only read Inferno. Purgatory is my favorite one to teach. It's the one that is kind of, you could say, in a certain sense, the most relevant to where many of us are in our Christian life. That is to say, Purgatorio is about the purification. Right. It's about the process of becoming saints. And so whereas, you know, Inferno is, like, about sort of rejecting sin. And then paradise is about what is. What even is holiness. And paradise is the hardest one to teach. We are going to be doing it later this year. Paradise is the hardest one to teach, though, because it's very hard to explain to somebody exactly what it means to be holy. But I think all of us can understand what it's like to try to become holy. So, anyway, join us for Purgatorio. It's going to be really awesome. All the juicy stuff is in Inferno, you know, because, like, it's really fun to look at these sinners getting their, you know, what's Coming to them or whatever. But Purgatorio is, in many ways, it's the most practical because it really hits us right where we're at right now. So, August 27th, folks, please, please, please come and join us for the class. You won't regret it. It'll be five amazing weeks of really getting deep into the question of what does it mean to be purified? And I think you'll enjoy it."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":781.18,"end":782.7,"speaker":"Jonathan Pageau","text":"All right, we'll see you there, everybody."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":783.74,"end":989.97,"speaker":"Nathan Jacobs","text":"So this is happening. Like, so what I started to notice is that this is clearly happening, right? Pew was noticing it. Rutledge was noticing. Noticed it in my interviews. And so that was sort of the question, like, what's going on? And what. You know, one of the things that I've argued, I've done different talks and lectures related the religiously unaffiliated. And part of my case of, like, how this started to evolve over time is that far from the sort of expectation that says, like, oh, there's a debate going on. God, no God, God, no God. Materialist world, meaningless world, whatever. And one side is winning. The way I've put it in the past is saying, like, I think what's happened is that that discussion has lost the audience. And what I mean is that that discussion, if you look at the sort of standard apologetic, like you look at Boomer's generation apologetics, right? It's basically sort of rehashed Enlightenment discussions, right? You can find all these same arguments in Locke and Barclay and Hume and whatever. It's just that debate rehashed and sort of popularized in our own culture. And so I was like, there's nothing new there. And I think the difference is that the sort of generation that started to move away from it is not an Enlightenment generation. They are a post, you know, Enlightenment generation. And so. And I think part of what comes with that is that there is a movement toward what I'll call intuitions, right? Not intuitions in the Kantian sense. There is some technical sense. But what I just mean is, like, they're going on instincts, right? They're going on these sort of moral sentiments, right? So in terms of morality, for example, they don't necessarily have a moral system. They have vague sentiments of what is right and wrong, right? When they talk about, you know, whether the world is meaningful, right? And they talk about karma or faith, they don't have a fully fleshed out metaphysic, right? They just have a sense that, you know, there's probably some purpose and they've seen coincidences, right? And things like that. And so I think the thing is that they're operating not so much on an overtly rational analytic level and more on this sort of like, chest level sort of thing. And I think one of the things that's interesting, when you look at the stories of why they abandon religion, they are largely reflective of that. They're reflective of existential crisis. So oftentimes, in interviews with unaffiliated folks, if you're like, well, so when did you start to doubt or what happened? They'll talk about the problem of evil, but when they describe it, they're not describing the problem of evil, you know? And I mean, that's no surprise. They're not trained philosophers. They don't know the difference between the problem of pain, problem of evil. Right. Other problems. But what they describe is they're really describing the problem of divine hiddenness. Right. What they're describing is there was a crisis happening, and I wanted to know that God was there and that he cared. I wanted him to hear my prayers and show up and answered. I wanted him to address. I wanted to make. I wanted him to be palpable. Right. I wanted his presence to be real and tangible, and he didn't. And so that's when I started doubting that he's even there. Now, the reason that's important is because. Well, then what's the appeal of the paranormal? Well, the paranormal is that it's a spirit that tangibly shows up."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":990.05,"end":990.53,"speaker":"Richard","text":"Yeah."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":990.69,"end":1158.92,"speaker":"Nathan Jacobs","text":"Right. So if I can have a Ouija board experience where I'm like this. There's something here talking to me that's giving to me the thing that I wanted from God that He didn't give me. If I can have a haunted house experience where I'm like, this place is haunted. There's something here. Right. That spirit is giving me the thing that. That I wanted, which is that encounter with the numinous. Right. That. In that. That tangible encounter with something on the other side. And. And that's also reflective of when you ask. I would have these interviews, and they'd be like, well, you know, I'd be open to God, but I want proof that he exist. And then I asked, what are you. What would constitute proof? And it became very clear in the conversations, first of all, they didn't know what would constitute proof. And second of all, whatever it was, it wasn't analytic. Right. If I walked them through the argument from contingency or the ontological argument or whatever, it wouldn't matter because it's all up here and they're Being driven by something that's more existential. They're being driven by these sort of intuitions. And so I think what's. To circle back to your question, like, of what's going on? I think what's starting to emerge is there is this sort of break with the rational pursuit of reality for something that's more existential. And in that break, there's something wildly dissatisfying about a purely materialist, mechanical world of dead matter that's chaotically running into each other. And so there's this instinct, there's this intuition, this drive in the human heart that's saying, like, okay, I think there is such thing as good and evil. I'm not schematizing it, but I'm just sort of operating by moral sentiments that that's real. I think things do happen for a reason. That there's probably is a story here, right? I don't have a set, you know, idea of what that means from a religious worldview, what happens after I die or anything like that. But I think there's meaning things happening. And I think it is a spiritual place. And I'm a spiritual being because I have these spiritual moments, right? These moments of feeling like a spiritual person or having certain spiritual sentiments, right, that just come upon me when I see a sunrise or, you know, you know, see a newborn baby or something like that, right? Or watch a. Watch a movie. And it seems like, yeah, that sounds right, that this is a spiritual place. And I think this world is probably haunted, right? I think it's probably filled with spirits. And. And I think all of that speaks to this. This general trajectory that as reason is sort of losing hold. And I don't mean that as an insult, you know, I don't mean to suggest like, oh, you're a bunch of irrational, crazy people, right? But as reason is not at the helm, right? And more these intuitions are at the helm, driving the ship."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":1161.54,"end":1161.78,"speaker":"Jonathan Pageau","text":"There."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":1161.86,"end":1251.97,"speaker":"Nathan Jacobs","text":"And. And there's a growing dissatisfaction with the materialist atheist, you know, scientism. What's starting to happen is what's manifesting are those innate human impulses to say the world is meaningful. It does. There is something about it, right? All the longings for worship, all the longings for some kind of mystery, all the longings for the transcendent, all the longings for, you know, connection are starting to manifest. And I think those are manifesting in this intrigue in the paranormal and the occult. But I will say. And, you know, I will say I think at the same time, those instincts are at war. In some ways, there's an inner conflict with a lot of folks who still have been trained to think religion is naive, right, or to think that it's somehow superstitious or something like that. And so this is where I think, for example, that's part of the reasons why you're starting to see strange things emerge. Like, there's an intrigue with aliens, right, which satisfies the materialist worldview, because they're organisms, right? If we're just envisioning them as from other planets, but yet at the same time, there's a schematizing of it and a sort of treatment of it as if it's religious, right? There becomes this fascination with, you know, with it as something that, you know, it takes on messianic overtones. It takes on angels and demons overtones. It takes on, you know, it takes on some sort of."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":1252.05,"end":1266.85,"speaker":"Jonathan Pageau","text":"Becomes an explanation for that stuff. You see it like. You see people like Rogan, who basically are now reinterpreting religious imagery, right, in light of aliens. And so they'll say, you know, ezekiel's wheels are flying saucers."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":1267.25,"end":1267.65,"speaker":"Nathan Jacobs","text":"Right?"}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":1267.89,"end":1307.01,"speaker":"Jonathan Pageau","text":"I'm sorry. It's just like, okay, if you know anything about mysticism, you're like, no, they're not flying saucers, but this desire. Desire to. To basically to have a phenomena that comes from somewhere outside, but that can also be measured and experienced. So there's a continuation of materialism in there, too, because what people want is, like, they want something that comes from the outside, but that also is. Is here, like, is something that you can still experience, but is weird and strange and does kind of touch on that. That aspect of the numinous, as long as you can fit it into your worldview."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":1307.33,"end":1594.18,"speaker":"Nathan Jacobs","text":"Yeah, well. And so this is where one of the things. Rogan's a great example of this, right? And I think he's a great example of it because he embodies a lot of people, right? He embodies a lot of. This is the zeitgeist of a large portion of people in our culture. And one of the things that I think is really fascinating is, you know, like, William James talks about this whole idea of, like, live and dead options, right? In his will to believe, right? He's just talking about that there's certain things that you go to a certain person of a certain mindset or whatever, and you pitch an idea, right? You suggest a premise, a claim, and he uses. It's like electricity. It's like wires, right? Like that some options will just immediately be live options. Yeah, that's viable. And some will be dead options. And like, no, not viable at all. And James, of course, points out that we tend to confuse that with a rational assessment when in fact it's a pre rational assessment. Right. That has something to do with our priors that this is, you know, a live option, this is a dead option. And I think you find a similar thing in the work of Peter Berger, the sociologist. His book Rumors of Angels, he talks about this, which I recommend the first couple of chapters of the book and then you can stop reading because it goes off the rails after that. But, you know, but it's. But it's. He talks about. He talks about this phenomena of, you know, being a cognitive minority. And one of the things that he's talking about there is just the fact that you as a social, like you're a rational animal, but you're still an animal and specifically a social animal. And what that means is that a lot of what you know is derived just from the broader consensus of other people around you. And so you are shaped by what your culture thinks is plausible or implausible, what it thinks is ridiculous or not. And Peter Berger talks about the fact that for that reason, when you find yourself as a cognitive minority, you discover that you believe something that most people don't believe or that most people think is ridiculous. You go into a crisis of belief, not necessarily because you have new information about the idea that shows it to be irrational, but just because of your social instincts that says it constitutes a danger to be in the minority. And so he talks about how you spiral and you either abandon the belief or you proselytize for the belief, or you just keep it and hide it. And he uses this example of somebody coming over from another place where they all believe the stars determine your fate. And they get here and. And then they find out most people don't think that, and then they go into a crisis of belief about that. And he says, well, you might think, well, they should go into a crisis of belief because that's ridiculous. And he's like, yeah, but the problem is if we send you over to their culture, you'll go into a crisis belief for the opposite reason. And he talks about the phenomena of anthropologists going native because they have that sort of experience where they land in a foreign culture and all of a sudden they abandon their own beliefs for. Or at least they're very tempted to abandon their own beliefs to the belief, the culture. Now, the reason I think that's that the reason I sort of go off on that tangent is because I think that a lot of times folks like, you know, Rogan, they tend to confuse those pre rational inclinations. Right? Because that's pre rational. That has to do with your cultural, you know, context. It has to do with those influence. And, and Berger's point is that there's something pre rational. Like you actually need to engage in that next level of rational assessment to say, well, is it ridiculous or is it not? Because it's actually not just feeling that somehow. It's ridiculous. Feeling that it's somehow implausible isn't actually a rational assessment. It's a pre rational assessment. So it doesn't actually tell you anything about the viability of the, the belief. Reason has to have its say. But oftentimes people confuse just plausibility or palatability with truth and falsehood as if it's a rational assessment. And so it's interesting because with somebody like Rogan, it's obvious that when God comes up as an explanation, Rogan has sort of materialist, you know, tendencies that it's like, I don't know, God. I mean, but couldn't it be something else? Right? Like it just, it's, it's one of those things. It's a dead option, as James puts it. Or it's just, it doesn't, on that pre rational level, it doesn't resonate with him. But then you'll quite literally hear, you know, well, we're talking about, you know, humans are so far evolved, it couldn't possibly be that we just sort of evolved naturally. Therefore, aliens."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":1594.18,"end":1595.46,"speaker":"Jonathan Pageau","text":"Aliens, yes."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":1596.18,"end":1609.22,"speaker":"Nathan Jacobs","text":"Right. And the question is like, okay, so why on earth would the aliens thing be more plausible than the God thing? Right? Because all the, the entire argument is just unintelligence put you here."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":1609.3,"end":1610.06,"speaker":"Jonathan Pageau","text":"Yeah, right."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":1610.06,"end":1620.5,"speaker":"Nathan Jacobs","text":"And I think the answer is if you have a materialist instinct, if you have a materialist impulse, then offering an organism, right? Like this is actually an organism."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":1620.58,"end":1650.31,"speaker":"Jonathan Pageau","text":"With the simulation theory, this whole simulation theory is like a really elaborate attempt to replace God with some, like some mechanism of intelligibility that has, that has accounted for the parameters of this world without it being a transcendent source of all things. It's like this weird desire to create a materialist explanation for the parameters of our world. It's pretty, right?"}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":1650.55,"end":1754.83,"speaker":"Nathan Jacobs","text":"Right. Well, and it's also even certain things, like just the general sort of scientism of our culture, where really science, I mean science has been and I think to a large degree still remains the mythology of our culture. Right? Like it's you know, evolution is the mythology of our, you know, of how our world, you know, came to be. And, you know, the scientists are the priest class who can peer behind the veil and see mysteries that are beyond the rest of us to understand. And so if there's an authority left, it's them and all these sort of things. I think there is sort of an extrapolation of science into this sort of essentially a religion of sorts for our culture. But when you play that out, you can start to see those priors start to emerge. So, for example, like with dark matter, right, you'll end up hearing the premise that it's like, well, there's this missing mass problem based on the amount of mass that's there. Things shouldn't move like this, so they're moving the wrong way. So it must be that there is this invisible, undetectable mass that's moving them differently. Now, the thing is, like, everybody goes, oh, yes, yes, yes, okay, very good. But if I gave all the same premises and I was like, the problem is, like, based on the amount of mass that's there, those bodies shouldn't move that way, and therefore there must be an invisible force. I'll call them angels that are moving them differently than they would just on their own. If it was unguided mass, people would go, that's stupid. Angels. That's ridiculous. And the only difference between the two arguments is that one sounds more sciency because I said dark matter, because he's."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":1754.83,"end":1790.87,"speaker":"Jonathan Pageau","text":"Like, well, we'll use the word angels, right? And so, and so it's. It's so hilarious because I've been playing with that. I mean, I don't know if you followed it a little bit because, you know, a lot of Cogsci people are starting to talk about transpersonal agency. So they're. They're starting to talk about the perception that we see that there are certain agencies that are beyond the individual, that act and constrain the behavior of individuals. You know, it's like the traditional Christian. We know that. You know, and so then I've been. I've been like, pushing people to say, well, let's just use the words that the old people used. Ancient people used to word. They just say angels and demons."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":1791.03,"end":1791.59,"speaker":"Nathan Jacobs","text":"Yeah."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":1791.99,"end":1816.9,"speaker":"Jonathan Pageau","text":"And then like, some people freak out and they like, oh, you know, you just bring his superstitions into it. And then other people play along and people are like, oh, no, you're right. Like, this is actually a good way to understand how the ancients were thinking. I think about it. Reverse. I think they knew what they were talking about. We're just kind of blah, blah, blah, blah. We're just trying to figure it out. Let's use their schemes to help understand our idea of what transpersonal agency is."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":1816.98,"end":1831.41,"speaker":"Nathan Jacobs","text":"Yeah, absolutely. No, I remember I was. I haven't gone deep into that, but I do remember just reading an article recently, and I had the same thought where I'm going, like, so you mean, like, basically there are demons, they're angels."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":1832.13,"end":1833.17,"speaker":"Jonathan Pageau","text":"Is that what you're saying?"}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":1833.81,"end":1835.89,"speaker":"Nathan Jacobs","text":"So you're saying that we're open systems."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":1836.21,"end":1836.69,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":1836.69,"end":1848.73,"speaker":"Nathan Jacobs","text":"That seem to be interacting with other invisible agents, you know, and that we're porous. Right. On. On a level. So, yeah. No, that sounds familiar. I've read a few texts."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":1848.73,"end":1928.15,"speaker":"Jonathan Pageau","text":"I've seen something like really old in every single culture, in every single, you know, part of the world. From the beginning of time, we had this idea about, you know, these. These transpersonal agents. Yeah, yeah, it's. It's definitely a fascinating time. So. So basically, it seems as if a lot of this is breaking down right now in. In many ways. You know, in some ways, at least to me, it seems like it's breaking down in dark ways, like the interest in the occult, interest in the, you know, the constant resurgence of all this kind of witchcraft imagery and satanic imagery, you know, that. That is usually ironic, but is nonetheless manifesting some. Some real pattern behind it. And. And at the same time, the. The manner in which a lot of the social, the new social, let's say, structures, are represented religiously. So environmentalism is often represented in very religious term. A lot of the rainbow stuff also, you know, the trans is sacred thing that we've been hearing and the same. And the environmental stuff, especially, like, they literally will use the word Gaia and Mother Earth to talk about their environmental concerns. And so right now, what do you see? What do you see moving forward? Like, how. Well, let's say. How do you navigate all through all that? Let's see, what are some of the decisions you've made?"}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":1928.39,"end":2415.13,"speaker":"Nathan Jacobs","text":"Yeah. So I'll admit that I, you know, even though I was. I'm very sympathetic to the religiously unaffiliated on multiple levels. Right. Because I went through. Through anybody who knows my story, whether it's because of the documentary I did becoming truly human, or, you know, because they've seen interviews with me or whatever, they know that I went through a whole long philosophical, religious exploration journey. Right. I was in art school. I was in crisis about, you know, these big questions about meaning and purpose and afterlife and all this Sort of stuff. And so I left art school in order to study philosophy and religion. I became very much an opponent of Christianity or Christianity as I knew it, which was all Western Christianity. And eventually that's, you know, led me down the road discovering Eastern Orthodoxy much later and so on. So folks who have. Are familiar with me know I went through that journey, but also that journey for me was highly rational, right? Like, I was not somebody who toyed with the occult. I was fascinated, Like, I was fascinated with the spiritual world. There was definitely a longing for ancient religion, right? Like, that was one of the things that I've talked about that, you know, there was this recognition that the ancient world seemed to have a connection with the spiritual world in a more palpable way. And that didn't seem reflective of contemporary religion. I thought that was gone and dead until I discovered Eastern Orthodoxy. And like. And so there was definitely that sort of longing there. But admittedly, so much of my journey was up here, right? It was me studying the history of ideas, me going backwards from, you know, into ancient philosophy and medieval philosophy and contemporary philosophy, you know, Kant, Leibniz, all these sorts of things. And so there's no doubt that. That while I can identify with a lot about the religiously unaffiliated, in terms of the questions, the objections they had to Western Christianity, some of their broad brushstrokes in terms of intuitions about the world, I. I can't personally on that level identify with, you know, this sort of wandering into the occult and just being led by intuitions. Because I'm a highly rationalist person, right? I'm an artifact of the Enlightenment. I don't belong here. Jonathan. But, but I think, thankfully, that. That has offered a certain level of insight of what I think is. Is a bit of this missing ingredient in, in the trajectory that's happening right now. Because I don't think it's all bad, right? Like, I think that's actually a really good thing, that there is this movement toward, well, we can't stop worshiping. We can't stop seeking the mysterious, the mystical. We have a longing for something transcendent. We have a longing for a mythologized world. I think those things aren't just empty, vague longings. I think they're there for a reason. Just like the reason we hunger for food, right? We hunger for the transcendent. Because there is such a thing as the. That transcendent. I think I, as somebody who. So I'm a big advocate of properly functioning faculties arguments, right? Like, I think basically, if you become skeptical about the reliability of your faculties. You have no place to go. And so epistemologically, I think it's important that you start from the presumption that your faculties are functioning properly unless you have some specific reason to doubt. Otherwise you're colorblind or something like that. But you're faculties are functioning properly and their purpose is to tell you true things about the world. Now usually when people believe that, they start to believe, well, I should be an empiricist, right? That's why I don't believe in any of the God stuff or the ghost stuff or things like that. That's why just my five senses. But the fact of the matter is that once we start to take seriously the idea that our faculties are aimed at truth telling a lot more than just the senses open up. The fact that we do have a sense that there is such a thing as right and wrong and we have this thing called conscience that just detects it, right? Tells us something true about the world that an empiricist can't grasp. I mean that's Hume attacked sort of moral reasoning precisely because he was an empiricist. And so it's like. But the fact of the matter is, I presume that conscience is not a malfunction. I presume it's telling us true things about the world. And in like manner, I think the sense of the numinous. Just like Rudolf Otto argued against Immanuel Kant, right? Rudolf Otto had suggested that Kant's assessment of psychology and of our faculties was too limited because it left out the numinous. It left out this universal human experience of what Otto would call the holy right, the idea of the holy. But there's this broader sense that we as human beings all have this intuition that the world is haunted. I like to say that everybody believes in ghosts, even the hard been native theist who says he doesn't. Because if you lock him in the abandoned insane asylum at night, he's scared. And it's not because he thinks a hobo lives there. And so he can try to reason that away and say, well, it's an evolutionary defect, yada yada yada. But the fact of the matter is it's there, right? He's suppressing it. It's there. It is this universal human thing. And I think we should take that seriously as an intuition that tells us there is something behind the veil, right? That that's a real thing. And so, and, and all of that sort of. So all of that is to say that I Think the overly rationalistic approach that disregards these sort of more intuitive things that are driving a lot of the nones is bad. I think it's a good thing that people are starting to get in touch with that. That they're hungering for the numinous. They're taking it seriously. That they're sort of taking seriously moral sentiments and things like that. Now, I think there may be. There is. I think there is an overcorrection in the sense that it's all sentiment without reason. And so both are dangerous, right? If you over emphasize rationalism, if you over emphasize reason, you just miss things, right? There's just certain things that have to be intuited or experienced, right. They can't be broken down analytically. And obviously, as an Eastern Orthodox Christian, I would. Well, I don't even have to appeal to that, right? Let me just say, if I were doing metaphysics, right? Aristotle's definition of matter, where it's pure potentiality. Aristotle defines matter as something that is just that. It's just the potential to be a thing. And so when we start to talk about what matter is at its base, we have to get rid of all particular properties. We can't think of it as a particular object. And then what happens is reason starts to get frustrated because it's like, well, you're getting rid of all the things that I hold on to, right? All the things I think of. And the answer is yes, right? It's in some ways beneath reason, but that doesn't mean it's not real, right? Like there is a good reason to think it's there. Similarly with God, right? Like, people tend to get flustered when they start to hear this language of God being beyond being or something like that, or infinite. And they're like, well, what am I supposed to think of? Because I think of small finite objects. And that's a good question. But that frustration of the mind doesn't mean that God's not there. It just means that there are things above and below, you know, the confines of reason. And so I think the problem is if you end up just taking a pure analytic worldview, you inevitably have a truncated worldview because analysis can only get you so far. There are things outside the boundary lines of it. But I think at the same time, if you're all intuition, it's just moral sentiment, right? It's just vague pursuit of the numinous without any sort of reason bringing it into check. You have an equally lopsided worldview right now, I think, you know now. So this might sound like where I'm going is saying, well, so I think it's good that we have a mythologized worldview, but we should bring reason into the mix. I suppose that's true. I would say something like that. But I actually think reason itself is in some ways mystical."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":2415.21,"end":2415.61,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":2415.61,"end":2479.92,"speaker":"Nathan Jacobs","text":"Is in some ways divine. And I think what needs to happen is that people need to begin to look at it through that lens. So I'm a big advocate of realism. After I did all of my sort of philosophical study and things like that, one of the convictions that I came to was that all of the history of ideas, or at least one useful way of looking at the history of ideas is to say that all the history of ideas is just. It's just the story of two roads, you know, two different answers to one question. And that one question is the question of realism. So for those who are unfamiliar, realism really is just. It recognizes this, that, you know, you and I and every other human being, from the moment we, you know, can speak, the moment we are self aware, we think in terms of groups. Right? Well, little kids are like, you know, mommy, what animal is that? And they're not asking who it is, they're asking what. Right. They're asking for a species of thing. Right?"}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":2480.96,"end":2503.4,"speaker":"Jonathan Pageau","text":"And that's what exactly the children are trying to do is to. Is to be able to. To categorize or bring things together in the right analogy so that the right communion, so that they can then distinguish, like you said, groups, because people don't realize that you're there. Everything is a group. Like everything that you can perceive in the world is already a group."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":2503.64,"end":2504.28,"speaker":"Nathan Jacobs","text":"That's right."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":2504.36,"end":2505,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":2505.32,"end":2543.64,"speaker":"Nathan Jacobs","text":"Right. Humans, tables, chairs, balls, fears, like, Right. Like, like, yeah, like all of that sort of stuff, right. We think in terms of groups. So the big question with realism is, you know, why. Right. The question is, when the mind does that, is it abstracting from the world or identifying in the world or whatever it is? Right. Is there something out there? Are those structures actually out there and reflective of the way the world is? And if so, the answer is, you're a realist because they're real."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":2544.12,"end":2544.36,"speaker":"Richard","text":"Right."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":2544.84,"end":2562.04,"speaker":"Nathan Jacobs","text":"Or is it all just sort of chaotic, happenstance, you know, amorphous matter? And the mind is inventing mental fictions in order to group and categorize and interpret stuff that really isn't, you know, organized in the first relationship between."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":2562.04,"end":2562.88,"speaker":"Jonathan Pageau","text":"Between the two."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":2562.88,"end":2675.06,"speaker":"Nathan Jacobs","text":"Yeah, right, right. And so if you say that, then you're anomalous, Right? From the Latin. Nomen, meaning these are just names that the mind is coming up with and projecting and creating structures in order, organizations. And I think really in some ways, and I won't go into it here, but I think in some ways that's the history of ideas, right? You look at the rise of empiricism and modernity and everything that follows after that, it's just exploring the nominalist road. That's what it's doing. Whereas prior to that, the medievals, the ancients, that's the realist road. People like Socrates and Plato, even Pythagoras, and then into the medievals, the Jews, the Christians, they were realists. And so once you're a realist, once you're on the road of realism, which I embrace because I believe in properly functioning faculties, right? Because if my faculties are aimed at telling me true things about the world, and one of the most basic things that it does is say, that's a table, that's a chair, that's a human, that's a cat, right? If that's central to all thinking and reasoning. And I say reasoning because logic is based on groups. You can't engage in logic without groups. So if that's what all thinking and reasoning does, and I presume that my thinking and reasoning is aimed at truth telling, I have to presume at the outset realism, right? Now, the thing is, realism naturally starts to raise other questions, like, well, why are those structures there? And one of the things that's most fascinating to me is that realism, one of the ways of framing the question, rather than the realist, nominalist way I just framed it, is to say, does mind emerge out of matter as a product of it after the fact? Right. Or is mind in some ways prior to matter, structure and giving it structure and organization?"}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":2675.06,"end":2676.62,"speaker":"Jonathan Pageau","text":"Yeah. Constraining it, definitely."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":2676.62,"end":2748.36,"speaker":"Nathan Jacobs","text":"Yeah, yeah. And I think the fact of the matter is there is no way of saying if, if you're going to. If you're going to be a materialist, an atheist, anomalous, you have to say that mind is sort of an emergent property, right? That somehow the matter just sort of evolved, it chaotically developed over time. You get complex organisms that eventually become conscious, and you have to make it a product of matter. But once you. And so once you say that, then it makes sense that you would have to say that mind is also imposing all these structures, because those structures we're describing are mental structures, right? Ideas, you know, rules, principles, logic, order, you know, and. And yet if you're a realist and you're saying, well, no, order and groups and structures are just there. Right. They're part of the fabric of reality. Then you actually have to suggest the opposite. You have to suggest that somehow the principles of mind and of ideas and of reason are there at the foundations, giving structure to reality. And once you say that, now you have to say, well, then that means that the world emerges from something like a mind."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":2748.68,"end":2749.08,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":2749.08,"end":2796.29,"speaker":"Nathan Jacobs","text":"And now I'm back to something like God, at least something godlike. Now, the reason I think this is important is because what that means is once you look at the world that way, whether you're looking at it through, like, Plato's realism, you know, or Aristotle's realism or Philo of Alexandria's Jewish realism, or, you know, Gregory of Nyssa's Christian realism. Right. Whatever it is, what happens is that knowledge and reason becomes inherently mystical. That as I look out and I recognize a structure, I recognize that's Jonathan is human. Right, okay, got it. I am, in some ways abstracting, apprehending, you know, partaking in a divine idea."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":2796.45,"end":2797.25,"speaker":"Jonathan Pageau","text":"Yeah, right."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":2797.33,"end":2826.1,"speaker":"Nathan Jacobs","text":"There is something inherently mystical just about the fact that the mind that gives structure and order to the world is something that my mind either is a. Is a spark of if I'm a pagan, like, stoic. Right. Or is an image of if I'm a Jew or a Christian. And that. That image. I'll go with image, since I'm an Orthodox Christian, you know, is. Is apprehending something that originates from the divine mind. Just in the act of perception."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":2826.18,"end":2826.66,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":2827.06,"end":2993.05,"speaker":"Nathan Jacobs","text":"And I say even in the act of perception, you don't even have to go as far as reason. Right. When I look out right now, I look out and I see. Okay, I see. We always talk this way, right. I see a table, I see a computer. I see a human, I see a camera. Right. Whatever it is. Right. The fact of the matter is, we always attribute that to the eye. That's the empiricist mistake. As if the eye sees that. The answer is like, no, the eye doesn't see that. The eye gives you all this data, right? It gives you this, you know, stuff that we call light and shadow and all this sort of stuff. But what happens is that the mind so automatically says table, chair, floor, human, cat, dog. And it's so automatic and it's so immediate in identifying those groups, which is what allows you to differentiate all the things in your field of view. We presume it's the eye, but it's not. It's the mind. And if it's true, if realism is True. And that somehow these structures are divine in nature. They originate from God. Whether you're a pantheist or you're a theist or you're a panentheist, you're a pagan, you're a Christian, you're some form of realist in this way, then what happens is that basic perception is already a mystical experience. So you want a mythologized world. You're already in it the moment you embrace realism. And now the reason I think that's so important is because rather than saying, well, there's a mystical side where we think about the occult and all that sort of stuff, and then there's a materialist side, rationalist side, and you create them, separate, you treat them separately. I think the key is once you really embrace realism and you understand a realist metaphysic, you realize that it's all mystical. The world is mythologized. Yes, sure. It's haunted with spirits, angels, demons, God, all this sort of stuff. Yeah, that's real. You're a spiritual being, afterlife, all this sort of stuff. Sure. Morality, all the rest. But even prior to that, just at the basic level of you existing in a structured way and you perceiving those structures, that basic level of existence is already mystical. And I think if you can grasp that now, reason can begin to come in and provide some guidance, some discernment. Right. About, you know, what are the structures of morality? What are the spirits I should be talking to and shouldn't be talking to? Right. Reason can start to have that. Say that's been sort of pushed to the side without in any way nullifying the pursuit of the mystical. So that's. That would be my pitch."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":2993.13,"end":3041.75,"speaker":"Jonathan Pageau","text":"Yeah, I totally agree. And anybody who's been watching this. This channel for a while knows that this argument that you're presenting so eloquently is one that I'm constantly referring to, which is that. That there's magic every time you perceive unity and multiplicity, like, because that's the. That is magic. That is the moving into one. It's the. It's all of the. It's like. It's as mystical as the. You know, we're all united with the one. In a Platinian, you know, mysticism, it's like that happens when you're, you know, grabbing a pen, by the way. It's like all the multiple moves into one. And then you have this mystical experience of the unity of the pen. It's like, yeah, but then scale that up, and then you're in church and you're doing the Jesus prayer or you're, you know, you're part. But it's. It is all the way down into. Into everyday perception, you know."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":3041.75,"end":3042.23,"speaker":"Nathan Jacobs","text":"Yeah."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":3042.31,"end":3110.12,"speaker":"Jonathan Pageau","text":"And I think one of the things I also think is, I think that because there's been. People have mocked the ancient vision of how. How they would describe our experience of vision. You know, the. Even Christ talks about it like that. You have the ray that leaves the eye and hits the object. I think that's absolutely true. I think that that ray is attention. Like that there is a ray that leaves your eye. We call it attention. And that attention, you know, is the part of the magic which brings groups into one. And so it's not like it's not. It's not that it doesn't exist out there, like you said. It's not like it's com. It's imposed, but it's this deeply participative act where human consciousness participates in this magic and bringing, you know, these groups. Because the groups can change, Right. You know, like the. The chair, if. If there's a fire in the room and I'm running out, it's like, you know, the chair is no longer a chair. It's just an. It's an obstacle to get to the door. It's real. It's a real obstacle that I have to get out of my way or it's a weapon or whatever. Like, the groups can change and they're all real. But there is an aspect of human consciousness which plays a part in. In that magical transformation."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":3110.2,"end":3367.22,"speaker":"Nathan Jacobs","text":"Yeah, well, I think that participatory side of perception that you're talking about, it's of kind, as far as I can tell, it's the only way to overcome skepticism. So all of skeptical arguments, whenever you look at the skepticism of the Enlightenment, right. It's always based on an alienation between the perceiver and that which is perceived. Right. So this. This starts as a problem with, you know, this becomes a problem at the outset with, you know, with the empiricism of John Locke. Because John Locke's sitting there and he's going, well, so basically the mind is a tabula rasa. It's this blank slate. It's kind of like clay. And then, you know, it's passive as things come in and they like. It's kind of like, you know, if you have a piece of clay and you press your fist into it and now there's that. And so, like, that's kind of what it's like. The stuff out there, like, comes in and it presses in and leaves an impression. Well, what inevitably happens for Locke is then, first of all, you have. You have a couple of problems that start to emerge. The one is that you have a verification problem, because all I have access to are the impressions that are in here. I don't know anything about the thing out there. So somehow demonstrating. And this is how skepticism always got off the ground in the. In, you know, in modernity and in the Enlightenment, was that, you know, well, you can't. How do you know it's the thing out there is like the thing in here, right? And then Locke only added problems when he started saying, well, yeah, and then there's, like, primary and secondary qualities associated. Certain qualities, like extension, those are true to the object out there. But, like smell, that's not real out there. You know, sight, like color, that's not real. Like, that's a phenomena in the mind. So now, not only is Locke created an isolation, right? We only have access to the replica. We don't know if the replica is like that thing out there. But he's also given us reason to think there's discrepancy between reality and the replica. So now he's actually creating problems. And in fact, one of the things that you'll appreciate, which I find so hilarious, is that this actually, like, artists went into crisis over painting because of this. Like, they were like, we should all be sculptors because at least we're dealing in primary quality, right? But it's like, wait, so my paintings back there, none of that color is real? Like, if I could step outside of my mind and look at it would just be flat goo. Like, that's all it is. And so this is where a lot of the artists like Post Locke were like, oh, we should all be sculptors. But so that's that. That lack of. That inability to verify and all that, that's part of what sort of fueled a lot of the skeptical projects, you know, in modernity. But the fact of the matter is that isolation doesn't exist in realism, right? Because part of the issue is that with realism, the abstract, the generics, right? Those groups, they can be in multiple places, right? You can have three balls that all participate in sphericality. Sphericality is manifest in that one. That one, that one. Here in the case of you and me, humanity, human, is manifest in you. It's manifest in me. Simultaneously, we participate in the same generic in the same form, right? Well, once you've said that one form can be in multiple objects, well, all of a sudden, perception makes sense, because what's happening is the form that's out there takes up residence in here, right? Because it doesn't have to just be out there. And so in some ways, perception is isomorphic. Meaning when I perceive you, I actually pull out of your matter all the properties that are there. I'd like those properties that are in you take up residence in here. Now, that doesn't mean that you take up residence in here, right? You are a discrete subject outside of me, but the properties of you do take up residence in here. And so you don't have a replica, right? You actually have a participation in the very things that are outside of me, you know, and so in that way, you overcome that gap, right? So the very first starting point of skepticism that requires, you know, an isolation, right? Some sort of separation and isolation of, you know, perception. And the thing perceived is overcome by realism and by the very type of, you know, participation in the object through perception."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":3367.89,"end":3488.05,"speaker":"Jonathan Pageau","text":"Okay, so how. This is the question that I have, because I've been thinking about this a lot, and like, the question that. That I have is. It seems nonetheless, that the perceptions we have are based on human priorities, right? The reason why we perceive them is because of our life. You know, we. We exist. We. We live. There's a. Nor. There's a natural hierarchy of perceptions which are fit into our. The needs that we have. Like, I need to get to the door. That's why I see a door. I need to. You know, there's. There's a. There's a participation that way. And one of the things that I've been working on is formulating the image of the Son of Man as a solution to that. Like the image of the Son of Man in Scripture. Because there's this. This idea. It's there in Philo as well, in the idea of Adam Kadmon, the notion that the primordial atom is there before creation. Right? And in some ways, it's a. It's a very. It's. It's a. It's a very strong anthropic way of looking at the cosmos, which is that in some ways man is there at the outset in God, especially if you're a Christian. Like, that Christ is. Is the same before now and forever. And that the incarnation, although happened, you know, in the first century, is an eternal reality. And that there's. This is the mystery. Like, you know, Father Stephen DeYoung has answered that question. Like, who. Who was walking in the garden with Adam? Was it Jesus of Nazareth? And he. He. He kind of. He does this thing where he hesitates and he goes, yes, you know, but. But this sense that, that, that in some ways creation also, although I. I totally agree with your idea of realism is through man and in man that it take. That it comes to be focused and that human consciousness plays a role in bringing it all together and making it meaningful. I could say. Way to say it."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":3488.29,"end":3624.54,"speaker":"Nathan Jacobs","text":"Yeah. So with the Adam Kadmon thing that you're talking about, what's interesting is, you know, that's there, and I'm convinced it's echoed in Paul. Right. So when Paul talks about you've been made in the image of. Of earth man, you need to be remade in the image of the man of heaven. That's right out of Philo, Right? Like, because Philo basically, you know, Adam means earth man. Right. And. And then, you know, Philo's presumption is that God must have archetypes. Right. This was. This was one of the basic. This was one of the basic defenses of realism, was that in the Genesis creation account, God says, let there be and there's not yet those things. Right. And so part of the question was, what's he referring to? Right? How is it meaningful to say let there be beasts of the field if there's not yet. There's no referent for it. Right. And the presumption was God must have ideas of what it is that he wants, you know, to come into being. Right. And so this is where Genesis was presumed to actually be, you know, a. An overtly realist text where God has archetypal ideas of things and then he speaks those things, and none of those things manifest in matter. Right. And. And what's interesting is for those who are familiar with the fact that like. Or maybe people aren't familiar with the fact that Genesis is a polemical text, right? In some ways, it's. It's echoing other creation myths and then correcting them. Right. But one of the few creation myths it doesn't treat polemically is the Memphi creation myth. It's one that it actually just echoes, which is in the Memphi creation myth, you have, you know, p. Right. Who, like, thinks of these archetypes and then says, let there be. And then Atam, the creator God, looks at the archetype in Ptah's mind and then goes, make a material replica. And that's one of the things that Genesis is echoing. And it echoes it in even subtler ways. Like there's certain points where obviously God's commanding the earth to bring forth things, and it does, but there are Certain points where God commands and then God obeys. And so you still have this sort of duality, just like you would have Ptah Natam. Of course, it's the Trinity, right? The second person of the Trinity is obeying."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":3625.66,"end":3659.45,"speaker":"Jonathan Pageau","text":"But then you also have an image of that in the earthly man naming the animal. Whereas in some ways the source of the being is somehow some aspect of the contingency of the being is emanating from Adam, reflecting God, but is not like a. It's not a, you know, like you said, like an arbitrary imposition on the world, but it is simultaneously a naming and a recognition of the being that Adam is encountering. You know, and so this idea that naming is both at the same time in a mysterious way, right?"}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":3659.45,"end":3711.97,"speaker":"Nathan Jacobs","text":"Yes. Yeah. And that's one of the reasons why names become such an important thing not only in the ancient world, right? Because they're images, right? Like, this is part of the reason. There's definitely presume that just like there's a connection between, say, the symbol of a thing or the icon and the archetype or something. The name is its own sort of representation of the thing that's tied with its archetype in ancient ways of thinking. And so the naming is really critical. It's why in the ancient world you're not supposed to say the names of the foreign gods, because you're basically, basically invoking them. If you start to, you know, pull the. And that's why it was a practice, right. If you have like the name of the deity, right. You put vowel points for, like, shame. Right? Like, so, like, you know, esh. Start isn't actually like. Or I'm sorry, Astaroth is not actually Astaroth. Right. It's a start with the vowel points for shame over top of it, which is where you get, you know, Ashtaroth."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":3712.13,"end":3828.58,"speaker":"Jonathan Pageau","text":"Oh, really? I didn't know anything. I didn't know about that. But that's a. It's an interesting idea. And people might think that this is ridiculous, but. But this is actually quite real. That is, you can. How can I say this? Like, so if you bring up subjects, you know, constantly in culture, those subjects at some point will start to be part of culture. And so even if you're against it or for it, like, if you start to bring up certain. Certain realities in, In. In the world, then they'll start to manifest. You know, it doesn't matter which side you're on. And so this idea that you're. So, for example, like the idea in, in science fiction that you Create a story with Skynet and an AI that is. That is destroying the world. Then you think, oh, it's great, we're doing something against it, but you're also making it happen simultaneously. And so a lot of people might think the idea that, you know, you shouldn't name something because you're invoking it, and that it's. It's superstition and silly, but this is a reality that we experience all the time, which is that bringing up something in culture, either positively or negatively, is making it part of the web of relationships that is engaging in that culture. And so it's like talking about something either for or against. So you make a movie about an evil Skynet that brings about AI that AI comes to destroy you, and you think that you're just opposing it, but you're also participating in bringing it out because it's now part of the web of relationships that exist in our society. And so we're very naive about how reality functions. And we think that, you know, like, we think that when we oppose something and we do it publicly and we're going to do a whole campaign against something, you don't realize that you're also making it vocally more present in society. And possibly it will. It will make it manifest even more than what it was before."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":3828.66,"end":3895.86,"speaker":"Nathan Jacobs","text":"So, yeah, so I would love to go more on the whole name thing and symbol thing and the connection between image and archetype, but I don't want to lose your question, which was the one you were asking about the focal point of man. So the reason I was bringing this up is because Philo, in terms of Philo is one of those folks who is like, yeah, obviously God has. He has a blueprint, so to speak, for the thing that he's going to make. And so there's this image in the divine mind. And so for that reason, he presumes that there must actually be, right, some sort of archetype of man, right? So the heaven man is actually the. The archetype for earth man. And you know, and. And Philo toys with all the different ideas that like, well, and maybe the real image of God is the Logos, right? Which is, you know, is. And. And he's like. And who knows, maybe the Logos will, like, and the Logos, who he calls Deuteros Theos, second God. And he's like. And who knows, like, maybe he'll be the one who, like, becomes incarnate and like, sets up the royal priesthood and all this sort of stuff. Like, Philo's incredible."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":3896.66,"end":3912.32,"speaker":"Jonathan Pageau","text":"It's Amazing to see just how much of the, some of the ideas that were floating around in first century Judaism have been completely expunged for modern Judaism today. And most people don't know that. A lot of the stuff was right there. It was all bubbling well."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":3912.32,"end":3953.69,"speaker":"Nathan Jacobs","text":"And I think it's intentional. Like, I mean, I think. And again, this is, this would be its own sort of aside, but I do think what you see is there's a highly hellenized Judaism in the first century. Like Philo of Alexandria is now sort of sneered like, oh, he's not really Jewish, right? He's like a Greek, right? Really, you know, a Greek and Jews clothing type thing. But it's like, no, like Alexandrian Judaism is a real legitimate form of, you know, Judaism that's going on. And in many ways a lot of what we think of as Jewish today is in some ways reactionary, right? It's like people are converting. We need to sort of prioritize. We need to get rid of a lot of the Greek philosophy. We've got to sort of become a little bit more sort of culturally isolationist and you know, things."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":3953.69,"end":3978.42,"speaker":"Jonathan Pageau","text":"But the image of that, this, this figure is there not just in the interpreters, but it's there in scripture itself. You know, I mean, that's right. Daniel sees the Son of Man. Ezekiel sees the Son of Man sitting in a throne on the dome of Heaven. It's like exactly the image that we use in the architecture of the Orthodox Church. He sees a dome and he sees a throne and he sees a figure like the Son of Man sitting on the throne. It's like that's how we make our churches, folks, right?"}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":3978.42,"end":4167.79,"speaker":"Nathan Jacobs","text":"And that, and that's what Paul's getting at when he's talking about like, you've been made in the image of earth man, right? Like that you've become corrupt, right? You are, you know, you're his descendants. You've been crippled by the fall. This sort of stuff, you need to be remade in the image of the man of heaven, right? Which is, you know, exactly what you're talking about now, at least how I see all of that sort of stuff coming together, you know, to the question that you're talking about, this is how I would approach it anyway or how I do approach it in my thinking. You know, one of the central things that you find in, in a lot of the Eastern fathers is this notion of man as a microcosm. And I think that's, that's where I always go, because, you know, Plato, if you look at Plato's argument for the immortality of the soul. His affinity argument, as it's sometimes called. One of the observations he makes is that there's really sort of two types of things in. In reality, right? There's being and becoming relatively immortal, you know, and then the mortal, right, Things that are organic and come to be and pass away. And then there's other stuff like math that like, doesn't do that, right? It just sort of is, you know, what it is. And then. And then obviously, you know, he would put. On the relatively immortal side, right? You would have, you know, spirits, right? You'd have these sorts of deities. And so you have this sort of sense in which we live in this bifurcated world where there's like the things of the mortal, right, Things that are organic that come to be, that pass away, that generate and then undergo corruption and dissipate. And then you have these other beings that are relatively immortal. And I say relatively immortal because in the Eastern fathers, right, people like Pseudo Dionysius and things like that, you know, they, you know, only God is immortal, right? Like they'll say that explicitly. And Paul says that, right, explicitly that only God is immortal. And the reason is because we believe that angels are created, right? So they're not true gods in the way that the God is, right? Where they. Where they are, you know, not creatures. They are creatures. And so they are created. But. And so in this sense, they are relatively immortal. They're not subject to sort of birth and generation and decay and, you know, old age and things like that, the way, you know, the way that organisms are. And yet in Genesis, what you see is. You see this acknowledgment of this sort of bifurcated world. And in man, what you see is the unification of those two things, right? Where man is taken from the dust of the earth, just like the animals were taken from the dust of the earth, but he's breathed into. From heaven and becomes a living being. And so this merger of heaven and earth, and I don't know how many people have. Have done this. I was writing an article on this way back, Gwen, that I never finished. Probably should finish it at some point. But I think it's really fascinating if you follow in the book of Genesis, the associations of earth and the associations of heaven. So there's this really sort of weird thing that a lot of scholars are like, what's that in there for? Which is the Toledot. Which is the. These are the generations of, right? And you have this weird moment where there's. These are the Generations of the heavens and the earth, and then you get another creation account."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":4168.26,"end":4168.58,"speaker":"Richard","text":"Yeah."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":4168.74,"end":4215.04,"speaker":"Nathan Jacobs","text":"And my belief about that Toledo, what it's doing in there is that what it's actually doing is it's identifying which people represent the folks who are of heaven and which folks are of Earth. And so it's really interesting that Cain is a tiller of the soil. It's really interesting the way it talks about with Noah being lifted up to the heavens, but also the drowning of the people into the earth, things like that. If you follow the sort of heavens and the earth, right. The earth's going to refuse to give up its fruit. Right. And Joseph is going to be there in order to help rescue the people from that. This is a consistent theme. And so I'm inclined to think that what's that setting up is you think."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":4215.04,"end":4221.52,"speaker":"Jonathan Pageau","text":"There'S analogy through all the characters in Genesis to help us see whether they're from heaven or from Earth. That's a really interesting idea."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":4221.6,"end":4227.67,"speaker":"Nathan Jacobs","text":"Yeah. So I think that's a worthy thing to explore. And maybe somebody will get it before me and they can just say, like."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":4227.67,"end":4230.35,"speaker":"Jonathan Pageau","text":"Yeah, hey, finish the article, we'll publish it."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":4230.67,"end":4528.53,"speaker":"Nathan Jacobs","text":"That's great. Yeah, yeah, okay, cool. That would be great. Okay, deal. But anyway, like. But the reason I think that's important is because the microcosm doctrine of the Eastern fathers is they recognize that what man is, is like taking of mortal things. Like John of Damascus talks about this, where he's like, there's two types of things and he's doing like this porphyry tree of the nature being. And you have like mortal and you have immortal, right? And again, immortal, relatively immortal, because they're all creatures. But the point is like mortal and immortal. And one of the questions that emerges and emerges, you see it in Philo. So the natural question that emerges when you're like, okay, we're going to take something that's mortal and we're going to take stuff that's immortal and we're going to put it together. What do you have, like, is Adam made mortal or is he made. Made immortal? And you find that question in like Philo of Alexandria and, and, and then you find it in Theophilus of Antioch. And Philo's answer is the same that then echoes in the Eastern Church fathers. People like Theophilus, people like, you know, people like Nemesis of Emesa. And he basically says that he is created. Neither that he is created, potentially mortal and potentially immortal. And his will, right, self determination, his free will is what decides which one is going to Win out, moving toward the immortal, embracing it, participating in it, leading to deification, right? Participation in God ends up elevating and deifying the lower nature with it, right? It sort of brings it up into it, into the heavenlies. Whereas the alternative is if he submits to the lower nature, into the passions, it ends up inverted and you get a corrupted nature. And that's actually the nature of corruption in the Eastern fathers, is that it's just an inverted nature where the higher nature, which should rule and which should deify and should bring up to heaven, is perpetually, like, oppressed and dragged down and sort of beaten down by the passions of the lower nature, which have an unnatural sway. And that's the thing that Paul's talking about in Romans 7, is that the Spirit, and it's not the Holy Spirit, he doesn't bring up the Holy spirit till Romans 8. You know, he. And you can tell because he uses spirit interchangeably with Noose. In 727, he's talking about a war between, like, the passions, right, the fleshly nature, the lower nature and the rational nature. So the rational nature knows, like, the way, like, the thing it should do, but, like, the passions have unnatural sway. Now, why is all that relevant? Like, one of the questions is like, well, why make. Why make this merger of the mortal and the immortal? And in the microcosm doctrine of the Eastern fathers, the idea is, what makes man a microcosm is that it's all the things, right? He's made all of these sort of heavenly things, all of these immortal things, all these earthly things, and all of those things end up being merged into this one microcosm. Now, why is that relevant, right? Like, it's relevant. What's the purpose of it? Well, in the Eastern fathers, and this is because they have a cosmic view of man's salvation, it's not just about you and your relationship with Jesus and getting saved, right? It's for the sake of the cosmos itself, which is the idea that images of God, right? Things like angels, things like the rational soul can participate in and bear the likeness of God. We can start to imitate in things like justice and mercy and love, we can participate in things like immortality and in corruption, things like that lower animals, they reflect something of the wisdom of God, right? But not being images, they don't have the capacity to participate in some of those, you know, those higher things. So what happens is in the. Is man as a microcosm? By merging those things together, you create a means by which the lowest things of creation can begin to participate in God in a way they couldn't otherwise do it. And that's why the deification of man is not supposed to be just ending with man. It's supposed to spread. Just like with the story of the saints. Animals become more human, right, in the way they interact with the saints. Plants grow in weird ways, right, in the ways that it spreads from the saint to the rest of the cosmos. Like, a metaphor that I like is to say, like, look, you know, if we think of God like Bach, right, He's a brilliant musician, right? And. And. And, you know, there's all that creative genius within him, and then we're like, okay, but it needs to be articulated, okay, so Bach particular, you know, articulate for us your creativity, and we give him a cello, right? Like all of a sudden we. We get something really fantastic. But if we're like, here's a triangle. Show us your musical genius with a triangle. I mean, I'm sure he could do something more fascinating than I could. Yeah, but it's highly limited because."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":4528.61,"end":4531.33,"speaker":"Jonathan Pageau","text":"Limited by the identity of the thing itself, right?"}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":4531.57,"end":4644.68,"speaker":"Nathan Jacobs","text":"But you give him an orchestra, and that triangle plays a part now in the larger thing. It begins to participate in Bach's genius in a greater way than it could otherwise. And that's the whole point of the microcosm of man, is that what man becomes is. Man is on the one hand, an image of God, right? Having reason, logos, right? Spirit being a spiritual being. But at the same time, man is essentially a God over the lower things of creation, right? We are this picture of, like this, this. The rational, immortal things merge with the lower things. And then through our own transformation, you know, through our own imitation of God, we begin to raise up the lower things to participate in God in greater ways than they could otherwise. And that's why I think all of the sort of aspects, when you talk about the divine and realism and what's there in the divine mind and the archetypes and all the rest, why does it all come to that point in man? Well, it comes to that point in man because God desires all things to be as much like God as possible. To quote Plato's Timaeus, right, Like. Or to roughly quote it, right, that he desires all things to participate in him to a degree beyond what they otherwise could. But what that requires is that requires some being, such as man, who can actually provide a bridge between the mortal and the immortal. And through his own, you know, salvation through his own deification, raise up the lower things to participate in God to a Greater degree. And that's where, you know, we encapsulate, you know, not just the icon of God, but all the things that have ever been articulated by God, the whole of the cosmos. We become that small picture of the cosmos as well as a means of deifying not just our micro cosmos. Right. But the cosmos itself. So that's. That's the. That's how I would approach it."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":4644.76,"end":4676.69,"speaker":"Jonathan Pageau","text":"That's amazing. I mean, straight. Yes, straight. Beautiful. Straight out of Saint Maximus, straight out of the Fathers, but very powerful. And I think the image of the orchestra is such a great way of representing it, which is that it's. It's like it. It's in joining together this communion of love, we could say, of all these things, moving together, you know, into man and through man, and then becoming this, participating in the image of God. I think it's. It's beautiful. So, Nathan, we've been going for a while, but I want you to tell people a bit about your upcoming project because you're about to start a new podcast."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":4676.69,"end":4677.01,"speaker":"Richard","text":"So."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":4677.09,"end":4837.12,"speaker":"Nathan Jacobs","text":"Yeah, yeah, yeah. So I've got a podcast that's launching this week. I don't know when this one is dropping. I'm hoping it's dropping after mine, which is probably dropping in a couple of days. So hopefully this is appearing after mine is appearing. Okay. So mine is just launching now, and it is. It's going to be a mix of. Actually, based on your advice, it's going to be a mix of, you know, me, you know, you know, individually speaking to, you know, listeners as a public intellectual, as well as, you know, interviewing folks who are terribly interesting. And I hope you will be one of those folks who will come and let me interview you first for a switch. Right. You know, but, you know, that sort of thing, and a lot of what we've talked about today is what's central to it. Right. So what really sort of drove me to want to do a podcast was the fact that I realized, okay, there's a lot of resonance that I have with people like yourself, you know, with other sort of podcasters that are out there. But I recognize that I'm a little different in the fact that I'm a metaphysician. Right. Like, that's what I do. Right. Like, that's my area. And so a lot of the things that I do in terms of realism and realist metaphysics is there in the structures and in the conversations happening. But I'm like, I want to draw it to the fore. Yeah, yeah. And so that's where I was Like, I think my voice can add a little something to the conversation by just being somebody who's advocating for that. Exactly the thing we talked about, right, that realism, which I believe ultimately is a mystical approach to reasoning itself that begins to help unearth what's happening in the conversation. So I'm convinced the realist, nominalist divide is central to so many things happening in our culture. I think once you start to see that divide, you can begin to understand part of where we're at in terms of culture, in terms of culture wars, in discussions that are happening with people, how that divide, like what the real divide under is underneath the conversations and things like that. And so with my podcast, I'm really looking to spend time sort of drawing that to the fore and making people aware of it in order to help give them a framework for starting to look a little differently at the cultural divides, the cultural conversations, and then also begin to add to those intuitions, right, that sort of realist reasoning in terms of how to dissect and approach and, you know, think through a lot of these topics. So the Nathan Jacobs podcast, very creatively named. I decided to really go for something esoteric."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":4837.36,"end":4929.56,"speaker":"Jonathan Pageau","text":"There you go. I think it's great. I think it's important. I think that especially if you're able to bring precision to intuitions, that we have precision both in terms of the right vocabulary, the right order of ways to talk about it, really for it to land, but then also showing historical precedents that some of us, like I, some of them, I don't know, like some of the figures you mentioned in our conversation, I don't know much about, like, I know Philo, but some, many of the others, I was like, I never heard of these people. And so giving people a, you know, the, the, the food to be able to see that this is, like you said, this is the question that's playing out now. And that it's not some weird esoteric question about. About meaning and something that happened in the late Middle Ages, but that it is relevant to the re. Enchantment of the world right now, this sense that we have that the numinous and the sacred is in some ways crashing back into our reality. And we need ways to be able to. Like you, like you so well described that we need reason to help us navigate it, because that's what reason is for. And, and that there is no, there is. Isn't this, like, opposite of intuition and reason that we, that we sometimes formulate in romanticism versus classicism, that type of. Of thinking that's not a traditional way of thinking, but rather this. This rather idea of this flow of identity that, that you brought up. So I'm looking forward to it. And definitely I'll be one of your first guests if you want me to. I'll be very happy to participate. I think it's a great. A great endeavor, so be great."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":4929.64,"end":4932.44,"speaker":"Nathan Jacobs","text":"Thanks. Well, thanks so much, Jonathan, and thanks for having me."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":4932.52,"end":4933.16,"speaker":"Richard","text":"It was great."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":4933.16,"end":4933.76,"speaker":"Nathan Jacobs","text":"Thanks a lot."}
{"episode_id":"SW - #356 - 2024-09-09 - Dr. Nathan Jacobs - Embrace Realism - It's All Mystical!","start":4933.76,"end":4950.07,"speaker":"Jonathan Pageau","text":"All right, everybody, if you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase, so go to thesymbolicworld.com and thank you for your support."}
