{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":0.16,"end":43.22,"speaker":"Martin Shaw","text":"Do you know, my whole life no one has ever said to me, if there's one thing I just can't stand, it's a great story, it's never happened. And so I encourage everybody to be storytellers. Don't explore a story without actually telling it. Living in the room, living in your jaw, because something essential gets passed on there. The soul is not fed entirely by logic. We are fed by images, we're not fed really by ideas. Ideas are interesting and we can puzzle on them. But when we want to be absolutely polaxed by wonder, it is a story, one way or another, that is going to do it."}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":54.98,"end":105.17,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the Symbolic. Hello everyone. It is my joy to be here with Martin Shaw. Everybody who watches this knows who Martin Shaw is. He is, he is a wonderful storyteller, a professor and author and he was there with us at the Symbolic world Summit this year. And Martin is also doing his very first online class with us on Christian wonder tales. He's been spending several years, I guess by now going back into those ancient stories, all those weird stories that nobody dares look at anymore and is going to make them resurface for us. And so Martin, thanks for, thanks for coming."}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":106.61,"end":111.09,"speaker":"Martin Shaw","text":"Thank you, Jonathan. Pleasure to be here today and I am really excited about this course."}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":111.57,"end":117.19,"speaker":"Jonathan Pageau","text":"So why, why were you attracted to these, these stories, these Christian wonder tale. Like what, what is it about them?"}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":119.27,"end":345.21,"speaker":"Martin Shaw","text":"I like them because you're not, you're not clinging on to them in the way you may. One of the Gospels, for example, There's a kind of looseness to them. There's a sense that it's a kind of an abandoned Christian mythology really. And at the beginning of this year I was on the smallest of the Aran Islands off island, so it's a remote island and I spent some time really on vigil in the. The remains of a chapel of a woman called Saint Gobnut who was a bee maiden. There's lots of stories around her and these stories. A bee maiden, yeah, she's just good with bees. Bees are attracted to her honey in Irish Christianity, yeah, is a thing, you know, bees are attracted. There's a story you will have heard me tell before of a young, a young Christian making his way across Ireland carrying the body of Christ. And he sees this sort of ecstatic smoke or cloud coming towards him and he falls into an ecstasy and when he wakes up, the body of Christ has left him, which is something that can happen to young Christians. One moment, it's all very up close and Personal next moment, God has gone. And in the end, it turns out, after conversing with an angel, that the bees have actually taken the body of Yeshua to create a little kind of bee, a bee chapel, where there's a bee Eucharist and they serve mead, I suppose, rather than wine. But this monk's life becomes bringing people to the bee chapel and the presence of Christ. Now, for a year, he tells no one of this delirium that he's lost. You know, he had one job and he's messed it up. But the angel says to him, you know, the grief and the shame you were carrying was far heavier than the body of Jesus. You should have just fessed up to this straight away. We should have got you in confession. And the question I always ask my students at that point is, when did you go through something that you considered a failure that was actually making honey? So we look back at our own lives and we see all sorts of things that seem like detours and mistakes and betrayals. And actually there is a shape and there is a pattern for. It's a lot of the work that you're doing, actually, it's symbolic world, I think, is sifting that to consciousness. And these old saint stories do that. They do that. And they are, they are. I've been working recently and I haven't announced this yet, but I've been working. Have you ever come across a Saxon gospel called the Healand or the Heliand? It's a. It's a. What you call like a retail. Yeah, yeah. It's the four Gospels that a 9th century monastic over in Germany put together. And it is clearly the story of the New Testament. But, you know, you get. You'd get Pontius Pilate being called a Thane, and you would get Rome being called a hill fort, and you would get Jesus being called the generous chieftain. And when they sail out on the lake, they're on a long ship. But this story essentially is the same. And there is a sense with these early saint stories of something like that going on. You go, oh, okay, These, these riffs and motifs that keep showing up are biblically embedded, but they're in a landscape that the Celts can comprehend."}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":346.57,"end":352.33,"speaker":"Jonathan Pageau","text":"And so are these tales that you're looking at, are they mostly coming from. From the Celtic traditions?"}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":353.37,"end":485.06,"speaker":"Martin Shaw","text":"Yeah, they are initially. They are initially. But we're not going to stay there. Where we're going to begin is actually just before the arrival of Christianity in Ireland. We're going to begin with something called the Invasion Tales of the Tour de Donan, which is really the notion that Ireland was never created. It just sort of always was in the Irish pagan mind. They just was always here. It's incomprehensible to think of a time when Ireland wasn't there. So, as you probably know from the story, there are various competing forces for Ireland, one of whom, the Tuathed Donan are really what you would regard as the fairy people, the people of the she, the people of the hill, the gentry. Down here in Devon, where I live, we call them the Benji. Yeah. You know, they're all around, or certainly in folklore. And so we're going to begin there, we're going to look at the temperament and the consciousness of the stories before Christianity arrives, and little bits of foreshadowing that you get in those stories. Then in the first couple of gatherings, I will start to tell very much in the manner of a shanakey of a storyteller, I'll just tell the stories and see where we locate ourselves within them. However, and this is important, we're not staying there for the whole duration. What I'm really interested in is actually how saint stories and stories like the heli and begin to evolve into what in the 12th and 13th century we come to know as the chivalric tradition and the Arthurian tradition, which is very embedded really within Christianity. It's really the notion of noblesse oblige, that Christ has rescued you from the dung heap and placed you to sit with princes and quite. What are you going to do about that? So there's an evolution going on. We. We have the early Irish stories, but then we begin to bring it into a wider Arthurian context. And if you're thinking of an Arthurian context, that is as European as it is British after a while."}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":485.7,"end":507.06,"speaker":"Jonathan Pageau","text":"Right, right. And so you see this fusion of the Celtic myth with Christianity, but also, I mean, obviously in the Arthurian tradition, you see this kind of French romance integrate into these tropes, but you can still tease out, you feel like you can still see the glimmers of those old Celtic stories in the Arthurian romances."}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":507.38,"end":579.29,"speaker":"Martin Shaw","text":"I certainly can. I certainly can. And I mean, if you're going to. If you're going to look at the Arthurian tradition, a lot happens, really around, as you're saying, with the influence, actually even of the Moorish poets in medieval Spain coming over, bumping into the courtly schools of love, bumping into Eleanor of Aquitaine. And so whilst the appreciative consciousness, you could say, of the Muslim poets is coming out over the Pyrenees. It's colliding with stories coming down from the Norman courts of Wales and Britain, because the storytellers there primarily were not Saxon, they were Celts. And so they start to hear about King Arthur. They start to recognize ways in which the Arthurian tradition, as you're saying, is a confluence of influences. But you don't have to look very far before you can see these earlier 6th century strands that are the ones we're going to be exploring most profoundly for us will be Gawain and the Green Knight. That'll be the final session."}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":579.37,"end":588.97,"speaker":"Jonathan Pageau","text":"Oh, yeah, yeah, yeah. Oh, that's. Oh, that's wonderful. That'll be amazing. So moving from early pre Christian, you know, Celtic traditions all the way to Gawain."}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":590.26,"end":664.55,"speaker":"Martin Shaw","text":"Yeah, that's it, that's it. And the final session will be around the notion of a rule for life, which is something in orthodoxy we're fairly familiar with. And anybody that's interested in Christianity has a sense of how do you get your life into an organized shape? What are you going to focus your attention on? And that is part of the chivalric, Arthurian and I think, Christian ideal. You don't have that so clearly in the early Fianna mythological stories of Ireland, then when the saint stories come with that incredible influence of the desert fathers and mothers. So you, as you know, you'll have talked to Paul Kingsnorth about this, I'm sure what you get in Ireland in the early days is this terrific Coptic Egyptian influence that's actually going on as well as the more Latinized version of Christianity that begins to creep in via England. But not. I hate to break the news, but not everybody is designed to be a saint in the desert. Not everybody is. So what we. You've got to balance, read well on paper."}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":664.55,"end":668.83,"speaker":"Jonathan Pageau","text":"Right. It sounds. Yeah, just live in the desert, pray all day. Is that wonderful?"}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":670.62,"end":748.83,"speaker":"Martin Shaw","text":"30 years now of leading wilderness vigils in a forest or in wild places. I know, I know the reality of that kind of encounter and it's useful, but it's not for everyone. It's not for everyone. And so what you get within the chivalric tradition is a way in which people can incorporate a spirituality as much of the village as of the forest or the desert. I'm very interested in the word merry. Do you remember, like Merry England, Robin Hood, you know, Merry England. Well, merry is a word to describe a lot of what was going on in Britain in pre Reformation Christianity before the stripping of the altars, before everything gets very, very honed down within with reason to Some degree, I understand kind of why it happened. It just went far too far, I feel. So all of that is what's going to be in this notion of a Christian wonder tale. You know, I couldn't believe it, Jonathan. I actually Googled Christian wonder tale a few years ago. It just didn't exist as a word. It wasn't there. So we've done it, we've brought it, we've sifted it to consciousness."}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":749.39,"end":794.72,"speaker":"Jonathan Pageau","text":"Yeah. And it's interesting because there. Those wonder tales are there also in other places. Right. In the Greek traditions, you have these stories, but they've also been forgotten or they've also been tamed. And if you think of the stories of St. Anthony, right. So the very first hagiography ever written, in the story of St. Anthony, he goes into the desert and meets Centaur and a satyr and talks with the satyr in the desert. And it's like everybody who has an icon of St. Anthony, do they even know about these. These wild aspects of the early saint stories? I think everything has been tamed, even in orthodoxy, to some extent. A lot of things have been tamed to kind of fit our modern frame of thinking."}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":796.32,"end":963.24,"speaker":"Martin Shaw","text":"There's a wonderful story about a young lad called Saint Kieran. And Saint Patrick gives him. He's a young monk, he gives him a bell, and he says, this bell will ring wherever it is that God wants you to create. Your little church, your chapel. And so Kieran wanders off into Ireland and he has high hopes that it'll be somewhere very beautiful. So he would hang out, I would imagine, in what we would now call Dublin. Or he'd hang out in what we now call Galway or somewhere beautiful like Connemara. But he ends up in a deep, gloomy forest. And sure enough, to his horror, the bell starts to ring and he muffles it, you know, like when your phone goes off and you don't want anyone. You're in church and you're trying to. And I wonder, what is it like for us when a spiritual bell starts to ring and we muffle the sound? You know, we do this. We. We don't want to. We want to be like Jonah, you know, we. We head off in the opposite direction of where God is usually telling us to go. So Kieran, in the end, honours the bell and he starts to build his small chapel. And bit by bit, his first students, his first monastics turn up. And of course, they turn up as a boar, tusked boar, and they turn up as a wolf, they turn up as a fox. And suddenly Kieran is realizing that the story of Jesus seems to speak across species, even the animals are interested in. And so he sits down around the fire in the forest at night. And for a considerable chunk of time, the first willing students of the Christian religion are the animal presences. And then finally, bit by bit, people start to turn up. And you get that in Celtic Christianity, in the early church, many of the places where even abbeys were created initially, there is an encounter with an animal there. There's some profound encounter with an animal. And that would be the place this woman I mentioned on the Scott, on the Irish island St. Gobnad, she finds the place that God intends to her for her by following nine white deer. So you can imagine the metaphors are so rich, the images are so wonderful for people. But because as far as I'm concerned, everybody I meet is a saint in training. You know, why not? Why not? You know, that. That's as certainly, as Christians, what we're trying to be. So these are stories that give us, with a little bit of mischief and a little bit of beauty, you know, a road to follow."}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":963.88,"end":1002.37,"speaker":"Jonathan Pageau","text":"Yeah, yeah. And how, you know, I mean, I've been. Obviously been talking about this. I'd like to hear. How do you. Because for a lot of people, these stories, they're actually embarrassing, right? They're embarrassing to them because, okay, so he gets a bell or, you know, like animals come to the campfire. You know, the modern mind becomes cynical very quickly. And so what do you. How do you. What do you think their way back into these stories are? What. How can we, as, you know, modern people that drive cars and have cell phones, how can we dive back into these stories?"}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":1004.05,"end":1209.07,"speaker":"Martin Shaw","text":"Well, they're not for everybody. I think that's the first thing. If you really have no instinctual interest in them, then you'll find some other way to live, some other temple to serve in. I feel very strongly about Christianity in general. Actually, we should just let the stories be the stories for a bit. We should stop whacking them over the head with allegory or theory or even too much theology. I'm of the old tradition that Holy Spirit goes where he will. And actually, these stories are luminous. They're stained glass apparitions, loaded like the layers of an onion with information and, and, and disclosure. So I never try too hard to persuade anybody of anything. I let the stories do the work. And I think as soon as you've got animals in story, animals that talk, and you've got bells that ring, we know we have entered the marvelous. And we know that we have entered a terrain that, for me, is telling me a deeper truth about my life than statistics ever can. You know, I was listening to the. I've just been praying in a church this morning, and beforehand I was listening to the radio. And as you know, well, the world is filled with invasion and war at the moment. It's all we hear about. And I needed. I know from mythology that if you gaze too long at a monster, it will reduce you to ashes. And the correct mythological approach is to have a shield, and you gaze at the trouble through its reflection on the shield. And these stories do that in a fashion. I have lots of friends of mine that have been involved in, you know, activism work of one kind or another and are simply burnt out by it because there's no artistry to their approach to it. They just fall into despair. So I find these stories really nourishing, really protecting. In a strange way, they protect me. But it's what the Mexicans call the river beneath the river. And if somebody is constantly using a certain analytical part of their mind, that is all well and good, but it's not something that Ian McGilchrist would be interested in. It's not that great. Or what James Hillman called the poetic basis of mind. Most of us want to hear stories. Do. You know, my whole life, no one has ever said to me, if there's one thing I just can't stand, it's a great story. Never happened. So I encourage everybody to be storytellers. Don't explore a story without actually telling it. Living in the room, living in your jaw, because something essential gets passed on there. So to go back to your original question, I think initially most people are very happy to settle by a fire or even by a computer screen and get told a story. But there can be a slow, protracted nervous breakdown of your usual way of thinking. Quite honestly, I'm famous for this."}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":1209.31,"end":1211.31,"speaker":"Jonathan Pageau","text":"That's right. Yeah."}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":1211.31,"end":1215.55,"speaker":"Martin Shaw","text":"You know, so I can't apologize. I can't apologize for that."}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":1215.87,"end":1306.79,"speaker":"Jonathan Pageau","text":"I like what you're saying. In some ways, to some extent, explaining it is not the right way, because there is a mystery which is real, which is that these stories, like I say from the fairy tales, these legends, all these types of stories, they. They contain elements which, to the everyday life and to the mundane life, seem completely absurd. But nonetheless, that type of storytelling is universal. Universal in every culture of all time. There are stories that have these elements in them. And not only that, but, you know, you tell a fairy tale to a child and the child immediately loves it and is more attentive to it than he would be to a mundane story. Even though if you break down the elements in the story that, like, in terms of everyday causality, it's ridiculous. Like, it's. Why is there talking wolf? Why? What. What? Like what? You've never encountered these things. So there is, you know, even just. How can I say this? Like, even just. If we look at our experience of the stories from being a child to being today, there is something necessarily precious about them by the very fact that these stories exist, that they've been told over and over. And that, like I said, even though, you know, when you. Jordan Peterson, has this famous thing, it's like you watch Pinocchio and you see Pinocchio being swallowed by a whale, turning into a donkey, speaking to a cat, and you never ask."}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":1306.79,"end":1307.39,"speaker":"Martin Shaw","text":"You never."}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":1307.39,"end":1324.07,"speaker":"Jonathan Pageau","text":"You're never bothered by it. You never think, well, that's silly. That's. That doesn't make sense. But why? Because obviously you'd have never, like, ain't. So there's a deep. There are deep analogies in us that resonate in these stories even though we don't. Even though we don't understand them."}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":1325.43,"end":1415.25,"speaker":"Martin Shaw","text":"Yes. And I think it comes to that very strange notion that we find all over the world that humans have a soul and a soul. A soul is not fed, it seems. It seems that the soul is not fed entirely by logic. And usually in our life, the times we feel most profoundly alive are in times of great distress or great wonder. But in some way, the soul seems to wake up. And traditionally, in many cultures that are ritually savvy, that don't have an understanding of, you know, initiation mythologies, the slow process of growing into a human being, we are fed by images. We're not fed really by ideas. Ideas are interesting, and we can puzzle on them. But when we want to be absolutely poleaxed by wonder, it is a story, one way or another, that is going to do it. You and I would have been in church on Sunday in the midst of the. The story of the Divine Liturgy, that very slow, ancient dance that we're all part of. And the truth is, don't tell anybody. Sometimes I don't want to go to church. Sometimes I wake up and I think, oh, no, here we go again. My feet are already aching. But something will happen in the second. Usually in the second hour of the liturgy."}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":1415.25,"end":1415.77,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":1416.25,"end":1438.06,"speaker":"Martin Shaw","text":"Where I will fall backwards into the. The arms of the story of the liturgy. Somehow I never know when it's going to happen. Never know, can't guarantee it. But something happens and I get lifted out of my mundane, worried, neurotic mind. And for a period of time, I experienced something like grace."}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":1438.62,"end":1439.1,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":1439.26,"end":1492.79,"speaker":"Martin Shaw","text":"And then I can't sustain it. And so I come back and I'm the same irritable rat bag that I was before I went into church. But I find that stories give me. And forgive me if I've said this before, you know, you end up. I'm sure you experience this saying things I've had. Have I said this already in the last five minutes? You experience in stories, pinpricks of eternity. And actually, as a mythologist and a storyteller, I lived on pinpricks of the Eternal for 25 years in the stories I was telling. And then, you know, and I do have to say this. Entering Christianity, it's not pinpricks anymore. It's a great river that you've entered. You. You've entered what was hinted at and alluded to in many other stories. Suddenly you've gone from, you know, milk to, as Paul would say."}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":1493.51,"end":1530.51,"speaker":"Jonathan Pageau","text":"But why do you think then. I mean, this is a big question, but, you know, we can poke at it. Why do you think then that so many of the wonder of Christianity has been reduced? Right. Why. Why is it that Christianity has been made so mundane when, if you look at the very elements of it, if you look at the story of Jesus, the crucifixion, the resurrection, the communion, the Eucharistic meal, all of it is completely out of whack. Like there's nothing. There's nothing. How could something like that become kind of moralistic, mundane?"}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":1531.87,"end":1762.7,"speaker":"Martin Shaw","text":"Yeah. Is there. Is there nothing we can't pull the stinger out of? Eventually, I think I said it a few minutes ago that I think to come close. To come close to story in the way for a modern person to come close to story involves almost a kind of nervous breakdown of their conventional ways of thinking. And I think to really approach what a Christian is, is similar. It certainly has been, for me, it's been an extraordinary process. But when I look, if I was to critique, and I'm not really qualified to do it, but I will if I. If I was to critique modern Western Christianity, a lot of the time it seems to activate the will, you know, that evangelistic, great commission esque feeling that we have in the West, Western Christianity feels very extroverted to me. It feels a very extrovert version of the Christian experience. Orthodoxy doesn't really. And when it is as much an effort of will as it is an experience of love, then I think you lose contact with the wildness of the thing because you are trying to make it. You're trying so hard to make it accessible. In a strange way, you are no longer asking anything of anybody. Now, what I mean, I would have heard you, actually. You and I were talking recently, you and I were talking recently about this situation that the church often seems to be in, where we are mimicking a culture that no longer cares for us. And you said to me, you said, look, if I want to go to a rock concert, there's a much better rock concert I can go to than the one that I'm going to get in my local parish. I'll just go and see Pearl Jam or I'll see, you know, I'll just do that. And so I think we have become photocopied and photocopied and thinned out. We have lost, as many other people have said, predominantly over here, Tom Holland. We've lost our weird. And a positive example, though, of a change would have been last Saturday. I would have been with my spiritual father, Father Porphorius, with a whole group of young catechumen, so young guys, predominantly men that are going to enter the process of moving into orthodoxy. And one of the reasons I asked them, I said, you know, why are you here? Is predominantly because the situation calls something. It's calling something out of them, it's calling more out of them, which is a chivalric, gallant position. Christianity is very strange because on the one hand, it has this great emphasis on humility, but on the other, it has this emphasis that your steps in this world matter and have consequence, and you have to proceed like that, but not being annihilated by your own ego. So I'm going in all sorts of directions from your original question, but you and I follow a God who was born a fugitive, he dies an outlaw, and then he has the audacity to return. That's wild information. That's very, very strange. It's very strange. But it has become thinned out, domesticated, and so combed over, we can't seem to hear the message of it anymore. It doesn't seem to get anybody excited."}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":1763.82,"end":1864.7,"speaker":"Jonathan Pageau","text":"Yeah, I think your point also, you know, this idea that it engages the will, because one of. One of the things that happens in that case is that we feel like, okay, now we master this, you know, and now we're going to, like you said, make it available to others because we, you know, we've got this, you know, whereas in fact, the story of Christ, you know, and the life, the liturgical life is something which is constantly transforming you, right? It's constantly change. It's constantly bringing you into insights and, you know, personal insights of your life, but also cosmic insights and insights about others and insights about, you know, and participation into things that keep growing and keep getting bigger. And so, yeah, I think that's interesting if you. If you see yourself rather in the story, right, in the flow of, like, we are part of this astounding story, we have the chance to have a little parcel, you know, of Christ and to live that out in our life. That is definitely, it seems like a way into, you know, a way into the mystery. But on the other hand, I also see. How can I say this? Like, I also see the opposite, right? I see people who make it all about themselves as well, right? Make it all about their story, like their own story. And so it seems like what we need is something like, yeah, this balance between this life that I'm leaving, but as it is anchored or in the river of a greater cosmic story."}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":1864.7,"end":2016.9,"speaker":"Martin Shaw","text":"At the same time, I've been thinking recently about the. Because I'm working on this Saxon gospel, not because I need. Not because we need it particularly, but just because it's a wonderful bit of storytelling. It's incredible. But I've been thinking about the Saxon relationship. They're very heavy on the notion of fate and destiny, Fate and destiny. It's a Scandinavian thing, it's a Saxon thing. And someone was saying to me recently, they said, well, as a Christian, what do you make of all of that? And I said, well, I want to be as surrendered to the mind of Christ as I possibly can. So as a Christian, I'm trying to enter the river fully that, and go in the direction he wants, but. But I will wiggle my kayak as I go. So in other words, it's this. It's surrender to the life that God wants for you. But at the same time, I would presume he has infiltrated you with intuitions, gumption, a little bit of personal stamina to move your, you know, move your craft. I'm not in a sort of blissed out state all the time. I. I often think that a Christian is required to be both steadfast and restless. In a way, when you read the Gospel of John, it's hard to pick it out. But right at the beginning, the Gospel of John, he's writing not just for Christians, but he's writing that you stay a Christian, that you stay a Christian. So the Notion is that Christianity has an active principle to it. There's a movement in the story. It's very hard as you get older, your mind gets calcified with certain ideas. And one of the most dramatic things for me about my conversion to Christianity was in the middle of my life having to sort of dissolve a lot of what I previously thought was absolutely established in my thinking and in my character. And. Yeah, that's this. The stories that we remember, the stories that we come back to, are filled with those crossroads moments. Myths are very rarely about the day that was just like the day before. They're not. Those stories are not worth remembering. Certainly not in an oral culture. We remember the story where something unexpected happens on the way to the fair, you know."}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":2016.9,"end":2041.42,"speaker":"Jonathan Pageau","text":"Yeah, yeah, exactly. And so when you look at these, these Christian wonder tales that you're exploring, or, you know, the Saxon gospel and these, these, this kind of fusion, let's say, between the. The. Are there something that you've seen that you're almost thinking, okay, I can't, I even, I can't touch that. Like, that's. It's too weird or that's. I don't understand it. Like, I see how it connects?"}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":2041.66,"end":2101.97,"speaker":"Martin Shaw","text":"Yeah, yeah. I would, I would say an interesting question for me over the last few years has been, as a, as a Christian and as a storyteller and a mythologist, are there certain stories that are just not feeling right to tell anymore? Yeah, and actually, I would have to say there's a couple in the Scandinavian pantheon that are just so dark and are so woven in with witchcraft, it is not appropriate for me to get my energy behind them and bring them into the world. It doesn't mean that I don't appreciate them in a. In a rather macabre fashion, but I'm not putting my, I'm not putting my, my energy behind it. It's. It's too inculcated in a wildly different take. Does that make sense?"}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":2102.37,"end":2103.41,"speaker":"Jonathan Pageau","text":"No, you have to."}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":2103.41,"end":2155.08,"speaker":"Martin Shaw","text":"You, you, you're going to feel at some point not all roads leave up, lead up the mountain to Muhammad. Not in my book. You know, so there are certain stories that I may even consider translating or having written down. But when you tell a story that engages another kind of energy altogether. And so with the Saxon gospel, they're cleaving so clearly to Matthew, Mark, Luke and John. That's fine. To the early Celtic wonder tales, the Christian wonder tales, they again, have all sorts of similarities to things that you're reading in the Gospels. And there's no taste in your Mouth that feels that the message has got so mixed, it's lost its divine ground. No, I haven't encountered that."}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":2155.16,"end":2173.4,"speaker":"Jonathan Pageau","text":"Okay, wow. I mean, that. Yeah, that's. That's fascinating. And these stories, were they. How are they preserved? Like, are they. Were they preserved actively or are they. Like, there's just one. One book somewhere in the library that they found, you know, in the 19th century. Like, were they preserved actively?"}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":2175.06,"end":2286.27,"speaker":"Martin Shaw","text":"They're all over the place. There's lots and lots and lots of books from the late 19th and early 20th century. Saint Tales, accounts of the early saints. Now, the thing is, they're written without a tremendous amount of imagination. So it's very easy for your eyes to go dead. You have to be a storyteller. You have to be a professional in a way to glean what is actually going on and go, okay, does. Could this work in a room? Does this. Is this story inviting me to be related to it? One of the things in stories that is interesting is when you come to a part that makes you uncomfortable or you don't like. When I'm training storytellers, the first thing I say to them if they're hearing a story from me for the first time, which bit can't you remember? And at some point, someone will say, yeah, there was a red rider. Then there was a right rider. Was there another rider? I said, well, yeah, there was a black rider. And whatever you forget in the story initially is your point of investigation, because it's the part of you that shuts down and says, I'm not ready for that information. I'm not ready to hear that at the moment. And so, in a way, it's not what you remember, it's initially what you forget as a storyteller that pulls you further in. That's the invitation. So, as I always say, spiritual information often arrives with dismay. And it's stories that confound me on occasion or upset me that become a pebble in my shoe, that over time, I have to, through the slow labors of storytelling, bring it into my body and psyche. So better I understand it."}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":2288.27,"end":2304.99,"speaker":"Jonathan Pageau","text":"And so can you give us an example of a story that was your blind, like, blind with your blind spot. Like a story that you. It took you a long time to be able to see properly. That's a tough question."}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":2305.15,"end":2547.31,"speaker":"Martin Shaw","text":"Yeah, let's. I'll go for a massive story. I'll go for the story that we're both familiar with. Parsifal. So parcel is. Is. Is a grail epic, Parsifal, depending on how the Word is spelt. You get different versions of it, some that are French, some that are German. The one that I really like was written, composed at least by a man called Wolfram von Eschenbach, who was a German. He was something called a minnesinger, a singer of love. Who. The Germans. You know what the Germans are like. They see what's being done somewhere else and they say, vival improved this. And so they saw what was happening with the. With the troubadours, and then they get the minnesingers. So there's a lot of interest, a lot of influence of Shret and de Troy and others. But the story of Parsifal Parcel as a character, actually, for me, for the first half of the story, is deeply unattractive. And he's. He's almost repellent. He's naive, he's boastful. He commits one. One audacious mistake after another. In fact, they say in it, Wolfram says he made an art of his failure. He made an art of his failure. And it's only in the second half of his life when actually he has an experience where he could have. He could have healed the ailing Grail king, but is not experienced enough to do so. It's in the second half of his life that he tries to find as an act of will, something he was initially given as an act of grace, which is kind of impossible. But often earlier on in our life, we are afforded all sorts of opportunities that out in the wastelands of our 40s, 50s and 60s, that all seems to have gone away. We're in a much harder place. So Parsifal was a story for many years. He was not attractive to me in the way Robin Hood would be attractive. He was not attractive to me in the way that Beowulf would be attractive. But in the end, I realized, me, with my own catalog of disasters and mistakes, he was telling me far more about the walk of my own life than any of those wonderful, highfaluting heroes ever could. And so then. Then what I had to do. Jonathan, imagine this. Wolfram's. Wolfram's story is 411 pages of gossipy High German, medieval High German. You know, most of it's just descriptions of suits of armor and horses. And I had to take. I had to take those 411 pages and over a period of about a year, inculcate them into a language that round a fire for two and a half days. I could tell without people going into a, you know, a trance of boredom. But by the end of it. I had wrestled like Jacob with the story, and I had recognized my own failings and smallness of spirit that Parsifal has. But also I had forgiven myself in a way, because in the way in the story, you have to forgive Parsifal. But it's only when Parsifal actually is in the process of. He meets a holy man who gradually reveals to him what a disaster he's made of his own life. It's then that Parcel himself says, I need to ask for forgiveness. And I always say in that part of the story, this is the moment when something grandiose in Parsifal died and something great was born. And I think all of us as human beings at some point are going to encounter that reality. So the big one for me was Parsifal. What about you? Have you ever had a story that you struggled with?"}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":2547.95,"end":2617.83,"speaker":"Jonathan Pageau","text":"Yeah, I think that it's funny that you say that, you know, it's funny that you mentioned that, because I've also noticed that when I. I mean, obviously I love the Bible stories, but I've also noticed that there are some Bible stories that I don't remember. And especially there are some parts of Jesus's story, for example, that I tend to forget some of the things that he said, which. Some of the parables that don't make sense or that seem to say the opposite of what Jesus is saying. And you know, for example, like for the longest time when I was. When I was young, there was a part of Jesus, the part where he says. Where he praises the Pharisees. Well, he doesn't praise them, but he says, you know, he says, don't do what the Pharisees do, but listen to them. They're sitting in Moses seat, you know, and as a kind of young rebel, you know, punk, punk rock kind of teenager, let's say, in my. Up to my 20s, like, I could. I couldn't see that part. I just couldn't see it. And then at some point in my mid-20s, that text hit me. It was like. And I read it and I thought, what?"}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":2617.83,"end":2618.19,"speaker":"Martin Shaw","text":"What?"}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":2618.19,"end":2693,"speaker":"Jonathan Pageau","text":"I. Jesus says that? And I thought, I've been reading this story for years and I've never seen it. Like, I. Because I've never seen that Jesus says that or I've relegated to some dark corner where it doesn't. It doesn't matter. And so that's. Those are the types of things that I. That I pay attention, that I pay attention to. For example, even in terms of just insight into. Into how profound those Stories are like, there's a part in the Gospel where Jesus tells Peter to bring a sword to, you know, at the, at the Last Supper, you know, and I always just would completely ignore that because the part where Jesus tells Peter not to strike the Roman soldier, that makes sense, story wise, like it makes total sense. But you don't remember that Jesus told Peter to bring the sword in the first place because that part bothers you. It doesn't, it doesn't give you that nice clean, you know, like Francis of Assisi, Jesus that you expect. And so even, especially in the story of Christ are the places where elements of Christ's story of things that he said or things that he's done that wouldn't stick, just wouldn't hold in my memory are the ones that have brought me further because they've compensated for my own tendencies."}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":2693,"end":2804.8,"speaker":"Martin Shaw","text":"You could say I think you've raised something very important, really, which is, what is, what are those stories trying to do to the reader? Because you imagine that any keen editor would have spotted things like this immediately and bit by bit by bit removed the pebbles from the shoe, but they're not in there. And so you come out, if you really are concentrating as you're reading, you're going to come out of it. Not usually with the fulsome glow that I would receive from an epic myth. I come out of the biblical stories aware that something powerful and rather disturbing has happened that I've only half glimpsed. I'm, I've been asked a couple of times, they've said, you know, when you pray, does Jesus sort of stand in front of you in that iconic way where, you know, he's literally facing you like an icon? And I say, not at all. He's a figure moving through the tree line. You know, I just catch glimpses. He's thrilling. For me, I never ever feel Christ like, ever. So that's interesting because here's the thing. One of the questions I had before I was a Christian was how on earth do you follow a figure who is entirely perfect? How do you figure, how do you follow a figure made of light? Because you would know in conventional mythologies we have very nuanced gods and goddesses. No one is going to Zeus or Dionysus or Athena or Grendel for, you know, an experience of complete, emphatic, you know, luminous wholeness."}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":2804.88,"end":2805.36,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":2805.74,"end":2936.84,"speaker":"Martin Shaw","text":"So that's been one of the challenges for me. I was talking to someone recently and they said, well, reading the Bible is like having a bath, you know, and sometimes the bath feels Rather hot as you get into it. And the language is clean, as we've discussed before. It very rarely describes, if ever, the inner condition of anybody. Yeah, you've got the surface thing, you know, and then this happened, and then this happened, and then there was this, and then they went onto the hill. And as a storyteller, I want to break down in tears because I'm thinking this is going to be very difficult for me to tell. I. I have good news, though. Since I've seen you last, I have started to tell, say, for example, the stories of Genesis up to about the Tower of Babel. And they are fulsome, wild, beautiful, disturbing things, even told orally. But they're not chapter and verse, but the. I cleave to the. You know, I cleave to the narrative. I. There's a limit to poetically how far I'm going to go with it. But, yeah, I love it. But as you're saying, I forget. I forget because the Bible seems to be sometimes contradictory. I realized a few years ago I was never going to get a clear sense of half of what Jesus was saying until I did the slow labor of the Old Testament, because he is continually. Everything is talking to everything else. In Russian fairy tales, if you're trying to get close to the firebird, she's often in a cage in the wild. If you touch the cage, there's thousands of invisible strings that go off into the forest and everything suddenly becomes luminous and alerted. And I find the Bible a bit like that. It's got all of these tendrils attached to it, but it doesn't, quite honestly, as someone that's grown up with Homer and Shakespeare, other than the Song of the Songs or Job, it doesn't always give me what I'm hungry for as a word person, but it gives me something deeper."}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":2937.99,"end":3061.08,"speaker":"Jonathan Pageau","text":"Yeah, but the figure of Christ is definitely. What you said is very insightful because in Scripture, all the other characters have a light and a dark side. Right. You can read almost all the Old Testament stories, and I actually encourage people to do that as an experiment. Read the story of King David from the point of view of King Saul. You can do it. And you can see that King Saul sometimes, if you can make actually King Saul write to some extent in some places where it's like, you know, I don't know about David. He's a little shady. You can do it. Even read Exodus from the point of view of the pharaoh and realize that, you know, he's got his reasons for what he's doing. And so all the characters actually, although the descriptions are sparse, the characters are actually quite complex. And even in the New Testament you see St. Peter, St. Paul, you know, in the way they present themselves, you can see like their, their warts, you know, even though they're saints, you can kind of see their warts and how, and their excesses. But Christ, Christ is like, ah, it's, it's annoying because on the one hand, like you said, he's, he presents the perfect person. But then at the outset that perfect person doesn't look like the way you think it should look. And so, and so he also has like all these multiple aspects that, that's why we struggle to see it because we, we think we have a particular point of view. We think Jesus should be, like I said, he should be Saint Francis of Assisi, nice with everyone. Hippie, dippy Jesus, right? Or he should be, you know, like telling people off, telling them their real truth. You know, getting them get, you know, getting them the message, making sure that, that and, and it's like if I like one of those, then I struggle to see the other because it's so complete and, and so there's always this prism that I can't completely see through because it has, because it has all these facets that are, that don't seem to usually belong together. Maybe that's the way of thinking about it."}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":3061.08,"end":3205.36,"speaker":"Martin Shaw","text":"That's exactly, exactly right. You can't draw Jesus with one line. You know, I think as a child I really wanted him to kind of morph into John the Baptist. You know, I just really want, I really like John the Baptist or, or I really like Elijah. You know, I really like those kind of guys. And then he's a bit too, sometimes he's a bit urban for me, but then he's back out praying early in the, for in the morning. You don't know what he's up to. You can't, you can't pin him down. And on the one hand, Christ is willing to talk to everybody. But beware if you talk to him, beware because he's going to, he's, he's going to confront you with something. He will expose you. I say this to people all the time. I live in a state as a Christian of intolerable exposure. It's dreadful for me. It's a constant low level humiliation because I'm, because of all things that we're describing. Mythology, wonderful though it is, offers you a lot of places to hide and it allows you to worship as, as Paul would say, the unknown God, you know, that's what I did for years. I just lived. Romanticism is a push towards Christian experience, but it's not quite it most of the time. I was. I was finishing a book the other day and I wrote something that I thought was meaningful to me. I said, every experience of beauty. In every experience of beauty, we are being prepared for eternity. In every experience of beauty, we are being prepared for eternity. I believe that as a Christian, certainly those glimpses of something and it's. It's wise. The romantics say, you know, truth is beauty. Beauty is truth. Beauty shows you what you want to defend in your life, what you're going to stand for, how you earn your name again. This is the chivalric tradition. This is a very Christly way of living, I think. But, yeah, the Bible, my goodness me, the bits that we forget. I often pick it up and I feel like I've never read it before. On that note, fill me in. How was it for you? Because you and Jordan and was James all there the other week doing Genesis? Tell me about it. What was it like?"}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":3205.36,"end":3365.58,"speaker":"Jonathan Pageau","text":"We did the gospel. Yeah, we did the gospel, Yeah. I mean, it was daunting, you know, because the gospels also, because it's like the gospels, like all the gospels, it's so large, it was quite daunting. And I was. I was worried about it. But in the end, I felt like we had just the right type of people there and we were able to, you know, respect the text as much as possible and to kind of bring out. And because we went through the entire gospel, like, we. We tried to deal at least with the story, in terms of the story of Christ, tried to deal with all the elements of the story. I feel like the complexity of Christ came out, you know, and some of the difficult aspects of the gospel, too. We had Dennis Prager there, you know, Jewish guy, who pointed out some of the things that are difficult for them to see in the gospel. Did it very respectfully and everything. And so it was. It was great. I can't wait for people to see it. I think that some. I think that some Protestants will be annoyed with it because we don't preach the gospel, like, not once in the sense that they would hope. Like, we don't present the way to be saved in the entire, you know, whatever, ten hours of discussion. We basically just look at the character that's appearing on the text. And like, for John Vervaeke, who even grew up in a Christian home and went away from Christianity, we went through the text and he felt like he had never encountered Jesus before. He said, I'm encountering a Jesus that I never noticed. He thanked all of us. He said, thank you for bringing me along on this journey. Because all of a sudden he's seeing Jesus in a fresh light. And I think that that's maybe if we did anything good, that's the best thing that we did. And I think it's the same with you, with what you're doing in terms of, you know, I, I've been asking you ever since you became a Christian. I've been like, I've been always asking the same question, like, are you reading the Bible? Are you reading the Bible stories? Because I have this. I have a dream of one day sitting there, you know, and listening to you tell me a Bible story. And I, you know, I know it'll make me see it in a way that I haven't seen it yet. And so I find that extremely exciting. And I think that's why I'm excited also about, you know, this Christian wonder tales class that you're gonna give for us because I think you have a unique capacity to make things shine in a light that they're not used to seeing things like, make normal things seem very, very odd in a way that forces people to pay attention again, you know?"}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":3366.62,"end":3516.48,"speaker":"Martin Shaw","text":"Yes. Do you remember, do you remember the image when there's the conversation amongst the disciples about should they pay? And Jesus sends his. I think he sends Peter out to, to collect a fish and there's the coins in the mouth of the fish. And I was, I always think about the fact that Peter, as a fisherman, has caught thousands of fish by that point, but he's never caught a fish with coins in its mouth before. And that's what I'm trying to get to with these stories is like, this is going to be the time you hear, you hear the story and there's the coins in the mouth. Beautiful. Very much part of that fairy tale way of viewing the world. You know, a lot of what we hear about at the moment with contemporaries of ours is the idea of re. Enchanting Christianity. Now for me, enchantment is a nuanced word. You know, it's really nuanced. And I'm not always mad about it. I, I see Christ usually as a waker upper rather than an enchanter. But I do believe that it would be a wonderful thing to sit in the presence of these stories again and trust them as stories. Let them do the work for you. Let them do the work. And that maybe your imagination on Occasion can gleam and there is a little bit of Holy Spirit in it and something unexpected can happen. I've just started a course, actually, that you were kind enough to be part of the other night. The Skin Boat and the Star. In England we've got. There's 70 of us, there's 70 of us slowly making our way from creation tales, Genesis and other stories into the big epics like Tristan and Isolde and Parsifal, all the way. Finally, what we do on the very final weekend is we take stories from the students own lives, especially not their own, but maybe their aunts, uncles or grandparents, and we say, give us a 10 minute story from your family, relatively unadorned, that has these mythic threads that we've banged into over the year. So we start big, we start with the macro and we end with the micro. And I would like, God willing, the Christian wonder tales experience is interesting for all of us. If it is, there's all sorts of things that we could develop with Symbolic World. It'd be great."}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":3517.28,"end":3529.32,"speaker":"Jonathan Pageau","text":"Yeah, it's great. I think that, I mean, we definitely. I really enjoyed, you know, collaborating with you and I feel like we're on the same team, you know, it's weird to be on a team now all."}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":3529.32,"end":3610.49,"speaker":"Martin Shaw","text":"Of a sudden, isn't it odd how we've, you know, water finds its level. There's. I always have the images, you and I. It's a, it's a very fond memory for me as the two of us drinking Guinness and smoking cigars in Dublin about 18 months ago. We're just getting to know each other and you were talking to me about, you know, becoming an iconographer and that you suddenly had the luxury of time on your hands and you could listen, you could listen to the great stories and the drama and gradually, bit by bit, providentially, those things gather around you, which is what all the myths always point to. One essential thing in our lives, we are going to experience trial and tribulation, but in other words, the underworld. But can we come from it with a gift for others? And at its best, what we're all trying to do is to turn the complexity of our own life into decent compost that something beautiful can grow from. I really believe that. And so it's exciting for me that you're right, we do have a team. There are all sorts of folks that we could mention that are emerging from the forest, from the tree line in the strangest of ways. Always something to contribute. Great. Yeah."}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":3610.49,"end":3680.26,"speaker":"Jonathan Pageau","text":"And so, I mean, I look forward to this class, everybody, you know, we'll put a link, obviously in the description if you want to join. It's going to be an amazing time. I can't wait to see how it comes together. I will definitely be taking the class myself. And Martin, I always look forward to seeing you again and to learning from you. I've been paying attention to Martin quite a bit. I mean, he kind of knows that. Just trying to see how he's. Because I explain the stories, right? I try. I'm an okay storyteller. But, you know, when he came to the Symbolic World, those who have watched the videos that were there at the Symbolic World Summit, it's universally accepted that Martin stole the show from everybody, including Jordan Peterson, that it's like it was all about Martin because he just. The way he told the stories was so captivating. And so I encourage all of us to learn from him and the people watching. Yeah, you can learn from Martin. You know, we can all become storytellers to. To some level at least, you know, and then. And then provide that, those little coins to the people around us. So thanks for what you're doing. Thank."}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":3680.26,"end":3737.76,"speaker":"Martin Shaw","text":"Well, thank you, Jonathan. It's very generous. And I will take that to the bank. I appreciate it. I just wanted to finish really, with. With echoing what you've said is that it's very rare in human history that storytellers have earned any kind of money from it. So I just recommend everybody listening to this not to get caught up with, oh, so he's saying I have to become a professional storyteller. The traditional place for stories is around the hearth. It's with your family, it's with your community, it's with your church, it's with your friends in the tavern. It's when you're working in the fields. Don't be seduced by microphones, don't be seduced by having to create a website. Don't think like that, because in a strange way, you offend the stories if you try and monetize them too quickly. Let them talk to you, let them have their way with you. So, yeah, thank you for having me on. I love being part of this. And onwards."}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":3738.32,"end":3739.92,"speaker":"Jonathan Pageau","text":"All right, we'll see you soon. Thanks."}
{"episode_id":"SW - #362 - 2024-11-01 - Dr. Martin Shaw - Christian Wonder Tales","start":3740.56,"end":3780.48,"speaker":"Martin Shaw","text":"Hello there. This is Martin Shaw inviting you to come and join me for Christian Wonder Tales, my first online course with Symbolic World. It is a secret history of things that we're going to be exploring from the early Celtic saints and heroes of antiquity all the way up to the chivalric tradition of Arthur, Round table, Merlin, the whole thing. What do stories like that have to tell us about the mosh pit of our own modern lives? Well, over four gatherings, we're going to find out. I promise you this, it will not be boring."}
