{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":0.64,"end":2.28,"speaker":"Jonathan Pageau","text":"On this episode of the Symbolic World."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":2.28,"end":5.12,"speaker":"Jonathan Pageau","text":"Podcast, I'm playing for you a talk."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":5.12,"end":80.5,"speaker":"Jonathan Pageau","text":"I gave at St. John's Catholic Church in Montesano near Seattle, Washington, in which I discuss feminine symbolism in Christian art. Looking mostly at images of the Mother of God, of Mary, the development of her typology, the different types of images that are used to represent her and her relationship to Christ, and especially showing how those iconic relationships manifest symbolism of the feminine in general and its relationship to masculine symbolism. As you know, these audio representations are taken mostly from my YouTube channel. And so if you want to get a visual representation of these images, I would encourage you to check out the videos on that channel. As you know, this podcast, the videos, all the things that I'm doing are due to your generous contributions, to your generous help. And so please go ahead and check out the symbolicworld.com for ways that you can support this podcast. And so enjoy. This is Jonathan Peugeot. Welcome to the Symbolic World."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":90.56,"end":658.39,"speaker":"Jonathan Pageau","text":"I'm also very happy to be with you on this feast today. And I thought it would be a good idea because it's, it's the Feast of the Assumption in the Orthodox Church, we call it the Feast of the Dormition of the Mother of God. And so we'll, we'll go through that as I'm talking, but because it's such a. It's such an important feast, and because also I think that especially in North America, you know, with so much Protestant tradition in North America, the, the place of Our lady, the place of the Mother of God, of Mary in our tradition is sometimes difficult for people to understand. And so hopefully what I'll be doing with you is going through the visual imagery of how her image began to take form in the Christian tradition. And by doing that, hopefully it will also help us to understand her role in the church and her role in the universal story. To begin right away, when the church started to take form, you know, when the persecutions started to subside and people had a bit of more time to. More time and more space to write and to think and to look at the Christian story, right away, people started to identify Mary with, typologically, with all the places in the Old Testament that when God manifested himself, the space in which God manifested himself. So we heard it today for those who were there at the service, we heard Mary being called the temple, the Temple of God. And so the notion that she's the temple because in her womb she received divinity in her womb becomes, let's say, the basic pattern around which all of her imagery and Then all of the things we say about her, all of the ways we interact with her are going to take form. And so she's. She's said to be the Ark. Just like the Ark of the Covenant had the glory of God, which descended on the Ark with the two angels on the side of the Ark. And so you have this invisible glory which comes and sets itself on the Ark. So too, the Mother of God is seen as this ark. And so the first image that we find of the Mother of God is an image that will come to be known as the seat of Wisdom, or the Throne of Wisdom. Here this is probably most possibly the first image. It's not the first image that we know of Mary. And so it's very beat up because it's in the catacombs. And it has a very kind of fluid. The fluid style that we find in the catacombs. And there is some dispute on whether or not it's the image of Mary. But I think it's pretty obvious because if you look at the image, you can see there's the Mother of God, she's holding the child, and there's someone next to her. Can you see the person and can you see what they're doing? He's pointing to something. He's pointing to the star which is above her. And so this is. It comes from, like an Old Testament prophecy about the star. To the star. The star. The star that you know as the star of Bethlehem. So here are. Here's Mary, who's under the star. So I think that's a pretty convincing, convincing argument as to think that that's an image of Mary, one of the first images of Mary. But very quickly we get this representation of Mary where she is sitting straight on, and then on her lap is the infant Christ. And this really refers, like I said, this notion of the Throne of Wisdom. And it's. We also, when we think of throne, we have to think of seat, right? Remember that the Ark of the Covenant, on the Ark of the Covenant, there was what's called the mercy seat, right? And on this mercy seat came to. To set on the mercy seat the, the divine glory. And so that is the role that she now takes because she has received in her womb the Christ. And so Christ sitting on her lap becomes the. Becomes typologically linked to the glory of God, which descends and sets itself on the Ark. So she is also represented at the Ark. You can see that there's also a reason why we have these two angels which are next to her. So these two Angels which are on our side, which also hint to this idea of the Ark of the Covenant with the two cherubs that flank the Seat of mercy. So here, again, this ivory here is from the 5th century. So it's quite. It's very early in the Christian tradition. This is an encaustic icon from the 6th century. And here we really get that exactly that same image. We have the Mother of God in the center, very, very central, very, you know, like a seat. And on her is the Christ Child. And above her as well, we see again, we see again, the two angels that are. That are flanking the seat, just like the Ark of the Covenant. One of the things also to notice in these images is how the manner in which Christ sits on her, he becomes like her center. So she becomes like a covering. And then in the middle, you have Christ, which is sitting and becomes her center. So in those images, when you look at them, you'll notice that the head of Christ is always on her heart. It's always on her center. So you have this concentric image of Christ in the middle, you know, the divine glory. And then around him, this ark, this seat, which surrounds the glory of God. Here's a bit later. This is from the 10th century. Again, the same structure. You see Mother of God, you see Christ on her lap, and you see the two angels up above. Okay, this is always referring to. To this image of the Ark of the Covenant. And the image, this image of the Throne of Wisdom became the central image of the entire medieval period up to the Gothic era. This would have been the image that most people would have seen of the Mother of God, would have seen either in an icon or in a carved image or in a statue. You know, here's a very old statue of that exact image, same type, you know. And so you can probably think of some of these images that are known. Even some of the. Some of the Black Madonnas have that form where it's, you know, it's the Mother of God, and the Christ child is on her. On her lap, and his head is usually in her center. The important thing to understand in terms of typology is, is that when we see the Christ child, when we see the baby Jesus, of course, there is this. There is this whole relationship of the mother to her child. There is this affection, There is all of this, but there is also something else going on. There is something about the notion of showing Christ as a child surrounded by his mother that points to the secret, that points to the hiddenness of Christ. Just like Christ is hidden in those we encounter. Just like Christ is hidden in us, so too this notion of Christ who is. Who is on her lap, but ultimately who is in her womb is this notion of this hidden thing, this hidden image of Christ which is in us. Of course, for her, it was. It was much more than, you know, it was a. It takes. How can I say this? For her, it took on a cosmic aspect, but still it becomes the image of this encounter that we can have as well, that we can all have this possibility of encountering Christ hidden in the people that we meet. Which is why we talk about. In iconography, we talk about this image of the Christ child. As we say it's the Christ Emmanuel. So when we talk about the Christ child, we say it's Christ Emmanuel. And Christ Emmanuel is exactly that. It is Christ in us, Christ among us. It is Christ who is with us. So this image will culminate, you know, into an image which is something like this. This is a Russian image. But it can help you kind of see the. What it. What this is about. And so in her, this is almost seeing Christ hidden in the womb of Mary. I mean, it's not totally that, but you have this circle, and then inside this circle, you have the. The Christ child. And then she is around him like this covering, you know. And so we also have to. And here, here again, you can see now this is a lot later now. This is."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":658.39,"end":658.95,"speaker":"Jonathan Pageau","text":"This is like."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":658.95,"end":954.99,"speaker":"Jonathan Pageau","text":"I think it's like 12th century. And so once again, you can see the two angels are there. So this, you know, from the 6th century, from the 5th century, this image continues to exist and continues also to take into account that typology connecting the Old Testament with the New Testament, always saying, you know, those things that those people saw in the Old Testament. Well, we have seen the fullness of it in human form now that Christ has. Has been incarnated. And so. And so another way to also understand it is to understand it as the embodiment of Christ that is, the mother of God. Not only is the ark for us, but she also becomes an image of the church itself, right? She becomes an image of that body into which Christ comes in and finds his flesh. And so she is the source of the flesh of the Christ child. She is that out of which Christ took his body. And so she becomes an image of the church itself. And so I say that you might think, like, okay, you're stretching it. You're stretching it. As we keep going, you're going to see how obvious it becomes, you know, at the beginning, it might look a bit like, I'm trying to over interpret this, but you'll see as we go. And so this image is really, was really the central image of the Mother of God for, you know, maybe about 600, 700 years. And then certain images started to develop out of that image. But if we understand this notion of this gathering in that she is the body that gathers in and in her center appears this divine, this divine presence and becomes and is incarnate, but then also becomes the image by which we also can find Christ in those around us, then we also understand that that's also what's happening in the icon of the Nativity. So the icon of the image of the Nativity, which is the birth of Christ, we see that traditionally this has been lost to a lot of people today, but traditionally, from the year 70, you know, Justin Martyr mentioned that Christ was born in a cave. And so this notion that Christ was born in a cave now helps us to see, was going to start to help us to see another aspect of this body, right? This embodiment of Christ, the church, as being the creation itself, right? As being creation itself which accepts, which takes in the divine and is able to manifest it. And so Christ enters into the ground, enters into the earth, enters into, into this, this, you know, that this cave. And once again you have this secret beginning of Christ's life. Think of it as a seed, right? A seed that comes down and is planted in the ground and then is going to finally appear in his full glory. But at that moment, you know, there was still this secret aspect to it, you know. All right, I'm going to also feel free to ask questions seriously, because I'm trying to kind of talk to a lot of different people with a lot of different backgrounds. And so if I say something that just kind of makes you think, what did he just say? You know, feel free to raise your hand and ask me to specify that it's not a problem. And so as this image as the Mother of God becomes this image of the container of the Church, of that by which Christ is able to come into the world, then just like the church, our role is saying, what's the role of the church, right? The role of the church in a great part is to point, right? To say, say, to glorify, to pray, to say, here, here it is. This is what we're turned towards, right? We are all turned towards Christ, and here he is. And so we point, point towards Christ. That's one of the functions of the church, is to all point towards Christ. And so one of the most important images of Mary is this image. This is called the hodgatria. The hodgatria is, at least traditionally, it is the oldest, not this particular painting, but the type. This type of traditionally, it is the oldest icon. This is really like in. In the tradition of the church, in the."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":954.99,"end":955.39,"speaker":"Jonathan Pageau","text":"In the."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":955.39,"end":1001.24,"speaker":"Jonathan Pageau","text":"Like. How can I say this? In the history of the. In the historical analysis, it's hard to know, because this is really a traditional story. But according to tradition, the hodgatriya, the first image of this type, was painted by St. Luke. And what it is, it is the mother who is showing the way. And another name for this image is the lady of the Way, or She who shows the Way. And so you can see that once again, we're still hinting at the notion that the Mother of God is this throne. It is the one who holds this infant in her arms. But now we also have her showing us, saying, this is where you need to look."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":1001.73,"end":1001.97,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":1001.97,"end":1049.98,"speaker":"Jonathan Pageau","text":"I am here to point towards the ultimate mystery, which is Christ. Okay? And so that also becomes an image of what we're. We're supposed to do as the church itself. We're supposed to point towards Christ. And so the hodgatria becomes the first. You'll see all these types of images of the mother with the child, this kind of sitting with a child in her hand on her side. And this is the origin of all those images. Even now, we have these very kind of cute images of the baby on the mother's breast or falling asleep, all these types of images. But the source of that tradition all comes from this icon, which is she who shows the way. Jonathan?"}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":1049.98,"end":1053.65,"speaker":"Audience Member","text":"Yeah, she intended to look sad here. Is this just the way the modern eye sees this place?"}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":1055.08,"end":1320.95,"speaker":"Jonathan Pageau","text":"Well, I mean, I think definitely it's partly the way that the. Modernizes the style. But there is, in iconography, let's say modern interpreters, they talk about this joyful sadness, and so this notion that there is a sober sadness in iconography, but also a joy which is hidden in that. But it's not this kind of exuberance or whatever, but there is a kind of sober sadness also, because we also have to always remember that she lived with the knowledge of her son's death. She lived with that pain. And so we can show that in the image, even though obviously it's not that. She was probably always thinking about that. But when we make an icon, we're kind of pulling all these things together to create a meaningful image so we can show that in here. And often in the older versions of the Horugetriya of the one she who shows the way, you'll notice that her head is slightly tilted. Her head is tilted down towards Christ, and she's actually. She's bowing to Christ. She's actually, you know, she's holding her child, but she's also bowing to her child. And so we'll see how that type of structure of she who shows the way moves into another type of image, which is called the deicis. I'll show that to you now. So the deicis is really also one of the basic. One of the basic images of Christian art. And what it usually is, it's Christ now, not as a child now, not as this infant, but Christ in glory. It's the Christ who returns at the end of time. And so he is standing in the center and to his right most of the time. To his right is Mary. And then to his left can be. And then two to his left will be often St. John the Baptist, or it can also be St. John the Evangelist as well. And so this image, now we still have the two angels there above. Can you see them up there? This is really. It's an important thing because it. It signifies this presence, this. This presence of God. And so this image, you'll see it becomes a very, very central image in iconography. This is a much later. Yeah, it's a Greek icon. It's a much later Greek icon. But you see it has this same pattern. Christ is sitting on his throne, but now it's really the throne of judgment, this throne of the end of times. And standing next to him are the Mother of God and St. John. Who are. What are they doing? Look at their hands, right? They're doing two things, actually. On the one hand, they're pointing. They're showing. They're saying, this is. This is him, right? This is. We're all turned towards this image. We're all turned towards Christ. And at the same time, they're also praying. They're bowing. They're bowing before their Lord, and they're also praying. And. And they become the image of all of us who are praying. They are praying for us, right? They're praying for all of us. And then they also become the image of how we're all praying for each other. We're all praying for each other. We're all there looking towards Christ, looking through the Mother of God, through St. John, looking towards Christ and all praying for each other and moving towards that ultimate glorious image. And so this Image of. I wanted to show you just one image of the mother and child. Then as time continues, then the image of the mother and child becomes more relational. If you look at that, the first image, it's really more about. It's really more about her presenting her child to us."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":1321.58,"end":1321.98,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":1322.46,"end":1401.95,"speaker":"Jonathan Pageau","text":"Whereas the image, the Virgin of Vladimir and then a lot of other images that you've all seen of Mary holding her child is. It becomes a little bit more about this relationship between the son and her child. But in this image in particular, it's very important to notice that she is looking at us and she still has her hand up. She's still showing the way. She's still showing us her child. And now the child is showing his affection towards his mother. Right. And we have to. We have to be able to always understand that in terms of our. Of our life, in terms of what it means for us, in terms of how this idea of what, let's say, she is there to bring us in to him, and he is showing his affection for her, for his church, for his. For his mother, for that which manifests him. He is showing that relationship of love to his body, really. All right, does everybody kind of follow that? Does that make sense? I hope it does. Well, I'm not losing people completely."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":1404.28,"end":1404.52,"speaker":"Jonathan Pageau","text":"Now."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":1405.32,"end":1533.51,"speaker":"Jonathan Pageau","text":"I've shown you mostly this image of this notion of the center. And so you have this notion of Christ as the center, the seed, right. This pearl that's hidden in the field. And then the Mother of God becomes the field itself. You know, there are all these images, for example, of the rising sun. So the Christ is the rising sun, and the dawn is the mother of God. You'll find all these types of images of something which comes as this light or this dot or this precious thing, this treasure or whatever and whatever contains it becomes an image of the Holy Mother. So that's really this notion of the center of Christ who is hiding in the heart, who's this invisible spark, you know, this invisible image that is in all of us, but that we can. That we can come to see, that we can come to encounter if we see things in the right way. But then there's another way of seeing it which is really now going back, going back, back, back to the very first images of Genesis, which is this first. First relationship between heaven and earth, between the. The spiritual and we could say the material. And now we'll see a whole bunch of images which will then re. Present this idea of heaven and earth and show them to us in the image of the church. And the Christian story. So this is a 6th century image. This is a very early image. We don't have a lot of. For those who don't know, there's a whole bunch of images that we don't have for several centuries because there was a fight in the church on images. And so a lot of images were destroyed. And so when we say you have a 6th century image that's in a book, it's quite astounding. And so this is a. Can anybody guess what this is an image of?"}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":1534.71,"end":1535.59,"speaker":"Audience Member","text":"Ascension."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":1537.11,"end":1560.85,"speaker":"Jonathan Pageau","text":"Yeah, it's the Ascension. Okay, so it's an image of the Ascension of Christ. Okay, so what? I've already told you a little bit about certain structures. Are there something you can notice in this image? If you look down, you'll see the Mother of God, what will necessarily be next to her? Right? Two angels."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":1560.85,"end":1561.37,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":1561.45,"end":1641.45,"speaker":"Jonathan Pageau","text":"And the angels are there in the text, but the Mother of God is actually not in the text. She's not in. She's not mentioned as being there at the Ascension. But the importance of showing her at the Ascension becomes this relationship now between heaven and earth. And so you have this line which cuts across the icon. Then you have the heavenly world and now you have the earthly world. And Mary becomes this central point, becomes the ark again, becomes the throne on the earth. Representing the earth around her is the Church. And it's really the Church. That's super important to understand. It's not just a representation of what happened. And how do we know it's not just a representation of what happened? Look at the image. Some of you might be able to tell me why we know. Well, first off, Mary isn't mentioned in the text. It's possible she was there, but there is someone in that image which there's no way was there. And that's St. Paul. So St. Paul is traditionally represented at the Ascension."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":1641.61,"end":1642.01,"speaker":"Jonathan Pageau","text":"Why?"}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":1642.25,"end":1707.66,"speaker":"Jonathan Pageau","text":"Because it's not just an image of a moment of something that happened it in history. It's an image of a. It's a pattern which represents the very structure of the Church, ultimately, I would say the very structure of reality itself. Not even just the Church. This is how the world works. This image shows you how the world works. Okay. And so you have, you have the head of the church, right? Christ is the head of the church. Christ has ascended into heaven and he is up there in the heavens. And then below is the body. And so the Mother of God becomes the central focus, becomes the ultimate image of the body. She is the one who gave body to the Logos. And so she becomes the ultimate image of the body, the throne. And next to her, of course, those angels that help you to remember the ark of the covenant. And then finally, the church itself, which surrounds this whole event, which. Which flows out of this event."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":1707.82,"end":1708.38,"speaker":"Jonathan Pageau","text":"Okay?"}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":1709.02,"end":1722.22,"speaker":"Jonathan Pageau","text":"And so St. Peter is on. St. Peter is here. And see him. He's got the keys. Can you see? Right? And then St. Paul is here. And then all the. The other apostles."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":1725.83,"end":1726.35,"speaker":"Jonathan Pageau","text":"Here's a."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":1726.35,"end":1957.11,"speaker":"Jonathan Pageau","text":"Here's a more modern. A more modern version. I'm showing you this just so you can see. This is. This is definitely based on a type. It's not. Even though it's modern, it looks like something which could have been painted a thousand years ago, I assure you. And so here we really get this relationship. Okay, Christ ascending into heaven. He's sitting on a rainbow, okay, he's sitting on a dome, right? This rainbow, which is both an image of heaven itself as this dome, but also an image of a bridge between heaven and earth. He is above everything. And the Mother of God there in the center. And look at what she's standing on. Can you see that? And that is a footstool. So she's standing on a footstool. Why is she standing on a footstool? Because in the psalms it says that God. His throne is in heaven and his footstool is the earth. So his throne is heaven and his footstool is the earth. And so the Mother of God becomes not just an image even of the Church itself, but of all of creation, of how all of creation has the possibility in it can possibly manifest God, you know, not that it always does, but that. That it is possible. And that's what. That's, let's say, the mystery of the Church is that creation itself, that. That the things we make, that this building, that these people gathering, you know, that this water, that this wine, that this bread, that this oil, all of these can become, you know, can become vehicles in which we can encounter, in which we can come into contact with the divine. And so this is a. This is a. This is the dome at St. Mark's in Venice. And it's an image of the Ascension. Okay? So once again, you can probably now start to recognize what's going on in there. In the center of the dome is the ascending Christ. Below him, there she is. There's the Mother of God with the two angels. Can you see who's standing next to the angels? So who are these guys, right? St. Peter and St. Paul, right? And then the other apostles are around him. Now, what's Important to understand is that the image of Christ in the dome, which became more prominent in the East, I have to admit. But this image of Christ in the dome becomes an image of Christ that is returning. Right? It's the returning Christ. And here we see that it's also the Christ that is ascended. If you look at this, that image up there of Christ, that's how we represent Christ, Christ at the Last judgment. That's how we represent Christ who is, who is returning. But it's also how we represent Christ as he's ascending now. And I mean, there's a reason, a technical reason for that, because when the angels, the angels spoke to the disciples, they told them that just as he ascended, so too he will return. But what's important to understand is mostly this relationship, that if you freeze this image, it becomes an image of the church itself. It becomes an image of the manner in which we gather together into the church in order to look up towards the reigning Christ. Did you have a question?"}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":1957.11,"end":1967.91,"speaker":"Audience Member","text":"I also see it as a representation of the Mass or see that east, the liturgy itself represent where heaven meets her."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":1967.91,"end":2313.72,"speaker":"Jonathan Pageau","text":"Yeah, and we'll see that. We'll see that when we get to the image of the, the death, the dormition of the Mother of God, we see the disciples sensing incensing around her, and everything really is the sense of, of the liturgy. I think it's going to get too dark, huh? It's, it's still good. Still good. Okay, let me repeat the question. Oh, yeah, recap the question. Okay. Okay, so then in order to help you kind of see what I'm talking about in terms of this relationship, now I'm talking mostly about the Eastern church, because that's what I, I know, but in the Eastern Church, what ended up happening is that in the, in the apse. Okay, so you all know what the apps is. The apse is the easternmost part of the church where the altar is. So traditionally, the apse would have been a semicircular dome, like a half dome. And you can see it if you look at old cathedrals, if you look at old churches, you will see that at the end, eastern end of the church is this half dome. And now in the half dome, we represent the Mother of God with the Christ child. Okay, show you several, several examples of that. Okay. Now in the dome, right, the full dome, which is above the church, in the center of the church, which is the heaven itself, a representation of heaven itself. Then we represent Christ in the form of what we saw as the ascending Christ, but also the returning Christ. Christ as the head of the church, Christ as the King of kings, this highest representation of the human and the divine in heaven. And then at the lower level. At the level, let's say you have. Imagine you have a dome like that. And then underneath there, then you have a lower tier in which the church would be and the apse will be at that level. And so you have the same relationship in the church, the same relationship as in the Ascension. The architecture of the church itself represents the same thing. You have Christ up in the dome, and then now at the lower tier, where we are, you have the Mother of God as the ultimate aspect. But also because in the east, there's also this whole idea that here is the dawn, like, here is the horizon. And out of the horizon comes the rising sun. And so the mother God is that horizon. And the child, the Christ child comes out. So you can see the Christ child here, kind of hidden in the church. And then finally you also have this manifestation of the totality of the. Of the ascending and returning Christ up in the dome. All right, okay. So another form, another form of the deitiesis, which is related also to what we're talking about is the crucifixion. Right? The crucifixion is also related. I mean, there. There are other aspects to the images, I'm telling you, but I'm trying to help you thread a line through them so that you can see how these can be related. And the crucifixion also is related to this notion of the Mother of God as being this image of the mother of all of us as the mother of the Church. Because the most simple versions of the Crucifixion, unless it's just Christ alone on the cross, but usually the next tier is this image. So it's Christ and then the Mother of God on his right, and then St. John on his left. So why are we representing that scene? Does anybody remember what Christ says when this is happening? Exactly. So he's saying this. This is your son. And now he's. He's telling to John, his beloved disciple, this is your mother. Of course, it's not just there to show us some little tidbit of story that happened. We emphasize that because it's meaningful to all of us, because it becomes another pattern of the Church itself, another pattern by which she is our mother. She is as we are in Christ. She becomes an image of our mother, all of us. And then we, if we are the beloved disciples, obviously that helps. I just wanted to show a few images this is a God. This is a Gothic version. But I mean, this image we've seen, you know, you can see it today if you go to a graveyard, you'll be able to see often you'll be able to see that image. It's such a prominent image in Christianity. It's continued today in all the traditions. And so finally we come now to today, the oldest images of our feast today is an image that's called the Dormition, or the falling asleep of the Mother of God. And so you can see again, it's the same structure."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":2314.2,"end":2314.88,"speaker":"Jonathan Pageau","text":"Can you see that?"}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":2314.88,"end":2374.09,"speaker":"Jonathan Pageau","text":"It's the same structure. You see that Christ is there above. Okay, now the Mother of God is laying down, and who's next to her? Who's that? Can you know St. Paul? That's St. Peter, right? And then the other disciples are usually less. Less recognizable, but it's the same. And usually here, you'll show here St. Peter is holding a censor, right? And he's sensing the body and Christ in his hands, a baby. So who's the baby? Mary. It's Mary. Okay, now this is the flip, right? This is the."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":2374.09,"end":2374.69,"speaker":"Audience Member","text":"This is the."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":2374.69,"end":2425.57,"speaker":"Jonathan Pageau","text":"The flip. This is the. You know, we talk about the resurrection, but we don't know what we're talking about, right? And so there are ways that the Church tries to show us the resurrection because we don't know what that is. I don't know what the resurrection is. There are hints, there are images that the Church uses in different ways. And so this image is a manner, is a way to help us see this strange change that happens, just as the Mother of God was shown to contain inside her, to have this child in her womb, holding this child and. And being like the throne for her child. Now the tables turn and Christ is holding the soul of this infant Mary in his arms."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":2427.25,"end":2431.09,"speaker":"Audience Member","text":"Well, is that because we are told that we have to be like."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":2432.93,"end":2433.25,"speaker":"Jonathan Pageau","text":"To."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":2433.25,"end":2435.81,"speaker":"Audience Member","text":"Go to Jesus, like the child God?"}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":2436.05,"end":2490.29,"speaker":"Jonathan Pageau","text":"I mean, it's probably part of it. It's probably part of it, but I think it's there definitely also to relate to the other image. And I'll explain to you why. Because in like, for example, in an Orthodox church, that image in the apse, right, I told you the image in the apse would be Mary holding the Christ child in his hands. And the image of the Dormition, this image of the death of the Mother of God, will be on the western wall. So if you stood in the middle of the church and you looked east, you would see the Mother of God holding Christ in her Arms. And if you looked west, you would see Christ holding the Mother of God in his arms. And so there's this kind of flip that happens where, you know, it turns out that ultimately we will. We are in Christ like we. Ultimately we are in Christ."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":2490.77,"end":2495.66,"speaker":"Audience Member","text":"But it's an expression in the Christian heart, hope that death for us is a birth into eternity."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":2495.82,"end":2680.1,"speaker":"Jonathan Pageau","text":"Yeah, of course, yeah. That's another way to see it. But notice now here also you can see the two angels, right? The two angels are always have to be there. But in, in, in the, in the Western tradition, then there developed this other way of representing this mystery, right? Of representing the mystery. And it came to be known as the, as the Assumption. So here, here, here are the first images of the Assumption. In the very first images of the Assumption, they would always show the Dormition at the bottom, right? So you have this image of, of the, of the Dormition here, the Mother of God falling asleep. And then they would show the Assumption above it, okay? And so it was this. And see here, here he's holding, still holding that, that, that image of the Mother of God in his arms. But now there's also this notion of ascending. And I think, I think that that's really. I think it's just really two ways of showing this mystery, of showing this mystery of how, how we are. How she came to be united with God and how she is the promise, right? The hope of all of us, right? That's what Mary is. She's the hope that we can, to the extent that it's possible, bear Christ in us and then also be united to Christ ultimately in totality. And then finally the image, one of the images that kind of finish off the whole cycle is the final image of the crowning of Mary. And so now this woman who held the secret Logos, the secret Emmanuel in her womb, in her arms, now she has ascended and becomes the queen. She becomes the, the co. Regent with Christ. And that's really, I mean, it's really, it's really a call for what, for what the Church is meant to be in the world. The Church and the Christians themselves, like, that's what we're. We are, we are called to be. That's why we have, even now we have patron saints. Why do we have patron saints? Because we are called to co. Rule with Christ. Those who rule, who are able to attain to a certain level of holiness, then become patrons. They become co. Rulers with Christ. And the first image of that, the ultimate image of that is of course, Mary herself, because she's the one who had him inside her, and she becomes the Church itself, like the image of the Church itself. So when we see an image of the crowning of Mary, it's an image of the crowning of the Resurrection itself."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":2680.1,"end":2680.34,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":2680.34,"end":2760.67,"speaker":"Jonathan Pageau","text":"It's an image of the crowning of the Church itself, but it's. How can I say this? We can only see it eschatologically. We can only see it dimly, let's say, until the final things are revealed. But all these images are there to help us understand what it is we're part of. An image of creation perfected. So new Adam, new Eve. I think so. Yeah. I think so. And I think it goes further than that. I mean, it's hard to talk about these things because, you know. Because it's hard to talk about this thing because people get freaked out of the imagery. But this is really an image of Mary as the bride. Right. She's no longer his mother, but she's become becoming his bride. You don't have to think about it in terms of moral sense, but just as we are also called to be. The church itself is called to be the bride of Christ. There are plenty of references in the Middle Ages of the mother God as being the bride, as being the beloved in the Song of Songs. All these things don't have to be scandalized by that type of imagery because it's there to help us understand what is our ultimate calling is to. Is to be that bride and to be joined perfectly with the. With the Logos."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":2760.83,"end":2761.39,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":2762.03,"end":2783.69,"speaker":"Audience Member","text":"After the Ascension, Christ is no longer God incarnate. Per second. He's in heaven now. Is that the assumption of Mary then could also represent the material joining heaven versus the meaning joining earth? That Christ represented how the material is now joining heaven."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":2783.69,"end":2835.58,"speaker":"Jonathan Pageau","text":"Yes, but you have to understand that those two things ultimately are the same. Right. They're the same. That the Incarnation, that everything, everything was accomplished at the cross. Like, I gotta say that, like, everything was accomplished at the cross. The incarnation. In the Incarnation, we find the totality of the whole cosmic story, you know, even though there's this eschatological notion, but that in the incarnation, that's already implied. It's all implied. The fact that we are called to as the body, let's say, move into God and be taken into God. Saint Irenaeus said that Christ, that God became. I think now, St. Thathanagius, who phrased it that way, but he said that God became man so that man could become God."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":2835.66,"end":2835.98,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":2835.98,"end":2856.06,"speaker":"Jonathan Pageau","text":"And those two things happen at the same time. It's not like, one happens and then the other. That's the joining of heaven and earth. So does anybody. I think we. We've gone to the end. Like, this is the end of the world. So if you have questions after the end of the world, you are very."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":2856.86,"end":2857.26,"speaker":"Jonathan Pageau","text":"Very."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":2859.34,"end":2860.38,"speaker":"Jonathan Pageau","text":"Free to ask them."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":2860.55,"end":2861.03,"speaker":"Jonathan Pageau","text":"Yeah, go ahead."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":2861.35,"end":2911.06,"speaker":"Audience Member","text":"A line of questioning. Maybe you could rip on, because I don't know if it has a single answer, but it seems that the Mother of God is distinguished as not. She's not God, but she seems to be, like, the closest that which is not God can be to God. And then her whole story seems to be the bringing or the relationship of what is not God. Like you said, there's the sun and then there's that which the sun happens in, which is the dawn. The dawn is of the sun, but without the dawn, there would be no relationship to the sun. So that container, that which God touches is still not God, but then there's this transformation of that which is not God into a pure relationship."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":2912.35,"end":2941.99,"speaker":"Jonathan Pageau","text":"Okay, can I repeat that question, you think? All right. So Benjamin is asking about how it seems to him that Mary is that which is not God, right? And so God comes down and joins himself to that which is not God. And in a way, she's the closest. She could be the closest to what is not God, to God. And so it shows us how is that. Am I getting what you're saying? Is that."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":2941.99,"end":2943.19,"speaker":"Audience Member","text":"Is that proper?"}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":2943.43,"end":3058.61,"speaker":"Jonathan Pageau","text":"Well, I'm Orthodox. And so in the Orthodox tradition, we do have what's called theosis. It's not pretend. Like there really is this idea that the ultimate purpose of creation is to be deified, right? Is to become God by participation. And so. And so that's, I think, you know, in the Eastern tradition, when we talk about the Dormition of Mary, we say that's her theosis, that is her becoming God to the extent that it's possible by participation. You don't become God by nature, but we can participate in God, you know, to the extent that we are completely transparent and full. And so the notion of the manner in which creation is participating in God, you have to understand it. You have to always understand it eschatologically. You always have to understand it as this totality. And so the idea that, say that Mary is not God, that's absolutely true, but she is called, like we're all called to become God to the extent that that's possible. I keep saying that because obviously we don't become uncreated. We're still created, but we can become completely, completely Transparent and luminous and full and become. And become principalities like we've talked about. That is that this idea of why do we have these patron saints is because they are ruling with Christ. Right? We are called to rule with Christ over the world. I think in the New Testament there is a reference to partakers to become."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":3058.69,"end":3061.01,"speaker":"Audience Member","text":"Partakers of the divine."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":3061.25,"end":3087.1,"speaker":"Jonathan Pageau","text":"Yeah, where is that? It's in Peter, I think. I think it's theater. The Western term for you say is not that of all his theosis. It's often produce sanctification. So sanctified, that's the same kind of process. It's just a different. Different trilogy around it. But the end result is the same of gradual divinization, right?"}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":3087.5,"end":3090.1,"speaker":"Audience Member","text":"Well, yeah, because we are all called to be saints."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":3090.1,"end":3091.18,"speaker":"Jonathan Pageau","text":"Yeah, right, exactly."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":3091.66,"end":3106.23,"speaker":"Audience Member","text":"Saints. I mean, we all do our best through prayer, through following our path that was given to us to become a saint, to end up in heaven with Jesus."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":3106.95,"end":3161.92,"speaker":"Jonathan Pageau","text":"And so I think you can see the whole story. You can see this whole story in the image of the ascension. You can see the whole story from the beginning, right? Right from the beginning. There is this idea that the purpose, the whole purpose, right, is to join heaven and earth, right? That's the purpose of creation. So God creates. Creates, you know, pulls the. The land out of the seas, you know, creates these animals, creates these things. But. But man, he pulls in all the dust into one place, you. And then he blows his spirit into man. So what is that? That's exactly heaven, wind, earth, whatever image you want to use. Spirit joining itself with the earth. Okay? So that's the purpose of creation."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":3161.92,"end":3162.52,"speaker":"Jonathan Pageau","text":"That's the purpose."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":3162.52,"end":3217.74,"speaker":"Jonathan Pageau","text":"That's why God created the world. And the incarnation becomes the fulfillment of that, and the church becomes the cosmic fulfillment of that, of that union. And so that's the purpose of the world, is to go from this, right? To go from this to. Whoops, sorry. To the end of the talk. To go from this to this. Oh, there you go. That's where. That's where we're headed. That's the purpose of creation. Are there any more questions? I will. Thank you so much. I know some of you maybe have never, never heard some of my talks. And so maybe I was taking you onto another planet. It's possible. I'm sorry if that's the case. And so I hope you appreciated. I hope you appreciated the talk. Thank you very much."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":3224.38,"end":3279.27,"speaker":"Jonathan Pageau","text":"Thank you for listening to the Symbolic World podcast. As you know, this podcast is for now based Most on my YouTube videos, which I am transferring into audio format Please go ahead and visit my YouTube channel. There are more videos there on different subjects that I'm not going to put into audio. And please share this to your friends. I know a lot of people know about the YouTube content, but not so many people know that this is also a podcast. So share it to your friends. Share it on social media. And if you can, feel free to support this financially as well by going to my Patreon page, which is Peugeot Videos. Strangely, you can go there and you can support it at any amount that you want. A month for all the patrons. I do a monthly Q and A, a live Q and A in which people can ask questions in the chat, and I try to have a more personal connection with with people. The YouTube comments have become difficult to follow and to answer."}
{"episode_id":"SW - #043 - 2019-07-17 - Feminine Symbolism in Christian Art","start":3279.43,"end":3280.31,"speaker":"Jonathan Pageau","text":"I'll see you soon."}
