{"episode_id":"SW - #182 - 2021-10-23 - The Key to How I Interpret Scripture","start":0.16,"end":1444.71,"speaker":"Jonathan Pageau","text":"Hello everybody. This is my first video since I got back from Europe and I had Covid and I've been in self isolation. I thought I would be making videos during my isolation, but it turns out my brain was so much in so much fog that it was just impossible to make videos. And so I'm happy to be making videos again. Hopefully my strength will hold up and I won't get too tired. So I wanted. For the past month or so, or I guess a few months, I've been making more videos on Scripture. I've been doing some interpretation of Christ's parables of the Sermon on the Mount and just trying to help people see the pattern, the symbolic pattern in Scripture. But what I wanted to do with you today is to look at a short text in Saint Ephrem the Syrian's Hymns on Paradise. Told you guys many times about this book. If you haven't read it and you're watching my videos, you really need to read Senefrem's Hymns on Paradise. I'm going to read three stanzas from the hymns and we're going to revisit some of the videos that I did and look at another story of Christ and hopefully it'll help you see how it is that I draw all of this together and why it is that I see the patterns that I see is it's a lot of it is using St. Ephrem as a guide to interpret Scripture. Of course he's not doing it arbitrarily. He himself as the guide, is pulling together all these threads in Scripture into very short and condensed stanzas. And so it's sometimes difficult because it can take some time to unpack them. But hopefully you'll follow me along and it'll give you a few secret keys to the interpretation of Scripture. This is Jonathan Peugeot. Welcome to the Symbolic world. And so the. The stanzas that I'm reading, I'm going to read three are from page 78 of the St. Vladimir Seminary edition of the Hymns on Paradise, translated by Sebastian Brock with a great introduction. So sone Ephraim starts. He says, with the eyes of my mind I gazed upon Paradise. The summit of every mountain is lower than its summit. The crest of the flood reached only its foothills. Then it kissed with reverence beyond turning back to rise above and subdue the peak of every hill and mountain. The foothills of paradise it kisses, while every summit it buffets. Not that the ascent to paradise is arduous because of its height for those who inherit it experience no toil there with its beauty it Joyfully urges on those who ascend Amidst glorious rays it lies resplendent, all fragrant with its scents. Magnificent clouds fashion the abodes of those who are worthy of it. From their abodes the children of light descend. They rejoice in the midst of the world where they have been persecuted. They dance on the sea's surface and do not sink. For Simon, although a rock did not sink, blessed is he who has seen, together with them his beloved ones below in their bands of disciples and on high in their bridal chambers. So those are the three stanzas that I wanted to read to you. Now, I could have kept reading. I could have read a little bit before, a little bit after. And I would have found as many nuggets of amazing. Of amazing interpretation in terms of Paradise. Now, of course, the first important part is to notice the cosmic aspect of the Paradise. That is, he starts. And he says, with the eye of my mind. This is very important because he is already placing the relationship of paradise in relationship to the person with mind, or with nous, or with the highest aspect of human faculty. And so there's already a hierarchy being set up in the structure of the text by even saying that he gazes upon paradise not with his physical eyes, but with the eyes of his mind. Because there's something about paradise which is impossible in terms of quantitative understanding. And so he places the summit of the mountain of paradise higher than all the summits of every other mountain. And then, so he starts up high, he says, the summit of every mountain is lower than the summit of Paradise. And then he says, the crest of the flood reach only its foothills, the foothills of paradise kisses it with reverence before turning back to rise above and subdue the peak of every hill and mountain. Now, remember, of course, the image of paradise, the image of everything that I drew, or. Or maybe the image the second one I did with the Ark of Noah. You'll notice that I really draw in from this interpretation. That is, the height of the mountain, and then at the bottom of the mountain, you have the waters. But here it's very interesting because you notice that in reference to paradise, the relationship between paradise and the waters is something like a romantic relationship where. Where the waters kiss the feet of Paradise. But when the waters act on that which is below paradise, it buffets the summits. And so even the chaos of the lower waters in relationship to paradise have a relationship which is not threatening, which is something like the relationship between a man and a woman, which is very important because you'll notice other allusions to that sexual relationship in. In the rest of the three stanzas. Now the second stanza continues. This relationship of how that which is below and that which is above doesn't necessarily have a relationship of hostility, but that that which is above the hierarchy and that which is below the hierarchy is really can be a relationship of joy and of discovery. And so he says that the ascent to paradise is not arduous because of its height. For those who inherit it, they experience no toil there with its beauty, it joyfully urges on those who ascend Amid the glorious rays it lies resplendent, all fragrant with its scents. Magnificent clouds fashion the abode of those who are worthy of it. And so this going up the mountain, he shows how obviously you know that this is what happens as you go up a mountain. You come closer to bathing in light, let's say. And so as he goes up the mountain, he says that those that inherit the mountain in paradise receive it as more light as you go up. And then the houses which are at the summit of the mountain are fashioned by clouds. That is, they're more subtle. They're not as material in the way that we understand it. They're not as heavy, they are more subtle bodies, you could say, you know. And so this is also related to the fact that St. Ephron says that he views the paradise through the eye of the mind. So just like thoughts have more subtle bodies, that is, you can have intuitions and then thoughts and those thoughts are more subtle. There's something like clouds, let's say, that form houses for these pure intuitions. In the same way, the houses which are at the summit of paradise are fashioned by more subtle bodies. But even all the way to the bottom of the mountain, like I said, the relationship is not one of the. Of contradiction or one, you know, of hostility. But even the waters at the bottom of the mountain, which in the body would be something like the physical body, you know, the. Or the desires or whatever that is, that's at more at the lower parts of the. Of the human psyche or the human body. Then those nonetheless have a relationship, can have a relationship which is closer to the lover's relationship. And so the third. The third stanza is where most of the amazing meaning is, so he says. From their abodes, the children of light descend. They rejoice in the midst of the world where they have been persecuted. And so for them, even the world of hostility is because they are coming down from the summit of the mountain of paradise. Persecution to them is actually joy. It is actually not hostility it is transformed into joy. Because they get their life, their light, from that which is above. And they don't focus, they're not attentive, or they don't base their life, their light and their joy on that which comes from below. The thorns, the waves, all of this stuff which can be dangerous to them. It is joy. They dance on the sea surface and do not sink. For Simon, although a rock did not sink, blessed is he who has seen, together with them his beloved ones below in their bands of disciples, and on high in their bridal chambers. I'm going to look at this idea of coming down the mountain and dancing on the sea just a little later. What I want to look at it first is the basic structure of talking about Blessed is he who has seen together with them his beloved ones below in their bands of disciple, and on high in their bridal chambers. So here you have a relationship of quantity to quality. And so you have the idea of this band of disciples, the band of disciples which are below the mountain. And the highest aspect, let's say, of a relationship which is something like the closeness, this bridegroom, bride, bridegroom relationship, which is at the height of the mountain. So if you think about some of the stories that I've told you in the past few years, if you think about some of the images that you find in the Gospels, you'll notice, for example, when I talked about the parable of the vinedressers. In the parable of the vinedressers, it talks about calling people to the wedding feast, and calling people to the wedding feast, which is in the king's castle. And in my interpretation, I kept saying it's at the top of a mountain. And of course, in the text, it doesn't say that it's at the top of a mountain. But as you start to notice the patterns of how Scripture works, saying something like, it's at the top of the mountain can help you understand how it participates in this pattern. So you can see how St. Ephrem puts the bridal chamber at the top of the mountain. Because the bridal chamber is equivalent to Moses encountering God in the secret place. It's the equivalent of going into the holy of holies. We know that all of these images of intimacy and going into the secret place are related to going up to the top of the mountain where the earth and heaven meet. And this is the sexual relationship between heaven and earth. And then down below is where you have quantity. And so you have the band of disciple, you have the body of Christ. Now think of images, stories, for example, like Christ going up to the Mount of Olives, where he goes up alone to the mount and. And then has an encounter where he's consoled by an angel, but then leaves the disciple below and tells them to remember, tells them to stay awake, but they can't. They fall asleep. Now remember now again the story of Moses, who goes up the mountain to meet and receive the law of God and leaves the people below, the band of disciples, the body of Israel below. And while they are below and God and not God, Moses has went to encounter God. They forget about Moses, and then they fall into distraction, just like the disciples fell into distraction at the bottom of the Mount of Olives as Christ was ascending. But he's saying that it's also possible to have both. It's also possible in the best world to be able to have this loving encounter up in the highest place of the bridal chamber and the intimacy of the bridal chamber, and also rejoice in the quantity of the band of disciples, of this communion of many in which we are manifesting the body of Christ. I wanted to go back to the little part about coming down the mountain and dancing on the sea. And so I mentioned this a few times in many videos about how I really love this image that Saint Ephrem brings about. But what we need to do in order to understand, you know, where is it that Saint Ephrem gets this idea? He gets it from Scripture. He gets it exactly from Scripture. So let's look at the text in which Christ walks on water, and you'll notice something that maybe you hadn't noticed before. So the text where Christ walks on water is from. We're using the Virgin in the gospel of St. Matthew, chapter 14, starting at verse 22. Immediately Jesus made His disciples get into the boat and go before him to the other side, while he sent the multitudes away. And when he had sent the multitudes away, he went up the mountain by himself to pray. Now, when evening came, he was alone there, but the boat was now in the middle of the sea, tossed by the waves, for the wind was contrary. So notice now what has just been set up for you. What has just been set up for you is the cosmic image. Christ sends the multitudes away like he did in the version of the. Of some of the parables that he tells where He. He sends the multitude away. And then he has only his disciples. But then he also tells his disciples to get into a boat ahead of them, and then he goes up to the mountain Alone to pray. Now, while he is alone on the mountain, the. The band of disciples are now in the boat on the flood. So the image that you have is the cosmic image. It's of the garden of paradise with that which is above the meeting of heaven and earth, where Christ is praying to his Father at the top of the mountain and Noah's Ark down on the flood in the waters, in a place where they feel as if they had been forgotten by God. And the waves are tossing and turning, and the chaos is dangerous because in a certain manner, the spiritual principle, the highest principle of their world has gone up in order to encounter God, and they have forgotten him. We could say something like that. Now, in the fourth watch of the night, Jesus went to them walking on the sea. And when the disciples saw him walking on the sea, they were troubled, saying, it is a ghost, and they cried out of fear. Now remember the way that it was presented by Saint Ephrem. He said, up on the mountain, the abodes are constructed by clouds. And so you can understand that this is also what is being referred to. That is, as Christ descends the mountain, he is more subtle, you could say, because he has gone up to the place where heaven and earth meet. So coming down the mountain, He. He is encountered as more subtle. They see him as a thought, as a projection, as a phantasm, as something which doesn't fully have body. But immediately Jesus spoke to them, saying, be of good cheer. It is I do not be afraid. Notice again what he's saying. He's saying what Saint Ephrem is saying. He's saying, rejoice even on the flood, even in the place where you are persecuted. This is a place of joy, because I am coming to you from the top of the mountain. I'm bringing heaven down to you. And so this place, which looks like a place of chaos to you right now, is actually a place of joy. It is actually a place which is full, and so you do not need to be afraid. Peter answered him and said, lord, if it is you, command me to come to you on the water. And so Peter comes out and walks on the water. This is of course, why St. Ephrem says that there's a whole play going on in this situation, which is Christ is making even the rocks walk on water. He's bringing even Peter, who is supposed to be that which sinks to the bottom of the ocean. If he looks upon Christ, then that which is meant to sink to the bottom and can actually rise up and dance upon the sea, just like Christ has come down to walk on the waters. And so he said, come. And when Peter had come down out of the boat, he walked on the water to go to Jesus. But when he saw that the wind was boisterous, he was afraid and beginning to sink. He cried out, saying, lord, save me. And immediately Jesus stretched out his hand and caught him and said to him, o you of little faith, why do you doubt? And when they got into the boat, the wind ceased. Then those who were in the boat came and worshiped him, saying, truly, you are the Son of God. So, of course, there are many things going on in this which are not necessarily related to what St. Ephrem said. But maybe we can go over it a little bit. That is, it's interesting to notice, for example, that when Peter comes out of the boat and he walks towards Christ, what he notices, we. We often think that he notices the waves, but it doesn't say that in the text. He notices that the wind is boisterous and is that which made him afraid, and then that is what made him begin to sink. And a good way to understand that in terms of analogy, is to understand how it is usually our thoughts that make us afraid. It is actually the more subtle things which make us afraid. And is not necessarily the world itself that it's our thoughts about the world which make us doubt. It's our thoughts about the world which make us not trust God, or our thoughts about ourselves which make us be prideful or hate others. And so the danger is actually often in the middle space between heaven and earth. You could say that is where sin takes its root, in the more invisible aspect of yourself. That is your thoughts, your ideas about how reality is. And that is actually what then makes him sink in the water. It's not that the water isn't dangerous, of course the water is dangerous. But it's only dangerous to those who get caught up in this whirlwind of thoughts and of desires and all of this stuff. And so St. Peter sinks, and then Christ immediately stretches out his hand, catches him and says, why did you doubt? And so all of this then also becomes about doubt. Now, the story of Saint Ephrem, the story that Saint Ephrem tells and the story that we find here in Scripture is fractal. It is a fractal story, which means that it applies cosmically to the relationship between God, between heaven and. And earth manifestation in general. But it also applies to, at a smaller level, to anything that you are ever involved with. So the way that this works, you can use any project that you're involved in. And you can understand the same problem. Now think. Imagine you're working in a team in order to build a new product. And so there's something which is above. There's a leader who manifests, who's supposed to hold together the reason why you're doing things. He holds the leadership together, he holds the attention of the team, he directs the team. And he also is a placeholder for the reason why you're doing things in the first place. Now, if that leader goes away or has, or has to go somewhere else or meets with the boss for a very long time, you can imagine the. The team members now don't know where to look. And they can be in danger of starting their. All their different ideas of starting to conflict with each other. And not just that, but maybe starting. Starting to focus more on their own rivalries, their own little desires, their own idiosyncrasies, and forget the reason why they are doing all of this in the first place. And this is when things start to break down. This is when the chaos starts to happen. And so in order for you, in order for the team to be able to solve their problem, they need to be able to recognize once again the reason why they're doing things. And that reason is something like a ghost, in the sense that the reason why you're doing things together is not in the things you're doing, it's above it. It holds, it stands above them as an invisible purpose. And looking to that invisible purpose will rebind the world together, will pull the rock from out of the water, pull the earth, the body, from out of the water. Just like Christ is also actually in this story, Christ is actually showing us an image of the actual creation of the world. He's actually pulling the earth out of the waters, like you see at the beginning of Genesis. And, and so this can be applied to a team, but it can also be applied to yourself as a person with all your multiplicities of thoughts and of fears and of desires, when they forget the higher purposes of what you're doing, they can start to fragment, to break apart, and then you can start to sink. But looking up above that and remembering your purpose, remembering the reason why you do things, can bring you out of the waters. Now, of course, it's important to understand that this only holds together if it culminates into the transcendent. If ultimately all of these fractal patterns are held together in a cosmic image of paradise, the very same image that Senate from the Sirian tells about how the very cosmos lays itself out and how it's held together by this mountain of meaning which moves up to the place where we encounter God. And so I wanted to give you a little hint at some of the ways in which I come to the interpretations that I come I not always explicit in because as you notice, it can take quite a while to explain it. But hopefully this has been helpful to you, will encourage you to read the hymns of paradise and will also encourage you to start thinking in that matter and start understanding the manner in which Scripture pulls together these patterns. And so thanks for your attention everybody, and hopefully we'll be making more videos very soon. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon, the Pageau videos as well and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
