{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":0.72,"end":104.16,"speaker":"Jonathan Pageau","text":"On this episode of the Symbolic World podcast, I will be playing for you a discussion I had with Father Stephen Damick. Father Stephen has become a staple in North American orthodoxy. He has a podcast, he has written a book, and he's also doing videos. He actually has two podcasts, so he's really, really involved. And what we wanted to talk about was his new podcast, which looks at the relationship between J.R. tolkien and how some of his world building and the manner in which he describes the world, how it can be understood through an orthodox lens, how it has some similarities with orthodoxy. And so we really talked about how stories can be applicable to our lives in the world and how that is really the core of symbolism, not some abstract understanding of something, but to see how the patterns can be used to apply in other circumstances. So just to remind you that everything I'm doing here, all the videos, all the podcasts are done thanks to your support. So you can go to thesymbolicworld.com support and find ways to help out the podcast. To all the patrons, all the people who are helping me out. I am offering often some advanced view of videos, but mostly now I've started doing one video a month, which is just for Patreon and is an interpretation of some traditional stories. So this month I am doing Rumpelstiltskin. So please enjoy the discussion and I'll talk to you soon. This is Jonathan Peugeot. Welcome to the Symbolic World."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":114.24,"end":166.77,"speaker":"Jonathan Pageau","text":"Hello, everybody. I am sitting here with Father Andrew Damick. Father Damick is an Orthodox priest. He's also an author. He's written a few books and he is a podcaster. He's been doing several podcasts, but mostly recently he started an interesting podcast on the relationship between Christianity in general, Orthodoxy in particular, and Tolkien's work in the Lord of the Rings and the Simularian and. And his other works. And so I thought it would be a really interesting opportunity to talk to Father Andrew, just because I know a lot of you who are watching me are interested in stories like mythology, like traditional stories, and a lot of you are also fans of Toki. So, Father Andrew, maybe you could introduce yourself a little bit, tell us about your journey. I know you are a convert to Orthodoxy as well, you know, your journey into Orthodoxy, but also to Tokian and to these types of stories."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":167.65,"end":174.29,"speaker":"Fr Andrew Stephen Damick","text":"Well, thank you very much. Well, first thing I'll say to introduce myself is that my last name is pronounced Damick Daemick."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":174.45,"end":176.61,"speaker":"Jonathan Pageau","text":"I will try to be careful with that."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":176.61,"end":264.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's not a really common name, actually, and in fact, is A sort of Americanization of a Lithuanian name, which is Domica, which I kind of wish sometimes that my great grandfather had just sort of left it alone, but here we are. But, yeah, for me, actually, the journey into Orthodoxy and J.R.R. tolkien are kind of bound up together. And the reason for that is that having read Tolkien from when I was quite young, I would say, I don't know, maybe starting eight or nine years old, that very much shaped my imagination and shaped my worldview in terms of what was not just sort of possible, but kind of what I expected from the world. And I think then when I encountered the Orthodox Church in my early 20s. So I've been Orthodox now for about 21 years. When I encountered the Orthodox Church in my early 20s, in some sense, it was like an experience of, wait, it's all real. Like this kind of world where the transcendent is just at the threshold of the imminent. That's actually a thing. So I was very receptive to Orthodoxy, I think, as a result of that. And. And not that my evangelical Protestant upbringing regarded the world as flat, but."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":266.12,"end":266.4,"speaker":"Jonathan Pageau","text":"It."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":266.4,"end":286.83,"speaker":"Fr Andrew Stephen Damick","text":"Kind of sequestered the miraculous and the supernatural into the Bible and into sometime in the future, largely speaking, although it did kind of allow for the possibility of miracles in our own day. But it wasn't like. It was like we were walking up to the threshold every time we went to church on Sunday. That's not what we. What we did."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":286.99,"end":287.47,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":287.79,"end":324.98,"speaker":"Fr Andrew Stephen Damick","text":"Whereas as an Orthodox Christian, I would say that's. That's what I do. You know, that is my normal daily life. So, you know, my. My vocation is as a parish priest, so I'm a pastor of a church in Eastern Pennsylvania, and I'm also a husband and a father. I have four kids. And I've been podcasting with Ancient Faith Radio for about a decade now. And this new podcast that you mentioned is actually my fourth podcast. And I've also got a few books with Ancient Faith Publishing and some blogs, and I just sort of seem to accumulate content much as you yourself do. So that's kind of me in a nutshell."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":325.46,"end":422.76,"speaker":"Jonathan Pageau","text":"Well, I think it's very interesting. One of the. I have noticed, and I've noticed that, you know, with Nicholas Kotar, but also with just priests in general. When I meet Orthodox priests, they have this kind of. They do have this kind of strange Tokian culture, especially converted priests, it seems, and a lot of Orthodox converts. And I think the way that you phrased it, to say, you know, that, wait a minute, you know, this is real. I can actually live in a story that has this magical quality to it. I think that you really hit the nail on the head in the sense that, you know, the liturgical life and this idea and even the fact that priests, even their vestments, you know, when you see a priest, there's something about it that is. That is accepting of a grander reality, of something which is more. And, you know, when you read the Tolkien and you read this idea of an ancient world which is almost also being lost, you could say, and there's this. It kind of peaks in, and all of a sudden you get a sense that you're connected to this ancient thing. And I think that that's also something that is. There should be there, at least in Christianity, once you start. When you read, you know, the early Church Fathers, for example, when I read St. Gregory of Nyssa, it was as if. Exactly as if I was plunged into this magical world. And I thought, you know, I can live in this story. I can, you know, my life can be plunged into this story. The same story that Moses was part of, you know, And I think that that's an amazing thing that we have access to. Yeah."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":422.92,"end":517.7,"speaker":"Fr Andrew Stephen Damick","text":"And, you know, I know some Orthodox converts, their sense of this can sometimes get a little misdirected towards pining for the glories of some particular past Orthodox culture or something like that. But the truth is really that this. If we should have any kind of nostalgia, it should be nostalgia for paradise. Right. In which the veil between the transcendent and the imminent is basically not there. You know, that Adam and Eve walk with God in the garden, you know, and so I've seen that. But I think what you're saying is true, that there's this sense of connecting with something ancient, something powerful, something where, you know, the divine, the mystical is just kind of on the edge of our actual experience. And I think a lot of that is based on what we expect actually, of our story. Like, do I expect that I'm going to encounter the divine, or have I just sort of accepted that that's not a thing in my world, even if I'm a believer in it? Right. I might agree that it's there, but not really kind of be desiring it and wanting it or expecting it, certainly. And I think that's one of the things that orthodox Christianity in some sense takes as a given, actually. You know, that simply God is there, and he actually does love us, and he's touching us and connecting with us, and. And his saints are just there, kind of on the edge of our Consciousness. Right."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":519.38,"end":633.44,"speaker":"Jonathan Pageau","text":"But I think that's something that right now it's such a great time to talk about this because there's a sense I'm seeing, even in the secular community, I'm seeing an awakening to, as science reaches its limit, you could say in terms of understanding the human person and is hitting up against the problem of consciousness and the problem of what it means for a meaning making conscious agent to be the one who is observing the world and how that interaction is extremely complicated. The possibility of speaking of the other. Only word I can use for people to understand is of speaking of these principalities, of the notion that there are principalities which surround us and which are forming our world and we have the chance to participate in that. And, and this kind of amazing hierarchy of saints and of angels leads up and points us to the absolute transcendence. I think that now is just such a great time to talk about that. I have seen in my dealing with kind of post atheist people. At first, when you talk about angels, they think you're talking about, you know, I mean, they think you're just talking that they're actually winged people that fly around in the sky to, to finally saying, oh, okay, all right, I see that. I see what you mean. And I also see what you mean when you point to the fact that even you as a person, there's an aspect of you that you cannot fully contain within the quantitative world. You could say, and it's kind of leading people to the. To now again, looking at old stories, looking at myth. And the great thing about Tolkien is he was able to create a world that was almost. Was so completely coherent in terms of its mythology. In terms of its mythology is not at all Christian. And I think that's also important. It's not at all Christian in its, let's say, in its outer aspect."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":633.68,"end":634.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":634.24,"end":646.98,"speaker":"Jonathan Pageau","text":"When you look at it, you see that the pattern that is behind it reveals something that can help you understand what it means to be a Christian in the world. And I think that that to me is one of the most interesting things that Tolkien can, can bring to us."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":647.7,"end":691.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, and I mean, it's interesting if you read like, if you read Tolkien's letters, for instance, he talks a lot about his intentions for his creation and well, sub creation, to use the Tolkien term. And you know, one of the things that he says is that he says that it's actually a Christian and Catholic work particularly, but there's a lot of people who are not Christians or maybe have no religious involvement at all, who, if they had read that bit from his letter, might think, wait, what? I don't see Jesus in here anywhere. What do you mean by that? But I think part of the difficulty, of course, is that we often look at things on a more superficial level rather than seeing kind of the deeper substrates of what's going on."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":691.68,"end":772.88,"speaker":"Jonathan Pageau","text":"Yeah. And it's almost like the. I kind of see it the way that it's almost as if Tolkien world is an alternative Old Testament, you know, where there you have all these types, these small types of characters that will manifest one aspect, let's say, of Christ or one aspect of the fullness of the Christian revelation. Just like in the Old Testament, all the figures kind of point to Christ, but Christ is not there, you know? And so it is like kind of this funnel that points you to the final revelation, you could say, which is not in the story. And I think that all good stories, that's what they should do. I always kind of. I always. You know, a lot of people really like CS Lewis. I remember reading CS Lewis when I was younger and liking a few of the books, but not totally getting into it so much. And I think part of it was because of that problem is that, you know, Aslan is Jesus. Okay, I get it. And so. But then. And then it gets weird because sometimes he does things and you're wondering, okay, well, if Aslan is Jesus, why is he doing this and why is he acting like this? There's some. It just becomes very, very strange. Whereas in Tolkien, you don't. You don't have that problem because all the characters are kind of manifesting different aspects of reality. And if you kind of bring it together, then you see something behind it, you know."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":772.88,"end":837.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And I mean, I have loved Lewis probably just almost as long as I've loved Tolkien. But the point that you make, I think, is a good one. And he. You know, I would say that Tolkien's Middle Earth, and actually Middle Earth is just a continent in his world, but his sub creation, the whole cosmos that he's created, is much more perfect and coherent than Lewis's Narnia. But if I can just give one small plug for Lewis, I think he actually. And this is not for Narnia, I think Lewis actually achieved this. The thing that Tolkien, I think did best, I think he achieved that. Lewis achieved it in some measure with his final novel, which is Till we have Faces, which is not, you know, within Narnia. And it's really a pagan story, actually. And I think because Lewis wasn't trying to present Jesus in particular, that it actually presents a more Christian world than Narnia does. Interestingly enough, I've not read it, so."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":837.92,"end":840.88,"speaker":"Jonathan Pageau","text":"Maybe this is a plug for me to go into that."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":840.96,"end":854.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, you should check it out. I think it is actually Louis's best work, and although not as well known by any means as anything else, really, that he wrote, I think just about. But of course, we're here to talk Tolkien, though, so."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":854.12,"end":863.8,"speaker":"Jonathan Pageau","text":"All right, so let's talk about Tolkien. So maybe you can tell us a little bit about the premise of this new podcast. I think it's called Amun Sul. I'm probably not pronouncing that right as well. You got it."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":863.8,"end":864.32,"speaker":"Fr Andrew Stephen Damick","text":"You got it."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":864.47,"end":864.67,"speaker":"Jonathan Pageau","text":"All right."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":864.67,"end":878.15,"speaker":"Jonathan Pageau","text":"And I will put for everybody, I will definitely put a link to that in the description of the video. But maybe you can tell us a bit about the premise of the podcast and where you're going. Cause I think you're still at the. You have what, two episodes, maybe three now. And so it's at the beginning."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":878.23,"end":884.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, the third episode is. I'm not sure when this will air, but the third episode is slated to air on March 25th, so."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":884.31,"end":886.15,"speaker":"Jonathan Pageau","text":"Okay, so I'll probably put this up before."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":886.31,"end":933.95,"speaker":"Fr Andrew Stephen Damick","text":"Okay, great. So, yeah, so, you know, we're well underway now. You know, got a few under our belts. And the whole point of Aman Sul is. Well, first, actually, I should say that where does it now fit kind of in the constellation of Tolkien podcasts? Because there are dozens of them. And when I was first conceiving this idea, I was like, man, I mean, how do I even get heard kind of in the midst of all of these other things? I have my own audience. I figure, well, these are the people that I'll kind of start. I'll start with. But there's lots of them. And one thing that I did notice is that most token podcasts, their deal is essentially, let's take this book or maybe this series of books, and we're gonna read through it chapter by chapter and offer commentary along the way."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":934.35,"end":934.71,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":934.71,"end":942.67,"speaker":"Fr Andrew Stephen Damick","text":"Almost all of them do that, and some of them do it really well. Some of them not so well. Not so well, Right. I won't name any names."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":942.67,"end":943.43,"speaker":"Jonathan Pageau","text":"Yeah, exactly."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":943.43,"end":1078.9,"speaker":"Fr Andrew Stephen Damick","text":"But. But I thought, okay, well, I can't do that because that then at least puts me doing the same thing that they're doing. And people would say, well, why should I just listen to yet another chapter by chapter commentary? Right. Which, I mean, I think it's a cool approach. So I'm not doing that. Instead, this is a Much more topical approach, and it's based on conversation rather than commentary, although sometimes that commentary is given as conversation. And what we're doing is we're taking themes from Tolkien's works, which include not just his epic fantasy, but also even his letters and some of his non fantasy works. We're gonna get to and looking at what he did and asking the question that he himself suggests should be asked from his work. So we talked a little bit about allegory just a couple minutes ago when we were talking about CS Lewis and, you know, Aslan equals Jesus, that kind of thing. So Tolkien doesn't like allegory, and he's very explicit about that in one of his prefaces to the Lord of the Rings. But instead he favors what he calls applicability. Yeah, so if I had to pick one word for what it is we're trying to do with the Amen Seoul podcast, it's this question of applicability, right? And as a Christian, and as a specifically orthodox Christian, then that's the kind of applicability that I want to talk about. And so just to give some examples of where we've already gone, so, for instance, the very first episode, which I did with my friend Steven Cristoforo, we talked specifically about this question of accessing the transcendent in an imminentized experience of the world, which is what most of us are having most of the time, right? How do Tolkien's works help us to navigate that? And like, one of the things that we talked about in the midst of that first episode was the fact that that journey is actually being taken by the hobbits in the Lord of the Rings. You know, they live in this town where everything is agrarian and domesticated and pastoral and life is about creature comforts, family and friends and, you know, all that good stuff, right? But the idea that there's dragons, that there's wizards, that there's anything outside of, you know, the four farthings of the."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":1078.9,"end":1081.15,"speaker":"Jonathan Pageau","text":"Shire, there's a bigger story happening here, right?"}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":1081.15,"end":1128.94,"speaker":"Fr Andrew Stephen Damick","text":"They're just not even aware of that. And when, you know, it might exist in kind of old tales. And then one guy who goes off to kind of experience that comes back and everyone regards him as kind of crazy, right? So it's kind of Plato's Cave, you know, all over again. And, you know, the hobbits leave the Shire and they're being. They're being coached along the way by people like Aragorn and Gandalf actually how to navigate this much larger story, including transcendent elements Right. So, for instance, you know, hobbits will just talk about anything anywhere, as an example. And sometimes Gandalf or Aragorn in particular would say, don't talk about that here. Or, you know, let's wait until morning, or that kind of thing, suggesting that there is power in language that they're not aware of."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":1129.02,"end":1129.42,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":1130.62,"end":1140.87,"speaker":"Fr Andrew Stephen Damick","text":"So that was one thing that we did. And then in my second book, Big Episode, which is actually episode three, which I did with Deacon Nicholas Kotar."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":1141.35,"end":1145.79,"speaker":"Jonathan Pageau","text":"Yeah, we had him on our channel and we did a discussion with him. So people will want to check it out."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":1145.79,"end":1194.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. You know, we talked specifically about storytelling. So some of the same stuff you talked with him about, you know, at much greater length. And, you know, and what impact does reading stories and of storytelling have on us as human persons? And how does that connect us with prayer and how does that connect us with saints? So it is this question of applicability. And I mean, you might describe it as pastoral theology maybe, but I wouldn't narrow it to just that. But that's kind of what we're trying to do. And some of the episodes are going to be more sort of higher level analyses with a lot of theology, and then others are going to be not so theologically nerdy, I guess."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":1195.77,"end":1197.77,"speaker":"Jonathan Pageau","text":"How does theology become nerdy? How did that."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":1198.09,"end":1251.32,"speaker":"Fr Andrew Stephen Damick","text":"It just does. But, you know, I mean, my deal is that I'm kind of a popularizer anyway. It'll never get academic. You know, that's kind of not what we're doing. So, yeah, that's what Aman Sul is about. And the reason why we chose the title in particular is that Aman Sul is a place in the Tolkien legendarium where. Where it's also called Weathertop. Aman Sul is its Sindarin name, which means Hill of Wind. And it's a place where a number of events happen in the legendarium, but especially for those who are familiar with Lord of the Rings, it's where the Hobbits, along with Aragorn, have that battle with the Nazgul. And the Witch King of Angmar stabs Frodo in the shoulder with the Morgul blade. So it's a really important place, not just because of that event, but for lots of other reasons. If you want to hear about all of that, listen to episode two. So I'm just sort of plugging as I go."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":1251.32,"end":1252.36,"speaker":"Jonathan Pageau","text":"That's right. That's all good."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":1252.92,"end":1265.96,"speaker":"Fr Andrew Stephen Damick","text":"But yeah, so that's what it's about. And there's all these questions of memory and of seeing, you know, from a far distance and seeing things that are not normally visible to the eye. All of these are themes that have to do with Weathertop, actually."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":1266.12,"end":1267.16,"speaker":"Jonathan Pageau","text":"Okay. All right."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":1268.12,"end":1275.16,"speaker":"Fr Andrew Stephen Damick","text":"And so I like all of that, and I wanted to kind of make that a lot of the recurring motif in the podcast."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":1276.67,"end":1407.59,"speaker":"Jonathan Pageau","text":"I really want to get back to this idea. To me, the issue that you talked about, that Tolkien said he doesn't like allegory, I've always really felt sympathy for what he was saying, and I've always felt like people didn't understand what he meant. And I'm not sure I totally understand what he meant. But I have my own idea for the reason that I don't like allegory, which is that, say, what I would call true symbol, like fake symbolism is the kind of. Not fake or lower symbolism or lower imagistic speaking is the kind that we talked about where it's like this figure represents this other figure. So, you know, I'm gonna have. I'm gonna write a story, and then there'll be a veiled. A figure that's gonna be a veiled illusion to Donald Trump, let's say. And so here. Here's this character who represents Donald Trump. And that, to me, is. Is a kind of very weak version of imagistic speaking. And you could call that allegory or metaphor or something like that. And to me, true symbolism is something which is structural. That is, there's an underlying structure which is actually the structure of reality. It's like you've actually intuited the structure of how the world lays itself out in terms of what a story is, in terms of how we experience the world and in terms of how we. We are living in the world. And then you create this story that follows that pattern. And so then, like you said, I like the word applicability, because then you can say you can kind of see through the story, the pattern, and then you can apply it to anything, right? You can apply it to any aspect of your life, because it has a universal aspect to it or a universal structure, you could say, or something of that. I always call it, like, it's actually how you experience the world. It's like some. Some people are able to intuit it, and so they. They able to lay it out in a. In a fictional story. But it's not. It's fictional, but it's not. Like you said, it's not just this character represents war. This. This character represents the, you know, Hitler in World War II, or the. This aspect represents a nuclear bomb or something like that like, to me that is a weak use of symbolism."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":1407.83,"end":1514.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I think that when a story becomes allegorical, and I think you're on the right track in terms of my understanding of what Tolkien is criticizing in terms of allegory, what happens then is your ability to process it becomes reduced. Because it's only supposed to be about this one thing. And so, okay, I got there, I learned my lesson. Now what? You know, meanwhile, like for instance, I've already gotten lots of email for this podcast which has really been amazing to me. And one of the emails that I got, we actually featured on one of the episodes, at least a portion of it. There's this man who talks about how when he was young he had a very difficult life and actually was contemplating suicide on a number of occasions. And that the thing that pulled him away from that is a scene from the Two Towers where Aragorn is standing up on the battlements of Helm's Deep, you know, in the face of just incredible odds. I mean, they are going to be defeated as far as you know, by that point in the story. And he stands there in the face of all these massive horrifying monsters and tells them to be gone, get out. Because you don't know what tomorrow's gonna bring. You don't know what is going to happen in the new day. And this man told me in this email that that scene inspired him to sort of face down his own demons even as a kid and tell him to get out because he didn't know what tomorrow was going to bring. And that is one kind of applicability where you can identify yourself. Now he can't look at Aragorn and say, I'm like Aragorn because he's just a kid."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":1514.88,"end":1516,"speaker":"Jonathan Pageau","text":"He could, but he might."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":1517.9,"end":1591.23,"speaker":"Fr Andrew Stephen Damick","text":"But Aragorn doesn't stand for him. Like you have to be really kind of, you know, deluded to think that. But if you were told that Aragorn stands for Jesus and that's all Aragorn kind of is, is just this. Now I would say he is a kind of Christ figure. But if that he stands, he's a stand in for Jesus, then it's harder to kind of say, well, I can be like that and you know, face down the demons because you could say, well, he's God. So of course he can make that kind of comment, you know, of course he can say, yeah, tomorrow I'm just gonna blast you. You know. Yeah, you know, so I, and I, and I think that also this realm of applicability opens up all kinds of possibilities for conversation. Right. You know, it's not this sort of contained discourse where if you say, well, I want to connect it. Like, for instance, when I talked with Deacon Nicholas Kotar, we talked about hagiography, and he even talked about hagiographies that were sort of invented for saints about whom there was almost no historical data. Right. Well, you know, if it's just allegory, that's what Lord of the Rings is, then you kind of have no right to sort of import that and connect that. But applicability, absolutely. You know, I think that's a really."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":1591.39,"end":1791.76,"speaker":"Jonathan Pageau","text":"And the thing is, like, for example, that scene that you mentioned in terms of Aragorn standing on the wall looking at the hordes, there is in that scene a what I would call the structural element, which is. Right. Like, it's. It's. It's the right image for that experience that this person was having in terms of being faced with, you know, these demons in his life and feeling overwhelmed. And so. And it, It's. I often, because it's so obvious for us when we see it, because it's so intuitive, we see that scene and we. It's so intuitive that we can't really explain. It's like this, of course, this is what it should be, but you can imagine another scene, for example, where it's someone sitting at a table eating a feast. And then that's a different scene. Like, he couldn't say to the demons, be gone, because he's sitting inside the castle at a table eating food. And so the fact of standing on a wall already is something that we can analogically experience in. In our life. This idea of being on the limit of something we can experience in. In terms of meaning, not just in terms of physical reality, but the analogy is actually real of being on the edge. We use it, that experience, that expression all the time to talk about someone who is strained, who is faced by all these difficulties, like, he's standing on the edge. And so standing on the edge and then having the courage to look straight on at these demons, not hide, not. Not just pretend they're not there, but to look at them and to say, okay, I'm not going to pretend, but I'm going to tell you, I'm going to, you know, I'm going to say, go, be gone. Because I trust the few. Like, I trust. I trust. I mean, obviously I would say I trust God, but I have trust that things can change. I have trust that. That this situation is not eternal. This situation is not the one that is going to. Going to pervade. And so that's where you see this, like you said, this applicability coming from something which is so right. Intuitively, you know, it hits you right there in a way that is almost impossible to explain for so many people. You know, they have that. So many people that I know had that experience, for example, watching Braveheart, where they. They. Even my wife, she said. Like. She said braveheart is basically one of the reasons why she kind of came back to Christianity. You know who. She kind of really rededicated her life, and it never stopped since then because of that, because of an imagistic taking you through the story of someone who's faced with insane opposition but won't back down and will go until the end. It shows you that how stories and how participating in a story is really a kind of therapy. You could say It's. It's a. It's a kind of repro. It can be a reprogramming of your life. It can be a reprogramming of reality. And so that's why I tell people that the liturgical experience or the liturgical year and the liturgical calendar is the ultimate version of that, where we follow the story of Christ through the year. And we. Especially during this time now, during Lent and then during Holy Week and at Pascha, it's like we are diving into this story we're going through. We're lamenting with Christ's death. We're doing all that because we know that engaging in stories and participating in them actually transforms reality, transforms the world."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":1792,"end":1880.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And if we try to present, like, for instance, if I were to. Had talked to this man when he was a kid and said to him, now, look, you know, sure, you're being bullied and you're valuable. You should. Don't kill yourself. You know, like, that falls much flatter than seeing this image of this man who's destined to be king, but maybe he's not gonna make it. By that point of the story. You kind of don't know that that's actually gonna happen. And there's something about images, there's something about story that actually, in a sense, is much more convincing in terms of altering the way that I function, then, you know, actually it reorients my desires in a way that is far more powerful than simply offering an argument. And, you know, the irony, of course, is that here in the early 21st century, we still kind of at least tend to speak as though, you know, these enlightenment ideas of, well, if I make a rational argument, Then I'll convince you. And having convinced you now, that will change the way that you live, you know, that will change your behavior that, you know, and the, you know, this is ironic because that's not the way that human beings actually tend to function."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":1880.79,"end":1881.75,"speaker":"Jonathan Pageau","text":"Right, Exactly."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":1882.79,"end":1897.56,"speaker":"Fr Andrew Stephen Damick","text":"There's a difference between saying, okay, I agree with you because you're making an argument that I. That I can't overcome, and actually becoming a different person, or, you know, and. And can be even worse when you've."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":1897.56,"end":1903.92,"speaker":"Jonathan Pageau","text":"Received the logical argument and, you know, that you should change something, but it's like it's not happening, can make it worse."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":1904,"end":2007.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Like it can lead, in fact, to despair instead. That's right. You know, like. Like, I know. I mean. And, you know, the apostle Paul wrestles with this. I know the good, but I don't do it, you know, and I do the evil that I don't want to do. And, you know, and so that's an indication of an orientation of desire. And orienting desire is a different. A different ballgame, really, than just setting out arguments and convincing people. And I mean, you know, it's funny, even just kind of in our political arena, we have lots of arguments that go back and forth, and yet no one seems to be convinced, no matter how good and how well refined, you know, the arguments are made. And that's one of the reasons that I love Tolkien's works, is that he offers an image of how to be, an image of how to think, how to desire, how to live that is actually much more kind of immediately accessible and not imposing itself on the person, really. It's kind of an invitation, you know. So, like, you know, at the end of the Hobbit, where. Or near the end of the Hobbit where Thorin says to Bilbo, essentially, you know, if people were more like you, you know, really valuing, you know, good food and good cheer over hoarded gold, then the world would be a better place. Right. It'll be a happier place. And that's a much more powerful moment, having lived the story up to that point. Then someone simply saying, now, look, it's not good to be greedy. Yeah, Right. Just sort of like moral precepts, you know."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":2007.45,"end":2037.48,"speaker":"Jonathan Pageau","text":"Yeah, there's room for those. Like, there's room for those. I mean, we have them. We also have in the Bible. But like you said, once it enters into the story realm and once you have examples and you have people that you can look up to that, whether it's in fictional stories or it's saints that have lived that way, and then you can kind of engage with those stories, then the transformational. The transformational aspect is far greater. I think that's inevitable. And I think."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":2037.64,"end":2042.6,"speaker":"Fr Andrew Stephen Damick","text":"And even the Bible is much more narrative than it is, kind of course."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":2042.84,"end":2169.42,"speaker":"Jonathan Pageau","text":"Yeah. And that's one of the things that I always try to help, because people really struggle, modern people really struggle to understand liturgy and understand the liturgical way of seeing the world and the liturgical experience and the liturgical year. All those things. It's so hard for people to understand. Why would waste our time celebrating Pentecost and Ascension? And why do we have these long services that kind of take you through? And, I mean, it's difficult for people to fully grasp, especially when they see a liturgy for the first time. But once you start to understand the pattern within the liturgy, you see that it is also. It has a story form. It's taking us into the mystery, and there's different cycles where it's, like, moving you closer and closer to the mystery, you know, and then closing off the doors and then bringing us in and then uniting us with the angels. And so there's this whole. Really. This whole. I mean, it's almost more like a poem in that sense. It's almost like a song or like a poem, which is also. Which also has a pattern form which is kind of bringing you towards this crescendo, you could say, moment, and that it's those types of structures, those types of experiences, which, although sometimes might not be as transformational on an immediately emotional experience, you know, that, you know, you don't necessarily leave the church crying and regretting, you know, your sins all the time, but usually that emotional experience of, like, you know, you've been convicted and you go home crying, that usually lasts, you know, a few days, and then it's gone. Whereas the deep transformation of the pattern of your being is a. It's a. It's kind of this slow ascension that we all participate in. And that's something that I found is in the liturgical world, like the liturgical Christianity is something that is difficult to get people to understand, but it's very profound transformation."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":2169.74,"end":2198.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And one of the reasons why I personally experienced Tolkien as a kind of preparation for liturgical life is because the way that liturgy tells stories is actually a more traditional way of telling stories than we tend to expect now. And I'll give an example of that. You know, so one of the. One of the Tolkien podcasts that I listen to, they're the part that I'm listening to right now, they're going through the silmarillion okay, so. Which is sort of Tolkien's Old Testament."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":2198.17,"end":2205.73,"speaker":"Jonathan Pageau","text":"Kind of, which I have not read, by the way. The Silmarillion, everybody tells you. I know, but yeah. Oh, man, I look at it and I get discouraged looking at it."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":2205.97,"end":2292.22,"speaker":"Fr Andrew Stephen Damick","text":"No, no. My nine year old son is tearing through it. Okay, so, so don't worry. All right. I know. I was kind of shocked. Like, he, he was like that. He. He told my wife that I wasn't reading it to my kids fast enough. And so he, when they were at the library together, he went and looked up where they had the copies of Silmarillion and got the librarian to show him where he. So he could check his own copy out and not be bound to the one that's locked in my office. And so he's just reading it himself. Anyway, so in this podcast, they're going through the Silmarillion, and often one of the things that they'll say is, oh, you know, here's another place where Tolkien gives a spoiler, right? So, you know, often in the stories it'll tell you, often in the title of the particular tale, it'll tell you the end, right? Like, for instance, you know, of the Fall of Gondolin, Spoiler alert. The city's destroyed. You just look through the table of contents, you kind of know what happens. And now you don't get this as much in the Lord of the Rings, there's not as many kind of spoilers in that sense. But the way that Tolkien's tell stories, particularly in the Silmarillion, is much more helical in that there's a sense of. There's always a kind of a looking forward that's happening. And you, you know, you're. And there's almost an expectation that even the first time you're experiencing the story is already in some sense a repeat."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":2292.38,"end":2292.66,"speaker":"Jonathan Pageau","text":"Right?"}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":2292.66,"end":2335.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right. So liturgical life is that way. You know, by the time my kids, for instance, become really cognizant of the fact that at Christmas that this is really telling a story, a specific story, they will have already heard the story many, many times. You know, another thing that happens, and this does happen in Lord of the Rings, is there are moments which are completely sort of unrealistic. And by that I don't just mean something sort of miraculous happens, but like, for instance, after the death of Boromir, which happens at the end of the Fellowship of the Ring, and you get, I'm sorry, I think that actually happens at the beginning of Two Towers. You know, the books and the Movies are starting to sort of."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":2335.71,"end":2336.79,"speaker":"Jonathan Pageau","text":"They meld in your mind."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":2336.79,"end":2388.74,"speaker":"Fr Andrew Stephen Damick","text":"I know. And I know I'm already regretting this because I'm getting email from people saying, that's not what happens in the book. But anyway, wherever it happens in the books, it does happen that Boromir dies. And now this is something that doesn't happen in the movies, which is that you got Aragorn and Legolas and Gimli, and they put him on one of the boats to essentially give him a burial not at sea, but in a river. In the water. And, you know, they put the swords of his enemy, the weapons of his enemies down at his feet and have his, you know, his hands clasped together on his breast. And then they set him off and they sing to him. They sing this dirge, this funeral dirge that is written for Boromir. Right. And it's like, wait, how can that happen? You know, how did they compose that?"}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":2389.86,"end":2391.22,"speaker":"Jonathan Pageau","text":"They're improvising. Yeah."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":2391.22,"end":2410.46,"speaker":"Fr Andrew Stephen Damick","text":"Like, let's work this out right now before we stick it in the book. There's no way that within sort of the action of the book that can be. And so it's a more mythological way of telling. It's kind of breaking its way into this more novel style of story, which the Lord of the Rings is. Right. And that's so liturgical."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":2410.7,"end":2411.54,"speaker":"Jonathan Pageau","text":"Right, right."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":2411.54,"end":2459.98,"speaker":"Fr Andrew Stephen Damick","text":"It's, you know, for instance, when in Holy Week when there's kind of even moments of sort of reenactment, it's not just, now, let's just tell the story and then we'll have a kind of a commentary later. Commentary is happening the whole time. There's all kinds of, like, let's pause here at this and sing a whole song about it, you know, which kind of doesn't make sense in terms of the sort of action movie way of telling stories we're more used to now. But it makes total sense in a more mythological way of telling story in which it's a communal experience that's repeated over and over. And so then the funeral dirge of Boromir becomes part of the story. Not because that's what happened in the moment, like it couldn't have happened. Right. It just doesn't humanly make any sense."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":2459.98,"end":2460.46,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":2460.7,"end":2461.5,"speaker":"Fr Andrew Stephen Damick","text":"You know, they didn't."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":2461.74,"end":2484.82,"speaker":"Jonathan Pageau","text":"I totally agree that some of my favorite moments during Holy Week are those moments where there's that, you know, at the crucifixion of Christ, there's a deep mourning of. Of Christ's death. But then it's almost there. It's still. They're telling us. Well, he's gonna. He's coming back and they're calling. Like, we're calling, like, resurrect. Resurrect. Like, we're calling to Christ to resurrect. And so it's. It's."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":2484.82,"end":2485.34,"speaker":"Fr Andrew Stephen Damick","text":"It's."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":2485.34,"end":2542.82,"speaker":"Jonathan Pageau","text":"It is. It's a very different way of telling a story. And it is like this cyclical kind of. We know it's going to happen. We're still participating it. Participating in it, and it's transforming us. But we know the telos of this thing, you know, and so it's. Yeah, I totally agree. That's a very. It's a very different way of telling stories. And it's something that we, you know, this idea of the shock ending or this idea, like you said, of the spoiler, is something that ancient people didn't care at all about because participatory storytelling. And so you just enter into the story and you kind of enact it. Even when they would tell the stories of. You know, when people would tell the stories of the Iliad or the. Or they would tell poems of ancient Greece or whatever, you know, there was this. Everybody knew was gonna happen, but it was. They still are going to hear it every year or, you know, several times a year. They're still gonna enter into it and know that it's their story and that they're engaging in it."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":2542.9,"end":2719.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And within that context, then novelty, which still has a place, becomes about delighting and about finding a new angle to see the story. You know, so, for instance, within the church year, there's new hymns that are written, you know, that have to do with the exact same events that we've always been talking about. Right. And, you know, why is it that with, you know, this massive corpus of stuff that's been published after Tolkien's death, why is it that people want to read, like, five different versions of Baron and Luthien? Because it kind of doesn't matter that even they don't even work with each other in time. I mean, it's still kind of one story. But like, for instance, Beren and Luthien in the Silmarillion, Beren is a human. He's a man. But in the sort of novel version, so to speak, that just came out within the past couple years, Beren is actually an elf, which radically changes the whole story of Beren and Luthien, because kind of the whole deal, or so we thought, was that Luthien, an immortal elf, joins himself to Baron, immortal man, and so then she accepts death Right. Well, that's not how it works out in the version. You know, it's not, it's not the same story exactly. And yet the fact that we kind of approach it from different angles and even some of the details don't match up. Yeah, that's okay. Within a mythological way of telling stories. And if you think about just the four Gospels. Yeah, of course there's not a perfect harmonization that can happen with all of the details in the four Gospels. And you know what? That's okay. Yeah, that's okay. And it wasn't, I would say it wasn't even expected in the first century that that was the way you would tell storytelling. Like, let's make this into the kind of thing that is perfectly consistent, you know, for a court of law, you know, so. Yeah, yeah, there's, there's, like I said, it's funny because, I mean, I've been Orthodox for over 20 years now, but I've been the whole time kind of gradually working out how it is that my experience of Tolkien's works prepared me for a liturgical life and continues to deepen it. Right, it continues to deepen it over and over and over again. You know, like I'm a priest, so my job is to stand at an altar and offer up a sacrifice of bread and wine. That is sort of the key core thing that I do with myself. And, you know, the idea that I would stand there on the threshold of the transcendent and make this connection not on behalf of people, like they're not there and I'm doing it instead of them. I'm not a proxy, but rather that I am at the head of them and saying, now come, follow me. You know, in some sense, you know, isn't that kind of sacrificial action a very much a sort of a Gandalf way of being? You know, Gandalf's job is not to solve everybody's problems. Yeah. You know, Gandalf's job is to point them towards ultimately the will of the one God, you know, which in Tolkien's world is called Yru Iluvatar."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":2719.46,"end":2724.38,"speaker":"Jonathan Pageau","text":"Yeah. Although he doesn't does that by bringing them along on the story. Like taking them into a story."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":2724.78,"end":2730.22,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. And of course, then there's even within the story itself, you get moments where people reflect on the fact that they're in a story."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":2730.3,"end":2731.26,"speaker":"Jonathan Pageau","text":"Yeah, I know. That's right."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":2731.26,"end":2762.77,"speaker":"Fr Andrew Stephen Damick","text":"It's not sort of the pulling back, you know, removal of the so called fourth wall, like in theater, but there is a sense of like, we're part of a great tale, you know, and that again, sheds another kind of light on what it is that's happening, you know. So, yeah, I don't know. It's endlessly delightful. And I think that delight actually calls forth from us the deepest part of who we really are. There's something about delight that does that."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":2762.85,"end":2814.57,"speaker":"Jonathan Pageau","text":"All right, I think that you've basically wrapped up our discussion. This is a great time to finish it because it's on a nice high point. So, Father Andrew, I really appreciate you coming here and discussing this with me and I would want to call everybody to check out amunsoul podcast and Father Andrew's other writings and his other podcast. For all of you that are interested in stories and are looking at Christianity, trying to figure out what it means to get into that story, what it means to live inside the Christian story, I would say that here are some interesting hints for you to discover that. So, Father, I hope we can do this again. Once the podcast is going for a little while, we'll bring you back and hear some more stories of how it's."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":2814.57,"end":2818.29,"speaker":"Fr Andrew Stephen Damick","text":"Affecting people and you have to come and be a guest on it."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":2818.77,"end":2823.62,"speaker":"Jonathan Pageau","text":"Sure, yeah. I am not Tolkien expert."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":2823.78,"end":2824.18,"speaker":"Fr Andrew Stephen Damick","text":"Good."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":2825.86,"end":2839.06,"speaker":"Jonathan Pageau","text":"So, yeah, sure, send me a message and I will be there. So everybody, thanks again for your attention. I hope you enjoyed our conversation and I'll see you soon. I hope you enjoyed this episode of the Symbolic World podcast."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":2839.46,"end":2844.82,"speaker":"Jonathan Pageau","text":"As you know, these podcasts are all versions that of videos that I put out on YouTube."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":2844.9,"end":2850.71,"speaker":"Jonathan Pageau","text":"So if you want to see more, there are a few videos that I don't put up. So if you want to see more of what I'm doing, you can check."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":2850.71,"end":2857.47,"speaker":"Jonathan Pageau","text":"That out on my YouTube channel. The link is in the description of the podcast and I hear also that."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":2857.47,"end":2859.51,"speaker":"Jonathan Pageau","text":"If you do want to help the podcast, one of the ways you can."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":2859.51,"end":2862.91,"speaker":"Jonathan Pageau","text":"Do that is to go to wherever it is you're listening to podcast and."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":2862.91,"end":2867.71,"speaker":"Jonathan Pageau","text":"Leave a five star review. Supposedly that is quite helpful so that."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":2867.71,"end":2871.63,"speaker":"Jonathan Pageau","text":"The podcast gets suggested and promoted and put out there."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":2871.71,"end":2873.75,"speaker":"Jonathan Pageau","text":"So once again everybody, thank you for."}
{"episode_id":"SW - #057 - 2019-09-18 - Fr. Andrew Stephen Damick - JRR Tolkien and The Applicability of Stories","start":2873.75,"end":2875.63,"speaker":"Jonathan Pageau","text":"Listening and I will talk to you soon."}
