{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":0.16,"end":49.41,"speaker":"Jonathan Pageau","text":"And I just remember, even when I was super young, like 17, I went to this conference about the flood. And I'm standing in front of this, like, you know, post grad, whatever student giving us a lecture on the flood. And she said, there's a version of the flood in every single culture. And then she said, that's the proof that it didn't happen. And I was like, what does that jive together? Like, how is it that this is a universal story, but you're using it to tell me that the Bible story isn't true? And I'm like, there's something missing here. And so then I came to really understand symbolism just basically as the patterning of reality. This is Jonathan Peugeot. Welcome to the symbolic world."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":59.39,"end":99.77,"speaker":"Sarah","text":"Hello, everyone. This is Sarah from Hamilton, and I am very happy to say that today we have Jonathan Pageau on the channel, and we have him here to talk a little bit about his perspective on symbolism theology, what the Orthodox Church uniquely has to contribute to the discussion about the role of symbolism in interpreting creation, the way that relates to biblical theology. And especially I want to talk about his perspective on universal history and the way in which symbolism frames our understanding not only of the history, the. That we find in Scripture, but also the history of all nations and how they're brought into the community of Christ. So welcome, Jonathan, to the channel. Thanks for being here."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":99.77,"end":105.53,"speaker":"Jonathan Pageau","text":"It's great. People don't know. This has been a long time in the making. We started exchanging like a year, more than a year ago."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":105.61,"end":106.17,"speaker":"Sarah","text":"About a year ago."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":106.17,"end":107.45,"speaker":"Jonathan Pageau","text":"So it's good that this is happening."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":107.53,"end":117.77,"speaker":"Sarah","text":"I know. Yeah, it's a real blessing. So tell us a bit about yourself, your background. How did you get into Orthodoxy and this particular way of framing theology?"}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":118.88,"end":205.86,"speaker":"Jonathan Pageau","text":"Yeah, so I grew up in, you know, in Quebec, which is a pretty secular place, but I grew up in a evangelical world. My father was a Baptist minister who converted from Catholicism kind of at the. In the 70s. So it's interesting because my. I grew up in a very intellectually honest and curious home. My father was always asking questions, always thinking. So we kind of grew up in that. That space. And I think that's what fostered both my brother and I's. You know, when we reach our late teens and twenties, we started asking a lot of questions and started wanting to understand Scripture more deeply. And that's what led us into our exploration of symbolism, in my case, more the exploration of art, because I was studying to become an artist and just struggling to square that with my, my evangelical faith, but then also with the world of contemporary art. And so discovering traditional Christian art really was a revelation to me. And then through that and through reading the Church Fathers, especially certain fathers, of course, St. Gregory of Nyssa and St. Ephrem, you know, St. Maximus the Confessor, really kind of discovering the idea. And my brother was reading a lot of rabbinical texts at the time, and so really discovering in some ways the Bible as a. As a worldview rather than just as a text to be interpreted from, you know, rationalist point of view. And so trying to see the Bible as a pair of glasses, you know, rather than, like I said, something to interpret. So. So that's what kind of led me on this path to, To. To understanding biblical symbolism."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":206.18,"end":213.62,"speaker":"Sarah","text":"So did you ever have a crisis of faith where, you know, you weren't really sure whether Christianity was true or was it a smoother process than that for you?"}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":214.42,"end":266.41,"speaker":"Jonathan Pageau","text":"It's interesting. It's like. I wouldn't say it was a crisis of faith, I would say, but it wasn't. I guess in ways that was the problem that I was in my 20s, I was reading, trying to. I was. Had this intuition of mysticism and intuition of. Of a more mystical approach to, To. To the, to religion, let's say, first. And then. But at first you end up reading Gnostic texts, right? Because that's what is shown to you. You read Buddhist texts and Sufi texts, and then you're like, what's going on? Like, how is it. Because I knew I was a Christian, I was like, how can I be a Christian? And then I find something that's interesting, you know, in the. In these kind of strange texts. And obviously, after a while, I discovered that, no, it's all there. It's all there. And in the Church Fathers, like anything of value that you can find in these kind of more esoteric traditions is there in the Church Fathers. And, you know, and then you don't have to deal with the weird stuff that comes with these kind of esoteric traditions."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":266.41,"end":269.37,"speaker":"Sarah","text":"So you converted to Orthodoxy around that time?"}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":269.45,"end":311.3,"speaker":"Jonathan Pageau","text":"So, yeah, I converted to Orthodoxy in 2003, started going to an Orthodox church around 2001. And yeah, when I read. So I read a text called Tradition and Traditions by Vladimir Loski. And it's weird because it's a pretty technical text, but it. That really nailed it for me. It really encompassed, you know, my vision of what I. How I saw revelation, its relationship to art and to external, you know, how the internal, the external fit together, you know, how silence and word into body and. And space works. And so it just was such a, a revelation for me that, that I read that text and I, it's like I kind of knew already I was Orthodox, I was going to become Orthodox, and then it was just a question of playing it out."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":312.02,"end":315.3,"speaker":"Sarah","text":"And were you a big Bible reader as a, as a young person?"}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":316.9,"end":360.95,"speaker":"Jonathan Pageau","text":"Maybe not in the same way that Protestants had kind of wished I was. You know, like how they want you to read like certain chapters a day or whatever. I was never into that so much. Like, I did have a deep love of, of Christ and a deep love of Scripture. And I also, for some reason have a good memory. And so it's like I kind of have a map of the Old Testament in my mind. There are some places that are a little, that are a little hazy, but I have this map in my mind. And so, so I, yeah, I do read the Bible, but I'm not like, even when I was young, I wasn't one of those. Like, it was interesting. Like, I didn't like the idea that in some ways that the reading of scripture was like the ritual that replaced whatever traditional ritual had been there in the Catholic Church. And I found that weird. But."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":360.95,"end":372.03,"speaker":"Sarah","text":"Yeah. Okay, so what is the big idea then behind symbolism? What do you mean by symbolism? And, you know, how does that actually play out concretely, you know, when we're just living our daily life?"}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":372.03,"end":522.58,"speaker":"Jonathan Pageau","text":"Our daily life, Mundane lives. Yeah. So I think, and this is some. I mean, you probably told. We, we. I'm sure we 100% agree on this. It's like there's a problem that we had in, I would say, 19th century type Christianity and then early 20th century Christianity is because of, because of materialism. For some reason there's this tendency to emphasize that, this historicity aspect. Like, it's like, you know, people go out into the desert, they find these statuettes and they find these old texts and, you know, they're having all these technical arguments about whether or not something happened and how did it happen. And, and you know, like, is Moses, is that his actual name or is it like a name that was handed through tradition? And all these type of arguments which I always found just so boring. Like, I just found them so boring when I was, when I was younger and didn't care much for that. But then there was also this other strain up which was kind of liberal Protestantism, which was trying to show these patterns in scripture and how there's literary patterns in scripture and they were even doing it in a way to discount the historicity of it. Right. So it's like I can see a pattern in the story, therefore it didn't happen. And I just remember, even when I was super young, like 17, I went to this conference about the flood. And I'm standing in front of this, like, you know, post grad, whatever student giving us a lecture on the flood. And she said, there's a version of the flood in every single culture. And then she said, that's the proof that it didn't happen. And I was like, what? How does that jive together? Like, how is it that this is a universal story, but you're using it to tell me that the Bible story isn't true? And I'm like, there's something missing here. And so then I came to really understand symbolism, just basically as the patterning of reality is that, you know, we experience the world through patterns. There's no way around it, you know, if you want to tell the story that there has to be a beginning and an end. And therefore the way in which, let's say, the infinite details of the world condense together has to be teleological. And therefore it has to have a structure. And that structure is not is the structure of your life, it's the structure of everyday life. Now, the difference between your everyday life and let's say a movie or a movie and a Bible story is that there's a condensation which happens. And there's also like a focusing on stories that are epically manifesting that truth, right? And so, like, the stories in scripture, they're made out of the same stuff as your everyday life. It's just that they point them, you know. You know, it's like a burning, shining light on how God reveals himself in the world. And so that's the way that I understand symbolism."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":523.38,"end":564.55,"speaker":"Sarah","text":"It's interesting that you mentioned that your brother was reading Jewish texts when you were kind of working on this, working through this stuff together. Because one of the things that really strikes me about certain trends within contemporary Orthodox Judaism is the way in which they emphasize the fact that the mundane is precisely where we should expect to find God most intensely. Right? Because if the world is really created in its entirety by God, then we shouldn't expect to find him more so in the kind of obscure, esoteric parts of the world. But it's in the most common things in creation that we meet God most directly. So, you know, being the preeminent example."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":565.21,"end":586.77,"speaker":"Jonathan Pageau","text":"I think that that's probably true. But there's also a reality to the reason for tabernacle worship, for example. It's that the structure of Tabernacle or temple worship is there to focus. Like, it's there to kind of focus so that you can see it. And so the problem, I think that's because I hear that a lot. Like you hear that in kind of in, in kind of New Agey circles."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":586.77,"end":586.93,"speaker":"Sarah","text":"Right."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":586.93,"end":635.58,"speaker":"Jonathan Pageau","text":"It's like God is everywhere and all that stuff. And I think that's true. But, you know, there's a reason why we have a kind of hierarchy of, of. Of an order of, of manifestation, you could say. So it's so that it's to help us encounter God, you know, even in, in our daily lives. So I think both are true. It's like on the one hand, you know, tabernacle worship and temple worship, and also, let's say the, the order of a church, you know, the hierarchical order of a church is in some way like a type of anchor that will help you engage with God's presence in the world in a more concentrated and powerful way so that you can then in your everyday life, you know, have these moments of surprise where, you know, the grace of God just pops and just shines. And you, you have these, these moments of, of revelation in everyday, Everyday experience."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":636.3,"end":639.54,"speaker":"Sarah","text":"Yeah. So it's a way of focusing your eyes to see the world as it really is."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":639.54,"end":647.33,"speaker":"Jonathan Pageau","text":"Would you say something like. Yeah, or focusing your attention in general and your body and everything in your, Your attention is a good way. A good way to use that word."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":647.33,"end":670.03,"speaker":"Sarah","text":"Yeah, yeah. So you've made a fair few videos on kind of biblical theology or what I would consider, you know, biblical theology. How would you say that? You know, this project relates to some of the stuff that's been done by anthropologists like Mary Douglas on Leviticus or stuff like that. What is the relationship between biblical theology and what you're doing?"}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":670.82,"end":735.53,"speaker":"Jonathan Pageau","text":"I mean, I think the. What I'm doing, what I'm doing in some ways is just connecting. Like, that's what I think I'm doing. And so, you know, if you look at. And I don't want to cast any stones or anything, but like, let's say you look at something like the Bible Project, for example, like, what they're doing is great. Like, they usually get it right. Like, so many times they get it right, but then once. Then you'll hear sometimes as if there's all. They get it right in terms of the pattern and the story and the structure, like the cosmic structure in which the Old Testament is written. But then they all often will then express a confusion at like, how our world isn't like that. Right. It's like, so here's the structure of the Old Testament. Here's how it works, and it's like, well, you know, we understand it, but now, like, we basically don't live in that world. And I think what I'm trying to do is to tell people, no, you still live in that world. You really do still live in that world. And not only that, but you. If you just have. If you direct your attention in a certain way, you will notice that you can still have the same experiences and insights that are described in those texts."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":735.69,"end":767.91,"speaker":"Sarah","text":"Yeah. And one of the things that's striking to me about what you said about the way in which people argue against the historicity of certain texts is that it seems to me that when you look outside of Scripture, if you look at just Christian history, there are certain moments in Christian history which would lend themselves to being written in a typological or symbolic way. So the Battle of the Milvian Bridge, it has these analogies which are very strikingly parallel to what we read in Exodus. But it seems to me that the narrative itself lends itself to that kind of analysis."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":767.91,"end":777.99,"speaker":"Jonathan Pageau","text":"Yeah. And then what happens, which is hilarious, which you could imagine a historian saying, well, that must not have happened because it's too much like the flood story. Like, it's too much like, not the flood, but the crossing of the Red Sea."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":778.07,"end":778.47,"speaker":"Sarah","text":"Yeah."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":778.47,"end":848.32,"speaker":"Jonathan Pageau","text":"There's an interesting. Like, there's something that happened about 10 years ago which is a good example of this. So it's sad because it is related to our situation now, and it's sad. So when Pope Francis was first elected, he had the ceremony. I don't know if you saw it. He was standing there, and he had on his right hand a boy dressed in blue, and on his left hand a girl dressed in red. And both of them, they let go of these doves into the air. And the reason was because they were praying for peace in the Ukraine. So they were praying for peace in the Ukraine, and they let these doves go out in the air. And as soon as the doves were released, a white bird and a blackbird attacked the doves within seconds. And this is all like. There are, like, pictures of this. It's just something that everybody experienced. And so you could say, really, like, if. Is that not like a actual mythological event? I mean, that's a mythological event. And it. And it. Not only is it mythological, but it's showing itself to be truer and truer as time progresses. And so if you told that story to a kind of 19th century historian today, like end of 10 years, would they, they just tell you, no, that didn't happen because it's way too mythological in its structure."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":848.88,"end":873.46,"speaker":"Sarah","text":"Yeah. If you read, you know, Josephus's Jewish War, it's just filmed with these kind of narratives of all these omens which were happening and things and just recently, you know, in relation to Ukraine, I mean, who knows what's actually going to happen? But I saw people sharing this video of this huge murder of crows which was flying over Kiev and people, you know, were kind of spooked by it. But there's something in the wiring of the world which seems to actually create those correlations."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":874.66,"end":926.81,"speaker":"Jonathan Pageau","text":"And, but it's, it's, it's funny because people, some people who would listen to this would think, okay, now goo coo magic. Right. And so, but it's interesting to think like the people who say that what happens is because they think that human beings actually don't exist in the world, they think that human beings don't exist in the world and that the structures of human meaning are not connected to the way the world actually reveals itself. So because of that, they can't, they can't comprehend how there's a relationship between natural patterns and natural processes and things that happen and human consciousness and human meaning making. Right. You don't think it's weird when, like a bird knows when to fly south? Why do you think that's weird? You don't think it's magic? So if humans have a capacity to intuit patterns and they have ways of showing that, like, why is that so weird to you? I don't know why it's so weird."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":927.56,"end":965.46,"speaker":"Sarah","text":"Yeah, I mean, and people often say things like, well, we are pattern seeking animals. Well, of course we are. Because there are patterns in the world, we have to be able to seek those patterns. I mean, it's just, you know, it's a non statement really. So I wanted to also ask you how you see what you're doing relating to something like idealism, because I saw you had an interview with Bernardo Castro, which I thought was so interesting because I found him to be such an intriguing writer. And I never really thought of you guys in the same, you know, context, but it was great to see that you guys have connected or had a conversation. What's the relationship here?"}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":965.94,"end":1067.11,"speaker":"Jonathan Pageau","text":"So it's interesting, like a lot of people, how can I say this? A lot of people didn't totally understand what it was that I was trying to do in that conversation. And I get it, it's fine. It's Like, I'm not an idealist in the naive sense. I'm just not. Like, I do believe. I believe that the structure that's described in the Bible is actually the best way to describe it. Right. The notion of heaven and earth and that you have a pattern of intelligibility and a pattern of variability or of chaos or whatever. I think that is the best way to describe the world. Now, I think that what's interesting about Kastrup's idealism is that he collapses everything into mind. But the way he does it, he does it in a way that actually doesn't preclude the existence of what most people would consider matter or physical phenomena. And so because of that, I don't feel the need to argue with him on that. I just want to see, like, in his. In the way that. Because I do think that in some ways it's closer to. If you say something like all things exist in the mind of God. Like, I mean, that's a completely Christian statement. You know, it's a completely. There's nothing weird for a Christian to say that all things exist in the mind of God. And so if. Then after that, like, the way that we discuss can be, can be, can be differentiated. I mean, we just have to see the categories he's using and if they. If they create some kind of heresy or some kind of weirdness in them. And I think there's some things. Obviously I don't agree with Castro for sure, but. But I think there's enough to. To connect with what he's. What he's doing to. To help people understand the inevitability, at least of intelligence, of intelligence like that. That you cannot, the world cannot exist without something like intelligence or consciousness."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":1067.67,"end":1105.85,"speaker":"Sarah","text":"Yeah. And. And I think a lot of people take, when they hear idealism, they take that to mean matter is not real or matter is an illusion. But, you know, the underlying presumption behind that interpretation would be that matter is something that's fundamentally, you know, opposed to or totally separate from mind. Whereas what I see that kind of argument as suggesting is that no matter is real, but it's real in terms of the qualities that it has. And those qualities are mental qualities that are all under. That can only really be given content in terms of mind, in terms of consciousness."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":1106.01,"end":1134.22,"speaker":"Jonathan Pageau","text":"Yeah, but that's the problem. The problem is that there's a. There's an insidious notion about what we. What we mean when we use the word matter, which is this. This idea of this existent, existent stuff which has no qualities and it's like. No, no, that is like. That's out. Like, you know, when, when, when God describes, you know, when there's the description of heaven and earth in the first chapter of Genesis. It's like earth is emptiness and void. Right."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":1134.22,"end":1134.62,"speaker":"Sarah","text":"It's."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":1134.62,"end":1137.34,"speaker":"Jonathan Pageau","text":"It's not, it's not something that has no qualities."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":1137.5,"end":1137.94,"speaker":"Sarah","text":"It's."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":1137.94,"end":1150.71,"speaker":"Jonathan Pageau","text":"It's a kind of potentiality to exist in which the, the names or the identities, you know, come down from heaven onto. But it's like. So then matter doesn't properly exist. Exist. At least not the way that. Not in a simple way."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":1150.79,"end":1151.11,"speaker":"Sarah","text":"Yeah."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":1151.11,"end":1162.07,"speaker":"Jonathan Pageau","text":"Not, not in a simple minded way that. It's like this, this mud. Right. What do people talk about like the, the pre. Cosmogonic soup or whatever, the way they describe it like. No, no, sorry, none of that."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":1162.79,"end":1202.4,"speaker":"Sarah","text":"So before we get to the universal history stuff, I wanted also to ask you how you see your work as converging with and diverging from the stuff over at the Theopoulos Institute. Because they've had a huge influence on. Just the way I read the B. When I read James Jordan in 2014, it just kind of changed my life. It really introduced me actually to really this kind of pattern of thinking. And then when I found your work, it was so interesting because it seemed like these ways of thinking had kind of been articulated independently from each other. And now that you know there's some conversation going on, I'm interested to see how you think of what they're doing."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":1202.88,"end":1209.2,"speaker":"Jonathan Pageau","text":"Yeah, I didn't. I think what they're doing is great. And I've had. I did interview someone from Theopolis on my, on my channel."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":1209.44,"end":1210.08,"speaker":"Sarah","text":"Alistair."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":1210.51,"end":1300.04,"speaker":"Jonathan Pageau","text":"Yeah, Alistair, that's right. And so I think that, that what they're doing is great. I would say that the difference. And once again, like I don't want to. Like their scholarly work obviously is way deeper than anything I'm going to do. Like their attention to detail is. I have nothing to do with that. Right. So I need to be careful. Right. I. You know, but I would say that I think that would differentiates me from them is that I don't think they feel fully grasp the consequences of their main vision. So I think that if they grasp the consequences of their main perception about pattern and how that works, I think that there's some. I would think that there are some Protestant positions that could no longer be tenable. And that's what I do believe. And so I think that. That although I love what they're doing, it says like if you. You can see it, like, make some. If you want to, like, ask about Mary, right? Like, ask about the Mother of God. And then it's like, all right. And so I get it. I understand. But it. But if you're taking all these patterns that you see in Scripture very seriously, like, there's some things at some point that it becomes almost impossible not to see anymore. But I. I still. I celebrate what they're doing. Like, I celebrate their. The fact that they wanted to bring Protestants closer to liturgy. Like, they want to have Protestants celebrate the liturgical year. And so they have this. I think a lot of the stuff they're doing is positive, but I do think that's the big."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":1300.52,"end":1353.58,"speaker":"Sarah","text":"Yeah, yeah. No, it's interesting for me to see. You know, Peter Lightheart has. I don't know if it's just recently that he started saying this, but I've seen it put out some articles on the Virgin Mary as the new Eve or things like that. This. And when you. When you're thinking in certain ways, in scriptural ways, and when you recognize something like Eve is described on the analogy of the City of God, she's built. Like, the city is built in the next chapter. And then that kind of explains why our liturgical tradition is calling the Virgin Mary the City of God and why she's associated with protecting cities like Constantinople and recklessly intervening on their behalf. It all really rolls together in this beautiful way. And I think perhaps despite themselves, perhaps not, the more that they've put out over the years, read some of their early work from just the 80s, the less distinctly Protestant."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":1354.14,"end":1446.41,"speaker":"Jonathan Pageau","text":"It'd be interesting to watch, because I think that. So one of the things I've also noticed is that they hesitate to. At least in my experience. I haven't read that much of them, but they hesitate to cite certain Fathers, and they. They hesitate, you know, because of the allegorization, let's say, of Scripture and. And. And as if some of the typological readings they might see as arbitrary. And it's like, I get that, but I think that. So a good example would be, like, St. Gregory of Nyssa. It's like when you read the Life of Moses. And I. Because I was reading it recently for some. For an Exodus thing I'm doing. And so as you read it, he says things that, look, if you. If you're not careful, they look like he's just throwing it out there. So he says this, this. And then it's like, okay, I trust Sangreg of Nyse completely. So, so. So some of the things I'm doing is trying to, like, unpack the steps. Like, I'll unpack the steps for you. I'll show you, like, why the sandals that Moses removes from his. His feet at the burning bush are the garments of skin. And I can show that to you in the text in ways that Sangri doesn't. Doesn't go there. He doesn't have to. Right. Doesn't feel like he has to. But it's like, I'll go far. Like, if you can't understand the story of Zipporah circumcising Moses son and putting the foreskin on the feet, you know, it's like all these images, like, they're all there. It's just that St. Gregory doesn't necessarily tell you, but you can kind of point that out for people to help them kind of unpack some of the typology and show them that it is extremely coherent and very deeply set in the text."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":1446.89,"end":1509.08,"speaker":"Sarah","text":"It's interesting that you mentioned that text in particular, because I remember reading Life of Moses years and years ago and coming across that passage where he talks about being deified by walking behind God, in other words, by following him and how that work and it sound. It was so compelling as an image. But I had to kind of put it on the shelf as far as the text goes, because, like, okay, well, I believe this, but I'm not quite sure how to fit it all together. And then, you know, one evening a couple of years ago, I realized, wait a second. You know, halacha, you know, means to walk, right? And what does God say to Abraham? Walk before me and be perfect. And where is the walking being done? It's being. You're walking in the way of the Lord. And there's this theme of journeying behind God as he leads you through the wilderness. And Moses and all kinds of things about Moses, orientation in relation to God and his orientation in relation to Israel are happening in the text. And as you pointed out, the feet are so important. And then God's feet are described in all over the biblical text. And the way that that relates to just his activity and his pattern of."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":1510.02,"end":1529.22,"speaker":"Jonathan Pageau","text":"Yeah, because the glory of, like the pillar in Exodus, like, we have to understand that the pillar of cloud and the pillar of fire is the glory of God. We see it later, right, when the tabernacle described and it says, like, the pillar descends on the tabernacle. Like, that's the glory of God present in the tabernacle. So Israel is literally walking behind God leaving Egypt."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":1529.22,"end":1585.99,"speaker":"Sarah","text":"Yeah, yeah. And the classic phrase for obedience to God's instruction is turn neither to the right side nor to the left side. And then the chariot of God is moving in exact right angles. And then it fills Ezekiel and he's moving in exact right angles as well in the book of Ezekiel. And so all of these kind of steps, as you put it, are there in the biblical text. And then the church fathers, they just say the conclusions, like, I want to reconstruct all of this, but I guess that's the benefit of having an unlimited amount of paper or writing space. We can just say all these things now. We don't have to just throw it out there and leave it for people to figure out. So, yeah, that's really exciting. So, moving from biblical theology, Biblical theology, you're looking at the history mostly of one specific nation. Right. The Christ as he's embodied in the life of Israel. How does that expand outwards into universal history? And what do you see the project of universal history as fundamentally being about?"}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":1586.39,"end":1770.92,"speaker":"Jonathan Pageau","text":"Yeah, as people know, you know, Richard Rowland and I started this series which we call Universal History. And it really was interesting because I've been interested in this idea of universal history for years. Like, just really, really interested in. And then I met Richard Roland, who is like, he's not just interested. I mean, he. He's got it down. Like he just knows it. Right. He's just such a. He's. He has all the skills. I don't. Right. So he. So he has all the details and all the, all the text and everything, all the references. So the idea, like, let's say, in terms of the. For immediate understanding, is to see how, when people would convert to Christianity in, you know, in the history of Christianity, one of the things they tried. Tried to do was to connect themselves to the Christian story, usually, and also to Rome. It was like Rome and the Christian story. So how can I connect my ancestry back to the. The. The Trojan War? And how can I connect it to the Bible somehow, either the flood or some, Some character in Scripture. And, you know, when you look at, for example, Geoffrey Monmouth's text, you know, those first chapters, that's what's going on. But the problem is that all cultures kind of have that. Modern historians, what they do when they read these Chronicles, is that they just chop out the first part, ignore it as if it doesn't even matter, and then start with, like, the real history, and then see the rest as kind of mythical history. But our contention is that, no, the mythical history will actually be the pattern by which you'll be able to understand the regular History. Right. The connection that they give themselves to the ancients and the way in which they do it, the characters, even that they. That they say they're related to, will become a kind of first pattern which will then explain the rest of the. Of the stuff. And so I think that. So what we're trying to do in some ways is revive these actual existing universal histories. So you have, for example, the apocalypse of Pseudo Methodius, which is this kind of grand history of how all the peoples connect. And, you know, there's the place of Alexander the Great and Ethiopia and all these. These nations, but you see echoes of that, for example, like in the. In the history of Great Britain or in Scandinavian history. Different, different countries will have their own version of it. And so we're trying to, some ways bring that out, because one of the things that happens in these universal histories is that they will not. They won't have the tendency to completely deny their pagan sources, so they will connect both to the Christian source or try to reorient the pagan ancestry into a Christian thread. And I think that that's very useful for us to understand the way that Christianity was even understood by peoples that were converting. It's like, no, we're not. We're not trying to make you become something completely else than what you are. What we're trying is to reorient what you are into the. Into something which is good, into the good. And so I think that all of that can be useful for us today to understand how they did that, why they did that, and it can give us a key at understanding even why the west even exists."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":1771.8,"end":1780.76,"speaker":"Sarah","text":"So was there a particular nation or story which kind of stood out to you as a glaring example of this pattern, of this phenomenon going on?"}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":1781.32,"end":1908.04,"speaker":"Jonathan Pageau","text":"Well, I think the most glaring example is Alexander. I think Alexander is probably the one that is the most visible, because what happens in the story of Alexander the Great is, you know, because he's this great conqueror and he kind of unifies the world together. There are all these legends that end up spreading about Alexander and then they start to be collated and collected together. And one of them is, of course, they come from different countries, but one of them is that Alexander goes to Jerusalem and he encounters the priest of God. And when he encounters the priests of God, he declares the unity of God. Like he makes a kind of declaration that God is one. And this is a Jewish legend probably. I'm not sure they even know exactly where all the legends come from. But what happened with that is that because of that, Alexander is in the Quran. Like Alexander is a character in the Quran. And so Alexander then becomes this figure. So there's another story, for example, of Alexander who makes these. He takes these four griffins and he wants to see what's in the heaven. So he, he, he ties it like a rabbit, I think, to the end of a stick. And he, and he puts the stick up and then the griffins fly up to eat the, the, the, the, the rabbit. And he ascends up in the heavens. Then as he gets near the highest spheres, like towards the sphere of Saturn, I think he hears a voice telling him this is high enough, like a man should not go any higher. And so then he obeys the voice and comes back down. And so it's like this kind of mythological storytelling, you know, gets included in Christian storytelling. And so Alexander becomes an image of the righteous king who knows who is ambitious, who is. Who can manifest the positive aspects of the political class, but also knows his limit, like, knows where to stop, that he shouldn't transgress the, the boundaries of what it is to be human. And so that's a great, That's a good example. And then his legends become some of the most popular stories told in the Middle Ages all across the world, from, from England to India, basically."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":1908.44,"end":1909.4,"speaker":"Sarah","text":"Wow. In the India?"}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":1909.56,"end":1962.71,"speaker":"Jonathan Pageau","text":"Oh, yeah, yeah, they're Indian versions of the, of the, of the also. It's also because of Islam, like the, there's an Islamic, you know, because of the Mogul Empire. You have these, you have these, is these, these versions. I went to see a show in London, by the way, a few, like a month ago, which had all these legends, like all these, these manuscripts from everywhere in the world and all these different versions of manuscripts. Like, it was, it was an astounding show. Like, I was so, so happy to be able to see it. And yeah, there were versions from, from basically all the way into Persia because, you know, you took over the Persian Empire down into India. There were versions from, from Byzantine Empire. There's a whole massive. One of the, the most eliminated manuscripts of the Alexandrian legend is this massive Byzantine book that has the whole legends all illustrated very much like icons. Like, they're, it looks like icons, but it's the story of Alexander. It's, it's amazing."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":1963.19,"end":2012.16,"speaker":"Sarah","text":"One of the images that I found really intriguing in just looking at what the church is doing or has done in relation to specifically Greek culture is that, you know, image in the prophecy of Noah as God enlarging Yapheth and bringing him into the tents of Shem. And it's really interesting to me that, you know, Paul, whose profession is a tent builder, is the one who specifically sees himself not just as uniting Jews and Gentiles, but he's always using that phrase, Jews and Greeks. And it seems to me that that's something that's really integral to the church's mission. When they convert a p. When a people converts, it's not just that their history is now kind of cut off and they start new at that point, but they're actually bringing something in, something which God has been growing in them for a long time. And it's part of the church's mission to, you know, bring that into the body of Christ."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":2012.72,"end":2066.24,"speaker":"Jonathan Pageau","text":"And so I think, I think that's exactly right. And I think that that's in some ways representing that story and representing the reality of it in the legends, right? In the, in all this, this gathering in of the, of the ancient stories, you know, is a way to also answer the, the, the secularists or answer the atheist who, who says Christianity is just, just wiped out the old practices or, or, you know, it's like, that's just not. It's interesting because you have both. It's so fascinating. On the one hand, you have some people that are accusing Christians of wiping out all the ancient practices of, you know, of being these horrible, you know, controlling civilization bringers. And then you have the other people saying, ah, Christianity is just infected with all these pagan practices. It's basically just a pagan religion with, with a Jewish veneer. It's like, okay, we'll choose which one. You know, I don't know. It seems like it's actually somewhere in the middle where it's exactly the way we're describing it."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":2066.48,"end":2078,"speaker":"Sarah","text":"And so what does this mean then for an American? If you're an Orthodox Christian living in Appalachia or Southern California? What does universal history have to say to you?"}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":2080.16,"end":2243.3,"speaker":"Jonathan Pageau","text":"It's interesting because you could actually see it in the very way that orthodoxy manifests itself in America, which is that America, man, this is. People are not going to take this the right way. Please wait till I finish the argument before you react to this. So America is something like the end of the world, right? America is the end of the world. And because it's the end of the world, it manifests the extremes. One of the extremes that America manifests is something like the horror in Revelation. Okay, so this idea that America is a land of, of excess, a land of mixture, a land of lack of cohesive identity is something which is true of the way in which America exists, okay? So it's hard to avoid that. And so what happens, it's negative, but it's not just negative. It's just reality. It's just a description of what is there. And so the way in which Orthodoxy manifests itself in America is like that. It's. It's a little confused, right, because it's trying to preserve all these separate churches inside of America without having the capacity or will to join them together into the single church that they should be. And so we have to be, I think, as Christians, as Orthodox Christians in America, we have to not be naive about that and understand that that is the reality of Orthodoxy. In the end of the world, you could say, right at the end of the world, that's what happens. And so although it's a problem, there are some advantages to that as well. There are some aspects of that which can be used, or at least being aware of it can help us. And so there is a possibility in America, and I see it, like, as an artist, I see it, we also have the possibility of synthesis, which other places don't have the possibility of. So you can understand that. You know, let's say if I was a Russian, if I was, as some people have described me, a Russian Orthodox icon carver, right? Then I would have this one tradition, which would be the Russian tradition, and I would have to see myself in continuation of that. But I'm not. I'm an American orth, North American Orthodox icon carver. And because of that, I actually have access to all these threads that are coming down, and I have the possibility that other people don't, of retying them together in a way that reveals something universal about the Orthodox tradition. So I think that that's the advantage of American Orthodoxy, but it's also born of something which is clearly a disadvantage, which is this problem of multiple jurisdictions kind of coexisting in the same space."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":2243.62,"end":2320.15,"speaker":"Sarah","text":"That's a really exciting image for me as someone who's into biblical theology, because it seems that the two kind of competing ends of the moral spectrum, you could call it, are two kinds of mixtures, right? So you can have, like, a mixture, like an image of Baphomet, where it's just obscene. You have all of these different categories which are kind of locked onto each other, and it's diabolical. But then the high priest's garment is just a mixed fabric from top to bottom, or the tabernacle or the temple, it's got all of these different kinds of things which are being brought together. Or you have the land of Eden in the land of Havilah, and you're bringing the resources of both of them together, and it's integrated into something holy. And that's the imagery of the restored Zion and the prophets of the nations coming from the ends of the world to put all of this different stuff on one in the same altar and relating it appropriately to each other. So I think that. And the image of the whore of Babylon is an interesting one because, of course, the inverse of that is the bridegroom Zion. Right? Yeah. A different kind of mixture. Yeah. So that's a really intriguing, I think, productive way of framing both, like the challenge, but also the opportunity of living in this wild, weird place."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":2320.71,"end":2351.04,"speaker":"Jonathan Pageau","text":"Yeah, well, we. The way that Christians, I mean, we have something in Christianity which we call union without mixture. Right. The sense that we have the possibility in Christianity of joining things together without confusing them. And so. And I think that in Revelation, you have two images of that. Yeah, you have two images of civilization. You have one which is a whore riding a beast. Right. That's a one image, and that is the excess of both. Right. The. The excess of civilization, which is controlling, which is devouring, which is naming."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":2351.12,"end":2351.4,"speaker":"Sarah","text":"Right."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":2351.4,"end":2391.52,"speaker":"Jonathan Pageau","text":"It's like, I'm going to give you a name that you can't. That if you don't, you don't use, you will be eliminated. And on writing, that is licentiousness and chaos and mixture and all this stuff. The image of the heavenly Jerusalem is a beautiful image of multiplicity and unity, collaborating. Like it actually says that, you know, the, The. The kings of the. Of the world or the kingdom of the world offer up their crowns to the city. And so it's as if this gathering in of all that is good from all the nations into one space, that is. That is all attentive to the Lamb. Right. That's all attentive to. To God, ultimately. And so it's like that's. I think that's the image of kind of symphony that the church can become."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":2392.64,"end":2401.08,"speaker":"Sarah","text":"So let's say that you're a missionary in a foreign country. If you have something to say. If you don't have anything to say."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":2401.08,"end":2402.2,"speaker":"Jonathan Pageau","text":"No, no, no, go for it."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":2402.2,"end":2419.55,"speaker":"Sarah","text":"If you, if you're a missionary in a foreign country, is there a way to kind of utilize this way of thinking in such a way that it's not arbitrary, or you're not trying to tell people their own story, or is it something that just has to kind of arise organically of a Christianized culture?"}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":2420.27,"end":2552.49,"speaker":"Jonathan Pageau","text":"Yeah, that's a tough One. Because one of the problems of the modern world is the acceleration, of course, and the hyperconnectivity. And so in some ways, it's difficult. I think that traditionally these things happen very organically, you know, So I think that, you know, I think that, for example, the evangelization of Russia, it was like. I mean, the tremendous task of, like, creating a new language and. And kind of giving that language to the roof so that they could have some kind of cohesion was a very powerful thing. And then what happened is that that inevitably became flavored or connected with the local culture. So there's an interesting image that St. Ephrem the Syrian uses when he talks about the waters of paradise. He says, the waters of paradise, right. When they start at the top of the mountain of paradise, they're pure. And as they move down the mountain, they become more and more mitigated. But although they're mitigated, they're nonetheless right the influence of the mountain down at the place where they are, but they end up becoming mitigated. And I think that that's probably the best way to understand how Christianity should connect to local cultures is that it's like you establish the source, and then the source flows down and starts to water the lower parts. You know, the. And that happens in a way that the water become mitigated, but they don't lose their. Completely lose their flavor. But the problem today is that everything's so deliberate, it'd be hard to. So for a good. A good example would be, let's say I'm. I'm a Greek missionary. I go to Russia, and then I convert the Tsar, and I'm like, yay. All right, so now I want to build a church. So it's like, I'll get maybe a few guys from Thessaloniki or from. From Constantinople to come and build the church, but I'm going to need the local materials. I'm going to need the local people. So the flavor of the church will become Russian very fast. But now you could just prop a church. You can prop an Athenite church down anywhere in the world, and it'll look like it just sprang right out of the. Of the mountain. So there's a way in which technology and modernism makes it more difficult for that to happen naturally. We might have to be more deliberate about it, you know, if we. If we were doing that."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":2552.57,"end":2613.61,"speaker":"Sarah","text":"Yeah. And you can see perhaps, you know, divine providence in that. As you have to be more intentional about this kind of stuff, that brings it more and more to your awareness, which allows you to see the actual significance and what's going on there. One of the images that. I don't know if you. Have you ever read the book the Patient Ferment of the Early Church? It's one of the images which was striking to me about that, you know, was that of fermentation and that it's a process which, you know, begins kind of invisibly, but then as you get towards the end, it speeds up very, very rapidly. And then soon you've got a fermented drink. And it seems that, you know, as we've entered into the modern world with interconnectivity and all that kind of stuff, a lot of these things which used to happen very slowly now just happen like that. Yeah. And even though it looks less organic to us, it's just. It could be. You could see it as the same sort of process, but just going on at an incredibly quick speed relative to where it used to be."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":2614.01,"end":2664.88,"speaker":"Jonathan Pageau","text":"You can see, like, the churches in Africa, like the churches in Ghana and stuff like that. You can see how now the church has been there for a few generations, and so all of a sudden the tonalities will be different. Like, you can still hear it. It's connected. It's still connected to, let's say, to Byzantine culture, but it has. Like you said, it's fermented. And so now the tonalities are different, the rhythms are slightly different. And so there's this slow embodiment, you know, within the. The culture of the source. But it. It's. It's hard because of political pressure today. We would want to do it very fast, but I think if we do it too fast, we can also run the risk of making major mistakes. So I don't like. I. In some ways, I have great mercy on the missionaries that are out there, because how do you find the right. That right balance, you know, how do you find it? I don't know."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":2665.04,"end":2703.05,"speaker":"Sarah","text":"Yeah, yeah. I know when I was in Kenya, this was a number of years ago. I remember at the cathedral, one of the interesting things, as you mentioned, the tonality was different. I know that the archbishop there was very intent on getting the liturgy translated. Not just Swahili, but also all the tribal languages. Languages and stuff. But I remember during the Eucharist, and I'm not commenting one way or the other on this, but I remember the Eucharistic Kim was nothing but the blood of Jesus, which was so interesting to me, just in terms of the way that actually, you know, cashes. I mean, it's a good you know, it's good Eucharistic him as far as it goes."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":2705.13,"end":2771.98,"speaker":"Jonathan Pageau","text":"Yeah, I wasn't. So I lived in Congo for four years, and I had the opportunity to. To be in the. In the jungle, like, in the. For almost in the forest. When. For Pascha. One year I was there during all Holy Week. And so. And I didn't even know I was able to go to church for. For. For. For the service. But then someone I knew found a church for me, drove me there Saturday afternoon. And it's like, there's this church, like. Like I said, this one was definitely. And it's been fallen out of heaven from Thessaloniki. And it was just like, there. And. And I went in as, like, frescoes, like, Greek frescoes everywhere. And everything was so Byzantine, like, and very well done. Like, very well done Byzantine. But then it was only, you know, when we got to. When we started to kind of celebrate the Resurrection, we started saying Christ is risen. Then it was like, okay, then Africa started to appear, and, like, women started utilating and, like. And everybody was like, was. Was making noise, and I was like, okay, I'm back. We're back. You know, So I think that these things, like, yeah, they'll break out. Like, no matter what the missionaries try to do, the more connected pattern will break out. Ultimately, you can't totally stop it."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":2772.14,"end":2800.97,"speaker":"Sarah","text":"Yeah. Yeah. So I think you have a pretty substantial part of your audience which is not Orthodox. I mean, I know just a lot of Christians and just a lot of interested, relatively secular people. Watch your content. What do you think? What makes the Orthodox Church unique as kind of the heir of this symbolic interpretation of the world? And what makes Orthodox the home of people who would see the world in this way?"}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":2801.37,"end":2831.08,"speaker":"Jonathan Pageau","text":"I mean, I think that there's a practical way which is, in some ways, the Orthodox Church has just preserved this language more. I think that if you'd gone back a thousand years in the west, you would have found similar structures in terms of the liturgy and the architecture and everything was all there, and typological reading was all there. But I think that ultimately there's a reason why Orthodoxy was able to preserve this, and it is the image of theosis. And I think that theosis is the key."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":2831.24,"end":2831.56,"speaker":"Sarah","text":"Right."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":2831.56,"end":2846.2,"speaker":"Jonathan Pageau","text":"It's the key to understanding that the world is full of his glory. And we're not kidding. Like, we're not joking about this. We do believe that God upholds creation, you know, that His Word is hidden in all manifestation, and that. That is not arbitrary."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":2846.2,"end":2846.64,"speaker":"Sarah","text":"That it."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":2846.64,"end":2888.62,"speaker":"Jonathan Pageau","text":"That it looks like something. It looks like love. It looks like order. It looks like a song. And so it's like. So. So I think that. That the. The centrality of theosis in Orthodoxy, I think, is what has preserved the possibility of. Of helping people see this and encounter it and practice it, you know, And I don't think that, because I do. I think theosis is real. So it's like. So how can I say this? Even though other Christians don't necessarily emphasize it or sometimes don't believe it, I still think that's what's keeping them together. So. So I do think that you can still encounter, you know, traces of that in other. In other Christian traditions, but Orthodoxy definitely has the. The greatest symphony of it."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":2888.94,"end":2945.02,"speaker":"Sarah","text":"Yeah, yeah. And I mean, I think you see providentially, I mean, in the history of Western theology in the 20th century, some people. I think people can miss just how deeply shaped a lot of Western theology was by the fact that you had all of these Russian emigre theologians coming over and in certain ways drawing out threads that were still there but were kind of dusty. And now you have people in the west talking about theosis in terms which would be very intelligible to the Church Fathers and to. To Orthodox theology today. And so I think that's really providential. And I think, you know, that's. To the extent that we can see what God is doing. It's just intriguing to me that lots of people seem to be independently or relatively independently talking about symbolism in the way that, you know, the Church talks about it in the way that you're talking about it. And so it's just."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":2945.02,"end":3021.43,"speaker":"Jonathan Pageau","text":"It's an example. It's not. That's not a coincidence. I think that we are in a kairos moment. I think that, you know, in some ways, the ground had. Was prepared for a very long time, and that, you know, you know, 20 years ago, my brother and I were talking about these symbolic ideas and patterns and everything, and we couldn't talk about it with anybody. You just couldn't. Because not only did they not understand what we were saying, they didn't understand the subject, like, what exactly we were talking about. And so now we find ourselves in this moment where, like you said, independently, in some ways, these kind of fruits have grown up. I don't know why. I don't know exactly how that happened, but it feels like, like all of a sudden I can talk about things and you can talk about things, and people know what you're talking about. They understand it, and it's coherent. And, you know, you can talk to Bernardo Castrop and you can say something like, you could say something as crazy as, you know, the son of man sits at the right hand of the father. And he'd be like, yeah, yeah, you know, I get it. You know, I get it. And it's like, how did this happen? Like, how can I talk about logos and talk about, you know, this type of, this type of imagery? And then, you know, even a scientist will understand the structural relationship I'm trying to make and we'll, we'll be able to at least cap. At least understand that I'm not just spouting off woo woo magic."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":3021.51,"end":3022.03,"speaker":"Sarah","text":"It's."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":3022.03,"end":3025.91,"speaker":"Jonathan Pageau","text":"There's a structural reality here to what I'm talking about, if you can see it."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":3026.39,"end":3032.64,"speaker":"Sarah","text":"So where do you see this going, if you have any thoughts on that in the next 10, 15 years?"}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":3032.96,"end":3056.96,"speaker":"Jonathan Pageau","text":"Yeah, well, yeah, I think things are going to get a lot darker, I'm sorry to say. I don't think. I think things are going to get a lot worse. I think a good way to explain what's happening now is something like. Something like a. There's a re enchantment that's happening. But that the re enchantment is not just good news. It just means that the barriers that materialism had placed around reality are breaking down."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":3057.3,"end":3057.54,"speaker":"Sarah","text":"Right."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":3057.54,"end":3105.61,"speaker":"Jonathan Pageau","text":"Like the, the materialist barriers that were kind of that work that held things together for a while, that made us really proficient in creating machines and civilization and everything that. That's starting to fray and crack. And then, you know, narrative reality is, is flooding back in. And so I think we're going to see very dark things on the horizon. But I do think that at the same time, it is the ground in which a revival or whatever you want to call it of Christianity will happen. And so I do think what we'll see is we'll see the seeds grow in terms of a deep understanding of Christianity, but we'll also see the world around us becoming more and more hostile to it and more and more dangerous. So, sorry, I see very. I see light in the long term and a lot of darkness in the short term."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":3105.69,"end":3140.57,"speaker":"Sarah","text":"Yeah, well, that C.S. lewis, you know, he mentions how at different stages of the great conflict between Christ and his enemies, you know, we fight that battle in different ways. And so when people stop taking naturalism seriously, I mean, seems certain dark things no longer have a motivation to operate in a concealed way. More kind of direct conflict that's more visible and scarier. Yeah, yeah. So let's wrap up by talking about where you're going next, what's what's on your horizon? What projects are you working on?"}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":3140.89,"end":3203.47,"speaker":"Jonathan Pageau","text":"So, I mean, one of the things that I'm mostly interested in doing now is telling better stories. So I, you know, I wrote a graphic novel, and I'm also writing fairy tales right now. That's kind of what excites me because I. I talk about we need better stories, but then I also don't want to just be the guy analyzing and complaining about how horrible culture is. So I think that's the thing that's really exciting that I'm part of. There are a lot of things happening in the next. In. Just in this year that are exciting in the sense that, you know, there are opportunities that. So, for example, like this. Just this. In the next few months, I'm going to speak at Princeton Seminary. I'm going to speak at Oxford, possibly Cambridge. And it's like, what? Right? What's going on? What's happening? You know, but it's like, okay, I mean, let's go. Let's do this, right? I mean, why not? You know, it's. It's like. And, and let's not, you know, let's not dance around it. Let's just. Let's just go. So. So in some ways, I'm excited to see people understanding what it is we're talking about and being excited about it."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":3203.47,"end":3203.79,"speaker":"Sarah","text":"So."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":3204.43,"end":3215.07,"speaker":"Jonathan Pageau","text":"So that's what, that's what. I think that. That's the thing that in some ways that. That kind of drives me too, because I'm like, wow, you know, so that's what's happening in the next."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":3215.71,"end":3222.56,"speaker":"Sarah","text":"In the next year, let's say, wow, that's really exciting. Did they reach out to you or."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":3222.88,"end":3293.89,"speaker":"Jonathan Pageau","text":"Yeah, so different. Different people reach out to me for different reasons. And it's, of course, let's be honest, like, it is in some part because of Jordan Peterson. So Jordan has been this strange kind of intermediary character where he's not really a Christian or kind of, I don't know, like, it's not totally clear at least yet, but he's pointing. And so I always say he's kind of like King Cyrus who says, you know, hey, that temple of yours, you know, that's pretty cool. You should go build it, something like that. So that's also help for sure, to attract attention to what I'm doing. And. And ultimately, hopefully to attract attention to this basic way of thinking. And so. So if that can happen and we can see, let's say, Bible scholars feel less because I'm not a Bible scholar. So it's Obviously, I'm not the one who's going to do the work, but I think that we can have Bible scholars understand that this is a key way of seeing the world, that that illuminates a lot of the. Of the biblical text. Then we're going to see a lot more. Right. We're going to see more of the scholarship, and also, like we talked about before, I think, ultimately, and hopefully more of understanding the consequences of this way of seeing the world in terms of liturgy, in terms of church, in terms of what it means in practice."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":3293.89,"end":3302.74,"speaker":"Sarah","text":"So. Yeah, well, thank God. And let's all pray for more light than darkness in the near future, in the far future."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":3303.3,"end":3321.54,"speaker":"Jonathan Pageau","text":"I have a question for you. What about you? Like, how do you see the role you're playing in terms of this? Because you're way more detailed than I am. Like, I watch my videos. I love just how much you master the text. And so what do you see that's in front of you? Like, what do you see as that which is calling you right now?"}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":3322.38,"end":3383.07,"speaker":"Sarah","text":"Yeah, I think I just have to focus in on biblical studies. Yeah, I go through these periods where, you know, I'll be all in on, like, biblical studies, and then it'll kind of expand outwards from there. But I want to really kind of dive deep and systematically in some very specific books. And God willing, I'll be offering some stuff this year on something like Exodus or Isaiah, just going line by line through the text and kind of doing the sort of thing we were talking about in terms of looking at the allegorical and symbolic meanings and kind of step by step showing, okay, this is why the text says this is how we can know that it says this, and then kind of framing that in certain contexts in an apologetic way. Like, this is how theosis is taught in the Bible. This is how we, you know, know that the church, you know, has an authoritative tradition. But doing that in such a way that it's not just, you know, a series of proof texts or here's you shouldn't be Protestant or whatever. And doing it in a way that is. That's beautiful, you know?"}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":3383.07,"end":3383.43,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":3383.43,"end":3418.18,"speaker":"Sarah","text":"So that. That. I mean, for me, I had a huge crisis of faith when I was in my early teens and then just struggled with doubts for many years afterwards. But it was when I really started to study the Bible in detail. I perceived this kind of beauty in it and this just coherence that seemed like it came from, you know, another world. And so I'm really excited about just showing that and showing how that works out. And hoping other people can be drawn into the world of Scripture."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":3418.66,"end":3431.3,"speaker":"Jonathan Pageau","text":"Yeah, that's great. And I think, like you said, I think it's a strange moment where that not only is possible, but it's like people are strangely excited about it. So we did this Exodus seminar. Right. You know about this. Like, we did this Exodus seminar for the daily work."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":3431.69,"end":3431.89,"speaker":"Sarah","text":"Yeah."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":3431.89,"end":3462.81,"speaker":"Jonathan Pageau","text":"And so we get around it. We got like, imagine pitching this to like a producer 10 years ago, right? We're gonna have seven people sitting around a table. None of the people are actual theologians. Like, none of the people are Bible scholars. And we're gonna talk about Exodus for 16 hours. And we're not gonna get through the book. We're just gonna get through half of the book. And then, like, then we're gonna get back together. I'm gonna do it again and we're gonna talk about the last part for 16 hours. It's like, try selling that. But turns out it's the most popular special on Daily Wire."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":3463.29,"end":3463.77,"speaker":"Sarah","text":"Yeah."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":3463.93,"end":3469.45,"speaker":"Jonathan Pageau","text":"And it's like. Because it's like people are hungry. They're like, give me something. Give me some food, man. Give me something good."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":3469.77,"end":3513.73,"speaker":"Sarah","text":"Yeah. And you know, I think some of the most profound insights that I've heard on a given passage have been from people who really don't consider themselves much of a Bible reader even. I mean, James Jordan once described how like a five year old girl said, if man turns to dust and the serpent eats dust, doesn't that mean the serpent eats people? And he goes, wait a second. Satan is a roaring lion seeking me may devour the idea of Satan eating the dead. Giants are people eaters and things like that. This is a five year old girl who, you know, puts things together that we wouldn't usually put together. And so it's super exciting, not just to help people see that, but, you know, to draw them in and help them produce insights of their own. Because it's an accelerating kind of compounding process. Process."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":3514.29,"end":3525.73,"speaker":"Jonathan Pageau","text":"That's great. Well, man, I'm happy. Hope you find it'd be good to do some of the, the more difficult books, man. Some of those books. Yeah, whoever has the guts to do judges, you know, do that."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":3525.81,"end":3527.01,"speaker":"Sarah","text":"Oh, yeah, yeah."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":3529.65,"end":3601.99,"speaker":"Jonathan Pageau","text":"But even like the, the. So I was interesting at the Exodus seminar, you know, with all my love for Dennis Prager. So it's like I asked him, like I. Even outside of the conversation, outside of the film conversation, I said, and I said, who's the figure in the book of, of Daniel? Like, who is this figure that sits at the right hand of God, you know, that has. That looks like the Son of man. And he was just like. But I don't know, I don't know who that is. And I was like, it's interesting. Like, it's like it's there, right? It's right there in the text. So what is. Anyway, so there's some definitely things to. To elaborate on. And if you look at the iconography, you've probably seen this, but the iconography of Christ, like the early images of Christ are all mapped on to right. Divisions of the prophets in the Old Testament. So if you see the image of the Ascension in The Ribula Gospels, 6th century, Christ is ascending into heaven and under him is like all these wings with eyes and heads and wheels. And it's like. Yeah, that's because they knew that this is what was going on. Like the image divisions in the Old Testament. Yeah, we're revealing what Christ was. And his ascension into heaven is him returning in the same spot that is described in those. In those prophetic visions."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":3602.07,"end":3700.99,"speaker":"Sarah","text":"Yeah, yeah. And the interesting thing about that vision in Daniel is that, you know, Daniel and Ezekiel are in certain ways twin books there. Yeah. At the same time, I think in the same time, Ezekiel mentions Daniel by name. And that little phrase, you know, one like a son of man, has one of its closest parallels. In Ezekiel 1, I saw one seated above the throne in the likeness of a man. And so, you know, these. I think your scripture has a very specific and precise theology of things like the angel of the Lord. You know, it's not just this kind of vague thing which is hinting at, you know, something which is only becomes clear later. There's really a lot of specificity to it and how it relates to the tabernacle system and, and all that kind of stuff. So, yeah, that was something that I found really exciting when I was just starting to see the beauty of Scripture. I Remember reading Isaiah 2 and it said that the nations will cast away their idols when the Lord rises to terrify the earth, and he alone will be exalted in that day. And I looked up those words. I mean, there's lots actually of resurrection puns. I think in the Old Testament, God rises and then things happen. You realize, oh wait, that happened in the resurrection of Christ. But when it says the Lord alone will be exalted in that day, well, you just go few chapters later and you're to the end of the book and it says that the servant will be high and lifted up and he will be exalted. And then he will sprinkle many nations of the nations are sanctified and things like this. So it all just rolls together in this way that, you know, makes an icon of Christ. And inside the Old Testament on its own terms is really compelling, I think, in showing that there is actually a coherence to this text."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":3701.07,"end":3766.42,"speaker":"Jonathan Pageau","text":"So father Stephen DeYoung on my channel recently, he studied this quite a bit, too, and he was saying that it was so intense that in the. In the early 1st 2nd century Judaism, as it was burgeoning kind of being born, that they. They started writing commentaries about how that, you know, this image of the Son, of the Son of Man sitting next to God, like that God punished him for it. Like, you know, you shouldn't sit. You know, you should stand like there's a mistake. Like, you should be sitting at the right hand of God. Right. But it's like, it shows you the deep. The deep idea that. The idea that this figure, that Daniel. That Daniel and Ezekiel see. Right. The fact that it's sitting means it's not an angel. Like, it's at least not an angel in the regular way. There's no way, like, it's not a servant. Servants don't sit. And that's why we also, like, we just don't have that way of thinking anymore. But, like, servants just don't sit. The one who's sitting is the one who's being served. And so it's not. Anyway, it would be interesting to go deeper into it, but, yeah, there's definitely. There's a lot to say about that."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":3766.66,"end":3774.9,"speaker":"Sarah","text":"Yeah. I mean, it's a book inspired by an infinite God, so there's an infinite amount of things to say about it. And that's what's so exciting, is that you never run out of material."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":3775.06,"end":3778.82,"speaker":"Jonathan Pageau","text":"That's right. Thanks for the conversation. This is a lot of fun. I enjoyed it."}
{"episode_id":"SW - #281 - 2023-04-14 - Seraphim Hamilton - Symbolism, Scripture, and Universal History","start":3778.82,"end":3783.46,"speaker":"Sarah","text":"Yeah. I hope we can do it again sometime. Sure. Definitely. Thanks so much."}
