{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":0.8,"end":65.38,"speaker":"Fr David","text":"We'd also, you know, we need to remember that Christ is the perfect example of all of this. So his ministry was three years long, but his whole life, you know, as a carpenter, was he, like, carving crosses and giving them to people? You know, probably not. That would have been a weird time. But, you know, his whole reality would have been offered up to the Father as a prayer. And because he's Christ, he does everything perfectly, which means it's perfectly humble, right? So when people come to me and they say, yeah, I'm thinking about doing this thing or whatever, I'm like, great, do it. And do it as well as you possibly can, because when you do that, they get, well, I'll be prideful about it. No, you won't. If it's actually done well, it'll be done in the image of Christ. It'll be perfectly humble, it'll be a great offering. And that's, you know, like Father Chris said. I don't think there's necessarily. It's not a problem. Like, Christ doesn't call us to be bankers or artists or lawyers or housewives. He calls bankers and artists and lawyers and housewives to be disciples. That's what he calls. So whatever you do, do it as well as you possibly can. It'll be a good icon. And if it's bad art, it probably stems from bad theology. Get your theology corrected, you'll be alrigh."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":101.04,"end":171.25,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. So, hello, everybody. I am very pleased to be here with Father Christopher, Father James and Father David, also known as the band Luxury. Some of you might have followed their story, some of you might not know, but they started a band a long time ago, when they were young, a rock band. And many events in their lives brought them ultimately to not all of the people in the band, but three who are here with us today to convert to Orthodoxy and ultimately to become priests. And there's a documentary about that called Parallel Love, which is a wonderful documentary. I recommend it to anyone which kind of traces the story. So we're going to look into what their story is, you know, the different. They put out an album a few years ago as well. They even did some live shows this summer, which they hadn't done in a while, and also their future projects. And we'll also talk about what it means to be an Orthodox Christian who is also involved in secular art. And so, Fathers, thank you for coming to talk to me."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":171.6,"end":173.12,"speaker":"Fr James","text":"Thank you for having us here."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":174.56,"end":185.12,"speaker":"Jonathan Pageau","text":"And so I'm hoping one of you can maybe just tell our Audience, this just the basic story of how it is that I'm talking to three rock and roll priests here."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":185.52,"end":186.76,"speaker":"Fr David","text":"That's Father Chris's job."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":186.76,"end":188.16,"speaker":"Fr James","text":"Yeah, that's full of Chris's job."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":188.4,"end":322.75,"speaker":"Fr Christopher","text":"I knew I was going to be conscripted. Well, the three of us, you know, actually met in college back in the early 90s when all of us were very kind of interested in music and playing music. We met at this conservative Christian college, desperate to find like minded musicians, and we wound up starting a band together, played around kind of the Atlanta, Athens, southeastern scene for a number of years. Eventually we got signed to Tooth and Nail Records after playing a festival up in Illinois. But around that same time at least, Father David and I were also studying church history with a group of friends that led us eventually into discovering the Eastern Orthodox faith. We wound up converting, much to Father James chagrin at the time. But eventually Father James and his wife became Orthodox as well. But, you know, the band continued during that time. You know, we were touring and playing quite a bit. And then as we started getting older and having children, the live aspect of the band waned. I eventually went off to seminary to pursue the priesthood. And then a number of years later, Father James, Father David did as well. And then got a phone call from father David about 2013 saying, hey man, I'm writing some more songs. You guys want to go in the studio? So we did. And then around the same time, a friend of ours, Matt, who's also in the band but was a filmmaker, just thought it would be really interesting to do a story and a documentary on, you know, the story of the band, the fact that three of us became orthodox priests. This is the, the first album and writing and recording since Being Priest. And the documentary has done very well, much to our surprise. We thought maybe two or three people would be interested in it, but NPR and other places were very interested. So it's been a. Interesting last few years as priests, trying to navigate being priests, but also playing rock and roll."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":323.63,"end":328.27,"speaker":"Jonathan Pageau","text":"So you played some live concerts this summer. How was that? Do you wear your cat socks?"}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":328.27,"end":332.99,"speaker":"Fr Christopher","text":"No, no, no. Father James, maybe you talk about that experience."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":333.47,"end":370.18,"speaker":"Fr James","text":"Yeah. So it was last summer we played. I don't know what to say about it. I mean, we hadn't played in ages and I guess the idea had come up that maybe we could try to do some shows and wanting to promote the record a little bit. Even the record. Record stretched out. Trophies stretched out for ages before we actually got it released. And I'm not, I can't remember how it all kind of came about, but we ended up being asked to play at a festival in Alabama, Furnace Festival, which is primarily like hardcore punk rock metal kind of thing. And we got asked to play, which was funny, but it was beautiful."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":370.18,"end":371.18,"speaker":"Jonathan Pageau","text":"Did they reach out to you?"}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":371.42,"end":373.02,"speaker":"Fr James","text":"Yeah. Oh, yeah, I think so."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":373.02,"end":373.54,"speaker":"Fr David","text":"Is that correct?"}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":373.54,"end":418.31,"speaker":"Fr James","text":"I think so. I think they came to us first. We weren't looking to play. And in the process of doing that, we thought, well, we probably ought to play another show before that to sort of warm up to that. And ended up playing a show at the Earl in Atlanta, which is kind of a cool club. We hadn't played there in many years, so we ended up playing in two shows, which was crazy. So, you know, we had these rehearsals and I don't. I was pretty nervous about actually getting on stage again, but it ended up being. I mean, ended up being a lot of fun. It was. It was enjoyable. It's, you know, it's a diversion, but. But we ended up doing that last year. And I mean, I don't. Not that. Not to then prove we couldn't do it anymore. We proved that we still could do something, but we did it and there it is. It's on video in places, so."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":418.69,"end":420.89,"speaker":"Jonathan Pageau","text":"Oh, it is. Can you find that video?"}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":420.89,"end":422.13,"speaker":"Fr David","text":"We could find it."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":422.13,"end":423.41,"speaker":"Fr James","text":"No, no, you can't find the video."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":423.41,"end":424.25,"speaker":"Jonathan Pageau","text":"It's well hidden."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":424.25,"end":424.73,"speaker":"Fr David","text":"Okay."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":424.73,"end":433.17,"speaker":"Jonathan Pageau","text":"All right. I would have liked it. I would have liked to see that. And Father David, since you're singing, how was that for you in terms of a concert? Because that different energy."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":433.73,"end":473.91,"speaker":"Fr David","text":"Yeah, it was very different. You know, again, like Father Chris said, we. We hadn't played together live in that. In that setting for almost 20 years. And so it was a very different energy now being a priest and sort of what I felt comfortable doing, what I didn't feel. I felt very much self conscious the whole time, which I. I didn't feel that earlier, you know, early on. And so might have been a lot of them might have been just around singing live, which is a difficult thing to do, and trying to be energetic and all that. But not so much the priest stuff. I didn't. That wasn't the uncomfortable part. It's more of just not having done this in so long. So. Yeah."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":474.55,"end":479.75,"speaker":"Jonathan Pageau","text":"And also imagine being older and just being more aware of certain things in terms of."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":480.15,"end":506.73,"speaker":"Fr David","text":"Yeah, you still want to be like, exciting and interesting and provocative and all that. And there is somewhere in the back of your head the idea of priesthood and your congregation and all of that, who weren't there, thank God. That would Be even stranger, you know, because it's a different reality. But no, I mean, it's just, you know, you get older and you want to, you want to, want to be approved, age appropriate, that kind of thing. I don't know, it was, it was odd, you know, and how."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":506.73,"end":515.25,"speaker":"Jonathan Pageau","text":"What age were the people in the audience? That's probably. Was it, was it a bunch of 20 year olds? Like, was it a bunch of teenagers or was it more kind of adult?"}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":515.25,"end":520.41,"speaker":"Fr David","text":"It definitely was more people. I mean, we're all over 50 now and so it was definitely more of."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":520.41,"end":522.81,"speaker":"Fr Christopher","text":"Our dad rock crown."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":525.46,"end":533.22,"speaker":"Fr David","text":"But it was loud. You play hard and heavy and loud and it was great, you know, I don't really want to do it again, but yeah, it was a good experience."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":533.54,"end":538.26,"speaker":"Jonathan Pageau","text":"I mean, I think that that's interesting. You're saying you don't, you don't want. What, why don't you want to do it again?"}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":538.58,"end":564.74,"speaker":"Fr David","text":"It doesn't do anything for me in particular at this point. Like my own interest is in songwriting and making records, that kind of thing. That's where my. I get the most joy and interest out of that, the playing live thing. I suppose if we did it more often, I would, I would feel I could get my way into it a little bit more, but it's not. I don't really have any interest in that, so. But I don't even go to shows anymore, so, you know, I just don't have a lot of, you know, interest in that kind of thing, so."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":564.98,"end":573.06,"speaker":"Jonathan Pageau","text":"But it's still an interesting. In the music part. Like, it's not, it's not disillusioned with the music. It's just the live thing is not the right."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":573.38,"end":589.65,"speaker":"Fr David","text":"Yeah, I mean, the whole, the arc of making music and putting out music and then the live part of that, like my interest ends once the record, when I'm holding it in my hand, that's where, that's where I finish my job. And anything beyond that I don't have any interest in at all. So."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":590.05,"end":595.01,"speaker":"Jonathan Pageau","text":"So Father James, Father Christopher, what about you in terms of the live experience? Did you have a similar experience?"}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":595.89,"end":610.72,"speaker":"Fr James","text":"I had a lot more fun than I thought I would. I had the same kind of hesitation, you know, you're a priest, you know, but like a lot of things, you know, some priests, they go out and they play golf, I guess, or they. I don't know, what's something analogous? They go fishing or hiking or."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":611.28,"end":613.2,"speaker":"Jonathan Pageau","text":"People watch you, though. People don't watch you."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":613.2,"end":642.36,"speaker":"Fr James","text":"Yeah, well, yeah, yeah, this is, this is different, but it's Like, I don't know. I mean, that. I enjoyed it a lot, but I'm with my brother. I'm kind of. It's. That's. You know, it's fun. I mean, it's. It's. I like to get together with the band. I enjoy that part. And if people want to watch us getting together, I mean, we have a lot of fun. We tell jokes and we sit around. They could just. We could do that. We could just have a rehearsal. They could just all watch us sitting there eating a meal and then making jokes and playing for five minutes and then correcting, you know, that if."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":642.36,"end":642.52,"speaker":"Fr David","text":"That."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":642.52,"end":646.32,"speaker":"Fr James","text":"We could do that, that would be more fun. But maybe that's a concept."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":646.32,"end":650.88,"speaker":"Fr David","text":"Maybe we could. Terrible idea. It's."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":650.88,"end":651.44,"speaker":"Fr James","text":"Time has come."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":651.44,"end":651.88,"speaker":"Fr David","text":"I don't know."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":651.88,"end":653.44,"speaker":"Jonathan Pageau","text":"Well, Christopher."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":653.68,"end":668.97,"speaker":"Fr Christopher","text":"Yeah, I mean, I. I enjoyed it, and, you know, I'm open to doing it again, but it was. Certainly there was tension. I mean, just how do we do this? Like, you know, we. We're performing in front of people."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":669.05,"end":669.53,"speaker":"Fr James","text":"It's."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":669.53,"end":670.01,"speaker":"Fr David","text":"It's."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":670.89,"end":672.73,"speaker":"Fr Christopher","text":"But we're. We're priests and we're not."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":672.89,"end":673.53,"speaker":"Fr David","text":"I don't know."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":673.53,"end":720.81,"speaker":"Fr Christopher","text":"It's just, you know, the tension of all of that. I. I think at some point I. I just said, okay, well, I guess just embrace the tension of it and, you know, just kind of remember who we are. So, you know, I'm not opposed to doing it again. But, you know, it just. I realized kind of what Father David said, I mean, it didn't really do anything for me in terms of like, oh, we got to do this more often. It was just. It was fun. It just felt like kind of nostalgia, especially the show in Atlanta, being able to see a bunch of friends of ours. That's where we used to play all of the time. So it just felt like a reunion of sorts. And so many of our extended clan down there, you know, many of them have also become orthodox over the years. So that was just pretty neat to see some of them. And."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":721.05,"end":788.73,"speaker":"Jonathan Pageau","text":"Yeah, so this is something. I mean, we've had conversations before. I think maybe. I don't know if I've had this conversation with all three of you. For sure. Two of you, for sure. Father Christian, Father David. So even in the things you're saying, I feel a little uneasiness. Like, there's an uneasiness in the way that you express your relationship to the music now, to the concert. I don't know if it's uneasiness or at least a sense in which you're not sure how to place your Feet. Maybe that's the best way to understand, like, how do I position myself? And so I know that there's a lot of people watching this. A lot of people who are in the secular art world, you know, people who do animation, video games that watch my content, you know, people who've reached out to me and a lot. And many people feel that. That uneasiness, you could say, not sure how it is. Do I live these. These two lives? And so I was wondering if you. If it's something that you're, let's say, exploring on your own, do you see a connection, Is there a connection between your orthodox faith and the music? Or do you feel like it really is just two lines running next to each other?"}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":789.13,"end":906.1,"speaker":"Fr David","text":"Well, I mean, I've thought, I think a lot about that. I think our. The band's sort of prime experience was pre Internet days. So there was a. There was an aspect of it where that was very segmented. Like this was what you do. You can get up on stage, nobody really knows anything about you. There's not. It's a. It's a Persona that you. You sort of adopt. And there's a kind of comfort in that where you can just simply. You can be that thing in that setting. And there's no, you know, nobody's taking cell phone videos of your playing. You know, there's nothing that's. Suddenly this becomes a permanent sort of reality, right? And you can kind of create that and take some sort of comfort in creating that Persona and entering into it nowadays, you know, it's. They all. They know who you are, they know your wives names and know they've seen pictures of your kids. They see your Facebook page, your Instagram, and all these different things. Like, it's suddenly, it's all just jammed together. And that's, I think, where the discomfort comes is how, you know, am I a priest when I'm playing music? Well, people know you're a priest because they've seen your stuff, right? Or am I a musician when I'm a priest? That's the other option. We feel the same sort of tension in church, you know, So I think we live in an age which is way too overexposed with all of our realities, right? And so my own discomfort is about, you know, how much do I want people to know about me, you know, and the reason I don't have a, you know, sort of YouTube, no offense, a YouTube channel, these different things, like, I just don't want that much sort of exposure. I don't. I want to Be somewhat mysterious still so that I can keep some. For me personally, I can keep some bifurcated realities in my life. I think a little bit. I don't that makes sense or not, but it's just a different age we live in and your musicians nowadays, sort of. I think they have to have everything out there all the time for everybody. And I think that's a. Yeah. I don't know. Appropriate."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":906.18,"end":1000.25,"speaker":"Fr Christopher","text":"So, yeah, I. I think the flip side of that, I mean, we've talked a lot about this kind of amongst the band and I mean, Father David, you always make that point that, you know, parallel lines don't intersect and so this idea of. But, you know, I think there is this sense that we have always struggled as a band, you know, trying to understand how does our Christian faith kind of inform our arts and. And vice versa. And you know, we never set out to be a. A Christian band or, you know, have this agenda to win souls or whatever. We were just, you know, trying to create art. But you know, I think, and I mentioned this in, in the movie, this idea, like Father Alexander Schmeman talks a little bit about in his book for the Life of the World about this vocation of being a priest of creation who takes the matter of this world and offers it up to God with thanksgiving and praise and then it gets returned to us as something life giving. I know for me, in my journey into Orthodoxy whilst being in a band at the same time, that was so helpful for me, I think, to just think of art that way, you know, that we're somehow offering up the matter just like bread and wine, Eucharistically, we're offering up the matter of our talents and hopefully God blesses it and we can create something beautiful and you know, it reflects our. Our life and our world view. So I think that's been helpful, I think for us as a band to think about it that way also."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":1000.49,"end":1004.33,"speaker":"Fr David","text":"I would say about that though, like, we wouldn't do this in the church, like."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":1004.33,"end":1005.01,"speaker":"Fr Christopher","text":"Yeah, yeah."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":1005.01,"end":1092.43,"speaker":"Jonathan Pageau","text":"Well, that's the. I think that that's really where in some ways it becomes fascinating for me or to think about because. And I think that's probably why people are so fascinated by your story as well. Because if you were Protestant pastors, you could probably do it in the church, right? It would be. You would be using it as worship music or whatever. You could, you could do that and you could get away with it. Right? You could have the concert in the church and get away with it. But for sure, everybody knows that you couldn't do this in church. Like, you couldn't use this. It's not a. It's not a strictly liturgical action in the. In the strict sense, but at the same time as. As music. Right. But at the same time, like in the words of Father Alexander Schmemann that you mentioned, and I think just in general, in terms of St. Maximus and the way that we understand Christ's presence in the world, we have a sense in which liturgical. The. The form of the liturgy or what the liturgy does can be applied at smaller levels. Right. I often talk about how a family meal is somewhat liturgical. It's not strictly liturgical, but it's somewhat liturgical because it's binding together around a common thing. You know, there's a type of dance that happens in a family meal that is ritualized. And I think there's the same thing with the concert. But I'm trying to see Father Christopher, like, what is it that it's expressing?"}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":1092.43,"end":1092.83,"speaker":"Fr David","text":"Right."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":1093.15,"end":1106.17,"speaker":"Jonathan Pageau","text":"What positive thing? Even if we think in terms of orthodox mindset, what positive thing does rock and roll manifest? Like, what could it manifest as positive? And this is like a really. Like, this is. This is not."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":1106.17,"end":1106.45,"speaker":"Fr David","text":"I'm."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":1106.45,"end":1114.01,"speaker":"Jonathan Pageau","text":"This is not a trick question. It's not a. I'm really trying to. I'm. I myself am trying to kind of see this. I have kind of an idea, but I'd like to hear your thought about it."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":1114.73,"end":1169.94,"speaker":"Fr Christopher","text":"Yeah, I mean, I'll say a few things, but you guys can jump in as well. I. I just know when I first heard your talk on the. The Pentecost for the zombie apocalypse, and you. You talked about this idea of kind of like a. A narthex art or kind of. I can't remember how you term it, but it's kind of like. It's not quite in the church, but it's somehow reflecting something of reality. It's entering into even kind of the depths of the human experience. And, I mean, I'm a bass player, so. I mean, my bass player, my. My bass parts are entering. But when I think of, you know, like, Father David and his themes, you know, in his lyrics, I mean, I think there's a. There's definitely a depth there. Maybe in the same way that, like, folk music is in Eastern European countries. Like, these aren't songs that we would hear in the liturgy, but they're definitely, you know, reflecting on a lived experience for those producing it."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":1170.58,"end":1179.22,"speaker":"Jonathan Pageau","text":"I want to hear someone else's ideas on this. I know, Father David. It's something that really kind of rattles in you. So I Want to hear what you think?"}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":1179.22,"end":1248.7,"speaker":"Fr David","text":"Well, I mean, honestly, it's never been too much of attention for me. I've never. I've never tried. I never thought that I needed to write songs or lyrics that directly correspond to sort of my life as a. As a Christian, as a priest or anything like that. All of my life in the Church, my life as a priest. It all has tremendous impact on how I write songs in the sense of. You know, it's flavored with these ideas of the rhythms of liturgical life and all and the imagery of that and the questions that I ask. But it's just. I've never felt compelled to turn that into something that's sort of explicit. So I guess there's not a lot of. Maybe the. I don't know, maybe the. In fact, I probably had tried to avoid it more than anything, I think. You know, recently I wrote a song over the last couple of years that actually has the name Jesus in it, which is the first time I've ever done that. But it's. Somebody had written it in graffiti on the wall. Right. That's sort of the. That's how I brought it into the. And that's. That seems natural to me, as opposed to, you know, the private thing that we do as Christians, you know, the privacy of worship and all, that kind of thing."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":1248.78,"end":1249.18,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":1249.18,"end":1251.02,"speaker":"Fr David","text":"I wouldn't use that in rock music."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":1251.26,"end":1307.96,"speaker":"Jonathan Pageau","text":"This is why it's so fascinating in some ways, because. Because you have a sense of what is truly sacred and holy and highest. You could say it almost does the opposite as what, like I said, a kind of evangelical would do, because the kind of evangelical thinking would be like, yeah, put Jesus in there as much as possible. Just throw him in. And so in some sense, it's particular because you recognize the value or a certain hierarchy where it's like, I know what I'm doing is not in the same space as when I'm consecrating the Eucharist. It's just not in the same space. And so I don't want to confuse that hierarchy by, let's say, almost saying, like you said, I feel. In what you're saying, it's like if I brought Jesus into my songs all the time, it would come and almost be, like, blaspheming. Like, maybe not blaspheming, but it would be like. Like a demeaning to what the highest part of that is."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":1308.36,"end":1364.25,"speaker":"Fr David","text":"Our songs are not sacred space. Yeah. To do something, to bring something into that. Like, I've said this before in other places, but I don't typically talk about things that I really love. I keep those things for myself. They're private, you know, the things. Musically, the things I really love. I don't want to talk to other fans of the bands that I like because you can't possibly love them the way I do kind of thing. So I think in some ways, you know, I'm terrible as far as being evangelical because I don't really want to talk about price to people. You know, it sounds weird as a priest to say that, but, like, I don't, you know, I want to. Or even the Theotokos, like that, you know, good example. Like, I don't want to talk about her to other people unless we share it in a communal kind of space, a sacred space, space of the church or in that setting in a band. It seems like the worst possible idea to bring that into that setting. To me, anyway. Sure, you got comments."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":1364.49,"end":1485.47,"speaker":"Fr James","text":"It's funny because every time this comes up, I think I'm becoming more convinced. Like, I have answers, and I'm like, I don't have any clue how to answer the question or how to untie the knot. It's. And that kind of occurred to me more recently. How do you even answer this? It's. You know, I almost wonder what the question is anymore. What do we, you know, what do we do with it? I. I mean, I got guitars on the wall and I still, oh, my God, I'm in my cassock. So it's sort of like, like Father Chris said, there's that tension. Maybe. Maybe in some ways, as a priest, the rock and roll part of our life is like dinner on the dining room table versus, you know, offering, and this may not be the best way to put it, but offering the Eucharist on the Holy table. You know, the two are connected. Who is it, though? I think it's Father Thomas Hopko would talk about the connection between, you know, the fellowship meal you share at coffee hour or the Common meal after liturgy versus the Eucharist. They're not opposed. They're connected. But there's. But there's a clear, very clear difference. And the things that we might do and say around the meal that we have at the Common meal after liturgy, hopefully will reflect what we've done in the Eucharist and won't contradict it. But, you know, maybe we'll, you know, we're not. It won't be as ritualized. It won't be as. It'll be sacred, but sacred as an informed sacred reshaped by the by the by the true thing, the real thing. And, you know, that meal. That meal being an image of the greater meal, marriage being an image of the true marriage, you know, whatever it might be. And rock and roll is an uneasy. It's an uneasy fit. And yet there's this compulsion, you know, when you've. You've done it for all these years, you know, to keep. I mean, I'm surrounded by it here. I. When I went to seminary, it was funny, like, the first time I ever did this because I was much worse about taking other people's gear than I was giving it up. But people left it around. There's like this rule that if you leave your gear sitting for so many minutes, you know, it's. It's mine. You know, we used to have a. In the movie."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":1485.55,"end":1485.95,"speaker":"Jonathan Pageau","text":"What?"}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":1486.11,"end":1560.56,"speaker":"Fr James","text":"That's stealing. Yes, but let's call it, you know, let's gloss it here. In the movie we talked about the dish, which was this, you know, all ages club that we ran. It's a great story that I won't get into, but people would leave their gear occasionally and they wouldn't go back and get it. Well, it became ours. When I went to seminary, the first time in my life, I gave away gear. Like, I'm, like, I'm not going to need this anymore. I'm going to, you know, I'm going to seminary. I'm going to be a priest. I saw some regrets about that because I thought, you know, now, now I probably owe more gear than I've ever owned in my life, you know, as a priest. You know, you give up these things, you think it's going to become less a part of you, but yet you're, you know, still a part of who you are. But I think for myself, I'm more concerned that, you know, will this stuff or the music somehow misshape the priesthood? You know, that's my primary concern. Like, I'll be a priest and I'll be a priest who picks up a guitar and, you know, wears my street clothes to play a show once in a blue moon maybe. But if that. If that harms any of this stuff in any way, then I. I need to put that away. So there's that. That tension of like, you know, is it crossing a line? Is it doing something else? But, but like. But like I said, I'm not. I don't even know if that's an answer. I guess for myself, I just keep making music and that's the best I can do at this point."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":1561.6,"end":1578.26,"speaker":"Jonathan Pageau","text":"So maybe that's the next question, in terms of. We won't name any names, but I mean, has that happened? Have you felt like you've received criticism or that people have questioned, you know, your priesthood or questioned the. The fact that your pastors of churches."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":1578.26,"end":1611.33,"speaker":"Fr James","text":"Because of this, I'll say first, since I brought it up, I've not had that, actually. I've been. I kind of feel like people should. So, you know, I mean, I feel the same way. You know, I mean, I feel like when we. When I became a priest, like, immediately I let people know because I. Because the Internet, I'm like, look, guys, you're going to get to know me. You're going to go on YouTube, you're going to see videos. Here's. Here's some of my past history. Don't be shocked by this. And my folks have always been just like, they think it's super cool. And I'm kind of like, maybe you shouldn't. I don't know, you know, maybe it's not bad. I don't know, you get put into."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":1611.33,"end":1613.33,"speaker":"Fr David","text":"A category, you become the cool priest."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":1613.41,"end":1613.89,"speaker":"Fr James","text":"Yeah."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":1614.29,"end":1618.29,"speaker":"Fr Christopher","text":"You know, you have the love feels equally as uncomfortable."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":1619.57,"end":1620.85,"speaker":"Fr James","text":"Totally. Totally."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":1621.01,"end":1680.32,"speaker":"Fr Christopher","text":"Well, it's funny. I mean, my funny story about this is, you know, the movie was hitting all of these art house cinemas around the country, so it was coming to the local cinema here. And I was just nervous to talk about it to my parishioners. I mean, people know about the band and all of that. Finally, somebody pulled me aside and said, father, you need to announce that this is coming. Because I think people would be disappointed if. If they know that it came and. And you didn't tell anybody. So the very first time I've ever mentioned the band, like from the ambo or whatever, it was like announcements after liturgy. And I just said, well, some of you know that I'm in this band. And everybody just started laughing because, like, everybody knows that, but I've never acknowledged it, like, publicly. I said, well, this movie's coming. Some of you might be interested. And I don't know, the place was sold out and most of the people that were there were my parishioners."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":1680.32,"end":1680.8,"speaker":"Fr David","text":"Yeah."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":1681.04,"end":1690.64,"speaker":"Fr Christopher","text":"You know, so the Q A afterwards, it was just weird. It just felt so awkward, but just. It's somehow integrating at the same time."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":1692.4,"end":1729.62,"speaker":"Jonathan Pageau","text":"So maybe, maybe, Father David, this is a question for you in some ways, I mean, maybe for all of you, because in some ways I can see, like, trying to figure out how it connects, hoping maybe they connect somehow. But have you seen a difference in, for example, the themes either Musically or in terms of lyrics that as you've matured in your own lives, in your own spiritual lives, in your own priesthood, have you noticed that there has been a change in the type of themes that you're addressing or even just the depth of what you feel like you're able to touch in terms of themes?"}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":1729.86,"end":1802.73,"speaker":"Fr David","text":"Yeah, well, I mean, definitely things have changed, but, like, I have a. Right now I'm working on a. Just a very short little EP that I hope to release before the end of the year. It's just home recordings and Father James and Father Chris are going to help me with it. But, like, one of the titles of one of the songs is My Eyes Are Up Here, which is typically referring to a woman with her features, and you're looking at her features, a picture of her face. So I love that phrase. And I'm using. I'm converting that into a more something to do with spiritual versus carnal kind of. Kind of language. I'm using it in a different way. So in that sense, yeah, like, I'm still. I like to use provocative themes and ideas, even language. But I'm. I think I've all, you know, pretty much for the entirety of the band almost, you know, I've been living an orthodox lifestyle, so, like, I've always sort of tackled some of these themes in an orthodox with an orthodox sort of mindset. So as I've gotten to be a bit of priest last, you know, 10 years now, there are definitely things, certain things I won't say because it's just. It's too far. It pushed. It goes beyond the. Beyond the pale sort of thing. But I still like to push and provoke, so. But yeah."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":1802.97,"end":1805.69,"speaker":"Jonathan Pageau","text":"What do you hope that. What do you hope that does? Like, what is that?"}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":1807.05,"end":1809.57,"speaker":"Fr David","text":"I mean, just, you know, I don't know."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":1809.57,"end":1809.81,"speaker":"Fr James","text":"I don't."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":1809.81,"end":1879.27,"speaker":"Fr David","text":"I don't. Like. I. My interaction with music is all about very. It's just personal. It's like. Like, first of all, I don't. And I said this movie. I don't believe anybody really likes the music that we do, even if they tell me they do. Like, I don't really believe that, first of all. And I don't care. Ultimately, I. It's really about the formation, the creation of something that. That wasn't there, that. That is now there. Which is why once it's done and it goes out into the world, I don't pay any attention to it. You know, try not to read reviews. I don't really care about playing live and all that kind of thing. I just. I really like creation of it. And so that's where all my attention is. And if I have any tension, it's during that process of saying, well, can I say this is too far? Is this too complicated? One of my solo records, I used, you know, I use the F word in one of my solo records a number of years ago. And it was. It kind of. But it's very appropriate in the usage of it, you know, And. And it's. It's. I like to use language in that way as a provocative kind of thing. Are these imagery images that are provocative? I don't know what the end. The end goal is with that. I mean, I really don't know. It's just. It's what you do. It's rock and roll, right?"}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":1879.35,"end":1937.05,"speaker":"Jonathan Pageau","text":"So, yeah, I think that the way that. The way that I've been seeing it or trying to kind of understand what. What rock and roll could be, because obviously it does from the very beginning, right? It's very associated with sensuality also emotion and anger. You know, all these things kind of coming together. So it is a. It's a passionate thing. It's a very passionate thing. And. And so I was trying for a while to think about what. Like, in terms of thinking of the idea of Christ filling all things. You're right. The idea of Christ kind of participating in all. Like, what role could it be? And I had this image of St. John the Foreigner. Like, that's the image I had. Like, there's something about being in the desert, you know. Like, I can imagine St John the foreigner in like a. Like a heavy metal band, right? He's like. He's out in the desert. He's like, screaming. He's telling people to repent. It's like. It's more of that kind of. Get with it, folks, you know, aren't."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":1937.05,"end":1937.37,"speaker":"Fr David","text":"Why."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":1937.37,"end":1965.21,"speaker":"Jonathan Pageau","text":"Why aren't you seeing this? Like, are you. And I know, like, it's not that. That's not actually the. The. Exactly the space of your band, but this is like the image that I had that I thought, like, in terms of thinking of this idea of art of the narthex or art of the. Of the. Art of the desert, something like that. Something about that. Anyway, so that was the only. That was the thing that I could. That I could kind of see in my. In my mind. And the aesthetics of rock and roll seem to fit even with that to a certain extent."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":1965.77,"end":2005.69,"speaker":"Fr David","text":"I think for me as the lyricist, like, I. I have always used the method of asking the question as my primary way of writing. And maybe that's the way the prophets would do it. It wasn't. It was more of like, look at what you're doing. You know, look at this reality. And it's not that. Try not to give the answer so much. And they talk about that in the movie a little bit like, I'm not trying to hit people over the head with answers, but it's just more of a look at what's going on, look at this reality, look at what's happening. And then beyond that, the church has the answers. If people want to come into the. And find the answers, this is where you find it. Maybe our role as musicians is to ask the questions."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2006.49,"end":2035.17,"speaker":"Jonathan Pageau","text":"I think that's a great formulation, you know, and it is in some ways a formulation of. It's like, you could say something like, as we. As we stand in chaos, let's say, or we stand outside. We stand outside of the church, then what is the four. What is that? What does that mean? And that's it. It's the question, like, it's like, what about this, Lord? Like, what about this? You know, that's the. That's the role of. Of the outside to a certain extent, you know, so that's. I think that you really. You hit the nail on the head there."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2035.17,"end":2048.6,"speaker":"Fr David","text":"All music, all good music kind of does that, right? I mean, whether it's made by Christians or not, that's what, you know, protest music was. Whether it involved a acoustic guitar or not, you know, it was all by asking the question, look at what's going on. So."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2049.24,"end":2054.6,"speaker":"Jonathan Pageau","text":"So who. Who are, would you say, are your influences in terms of music and in terms of."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2054.84,"end":2055.56,"speaker":"Fr Christopher","text":"Of writing?"}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2055.8,"end":2056.12,"speaker":"Fr David","text":"Me."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2056.12,"end":2057,"speaker":"Fr James","text":"You start, brother."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2057.24,"end":2128.12,"speaker":"Fr David","text":"I don't like anybody. I mean, you know, I like very few things. I was listening. So, again, I'm working on this new project. Not. I really all I listen to anymore these days, really, is just Nils Fromm. I don't know, you know, who that is or not, but he's just a composer, all instrumental music. And I find that the stuff that I'm writing is just basically trying to duplicate what he does with vocals. Historically, obviously, some of the influences are pretty obvious. I mean, I was a huge Smiths fan back in the day, and I think Morrissey lyrically was the most clever and most interesting. I was also a Big House Martins fan. I think Paul Heaton and his writing was very interesting. Outside of music, I always reference T.S. eliot. I come back to him all the time, quite often, and you can't get far in this day and age. Without referencing Radiohead in some way, either thematically or sonically. I think the songwriting especially is just super interesting. Those are some of my, you know, lyrically and musically, being the songwriter, that's where I'm kind of coming from. Father Christopher, Father James have their other textures. They add to that."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2128.36,"end":2130.44,"speaker":"Jonathan Pageau","text":"What about you? Father James, Father Christopher."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2130.44,"end":2175.71,"speaker":"Fr James","text":"I was. At one time, I was really into U2. I think they're kind of boring now, but I loved them when. When I was in high school. And that was really. That got me into the. The sound. Like, the sound of things. The atmospheric quality of things. But then my brother and Father Chris got to college, and Father Chris introduced us to, like, the D.C. punk scene. So Washington D.C. had this punk scene and. And there was just this energy, this vitality to that that was totally different than a lot of the. Like, I was. I was hugely into, like, the new wave movement in the 80s. I love that stuff and, you know, synthesizer and stuff. Like, I still love it. I write that kind of stuff. But. But the. The punk scene, particular things. Bands like Fugazi or. I loved a band called Shutter. To think they just were poetically bizarre and they."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2175.71,"end":2175.99,"speaker":"Fr David","text":"The."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2175.99,"end":2197.11,"speaker":"Fr James","text":"The lyrics were. Were impressionistic and made very little sense, but it was just really, really beautiful in terms of the way the guy wrote. And it was very influential on me in terms of guitar playing, because the guitar. The early records were real. It was really scattered and kind of interesting. But then, like, the way. The way the singer Craig sang and just bizarre lyrics were."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2197.43,"end":2197.65,"speaker":"Fr David","text":"Were."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2197.72,"end":2212.44,"speaker":"Fr James","text":"Or in a good way, just kind of influenced kind of how I thought about writing guitars. Because, you know, my brother writes. You know, he's. He probably. At the time we started, I was probably writing. I was writing a lot. I guess I was writing a lot of. As a band."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2212.44,"end":2212.64,"speaker":"Fr David","text":"We were."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2212.64,"end":2235.18,"speaker":"Fr James","text":"But I was writing a lot of the music still. But then he learned how to play the guitar and he plays better than I do, so he started writing stuff. But then he uses these weird chords, like a seventh. What's a suspense? You know, what's a C major seventh? I don't know what that is. I play power chords, so I have to learn. I. I was challenging kind of the way. And I still do. I think the melody, you know that. So it kind of influenced how. How I was doing things."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2235.9,"end":2237.18,"speaker":"Fr David","text":"Just play my chords, that's all."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2237.34,"end":2244.06,"speaker":"Fr James","text":"It's not gonna happen. I mean, it just won't work. I can't do that. I'm not doing it. Rebel. So that's what I did, what I do."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2244.78,"end":2245.14,"speaker":"Fr David","text":"Yeah."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2245.14,"end":2291.65,"speaker":"Fr Christopher","text":"And as they said, I mean, I was very influenced by kind of the underground punk scene of the 80s and early 90s. And I would say I was more influenced kind of ideologically in some respects of just kind of this. Do it yourself. You know, we're going to start our own band, start our own venue. And then music was all just a part of that, using music as a means for just making change. So certainly Fugazi and all of those bands. I think musically I just love the energy and the, you know, as a bass player, just the. Almost like jazz influenced a little bit. And then certainly I got into jazz as well. But, yeah, Radiohead and certainly I loved you too. And I always loved Adam Clayton's bass playing and."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2292.61,"end":2295.49,"speaker":"Fr James","text":"Yeah, which is funny because we don't sound anything like that, I don't think."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2296.53,"end":2319.67,"speaker":"Jonathan Pageau","text":"Yeah, yeah, well, I think. I mean, when I listened to your. The early albums, like. I mean, it really did sound like. Like the 90s in its own way. I mean, it had. It had its own sound, but it still had that. That vibe. I don't know how else to describe it. So what about now? Because you're working on an album now, what is. How do you feel that, how that's going? How different is it? How similar is it to what you've done before?"}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2319.75,"end":2321.11,"speaker":"Fr James","text":"That's your job, brother."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2321.43,"end":2380.72,"speaker":"Fr David","text":"Oh, it's so hard. It's so hard nowadays. Like, we, you know, I wrote a bunch of songs over the last few years and we've gotten together a number of times to try to sort of work them out, to see how we. How we would put them, put them together. And it just. It hasn't. It just didn't work repeatedly. Just. It ended up sounding just not interesting and so probably not bad, but just not interesting. And so I kind of went back to the drawing board and just took all the songs and just redemoed them in a totally different fashion, using a lot of keyboards and arpeggiators and things like that. And I said, okay, let's just try to record them. Like, let us do it this way. And it seems like it's kind of worked a lot better. It's very much less democratic, less band like. And father Chris will tell you, as he's recording his bassmart, I'm standing over him going, no, no, no, don't do it that way. Change that into the drummer the same way. I was sitting right in front of his kick drum and I'm like, no, no, that's a bad feel. Do it this way."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2380.72,"end":2382.64,"speaker":"Fr Christopher","text":"You know, Benevolent dictator."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2382.88,"end":2388.88,"speaker":"Fr David","text":"Yeah, and my brother putting down guitars. Like he'd spend 10 hours working on something. I don't like that. Try something else. So."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2390.02,"end":2392.5,"speaker":"Jonathan Pageau","text":"So you're the dictator of this project right now. You become."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2393.3,"end":2397.3,"speaker":"Fr David","text":"It's going to be good or bad. It's going to be sort of my vision for things."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2397.54,"end":2399.5,"speaker":"Fr Christopher","text":"We have a hierarchy within the bounds."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2399.5,"end":2422.19,"speaker":"Fr David","text":"Right. I think, you know, for me, I'm just not interested in repeating the stuff we've done in the past. So I think the new stuff, it's weird. It's different from us in the sense of. There's a lot of dancy stuff going on, which is a dancey band, but there's some just. It's just going to be different, I think, which again, in terms of songwriting, that's what's interesting to me. Just not repeating the same thing."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2423.31,"end":2441.04,"speaker":"Jonathan Pageau","text":"All right, so I was going to. I was kind of bring it to. To my last question, which might be in some ways hard considering the discussion that we've had already. But like I said, there's. I know there's a lot of artists that watch my content. A lot of people who are. Many of them are post secular is the best way to explain."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2441.19,"end":2441.83,"speaker":"Fr David","text":"To explain it."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2441.83,"end":2487.19,"speaker":"Jonathan Pageau","text":"They. They kind of come out. They're actually went very much into a secular world, into the secular art world, but then became disillusioned and now, you know, are, let's say, Christian adjacent or actually going to church or a catechumen somewhere or whatever, you know, people kind of floating around and everybody's trying to figure out how to do this, right? How to. How to live their lives in a fulfilling way, especially because a lot of them are. Are professional. Like, they do it as a living, like how to live their artistic lives and also, you know, move towards Christ. And so do you have something to. To advise these people? Like, is there something that. What would you say if someone, like, came to you in your own parish and had those questions?"}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2487.19,"end":2498.58,"speaker":"Fr James","text":"You know, again, I feel like I want to say this quickly because, like, I don't. I don't have. I feel like I don't have the answer anymore, which is kind of good. But I keep thinking about before. Before I went to seminary, I was a furniture builder."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2499.14,"end":2499.54,"speaker":"Fr David","text":"And."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2500.66,"end":2683.06,"speaker":"Fr James","text":"And how much when I became Orthodox in the midst of that, like, in that period of my life, the furniture was still the furniture, but something had changed. Like, I. I was realizing, like, how much that can become, you know, I mean, you're an icon carver, so you understand. An iconographer often knows, you know, that should be an act Filled with prayer. But suddenly whatever you're going to do, whether it's, you know, building furniture for. For a living or making art, which, in my mind, in a lot of ways are there. There's a lot of connection there. I mean, it's something that has to be filled with prayer. I mean, I don't know how everything, our whole life is supposed to be filled with prayer. If you're an Orthodox Christian and you want to do things like. I'm kind of skirting the question. You want things to be good in terms of your output. You're a musician. You're trying to square Orthodoxy, in a sense, with rock and roll or whatever it might be. I mean, all you can do is. Is offer it. You know, it's either it's blessable or it isn't. And for myself, it's always been. We said before, it's been attention. I didn't know what to do with it. I still kind of don't know what to do with it, except for the fact that it's sort of like it's the natural thing to do. I admit I'm, you know, I will be probably a musician who makes, on my own, you know, rather mediocre music until I die. It's a natural output of me. Whether it's something that's totally eternal or not, I don't know. The best I can do is say, here it is, and then offer it, in a sense, with a prayer, praying that it's something that's. That's worthy and that God can somehow make use of it. Maybe I read a story. Maybe some of you read the book Scent of Holiness. It just comes to my mind that in this book. And again, I don't know how good or bad this is, but in this book there's a tale of a monk. And I think it's. I've seen other places. Who comes to the monastery and he's this goofy guy, doesn't really have anything to offer the monastery. And another monk sees him one night doing, like, gymnastic tricks in the church. And at the end of it, he's. He falls down before the icon of Christ and he just says, I'm sorry, Christ. This is all I got. I'm no good at anything else. But I was a clown before I became a monk. And this is what I've got to give you. And of course, the other monk is scandalized. And as the story goes, he brings another monk in and they spy on him doing these gymnastic tricks in the church at night when no One's there, and they're there to basically kind of clamp down on him. Except for the fact at the end of this one particular evening, he falls in for the icon of Christ. Christ himself appears and wipes the sweat from his brow and says, you know, thank you for your offering. And the other two monks are shattered by this. Like, wow. Okay, We. You know, this is bizarre, but this is what Christ is. Has chosen to do for this. Now, whether this is true or not, I don't know. But for me, when I hear that story, I think, okay, well, maybe that's it right there. Maybe there's something to be said for that. Does that help people? I don't know. But I mean, for myself, there's that tension, and maybe I'm just. I'm a clown, you know, that's all I can do is jump around. I don't know. Again, I don't think I've got the answer, but that's what comes to me when we talk about these things. For what it's worth. Is that too weird? I mean, I don't know."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2683.7,"end":2684.62,"speaker":"Jonathan Pageau","text":"It's what it is."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2684.62,"end":2693,"speaker":"Fr Christopher","text":"I mean, I've kind of come to the same place that, you know, I don't know if. If it's something to figure out."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2693.16,"end":2693.72,"speaker":"Fr James","text":"Yeah."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2694.12,"end":2758.61,"speaker":"Fr Christopher","text":"Other than just, you know, kind of embrace the. The tension of it. And you're. You're wanting to bring your Christ into every area of your. Of your life. And so, you know, we don't have this dichotomy or these little, like, segregated parts of our life. As Orthodox Christians, it's all one life. And so we just want to offer up all of our life, whether we're in church, whether we're at our job, whether we're in the recording studio. It's kind of. I think it's abamosis. I can't remember which desert Father is, but, you know, talks about, stay in your cell and it will teach you everything. And so I think kind of our cell is just whatever we've been given, whatever our obedience is, whether it's our job, it's our. The talents we've been given, whether one is a priest, icon carver, you know, and just, I guess, just seek to bring that presence of God into the midst of everything that we. That we do."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2759.01,"end":2823.82,"speaker":"Fr David","text":"We'd also, you know, we need to remember that Christ is the perfect example of all of this. Right. So his ministry was three years long, but his whole life, you know, as a carpenter, was he, like, carving crosses and giving them to people? You know, probably not that Would have been weird time. But, you know, his. His whole reality would have been offered up to the Father as a prayer. And because he's Christ, he does everything perfectly, which means it's perfectly humble, right? So when people come to me and they say, yeah, I'm thinking about doing this thing or whatever, I'm like, great, do it and do it as well as you possibly can, because when you do that, they get, well, I'll be prideful about it. No, you won't. If it's actually done well, it'll be done in the image of Christ and it'll be perfectly humble. It'll be a great offering. That's, you know, like Father Chris said, I don't think there's necessarily. It's not a problem. Like, Christ doesn't call us to be bankers or artists or lawyers or housewives. He calls bankers and artists and lawyers and housewives to be disciples. That's what he calls. So whatever you do, do it as well as you possibly can. It'll be a good icon. And if it's bad art, it probably stems from bad theology. Get your theology corrected."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2825.74,"end":2892.06,"speaker":"Fr James","text":"I remember at one point after becoming Orthodox, I've been orthodox for a couple of years and I was in a. I've been in a number of bands, but I. Well, a couple of bands. And the other band I was in, other than Luxury, which was a band called they Sing as they Slew, we were playing shows and we were playing shows, a lot of shows on Saturday nights. And I was. I was feeling really conflicted with this and I. So I would go to vespers and I. We'd leave. There we go, drive, you know, not terribly far away and play. Play a show. One night I was playing at some actually nearby place. So I was talking to the priest after. To our priest, Father Jacob, after service, and I just said, ah, I'm like, you know, I gotta go play the show. It's this dingy little club. And so I just feel so weird about it coming to vespers. And he said, well, like my brother said, he said, do good. Just do it well. Play well, you know, offer it well. And. And that actually really put my mind at ease. In fact, we played really well that night because I went with sort of a. A piece. And I didn't feel like I had to like, make this an orthodox event for the people. I just simply took what I had at vespers, went picked up my guitar and played a show and try to offer it to the Lord. And that was."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2892.06,"end":2894.98,"speaker":"Fr David","text":"That's what we did, Holy Spirit was really moving that."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2895.14,"end":2895.54,"speaker":"Fr James","text":"Really."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2898.02,"end":2913.74,"speaker":"Jonathan Pageau","text":"All right, well, Father David, Father James, Father Christopher, thank you so much for your time. And definitely let me know when the next album comes out. I'll really want to listen to it. And everybody, I think, is the documentary, is it streaming somewhere? Where can people find the documentary?"}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2913.9,"end":2921.5,"speaker":"Fr Christopher","text":"Yeah, it's streaming on, oh, I don't know, Apple tv, on Amazon Prime."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2921.82,"end":2922.54,"speaker":"Jonathan Pageau","text":"All right, okay."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2922.54,"end":2923.3,"speaker":"Fr Christopher","text":"Few other places."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2923.3,"end":2925.1,"speaker":"Jonathan Pageau","text":"All right. It's called Parallel Love, right?"}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2925.18,"end":2925.74,"speaker":"Fr James","text":"Yep."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2925.98,"end":2933.74,"speaker":"Jonathan Pageau","text":"Everybody look it up. And then on. You can on Spotify, check out Luxury. I have them on my. On my playlist. So thanks. Thanks for your time."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2933.9,"end":2934.38,"speaker":"Fr David","text":"Absolutely."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2934.38,"end":2936.35,"speaker":"Fr Christopher","text":"Thanks, Jonathan. Appreciate it."}
{"episode_id":"SW - #270 - 2023-01-24 - Luxury - Parallel Love","start":2936.83,"end":2998.91,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things simultaneous symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon, the Pageot videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
