{"episode_id":"SW - #406 - 2025-08-30 - Symbolism Explained - The Fundamental WWII Duality That Still Haunts Us Today","start":0.16,"end":62.41,"speaker":"Laura Diaz","text":"Tucson, the Weight is Over Mediweight Loss. They're officially open on North Oracle Road. That's right, no more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight and serious risks at mediweight loss. I got the same medication but with a customized plan, weekly check ins and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com so as some of you."}
{"episode_id":"SW - #406 - 2025-08-30 - Symbolism Explained - The Fundamental WWII Duality That Still Haunts Us Today","start":62.41,"end":1342.89,"speaker":"Jonathan Pageau","text":"Might have noticed, I've been talking more and more about the end of the World War II consensus about, let's say, the mythology of World War II and how it founds our world. I've talked about it on several podcasts. If you haven't followed, followed with Benjamin Boyce, with Winston Marshall, with Ali Tabrizi and and you know, I've also been talking about it on my own newsletter. So if you want to hear more about my ideas on that, you can look at in all these directions. One of the reasons why I don't want to make all these videos on my channel because I don't want to make my channel about that. I think it's important to talk about. But I actually talk about this stuff rather reluctantly because I don't like talking about politics. I'd rather talk about religion and culture and as we say, politics is downstream from that. But now because of everything that's going on, it's important, important to talk about some of the issues. And so I wanted to bring up just two images, the image of even the, the structure of World War II as the Axis and the allies and show that already in the way that we understand the division of the war, the main division of the war, we already have the structure of the World War II consensus in there. This is Jonathan Peugeot. Welcome to the Symbolic world. So for those who have been following, we are about to launch our new wrapunzel book very soon. We were so excited to get this into people's hands that we actually air shipped about a thousand copies. And some people were able to access those 1,000 copies we sold. I think it was 900 copies we had on sale. We sold 900 copies in like 26 hours. And so I'm really excited to see how, you know, people reading it and getting the first glimpses. We already have some reviews coming in. We it was also a way for us to test our new shipping service and our new distribution service. And we couldn't believe it. People were getting their books. Some got it on the same day that they ordered it. Other people's got them one day, two days later. And so we're really happy to see this new distribution system work out. And so we decided that the book is going to be launching explicitly in about a month. But we decided to still do a pre order for those who are interested because I recorded an audiobook version of the Wrapunzel book. And we also put together a kind of worksheet to go through the story with your kids, with your family. So we thought we could offer that to those who were willing to pre order the book. Those that already bought the first, very first thousand copies were able to get it. And so we wanted to extend that offer to those who wanted to pre order. And so go to wrapunzelbook.com and get your book. I cannot wait for people to read this because this is where the story gets interesting. This is where the threads are going to start to come together and where the characters are going to start to repeat. So get in on tales from once and ever. This is the third book. We still got a whole bunch coming. We've got three books that are in production right now and. And so, yeah, excited. This is the thing that gets me the most excited is this fairy tale project. So thanks everybody and go get your book. You know, one of the things that I've talked about for many times over and over is that in some ways the modern world is a radicalization of the question of the one and the many. In some ways, this division, I call it the separation of heaven and earth, where things move more and more towards a kind of radical unity, which. And a kind of tyranny and control, which can be represented, of course, as the bureaucratic state itself, as the nation state with solid borders, as the move towards more and more centralized identities, whether it is ethnic identities that happen, of course in the modern age as well. And on the other side, which is more and more of a kind of chaotic sense with the increase, of course, chaotic in the sense of moving towards multiplicity or the power of multiplicity. And in that sense, you have democracies in there, but you also have the revolutionary narrative in itself. You know, this idea that the many kind of come up and take over or defeat the One, because the One is dangerous and tyrannical. And then on the other hand, you have this sense that we need more and more state control and more and more unification, you know, first at the state level and now at the kind of world level. And those two narratives can play off each other, this movement towards one and this movement towards the many as a type of deincarnation. What you can see is that already in the structure of World War II, with the imagery of the Axis and the Allies, it's already there and it is already a reflection of what's going to happen. And in some ways the World War II consensus, because the. Of who won the war ended up setting up the structure for the next generation of what it is that we tend to prioritize. We can start with the axis, of course, if you look at the symbolism of the axis, an axis is a pole, right? An axis is a vertical thing or a vertical around which things turn. It is in some ways the one itself. And this is the imagery that was used. And if you look at the imagery, the kind of iconography of the Axis, you see this, this focus on uniformity. If you think of the, of the regimes, you know, this image of the, of the, the uniform, you know, the Nazi uniform, the, these huge squares of people walking, like this image of the power of, of unity, the power of one. And of course, the swastika is itself an image of the Axis. You know, the symbolist Rene Guino at the beginning of the 20th century suggested that the swastika was in fact the, the Polaris star and what we call the Little Dipper that is turning around that Polaris star. And so if you think about. It's like a point with a crook and some of older swastikas, right, they have a double crook that's similar to the, to the, to the, the Little Dipper, the Little Bear, you know. And so whether or not that's actually what the swastika is about, the, for sure, the, that imagery of the swastika as being a polar image would have been known by the people who developed it in Germany. Whether it's polar, whether it's Solar as well. Whether it is this idea of. It's like in some ways a kind of solar wheel. All of these images are images of centrality and origin and of unity very, very strongly. And so it is quite normal that the axis looks the way it does in the Italians, have the fasces. You know, this idea of this bundle that is tied together really strongly and represents the unity of the enterprise. And how, if we're bound into one, then that unity is much stronger than the multiplicity. Right. If you bind multiplicity together strongly, then it becomes extremely strong. And of course, the same with the sun in Japan, right? So the sun, the solar imagery in Japan, and the axial and solar imagery in the. In the swastika, the faskies in. In Italy, all of these images go together in terms of these images of. Of unity. And, you know, that's why there's such an emphasis on national unity, on racial unity, on hierar. Extreme hierarchy. All of this type of imagery is there in the fascist imagery. And now on the other side, what you have are the Allies. And so in the way that the Allies ended up coming together, it's interesting because if things had gone differently, like if the alliance between Hitler and Stalin would have held, in some ways, we would have had a kind of authoritarian versus more democratic regime, and that would have been the narrative structure, right? So you have authoritarianism and then you have this kind of, you could say democratic idea. But because the Allies ended up allying themselves with the Communists, with the Russians, what ends up happening is you really have more of the one and the many. And so now the revolutionary trope is the one that gets emphasized, you could say, narratively, where it is possible to ally ourselves with Communists because we are both, in some ways, anti. Anti. Anti. Hierarchy, Right? Anti hierarchy in the sense of origin. And this kind of. That type, the type of imperial, original imagery. And so they. All of this goes together. And so if you look at the imagery of the Allies, they don't have a kind of centralization. It's represented in some ways as really a loose alliance or a loose federation, which is what the United nations end up becoming. This idea of a federation of nations, Right? So when you use the word federation, what you're suggesting is, you're suggesting in some ways the power of the many, the power of. Of a kind of willful alliance, one that's not dependent on a. On a higher origin or on something higher that's binding us together. And there's a kind of flexibility in that. You know, there's A. There's a looseness to that. To that strength. And there's also a tendency to emphasize the individual, especially in terms of Western Europe and the United States. And so the image becomes a kind of ragtag. The ragtag army, right? This idea of an army of difference becomes the type of imagery that's used. And if you think about it, all of our narrative Since World War II, most of our narratives have been about that which is a loose, ragtag group that defeats a unitary principle, right? That defeats something that is too tyrannical. Whether it's Star wars, whether it's. Even recently in the recent Marvel series, Captain America has his Howling Wolves, which were like a bunch of different people from different nations, like each. Each person in his. In his battalion represented a different nation. And they're kind of all very. But their difference and the strength of their difference is what makes them flexible and have all these different qualities that are able to. To join together rather loosely in order to defeat this tyrannical, you know, authoritarian structure. And so this is, of course, the story that we've been. That we've been facing ever since World War II, which is. That's the narrative. The narrative is ragtag multiplicity against the tyranny of the One. But of course, that is not the full story, right? You could tell another story which is in some ways that the ragtag group becomes chaotic, becomes subversive, even to its own means, and that you need some kind of authority, Return of the King style, in order to re. Establish a form of order. Those two stories are legitimate because excess can come from both sides. But we've been pushing this story that very, very strongly. And this is something that. This is going to be tough for some people to swallow. But, you know, the. The rainbow coalition stuff is downstream from the Star wars narrative. It's downstream from the idea of the rebellion, of this loose alliance of all these different. Different groups of planets and all these different extraterrestrial races that are all facing this kind of all dark clad, you know, let's say European stock fascist imagery of the Empire, right? And so, you know, when the. When the. The kind of woke, people said, and even in Marvel and all of these movies, they said in some ways that they're completely being coherent with stories that already been there. Like the new Star wars movie, they were a continuation of something of an imagery that was already there. The original Star wars movies, which was this ragtag alliance of diversity against unity. Now, the thing is that that sometimes needs to happen. That sometimes is. You could say it's a normal narrative if it has a kind of reasonability to it. And like I've said, the emphasis on federation and the emphasis on, on, you know, an equality of multiple people has been the strength of the world since the end of World War II. And it has worked and it has held us together. But if you keep pushing in that direction, at some point you reach its fringes and you reach it excesses and then you reach a kind of inverted storytelling, right? The idea where unity is bad, where identity is bad, where the only possible identities are revolutionary identities. It's upside down stories. It's women ruling over men, it's minorities ruling over those that, that hold the nation or hold the, the name of the nation. It's, it's the idea of, of migrants or immigrants being more important, being more powerful, being more, having more, having more value than those that are, were there in the first place. And so like, you can see how if you push the story, which is a completely legitimate story, you end up with a kind of, a kind of excess which no longer holds. And then that excess, what it does is it calls to the other side. And this is what I've been warning you about, is that in some ways it calls the other side. It calls for a form of unity. It looks for, to go back to, you know, and then all the memes about the Empire was right in Star wars and that there's a lot of this, these kinds of memes that appeared, that's been appearing maybe since 2015, 2016, about how in fact, you know, maybe the other side was right. And the truth is that we don't need to go all the way to that direction, but we do need to be aware that we're reaching the end of one story. Like the, the, the push towards the image of loose federations fighting, let's say fighting unity is no longer plausible because we're looking at our world fall apart and we're seeing things crumble and, and we need to be able to reformulate unity. The danger is that the way the unity will be reformulated might be tyrannical. Either way that we go right, whether we go left or right, the unity might be tyrannical. Whether it's a kind of fascistic type nationalist identity or whether it is a globalist technocracy. All of these can lead towards forms of tyranny. What we really need is to find the balance again and to reformulate unity and multiplicity at every single level. At the local level, at the family level, at the city level, at the national level, so that we can avoid these movements towards extreme unity and extreme multiplicity. But what I wanted mostly for you to be able to see is to what extent that imagery is already there. It was already there right at the outset. And if you look at the way that. Let's say, you could say the way that the. The GIs are represented versus the way that we tend to think of the. The Nazi officer, right, The SS with their black uniforms, you know, and their. Their kind of very, very tight look, and the GIs, you know, kind of loose, everything kind of falling apart with all the stuff on them. You know, they look more like a kind of chaotic adventure. And there's something seductive about that, for sure. But you can see that the entire aesthetic of the Axis versus the Allies, if you meditate on it, you'll see that the fact that the Allies won then established which narratives were permissible and which narratives were encouraged until today. And they also are showing to what extent they've run out. And so hopefully we can find solutions that aren't. That aren't excessive. So what's interesting when you look at the way that the Axis and the Allies represent themselves is you can see that we have in some ways, a perfect storm of symbolism, which is. And this is in some ways, where the story becomes the most powerful. That is when if you have two opponents, those two opponents actually recognize themselves to be something. And so the Axis recognizes itself to be the strength of unity, the strength of the one. And the Allies, in some ways recognize themselves as being this federation, loose federation of people that are joining together voluntarily in order to fight something. And so you have this perfect storm because on the one hand, what you can do with the propaganda of the war is you can emphasize the negative aspect of the other side. And so what ends up happening is, of course, the Allies represent the Axis as being tyrannical, as being monolithic, as being an excess of the One. And that, of course, ramps up. Now, the. The Axis was already something like that. But what happens is that the propaganda effort, the pressure of the narrative, ramps up the stakes and makes the. The way that you represent the enemy even more and more of what they are in the negative sense and the same for the other side. Of course, the Axis propaganda would emphasize the Allies as being degenerate, as being subversive, as being chaotic, you know, as being mixed. Right? That was also an important aspect of the. You know, as being confused in the sense of mixed. And so now, all of a sudden, they've emphasized not the strength of a kind of loose federation of people, but rather the negative aspect of this, that loose configuration. And that's when you really have, let's say, a perfect storm. And the propaganda effort and the narrative pressure is also what created in some ways The World War II myth or the post World War II consensus is that that propaganda, you know, that they led to a story that became necessary for winning the war and a story that then became necessary for holding things together after the war had ended. And so it's not that the propaganda isn't based on images that were true. Like I said, the Axis and the Allies recognize themselves as being either image images of the one or images of the many. But it is rather the, you could say it is the. The desire to defeat the other that creates the, the type of pressure that makes the other side into an absolute evil that has to be destroyed. And then that. That narrative pressure continues after the war. War has won. And that can help you understand why in some ways it's kind of like a narrative virus that keeps taking up more and more space. And that's why in some ways the imagery of unity after World War II just get. Keeps getting pushed and pushed and pushed until even normal images of unity, like family or like nation or like heritage, all of these different things, unless it's revolutionary, becomes an image of fascism that is of course untenable. And that is one of the reasons why the pendulum is tending or wants to swing back, hopefully not to the completely to the other side, but is definitely swinging back as we speak. And so I hope this was insightful and that this brought you to think further on the question of where we are and what's going on. And thank you for your support of the symbol world. If you can, please sign up to the Symbolic world dot com. You know, you have all kinds of advantages signing up and it also is a possibility of, of supporting us financially as well. And so thanks everyone for your attention and I'll talk to you very soon. Bye bye. If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase. So go to thesymbolicworld.com and thank you for your support."}
{"episode_id":"SW - #406 - 2025-08-30 - Symbolism Explained - The Fundamental WWII Duality That Still Haunts Us Today","start":1343.37,"end":1407.46,"speaker":"Laura Diaz","text":"Tucson the weight is over Mediweight loss. They're officially open on North Oracle Road. That's right, no more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight Loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com pack up though, because Chevy."}
{"episode_id":"SW - #406 - 2025-08-30 - Symbolism Explained - The Fundamental WWII Duality That Still Haunts Us Today","start":1407.46,"end":1434.43,"speaker":"Announcer","text":"SUVs have the capability to take you to some incredible places. Like an adventure in the middle of in the Equinox Active, an SUV that will help you get away with confidence. Or head off for a night in the in Chevy Traverse with all the tech you need to stay connected. While the undeniable value of Chevy Trax will keep you moving from here to over here to way over here, get to all the places you want to be with Chevy SUVs. See Watson or O'Reilly Chevrolet."}
