{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":0.48,"end":31.63,"speaker":"John Vervaeke","text":"I think the myths are like the parable of Jesus. If you try to resolve it narratively, you mess it up, you lose it. Right? And I think what Plato's doing and what the Bible are doing is saying, look, you're always going. And this is, you know, and this is in the symposium. You're always in between. Metaxu. You're always, always going to be in between. And stop trying to be either an animal or a God. You're always going to be in between. And this is really relevant right now as we're facing a lot of emerging technologies that are going to put a strain on us around that."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":42.59,"end":104.64,"speaker":"Jonathan Pageau","text":"This is Jonathan Pedro. Welcome to the symbolic world. Hello, everyone. I am excited to be here. One with our usual friend and collaborator, John Vervecki, who everyone here knows. But then also I'm happy to introduce you to Jacob Howland. He is. Sorry, I forget the name of the program you're leading, but he is at the University of Austin and is an expert on Plato. And he just told us that he wrote a book on the Talmud in Plato, which both John and I would be very excited to look at and to read. We've been having several email exchanges, and we, both, John and I, have been really impressed by his insight on the Greeks, the agents, and how they're relevant to us today, and also noticing the University of Austin and just the courage they have to create something new, something fresh that tried to engage with culture today. So, Jacob, thanks for joining us today."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":105.12,"end":115.2,"speaker":"Jacob Howland","text":"Oh, it's really wonderful to be here, Jonathan. I've listened to you and to John on many occasions, and I'm absolutely delighted to participate in this conversation."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":115.98,"end":126.06,"speaker":"John Vervaeke","text":"Well, it's a great thrill for me to be able to talk to you, Jacob. Like I said, your book has had a huge impact on me, and I'm very grateful for that."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":126.38,"end":127.02,"speaker":"Jacob Howland","text":"Thank you."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":127.58,"end":146.62,"speaker":"Jonathan Pageau","text":"And so, Jacob, you kind of. You kind of wrote us several, at least several messages. I got several messages from you with John in the. In the messages, and you were. You've been poking at some of the discussions we've been having, some of the relevance of the ancient Greeks to the modern world today. So I'll let you kind of start us off and then. And then we'll see where it leads us."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":147.02,"end":311.71,"speaker":"Jacob Howland","text":"Yeah, well, thanks. You know, I think this particular conversation was stimulated by discussion you and John were having in one podcast about Plato's Symposium, and you were talking about the myth of Aristophanes. And I thought, you know, there's a lot more there that I think both of you could really relate to and that we could sort of tease out more of the significance of that myth in the Symposium. So maybe the way to frame it is to say that both the Greeks and the Bible are very interested in the relationship between aggression and sexuality, these sort of two fundamental forces. So if we start with the Greeks, you know, we have the, the legend of Hesiod where everything emerges out of chaos, you know, and you've got this heavenly God Uranus, who covers Gaia, right? Heaven is his name and he covers Earth and, and they have offspring and then he stuffs the children back into the earth, you know, and Gaia plots with her children, including Cronus, who eventually castrates his father Uranus. And from, from his genitalia that fall into the sea is born Aphrodite, which is very interesting because that's a kind of connection between, you know, here's this symbol of male potency and really aggression in the case of this God. And from there comes Eros, which sort of introduces in a way the story that Aristophanes tells. If we look over at the Odyssey, for example, to take another ancient Greek epic or story, Odysseus spends his time trying to get back home from Troy and he's constantly being trapped by these aggressive women. Calypso keeps him as a boy toy for seven years on the island and Circe turns his men into pigs. And even Scula and Charybdis are represented as these female sort of monsters. Remember, Skule is the six headed one that plucks men from his ship and Charybdis as the whirlwind. And I think this is actually can be traced to the result of the Greek war against Troy because the cities were emptied of men and then women kind of moved into the center of power. And obviously in the case of the Bible, you've got these very strange stories in the Bible. It's not the case that as with Odysseus, you're trying to get back to civilization, but, but you're trying to. The Bible is exploring how do we create civilization, how do men and women figure out what it means to be a couple, what it means to be a mother or a father, how to relate these drives of sexuality and aggression. And I think that's something that's really central to Aristophanes myth."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":312.11,"end":314.83,"speaker":"Jonathan Pageau","text":"So how do you see it connect to Aristophanes? I'm curious."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":315.31,"end":480.87,"speaker":"Jacob Howland","text":"Well, so in this myth and the Symposium, and maybe I should also give a little bit of framing here, The Symposium, of course, is a dialogue by Plato and the subject is love. The occasion is a party celebrating the poet Agathon's victory at one of the Athenian dramatic festivals. And everyone gathers at Agathon's house. And there are seven speeches recorded in the Symposium. And it turns out that through an accident, Aristophanes speech is the central speech. And this is important because in Plato, I would say in Sophocles, and we also see this in other poets and writers of our own day, the center of a text is particularly important. Aristophanes was supposed to speak third in the order of seven, but he got the hiccups, and so he switched places with a doctor named Eric Symmachus, and he ends up speaking fourth. I think this is important because the way I see the dialogue is that Aristophanes lays out a kind of anthropology, okay? And central to the anthropology is both the relationship between sort of untamed sexuality and untamed aggression, and then custom, in particular the rights and laws and rituals that are related to the Olympian gods. And the last speech in the dialogue is that of Alcibiades, this flamboyant, aggressive, erotic Greek famous warrior, kind of an uncontrolled man. His he had a shield, and on the shield was Eros, right? The God of love with a thunderbolt, right, which combines both aggression and sexuality. And in between those two speeches is the speech of Socrates, who has a. Who has this lovely account of how the soul longs to come into the presence of the beautiful and into the presence of transcendent goodness and beauty. And there's a sense in which I think the dialogue is a contest between the account of Aristophanes, which prioritizes aggression. We are fundamentally aggressive beings. The account of Socrates, which is very attractive, by the way, to Christians and to later religious thinkers, because the object of Eros is this transcendent truth and beauty. The contest between them is, in a way, determined. Or we're asked to think about Alcibiades, a kind of confused erotic and aggressive man, in connection with those two speeches. So that's a. That's a kind of framing. But I'm happy to then continue with kind of a discussion of what Aristophanes is saying in his myth. But maybe we can stop and see if there's any thoughts about this."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":481.03,"end":536.57,"speaker":"Jonathan Pageau","text":"I mean, I think it. I've always found the Symposium interesting in. When you understand also that there's a kind of the context of Alcibiades being the betrayer. You know, this idea that later on in the story, this is what's going to happen. He'll, he'll be one of the causes of the fall of Athens. And so in some ways you already have this frame where this passionate, aggressive person, you kind of know where it, where it goes, you know where it leads. And so I think that's also one of the reasons probably why Christians found the basic notion of the Symposium interesting, you know, because, because there's a sense in which these, these passions out of control and then are leading to the destruction of the city. And Socrates is trying to, you know, in that story of the seduction between, between him and Alcibiades, you know, you get a sense of Socrates is constantly trying to kind of be there and then take his desire and move it up towards something more towards, towards the beautiful, you know."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":536.73,"end":702.87,"speaker":"Jacob Howland","text":"Yeah, that's exactly right. And look, the Symposium is set dramatically because we actually know, I mean, Agathon was a historically existing individual and we know that he won this prize in, in the year 416, right on the eve of the Sicilian expedition. That was an expedition, a crazy far flung expedition to Sicily. The Athenians had this idea to send their whole navy over to Sicily. It ended in disaster. But the prime mover was Alcibiades. And his plan was to take the Athenians over to Sicily to conquer the rich city of Syracuse, to, to conquer the rest of Sicily, to then use the money and the sort of impressed slaves that they've conquered to conquer Carthage and then to take the whole force and go over and conquer the Persians, right. Sort of have world's conquest. It ended absolutely disastrously. But one of the interesting things, and some people have speculated that Plato is suggesting that on the night of the Symposium, when at the end of the dialogue, Alcibiades comes in completely drunk with a bunch of his sort of coterie of friends, that that might have been the night that Alcibiades participated in or was alleged to participate in the desecration of the Herms. Now there were these statues of Hermes and Hermes is depicted with genitalia and somebody went around and by the way, the statues of Hermes, he's sort of a God of the crossroads and stuff. So there would be intersections in Athens and statues of Hermes. Somebody went around and mutilated the Herms by cutting off his sex organs. And that's a very, let's say, anti erotic gesture. So, you know, in the background of this is this theme of Eros. And let me say one more thing. I would suggest that one of the great accomplishments of Plato is to reinterpret Eros. If you read Thucydides history, the pillar of the, of the Peloponnesian War. The word Eros occurs about six times. And eros isn't just sexual passion in ancient Greek, but it's any kind of really powerful passion. And when it occurs in Thucydides, it's essentially a dirty word. It's like, for example, in the Sicilian expedition, he says an Eros for the expedition fell upon the Athenians. And the Greek word fall is the same word you'd use if a disease sort of fell upon. And so what Plato does is he says it's not Eros. The problem isn't Eros, it's the objects of Eros. What human beings have a passion for is money and power and pleasure and so forth. We've got to redirect it toward these transcendent things. So this is very rich background, I think, for these discussions."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":703.19,"end":731.61,"speaker":"Jonathan Pageau","text":"And the Christian ascetics end up recapturing Eros, although in the Bible itself, it's not the word that's used the most, for sure. The ascetics end up bringing the word back. And so you hear, you read the ascetics talk about Eros as the prime, let's say the prime drive towards union with God. And that it is actually Eros that leads us into theosis. So you can see that they really bring back some of these ideas that are there in Plato."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":731.85,"end":860.1,"speaker":"Jacob Howland","text":"Yeah. It's interesting, though, because what we're going to see in Aristophanes is that Eros is a kind of cure or kind of medicine, let's say, to arrest our aggression or at least ensure that it doesn't have sort of the worst consequences in the Bible. It's very interesting because if you look at the story of Adam and Eve, it isn't until the introduction of Eros that is the splitting of the whole human being whom God created, called ha Adam, the human being. God created male and female. And remember that Adam, Adam can't find a partner. And then God finally puts him to sleep and, and, and, and cuts part of him, right, and sort of makes Eve out of, out of part of this whole human being. It's then, interestingly, that sort of trouble starts, right? For example, I've always been struck that, you know, there's this line in, in Genesis where it says that Adam awoke. And the verse says, ha, Adam, right. This is their primordially whole human being spoke. And he said, that's bone of my bone and flesh of my flesh. She's going to be called Isha woman, because she came from Ish, man. But this is the. This is. This is a mistake because woman didn't come from Ish, the male. Woman came from Adam, the whole human being. And so Adam, in his excitement gets this. The male becomes so excited that he breaks into this poetry and he says, she came from me. But actually, Haishah, the woman is taken apart from this primordially whole human being. And Ish, the male part, is all that's left over. So under the influence of erosion, the male becomes confused and believes that he is the source of woman. Right. There's a kind of forgetting of God. It's very strange in that story. Does this make sense so that. So that there's a sense?"}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":860.1,"end":918.47,"speaker":"Jonathan Pageau","text":"No, it makes sense because there's some weird things that happen in the Christian commentaries. You know, when you. You read in St. Gregory of Nyssa and other of the early commentators, they'll say things like, the separation of Adam is a preview of the fall. It's done. It's done knowing. They say things like, God knew the fall was going to happen, and it is done in preview of the fall. And there's a deep insight even structurally, in terms of storytelling, because the fact that Adam is put to sleep in order to. For this to happen is a preview of death. It's a little death that seems to happen that causes the division between the two. And then you see, as you move towards the fruit of the knowledge of good and evil, you're moving towards a world of opposites, basically. So I. They never go so far as to say that it's wrong. They'll say that it's good, but that they have a sense in which it's, like you said, there's already some movement towards a kind of broken multiplicity even in the separation."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":918.79,"end":1045.46,"speaker":"Jacob Howland","text":"Yeah, that's, you know, that's so interesting. And then, of course, sexuality figures. And this is. If we sort of go back to the Jewish tradition. So Rashi, the medieval commentator, when he's commenting on the serpent's seduction of Eve, right? And he says, oh, did God really tell you you can't eat this tree? No, he knows, you know, you're become as gods or as Maimonides says, as kings. The word Elohim can be translated that way. Rashi says the serpent wanted to sleep with Eve and that the serpent actually believed that the fruit would kill. Right. That if you eat of the fruit, you'll die. And so, and this is a really strange explanation, okay, but. And that. That he believed that Eve was intelligent and Eve was going to Take the fruit and because she was intelligent, she was going to test it on Adam first and give it to him and he'd eat it, he'd die, and then the serpent would have Eve. Now what's. It's a crazy story, but what's interesting there is the suggestion that sexual erosion confuses, right, and seduces and kind of messes us up, right? Which. Which I think is a human experience. But what's fascinating is that that particular story kind of reverses the order of Aristophanes. Because Eve gets this idea, right? It's after the division and you've got woman and man. Eve gets the idea that, hey, I'm going to eat this fruit, I'm going to violate God's commandment, right? Because either I will become like a God or if my monad is right, like a king, but I'm going to reach for something. And it's an act of aggression, right? That is a reversal of Aristophanes, because in Aristophanes, what's primordial is aggression. And Eros follows from a kind of divine intervention to try to sort of tamp down aggression. Now that I think of it though, I guess that you could sort of see, I mean, Eros doesn't exist in either case until some action of God, some action of splitting, right? So this is the kind of way that the Bible and Aristophanes sort of match up with each other."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":1045.86,"end":1396.95,"speaker":"John Vervaeke","text":"So you guys saying so much, I don't know where to make a comment. But maybe first to return to the Symposium. So one way, I've often framed Socrates speech as the speech between Aristophanes and oh, geez, I just dropped the name. And so, I mean, for me, I. I try to also look the overlaps. I. So the contrast and the continuities are really important, I think. And this is what Plato was playing with dramatically. Of course, there's a continuity between, in the Aristophanes myth, the seeking for wholeness that gets taken up in Diotima's ascent, the anagogic ascent. And of course the Neoplatonists made a great deal of that overlap. But it's important to realize that that sort of ascent, the Sikh did the right. I think I agree with you, Jacob. The idea of the ascent. I mean, Plotinus takes this up. You know, the knowing is the way we get whole and we have to know the right things in order to ascend. And I think that theme is taken up. But the El Sabadi speech reminds us about something important. Vuchnik. I think makes a good case for this in the tragedy. Reason is that there's nothing necessary to the ascent. The ascent is contingent. There's no. There's. Right. It doesn't. It's not. It's not. You know, once you start, you won't necessarily go up all the levels. It's contingent all the way along. And the. And the presence of Alcibiades is to remind us of that. It's like here's a person who literally hangs out with Socrates, deep, deeply attracted to Socrates, wants to be one with Socrates, probably even in a sexual manner, and yet he doesn't go through the anagogic ascent. And so I think what we're being said, what's we're being told here is there's a. There's a potential transformation available in that. That seeking for. For wholeness, which I think is the primordial thing behind both the aggression and the eros, right? That it has a possible transformation. But there's something very tragic about it because there's no necessity to it. We can enter into it, but we are quite liable to fail in a profound way. And that says to me something very significant about the relationship that Plato's trying to draw between Eros and anagogi and Logos. Because of course, a theme that unites all of these is this theme of giving birth, right? And. And so as you go up the ascent, you're giving birth to logo. You're giving birth. And it's not just speeches, it's also ways of seeing, ways of understanding. And this. And he also says, you know, the quest for immortality, sexual immortality, is something that we can sort of transform into oneness with eternity, if I can use those contrasts. And so I see all three speeches as trying to tell us there is something available to you. But there is. There's great tragedy available, also possible, in that you can transform this primordial quest for wholeness into the ascent to the one or the good. But there's no necessity in that. And Plato's really wrestling with something here, I think, which is really profound, which is we see, we have this weird relationship with this primordial. It seems to overpower us, but we seem to have options to transform it. But those options aren't guaranteed either. It like for me, that the finitude and the transcendence are so bound together in this. In. In sort of almost. You know, I keep coming back to the word tragedy, right? Like it's. We're bound to it. We have this capacity for ascent, and we can transform that primordial desire, but we can also just be overwhelmed by it. And then I think the question that emerges for me is what makes the difference? It's not even the presence of Socrates that makes the difference. Like, I come away from those three speeches sort of wandering deep into Plato, like, what makes the difference? Because as I tried to lay what I think his argument is, there's no necessity, right? So what. And I. And Plato's not, I think, offering just sort of a base. Well, you just choose. I don't think it's a raw existentialism or something. I think there's a. There's like a. Sorry, but I'm really on the edge of what I'm trying to speak to here. But there's something there that. What makes the difference between an Alcibiades and a Socrates that goes up the ascent. And for me, that's. That's the thing that sort of resonates because we're in the face of this godlike thing, right? Eros, and it's in between the divine and the human, and we're in that between place. What makes the difference? Because we're in the in between. There's no necessity either way, but what makes the difference? That's what comes out for me as the question. And so the Greeks, for me. Well, Plato, sorry, Plato, in the way he puts the speeches together, raises this profound kind of question that perhaps we could address to the Bible and say, what makes that difference? And, you know, and I think there's something going on. I'm a little more hesitant to talk about the Bible, but there's something going on about what. I mean, Jonathan, as I understand what you said, and I've read a little bit of the Fathers, it's like they're trying to get with, like this, this was going to happen, but nevertheless, you chose it to happen. And there's a necessity, but there's a choice. And it's good and it's bad. Like, there's a. I find that the two are resonating at this point of what is making the difference. So that's, that's what I want to."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":1396.95,"end":1417.71,"speaker":"Jonathan Pageau","text":"Bring to this, if I like my very, very Christian reading of the Symposium. So I'm not going to even apologize for that. But the. So when I. What I see, like when I, when I remember the Symposium, is that what makes the difference? It seems, it seems that there's something. Socrates is trying to do something with Alcibiades."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":1418.11,"end":1418.59,"speaker":"John Vervaeke","text":"Yes."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":1418.59,"end":1496.56,"speaker":"Jonathan Pageau","text":"Like he recognizes the arrows and he, he knows in some ways that this arrows, like you Like Jake, like you said, this is the means by which you can reach up. And he seems to be trying to transform his arrows. And he does it in different ways. He does it by kind of bringing him close to him and then refusing him in some ways or refusing his advances and then trying to kind of turn his advances. So there seems to be, I think that this is going to sound, like I said, very Christian, but it seemed like there's a. There's something of asceticism in what, in what Socrates is trying to do. It's like if you experience loss. Like if you experience loss of what you desire and you're able to kind of do that with the right. With the right attitude or the right mindset, then it, It's a. It's like a trampoline or it's like a. It's a new ground on which you can reach higher, you know, and so if you, if you to some degree tame or refuse some of your immediate passions, right, and you kind of hold them, then you put yourself in a position where you can maybe glimpse through them to something, to something more. But that's me, like during Lent now moving into Holy Week, saying that, well."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":1496.72,"end":1594.29,"speaker":"John Vervaeke","text":"But, but like, I don't. I'm not trying to put that aside. I want to put something beside it, which, of course, you know, Plato compares philosophy to seduction to being seduced. Because Plato's trying to deal with sort of meno questions about how can we know and not know. And the answer seems to be, well, love is a kind of knowing and not knowing. It's not a complete ignorance because it guides us in some way, but it, but it's not knowing or, or we would, we wouldn't be seeking and questing. So it's the in betweenness. It's this indeterminateness, right, that to draw somebody into that transformation, you have to seduce them. You have to. You have to get them to recognize the knowing and the not knowing and how they're interpenetrating each other. And so I don't. I think it's more. Socrates is at times. Don't think I'm disagreeing with you. I think he does what you said. I think he draws him in and refuses them. But I think that's part of a general thing of trying to get him into, you know, a kind of aporia, a kind of longing, you know, so that he'll be seduced towards the good. But see that. And this gets into again, like this thing, you know, again, it's. I keep. I think I Often find Plato is driving towards, he's trying to get at, oh, here's virtue, right? But you can't teach it, but you have to teach it. Like what turns people towards virtue is this thing keeps coming back again and again and again. I think of it as this like profound questioning and questing at the heart. And I mean, sorry, I'll shut up. I want to say I've been talking too much."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":1594.29,"end":1844.83,"speaker":"Jacob Howland","text":"I mean, look, I think this is, this is all right on track. The interesting thing about Alcibiades, I regard him as a philosophical casualty, right? Here's, here's this guy and let's just like Alcibiades is first of all extremely handsome. Well born, right? He's a ward of Pericles, rich, gifted as a warrior and a commander, very intelligent. You know, if you read for example, Plutarch's Life of Alcibiades, the guy is like crazy. I mean, he's, you know, he tells stories about how else is playing in the road with his other little boyfriends, you know, as a child. And a coach comes going along and all the kids scatter, but Elsevid, he stays there. And the guy is like, stops the chariot. He's like, you all, I almost killed you and why didn't you get out of the road? And he's like, because I'm playing here, you know. And then there's stories about how he would go into people's houses and just steal their silver or you know, slaps his father in law, all kinds of crazy behavior. There's a dialog called the first El Savadis. There are two dialogues called Alcibiades. And in the so called first El Salvadi, Socrates plays this seduction game with him, right? He's, it's kind of. He's almost like a pervert in some weird ways. Like he watches Alcibiades as a boy for a long time and then he approaches him when the kid's like 16 or 17. And here's Alcibiades again, who I think, you know, he must have thought, I have everything, I am full, I am replete, you know, because why everybody wants to be me. I am the great Alcibiades. And what Socrates does is he says at one point, he says in the dialogue, your eros for renown is greater than any other person's eros for anything ever, right? Like he. But it's so interesting because by the way, that's an ambiguous use of the word erosion because we're not talking like a love of the beautiful, we're talking About a kind of combination of aggression and erotic, I mean, this weird mysterious mixture that we find in the human soul, right? He wants to be number one. And Socrates says, you're not going to be satisfied with just being the top guy in Athens. You want to rule the world. You want to be greater than Xerxes, you want to be greater than, you know, the Persian emperor. And by the way, if you want that, you got to come to me. I can, I can help you right now, of course, what else the bodies finds and what we see as he reveals himself in his drunkenness in the Symposium is. I couldn't do it, right? Socrates is the only human being who ever made me feel ashamed. Now this is after, as you said, John, Socrates sort of puts him in this position. Like you think you have everything, but you don't. You're longing for something more. Initially it's posed as like being the ruler of the world or something, right? You're longing for something more. You need me. But then Socrates makes him ashamed because of Socrates virtue, right? You open him up and the gods inside. And, and by the way, Socrates is a seducer. You're absolutely right. What's so fascinating is here's this ugly man, sort of weird looking guy. There's a wonderful article called Socrates as Hoplite, where the author, it's in something called Ancient Philosophy in this journal. The author does all the research on Socrates and he shows that Socrates, although he was a poor man, somehow got the money together to buy the, the equipment that would allow him to fight at the level of a hoplite, which is a heavily armed warrior, and then distinguished himself in battle. In fact, Alcibiades talks about it in the Symposium. Socrates saved my life, you know, and then he, he, he, he rejected the honor that the, that the city wanted to give him. And so El Sabatis sees someone who really has it all somehow. This is, I'm going to just sort of foreshadow here something I want to come back to later. Socrates is replete like the circle people in Aristophanes myth, right? Like these, like they don't need anything else. He somehow has it. But it's the rock that El Savadi splits on. Because when I'm with Socrates, I have to do what he says, and when I'm away from him, I'm seduced by the call of the people, you know. So he really is this kind of philosophical casually. But I think your question is very well taken. What is it?"}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":1844.83,"end":1845.91,"speaker":"John Vervaeke","text":"How, how come?"}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":1846.39,"end":2061.64,"speaker":"Jacob Howland","text":"I mean, is it just the seduction of, of Being the great Alcibiades and being looked at by everyone and regarded as the object of their Eros that that prevents him from seeking beauty and truth. Hard to say. But maybe I can talk a little bit about the Aristophanes myth, right? Because it occurs to me, maybe some listeners don't really know what the myth is. So the myth basically is that human beings originally were these circle people, spherical. We had four arms, four legs, two faces, four ears, four eyes, faces facing opposite. And we rolled all around and we could do cartwheels really quickly. And we rolled up to try to attack the gods. We got big ideas. Zeus is perplexed and he decides, we got to stop these guys. He cuts us all in half. And the original human beings were combinations of male, male, male, female, or female female. So this is where we get the sexes, right? And the result is that our haves seek each other out and we long for our other half. Now, this is a big difference from Socrates account of Eros, because in Elsa, in Aristophanes account of Eros, we seek the other half to make ourselves whole. But we're seeking our original selves. For Socrates, we're seeking something other. We're seeking the ideas, we're seeking the truth, we're seeking the beautiful. But in any case, Eros, then, like originally, we were aggressive beings. We had big ideas. What we wanted to do is attack the gods. Eros is a kind of. What would you call, like, divide and conquer, right? But. But it's a. A kind of distraction because now instead of attacking the gods vertically, we'll go around horizontally looking for our other halves and trying to come together. Now, look at the tragic character of this. What we really want in the myth is to be bound back with our other halves and have our original integrity restored. Should that happen, we would then attack the gods again, right? I mean, because that's our original nature. So for Aristophanes, it's. And by the way, this is very true to Aristophanes existing 11 or surviving 11 comedies. They're all about sex and aggression and playing them off against each other to temper aggression. So famously Lysistrata. Now, this is the play in which the Athenian and Spartan women go on a sex strike to stop the Peloponnesian War. And it works. I saw this, by the way, as a boy in the 1960s. My mother took me to play at the University of Chicago, and it was quite shocking to me because the characters were walking around, they had broomsticks between their legs. The men were erotically Excited. Remember, one woman says, well, if you. She won't come by the hand taken by the handle. And she grabs him by the broomstick and drags him off the stage. Aristophanes was very popular in the 1960s because it was make love, not war, right? That really was Aristophanes message. And so it's the idea of playing these off against each other. But there's something tragic about Aristophanes myth because cutting people in half, it makes us less strong, but it doesn't get rid of our aggressive nature and it distracts us and we seek the other. And by the way, Eros is prior to sex because when the circle people were cut in half and they were hugging each other and so forth, they were dying in each other's arms. And then Zeus says, well, we got to have a further operation. We'll move their genitals around to the other side so at least they can reproduce. So, you know, that's a rather tragic vision. I think the Socratic vision is not tragic, except Elsa Bide's story is tragic."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":2062.75,"end":2077.95,"speaker":"Jonathan Pageau","text":"There's so many things flashing in my mind, you know, because when you were saying, you know, if they come together, then they attack the gods, right? The. The phrase that came into my mind right away was, you know, was. Was love God with all your."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":2078.03,"end":2078.43,"speaker":"John Vervaeke","text":"Your."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":2078.75,"end":2138.9,"speaker":"Jonathan Pageau","text":"All your might and love your neighbor as yourselves is that it seems that in. That, in. In our tradition, right, that, that in the, in the Christian tradition, I think also probably in the Jewish tradition, there's a sense in which if we. That there's an image between coming together as a people coming together in love and then, then becoming the body, the. The, you know, the place where God. Upon which God descends. And so some ways it's not. It doesn't have. That. Doesn't have that tragic, aggressive idea where if we bind together, then we attack vertically. So, right. So the top has to keep us separate in order. For there's this really dark image of how the world works, which is that. That which is transcendent, you know, divides in order to. To rule over it. Whereas there is a sense in this image of, Of. Of agape love, right, that if we, if we come together, then we become the receptacle, the. The people with which God communes. Anyways, that. That's just the image that came to me right away."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":2138.98,"end":2153.35,"speaker":"John Vervaeke","text":"But there is the biblical image of Nimrod, right, and coming in and God creating all of the languages because the people were trying to ascend to God in the tower and that. So, I mean, that theme is also found in the Bible."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":2153.35,"end":2154.19,"speaker":"Jonathan Pageau","text":"Yeah, definitely."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":2154.27,"end":2156.67,"speaker":"John Vervaeke","text":"Right, right. And so. And again."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":2157.07,"end":2181.71,"speaker":"Jonathan Pageau","text":"But it has. I think it has to do with. I think. I mean, this is now bringing it more into our usual conversation, John. But I think that what you see, what you see in. In the Tower of Babel in Nimrod is the idea that they had one language and they tried to have one name. And so there's the difference between the normal distribution of identity that happens in a. In a normal hierarchy and a kind of uniformity, which is that. Right. The top just tries to oppose itself."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":2181.71,"end":2181.99,"speaker":"John Vervaeke","text":"Right."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":2181.99,"end":2221.7,"speaker":"Jonathan Pageau","text":"You see that in the. In the myth of. Of Uranus and Gaia, which is that Uranus wants to impose himself on Gaia, but he doesn't want the children. He doesn't want this distribution of his identity into the world. And that's the. That's the problem. Whereas the normal. Let's say the normal kind of organic hierarchy is where the reality of our love for each other is real. And the multiplicity, that all the variation of the multiplicity is real. And then it finds, like. But. But the way that it's together in its variability is because it's connected to something which transcends it. And so there's this balance between unity and multiplicity that happens at all the."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":2221.7,"end":2383.3,"speaker":"John Vervaeke","text":"Levels, maybe that reflects. I'm thinking of Tillich's argument here. Right. We. We seem to be bound by two opponent drives. And I'm trying to see if this will link up to the relationship between eros and aggression. We want. We seem to be bound to participate, to integrate, to unify. And then we seem to be bound to the drive to individuate, to separate, to make ourselves different from others. And, And Tillich's argument is that if we try to. If we try to stabilize that by resolving it into one pole or the other, we will actually destroy our humanity. That our humanity lies in the polarity. And again, I'm wondering if we seem to be caught up in these themes of. We seem to have these, like, we're drawn into wholeness, but then we can get hubristic. And so we break apart. But then we get lonely. And Adam knew he was alone, right? We get lonely and we seem to be oscillating between them. And Are the myths. And I don't mean that word pejoratively. Right. Are the myths. I don't see the myths offering resolution to that. I'm not here to be. I'm not here just to be contrarian, but I don't see the myths as offering a resolution. I see the myths as sort of saying, that's it. Like, this is the perennial thing. You've got to accept it. You. You can't resolve it. You may be drawn in, but you're going to be. You're also going to push apart the eros and the, and the aggression are inseparably bound together because if you lose one, the other will destroy your humanity. That's, that's what I'm hearing the myths saying. And, and I thought Tillich did a good job of taking that up and saying, look, the thing you got to do is you got to accept, right, that polarity, you can't resolve it. It's. It's one of those tone offs, right? It's a tonos that that polarity actually defines your humanity. And so am I just being contrarian, but like, I'm trying to. I think the myths keep saying, stop trying to resolve it. I think the myths are like the parable of Jesus. If you try to resolve it narratively, you mess it up, you lose it, right? Like. And I think that, I think what Plato's doing and what the Bible are doing is saying, look, you're always going, and this is, you know, and this is in the symposium. You're always in between. Metaxu. You're always, always going to be in between. And stop trying to be either an animal or a God. You're always going to be in between. And this is really relevant right now as we're facing a lot of emerging technologies that are going to put a strain on us around that."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":2384.41,"end":2661.02,"speaker":"Jacob Howland","text":"Yeah, no, I think this is really interesting. You know, a couple of things here. So maybe it's useful to kind of go back and sort of look at this anthropology that, that Aristotles has laid out. These circle people are like bouncing around chaotically, right? They can roll around, they can move quickly. They're. They're like atoms. And by the way, the word atomos means uncuttable, right? So they're bouncing around and they threaten the gods. And so God has to. Or Zeus has to. Has to impose some order. There's got to be some kind of blow, right? So this is like the destruction of the Tower of Babel or the, I don't know, the expulsion from Eden, you know. And what's interesting is that Aristophanes vocabulary changes in his description. So when he first says that there were these three types, male, male, male, female and female female. After they're cut in half, he talks about men and women, not male and female. Men and Women are politicized, males and females. The way I read the myth is that Aristophanes is essentially saying, you've got chaos. Like he said, right? You've got chaos now. You have to have order. Where does order come from? It comes from law, Nomos. It comes from custom. It comes from the Olympians, right? That is to say, what happens when they're cut in half? Aristophanes says, then they had to walk upright or thus. Right? So you have, like, orthodox orthodoxy, right? They. Now look what happens here. I actually want to suggest at this point that. Well, I want to go back to what I hinted at earlier, which is Socrates is kind of like a circle person, okay? He's got four ears. He's got four. In other words, he's sort of in touch with reality. He can hear, he can see, he can look up and down and so forth. When you're cut in half, you're now standing up. You're looking forward. You don't have eyes in the back of your head. You're to look at what, at other men and other women, because you're looking for your other half, right? You're not to look up toward the gods and attack them. You're not to look back where you came from. You're not to ask about these fundamental questions. You're not to philosophize. There's a sense in which the Olympian religion is antithetical to this kind of fundamental questing and thinking. I think Aristophanes thinks of philosophy like Nietzsche does. It's a will to power. Okay? For Socrates, it's Eros. But so what happens here is that the gods cut, and then Aristophanes even says later, and by the way, if we keep up our aggression, they'll cut us in half again. Incidentally, Aristophanes, who even in the symposium it's mentioned, he gets the hiccups and someone says, like, I think he overate, you know, Aristophanes was allegedly a big guy and he liked food. And he talks about how cutting apples or eggs, you know, that's how they cut the human beings. I think there's more to it than just a joke here. I think the Olympians, in the Greek context, we are the food of the gods. They dine on us. In Homer, in the Iliad, the gods go up when they're having the big battles with Achilles. At the end, they're sitting in the trees and they're feasting. They're feasting on human beings. And there's a sense in which they they cripple us. They, they, they, they, you know, cutting us in half. They diminish our strength. They're there. So who is this human being? Socrates? He's somebody who does attack the gods, the Olympians, in this, in the Euthyphro, for example, right? He says, I don't like these stories about Zeus and, and Kronos and castrations and all these kinds of things. These are not the kinds of deities we should be worshiping. They're not worthy of the name God. Now you get in the Hebrew Bible and in the Christian Bible, God feeds us. We're not food of the gods. God feeds us, right? So there's some other thing going on there. But, but so there's a kind of, you know, I think Aristophanes being a poet and having written the Clouds, in which Socrates says, we don't credit gods, you know, and suggests that they're made up by each community. He doesn't believe in the Olympians, but I think he does believe in some kind of necessary divine order, so to speak, or necessary customs that restrict our sexuality and aggression. And so all this stuff is sorted out in a very different way in the Bible, but it still has to be sorted out because we're still the same human beings."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":2661.9,"end":2818.88,"speaker":"John Vervaeke","text":"So you think that I want to pick this theme up, the one theme that Socrates is somehow whole. I mean, this, the Symposium also takes great pains to identify him with Eros and being perpetually Metaxu not coming to completion. And of course, he knows what he does not know. And he will never have wisdom, the thing he longs for. He in fact regularly says he will never have. You can only love it. He will always be Metaxu in relationship to it. So, I mean, isn't Socrates also. He's also not complete. He's also fundamentally incomplete in that he's also always, always a lover of wisdom and always attacks you towards it. He always is like, because if he came to completion, Eros would end, the Metaxu would be over, the in betweenness would be over. And the philosophical quest. See, I see Socrates, right, as, as always, we talk like there's another, there's another, there's another way in which this plays out in Plato, right? Is there's another wholeness. Socrates is right. He's always aspiring. He's also, he's always aspiring, right, to his, well, his greater self or, you know, his divine double, to use Charles. Things where he talks about he goes home and there's somebody waiting for him at home, which is Socrates. But that Socrates is going to, you know, question him about the day and what did you do? And he's got his demonium, right, that speaks to him. Right. I see him, see, I, I see him as, as still divided and still seeking a kind of wholeness. But what Plato's trying to do is to say, you know, that wholeness that you're, and that you're seeking in other people, you're also divided against yourself in a fundamental way. That's what foolishness is. And, you know, Plato makes a big deal of that in the Republic. We're divided against ourselves. And what we're actually seeking is a way to come into relationship to our aspirational divine double, to come into what, you know, a kind of, well, something like wisdom, a kind of completeness. And so, yes, I'm not denying what you're saying. Socrates is clearly exemplary, but I see Plato is holding those two together. Yeah, he's somehow more like the circle people, but he's also still divided. He's clearly divided and he's still always in, in between, and still he's on a quest that he will never complete by his own and repeated admission. And so. Yes, first of all, does that land as a proposal to you?"}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":2819.41,"end":2824.13,"speaker":"Jacob Howland","text":"Absolutely. Look, Socrates is fundamentally paradoxical, right?"}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":2824.13,"end":2824.49,"speaker":"John Vervaeke","text":"Yes."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":2824.49,"end":2862.24,"speaker":"Jacob Howland","text":"I mean, look, you know, like, let's just take the apology, right? He's like, you know, he says basically two things, you know, that, you know, I am. He doesn't quite put it this way, but, you know, the God sent me, right, to you, I am sort of a gift of the God to the city, right? And I am a gadfly, which, you know, I'll bite you and you'll kill me. Right. Well, is he a species of pestilence, a gadfly, or is he God's gift? You know, I mean, you can sort of look. But what's interesting here is. So let's try to define the wholeness in some way. Alcibiades. If I posed the question, you read the speech of Alcibiades, does he love Socrates or does he hate Socrates? Right?"}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":2862.56,"end":2862.96,"speaker":"John Vervaeke","text":"Yeah."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":2862.96,"end":2884.39,"speaker":"Jacob Howland","text":"And the answer is yes, sometimes I wish he's dead. So, and this goes back to the aggression and the sexuality, right? Like it kills him that Socrates is greater than he is. And he makes it very clear that he is. You know, this man is so great. Now he interprets Socrates as, he says, it's just ironic, you know, he's just playing a game with us and so forth."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":2884.39,"end":2884.91,"speaker":"John Vervaeke","text":"And that's."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":2884.99,"end":2886.19,"speaker":"Jacob Howland","text":"I don't think that's quite true."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":2886.19,"end":2886.51,"speaker":"John Vervaeke","text":"But."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":2886.91,"end":3029.59,"speaker":"Jacob Howland","text":"But let's look at Socrates speech. Socrates basically says, aggression is misunderstood Eros. Thumas is misunderstood eros. What we really want is to come into the presence of the beautiful and bring forth in beauty. And people misunderstand that, right? And they, you know, they get the reproduction and the immortality and stuff, but they seek honor or children or whatever it may be. So he doesn't have that split in his soul. Like, there's a kind of inner integrity. And what's really interesting about Socrates, I agree with you completely, John. And by the way, I agree with Kierkegaard here. My Socrates is kind of. Kierkegaard, Socrates. You know, there's a point in the concluding unscientific postscript where Kierkegaard says, you know, Socrates is never finished. He's always striving. And most people, like, when it comes to education, they want to say, I'm educated. They want to be done with things. But Socrates is sort of like this, almost like an open wound, you know, like it's. He's constantly questing, and yet he has equanimity. You know, I'll just give you an example at one point, and this occurred to me, and I was sort of delighted with my own insight on this at one point, you know, Alcibiades is talking about how Socrates behaved in battle, right? And he says, you know, the guy was a great warrior. And so he says, and nobody could enjoy a feast like Socrates could. But then again, when food was scarce, nobody could stand up to hunger, you know, the way he could. Now, what's interesting is, like, the way he puts it is like Socrates alone could, like, really enjoy food. Why couldn't the other guys enjoy a meal? Because they're scared. Like, Socrates is not afraid. He is. He is. He has a kind of equanimity. His soul is not anxious and troubled. I would say the way that, like Alcibiades is. So there's a kind of wholeness that comes through being filled by beauty and being filled by. Now, again, he's questing for these things, but to some extent, he does achieve the nourishment of the beautiful. You know, it's not that he's like in the Feedrus and other places, he talks about how the true nourishment of the soul is truth, is the ideas. And I. And I think that that's a statement from his own experience, right? Like, he does get something out of philosophy. It's not as if he's simply striving and never achieving."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":3029.91,"end":3208.65,"speaker":"John Vervaeke","text":"I agree. I agree totally and this is what after Socrates is wrestling with all the way through. I mean, you've got these weird, this weird like wisdom is you have in virtue with result from you learning and knowing in some way. And yet he, he fundamentally knows that he doesn't know, but somehow he still becomes the wisest and, and most just man. You know, that's what's at the fate of it, which is pronounced over his death. You know, he was the greatest. And for me, that, that, that's, that's the, that's the tricky thing because it reminds me of. So we have Christianity and Judaism. So I'll. But I'll throw bring in some Buddhism too. It reminds me of the, the Zen. And it goes back to this, this thing that I'm trying to get at, what makes the difference. You know, you don't get enlightenment by seeking it, but only those who seek it will become enlightened. Right? These kinds of, these kinds of paradoxical things about it. If you say you're wise, that's definitely evidence that you're not wise. But then how could you ever know that you were wise? How could you even know you were making progress on what. There's all these. And this is what I get. I keep seeing this tremendous tension that you're constantly. If you try and settle it down, then you're, you're losing something. And for me, this goes down to, I think Plato's. This is going to be a Verbatian argument, so I'll just put my cards on the table. I think Plato's seeing something deep about intelligibility itself. That intelligibility is this constant evolving tension between integration and differentiation. If things only differentiated, we wouldn't understand them. If they became a homogenous one, we could not understand them. And the postmodernists like Derrida have made great careers out of this. And you can't stabilize it. You can't say, okay, now we've got the perfect balance, because that will also kill intelligibility. So for me, I think Plato is trying to get us to see profoundly that at the core of logos is this fundamental paradoxical tension. And I see that eventually taken up. I think, I see Socrates's learned ignorance, right, that he does taken up. Nicholas of Cusa. You know, you do this, you really push intelligibility. You get all these paradox. And then you come to realize that you can't act. The ground of intelligibility can't be captured within intelligibility itself. And I see that as what is fundamentally going on here. It's like, look, right, you stop it. You can't make this stop. And so what we most, if we are the creatures of logos, we can't ultimately fully possess ourselves because we can't bring logos to completion, to finish. And I, so again, and I think Socrates, I think your point is right, Socrates is the best, and yet he still isn't, you know, he doesn't say, I'm done, I'm finished, it's all right."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":3208.89,"end":3309.2,"speaker":"Jonathan Pageau","text":"Can I just want to say something because both of the, both of these are just kind of bouncing around in my head in terms of. If you think of, of the speech Aristophanes and you have this idea of the, the union of, at a horizontal level, right? And the idea that in some ways Socrates is not, you know, when Jacob, you say that he is that round person, right? He is that round guy. And so because he's that round guy, then his eyes can look up towards the God. So in some ways, like you said, he is trying to take, he is trying to reach into the sphere of the gods. He is trying to move up vertically towards that which should be the place of the gods. And what's interesting about that is that's why he can also live in this world of horizontality in the, in a way that is celebratory, right? So it's like, because he doesn't, because his, his, his, his eros isn't directed towards food, he can enjoy a feast without becoming a slave of his belly, right? Because his arrows isn't, you know. And so, so because of that and right. In some ways that's like kind of the secret of asceticism in some ways, right, is that if you, if you don't live for the pleasures, you end up actually being able to, to, to find pleasure in the world more than you did before. It's Chesterton, that saying that. It's like, you know, when I became a Christian and I stopped just thinking about cigars and, and food, and all of a sudden I enjoyed my cigars and my food more than, than before because, you know, my highest, my direction was change. You know, I wasn't just running after, after the things of this world. So it's, there's an interesting idea that, that, that the fact that, that in some ways Socrates is beyond what Aristophanes says is why he, he can look up, let's say."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":3309.36,"end":3453.73,"speaker":"Jacob Howland","text":"Yeah, look, no, this is, this is all great. I mean, let me, so let me, let me go back. The beginning points are really fundamentally different in the case, for example, of Aristophanes. And over there I put Hesiod and Homer and the rest and Socrates. So Aristophanes, again, we start with chaos, these chaotically bouncing around guys. And then you got to have order and it's the gods, right? It's the. Okay, so here's the thing. You're going to sacrifice to the gods, you're going to have rituals, you're going to obey the God's laws, and Zeus will strike you down if you don't. Okay? But Socrates doesn't start with chaos. Socrates starts with an internal guidance system. He doesn't need external moderation or externally imposed. Like now you guys are going to walk upright, you're not going to roll around and so forth, because he's not chaotic to begin with. The internal guidance system is Eros. And you're absolutely right, John. The ultimate object of Eros is beyond intelligibility, right? I mean, he calls it the beautiful here, let's say the good. In the Republic, you can't look at the sun, you can't. Good is beyond being. But so let's go back to what John was saying about. Sorry, Jonathan. About. About the horizontal and the vertical, right? So when Socrates looks at another human being, what does he see? He sees the glimmer first. He sees the. He's. I mean, we have that ladder of Eros and that's a. That's an articulated ascent, right? So you look and remember how he says you fall in love with another body, then you fall in love with the soul. By the way, this is phenomenologically correct, right? You know, you know, you go back to when you're a kid and you're like, oh, she's cut or something, and then you realize, like, well, you're actually interested in the soul of this individual and so forth. So he relates horizontally because he knows that the horizontal leads up. Let's take his relation to Alcibiades. Suppose that he had slept with Alcibiades. And by the way, that's a very aggressive act, right? Alcibiades, like, I'm going to sleep with him. I think the way I look at that is if he sleeps with Socrates, it shows that Socrates, he's taken him down, right? What you really care about is my body. I'm the, you know, he's the Marilyn Monroe of Athens, okay? And Socrates doesn't sleep with the Marilyn Monroe of Athens, you know, and it's very insulting to Alcibiades, but that is a gift to Alcibiades. You see, if. If he had slept with him, I mean, how cheap."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":3453.73,"end":3454.05,"speaker":"John Vervaeke","text":"How."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":3454.05,"end":3454.57,"speaker":"Jacob Howland","text":"What a."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":3454.65,"end":3455.25,"speaker":"John Vervaeke","text":"What a."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":3455.25,"end":3463.7,"speaker":"Jacob Howland","text":"What a disappointing, like, victory that would be. You know, there's. I mean, it's out of respect that he doesn't sleep with him."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":3464.9,"end":3465.3,"speaker":"John Vervaeke","text":"Why?"}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":3465.3,"end":3525.05,"speaker":"Jacob Howland","text":"Because there's. There are higher things. And so with this account, there's this internal guidance system, and it leads you up. And I agree with you, Jonathan, this is. This is what makes. This is what accounts both for his equanimity and his ability to enjoy, to be with other human beings. And it's the secret of community. What is community? It is both the unity and diversity that we. You know, you can't have a community without individuals. You can have individuals without a community, but you can't have that unity without each person being themselves and yet being together. And of course, the story of Babel is like. It's a big mistake, right? Because the human beings in Babel, I've always thought the bricks that they're. They're burning these bricks. The language they make the bricks out of ha Adama, which means the soil, the ground, which is where the word Adam comes from, is made from the. So it's like we take these and we bake the crap out of them, and there's nothing there. And then they're just bricks in the wall, right?"}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":3525.77,"end":3537.49,"speaker":"Jonathan Pageau","text":"In the wall. That's right. Yeah. Well, you see the same in Exodus, you have the same sense in which the pharaoh is wanting to reduce Israel to basically bricks in his system. It's like he doesn't."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":3537.49,"end":3537.69,"speaker":"John Vervaeke","text":"He."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":3537.69,"end":3576.92,"speaker":"Jonathan Pageau","text":"He. He gets rid. He wants to get rid of the males so that they're only something to act upon, something to kind of. To make into part of the system. So the Babel, Egypt can see the structure. And interestingly, like, we often say that in. In Christianity, we say that Pentecost is the anti Babel, Right? And the reason why it's the anti Babel is that it's both at the same time. And so it's all people hearing the one message in their own tongue. And so there's a unity and multiplicity, kind of almost like a extreme unity and multiplicity, which is. Which is kind of proposed as a paradox, simultaneous, simultaneously."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":3577.24,"end":3600.94,"speaker":"Jacob Howland","text":"Yeah. You know, I mean, so Babel's very interesting because. So that's in Genesis 11. Genesis 10 is another account of the origin of languages, which is a sort of organic one. I actually feel sorry for the people of Babel. And you know why? It's a strange story, right? The people came out of the east or whatever. Here they come and they say, let's build us this city and this tower, right? So we're, you know, so that we're like protected. We're not going to be dispersed."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":3600.94,"end":3608.58,"speaker":"Jonathan Pageau","text":"Yeah, protected from the flood. They just had a massive flood in the story. It's like they want to make something high so that they don't get taken out by the waters."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":3608.74,"end":3632.35,"speaker":"Jacob Howland","text":"Exactly. And you know, looking back, I mean, obviously there's going to be historical memory of all these things. Now their mistake is, I mean, if you sort of think about it like, well, who caused the flood? God? You're going to make this hard, hard target, right? Are you going to protect against God? That, that's not going to work. But so, I mean, you know, I could, I can understand these guys. I mean, they're mistaken, but they're, you know, they're trying to sort stuff out."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":3633.15,"end":3664.59,"speaker":"Jonathan Pageau","text":"Well, you just say you can understand anybody who tries to create too safe an environment or too strong an environment, who tries to protect their children so much that they just cripple them because they're trying to stop them from being in any danger. Like you can understand it, right? But you can also see that if you create a perfect system that tries to account for all accidents, all problems, all difficulty, you know, I mean, then you're, then you're actually going to stifle, create brittle, a brittle community that will, that'll break, that'll crack because it doesn't have its own resilience."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":3664.91,"end":3687.87,"speaker":"Jacob Howland","text":"And this is very opposite today. I mean, this is exactly it. You know, we've got these sort of ideals of we're going to, everyone's going to be safe and so forth. And you know, I also think, by the way, Alcibiades, he wants to be safe, he doesn't want to risk things. You know, there's a kind of instinct there as well. I mean, to expose yourself and say, yes, you know, I'm deficient and I'm ignorant and I need to learn."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":3688.27,"end":3747.4,"speaker":"John Vervaeke","text":"So I want to see if I'm drawing a couple of things together from both of you. Seemed like there was an idea in Socrates that the vertical dimension, the anagaric dimension, in which he's caught up in kind of a paradoxical relationship to the non intelligible source of intelligibility that allows him. Right. Equanimity in the face of the extremes of the human spirit. I heard that argument sort of emerging, right? So it's not that he has stepped out of his humanity because he can feast, but he can also. Right? So I'm hearing coming together, saying, like, you get into this relationship, right? And it's incompleteable and everything. Right. And in that sense it's properly paradoxical. But if you live, if you live the verticality of the paradox, you can get equanimity within the horizontality of the extremes of the human spirit. I'm hearing that argument being made. Is that, is that landing as."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":3747.72,"end":3754.95,"speaker":"Jonathan Pageau","text":"No, I think at least that that's what I really think that it makes, it's actually what makes something real is its connection to the vertical relationship."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":3754.95,"end":3778.23,"speaker":"John Vervaeke","text":"And so, but it has to connect a vertical in a way that allows the, the tension of the horizontal to be livable, right? So people don't lose their human. Socrates's equanimity is the preservation of his humanity, even as it's torn between all of these extremes that we've been talking about. That's what I'm also hearing the argument drawing together. Did I just impose that on you, Jonathan, or is that fair?"}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":3778.23,"end":3780.47,"speaker":"Jonathan Pageau","text":"No, I, I, I totally, I totally agree with that."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":3781.05,"end":3794.25,"speaker":"Jacob Howland","text":"Yeah, I think that's absolutely right. And I would also point out here that the vertical dimension is not going to work if it's conceived in the way Aristophanes conceives it, because what's on the top is Zeus. And the, and Zeus is just force."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":3794.25,"end":3797.61,"speaker":"Jonathan Pageau","text":"It's just, he's just a big rapist on the top of the mountain."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":3798.73,"end":3904.24,"speaker":"Jacob Howland","text":"Right, exactly, exactly. So you've got to have a Socratic or religious conception of, of this vertical. There has to be transcendence up here. And only then are you going to get this, you know, and today I'm afraid again, I mean, there are many echoes of our situation. It's like we have Zeus, right? It's like, okay, here's the order, here's the structure, right? Whatever it's going to be, it's coming down. It doesn't really have a logos. It doesn't in any kind of expanded sense, but it's control, right? And that's not going to work. The society will fall apart. And so, you know, again, going back to Socrates, his attitude is really remarkable. It's a kind of engaged detachment. You know, Like I, I think of Socrates as like a really good sport. You know, you have a game and you play really, really hard, and win or lose, it's okay, you gave it your best. And I mean, it's like in the dialogue they say, well, we shouldn't drink very much, right? They're hungover from the day before. And like, and Socrates, he'll drink or he Won't drink, doesn't matter. Right. He's sort of easygoing. Reminds me, John, since you're working with Kierkegaard now, of the night of Faith and fear and Trembling. This guy who's just easygoing and he imagines his wife's gonna make him a delicious dinner. And he gets home and of course, it's the usual stuff. It's all fine. Oh, you see it in the Symposium. Socrates stops on the way to Agatha's house and he thinks. And then Alcibiades at the end, because it's the. By the way, the whole speech of Alcibiades is like the beginning. At the end, he talks about how Socrates stood there and for 24 hours he was in contemplation and all the other truths."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":3904.24,"end":3934.56,"speaker":"John Vervaeke","text":"Very much. Very much. Is it. I can't remember. In the Symposium, they all get drunk and Socrates offers a proof of the unity of tragedy and comedy, but they're all too drunk to remember. Yeah, yeah, right. And I. And I don't think that's happened. Stent either. I think it points towards what I'm talking about here. Socrates is the. Is the metaxu. This way that can get. Give us. I think equanimity is a good word. Equanimity between tragedy and. The tragedy and comedy of the. Of human life."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":3935.04,"end":4008.74,"speaker":"Jacob Howland","text":"Yeah. And so also this. This vertical dimension. I should mention that, you know, one of the things Socrates does in any dialogue, right? Is let's take a dialogue like the Lockes. It's great. There's a couple of men and trying to figure out should their sons study with this. And, you know, it's very practical question, right? Like, should they study with this guy who's using a newfangled kind of weapon? And then the dialogue turns into a discussion of courage. So we start down here and we go up, right? To a sort of high universal set of questions. Socrates is sort of this. Always this weaving motion, right? We're not going to, like, take off into the, you know, go to the moon and not come down. We're going to come back down, right? That is to say, talk about courage so we can be courageous. And tragedy and comedy, this relates to it. Because if you're. If you're sort of on the ground and you're looking up, right? That's one perspective. But if you're high and you're looking down, I would suggest that's sort of the comic perspective, right? From. And in fact, Kierkegaard has something about this also in concluding in scientific postscript, when you when you look up from beneath with, with the divine sort of in prospect, it's tragic, but when you look down and you turn around and it's behind you, it's, it's comic, don't you think?"}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":4008.74,"end":4048.38,"speaker":"Jonathan Pageau","text":"In some ways, because I just keep having Dante that just keeps flashing back at me, you know, because it seems like Dante is working all this out in the comedy. You know, the, the problem of all these, you know, of all these. It's. His whole thing is about arrows, basically, right? David? Dante, everything that he writes is about arrows. Everything is about how the problem of desire and the proper alignment of desire and the proper directionality of desire. And then in some ways, that's also what Dante does, is to reconcile tragedy and comedy in that text, because obviously the beginning of that story is clearly tragic. And then once you move up, you have this transformation that, that occurs."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":4050.06,"end":4064.2,"speaker":"Jacob Howland","text":"Although I would just point out, though, the Inferno does have comedy in it. Remember those, those demons who are like in the mud and they're chasing around and all this stuff? I mean, it's interest. I, I take your general points for sure. Yeah."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":4065.32,"end":4139.88,"speaker":"John Vervaeke","text":"The question. Sorry, this is a very Socratic thing to do. I'm going to bring the question back again. I think this has been a good argument that's made, but again, Plato makes it very clear there's no necessity to this. I, I think, I think you're right, Jacob. The up and down. I mean, I think. David, David, David. D.C. schindler. In Plato's criticism, pure reason makes an excellent argument, right? And you, you even see it in the myth of this. You, you go out, but you go back down, right? The up and the down are like, it always have to be maintained. They both have to be addressed. The abs. If the, if the absolute does not reach into the relative, it's not truly absolute. And things like those kinds of arguments, which, of course, Christianity has done some amazing things with. And, but for me, it's still, I still like, what is it, what is it that makes Dante a lot of people, their eros is disproportionate, it's out of proportion, it lacks ratio. I mean, that's why Virgil is there, to remind us that. Right. Virgil represents ratio in a really important way. Right. It's like, but where, like, where, where comes forth the, the drive to bring proper proportion to one's era?"}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":4139.88,"end":4141,"speaker":"Jonathan Pageau","text":"All right, okay, I see what you mean."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":4141,"end":4143.16,"speaker":"John Vervaeke","text":"Yeah, yeah. Where does it come from?"}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":4143.4,"end":4158.36,"speaker":"Jonathan Pageau","text":"I mean, I think it comes from suffering. That's what I, I mean, I think that it's. When we suffer that. That we. It's when we suffer that we have the sobriety to measure our arrows. Like, it seems to me that. That."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":4159,"end":4164.2,"speaker":"John Vervaeke","text":"But we can also, because of our suffering, turn into resentment. That's right. Right, right."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":4164.2,"end":4172.68,"speaker":"Jonathan Pageau","text":"Suffering is an opportunity, you could say. But you're asking, why would one choose one and one choose the other? I understand your question. That's a tough one."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":4174.28,"end":4277.63,"speaker":"John Vervaeke","text":"I mean, there's practices one can do and things like that. But, you know, Socrates has his demonium and other things, and for those of us who don't have that, what is Plato calling us to do? Sorry, I'm going to keep pounding on this because this is, for me, this. I agree with the argument that's been made, and you said. I understood it properly. The vertical. Right. The vertical relation with the paradox allows you to properly proportion. Right. The. The horizontal tensions, and that gives you equanimity. And that's why the two are completely the up and down. Is. I get. I think that's a good argument. But for me, I, I think, you know, one of the. One of the criticisms. No, not criticism. One of the comments that David makes is, you know, you see, in Plato, this does too. And other. Plato keeps trying to find the starting point, like, where does this start? How does it start? And I, I'm sorry, he's infected me with this question is like, yes, but what is it like? And I, And I think about this. I think about the person who wants to offer the logos in the face of the sophist. The complete sofas, like sort of Derrida on amphetamines or something. Right? It's like, like what they're going to keep saying. They're just going to keep saying, oh, but all it's. They're going to do the hermeneutics of suspicion underneath it all, what causes the proportion is just a deeper desire that you're not acknowledging, and that's the deeper desire for dominance or power, because that's the, that's the deepest and most. And, and they have no justification for making that argument. I'm not, I'm not, I'm not agreeing with that argument. I'm just trying to ask the question of what is it that turns us."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":4277.95,"end":4291.71,"speaker":"Jacob Howland","text":"Well, look, this is a super profound question. Let me say that Plato, I think, leaves it open. If we look at the myth of her at the end of the Republic."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":4291.71,"end":4293.63,"speaker":"John Vervaeke","text":"Remember the myth of her. Yes, yes."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":4293.63,"end":4310.63,"speaker":"Jacob Howland","text":"You know, and people who have lived virtuous lives, then they go and they're judged and they're sent off for a thousand years to something like heaven, right? And people who have lived bad lives, they're go for a thousand years of punishment and then they come back and it's like this figure 8. It's like infinity."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":4310.71,"end":4311.23,"speaker":"John Vervaeke","text":"Yeah."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":4311.23,"end":4466.75,"speaker":"Jacob Howland","text":"And people make the next choice of the next life based on their experience of this punishment or delight. And the tragic thing is that, er, who comes back and reports, says the horrible thing is that for most people it was an exchange of goods for ill. So, you know, you live a good life, you're up there for a thousand years, you enjoy yourself and then. And then you get lazy. Yeah, you choose. You choose a tyranny or something like that. And he talks about one guy who came down and didn't read the fine print on the life he chose and he chose a tyranny. But those who've been suffering, right, they come back and they choose carefully and they choose a, you know, a decent life. But then of course, they drink of the river of forgetfulness before they're incarnated, so they forget all that stuff. But then there are these people called philosophers and let's just call, let's just for the sake of argument, say by philosopher, what we mean now is someone who has the correctly ordered soul, right? Someone who has solved this problem that you're pointing to, John, the question that's never resolved is how do those guys, like, those guys don't choose on the basis of, of their most recent experience and they don't drink as much of that water or forgetfulness so that they'll remember this, right? Where did they come from? And I thought about this a lot and all I can say is that what Plato does is he doesn't show how soccer, how philosophy is possible, he shows that it is actual, right? That is to say, here's Socrates, I can't explain him. Now, you could look at someone like Dostoyevsky, right? There's a sense in reading Dostoevsky and you look at people who are either saved or damned. And there's a way in which on some high metaphysical level, the human being makes a choice, like I don't know how to explain it. But, you know, there is a sense in which it is up to us that I think we have to believe that. And like Jonathan said, I like this idea of suffering. I mean, I know, look, as you get older, as I get older, I get more moderate. You know, my eros was. I was sort of a circle person and now I'm kind of. And because you realize like the limits and you. The more you Learn. And the more you know, the more you understand that you don't know and, and you're more cautious and so forth. And. But you know, fortunately I haven't had like any really horrible suffering. I don't know what that would do to me, but I would hope that it would turn to it. I would be able to turn it to advantage. But I don't know what the source of that would be if that's the case. Yeah, I just don't."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":4466.75,"end":4492.9,"speaker":"Jonathan Pageau","text":"For sure, like mythologically in the Bible that seems to be what's happening, right? It's like death is the cure for this problem. And that sounds like a horrible thing to say, but it seems to be what, what that is is that dying is the capacity to, to, to change. And the suffering and, and death is the, is the, the capacity to notice the, the gap."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":4493.06,"end":4493.34,"speaker":"John Vervaeke","text":"Right?"}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":4493.34,"end":4527.43,"speaker":"Jonathan Pageau","text":"It's like when you suffer you see the gap. And so the weird thing about the, the weird thing about the Christian answer seems to be something like choose to, to die on purpose seems to be. That seems to be the answer to it. It's like if you accept dying without it happening to you, then, then that is what will reorganize your arrows. And you know, Jacob, what you said about getting older, I think it's, I'm. I'm experiencing it obviously because I'm like I'm almost 50. I'm. I'm getting older and everything is that crazy."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":4527.43,"end":4529.83,"speaker":"John Vervaeke","text":"50 was a long time ago, man, for me."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":4530.63,"end":4624.5,"speaker":"Jonathan Pageau","text":"But what I mean is, but what I mean is that I can, I can see that. You know, my like my body is, is, is diminishing. Right? I can see that. And so I also noticed that my desires could not diminish. Right. And so, and then I see around me because I'm like I said, I'm coming close to 50. I see those 5253 year old guys who, who crack and you know, like leave their wife and buy a sports car and you know, marry some 20 year old or whatever. And it's like, you know, and in some ways I'm noticing that if I die, like if I, if I accept the death of my body and, and I, and I. Let's say it becomes an opportunity for me to reorient arrows. And so death is actually an opportunity for me to, to be saved from my desires. Like my body giving out is actually, is actually a wonderful thing if I can take it in the proper way where I can see it happening and notice that it's like, it's like, oh, those things That I wanted. Like I, you know, I want to be beautiful, I want to be in shape, I want to be this. It's like, you know what? I kind of have to let that go because it's going to happen to me now or later. I'm going to end a frail, decomposing body just like everybody else. And so I could hold on to that and be the tough guy and try to, to look like I'm 25 until I'm 60, but I can't do that until I'm 80. Like there it's. I'm gonna hit that limit. I might as well die consciously. And then, and I can notice that it's doing that to me. Like it's reorienting my desires necessarily."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":4624.58,"end":4708.71,"speaker":"John Vervaeke","text":"Plato does the same thing. Philosophy is a preparation of death, right. And then, and there's a connection between like philosophy as that which liberates you from the tyranny of the body and death as that which liberates you from the tyranny of the bodies. So the theme is there in Plato and then I'm trying to get clear. So is it, I mean, I don't want to turn you into Heidegger or something. Is it though? It's something like, like in Tolstoy, Ivan Illich always knew he was going to die the way, you know that two plus two equals four, but now Ivan Ilyich knew he was going to die. There's a non propositional waking up to your mortality that can sober you up. And perhaps Alcibiades never wakes up. I mean, I think people who want to conquer the world are somehow thinking they will, they. They will not be mortal by doing so. So it is. I'm not going to trap any of us in like an infinite regress where like the four year old. Yeah, but what came before that? But so because I'm trying to get at. Is there a proposal here from you, Jonathan, that what can make the turn is somebody properly awakening to their mortality? But for that to genuinely be the case, it's not something they do, it's something that has to strike them, it's something they have to suffer. Like if you just state your mortality, you're not actually experiencing your mentality. You understand what I'm trying to."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":4708.71,"end":4726.88,"speaker":"Jonathan Pageau","text":"Yeah, it probably depends on people. Like some people will they. They won't necessarily need a massive blow from life for that to happen to them. And then some people you meet that have, have gotten that massive blow and then they, if they take it properly, they're transfigured. You can, you know, I've. I've met several people like that."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":4727.12,"end":4727.68,"speaker":"John Vervaeke","text":"Okay."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":4727.92,"end":4737.28,"speaker":"Jonathan Pageau","text":"But then you can also keep your mind. Like with a recent saint in the Orthodox church said, you know, keep your mind in death all the time. You have to remember death. Like that's how you do it all the time."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":4737.36,"end":4738.04,"speaker":"John Vervaeke","text":"And it's still."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":4738.04,"end":4738.64,"speaker":"Jonathan Pageau","text":"Don't do that."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":4738.64,"end":4811.07,"speaker":"John Vervaeke","text":"Practicing that too. And I, I think this is a good answer. And I'm starting to feel like my question is being addressed. What do you do then, since you both are leaders of the. Of the Old Testament? I, I don't know if that's a pejorative way of talking about it to you, Jacob, but, you know, so Pharaoh keeps hardening his heart and all the plagues keep coming, and then God hardens Pharaoh's heart, which sounds like. Yeah. So in the end. Right. This can also. Right. The external can also do the opposite to you. Right. Your mortality can somehow be a vector by which what is ultimate can prevent you from ever waking up. That's what I take. Hardening the heart to me. Right. It was now impossible for Pharaoh to wake up. Right. What do you do with that then? I mean, that's in there for a good. I mean, yeah, yeah, that's in there for a good reason. I, I presume. I mean, I'm not a Jew, I'm not a Christian. And Pharaoh continued to harden his heart. But no, right. There's this. And it's like. It slaps you in the face. It's like, what's going on there? Well, so what. What do you. Again, I'm not just. I want to. I want to hear more what both of you have to say about that."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":4811.23,"end":4886.43,"speaker":"Jacob Howland","text":"You know, I think it's really interesting that you mentioned that example. I kind of want to draw a connection between Pharaoh and Alcibiades because, you know, I mean, what is Pharaoh doing? He's doing something that's very, very human in a way, and that is. He's doubling down. Right. I am not going to back off. Like, you know, and why isn't he backing off? Well, I mean, I should say. I mean, I. The issue of the hardening of the heart, I think the best explanation isn't that, you know, God did something to Pharaoh that wasn't that Pharaoh wasn't inclined to do. I think it's that it's something mysterious there. But, you know, God allowed Pharaoh to be supremely pharaohish. You know, like, he didn't sort of help him to see another way. He just let him do the Pharaoh thing to the ultimate extreme. Right. And we can easily imagine. I mean, we see leaders today, you know, who are sort of doubling down on sort of bad bets and so forth. So why didn't Alcibiades like Socrates was the blow. I think he sort of split Alcibiades in half in a way. Right. Socrates was the blow that Alcibiades needed. But it didn't work."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":4886.67,"end":4888.27,"speaker":"John Vervaeke","text":"Yes, it didn't work."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":4888.75,"end":4960.62,"speaker":"Jacob Howland","text":"And, you know, I mean, I think Jonathan was talking about getting older and how we react to these things like the decay of the body and so forth. And some people react to them with, you know, just despair, let's say. Or, you know, it's the most horrible thing that could happen. And other people see opportunities there, you know, I mean. And so why would you be inclined to take it with equanimity? Right. Well, because somehow in your soul you feel that there to each thing there is a season, you know, that there is a kind of order. Right. And I mean, so, like, I have a granddaughter, you know, so I'm a grandfather. I could imagine someone who says, oh, my gosh, I can't believe I'm a Grant. I must be getting really old. That's not the way to look at it. The way to look at it is now you got an opportunity to be with this wonderful child, to correct your mistakes as a parent without obligations as a parent and so forth, and you can have a different kind of relationship. These are doors that are opening. What's the difference between these things? I think that part of the problem with both Pharaoh and Alcibiades is there's nothing above their heads, you know."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":4961.34,"end":4962.98,"speaker":"Jonathan Pageau","text":"Pride. Yeah, yeah."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":4962.98,"end":5000.39,"speaker":"Jacob Howland","text":"I mean, you know, the Jews, like this is Passover, right? In Easter season, you know, they wear these little kippas, these yarmulkes, to say, there's something above me, there's something above me. There's no one above Pharaoh. He's a living God. And there's no one above Alcibiades. And so he's going to be trapped in this horrible dynamic where, you know, I mean, if Aristotle is right, that people who seek honor want to be honored by those that they respect and admire, and then if you say, here's Alcibiades and he essentially respects and admires no one because he's the greatest, you know, then he's not going to be fulfilled with the honor of all these little people."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":5000.47,"end":5002.91,"speaker":"John Vervaeke","text":"Yeah, that's the Hegelian master slave thing."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":5002.91,"end":5005.11,"speaker":"Jacob Howland","text":"Yes, exactly. And yet he's addicted to it."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":5005.27,"end":5005.75,"speaker":"John Vervaeke","text":"Yes."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":5005.83,"end":5011.75,"speaker":"Jacob Howland","text":"It's only Socrates that who he truly admires. But he can't be Socrates, and that's what he wants to be."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":5011.83,"end":5020.01,"speaker":"John Vervaeke","text":"Well, that's how I understood the Pharaoh thing. Like, if you bind yourself enough, like in addiction, then you get caught up in something that binds you."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":5020.41,"end":5109.37,"speaker":"Jonathan Pageau","text":"So it's interesting because in terms of storytelling, you know, in the story, in the story of Jesus, you see moments of this, this problem, they appear. Oh, first of all, Christ. I mean, Christ presents himself as the, as the capstone and the stumble stone is a good way to understand it, right. It's like the foundation stone and the stumblestone at the same time. And then when Christ is on the cross, then you see it play out where you have two thieves that are looking at the dying innocent man. And one, you know, one turns away, one turns towards him, one mocks, one derides, and the other, you know, has a movement towards. Towards him. And so you can see how the same act, right, this, this dying man is acting in opposite ways. It's almost like a judge, right? It's like he's acting as a judge on those two people around him. And that maybe that's it in some ways that it, that it actually can do both. It does both at the same time. And like you said, it's hard to know, like why, how. Why we're disposed. Humility. But then why humility? Like, why do we, why do we go in that direction? And so I think in the end, what Jacob says is that we are faced. In some ways we can only ask that question of ourselves because that's the only experience we have. And maybe that's probably the key is to just say, I don't know. But I definitely myself, I'm hoping I'm on the side of the one who uses this as an opportunity."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":5109.93,"end":5123.37,"speaker":"Jacob Howland","text":"Yeah, I think that's good, Jonathan. I mean, suppose, John, we had a convincing theoretical explanation of your question. It would still be the case that we're going to have to act in accordance with the right, you know. Yeah."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":5123.37,"end":5126.21,"speaker":"John Vervaeke","text":"And I, I hope it didn't come across that that's what I was after."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":5126.61,"end":5127.09,"speaker":"Jacob Howland","text":"Of course."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":5127.33,"end":5188.41,"speaker":"John Vervaeke","text":"Right. And. And, you know, and we've got to sort of a Kirk, a Guardian point where, yeah, there's this thing that you, you're participating in decision being made. It's not that you don't. It's not that you make it, and it's not that it's imposed on you and you participate in it. So it makes me now make this proposal to you that all of this feeds into a fundamental thing within the Platonic framework, which is the notion of participation, about the relationship, the relation of participation that constitutes the vertical axis, but also constitutes how the horizontal things are bound together. And for me, I guess I'm sort of. I want to say something like that. I find that a resolution, although I don't find it like, like you said, Jacob, I don't find it an answer like a theoretical, like, oh, look, John, here's the formula. X plus Y equals determination. Right? All right, But I do, I do. This idea that we are all ultimately. Things are ultimately grounded in this, this, this participation."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":5190.97,"end":5214.26,"speaker":"Jonathan Pageau","text":"You talked to Father Maxis about that. Like, the idea of synergy, like, that's, it's, that's. It's a beautiful way to portray it. Like, in some ways it's like you just, you know, you, you can't do it on your own. You. But you open the door, this little sliver, and then a bit of light comes in, and then it kind of gives you the courage to open it a bit more. And so there's this, this, this call and response mechanism, you could say."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":5214.26,"end":5260.52,"speaker":"John Vervaeke","text":"Yeah, I agree. I think it's dialogical, properly understood, you know, and there's what. Tillich and Plato come together. But, but, but even, even that, Rick and I, the remarkable. Somebody said I should replace amazing with remarkable because then I get all mars. The remarkable Rick Repetti we're trying to do about. Because the problem, the problem we're up against is the paradox of self transcendence. Galen Strossen made a very good point about this. If, if transcendence means something other than what I am, then I can't possibly make it right. And if it just means the extension of what I am. Right. Then it's not transcendence. It's just, it's just growth. And, but somehow we put the two together with self transcendence. It's a paradoxical thing. Did that first of all make sense as a paradox?"}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":5260.52,"end":5285.43,"speaker":"Jonathan Pageau","text":"Because, I mean, I would tend to say it's the source. Like, because the source of what you are isn't you completely. Although it's at the, it's at the. It's at the origin. Right? It's like the, the origin of something isn't in the system, but it. Without it, the system can't exist. And so it's like all the system is pointing to that is pointing towards it, but it transcends it. But not in a weird arbitrary way. It's. It's actually the source of it."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":5285.43,"end":5326.24,"speaker":"John Vervaeke","text":"Well, that's what I'm. You're doing. You're doing, you're enacting participation. And so I think there's something about. Because what I can say, and then give me a chance to respond to what I'm saying, right? I could say to you, oh, but what is a self? How can you. How can there be a self if its source is outside of itself? A self is something whose source is within itself. That's what it is to be a self, Right? And then the answer to that is, well, right, but you have to understand a self is something that is inherently participatory and dialogical in nature, and that's the perfect guardian. And also, I think the Socratic answer, right, the self is something that is inherently. Is inherently dialogical and therefore inherently participatory through and through."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":5327.12,"end":5368.78,"speaker":"Jacob Howland","text":"Yeah, I think that's absolutely right. I mean, look, you know, from the Platonic perspective, the soul relates to reality. I mean, it. You know, it relates to the good, it relates to the ideas. It's open, and that's where its measure is. I mean, it's interesting because if you sort of think about the story of, you know, the Tower of Babel, like, the question is, are the measures of God going to be the human measures or the measures of man? You know, I mean, and so there's. There's a kind of. So the self can't be understood without relation, without pointing to what is not the self. The answer to the question of how this question of self transcendence ending in the Platonic context, we're going to have to go back to Eros, right?"}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":5369.58,"end":5370.62,"speaker":"John Vervaeke","text":"Yes, exactly."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":5371.58,"end":5402.79,"speaker":"Jacob Howland","text":"So that, I mean, Eros can provide this ladder or can provide this relationship. Alcibiades is Aristophanic in the sense that he's really seeking his other half. In a way, it's all about himself. His eros is directed toward this vision of who Alcibiades could be. And so, yeah, I mean, looking out to the other. And then, you know, and then of course, this weird Kierkegaardian thing as well, right? That love of self turns into love for love of another, but then that love of the other is actually the fullest self fulfillment."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":5403.59,"end":5497.44,"speaker":"John Vervaeke","text":"Well, I was gonna. I was gonna say that. I mean, you bring up Kirkegaard. I mean, aren't we all. Aren't we ultimately proposing the final transformation? Right, Plato does. Transforming Eros. And then, of course, Plotinus also puts it in motion, right? And then Christianity comes and sort of says, but. But in the end, the. The love that puts you into a relationship with the other, by which you come to Fulfillment is agape. Right, right. That is the love that creates the other. That then nevertheless has come from you. Like, because the model is the. The parent with the child. And of course, the giving birth is all through the. The symposium as well. So is. Is that what we're coming to here? That when we. Like, what turns us is that. That which we are turned, when we participate in the transformation that is always available to us of Eros into agape, is that now coming out? Because that's the. That's the thing. Right. Because there's a sense in which if. If I'm just drawn to the other rather than participating in the selfhood of the other, I'm still. There's still aggression, there's still violence at the heart of it. It's only in agape where that. Where the resolution could finally come to be seen. Because there I am. It looks like violence because I'm creating the other, but it's exactly the opposite of violence. I am giving myself over to the full. Giving and participating in the other, becoming a self beyond me and other than me, but nevertheless in relationship with me."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":5497.52,"end":5506,"speaker":"Jacob Howland","text":"You know, what I like about that is actually, that's a wonderful description of how Kierkegaard regards Socrates. Right. In other words."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":5506.24,"end":5506.72,"speaker":"John Vervaeke","text":"Yes."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":5506.8,"end":5547.53,"speaker":"Jacob Howland","text":"You know, here's the thing about Socrates. When Socrates is relating to you, you are the center of the universe. He is relating to you. There's a very beautiful book called the Last of Them of the Wine, and it has a description of Socrates speaking to the main character. And he's. He's a boy, you know, and Socrates comes and sits down next to him in the grammar school, and the kid turns around and looks at me, says, no adult ever looked at me like that. Like, his eyes were just on me. It was about me. And so, I mean, this is interesting because, as you know, I mean, Kierkegaard loves to sort of have these kind of asymptotically approaching lines, you know, Christianity and Socratic."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":5547.53,"end":5551.25,"speaker":"John Vervaeke","text":"Yeah, Socrates, Jesus. Yeah, yeah, very much. Very."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":5551.25,"end":5552.21,"speaker":"Jacob Howland","text":"Yeah, yeah."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":5552.77,"end":5564.13,"speaker":"John Vervaeke","text":"And that gaze. But the gaze is not, you know, the consumative gaze, it's gays. It's the gates that is helping you to give birth. Right. It's affording you to give birth to yourself."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":5564.45,"end":5590.41,"speaker":"Jacob Howland","text":"Exactly, exactly. And, you know, I mean, this is one of the pleasures of teaching. I mean, this is. This is why so many of us, like, stick with it, you know, I mean, because there's nothing more fulfilling than seeing a young adult grow and flourish and mature and bring forth wonderful things. That's the Fulfillment of the teacher. And I think Socrates was a teacher."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":5590.81,"end":5614.53,"speaker":"John Vervaeke","text":"So could the difference be the degree to which, again I'm not looking for a formula. The degree to which people have been, I'll use Platonic language here. The degree to which people have been impregnated by agape. Is that the thing that can wake them up? Because the degree to which agape is alive in them is the degree to which they can waken up. Is that, is that a possibility that, that rings with the two of you in any way?"}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":5614.85,"end":5633.91,"speaker":"Jonathan Pageau","text":"So in some ways you would suggest that, that, that it, it's not just a self will thing, right, that you could encounter someone, you know, that would, that would provoke like by, that, by the, by their communion, by the way they look at you, by the way they, they, they treat you. That they could provoke in you that response."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":5634.15,"end":5635.75,"speaker":"John Vervaeke","text":"Yes, yes, yes."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":5635.99,"end":5639.91,"speaker":"Jonathan Pageau","text":"Yeah, I think it's definitely one of the, one of the possibilities. Definitely."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":5639.91,"end":5640.63,"speaker":"Jacob Howland","text":"I like it."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":5640.71,"end":5642.15,"speaker":"John Vervaeke","text":"Yeah, it's very good."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":5642.55,"end":5677.92,"speaker":"Jonathan Pageau","text":"I think this is a good place to stop our first conversation though. I feel like this is not going to be our last. This was wonderful. I really, and I have a lot to, I definitely have a lot to think about and certain links, you know, because I kind of dismissed Aristophanes, you know, as the butt of the joke in the, in the symposium. And I think though he's still, he still is to some extent for sure. But, but, but seeing it frame more as a, as a structural move between the different, the different speeches helps me to, to see how there's definitely something to take from, from his, from his myth. So Jacob, thanks for this wonderful conversation."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":5678.32,"end":5683.93,"speaker":"Jacob Howland","text":"Oh, thank you guys. It's, it's, it's, it's really wonderful to be able to talk to both of you, of you whom I admire so much."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":5684.01,"end":5743.86,"speaker":"John Vervaeke","text":"So yeah, this has been great. I really, I really appreciated this a lot. Yeah, I, I, I, I, I like the fact that we, you know, we. I hope this is, I hope this is not self promotional. I mean I'm, I'm in the midst of after, I mean I'm done but after Socrates is still rolling out and we're doing exactly this with the, the piece on Socrates and Kirtgard again influenced by Jacobs wonderful book. And so I found, and I hope this isn't me appropriating things unduly, but I found everything we were doing here just wrestling and wrestling fruitfully the way, you know, you know, Israel wrestled with God, right? Wrestling very fruitfully with the, with this, these questions that are in. So I'm very grateful for this. You know, I think this is an excellent companion to that part of the After Soccer series. So thank you very much for that. I know it just, it's a gift in that way. So I really appreciate it."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":5744.1,"end":5763.46,"speaker":"Jonathan Pageau","text":"All right. And so I will be. I will finish this, though. I will shamelessly plug something which is that, that John and I were going to be in Chino, California in May. And so we'll put a link to that in the description. I don't know even know if there are places left, but if there are, it's, it's. You have to, you have to get them because it's going to be a great conversation."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":5763.67,"end":5774.55,"speaker":"John Vervaeke","text":"The search for a spiritual. The quest. Sorry, the quest for a spiritual home is the theme of the conference. And you can see how that was all through what we were talking about here today."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":5774.87,"end":5783.79,"speaker":"Jacob Howland","text":"So I don't know anything about this conference, but I'd like to learn more. So listen, if you guys send me your addresses, I'll make sure you get a copy of my book on Plato and the Talmud."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":5783.79,"end":5789.83,"speaker":"Jonathan Pageau","text":"So great. All right, thanks to. Thanks to all of you. And so, so to everybody watching. We'll talk to you very soon."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":5789.83,"end":5790.22,"speaker":"John Vervaeke","text":"Bye bye."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":5790.53,"end":5791.97,"speaker":"Jacob Howland","text":"Thanks a lot. Bye. Bye guys."}
{"episode_id":"SW - #284 - 2023-05-05 - John Vervaeke and Jacob Howland - The Symposium","start":5793.65,"end":5873.99,"speaker":"Jonathan Pageau","text":"I'm really excited to announce that we have just put up the new Symbolic World website. This new website, you know, marks the return of the blog, Symbolic World Blog, the return of the reading list and also a brand new symbolic world community which is accessible and will be hosted directly on the website. This community can be accessed by anybody who subscribes. Subscribe to this Symbolic World for those who are already subscribed and supporting us, a different level of patronage either through PayPal, Patreon or SubscribeStar. All you need to do is put in your email address, you will get a reset link for your password and you are in. And for everybody else, it seems like a good time to join the Symbolic World to access all these new things. We're also offering a few new gifts to everybody who, who subscribes, even at the level of free subscriber. Just to thank everybody for all the support you have given us through all these years. And I have to say it's just beginning. We will soon be announcing new courses. You know, Richard Roland is preparing a course on Beowulf. There are all these new projects. The new Snow White project, God's dog and the symbolicworld.com will be the place to follow this and to get news and you know, some. A few sneak peeks at what is coming in the future. So thanks everybody's support. And like I said, we're just starting."}
