{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":0.24,"end":79.16,"speaker":"Heather Pollington","text":"So what I see with this particular church, which is so impressive is they're investing in the things that the congregation are witnessing close up. You know, so it's like the, you know, the treasure binding of the Gospel. They've got the icons, obviously, and the chalice, you know, and then they got the candelabras and pretty much that's it. Or, you know, they're probably going to be flowers and their icons are just on a couple of easels, but they've draped them in some beautiful fabric and again, I just love that because it's economy and it's focus and it's really putting the resources where they should be and kind of traveling around in England and going to churches in other denominations. What I see is just, you know, in some ways they have more resources, but there isn't the same focus. You know, it might all be fundraising for the vestry roof or something, which I know these practical problems exist and we need to, we need to address them. But also it's like, but where is the priority? And you know, it's. I really wanted to, if anyone's listening, appeal to people, please engage artists and designers in your church because design is happening whether you like it or not. You know, I think you've talked about this, Jonathan, but you can't avoid design. It's going to work on your congregation anyway, so use it consciously."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":90.52,"end":148.4,"speaker":"Jonathan Pageau","text":"This is Jonathan Pedro. Welcome to the Symbolic World. Hello everyone. I am very happy to be here with Heather Pollington. You've been following me for a while. You've heard me drop her name a few times. Heather is a designer. She has worked on several projects, very large movies that you've heard about. And we've been collaborating now for several months. She redid my whole branding. You can see the great new Symbolic World logo, the Symbolic World website. You know, just beautiful work that she has produced for me. But I thought it would be really interesting to discuss with her and look at her process, how she comes to her ideas, to her designs, how she takes a movie story and is able to create images and designs and sets based on that. So, Heather, it's really great to have you with me today."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":148.72,"end":150.32,"speaker":"Heather Pollington","text":"Hi, thanks for inviting me."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":150.89,"end":158.41,"speaker":"Jonathan Pageau","text":"And so my first question to you is, how does one end up doing the things you're doing? Because it's very particular."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":159.37,"end":305.68,"speaker":"Heather Pollington","text":"It is very particular. So I studied similar time to you art school as a fine artist. And I think pretty quickly I realized that the sort of contemporary fine art world wasn't really for me and I was interested in Filmmaking process particularly. And I was lucky because at that time in Britain the film world was kind of exploding because of the Harry Potter movies. And I was lucky enough to get my kind of entry level role on the Harry Potter series. And that's where I learned the craft really, with some of the best people in the world working at that time. And the sets are very detailed and that's really where I started out. And today I'm just going to take you through some of the films I've worked on and kind of how we go about designing for films. Throughout the last 20 years it's been. My role has been sort of graphic artist, graphic designer, which means within the film art department, I'm responsible for anything that has like a graphic design illustrative element. It could be like a. It might be a book, it might be branding within a film, you know, like sort of branding for a Bond villains company. It could be a monogram for a medieval king, for example. So it's really varied. It depends what film you're on, different periods. And you really have to learn the language of that film right at the offset and then you can start creating things in that language. And the languages are quite complex, which you'll see because from the outset people think, you know, it's a medieval film, but really that could mean hundreds of different things. So you're taking your cues from the director about what do we mean, what is the world we're creating? And it's always driven by the story, the story we're trying to tell and we're setting it within that, within that kind of term. So we'll go through. But first I want to say that before I show you things, when I discovered your channel, like so much of what you talked about resonated with me because there's a lot of similarities to the way that we work in film. I mean, we sort of work in, in the symbolic world generally. And also it's, it's a world of visual hierarchies. And so a lot of the stuff you talked about with hierarchy really kind of chimed. And I'm going to kind of look at it through that lens because I thought it'd be interesting for your view."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":305.84,"end":325.29,"speaker":"Jonathan Pageau","text":"Because like you said, in some ways the, the idea of making a medieval film, it's not just about making something medieval, is to make it medieval within the purpose of the story itself. And so the sets and the images have to supplement or, you know, help the story. It's not just about showing a medieval castle, right. Or showing some medieval Tapestry or whatever."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":325.29,"end":490.28,"speaker":"Heather Pollington","text":"Well, well, exactly. So, you know, what is the medieval world? It can be 100 different things. So we have to decide what it is that we're saying. And I'm going to also talk about the difference between history and story. What you'll find, if you go on IMDb, you'll have a lot of experts saying, you know, this is historically inaccurate, which in some cases is true, and mistakes get made. But quite often people will purposefully break with history in order to prioritize story. So we're going to have a look at that as well. So I'll just. Shall I just share my screen? This is a diagram of the sort of hierarchy of props on the film set. And I've noticed, I've listened to a lot of discussions that you've had about perception and how we sort of experience the world and how, you know, people that we know or things we care about will appear to us in detail and things that we maybe aren't aware of, even though they're in front of us, we don't really see them. And actually that idea is formalized in the filmmaking process. So if you go onto a film set, we have a way of categorizing props. So hero prop would be. It's held by the actor. It has a specific purpose to tell a story. It's likely to be in close up. It might be in close up with the actor, or it could even be an insert shot where literally your prop is the whole screen of the movie. And that. That hero prop will contain lots, lots of detail for the story. It might be a moment where you suddenly, you know, something is revealed in this image or this prop. So it's very important. A lot of time and energy is spent into getting those things right. Directors really care about them because obviously if they don't work, then you know, the audience doesn't understand what's going on. And technically a hero prop will. It's normally made for real. So if we're making like a medieval book, it will be made properly in leather with proper, you know, metalwork. The interior will be parchment. It might be hand painted. We will use real gold leaf, that sort of thing. That. That level of detail. And then as you go down this hierarchy to the. To what's dressing, then background and then deep background, that process kind to an extent deteriorates. So if you're looking at deep background props that may be 4 meters from the camera, really, it's probably not going to be the real thing. It's going to be something that Looks. Looks like the real thing. You know, we're going to spend a little bit less attention, a little bit. A little bit less time on that thing. So this is all very important because when, when. When you have film budgets, you really have to put that money into the right things that you're getting value from on screen."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":491.08,"end":520.21,"speaker":"Jonathan Pageau","text":"Yeah, you can see how it's a contraction of our experience. Because like you said, the problem is that you have a limited amount of resources. Obviously, you don't have infinite resources. And just that very fact. And the fact that you have to. You have to create attention with a limited amount of resources. Therefore, a hierarchy will immediately get set up because you have to decide what's more important and what's less important. And that will have to do with attention in terms of a movie, for sure."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":520.77,"end":534.32,"speaker":"Heather Pollington","text":"Absolutely. Because we have very tight deadlines. So we have to decide, you know, where are we going to put our energy and what's going to be seen on screen and, you know, how are the audience going to read what we're doing? So that's all really inbuilt to our process."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":535.12,"end":568.04,"speaker":"Jonathan Pageau","text":"And it's interesting because when you see. Actually when you think of movies where the resources became near infinite, then all of a sudden everything becomes flatness to those. Those movies and those stories. I'm thinking of, of how after Lord of the Rings, which was so amazing, Peter Jackson just got like infinite amount of resources to make King Kong. And then you just. You're just like. Your eyes are straining to watch King Kong fight one more dinosaur. And just like millions of details that won't stop, you know."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":568.04,"end":569.28,"speaker":"Heather Pollington","text":"Yeah, yeah."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":569.28,"end":573.24,"speaker":"Jonathan Pageau","text":"Very limited resources forces a proper hierarchy."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":573.72,"end":612.47,"speaker":"Heather Pollington","text":"It's so interesting you say that because it is a problem. And it's something we're going to kind of find out as we go through this. So I would say, yeah, in the last 10 years, there's. There's sort of been a diminishment of hierarchy in film. Two things, as you say, unlimited budgets almost. And, you know, obviously cg, which. Which is. It's kind of limitless and. And in a way it's. It's compromised the craft. And if you watch older films, you know, that are more limited technically, you'll see. You'll see more just better storytelling. You know, it's difficult to describe, but."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":613.52,"end":647.34,"speaker":"Jonathan Pageau","text":"But it has to do with hierarchy, definitely. Because what ends up happening is not just even in what you're doing. It's not just hierarchy of objects, but it ends up being a kind of hierarchy of motion and a hierarchy of Action. Right. In an older movie, your action scene cost you so much to make and was so demanding that you had to really make it dramatically relevant and dramatically constructed. And now it's like you just watch CGI characters fight for 15 minutes and it's so boring. Because there's no stakes, right? There's no stakes."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":648.86,"end":886.2,"speaker":"Heather Pollington","text":"Yeah. It's like. It's like the crew aren't invested and then as a viewer, neither are you. Yeah. Anyway, so I'm just going to go through these images. So this is. It seems like stating the obvious, but I want to do that just in case people aren't aware that most of the films I work on, they really do start like this. It's a. Basically a warehouse. And then. And then we build everything. So you're going to build the walls and then you're going to get the interior decoration and then every single prop is going to be brought into that space. This is the Bond stage at Pine, which I've done a few sets and I work for an amazing designer called Dennis Gasner and he, he was kind of my mentor early on in my career and he said, you know, the story has to be in every single thing that we do. So when we stood there, we're, you know, we're bringing all these things in and we, we have to decide, like, you know, if there's three different knives or three different logos, we have to decide which one it is. And so. So our point is which one is best for the story. And that applies to everything, you know, even like, down to the paper choice that I make. So in that case, if I was doing like an MI6 office for James Bond, you know, even though you're not going to see it, we would still think about the paper that they, that they have in that office. You know, that would be a choice. And it's easier to have those limitations because, like you say, otherwise it's just a million choices. So. So we have that as our, as our kind of guiding rule. I just want to say as well that all of these images, I produce them in a team. So there's lots of people that I've worked with over the years and especially my. My job share partner Kathy, who's been part of this process. So I just want to mention them because there's too many to name as I go through. So this is, this is where I started out. This is Harry Potter. As you can see in these two images from the film, there's a lot of documents and a lot of books. And I started off really doing very background props. And what you need in that case is a lot of quantity and a lot of texture. So as I was explaining before how we deal with props in terms of a hierarchy, you can see on the image in the right where Harry is sat, here you have real books. And then here, which is a few meters away from the camera, these are fake. And I spent about six months of my career at the beginning just making these books, and you can't open them. But again, they totally served the purpose. We had to fill the whole library with hundreds of books. You start off doing that when you're at the bottom. And then in about 2007, I got a lucky break and went out to Budapest to work for Guillermo del Toro and Hellboy2. And at that point, I was running the department. And then I'm responsible for all the graphic props. So everything from the hero, things like these, where you've got maps, storytelling maps. And then also I'm doing background things, but the background things do have a lot of detail. So, for example, this is like, this was the map room in this kind of underground realm called the troll market. And we had to develop a language for that world. And then all of these little tags that you see, they have the troll language stamped on them. And all of these maps, me and my assistant Alex, we drew all of those maps. They're just hanging in the background, but they all are in work, so you can see just the amount of detail that goes in. And people, you know, people think, well, why would you do that? Why. Why not just go and get any old map? But in this case, you know, if you're in a fantasy world, you can't. You can't get anything from the real world. So you've got. You've got really got to make it."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":886.28,"end":930.92,"speaker":"Jonathan Pageau","text":"Yeah. And it's so funny that, you know, for people, the people watching, you know, when Heather contacted me and she said that she had made these props on Hellboy 2, I specifically remember watching Hellboy 2 and. And being. And realizing the difference between Hellboy 2 and a lot of the other movies that I'd seen in terms of the attention to detail. And also at the time, I was already interested in medieval, like, aesthetics and more ancient aesthetics. And I thought, like, oh, they got this right. Like, they got so many things right in terms of. In terms of that. So. So. So I have to say, I want to tell everybody. I mean, if you haven't seen Hellboy 2, just visually, just for the visuals, it is. It is worth watching. It's Pretty astounding."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":931.16,"end":1012.77,"speaker":"Heather Pollington","text":"So, yeah, this is one of the hero props from Hellboy 2. And this, you know, pretty much, you know, early in my career being given this was pretty amazing because it's right in the first scene, and Professor Broom has this book, and it basically introduces the whole world of the golden army. And they use it as a portal for an animation. So it's in close up. So this is one of the examples. This is my visual, which I just drew in a computer on the left. But then it did, you know, get made by some book binders in Budapest and leather and everything. And I think it was interesting because I knew we were sort of in the medieval world. But you can tell by looking at it. You know, the colors are pretty lurid. It's definitely in the world of fantasy. It's got a robot in the middle. But it's. It's something. Some really valuable thing that I learned from Guillermo is about kind of style and color. You know, one thing you said was Hellboy is red. And therefore everything in the movie is pretty much green and blue because you always want Hellboy to be the focus. So, again, just to explain that what I do is never, like, about an individual object or me. It's always complimentary. It's always part of the. The drama that we're creating. And so you have to have all those considerations in place when you're designing stuff."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":1014.77,"end":1060.47,"speaker":"Jonathan Pageau","text":"But there's such a sensibility. Go back to the one before. Like, if you look at the little tree that you designed there on the left, the little kind of symbolic tree there. I mean, it really has. It has an understanding of how to make a symbolic tree, but it doesn't look like any other one that I've seen before. And so that's why it really works in terms of a fantasy movie that's also related. It's like. It's related to our history because it's as if there's a secret history kind of going through our normal history. And that's what it feels like when you see it. It's like, oh, obviously, that's like a tree that I could see in an old design. Or like Islamic art. I'm not sure, but it looks like that. But it's not quite that."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":1060.96,"end":1162.05,"speaker":"Heather Pollington","text":"It's interesting you. You picked up on that. Because I. I actually didn't draw that tree. So I got that from Guillermo. I think it was. It was a. It was a piece from the concept art that I had to integrate. So that can happen quite a lot. Again, this. This process is Massively collaborative and, you know, there's a lot of people involved, so sometimes you'll get given something. So I. That was the only thing I got. And then I developed the book around it. But like you say, there was already a good language in there that I could use and kind of extend out. But you can see that the lettering around the outside, that's like a kind of bespoke Alphabet that we developed in our department. So these are, yeah, some of the other bits and Bobs from Hellboy 2 that I did. You can see there's quite a few here. There's a lot of hero props in that, in that film. This one, you know, it's just an incidental hotel sign where this creature kind of rips off the O. So it can be something as boring as that that you have to design. Here you can see Hellboy stood in front of a. It was supposed to be under Brooklyn Bridge and we built the whole thing in Budapest and we had to do all the storefronts. So again, you're kind of. You're trying to reference like contemporary New York but at the same time, you know, you're in the comic book world. So everything is like exaggerated, oversized. I did this, I don't know if you can see. I did like Daddy O's Garage because we were referencing like sort of 50s comic book Americana. So, yeah, it's. It's really a world of its own and you have to really get into that and, and think, you know, beyond the script, really."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":1162.29,"end":1162.77,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":1163.33,"end":1261.65,"speaker":"Heather Pollington","text":"So after that I did a couple of the Bond films and. And these are, these are kind of interesting because you might look at this image and think, you know, it's pretty boring, but it's actually one of the most interesting films. And the reason is working with Sam Mendes. He was, he was telling a story About London in 2012, MI6 got blown up and the MI6 team went into a bunker. So what he's doing there is he's tapping into something for the kind of. At least the British audience, you know, about the Second World War. It's the narrative of kind of, you know, Bond being out of date, you know. So when I talk to him about what does this office look like? He wanted me to produce this file here. And it's purposefully very kind of old fashioned. It's almost 1990s. You know, we're in 2012. The likelihood is things would be digital, but again, you would select in terms of story that you would go towards the old fashioned, towards the manual in order to create A certain narrative about the world that bonds in and what I'm seeing at the moment in film, and I don't know about you, Jonathan, but particularly in medieval films, there's just constant innovation. People always want to do something new visually. And the problem is sometimes we need to be conservative in design. Now, in the case of Skyfall, he is in London and you see the world that he's in in my six. And then he travels to Shanghai."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":1262.37,"end":1262.69,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":1262.69,"end":1294.6,"speaker":"Heather Pollington","text":"And this is a. An animated jellyfish that he encounters. And there's a fight scene. So compared to the world we've come from, this world is very technologically advanced. It's alienating, it's strange. You've got this blue light, and so what Sam's doing is he's got these two contrasts. But what I'm seeing is when people want to inject kind of strange elements everywhere, that's kind of falling away. So I'll give you an example if you saw. If you saw the Green Knight film."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":1294.68,"end":1295.16,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":1295.32,"end":1384.08,"speaker":"Heather Pollington","text":"So that film there was a lot that I admired about the design. I thought it was really interesting. But after I'd finished watching it, I was like, there's something about that film that I can't figure out that didn't. Didn't quite work for me. And I was reading Gawain and the Green Knight with my daughter, and it was just like an old 70s book with watercolors. And it started off saying, you know, the opening thing was like, we're in Camelot. You know, every. Everyone sat around the fire. Okay, you're in the home state. And then suddenly, like this. This green knight comes in on horseback, which is completely strange. Right. And so there's a dramatic impact there because you have a conservative setting that is home. And then the strangeness comes into that. Yeah, but the problem with that film is that the setting of the round table was already alien. Yeah, it's already strange. It was like. It was like medievalism, Star wars, if, you know, there was a globalist element to it. So as we went in, I was like, wow. Some, you know, these visuals are stunning, but when the Green Knight came in, it just felt like more of the same. So I feel like it's something that. That is there. And I just wanted to show when it's done well, it really does work in terms of story. And. And this is something that when I talk to people who go to films, they don't necessarily. They can't really articulate what the problem is, but they know if something just didn't quite work or they're just like, you know, I didn't really get the story. Story or whatever. So."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":1384.24,"end":1391.6,"speaker":"Jonathan Pageau","text":"Yeah, it just, it just didn't land. You ask the person, you know, if why didn't you like it or did you like it? And they don't know why. They just know that."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":1392.08,"end":1408.16,"speaker":"Heather Pollington","text":"They usually. Yeah, they usually just say, well, you know, yeah, it wasn't that great or whatever. But. But I'm seeing more and more now I'm aware of this thing. It's one of the reasons why that people, people need to be restrained sometimes, I think in terms of how much they're innovating."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":1408.7,"end":1439.8,"speaker":"Jonathan Pageau","text":"Yeah. And when I see the two images you showed, the one of MI6 in the bunker, then I realized that using arches, you know, because you wouldn't have, you wouldn't have had to use arches, but using arches and brick and, you know, kind of that, that aesthetic is perfect for the contrast with, with this kind of high tech world. Yeah. And it does it. Not only does it look like a bunker, but it looks, it looks old. Like, it looks like, like an old basement from a, you know, a 17th century building or something."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":1440.2,"end":1446.92,"speaker":"Heather Pollington","text":"Yeah. And it's built, you know, again, that's not a location that was all done purposefully. It's. It was really clever."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":1447.24,"end":1447.72,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":1449.48,"end":1514.89,"speaker":"Heather Pollington","text":"So I'm just kind of made this point about the primacy of story over reality. And I just wanted to share this example with you. And a lady that does the same job as me called Annie Atkins, she's got a great Instagram and she pulled up this example and it refers to Titanic. So when Rose arrives in New York on a lifeboat, she looks out at a green Statue of Liberty. In 1912, the statue would have not been fully oxidized and should have been a copper color. And she shows this postcard from 1912. So if the director showed a copper Statue of Liberty, the audience would go, why is that brown? Yeah, because their frame of reference is that it's green. Whereas if it's green, what the audience feels is home, you know, or America or what, you know, whatever it is. So that's what we want. We're always going for the emotion with the audience and, you know, small historical details like that. Although it will annoy people, it's. It's less important when you're making a."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":1514.89,"end":1563.06,"speaker":"Jonathan Pageau","text":"Film, that's a great example to help you understand, like you said, the primacy of story. And, you know, people will get annoyed. Maybe with me, but I think that's something that happens in traditional stories all the time. And even Possibly in the Bible story, that is, especially with time, certain details get. Get contracted in a manner to make sure that they. That they communicate to the largest amount of people what has to be communicated. And so there's a need to. Because if it's. If that doesn't happen, then idiosyncrasy is idiosyncrasy. And you. You don't have the same level of. Same kind of attention to something strange and idiosyncratic than you do to something. Like you said, that feels familiar. And so the example of the statue is a great one to help people understand."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":1563.14,"end":1590.83,"speaker":"Heather Pollington","text":"Yeah, it's really good. And you're absolutely right. So we're going to get onto some medieval things in a minute. But what I would say is, you know, say. Say you're doing a medieval film, you can only really use examples that are going to be within. Within the experience of your audience. Because if. If you pull something up from the 13th century that is no longer recognized, it's not going to work. Like, no one knows what that is. And like, you say it's jarring because they're like, you know, what's that thing in the background?"}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":1590.83,"end":1633.43,"speaker":"Jonathan Pageau","text":"So, yeah, unless that's what you want to do. Unless you want to create otherworldly. An otherworldly effect. Like, that's what I kept thinking about. Like, if I made a film in the Middle Ages, I would write it and I would make it in a way that would make the Middle Ages look like. Almost like. How can I say this? Like a paradise. Right. Which would be surprising to me because they're used to making it look like dirty, disgusting place. And so it's like that surprise would be used in the story. It's like, why is everything so gold and colorful and. And, you know, so. But you would have to put it in the story. If it's just background, it's not worth it. It's not worth the effort."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":1633.99,"end":1670.91,"speaker":"Heather Pollington","text":"Definitely not. I mean, we've talked about that, haven't we? The kind of. The recent trend for making everything in the medieval world kind of brown and. But I've kind of pondered on why that is, and this is my hunch about it. I think it's to do with, you know, the Western world's slight discomfort with its past and particularly its Christian past. Because what I've seen on set is if there's something like a prop that people are not pleased with, they'll get a prop guy to come in and spray brown over it. It's how I've seen it happen. Loads of times they go just dirty that down because they just want it."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":1670.91,"end":1673.19,"speaker":"Jonathan Pageau","text":"To kind of the fade into the background."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":1673.27,"end":1692.87,"speaker":"Heather Pollington","text":"Into the background. Exactly. And what you see now in. In medieval films is that that's happening on Mass, that the whole thing has gone brown. And it's like, you know, if you look at, like, heraldic language, for example, is so brightly colored and powerful, you know, and that's how it would have been in the medieval world. I'm talking now about historical accuracy."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":1692.87,"end":1732.97,"speaker":"Jonathan Pageau","text":"Yeah, yeah. So, but the effect, like, it would be interesting because the effect of walking into Saint Chapelle, I was there, you know, in Paris, this, a few weeks ago with my kids, and they had never been. You know, they'd never seen it. And I was, like, getting them all. I was getting ready to watch their eyes when they would walk into the church and just see the red and the blue and the gold and just, you know, all the. It's just so. It's just so overwhelming. And so, you know, it's interesting. It'd be interesting to think of that dramatically in terms of storytelling. Like, how. How could we change people's perception of the Middle Ages in the story? By creating that same surprise that you have when you walk into."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":1733.21,"end":1738.7,"speaker":"Heather Pollington","text":"Oh, definitely. I've thought about that many times. Okay, I'm going to carry on."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":1738.7,"end":1739.1,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":1739.1,"end":1983.97,"speaker":"Heather Pollington","text":"So this would. This is like a hero prop for Mary Poppins. So this is just an example from my work of the amount of things that you might have to think about if you're creating something like this. So story is here. The Banks family have a certificate. And even though Mary Poppins Returns is set in the 1930s, the certificate dates back to the 1910. 1910, even. And so I had to create this. So basically looking at design of certificates, and then you have to go into the whole history of the banking industry. Where would it have been based? When would it have been established? What was the currency at the time? Figuring out the address and all the details, signatories, things like that, as well as looking at the typography. So even though it's just a bit of ephemera in a film, again, if it's wrong, you're aware that people are going to kind of, you know, screen, grab it on the Internet and then go on IMDb and tell you where you're wrong. But this is. This was the world of Mary Poppins Returns that I worked on and I put this in, because, again, it's. It's not just about worlds that you create. In this case is definitely about memory. It's like you're dealing with a very iconic character that is very precious to lots of people. So when you come onto a film like this, it's not like, oh, you know, amazing creative opportunity, although they may come. It's more. I have a huge responsibility to kind of preserve this, this world and, you know, so that the people who love it, you know, don't get disappointed. So we're looking at 1930s London here, but it's all definitely through the lens of the world of Mary Poppins. So you can see, you know, lots of pastel colors. It's, it's, it's, it's pretty light. You know, these, I had to replicate these blocks, these iconic blocks from the first movie. And then this in that film was the world of the villain, which was in the bank. So it was like bank signage, carpets, account ledger, and there's the certificate there, kind of set within the Mary Poppins kite. And that's part of the story there. And so to the medieval world we're just talking about. So this is a classic example. It's Maleficent 2. And I was really pleased to be asked to do this film because the designer wanted to do a brightly colored version of the medieval world that was very much referencing the world of Disney. And I absolutely love early Disney. I love the, the sleeping beauty from 1959. So obviously you look, you're looking at the original Sleeping Beauty cartoon. But because I have to make like real world examples, my approach was right. I'm going to go into medieval art, kind of late Gothic, maybe kind of 14th, 15th century. And I'm going to try and find examples of Disney. And on the right hand side here, you can see just a couple of my references. And, and, you know, it's interesting to see that they do exist. You know, this image here, which is from 1470, you know, it could be from an animation. It's, it's so stylized. And so you're looking for overlaps there that are going to kind of, you know, tick boxes in both worlds, if you like. This is Michelle Pfeiffer in front of one of my tapestries. So this would be a example of a deep background prop. You're never going to see it up close. She's about 4 meters away from it, and it's complementing the drama. She's here, like, practicing her crossbow shot. And so what we've got in the background is I did about 12 of them, a tapestry where a mythical creatures having its horn removed and some of the others were like mythical creatures being killed. That Was the narrative that she was waging war on the mythical world."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":1984.05,"end":1984.75,"speaker":"Jonathan Pageau","text":"Yeah, yeah."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":1985.46,"end":2010.91,"speaker":"Heather Pollington","text":"So you're going to use color. Like obviously you've got the red, that's really obvious. And you've got the. The unicorn with its horn snapped. And then I used for this, in this case, quite a graphic style of tapestry that was a bit earlier than the 15th century because I knew it was deep background and if it was going to register in any way it needed to be, you know, quite graphic and obviously."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":2011.14,"end":2026.9,"speaker":"Jonathan Pageau","text":"Yeah. And it reads. I mean, I think that it. For people, it also reads so. Right. Because we, most people that have seen medieval art have seen the. The unicorn tapestries that, you know, that exist that some. I think some are in New York and then some are."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":2027.14,"end":2034.74,"speaker":"Heather Pollington","text":"Yeah, I looked at those. Yeah, definitely. It's interesting because I read about the original animators at Disney and they all went to look at those tapestries."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":2034.9,"end":2035.62,"speaker":"Jonathan Pageau","text":"Oh, yeah."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":2035.86,"end":2104.69,"speaker":"Heather Pollington","text":"So they basically animation on the tapestries and then I was here designing tapestries that were referenced in the animation. So there is kind of a nice kind of circular connection there. But yeah, the other thing to consider is the costume. You know, she's there in a white dress. So if I'd done a light tapestry, wouldn't work. So have to do something where, you know it's going to complement what she's wearing. This is a set from Maleficent too. This is with studio lights on. So this is how you'll never see it in the film, but I'm showing it you like this so you can see all the details. So basically my department would. We were responsible for this huge carpet, 40 foot, kind of Persian style, heraldic carpet. We were doing flags, we were doing banners, we're doing chair backs, plates, all sorts. It was like a banqueting sequence. So we would have all these elements made bespoke for the set. And this is the placement of the carpet. So, you know, a car, if something's on the floor, it's not just deep background, it's not even on the same plane as your camera, really."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":2104.69,"end":2105.01,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":2105.01,"end":2148.46,"speaker":"Heather Pollington","text":"The camera's going this way and the carpet's here. So a lot of people will just say, you know, it doesn't matter, just, you know, do something. Do something quick and easy. But I really wanted to draw this as a bit of a challenge. So I drew this in a computer. We printed it on onto velvet. And I think at this point you're really creating something for the crew and the actors. It's like I said, it's. It's not really going to Register on screen. But what. What's lovely is if actors and crew come onto a set and they see the amount of effort that different departments have put in, you know, to different things. And, you know, it's. It's good for the project if people invest time in detail, I think."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":2149.34,"end":2154.18,"speaker":"Jonathan Pageau","text":"So the idea is that the animals are all being caught. Like they're all changed."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":2154.18,"end":2195.99,"speaker":"Heather Pollington","text":"Yeah, yeah, that's right. Yeah. So, yeah, sorry, this. I used the heraldic language because we're in a kind of public space, and we wanted to make the point that, you know, in the narrative, the queen is kind of capturing the mythical creatures. Maleficent comes in, and it's supposed to be quite a hostile environment. So I was depicting these animals, you know, with chains, which, again, is. Is kind of. We've seen all this in. In heraldry. So, again, you kind of select from heraldry the thing that suits your story. And. And this is. This is the scene with that carpet. So you can see really how much is registering. Not. Not much."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":2196.07,"end":2196.63,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":2196.71,"end":2210.35,"speaker":"Heather Pollington","text":"You know, the other element of what we do is you can make something and then the lighting department come along and, you know, completely change the way that something looks. But, you know, it's. I still really enjoy doing it. And it was. It was a great thing to draw."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":2210.91,"end":2223.91,"speaker":"Jonathan Pageau","text":"Yeah. Like you said, the. The energy and the. The basic effort reads, you know, it. You can. You can feel the richness of the. Of the texture and the space. So it definitely adds the picture of."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":2223.91,"end":2250.34,"speaker":"Heather Pollington","text":"Me with another tapestry from that film. So we're in a. In a bedroom space, so it's more intimate. It's you. I went for a bit of a softer language because I knew, you know, like I said, it's more private. It's more likely that the actors may be closer. And you can see that that's. It hung on the wall. It's obviously supposed to be like a heavyweight tapestry, but you can see from that shot that it's just a piece of white fabric with a digital print."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":2250.42,"end":2250.9,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":2251.54,"end":2339.46,"speaker":"Heather Pollington","text":"So what I have to do in this case is actually draw. I have to put everything into the artwork because the technology of how it's produced is not going to give me anything. And one of the most important things that I've learned doing this kind of work is how much technology defines art. I think when I was, like, a fine artist, I used to think that the artist was everything and you could just make whatever you wanted. But things like tapestries are so driven by the technology. So when I was drawing this, I had to consider where to look into, you know, what. What were the limitations of the dyes? For example, you know, if. If you think about the red tapestry I showed you before, that's earlier, it's probably because they had, like, more basic looms. They had, like, thicker wool, you know, so the actual. The actual language was. Had to be kind of simpler and more graphic. And then as you got to, like, the late 15th century, things were more sophisticated. And so. So you got, like, finer. Finer details, finer illustration, but they still only had, like, you know, X amount of colors available. And the challenge for someone like me who's working on a computer is, again, just having infinite colors. You know, it's a problem you have. You have to limit yourself in order to make something that feels authentic. So, you know, sometimes when I've designed things, I'm like, it's not quite right. It's probably because I'm not sticking to the rules of the limitation of that technology."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":2341.06,"end":2347.62,"speaker":"Jonathan Pageau","text":"And so in this, you had to design even. I mean, you had to design it so that it looked like it was woven, I imagine."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":2347.78,"end":2355.62,"speaker":"Heather Pollington","text":"Yeah. So, yeah, I mean, I can show you some details of it. So the way that it's drawn is basically in tiny lines."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":2355.7,"end":2356.5,"speaker":"Jonathan Pageau","text":"Yeah. Okay."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":2357.38,"end":2393.06,"speaker":"Heather Pollington","text":"So you couldn't draw, like, solid things. I mean, probably haven't. This is probably the best. Yeah, but you can. You can see the way I've actually drawn in the woven lines in there. And, yeah, that, again, with digital printing, it's something you have to do. This is a picture of it when it was installed in the set, which, again, it doesn't look like this in the film. And I did that carpet as well. So, you know, big consideration with this is, where does the bed go? Where is this curtain going? You've got to make the images fit around the architecture. That's very important."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":2394.15,"end":2397.83,"speaker":"Jonathan Pageau","text":"So. But still, you have the animals, kind of the animals with their."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":2398.55,"end":2431.81,"speaker":"Heather Pollington","text":"Yeah, yeah, yeah. So it's a similar theme. Yeah, it's a similar theme to the one downstairs. Oh, and just to say these trees here, they were kind of inspired by the original 1959 animation. And here it is in the film, so you can see Aurora and the Queen. And so the Queen's embracing her, but it's not genuine. And then you've got, you know, this is. Her dress is pink. And then I've got a pink rose in the background because her name is Briar Rose. And then obviously got this kind of chained swan here."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":2431.81,"end":2432.29,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":2432.61,"end":2435.65,"speaker":"Heather Pollington","text":"Which is obviously like a kind of reflection of the narrative."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":2436.53,"end":2498.93,"speaker":"Jonathan Pageau","text":"And that's. I mean, I think that for people, it's important to see how subtle it is. Right. Because it. And it won't read consciously for people. But, you know, when you add up all these very subtle connections in a. In a story, that's when people get a kind of magical sense of coherence, even though they're not able to. And that's what, you know, like some of the symbolism that I point out, even like in Bible stories or in myth or whatever, you know, the explicit links I point out are perceived by people implicitly. People can perceive coherence. They can perceive. They can perceive analogical coherence, even though they can't explicate it. They just know that the story is good and they remember it. But they. Yeah, so, like, pointing it out is fun and it's wonderful because it helps people see how these things are built. But someone would watch the movie and get a sense of coherence without. If you pointed it out, like you said, oh, look at the same color of a dress and the rose and then the. The swan in the background. Oh, yeah, okay, that makes sense. But they don't even need to see it for it to work."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":2499.26,"end":2546.56,"speaker":"Heather Pollington","text":"You're absolutely right. And whenever I meet people who've seen films I've worked on, I never want them to have noticed my work because. Because if they've noticed it, probably. It's probably a bad thing. You know, the. What you want is just for people to come out and say, I really enjoyed the movie. You know, that's what you want. And you don't want them to say, I like that tapestry in scene three, because again, it really shouldn't be detracting from the actors, for starters. And secondly, you don't want that symbolism to be, you know, too overt because, you know, it's too much. So, yeah, you like things kind of being. Being hidden. It's nice to. To hear you say that you think they're subtle because I always worry, like, is that too much? But like you say, I think most people watching it probably wouldn't notice."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":2546.8,"end":2583.42,"speaker":"Jonathan Pageau","text":"No, but I definitely know. I mean, these are the things that I noticed, but I think most artists would have more sensibility to seeing that. Like I said, the work you did in Hellboy 2, I just remember because it was. It seemed to me so rare that. That this type of detail was included in movies, that it just really stood out for me. And the same. I remember watching the Bond film and it's. And the same. Just feeling like it was so well done. I mean, like, everything was so beautiful. Not beautiful. Not beautiful in the sense of attractive, but beautiful in the sense of appropriate. Like all the scenes that were appropriate. Yeah."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":2583.42,"end":2613.05,"speaker":"Heather Pollington","text":"I think. I think what you're saying is usually due to having a really good director because there's so many of us involved in the process. If you have a director like Guillermo or Sam Mendes who really know what they're doing, they can really lead everyone in one direction. And if everyone knows what they're doing, it's great. Some films I've worked on haven't had that leadership. And at that point, everyone's guessing, and it can be. You can imagine the results."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":2614.41,"end":2625.53,"speaker":"Jonathan Pageau","text":"Well, we've all seen, like. We've all seen, you know, And I hate to use specific examples, but I will, you know, this recent series that. This is the series, what it's called the Chosen, the Jesus series, you know."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":2625.61,"end":2626.17,"speaker":"Heather Pollington","text":"Okay."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":2626.25,"end":2671.65,"speaker":"Jonathan Pageau","text":"It's like, you can see that there's no. There's no capacity to create coherent visual spaces. Right. It's like, okay, we need something that looks old. We need something that looks Oriental, like. So we just kind of put things in there. And some of it is budget. I totally understand, and I sympathize with that. But it affects your perception of the story when you're watching, and there's no sense of coherence. And then compare that to, for example, watching Dune, where it's not as if there's massive amounts of story in Dune. Right. It's like. It's actually a pretty slow film, but you're just so mesmerized by the visual coherence of the story and the attention to detail that it just. It traps you. Right. You just keep watching because it's so powerfully."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":2671.65,"end":2774.54,"speaker":"Heather Pollington","text":"Yeah, yeah. It's interesting you say that, because I've come to the end of my film work now, and I just wanted to chat to you about something which is kind of what. How can we apply these. These ideas in. In the wider world? And I've thought about them a lot in terms of churches and how churches are designed. Because of my background, whenever I go into a church, and I go into quite a lot here in England, I'm super sensitive to. To the way things are designed and, you know, ornament patterns that, you know, they're all transmitting information basically to me. And I've recently started going to a new Romanian Orthodox mission church, and I wanted to talk to you about it because they're a new mission. Their circumstances are actually quite compromised. They're hiring a church from the Anglicans. It's a big kind of 12th century Norman church on a hill, usual kind of setting in an English village. And they're kind of coming in a few days a week and setting up this Orthodox mission. But the way that they direct attention is absolutely masterful. I go in and watch it, and a lot of the liturgy is in Romanian, but it doesn't matter because what they're doing visually is so captivating, and they basically do it with color and light. And for me, it's just an example that we can all learn from of. You actually don't need the Hollywood budgets or the huge resources because they don't actually have very much, but with what they've got, they're just using it really cleverly."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":2774.86,"end":2806.88,"speaker":"Jonathan Pageau","text":"And I think, happy to hear that, by the way, because there are so many churches that don't do that, especially in America. And I have to say, made closer to me than I wish, where there's a desire to go over the top because, like, almost overcompensate for the lack of a good space. And so it's like, you know, buying ornaments at Home Depot and gluing them on plywood and then spray painting it with gold paint. And you think, man, like, you just do something simple. It would be so much better. Right?"}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":2807.28,"end":2911.05,"speaker":"Heather Pollington","text":"Yeah. So. So what I see with this particular church, which is so impressive, is they're investing in the things that the congregation are witnessing close up, you know, so it's like the, you know, the treasure binding of the gospel. They've got the icons, obviously, and the chalice, you know, and then they got the candelabras, and pretty much that's it. Or, you know, they're probably going to be flowers, and their icons are just on a couple of easels, but they've draped them in some beautiful fabric. And again, I just love that because it's economy and its focus, and it's really putting the resources where they should be and kind of traveling around in England and going to churches in other denominations. What I see is just, you know, in some ways they have more resources, but there isn't the same focus. You know, it might all be fundraising for the vestry roof or something, which I know these practical problems exist and we need to. We need to address them. But also it's like, but where is the priority? And, you know, it's. It's. I really wanted to, if anyone's listening, appeal to people, you know, please, please engage artists and designers in your church, because design is happening whether you like it or not. You know, I think you've talked about this, Jonathan. But, you know, you can't avoid design. It's going to work on your congregation anyway, so use it consciously. And it doesn't matter. You know, what. Whatever your expression of Christianity is, it can be done on different levels, but. But you have to take care of it. You know, it's like the Skyfall stuff. You know, it. Look, it's simple, but it still needs thinking about. Yeah, definitely."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":2911.77,"end":2984.05,"speaker":"Jonathan Pageau","text":"Yeah. You. I mean, you can see the. You know, in terms of. In terms of attention and design. It's interesting to think about how. Especially as many churches move towards entertainment mode, you know, how the type of design they use ends up reflecting that, and it's almost accidental. They don't necessarily realize what's going on. They just want to make something interesting. But the type of attention that you give to a concert and the type of attention you give to God is not the same attention. And so the danger, like, the danger of going bling, right, and having light shows and smoke and all that stuff is that there is a type of attention, the type that you talk about, which is like a simple candle on a table and a. You know, a. Let's say just. Just a bit of light coming in from a high window that. That has a transforming effect that is that subtle, but. But has more to do with the type of transformation we need to. To do in our. In ourselves, like the type of attention and transformation we need to. To. To have than, you know, being overwhelmed by. On a massive sound system and. And. And, you know, electric guitars."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":2984.45,"end":2986.29,"speaker":"Heather Pollington","text":"Absolutely. Yeah."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":2986.53,"end":3056.09,"speaker":"Jonathan Pageau","text":"All right, so now we're gonna call it World. All right. And so this is. This is very. This is like a big deal to me because, you know, the symbolic world branding, as some of, you know, I mean, some people. Some people were very attached to it, but it was. It was done very rapidly and with a bunch of different people and kind of chaotically in some ways. And so although I did like the image of Adam and Eve, there was something about it which was too much. It was too much detail and everything. So I've been thinking about the desire to. I'd been having the desire to create something more simple, more encompassing in terms of, you know, it's weird, like, even this image, the symbolic world, you know, I had these T shirts printed. I gave the T shirt to one of my kids, and they're like, well, I'm not gonna wear that, dad. There's, like, naked people on the. On the image. And I thought, wait, oh, yeah, that's true. I didn't even realize just how there's. There's a little too much in the. And so Heather contacted me and said, you know, she liked the channel and that she. If I. If I would like, she would help me to kind of redesign some things. And so I was. I was super excited because I saw her work. And so we're going to take you kind of through what our thinking was and what we wanted to do. So. All right, you can. You can go now, Heather. This is. This is exciting to me."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":3056.32,"end":3145.35,"speaker":"Heather Pollington","text":"Okay, Right. So the first thing to say is there was already a logo, which is really important because, again, there's an expectation from your audience about what the symbolic world is. Like, whatever you say about that logo, it was established. And so in very basic terms, I had to think about, like, what is the atmosphere of the channel? And from what I remember about your intros, it was like a black world. There was a kind of glittering goal thing, and it was. There was quite a lot of dimension. You know, you've done some quite cinematic stuff. So, you know, the danger is if I came along with my ideas of, like, what I think you should do and design something like slick vector graphics, like, your audience basically switches on the day that it launches, and they're like, where are we? You know, so it's. So you have to honor, in the same way, you know, with Mary Poppins or whatever, you have to honor what. What is kind of in the hearts and minds of your audience already and what are they used to. And so. So you're evolving something. You're not kind of starting from scratch. You're going, here's some elements that work. Let's keep hold of them and let's kind of build on them. So if I look at this logo here, actually, I really liked it. But the main problem looking at that technically, for me, is that all of the kind of identity and detail within the back image and the lettering. I don't know. I don't know how you did that."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":3145.35,"end":3150.47,"speaker":"Jonathan Pageau","text":"But I didn't do that. That was the people who made my website who just, like, just put that."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":3150.47,"end":3153.23,"speaker":"Heather Pollington","text":"Yeah, okay. So. So there hadn't been that much consideration."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":3153.23,"end":3154.99,"speaker":"Jonathan Pageau","text":"Not much consideration at all."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":3156.03,"end":3187.66,"speaker":"Heather Pollington","text":"And, you know, that's your title, and it's a really brilliant title. The symbolic world is like, okay, so we really need to do something with the lettering and sort out the hierarchy, because again, problem is, you've got thing in the forefront with no information, really. It's a strange kind of 1980s white typeface. And then the thing at the back has all the identities. So we need to flip those around so it's just working better. So you came to me with this brief of Norman Sicily and the Paradex on tree."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":3188.38,"end":3216.97,"speaker":"Jonathan Pageau","text":"Maybe we can tell people a little bit. I just want to maybe tell people about the Paridexian tree and why, what I wanted to do with that, because I know some people are looking at the new logo and wondering, like, what's going on with the new logo? So the Paridexian tree is a medieval legend about a tree that exists in the East. It's a tree in India or somewhere mysteriously in the East. And this tree is special because under the tree, there's a dragon that just kind of hangs out under the tree."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":3217.06,"end":3217.22,"speaker":"Heather Pollington","text":"And."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":3217.45,"end":3273.97,"speaker":"Jonathan Pageau","text":"And then there are doves that land in the branches of this tree. And while the doves are in the shadow of the tree, then the dragon won't harm them. You could even say that in some ways, the dragon protects them because the dragon is scaring off any other predator for the tree. But as soon as the. As the dove leaves the shadow of the tree, then the dragon will eat the bird. And so to me, this was such a powerful image of symbolism. It contained heaven and earth. It contained this heavenly influence that comes down on the structure of. Of a pattern tree. And then the monster at the. At the bottom, that is both a gargoyle, but also the monster that will devour the. The pattern if you're not careful. And you. And you let these higher influences leave the shadow of the pattern. And so it just seemed like a beautiful, simple, cosmic image that had a lot of visual potential to it as well."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":3274.29,"end":3334.48,"speaker":"Heather Pollington","text":"Yeah, so it's a complex thing. I think, you know, it was challenging in lots of respects because you have quite a long title. And what you'll usually see in brands is if you have a long title, you have a very simple image, or you'll have a very complex image and a short title. So I. There is a lot to deal with here, and it's one of the things that I struggled with initially, but so normal. Sicily was amazing. When you showed me that it was kind of mosaics that I was aware of and I'd really admired, but I hadn't looked into it deeply. So I had the opportunity to do that, you know, studied all those amazing mosaics and knew there was, like, a lot of visual potential in those. And these are, like, some of the first sketches that I did. And looking back now, they're, like, really overcomplicated. And the main reason for that is that I was just too close to the reference. What happens quite often with historic reference is that you kind of fall a bit in love with it and. And then you're too close to it."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":3334.96,"end":3356.19,"speaker":"Jonathan Pageau","text":"And also, I had had a few iterations made even before we started working where there was a logo like this that contained all the elements in it. And, you know, it looks good as, like, you know, like as a tapestry or as, you know, Andrew Gould looked at some of these and said, oh, it looks like a forged gate, you know, something like that, but not a logo."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":3356.59,"end":3403.84,"speaker":"Heather Pollington","text":"Yeah, exactly that. So they become almost decorative, and they would work as decorative pieces, but there's. There's too much information. So, again, the challenge was to really condense down. And like I said, I had, like a tree to deal with, I had dragons to deal with and the doves. So there's a lot of elements. So we went through a few rounds and I was like, still, it's still too much. And I think then you sort of said, right, we need to sort of go back to basics and get into the world of the logo. And here are some kind of early attempts at that to really kind of just condense down, like, what could a tree be? What is the minimal we could show that could represent a tree and what it. You know, in this case, it's like, you know, there's three strands and then I've made the dragon just ahead, you know, and then we've kept the doves."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":3404,"end":3419.17,"speaker":"Jonathan Pageau","text":"Yeah. And then we had the idea of maybe if the doves. If we show the doves landing on the actual dragon, then that sense of protection and danger could be included into the. Into one image. And at first, even without the tree, we're like, maybe we just have to ditch the tree because it's too much."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":3419.81,"end":3459.65,"speaker":"Heather Pollington","text":"Yeah, yeah. I think we were having those conversations going through, like, how much can we get away with saying and not saying? I think. But at this point, I think we use. The dragon seemed to be the most important thing and the best emblem in terms of a kind of strong logo that was. That was memorable. So I think. I think this one was the one that was closest. But at this point, I'm still using, like, off the shelf type typefaces, and I knew that I wasn't going to get away with that because, you know, there literally isn't anything from Norman Sicily in terms of a typeface, so no Norman Sicily typeface."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":3459.65,"end":3461.61,"speaker":"Jonathan Pageau","text":"What are designers think really doesn't exist?"}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":3461.61,"end":3600.54,"speaker":"Heather Pollington","text":"Like, nothing even close. So. So, yeah, I was. I got to this stage, I was like, right, you know what? I'M just gonna park the dragon for a bit, look at the lettering, and then I'm going to come back once I'm. I'm aware of what's going to happen with that. So in terms of lettering, I looked at probably like 30 or something different mosaics from across, you know, Byzantine architecture. Looked at San Marco, looked at Ravenna, places like that. And really what you're looking at when you, when you, when you look at this kind of thing, you're trying to find averages. So you're like, you know, you look at all the S's and go, what, what's the kind of tendency towards how they, how they would express an S, for example. The other thing to say is when you're drawing a typeface, you, you want it, you want it to have some of the idiosyncrasies of that historic typeface, but not too much because it, it has to work in the modern world. So, for example, you know, some of these letters, I would draw it accurately and then, and then I would kind of iron it out, so to speak, to make it more kind of commercial in feel. You're also looking for opportunities to kind of inject other, other kind of meanings. And so with the O, I was aware that this shape here, you know, is, is in the icon of the Transfiguration and this, the side wind of Christ. It seems to be a very significant shape in Christian art. I'm sure you know much more about it than I do. So that, that kind of gave me the idea of how I wanted to do the O's. And this is the, this was the first drawing in black of the typeface. Once I'd done this, I felt pretty happy that I had lettering that, that was from that world. But like I said, it's always a balance between, like, the historic and then also the commercial or the, you know, the modern. So I then started looking to, you know, turn it into more of a brand. And I just, I don't know how it happened. Just this idea. One day I just thought, what if one of the doves kind of was landing on the eye? And then I had the idea of having a little, like, tree, like, ligature on the eye. And I was looking at it, I was thinking, you know, this now has kind of the imagery of the ark, which I think is kind of appropriate for what Jonathan's doing. So that kind of fitted as well."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":3601.5,"end":3612.62,"speaker":"Jonathan Pageau","text":"Yeah, it's the arc, but it's, it's also, it's, it is the dove carrying the branch, carrying the pattern. It's powerful, but then it's also referencing back to the Paridexian tree in a subtle way. Right."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":3612.62,"end":3613.18,"speaker":"Heather Pollington","text":"It's not."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":3613.18,"end":3617.58,"speaker":"Jonathan Pageau","text":"Not as explicit, but it's. It has. It has the. The bird landing on the tree as well."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":3617.58,"end":3630.91,"speaker":"Heather Pollington","text":"Yeah. So I was hoping that it. That it answered the paradox in Tree Brief, but also it kind of had wider associations with people, because I don't think, you know, you can look at a dove without thinking of the flood narrative. I mean, it's."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":3630.99,"end":3636.67,"speaker":"Jonathan Pageau","text":"Of course, I'm sure most people. Yeah, I wouldn't even think of that when they saw it, but it's there."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":3637.07,"end":3692.27,"speaker":"Heather Pollington","text":"Yeah. And then I started looking at the rendering. So obviously wanted to go back to the kind of the beautiful, real gold mosaics that I'd looked at in the reference. And. And the other reason I went for it is because I knew that you probably want something a bit dimensional, like we talked about in the beginning, that, you know, you've done things that are. That are quite cinematic. And I know your channel's kind of famous for movie interpretation, so I was like, what. What if I rendered it like, you know, a movie title? I've worked on a lot of films that have that, like, metal type, you know, very big at the moment. So I thought. Yeah, I thought it kind of worked. Again, it was like, historical, but it also had a bit of kind of pop culture about it as well. Yeah. And then to the dragon. So this was my final drawing of the dragon."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":3693.47,"end":3708.74,"speaker":"Jonathan Pageau","text":"And then adding the little branch inside the. The circle too, because we kept struggling at how we're going to include the tree. And then you had this idea of just like, if we just had this little branch, and all of a sudden the tree comes in without it being too explicitly referenced."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":3709.13,"end":3774.46,"speaker":"Heather Pollington","text":"Yeah. I actually saw it on a Roman mosaic. They had this little thing coming in and I was like, okay, that's how we do that. So again, it's just gesturing, isn't it, rather than having to explain the whole thing. So, yeah, this is the final dragon. And I was aware that in terms, this is my kind of concept for the website. I was aware in the website we've got these two elements that I was really happy that the dragon is working on its own as a symbol that you'd be able to use. But in terms of the website, we might want to have two elements together. Then you think about hierarchy, you've got the title, and then the dragon becomes a watermark. So, you know, as for you, as my client, I'm trying to give you as many different opportunities, because you've got many, many kind of applications. You might be doing T shirts, you know, and so you're giving people a kind of set of assets that they can then adapt. So I felt like, you know, that that was going to kind of serve those purposes and. Yeah. So this is the actual website, which is now live and looking great. I'm so pleased. Because it looks exactly like."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":3775.02,"end":3871.48,"speaker":"Jonathan Pageau","text":"Like what you had thought of. Yeah, it's perfect. I think that it does have. That. It does have a kind of cinematic feel to it. And there's also a certain sobriety and simplicity, even though the. The language, like the letters are. Are, you know, are flickering and golden. The basic aesthetics of the website is simple and the same with the. Like, you're showing the thumbnails for the videos too. Heather kind of gave us a direction for the thumbnails to have simple images with simple text and then have the dragon inside. And I think that. Right. Mixture of kind of simplicity with the very animated logo is perfect for what we're doing. Yeah. So now everybody knows the mystery of the new Symbolic world logo. And so, I mean, I think what's great about this is to see how, you know, in some ways, like, somebody would look at the logo now and have no idea that it's based on a Paridexian tree. But it. But in some ways it doesn't matter because the imagery is there and the symbolism is there in the title and in the. In the. It's its own thing. Right. It doesn't have to be explicitly that, but it alludes and it. It refers to. To these types of images in a way that makes the meaning implicit in the image. So it's like that's also kind of how symbolism works. Sometimes we think that you have to make references explicit, even in a story or in a movie, or sometimes it's good to do that, but sometimes you don't have to. You can just have them as being very implicit analogies that don't have to be made to try to make yourself look smart by making them explicit, you know?"}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":3871.48,"end":3930.68,"speaker":"Heather Pollington","text":"Yeah, yeah. I'm a big fan of things that are suggestive, you know, And I think. Yeah, it's. It's. It's ended up being really interesting. I mean, one thing I forgot to say about the dragon is the way that I designed it. I really wanted it to be like a real hybrid creature. You know, it's like the. The. The wing is feathered, you know, it's not like a standard dragon wing. One of the challenges was I Looked into the Norman Sicily and you can't really find any dragons in that world. They're. They're much more like griffins because that world was looking much more towards Islamic art and the east and, and those influences. And we looked at like Mesopotamian dragons and things like that. So it was always going to be a hybrid dragon. And so, yeah, I had the feathered wing and then, you know, the tail is almost like a sea serpent. So there was. It's almost like kind of three creatures stuck together, which."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":3931.88,"end":3976.09,"speaker":"Jonathan Pageau","text":"Perfect. It's more like. Because the dragon and I think that's one of the things we were butting up against is that the dragon in Western thinking is so tired in some ways. Like in fantasy, it has become so tired that, you know, proposing more of a kind of griffin dragon is still the same idea as the dragon. It's the same thing, but it has a freshness to it that makes you notice it differently than if it was. If we'd use the medieval dragon, then it would have been like Dungeons and Dragons. It would have been all these images of Game of Thrones and all these types of things would have been rising up to people's minds and that's not what we wanted."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":3976.73,"end":4010.77,"speaker":"Heather Pollington","text":"Yeah, because I think modern day medieval films are showing dragons in a particular way that we're all used to, as you described, like leathery wings, maybe their scales. But if you look at the dragons in manuscripts, they're really weird. You know, some of them have only got two legs like this one. And then. So I wanted to go back to the really weird dragons, you know, the really, like you say, hybrid, hybrid dragons, and try and use that because if you don't have a direct reference, you really have to kind of pull from different sources. So, yeah, I hope it's kind of unusual in that way."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":4011.73,"end":4067.15,"speaker":"Jonathan Pageau","text":"So, Heather, thank you so much. And I want to make the. Everybody most people probably know that are watching this, but those who don't know yet, Heather and I have been working on other projects. We're going to publish a version of Snow White that she illustrated completely and that I wrote and that I am. It's the thing that I'm the most excited about that I'm doing right now. It's really amazing. Heather just finished up all the illustrations. They're beautiful and powerful and have all this rich complexity in terms of suggesting and symbolism. So I'm looking forward to introducing that to you. We're going to have another conversation in a few weeks that are going to be talking about Snow White and the choices that we made, both in terms of story and in terms of illustration. So I'm definitely looking forward to introducing all that and. And continuing to work with Heather. So, Heather, thanks for your time, and thanks for all your creative energy."}
{"episode_id":"SW - #285 - 2023-05-11 - Heather Pollington - From Hollywood To The Symbolic World","start":4067.55,"end":4069.23,"speaker":"Heather Pollington","text":"You're very welcome. Thank you."}
