{"episode_id":"SW - #374 - 2025-01-19 - The Role of St. John the Baptist","start":0.16,"end":2.4,"speaker":"Laura Diaz","text":"Tucson, the weight is over Mediweight loss."}
{"episode_id":"SW - #374 - 2025-01-19 - The Role of St. John the Baptist","start":2.4,"end":4.56,"speaker":"Mediweight Loss Advertisement","text":"They're officially open on North Oracle Road."}
{"episode_id":"SW - #374 - 2025-01-19 - The Role of St. John the Baptist","start":4.56,"end":7.72,"speaker":"Laura Diaz","text":"That's right. No more counting down the days. You can walk in right now and."}
{"episode_id":"SW - #374 - 2025-01-19 - The Role of St. John the Baptist","start":7.72,"end":9.56,"speaker":"Mediweight Loss Advertisement","text":"Start your journey to a healthier you."}
{"episode_id":"SW - #374 - 2025-01-19 - The Role of St. John the Baptist","start":9.56,"end":11.6,"speaker":"Laura Diaz","text":"Hey, it's Laura Diaz from iheartradio and."}
{"episode_id":"SW - #374 - 2025-01-19 - The Role of St. John the Baptist","start":11.6,"end":44.42,"speaker":"Mediweight Loss Advertisement","text":"You can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks at mediweight loss. I got the same medication, but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options."}
{"episode_id":"SW - #374 - 2025-01-19 - The Role of St. John the Baptist","start":44.66,"end":48.42,"speaker":"Laura Diaz","text":"Tucson, your moment is here. If you're ready to take control, feel."}
{"episode_id":"SW - #374 - 2025-01-19 - The Role of St. John the Baptist","start":48.42,"end":50.26,"speaker":"Mediweight Loss Advertisement","text":"Better and lose weight the right way."}
{"episode_id":"SW - #374 - 2025-01-19 - The Role of St. John the Baptist","start":50.26,"end":52.13,"speaker":"Laura Diaz","text":"Mediweight loss is ready for you."}
{"episode_id":"SW - #374 - 2025-01-19 - The Role of St. John the Baptist","start":52.13,"end":54.53,"speaker":"Mediweight Loss Advertisement","text":"Walk in, get started and see real results."}
{"episode_id":"SW - #374 - 2025-01-19 - The Role of St. John the Baptist","start":54.77,"end":59.17,"speaker":"Laura Diaz","text":"Call or visit mediweightloss.com to learn more and book your free consultation today."}
{"episode_id":"SW - #374 - 2025-01-19 - The Role of St. John the Baptist","start":59.25,"end":62.17,"speaker":"Mediweight Loss Advertisement","text":"That's mediweightloss.com one of the questions people."}
{"episode_id":"SW - #374 - 2025-01-19 - The Role of St. John the Baptist","start":62.17,"end":488.43,"speaker":"Jonathan Pageau","text":"Have sometimes is to wonder what exactly is the role of St. John the Baptist? St. John the Foreigner. Why do we need this kind of wily, strange character to appear before the coming of Christ? And so I thought this could be an interesting thing to talk about, to look at it structurally. There are of course many things we could say, but I really want to look at it in terms of structure, in terms of the symbolic structure that we talk about and what role it is that St. John plays in that. This is Jonathan Peugeot. Welcome to the symbolic world. Now, St. John appears of course before Christ as this rather wild looking character who stands out in the wilderness. He wears camel hair, he eats grasshoppers and he eats honey. And he stands there at the outside of the city, you know, near the Jordan river, which is the edge, really. You have to understand the Jordan river as kind of the edge of Israel in terms of symbolism. We'll see why that's the case. And he tells people to repent and he says the kingdom of God is near. Repent, turn away from your sins. And he baptizes people. Now, again, it's very interesting because of course, baptism in the text it appears something which is obvious, but there aren't baptism in the Old Testament. There are things that are akin to baptism and we'll look at those as well. But there isn't Baptism proper in the Old Testament. So the key to understanding St John the foreigner and his role is something like the role of destruction, the role of the destruction of the old thing that is not appropriate. And so we have structure. So, you know, we talk about hierarchy on this channel all the time. Of course, hierarchies are good, but there are definitely bad hierarchies, you know. Oh, case in point. I totally didn't plan this, but I have it right here. Case in point. You know, that's what Jack and the Fallen Giants is about to some extent, you know, which is in some ways the dangers and the problems of hierarchy, you know, but often all the things that we build in our lives, like the false idols and the false temples and the, you know, and the edifices that we construct, you know, to the. To foreign gods, whether it's to our own success or whether it's to just making more money or to get what we think we deserve, to get what we want. All of these things, they have the structure of a hierarchy, and usually they will be little microcosms of the world, but they are in some ways inappropriate because they're not aimed in the right direction. Because they are. They're skewed, they're crooked, they're not completely straight in the sense that they don't aim high enough. You know, they kind of stop before that. They are, for all intents and purposes, towers of Babel. And, you know, in order for you to come to truth and to be able to participate in the proper hierarchies, in the proper orders of the world, the first thing that needs to happen is, of course, the destruction of the old in order for the new to begin. Now, this is the role that St. John plays, and you'll see how it iterates itself at all the levels that St. John talks about. But before we look at that, we want to look at, you know, some of the Old Testament Prefigurations of St. John of this kind of destruction before the new world. Now, there are a few examples right at the beginning. There's, of course, the flood itself is an example of that, where the entire civilization is destroyed. It's put through the waters in order for there to become a new world, for the world to be made new, to receive a new revelation from God, and to reconnect with God during the time of the flood. There's a kind of forgetting. And you see that in the description of the flood, because at the end of the flood, it says God remembered Noah. And the remembering between God and Noah the remembering between the people and God is this reconnection between the heaven and the earth. But before that happens, there has to be a destruction. So that's why, of course, the world is destroyed before the flood. Then it's reiterated. The whole thing is reiterated. Right after the flood, in this little microcosm which is the Tower of Babel. And at Tower Babel, you see again the same thing which is this building of an hierarchy, of a tower and a city that attempts to touch the heaven, you know, and because of that presumption, because it is completely, let's say, doing it on their own without even trying to be connected to heaven, without receiving, you could say, the impetus from heaven above, it becomes an idol and it shatters. And so it is destroyed, but it's destroyed from above. God destroys it, shatters the tower. Like it's not described in scripture, but in many traditions, you have the idea that the tower falls, the tower crumbles, you know, things get restored back to normal. And then, you know, there has to be again a new beginning. There are again other examples. The example of the Exodus is the one which is probably one of the clearest. You have the Pharaoh who's a tyrant, who is a representation of hierarchy. And in order for Israel to be able to enter into a new covenant with God, they first of all have to, you know, they have to go through the waters, right? They have to go down into the water and, like, restore the world, destroy the previous hierarchy. And the soldiers of the Egyptians and their chariots, they are lost in the sea. And then they come out. And now it's time for a new revelation. You can see, like right now exactly what it is that St. John is doing. He is kind of repeating this, you know, this crossing of the river and the destruction of the old world. The crossing of the river and then the re establishing of a new world. Now."}
{"episode_id":"SW - #374 - 2025-01-19 - The Role of St. John the Baptist","start":489.47,"end":535.32,"speaker":"Annie Crawford","text":"Hello, everyone. This is Annie Crawford inviting you to join me this January for a symbolic world reading of Till we have faces, the book C.S. lewis calls far and away the best I've written. Till we have Faces is Lewis's modern retelling of the myth of Cupid and Psyche, a mysterious tale of dark idolatry, classical enlightenment, and the shocking discovery of true religious vision. Vision. In our four week online course together, we'll explore what CS Lewis has to show us about the nature of myth, the dangers of love, the limits of reason, and the secrets of genuine re enchantment. This is a book, an author and a class. You won't want to Ms. Tucson the weight is over."}
{"episode_id":"SW - #374 - 2025-01-19 - The Role of St. John the Baptist","start":535.32,"end":536.32,"speaker":"Laura Diaz","text":"Mediweight loss."}
{"episode_id":"SW - #374 - 2025-01-19 - The Role of St. John the Baptist","start":536.4,"end":538.52,"speaker":"Mediweight Loss Advertisement","text":"They're officially open on North Oracle road."}
{"episode_id":"SW - #374 - 2025-01-19 - The Role of St. John the Baptist","start":538.52,"end":541.72,"speaker":"Laura Diaz","text":"That's right. No more counting down the days. You can walk in right now and."}
{"episode_id":"SW - #374 - 2025-01-19 - The Role of St. John the Baptist","start":541.72,"end":543.48,"speaker":"Mediweight Loss Advertisement","text":"Start your journey to a healthier you."}
{"episode_id":"SW - #374 - 2025-01-19 - The Role of St. John the Baptist","start":543.48,"end":545.36,"speaker":"Laura Diaz","text":"Hey, it's Laura Diaz from iHeartRadio."}
{"episode_id":"SW - #374 - 2025-01-19 - The Role of St. John the Baptist","start":545.36,"end":578.38,"speaker":"Mediweight Loss Advertisement","text":"And you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication, but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options."}
{"episode_id":"SW - #374 - 2025-01-19 - The Role of St. John the Baptist","start":578.54,"end":582.38,"speaker":"Laura Diaz","text":"Tucson, your moment is here. If you're ready to take control, feel."}
{"episode_id":"SW - #374 - 2025-01-19 - The Role of St. John the Baptist","start":582.38,"end":584.22,"speaker":"Mediweight Loss Advertisement","text":"Better, and lose weight the right way."}
{"episode_id":"SW - #374 - 2025-01-19 - The Role of St. John the Baptist","start":584.22,"end":586.06,"speaker":"Laura Diaz","text":"Medi weight loss is ready for you."}
{"episode_id":"SW - #374 - 2025-01-19 - The Role of St. John the Baptist","start":586.06,"end":588.54,"speaker":"Mediweight Loss Advertisement","text":"Walk in, get started and see real results."}
{"episode_id":"SW - #374 - 2025-01-19 - The Role of St. John the Baptist","start":588.7,"end":593.18,"speaker":"Laura Diaz","text":"Call or visit mediweightloss.com to learn more and book your free consultation today."}
{"episode_id":"SW - #374 - 2025-01-19 - The Role of St. John the Baptist","start":593.18,"end":597.66,"speaker":"Mediweight Loss Advertisement","text":"That's mediweightloss.com this, of course, is an."}
{"episode_id":"SW - #374 - 2025-01-19 - The Role of St. John the Baptist","start":597.66,"end":1429.21,"speaker":"Jonathan Pageau","text":"Image again of what Elijah did. Elijah participates in the falling apart of the northern kingdom of Israel. And then he crosses the river. And when he crosses the river, there has to be a new beginning. And so because there has to be a new beginning, you can understand that in this particular version, Elijah has to go up, he has to be taken up. And then there can be a kind of a new re. Establishment now, reestablishment. It's interesting because it's hard for people to kind of see the reestablishment. But some of the miracles that Elisha does can help you understand the new beginning. And so one of the things that Elisha does is that he finds iron axe head and raises it to the top of the waters, makes the axe head float, you know, and you think, what kind of weird miracle is that? But that's exactly it. It's exactly a miracle that would come after the crossing of the waters. It's like you go down into the waters and then you raise up the head, right? You raise up the head out of the water. Some of the body stays in the water. Some of the outer stuff, you know, some of the body that isn't appropriate stays in the water. And then the axe head, the, the top part gets taken out. And then there's a new world that is beginning. You know, there are plenty examples of that. I don't want to go into it. I want to bore you with, like, all the examples, but just to help you understand the structure of how this functions. And so St. John does this in many ways. He does this over and over. You know, one of the things that he does is, of course, he stands in the wilderness. He has to stand outside of the structure. He has moved outside of the structure and now is criticizing it and is telling people to abandon the evil structure, both in terms of leaving the city to be baptized, but then doing it personally in the sense of that's what sins are. Sins are inappropriate structures of patterns of action and of belief and of orientation that are inappropriate because they're not aiming in the right direction. And therefore, in order for you to be able to get a new revelation, in order for you to kind of enter into this new world, you have to get rid of that, so you have to repent. And this repentance is also taken into the waters. And you're representing. You're participating in the ancient stories. And so although baptism is not explicitly in the Old Testament, you could say that it's there everywhere. It's there everywhere where there's a transition between worlds, where there is going to be an old world that will be destroyed and a new world that will be founded. Now, of course, there are aspects of St. John's baptism that has even more dramatic implications, which is that he also seems to be prophesizing the destruction of Jerusalem, you know, and he's saying, this world is going to end, folks. So where do you want to be? Do you want to remain in the waters? Do you want to. Do you want to. Do you want to go? Do you want to burn up? Do you want to burn up like the old world? Or do you want to participate in a new world that is being established? A new world that will be established very soon? And so there's also that which is happening. And of course, St. John talks about. He talks about the ax that is at the foot, that is at the root of the tree. The axe is at the root of the tree. The axe is about to cut off this tree. And so all of that, what do you think that is? Making the Tower of Babel fall, destroying Babel and cutting the tree? These are exactly the same thing. If you been following the work on symbolism and kind of understanding how symbolism functions, a tower and a tree are the same in terms of their manifestation. They are order. It's like, I'm going to cut down this order because it's not producing fruit and we're going to throw it into the fire. And now we're going to plant a new plant, or we're going to at least get rid of the branches that don't bear fruit in the hope that the rest of the tree can produce, you know, fruitful branches. And so all of that is happening in Saint John. And of course, it is clear as well in this idea that he is the voice in the desert from Isaiah, you know, this voice in the desert that is calling out and is saying, make straight the way of the Lord. You know, bring down the mountains, raise up the valleys, make everything straight, make everything flat. And that's the way to understand it. Like, if you make things flat, then they are ready for a new world. Think about what you need to do if you're going to. If you're going to build a house. And you see it happen all the time, when they build things, they will level things. They'll make things clear so that they can build on them, so that everything is. The old stuff is removed. You're going to remove the trees, you're going to remove the grass, you're going to remove the rocks that are in the way or whatever, and you're going to try to make the ground level to be able to now build a new building on it. You remove the rubble, too. Like, if there's destruction of an ancient city, it's like, remove all the remainders of the ancient world. And so that is, of course, everything that St. John manifests. And that's why he looks the way that he does. That's why he is wild. Because that is the aspect of the wild which is positive. Which is the aspect of the wild is. Think about the wild. Just like, in terms of. If you live, like where I live in Quebec, you know, it's like. Or if you. There are many places that you live, like, if you don't take care of a building for enough time, the wild will take it over. It is. Human hierarchies need constant attention. They need to be held up. They need to be, you know, they need to be kept up. But if you let them go, then the wild will come and take them. And you see these, you know, these ruins that the vines grow through them, and the rain destroys them. Within one generation, you know, the water comes in, breaks it down. You know, like I said, the plants come and will participate in bringing everything down. An earthquake will come and just shatter the building. And so the wild is constantly coming in to attack. And usually we see that as negative. We see that as in some ways a consequence of the fall, which it is. But we tend to see it as negative as the wild beast that are coming to devour you, the snakes on the edge of the camp, all of this stuff. But this is the thing about symbolism is that symbolism is structural. I've said it many times, it's not a simple one way street. And so it's not just like this good, this bad. And so in this case, St. John the Baptist represents everything about this wild aspect, you know, that is, you know, it's like the. Just in the wild is maybe a good way of understanding St. John the. St. John the Baptist. And therefore he is there to level the world and bring about a transformation. And you know, one of the, one of the important aspects of St. John is of course in the way that Christ talks about him. You know, this is of course one of the greatest examples of. One of the things that I talk about in terms of symbolism and how symbolism functions is that this is going to be harder for some people to kind of get, but hopefully the example will help you understand. And so symbolism means that stability and meaning is held from above. Mostly it's not held that much from below. You know, the stability of something is its logos. The stability of something is it in its instantiations. What do I mean by that? It's like, you know, sorry, the cup. So the stability of the cup is in the notion that it's a cup. That's what makes it stable. That's what holds it together. But, you know, and that's why I can recognize different instantiations of cups is because what makes it stable isn't the fact that it's made of wood or the fact that it has this or that shape or this or that size, but it's its purpose and its name and its identity, and that's what kind of holds it in stability. And so if I say something like the man had a cup in his hands, you'll say, okay, yeah, I didn't tell you what kind of cup it was. I didn't tell you what color was. I didn't tell you what size it was. I didn't tell you what it was made of. But you'll say, yeah, but that's an event in the world. Even though I didn't give you any of the details of how that event was instantiated. And I can say, you know, what something, that's true. That man was holding a cup in his hands and he'd be like, oh, yeah, I believe that's true. But you don't know anything about the cup. You know anything about its weight or whatever or its instantiations. Its stability is held in its meaning. And that is how symbolism functions. So, so when there is this prophecy in the Old Testament that Elijah will come before the Messiah. And so when the disciples asked Christ, Christ said, john the Baptist is the Elijah that comes before the Messiah, because in the prophecy, it says that Elijah will come before the Messiah. Now, this is the thing about symbolism. This is. This is going to be. This is the pill you kind of have to swallow, which is, if I ask you the question, did Elijah come before the Messiah? What's the answer? The answer is yes, Elijah came before the Messiah. What's the instantiation of that? John the Baptist. John the Baptist is the Elijah that came before the Messiah. I want you to think about the implications of that. I want you to think about what that means. Now, if I say, is Elijah coming before the Messiah, an event that happened in the world, what's your answer? The answer is yes. And that answer is far closer to what the Bible is saying than if I say, yeah, but Elijah didn't really come before the Messiah. Like, it's not really Elijah. Jesus was like, using a metaphor. He was metaphorically saying, so what Jesus showed us was that when in the Old Testament, it said that Elijah would come before the Messiah, like it was a metaphor. You know, it's like everything else in the Bible is not a metaphor. But that was particularly a metaphor. And, you know, and so when Jesus kind of revealed that it was a metaphor, that in fact Elijah wasn't gonna come before the Messiah, but St. John the Baptist would come as a kind of Elijah, right? You know, as a kind of metaphorical Elijah. And it's like, no, that is the absolutely the wrong way. If you go down that path trying to understand Scripture, it's going to come back and bite you a million times, you know. And that is why the symbolic approach is so powerful. Because I do believe that Elijah came before. If you ask me, do you believe Elijah came before the Messiah? The answer is yes, I really do believe that. That is my first stance, my first sense that Elijah came before the Messiah. And then I say, you know, and I say, yeah, and St. John the Baptist was Elijah. But my first place to stand is that. Is that the prophecy came true. Elijah came before the Messiah. And that way of talking and that way of thinking should inform so much of how you interpret Scripture and understanding that the reason why we care about it is in its meaning, in its structural Coherence and in how meaning is used in a very different way than what the kind of modern materialist reductionist would want it to be. And the truth is that it is much closer to reality in the very same way that if I ask you again, if I tell you that that man was holding a cup in his hand, I didn't. I'm not in any way giving you the details of that instantiation, and you don't need them in order to know that they're true. I could. I could give you the details of that instantiation. And if I do, you know, then whatever, maybe if there's a reason why it would be helpful to do that, if I want to differentiate it from something, or if I want to help you kind of see something in particular, you know, but it's not necessary the last part, you know, it's like."}
{"episode_id":"SW - #374 - 2025-01-19 - The Role of St. John the Baptist","start":1431.16,"end":1431.32,"speaker":"Mediweight Loss Advertisement","text":"If."}
{"episode_id":"SW - #374 - 2025-01-19 - The Role of St. John the Baptist","start":1431.32,"end":1802.27,"speaker":"Jonathan Pageau","text":"I see that there are these characters before the end of the world that are taken up, right? And so you have an image of Enoch that is taken up, that walks with the Lord and disappears in this image that he's taken up. This is more in the tradition because they base it, then again on Elijah, that Elijah is taken up. And then the question about St. John the Baptist, was St. John the Baptist, like Elijah and Enoch, taken up before the end of the world? Before the, you know, before the transition? And the answer is yes, he was, you know, because his head was taken. His head was taken. And this is going to be weird for a lot of people, you know, because you're going to say, well, that's not the same. You know, his head getting cut off is not the same as being taken up. But if you knew the scripture, you would know that it is actually the same. And one of the things that Jesus is doing in the story is he is collapsing the positive and negative symbolism. The fact that Christ on the cross is both being raised up and then also being killed and crucified and humiliated. All of this is already there in the symbol of St. John the Baptist. And what it's referencing, the fact that St. John is taken up by his head being cut off is referencing the story in Genesis, the story of Joseph. So in the story of Joseph, Joseph goes into prison. So these two characters in the prison with Joseph have dreams. And the cup holder has the dream that he sees vines in front of them. I think it's like three vines that represent the three days. And he has the Pharaoh's cup, and he presses the wine into the cup and he gives it to the pharaoh. That's the dream of the cup holder. And then the. The dream of the baker is that he has this, I think, basket of bread on the top of his head. He has head on top of his head. And then the birds come and they pick the bread out of the basket. Now, there's a lot to say about that symbolism. Maybe one day I'll make a video about the entire thing, about the relationship between, of course, the bread and the wine. All of this is relatable. But then they ask Joseph, what does the dream mean? And so Joseph tells the cup holder that in three days, the Pharaoh will lift you up, you know, lift you up, back into your position at his side to offer him the cup. And then he says to the one with the. To the baker, like he says, in three days, the Pharaoh will lift you up, you know, but lift you up in the sense of cut your head off and lift your. Lift. That's why the birds were taking the bread from his head, are going to lift you up and take you away. So here it's like, it's very powerful because you can really see the symbolism of the negative aspect of tyranny and of order, where the birds from heaven, like the angels from heaven, come down and take the bread and bring it up, and that's his head getting cut off and being lifted up. But the text uses the terms very similarly, like both it's, the Pharaoh is going to lift you up, and one is into your death and the other is into the service. And then in the story of St. John the Baptist, those two are the same. They are brought together. In some ways, it becomes an image of future martyrdom where, you know, the death and glorification of someone are the same. And that St. John's head getting taken up by the king ends up also him being taken up before the fall and before the destruction of Jerusalem and the founding of the new world. And so there are other examples of that. Of course. Of course, Christ going up into heaven is the ultimate final version of that. But there's already an intimation of this kind of symbolism in St. John the Baptist head being taken up. And so that's the last little bit of maybe a little more esoteric symbolism that I wanted to point to. But mostly I wanted you to understand that the role of St. John is very important in the idea that one of the aspects of the incarnation is a transition between an old world and a new world. So you need this kind of character to hand off and to destroy and to criticize. Because if you remember, St. John criticizes the king. That's what gets him killed. To criticize the old world, to level it, to destroy it before a new world world can be founded. And so. And so, you know, so don't. How can I say this? I think that we have to be careful as people not to get caught up in criticizing the world in which we live. You know, we have to ultimately focus on God. But it is part of reality. We do need to break down the idols and to break down the things that are falsely built up. And so sometimes. And some people definitely have that role more than others. And so even though for some people they can be annoying to hear only criticism and we have to be careful not to feed ourselves only with that kind of stuff. You know, this is an important role in the restoration. So thanks everybody for your time. Thank you for your support. Don't forget to get Jack and the Fallen Giants. It is available on our store. There are a lot of great stuff coming next year and I'm looking forward to it. So thanks everybody for your time. Talk to you very soon. Bye Bye. If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase, so go to thesymbolicworld.com and thank you for your support."}
{"episode_id":"SW - #374 - 2025-01-19 - The Role of St. John the Baptist","start":1803.08,"end":1805.4,"speaker":"Laura Diaz","text":"Tucson. The Weight is Over Mediweight Loss."}
{"episode_id":"SW - #374 - 2025-01-19 - The Role of St. John the Baptist","start":1805.4,"end":1807.56,"speaker":"Mediweight Loss Advertisement","text":"They're officially open on North Oracle Road."}
{"episode_id":"SW - #374 - 2025-01-19 - The Role of St. John the Baptist","start":1807.56,"end":1810.8,"speaker":"Laura Diaz","text":"That's right. No more counting down the days. You can walk in right now and."}
{"episode_id":"SW - #374 - 2025-01-19 - The Role of St. John the Baptist","start":1810.8,"end":1812.52,"speaker":"Mediweight Loss Advertisement","text":"Start your journey to a healthier you."}
{"episode_id":"SW - #374 - 2025-01-19 - The Role of St. John the Baptist","start":1812.52,"end":1814.6,"speaker":"Laura Diaz","text":"Hey, it's Laura Diaz from iheartradio and."}
{"episode_id":"SW - #374 - 2025-01-19 - The Role of St. John the Baptist","start":1814.6,"end":1847.4,"speaker":"Mediweight Loss Advertisement","text":"You can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project. Ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options."}
{"episode_id":"SW - #374 - 2025-01-19 - The Role of St. John the Baptist","start":1847.64,"end":1851.44,"speaker":"Laura Diaz","text":"Tucson, your moment is here. If you're ready to take control, feel."}
{"episode_id":"SW - #374 - 2025-01-19 - The Role of St. John the Baptist","start":1851.44,"end":1853.28,"speaker":"Mediweight Loss Advertisement","text":"Better and lose weight the right way."}
{"episode_id":"SW - #374 - 2025-01-19 - The Role of St. John the Baptist","start":1853.28,"end":1855.09,"speaker":"Laura Diaz","text":"Mediweight loss is is ready for you."}
{"episode_id":"SW - #374 - 2025-01-19 - The Role of St. John the Baptist","start":1855.09,"end":1857.57,"speaker":"Mediweight Loss Advertisement","text":"Walk in, get started and see real results."}
{"episode_id":"SW - #374 - 2025-01-19 - The Role of St. John the Baptist","start":1857.81,"end":1862.21,"speaker":"Laura Diaz","text":"Call or visit mediweightloss.com to learn more and book your free consultation today."}
{"episode_id":"SW - #374 - 2025-01-19 - The Role of St. John the Baptist","start":1862.21,"end":1863.97,"speaker":"Mediweight Loss Advertisement","text":"That's mediweightloss.com."}
