{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":0.16,"end":59.17,"speaker":"Laura Diaz","text":"Tucson, the weight is over Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight and serious risks at mediweight loss. I got the same medication but with a customized plan, weekly check ins and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":59.25,"end":89.14,"speaker":"Jonathan Pageau","text":"That's mediweightloss.com Music is the most abstract of the of the arts, especially just music. Like when you hear a choir, like when you hear choral music. It's not as abstract because it definitely connects to. It definitely connects to meaning and to, you know, the way that we experience storytelling or. But when you have just music that is only sounds that are playing against each other, why do you think we care? Like what is it about. That's what's happening that makes us pay attention."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":89.86,"end":150.23,"speaker":"Nicholas Reeves","text":"Looking at music as a experience of acoustics, you could start with the understanding of music having its own internal balance and order. Some would say this is the overtone series where certain pitches are arranged naturally without any manipulation with certain intervals and colors. And based on that raw experience of science, we can extract from that different melodies and or rhythms. And it's something that's just there, it just exists. And this is what has fascinated the. What fascinated the ancients when it came to music. And I think a lot of it has to do with the order it brings to us internally. It's an ordering experience. And that's why when they're. Let's look at film score. When you see a thriller and something's about to happen, there's more cacophony, there's more dissonance. And then when something comes to order, you feel more resolution in those moments."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":161.91,"end":227.86,"speaker":"Jonathan Pageau","text":"This is Jonathan Pedro. Welcome to the Symbolic world. So, hello, everyone. I am here with Nicholas Reeves. Nicholas Reeves is a musician. He's a church musician. He has taught at St. Vladimir Seminary. He's also on the faculty of Adelphi University, and he's known in Orthodox circles. He's been recommended to me by Richard Roland, who said, you know, Jonathan, since you don't understand music, you should probably talk to this person. And so, you know, I have to be honest with you, like, it's a little bit of a. Like, we're going to jump into the fray because we, both of us are in the same situation where Nicholas was also told by people, hey, you should talk to this guy, Jonathan Padjo, I guess. And so. And so we'll get. We'll get into the conversation and hopefully we'll. He'll be able to help me understand a little more what's the relationship between music and symbolism and help me kind of refine my understanding of what its function is in the world. So, Nicholas, thanks for coming on."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":227.94,"end":230.58,"speaker":"Nicholas Reeves","text":"It's a pleasure to be here. Let's see what happens."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":231.54,"end":240.02,"speaker":"Jonathan Pageau","text":"Let's see what happens. So maybe tell people just a little bit more about your background, about what you do, how you got to where you are, and then we can move from there."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":240.58,"end":472.67,"speaker":"Nicholas Reeves","text":"I, as you said, am a musician. I have been trained in classical compositions for orchestra, chamber music, choirs, etc. I am also a working church musician. I have a church choir on Long island in the Orthodox Church, and I taught at St. Vladimir's as you said. And I also do workshops where I prepare church choirs to get ready for certain seasons, Pascha, Holy Week, the festal cycle, whatever that may be, or just how to improve in general. And I approach it from a pedagogical methodology of starting with simple materials, and the choir builds on those skills. So I have my hands in many pockets. I also write electronic music that incorporates sound sources and found sounds and puts them together. And I really am all over the place in terms of media, multimedia, using projections, using sound sources that are sampling sounds, or it's just acoustic music. Absolutely no interaction with electronics whatsoever. So putting sound together, juxtaposing sound, I think that's the best way to talk about composition. That's what it is. And if there's any meaning to that. I saw this beautiful quote from Leonard Bernstein that we shouldn't listen to music to understand things. We have contradictions, and in between those contradictions we find meaning. And I very much agree with that perspective that you have in music. Contradictions of dynamics, loud, soft tempo, fast and Slow. Everything in between, beautiful moments, caustic moments. And juxtaposing those ideas is in some ways a reflection of our human experience. And I see music more and more as a handprint, like in Lascaux in France, those caves, those cave paintings that go back so many centuries, where you can see people's handprints on the walls and that it's a part of them and the artwork, that the symbolism in the artwork isn't just representing an animal they saw or a tree, but it's actually their interpretation as humans of what they saw. And I think that's very important to understand. It's an abstraction from a collective experience that it almost feels like it needs to be done. I mean, why else would they do this? It doesn't help their hunting or their gathering or their survival, but maybe it helped them understand better who they were as a tribe or as a small society. It provided some type of mental coherence, and I think we can extend that today. Whether it's a rock concert, whether it's a classical concert, there's something that we desire in terms of understanding ourselves. Whether it's through words or whether it's through sounds or sounds with words. It helps us to make sense of what's happening because people still want it. You know, people pay a lot of money to go to these experiences, whether it's Coachella or Bayreuth, to hear Wagner's operas. It's a huge investment of time. So there's some need that people are harping onto or holding onto. And I think a lot of that has to do with the logic and the coherence that music provides."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":474.59,"end":514.38,"speaker":"Jonathan Pageau","text":"One of the things that people have said in some ways is that music is the most abstract of the arts in the sense that especially just music, like when you hear a choir, like when you hear choral music, it's not as abstract because it definitely connects to. It definitely connects to meaning and to, you know, the way that we experience storytelling or. But when you have just music that is only sounds that are playing against each other, you know, what do you think? Why do you think we care? Like, what is it about that's what's happening that makes us pay attention?"}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":515.74,"end":679.59,"speaker":"Nicholas Reeves","text":"That's a really good question. I think the experiential perspective is a good starting point, because it's all the adjectives that begin with our experience of music, and then our understanding maybe comes later. I was moved. It was beautiful. It was riveting. You know, some type of descriptor is how people explain or make sense of Their music experience. And it's a pretty mysterious thing, having sound waves come together in a certain arrangement and how it impresses upon our mind and some would say, even our souls, and how that makes such an impression on us, who we are, whether it's with words, like you said, with a choir, where there's more definite meaning, or whether it's through instrumental music. I think looking at music as a experience of acoustics, you could start with the understanding of music having its own internal balance and order. Some would say this is the overtone series where certain pitches are arranged naturally without any manipulation, with certain intervals and colors. And based on that raw experience of science, we can extract from that different melodies and. Or rhythms. And it's something that's just there. It just exists. And this is what has fascinated the. What fascinated the ancients when it came to music, of how if you take a string and pluck it on a harp and then divide the octave, you get the same sound up an octave. And they were just fascinated with this experience of sound. And I think a lot of it has to do with the order it brings to us internally. It's an ordering experience. And that's why when they're. Let's look at film score. When you see a thriller and something's about to happen, the music gets more cacophonic. There's more cacophony, there's more dissonance. And then when something comes to order, you feel more resolution in those moments. And we respond to that. It makes sense to us. And I think that's our extraction and our interpretation of the overtone series. Natural sound sounds we hear in nature. Some people are very influenced by bird sounds, sounds of other animals, sounds of water. You know, it's our interpretation of the order that we see around us and how we try to incorporate that into some type of communal event."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":682.23,"end":724.54,"speaker":"Jonathan Pageau","text":"Yeah. My intuition has always been that it's. That it all is. How can I say that? It all is a kind of downstream from the human voice or the experience of the human voice. Because the music of, let's say, the sound of water, let's say, or the sound of, I don't know, a branch falling in the forest. All these sounds, they don't provide. I mean, let me go down the stream and see what you think. But they don't provide order in the same way that the human voice does. Right. So the human voice, it provides you with, for example, it's a way into the other person."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":724.54,"end":724.82,"speaker":"Nicholas Reeves","text":"Right."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":724.82,"end":855.64,"speaker":"Jonathan Pageau","text":"It's a way in. As I'm standing in front of someone, there are different ways into that person's like conscious experience that I, that because I don't, I'm not in their experience. I hear their voice. I can recognize intentionality, emotion. There's a kind of drama to the human voice that will create fear in me. Like if someone yells at me or if someone's whispering, or if someone you know, or the sound of your mother, like this high voice that has a certain thing to it, the sound of your father, that is a deeper voice. It's maybe more protective, more so. There are these different things that we experience and I, and I've always wondered if music is a, is a fine tuning of that or, you know, a kind of pushing these, these tendencies that we, that we have to learning the human voice into, into patterns that are hyper versions of that. Because one of my contentions is that that's what stories are. Stories are basically taking events. Let's say you have events in your life that are meaningful to you. Like you have a love story in your life. And then what a story does is that because amongst your love story there's all this other stuff going on, right? You're going to sleep, you're eating, you're working, you're doing other things. But there is a line that goes through that love story and when you pull it together and then you can tell, you can say it, you can say, you know, here's a one and a half, one hour and a half version of a love story, then people are completely captivated because what it does is it pulls things together and it contracts them in a way that is a hyper, hyper version of experience they normally have. And so that's what I always wondered. I mean, this is my, my. I'm sure other people have thought similar things, that that is what music is. That's why we care about it, because it. From a phenomenological point of view, because in some ways it is a abstracted or contracted. Like it's, it's like a hyperversion of our experience of the human, of human interaction with voice."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":856.92,"end":1189.9,"speaker":"Nicholas Reeves","text":"So these are all very interesting points that I, I want to explore more. There was a Babylonian tablet from thousands of years ago, and some may consider that to be the first notation of music. And it's the notation of vocal music. And what's interesting about that is it is a texted piece of music, obviously, because it's for the voice and for anything to be written down. I'm sure at that time period it had to be worth it because of the media were so Expensive to use and the only. There were a certain class of people who actually write down things. So it must have been that important for the society that they thought that they needed to document it somehow. And you see this throughout the centuries of the documentation of music. Not all of it, but there's a lot of it that is vocal and not just sacred music, secular music, too. And your point about entering into the mind of the other is a fascinating point of departure because it helps you to. It's about understanding. Yes, it's part of a conversation, but the conversation cannot really move forward without understanding. So when you have someone literally voice his or her thoughts in a vocal context with lyrics, then you're able to appreciate the perspective more concretely. But then you talked about the compression. It's almost like it's extract, vanilla extract, of the human experience. You know, you just take the most interesting parts or intense parts and put it together in a very condensed amount of time. And, you know, even with a large work like a Beethoven symphony, you still feel the compression. There's so much intensity that happens from the first note all the way to the last note. And it does feel like extract of life, order, society, balance, dissonance, consonance, sorrow, joy, whatever it may be. I mean, these are very general concepts. But, yeah, I think that vocal music is very important because of its meaning. And then the idea that you could actually enter into someone else's frame of mind is part of the mystery of, I guess, speech. And then you enter in someone else's mind by a musical means where it almost feels elevated. Hi, this is Sarah from Hamilton, and I'm very happy to announce my first course with Symbolic World, the Key to Reality. Over the span of five weeks, we will look at the scriptural vision of reality through the lens of the Temple. We will see how all the details of Scripture orbit around the person of Jesus Christ, the eternal word of God and archetype of the world. And we will see how that christological vision firmly earths in place the concrete details of Israel's Torah and story. Through that lens, you will come to see how meaning and matter intersect and intertwine, not only in the text of Scripture, but in the very tapestry of reality unveiled by the Bible. If you. I've done some experiences, sorry, some experiments with the human voice where I'll take a word or a sentence and I'll stretch it out with a computer program for a very, very, very, very, very long amount of time. And what's interesting, you start to hear when you stretch out human Speech, it starts to become pitch oriented. You hear distinct pitches because we're speaking so quickly that we have so many pitches occurring while we communicate to each other that it's hard to pinpoint anyone. If you were to really elongate each phoneme, you could sort of swim in it. There's so much sound there. And while music is a compression of the human experience, it's also entering into a different timeline where the sonic effect of it is almost the opposite, where its time slowed down, slow motion. It's as if you could take one emotion and just dwell that for 30 minutes or 20 minutes or 15 minutes, because it's been stretched out through sound. Because sound itself, its very nature, is a vibration of a medium, whether it's a violin string or the vocal cords. And they vibrate so quickly they create a pitch. But then if you keep going faster and faster and faster and faster and faster and faster and faster with those pitches, they start to become percussive in sound. And so in a way, our human speech patterns are somewhere in between that long, sustained pitches and percussive sounds. And so there's that example of contradictions, of juxtaposition of opposites, where you have a compressed, extracted moment of human life, but you're experiencing in slow motion. It's almost. Yeah, I know people are annoyed with cliche terms. It sort of feels like a mystery. When we listen to music, we don't know why it does what it does to us. You know, it's scientific. And then it also isn't at the same time."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":1191.58,"end":1215.8,"speaker":"Jonathan Pageau","text":"Yeah, there is, because there's the whole other aspect which what you said made me think of, which is on the one hand, there's this sense, you know, this sense of the. An abstraction of the human voice, you know, but then there's also in music, the percussion element, you know, or the rhythm element, the idea that it makes people dance."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":1216.04,"end":1216.6,"speaker":"Nicholas Reeves","text":"Yeah."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":1217.56,"end":1330.39,"speaker":"Jonathan Pageau","text":"And then it. Then it's directly related to the idea of pattern, pattern moving. The idea of doing things in a. In a kind of. In a patterned way. And so, you know, and it's interesting what you're saying, to say that in some ways the percussion is a sped up sound, right? That, that if you, if you. If you go really fast and it turns into that, into this beat, to this rhythm. And when we speak, we do have a rhythm, obviously, you know, there's a. There's a beat, there's a rhythm, you know, you know, it because when you meet people that don't do it, right? It. It's a Like when you meet people that over talk, you know, they don't know when to stop talking and they just keep going. And that's. There's, like, there has. There should be a beat and the other person should be able to speak. When you, when you encounter that, you realize that there's a rhythm to speaking. You know, there's really a rhythm, and it's. It's there between people, but it's also there in the way we speak. There's this rhythm. We have sentences, we have words. All of these are actual, are actual punctuation, right? They're related. They're related to. They're related to the idea of rhythm. And so it's interesting to think that in some ways, music, especially ancient music, you know, it would have had these two extreme elements. On the one hand, an abstracted version of. Of sound that would be, you know, just these tones that are in patterns, but then also a type of. Of rhythm that would actually also make you move, that would make people move. And so everything is vibrating. Like, you know, you're vibrating and the, the music's vibrating. Anyways, it's interesting to think that when you listen to music, sometimes you can't help it. Like, you hear music, if there's a beat to it, your body just will start to follow it."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":1331.51,"end":1344.07,"speaker":"Nicholas Reeves","text":"Yet children do this instinctively, especially toddlers or younger than toddlers. When they hear music, their bodies start to sway, and in time too, they don't even think about it."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":1344.72,"end":1344.96,"speaker":"Jonathan Pageau","text":"They."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":1345.44,"end":1461.42,"speaker":"Nicholas Reeves","text":"It's that, like you said, that outward sounding of rhythm, of vibrations, which is what rhythm is. And let's go back to the concept of dance and contrast that to song music. A lot of song music can be used for a lament, something that's sorrowful, a tragedy that happened where joy is usually shown in dance and traditional cultures. You know, you see this in Judaism, you see this in African cultures. You see this in almost any culture. Joy is shown through dance. That organized, rhythmic, corporate experience of people following patterns together and they feel united to each other. It's a very bonding experience. And that right there is a physical manifestation of what music does and helps us to understand why do we want it so much. Because it maybe is fractal. It's us feeling different patterns and symbols and shapes that on a smaller level relate to larger ones in the world. Whether it is patterns that are natural in math, seashell shapes and different Pythagorean means and, you know, golden sections and whatnot, and how that can correspond to a corporate event of archetypes and Things that we experience, but that we feel. It's not just cerebral. We really. It's visceral in our gut. We feel that this is right. It resonates. Literally. Literally. And I think it's a continuum."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":1461.74,"end":1463.1,"speaker":"Jonathan Pageau","text":"It literally resonates."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":1463.18,"end":1579.06,"speaker":"Nicholas Reeves","text":"Yeah, it does. It makes you want to dance, you know, and you. You have the continuum where you start with. I talked about pitch becoming rhythm, but rhythm can start as a pitch could start as rhythm, where it's just a, let's say a wood block sound. If you take a wood block sound and you were to speed it up very, very, very, very quickly. I mean, you need a computer to do this. That woodblock sound starts to turn into pitch. And then if you keep going, going, going, going further, further, further, further, further, that pitch sound, if you especially add more beats that are happening, can become static. And the static, if you extract that, it goes back to that one rhythmic pulse. So you could. You could think of sound as just this continuum of definite rhythm that turns into pitch, that turns into chaotic static, that goes back to rhythm. And where on that design, that model, are you going to extract your experience of music and what's its purpose, what's its function? Is something that we have a greater ability to do now that it's the 21st century because there's so much cross pollination of different cultures. Technology has very, very much changed composition. Everyone can have his or her own studio now in a room. You can make your own album. You could also become your own producer. You could balance sound in a way that's so detailed. And also you could share online, you could hear what someone else is doing in a completely different continent. You can share files with each other. And so it's a very different synthesis of sounds that are happening now. Where, if you were looking at traditional cultures, you were basically confined to those regions. You see similarities."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":1579.3,"end":1596.11,"speaker":"Jonathan Pageau","text":"Yeah, but it's funny that you say that, but at the same time, it feels like, at least in terms of popular attention, there's almost like a leveling that's been happening, you know, especially in the past, like 15 years. I mean, every pop song sounds exactly the same, you know?"}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":1596.11,"end":1596.47,"speaker":"Nicholas Reeves","text":"Interesting."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":1596.47,"end":1604.03,"speaker":"Jonathan Pageau","text":"Sometimes you even wonder, you think, like, I've heard that. I didn't. I hear that. Like, I haven't just heard that song. It's. It's very weird what's going on."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":1606.99,"end":1662.77,"speaker":"Nicholas Reeves","text":"This is a. That's also interesting, you know how the more variety you get, sometimes it creates a sameness in terms of production, in terms of output, but then you take a deep dive on SoundCloud with all these indie artists, and they're just doing their own thing. I think in more mainstream artists, there's a certain standard and formula, so to speak, and once you know it and you hit it, you. You're more marketable, and that sameness is more apparent there. But some of the most interesting artists are DIY artists, and a lot of them this year got a lot of recognition at the Grammys. And you listen to their music, and it's just really, really refreshing to hear people just do their own thing and not look back and say, nope, this is the lane I'm choosing. I'm just going to focus on this."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":1667.19,"end":1683.59,"speaker":"Jonathan Pageau","text":"Yeah, definitely. Interesting. And so how do you see. Because you, on the one hand, I heard you say something, like you said, you. You're involved in church music, but then you're also doing things like sound, like found sound and like this more kind of contemporary type."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":1683.67,"end":1684.07,"speaker":"Nicholas Reeves","text":"Right."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":1684.47,"end":1721.89,"speaker":"Jonathan Pageau","text":"I guess I could call it this. This. There's a. Something accidental sometimes about these types of modern compositions. I haven't heard your composition, so I don't. I don't know. So how do you bring. How do you reconcile that in your. Because I've learned many musicians, I have some that are close to me who, on the one hand, in church, are quite traditional and really kind of try to follow the tradition of the church. But then their compositions are wild, like, they're atonal. They have these kind of very, very extreme aspects to them. And so I'm curious to know how you bring that together in your mind."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":1723.73,"end":1849.88,"speaker":"Nicholas Reeves","text":"I've thought about this a lot, and sometimes you're a jack of all trades. You know, there's so many different influences around you, and you write for whatever project's in front of you. So I had one project where I had to write a piece based off of the interviews of what could have been someone who heard the final transmissions of Amelia Earhart. So this is way outside the box. Yeah, exactly. Way outside the box when it comes to someone who writes from the Octoikos, you know, the eight tones or Cassock every weekend. And I'm not knocking either lane, but, you know, it's outside your comfort zone. But then what you find is that. Well, actually, our experience is pretty broad with all the different things we absorb in terms of images and sounds. With the Internet and just in our education, we have a pretty rich. Not only background and training, but also appetite. I mean, look at our cuisine in America. I mean, I'm in America, but, you know, you have a lot of Western cultures. Now have a fusion of just about every culture that lives there. And so you see those recipes all working together. And it's not at all uncommon for you say, okay, I want Indian food this night, and then I'll have Italian food this night, and then I'll have some Mexican food this night, and then I'll make some heroes this night. And they're all completely in different categories, but you're consuming them in one week. And I feel the same way with music. I think culinary analogies are very apropos when it comes to music. You have to create something that works for a gathering. You have to understand the timing of each course as it comes out, like a movement of music. And you must understand how certain ingredients work with each other for the desired effect that you want. And you cannot fake it. Because when it comes to food, everyone. Not some. Everyone's very particular about food. So you really have to know what you're doing. It's chemistry, you know, it's the same thing with music."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":1849.88,"end":1990,"speaker":"Jonathan Pageau","text":"Yeah, yeah. The food analogy is interesting, especially the way you presented it to us, because on the one hand, the last example you gave is something about how all there has to be a kind of dance of the elements, right? So everything kind of comes together. There has to be a coherence. You have to experience. Experience the. The food as having a certain type of coherence. If you. If you go too far in one direction or the other, then you lose people. If you make it too spicy, too salty, whatever. Like, if you like, you can just go off the track and basically make it unpalatable for people. But then you also presented the other aspect, which you said, you know, the fusion in the sense of, like, people now they have Mexican food one night, Indian food the other. And so there's actually a disjunct. Like, there's this idea that there is no. There is no common experience anymore. That. That in fact, it's. There's an individualized experience. And you mentioned that also with the extremes of the pop artist, as someone who basically does this drivel that everybody can agree will make money. And so it ends up being all the same. But then you also have the other extreme, which is a bunch of people doing their own thing and not caring about what the others are doing. And so these two extremes are interesting. So I'm curious to know what you think of that. Because my tendency is to think. Honestly, like, my tendency is to think that both of those are dangerous. That in fact, that true symbolism or true coherence is something like A joining of the multiple and the one together in a real dance, like in a higher dance. Right. So you have. You need a type of unity for. To have a coherent experience, but you also need some spice, some diversion, some exploration in order for it to be interesting or to make your curiosity wake up. Anyway, so I'm curious what you think about that in terms of music, because we seem to have these. Everything seems to be moving in different extremes in my impression."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":1991.12,"end":2120.89,"speaker":"Nicholas Reeves","text":"There's also the path you have to choose. Do you keep. Once you found your recipe, do you keep replicating that? Or do you reinvent yourself every two to three years? And that's something that you see in popular music especially. Yeah, one of the biggest examples of that was David Bowie. You know, every two to three years there was a different look, a different outfit, different sound on his albums. And, you know, you see other artists after Bowie really follow that model so they can stay current, fresh, contemporary. I guess one of the problems of that is it sort of feels a little schizophrenic. You know, you're. You never really focus on one thing and hone in on that craft and want to really get into it. Although looking at David Bowie's last album, it's sort of a full circle. He's. He's coming back to the concepts of Major Tom, coming back to the concepts of self isolation and, of course, schizophrenia. Ran in his family on a personal level with David Bowie. And so if you're so your own person, you become your own niche commodity. Let's say you're that DIY artist who has found what works for him or her. Then what happens is, well, do I keep doing that same thing or is it going to turn people off because I haven't really expanded, or do I go more pop? That happens with some musicians. You know, this is interesting, we're on this topic, but, you know, some musicians started one genre, like country, and they're like, no, I want to go more mainstream. And now you see the opposite happening. People are more mainstream and now they're going to country. And also country is a huge market. But in any event, I do think it's a combination of not caring what other people think. But. But that's different than saying, I'm going to write the most off putting caustic music that is going to make everyone put their hands over the years, but I'm going to stick, stick to my principles. That's different. That's different."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":2122.17,"end":2135.72,"speaker":"Jonathan Pageau","text":"The idea that the musicians, the character of other people think that's just that's just a lie. I mean, if they're putting it up on Spotify, it's because they clearly care about what other people think. Like they're, they're. They want the react. They want to see what other people."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":2135.88,"end":2136.36,"speaker":"Nicholas Reeves","text":"That's right."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":2136.36,"end":2137.32,"speaker":"Jonathan Pageau","text":"Think of what they're doing."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":2137.56,"end":2138.2,"speaker":"Nicholas Reeves","text":"That's right."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":2138.36,"end":2145.24,"speaker":"Jonathan Pageau","text":"And so, you know, the, the posture of, of the, you know, I just do this for myself and I don't want, I don't care what other."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":2145.96,"end":2153.56,"speaker":"Nicholas Reeves","text":"To a certain extent. Right. Because like you said, it's sort of counterintuitive to making all of your art public and to be consumed in a public way."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":2154.12,"end":2218.97,"speaker":"Jonathan Pageau","text":"You know, as soon as you make something public, then you, it becomes, you can't, you cannot avoid the question of it being received, you know, by a group of people and that you end up participating in a discussion or in a. You end up participating in something. But yeah, it's fascinating to think about. So, I mean, I don't know what your approach is to church music. So how do you see that as connecting to church music, do you think? You know, some people might say that the orthodox church music in America is idiosyncratic. You know, I've heard people say that where they're saying it actually is just an import from the outside. It doesn't fit with our melodies, our tones. It's in some ways a. It doesn't make sense, you know, and so now we're also seeing people try to adapt. Like you've obviously heard the famous little Appalachian, you know, is Risen version of Christ is Risen that I think really struck a chord with American people like."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":2218.97,"end":2228.05,"speaker":"Nicholas Reeves","text":"It and people in Europe too. You can hear choirs in European countries make their own YouTube video of that arrangement. It struck a chord with them."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":2228.05,"end":2233.65,"speaker":"Jonathan Pageau","text":"So what do you think of the situation of orthodox music in America in terms of the different questions that were asked?"}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":2234.45,"end":2459.13,"speaker":"Nicholas Reeves","text":"Good question. Before I get into that, I just wanted to summarize what we were talking about. Where you do need to have your principles, you need to stick to your guns. But usually the principles that you should stick to have to deal more with craftsmanship than being off putting. I think that your principles should be things that are commonly experienced, like breathing, sighing, love, relationships, communication. Music is a huge part of communication. And so you work on that through craftsmanship, through getting better and better and better and better at what you do. Now that could apply to electronic secular piece or orthodox church music. So there are certain principles that I take into consideration. Yes, it's true, there are. There's a lot about the orthodox Church as it is experienced here in. In the Western Hemisphere, that does feel imported. And then there's a lot of it where it. It must be. It must come from a living, breathing tradition. It's not arbitrary. And I think I tried to learn. Someone told me that you should learn a chant tradition very well and study with a master chanter. And it doesn't matter what tradition is. You need to learn something and really understand what it's worth and its value at the same time. I learned Western counterpoint, Western arranging technique, and then I have a lot of experience with just working with regular people in church choirs and what works for their voices. And instead, this is where the square peg is forced into the round hole. Taking a particular context, let's say, in Imperial Russia and enforcing that in a parish in America in terms of technique or skill set may not work. A lot of the times it doesn't. So I try to really think about what are the strengths and weaknesses of your average American singer, but always in an elevating way, how can they sound the best? And so practicality plays a huge role in what I do in church music. I'm also very much geared towards using traditional chants or melodies as a starting point and making my arrangements as transparent as possible, because it's meant for corporate prayer. You know, there. There is a very directed use of the music. And the music is to lead people into the teachings of the church, the mystery of Christ, the. The liturgy in particular, and all of the offices built towards the Eucharist and the Divine Liturgy. And it's a pretty awesome responsibility to have. And so approaching it with that understanding of understanding, you know, it's to teach, it's to educate, it's to bring people together. And it also needs to be done in a way that opens, I say, your heart or your soul, if you want to use these terms, if we could talk about them to prayer. St. Porphyros talks about prayer before prayer. Lighting candles, being around incense in a dark room sets the stage for prayer, so to speak, you know, and the. The music in the church helps to become like sonic icons. They help to reinforce the teachings of the church, the history of the church, and also the living experience of Christ. And so communication is very important to that. Clear communication. And also communication in a way that is. Doesn't have people emotionally hunker down and shrug. People open up."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":2459.13,"end":2459.45,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":2459.45,"end":2463.41,"speaker":"Nicholas Reeves","text":"So they can let it come through them and ruminate on it."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":2463.41,"end":2565.75,"speaker":"Jonathan Pageau","text":"Yeah. And I think that's such a. I think it's such a great point because in Some ways, if you're trying to serve those purposes, it's not even just about being traditional for being traditional. Like, it's not about tradition for tradition's sake in some ways, because you're, your purpose is to bring people into a certain state of being, a certain direction of attention. Then you have to take that into consideration. And so if you, if you shock people with new melodies all the time, then you're done doing that because you're forcing them to pay attention. You see that? I mean, I see that in some of the churches that I grew up in, these Protestant churches where we actually used to have a pretty tight canon of hymns that we sang. And then ultimately at some point, people started introducing like new songs every two weeks. Like, they just kept introducing new songs to be, to be contemporary new. So what it meant is that you're constantly being shocked with like songs that are not that, that, that are you having to pay attention to way too much. Because in some ways you're like, oh, this is a new song and you're trying to figure it out and you're trying to follow the melody and you're trying to kind of see what's going on. And it's fascinating to realize what it does. Is that it. It then in some ways becomes almost an obstacle to, to worship. Right, but at the very same time, yeah, but at the same time, if you are just in some ways saying we just need to have tradition, just be traditional, then you're. Then ultimately you're going to be dying, like, because the breath is going to run out. You could say, like, you're just basically going through the. Going through the motions. I was, I was at, you know, the St. Andrew's Church in Riverside. Father Josiah's church."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":2565.75,"end":2566.19,"speaker":"Nicholas Reeves","text":"Yes."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":2566.27,"end":2614.85,"speaker":"Jonathan Pageau","text":"One of the things they're trying to do is to take. Because in America we basically have all these different liturgical traditions that are kind of coming together and competing and jossing and, you know, rubbing against each other. And they're trying to kind of integrate that into their services where they have both Byzantine chanting and the more four parts harmonies, the, the Russian tones. And they, they try to find ways to integrate them in a way that isn't jarring, that is actually kind of coherent. And it's, it's fascinating. I mean, I don't know how successful it is. I find sometimes it is very successful. I'm sure sometimes people find it a little surprising. But that's an interesting work that is in both, both innovative, but also really with a desire to kind of bring the Orthodox American experience together."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":2615.73,"end":2726.57,"speaker":"Nicholas Reeves","text":"Yes. And it is something that is probably more. If it's more natural, if it's more organic, it's probably going to last longer because it's not forced and it's not imposed. That's right. And you also see that people are throwing the baby out with the bathwater. Now, I know of that parish. I don't know what their music program is like, per se, but in general, the sounds that we have, there's a commonality, whether it is in Russian church music or it's in the Byzantine chant tradition. And that's the idea of stasis. It's a stain. So that's clearly shown in Byzantine chant. Within Isan, it creates a space of contemplation because you are focusing, you lose track of time. In a sense, the music has rhythm. It does, but you don't have the same understanding of harmonic development and harmonic shifts that are in correspondence with rhythm. There's the idea of this oneness of time where we don't know if it's begun or when it's ending. We are sort of in that presence. And you hear that too, with a lot of legato Kantilina, Russian choral singing, where everything's connected into this one sustained sound. And the Orthodox all have this aversion to moments of silence in the service. If you notice, right when something ends, something else is beginning. Always it's this constant dovetailing of sound, sound, sound, sound. The silence is kind of off putting for the Orthodox because it sounds like someone made a mistake, you know. But if you notice, everyone's always going through this relay of sound in the services. And so there's also this cooperative sustain in the services and the."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":2726.57,"end":2764.03,"speaker":"Jonathan Pageau","text":"Yeah, yeah, what you say. I realize that the moments where I found that the liturgy has been the most beautiful is exactly when it's doing what you're saying, when, you know, during the. Like, during the Amen, the priest has started, you know, the next part. And then there's this sense of, like this. Just this. These things, you know, moving into each other where there's no actual, actual cut. There's almost like this transition moment of two spaces, two spaces overlapping and then continuing into the. And that's really the moments where I'm the most kind of taken by the. By the music, when that happens during the liturgy."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":2764.51,"end":2813.78,"speaker":"Nicholas Reeves","text":"So there's an Amen that can occur right before the Cherubican, which is one of the most sustained parts of the service, because it's just this long amount of time you need practically to let the priests bring the gifts out and put them on the altar table. And so you hear their prayers being said underneath while the choir sings. And there's a historical development to this. It's not as if this was the original intention of the trubicim. However, regardless of that, you feel this suspension of time happen, especially at that moment. And a lot of the arrangements of the trubachim sound ethereal. They. Whether it's a Byzantine chant or whether it's Russian choral music, they sound out of time. Other moments like that, too, can be moments of the anaphora, the eucharistic canon."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":2814.9,"end":2815.46,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":2816.42,"end":2878.99,"speaker":"Nicholas Reeves","text":"After the elevation of the gifts. And there's another amen that happens after that. And you move into, you know, holy things over the holy. And you transition into another part of the service where we have the communion hymns. And it's this whole relay of meaning to meaning, logic to logic and piece to piece. Love to love. If you see in the services of loving Christ, loving each other with that distinction of Orthodox, especially, some traditions are very, very strict and formal in how they do things. But it's almost as if that helps to open you up to really think about and be loving. So you put aside all of your own preconceived notions about what that is, and you really focus on the church. Like water over a stone in a creek, Shaping you, forming you, forming you over and over and over again."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":2880.27,"end":2944.65,"speaker":"Jonathan Pageau","text":"Yeah, it's interesting because what you're saying. I realize, like, musically, like really just music, obviously there's. The meaning is part of it, but just. But musically, I. To me, the anaphora was always. Just that. Always the high point. Like, to me, it's always the high point. And it's the thing that I just get the most. And I'm just the most seized by. But then I was talking to my son and, you know, he. He. He was telling me. He said the true big hymn was the part where he loved that because it has this kind of soft. Like this really, really soft aspect to it. Whereas the anaphora is more like this. This. This. You know, everything is coming together. And it's like this. This. This crescendo in some ways, of the. Of the experience. But. But then I thought, wow, it's interesting. I realized, yeah, some. That people will have things that are closer to them in terms of their sensibilities, you know, even though it's a. It's. It all comes together, you know, obviously. But that's a wonder. That's. I. It's funny because I never Thought about it when you said it. I remind, remember my son, like, pointing out to me how. How this is like his favorite part of the liturgy."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":2945.37,"end":3028.72,"speaker":"Nicholas Reeves","text":"And they are moments that are meant to be highlighted. You know, the procession of the gifts during the trubic hymn and then the consecration of the gifts at the Anaphora. And there is an overt corporate call at the Anaphora. You know, let us lift up our hearts. We lift them up unto the Lord. And it's the direct address of the congregation with the clergy to pray directly to God and offer the gifts that are on the table, the altar. And so they're. They're very powerful moments, and they're moments that only really make sense when you are in the church. You know, these are the mysteries of the church, and they. They don't. The first parts of the service are usually didactic psalms, scripture, teachings of the church troparia. And then you switch after the gospel, and it becomes very particular to being in the church. I suppose that's why they dismissed catechumens in earlier eras of the church. This wasn't really for them at that point. It almost shows connections with Christianity. And, you know, I don't want to say a mystery cult, but, you know, these are the mysteries. These are the real particular facets of the. Of the church's experience that happened at those particular moments and that are hard saints, you know, eat my body, drink my blood. Hard sayings to follow. They don't make sense unless you're in the church."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":3029.68,"end":3092.11,"speaker":"Jonathan Pageau","text":"Yeah. I'm curious what you think about, because now we're talking about, like, this deeply participative aspect. I mean, in some ways, the liturgy is the. The highest version of how music participates in our life and how there's both, you know, this. This exchange between the altar and the choir, you know, that there's. We're all attending, we're all participating, we're moving. We ultimately move into it as we actually. It. It makes us eat. We actually eat the bread and the wine that is a result of this kind of musical coming together. One of the things that has fascinated me is how music has become performative in the past few centuries and the development of the concert hall and the idea of listening to music. Right. The idea that you just listen to music. And so I'd like to know what you think about that, what you think the role of these things are. You know, what do you think it's doing to our sense of what music is and what. What its function is in our society?"}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":3092.27,"end":3206.44,"speaker":"Nicholas Reeves","text":"You know, there's no clear cut point in the history of music where something happened and something didn't. There's always this fluid exchange, like in an ocean, these different currents. So, you know, for instance, if you take a look at 20th century America, early 20th century America, coming out of the Reconstruction era of the Civil War, a lot of that's the second Industrial Revolution. And a lot of Americans are trying to outdo the Europeans in everything. Architecture, civil institutions. And one of them is music. The Americans bring over fabulous musicians from Europe like Gustav Mahler and the his name is Escaping Me Dvorak, the Czech composer, to conduct at these orchestras here in the west and the Western hemisphere. And you have that kind of staid, almost respectability politics of wearing suits and dresses and pearls. And we have arrived, you know, we have come into this place of affluence and success as Americans. And we can do this too. We can produce European style concerts. And at the same time, after World War I, while you have that high society American ness outdoing the Europeans, you also have the birth of jazz that really takes hold of America post 1914. And it sends people into a tizzy, a frenzy. And you see the dancing that happens there. So if you look about, look at that. The chairs in a concert hall are literally screwed into the floor. You can't dance, you can't move them."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":3206.6,"end":3207.08,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":3207.64,"end":3208.44,"speaker":"Nicholas Reeves","text":"Sit down and listen."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":3208.44,"end":3209.48,"speaker":"Jonathan Pageau","text":"It's a simple point."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":3209.88,"end":3347.21,"speaker":"Nicholas Reeves","text":"And it's not just something particular to America. Obviously this is the European concert experience. And this is something that you saw was being challenged just naturally in American culture with high society people who would go to Harlem on the weekends dancing, who would be the same people who went to Carnegie hall for a concert of European style concert music. And you see that the two have been divorced. Go back a previous century. This is something that Richard Wagner was very keen on synthesizing. He talked about the synthesis of the arts. And he felt they were divorced. You know, why is there acting and singing and costume design and dancing? Why are they all separate? Why can't they be just one giant synthesis? And that's one of the aspects Wagner was trying to bring into his. His dramas. His musical dramas is what he called his operas, where it was a synthesis of everything that had been divorced in European culture coming together. Now people in the, in the hall in Bayreuth aren't dancing. Those chairs are screwed into the floor too. But sometimes you'll see an opera dancing on the stage and bringing back together of all these different time periods. Looking back at the Renaissance, how did the Renaissance appropriate an earlier era. Greek and Roman culture, the Greek culture of. And concepts of the chorus and of drama, of tragedy and comedy. How did people in the Renaissance appropriate something that they were separated by hundreds, thousands of years? And then you move forward 2, 300 years in European culture. How did the 19th century Europeans look at the Renaissance and then look at the Greco Roman culture? Always trying to get back to the communal public experience of art. And what does it mean in European culture? In the 19th century? There is no higher art form than opera. It is the pinnacle. You could say 20th century America. There's no higher art form than the movie. And look at movies. Sometimes all those things come together."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":3349.29,"end":3412.29,"speaker":"Jonathan Pageau","text":"So one of the things that I've been pointing to, and you can tell me what you think about this, is that if you think of Greek drama, you know, and the chorus and the Greek drama and everything, we always have to remember that the Greek dramas, at least at the outset, they were liturgical events, like they were events in. In honor of Dionysus, on the feast of Dionysus. And there was a kind of procession of the plays that ended with a. With a parody, like a comedy play. And so this is the sense that I've been wondering about, is that, like, when I think of Wagner and his Gesumskunstverecht, like this idea of the. Of the complete work of art, my intuition is to say that liturgy is the. Is the complete work of art. Because the one thing that's missing in. In the opera and in the movies is participation. You know, you. There is this separation of the public and the performer, and then. And therefore, you. You're. You're looking at something like a painting, and you're."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":3412.29,"end":3412.61,"speaker":"Nicholas Reeves","text":"You're."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":3412.61,"end":3423.37,"speaker":"Jonathan Pageau","text":"You're looking at it. But the liturgy is. Has everything. It has the music, it has the motion, it has the drama, it has all of that."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":3423.37,"end":3424.17,"speaker":"Nicholas Reeves","text":"It has the food."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":3424.17,"end":3428.69,"speaker":"Jonathan Pageau","text":"But it's your story. It also has the eating. Yeah. Which is not there in opera."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":3428.69,"end":3452.34,"speaker":"Nicholas Reeves","text":"The. The eating is very important. Well, I could tell you about 18 opera in the. In Italy in the 1700s. Oh, they would be eating during the performances. That's why you got the concept of throwing apple cores at people, because if they didn't like your aria, they would throw it at you. That's a different story. But that was sort of an impromptu, I'm gonna bring my own meal to the opera thing."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":3452.58,"end":3461.83,"speaker":"Jonathan Pageau","text":"But in terms, it wasn't part of the story. It wasn't part of the experience. It was like eating popcorn while you're watching a movie. It's not part of the movie. You're not engaging in the movie while you're eating popcorn."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":3462.06,"end":3562.2,"speaker":"Nicholas Reeves","text":"No, no. And so in the Christian context of the Eucharist, that food is all essential. And we come full circle. It's about culinary arts, it's about cooking, it's about ingredients, it's about having everything perfectly balanced, because that's probably one of the most communally binding aspects of human culture, is food. And so the liturgy does do that, and it does it not just with the Eucharist, but also does it with other types of food that could be off to the side, you know, different types of bread, raisin bread, whatnot. There's also memorial wheat, the so called Koliva, etc. And other types of food that are appropriate for certain occasions. But as you said, it's actually part of the intention. It is incorporated into the service itself. And that is the reason to gather. The reason to gather is because of the Eucharist. I mean, it's a meal. And I suppose in early Christianity, the ritual developed around the meal, whether it was the Passover meal or the meal, the love agape meal, efgeti together, remembering Christ every week. And it extends from that. And you see, of course, with the, the Coptic Orthodox, they have never divorced dance, they have never divorced rhythm, and they've never divorced singing, and they have never divorced eating from their liturgical experience. It's all there. Yeah, yeah, it's a complete experience."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":3562.2,"end":3565.56,"speaker":"Jonathan Pageau","text":"Yeah, we kind of lost. We have the dance device."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":3565.56,"end":3568.04,"speaker":"Nicholas Reeves","text":"I was just going to say. That's it. That's it."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":3568.12,"end":3576.52,"speaker":"Jonathan Pageau","text":"That's the only. Not a dance anymore. Just basically walking around the altar. But, you know, at least we can say that we have that little, little bit of a dance left in our liturgical world."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":3576.52,"end":3601.53,"speaker":"Nicholas Reeves","text":"Yeah. I looked online, I saw a wedding in Romania and they actually held handkerchiefs and did a line dance around the table. Oh, yeah, as you would do counterclockwise, but like a real Balkan dance around the table during the dance of Isaiah. But like you said, that that's it. That's it. I mean, in Eastern Orthodoxy, that's all we get."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":3602.65,"end":3667.78,"speaker":"Jonathan Pageau","text":"Yeah, you just get the marriage, the marriage dance, but that's it. One of the things, I mean, I'd like to hear your opinion on this. One of the things that I've been thinking about in terms of popular culture and how to make popular culture more participative right now is the notion of making it into celebration. The idea of writing anthems, for example, is something that nobody does anymore. Nobody writes anthems you know, but the idea of a celebratory art where you're. You're basically writing something in order to express its value to you and then kind of express our participation in it. You know, you still have. You still have experiences like that in games, like at sports games, people will use music in an anthem manner. But it seems like, let's say it seems like now would be a time, I think, for musicians to think about that, to think about this idea of the panegyric aspect of dance. It's like celebrate celebratory aspect that brings us together."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":3669.86,"end":3679.52,"speaker":"Nicholas Reeves","text":"Many musicians do. I mean, look at edm. EDM is all based around dance. I mean, when you go to the EDM concert, what do you see? You see the console, the DJ table?"}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":3680.88,"end":3687.6,"speaker":"Jonathan Pageau","text":"It's not. We don't dance together with edm, nobody. The people don't dance. People dance individually in a crowd."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":3687.6,"end":3688.24,"speaker":"Nicholas Reeves","text":"That's true."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":3690.08,"end":3721.39,"speaker":"Jonathan Pageau","text":"This sense of celebration, like, like this idea of, like I said, like an anthem where it brings you together and then you're, you're all paying attention to something together and you can see as you're doing it, like, I mean, like singing a national anthem. That's what happens when you sing national anthem. Obviously you can have anthems to all kinds of other things that are not your country, but it seems like that's something, I mean, that's one aspect that, that could help to heal our culture a little. Because now it's like everything's so fragmented."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":3724.19,"end":3783.17,"speaker":"Nicholas Reeves","text":"You know, they're there, right? I mean, the anthems already are there. They exist. And it almost feels, I don't want to say it feels sort of passe for people to sing the national anthem, although. Because when I'm at a sport event, when it's being sung, it's not as if people are being irreverent. Everyone's into it. You know, in terms of pop music. You know, you had the stadium rock in the 70s with all those big, big, big anthems. And that got the audience, you know, moving and grooving together. And you did have the Christian rock movement at the end of the 90s where they had a lot of."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":3783.17,"end":3799.96,"speaker":"Jonathan Pageau","text":"Yeah, they have got, they've got a little bit of that, like the kind of. Yeah, they do have a little bit, little bit of that anthem sense, you know, and then, and also they make the song simple and then people participate. It's kind of repetitive. You know, they have this, this way of doing it that gets people into it."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":3800.2,"end":3865.16,"speaker":"Nicholas Reeves","text":"Yeah. And even like Dave Matthews has talk about the late 90s, you know, aspects of Christianity, his music or the group creed, that was a group in the late 90s, very big on overt Christian themes. But, you know, that comes also from the contemporary Christian experience, where anthems are a huge part of that tradition, you know, and having people participate together at that moment in the black church. Certain hymns are certainly meant to be participatory, and there's different reasons for them. One is to get you engaged, and then the other is to have you reflect. And that's shown by the tempo and how the music is sung, the lyrics. And that's an experience where rhythm, motion, andic, that's the word you want to use. Participation all comes together. And that's an experience that has not divorced those either to this day."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":3865.16,"end":3879.29,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah, yeah. And so, Nicholas, I think we've been going for like about an hour, I would say. Can you tell people where to find your, your stuff? Like where, where, where can we find your compositions or where can we be? Where can we engage with you?"}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":3879.29,"end":3893.85,"speaker":"Nicholas Reeves","text":"Sure. Nicholas. Reevesmusic.com is my website and you can see the projects I'm currently working on right now, and they span the gamut, and I would love for you to take a look at them and I hope to see some of you at the events."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":3896.71,"end":3923.59,"speaker":"Jonathan Pageau","text":"So thanks. Yeah, thanks for taking the time. You know, I, I, I need to think about some of the things you said. You, you brought me on to paths that I had never been in terms of music. And so I'm still kind of, for me, music is really, when you said it's a mystery, like, for me, it is kind of a mystery because I, I, I, I've always, I don't understand it that well. I can obviously experience it, but, but I have to kind of continue my education. So thanks for the time."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":3923.99,"end":3929.11,"speaker":"Nicholas Reeves","text":"It's been a pleasure. Thank you for all of the interesting thoughts and the interaction. I appreciate it."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":3929.35,"end":3944.39,"speaker":"Jonathan Pageau","text":"If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase. So go to the symbolicworld.com and thank you for your support."}
{"episode_id":"SW - #397 - 2025-06-24 - Nicholas Reeves - What Is Music -","start":3945.11,"end":4006.2,"speaker":"Laura Diaz","text":"Tucson the weight is over Medi Weight Loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me, this isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication, but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better, and lose weight the right way, mediweightloss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com."}
