{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":0.16,"end":62.17,"speaker":"Laura Diaz","text":"Tucson, the weight is over Mediweight loss. They're officially open on North Oracle road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iHeartRadio. And you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks at mediweight loss. I got the same medication, but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com and the whole reason that."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":62.17,"end":117.59,"speaker":"Matthew Wilkinson","text":"I wanted to use that image was precisely because this piece for Bach, it's his longest organ work, it's his most mystical organ work, and it's the piece where he goes through all of the chorales that correspond to the essentials of what he perceived to be the Christian faith. So it's, it's his magnum opus for the organ. It's very like spiritual and catechetical. And precisely because of that, it's like, well, what image is going to correspond to that? Because this piece literally covers everything like the baptism, like the, the gloria. I mean it's Christ's birth, his death, his resurrection. It's like the whole life of the Christian. It's like all put into music for Bach. So the only fitting image would be an image that's also an all encompassing image that then also shows the fractal patterns of the music. Music of the spheres. Your image is perfect for that."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":128.95,"end":197.52,"speaker":"Jonathan Pageau","text":"This is Jonathan Pedro. Welcome to the symbolic. Hello everyone. I am here with my friend Matthew Wilkinson. For those who do not know, Matthew is the one who arranged and composed and put together the symbolic world opening. And so he, he got some people together and recorded the. The. The opening for us. He also did an outro for us which we. Which. Which kind of vanished with time. But he helped us out because at the outset we had these copyright issues with the. With the intro. So Matthew said, hey, don't worry, I've got it. But the reason why we're here today is because Matthew has a new album out. It is a. It is recording of Bach's organ works. And as you can see, there's a very interesting image on the COVID which is my image of everything that. That he used for the COVID So we've been friends for several years, and I thought it'd be a good opportunity to talk a little bit about the symbolism of music and especially in Bach. So, Matthew, thanks for coming."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":197.92,"end":199.2,"speaker":"Matthew Wilkinson","text":"Yeah, thank you for having me."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":199.44,"end":207.92,"speaker":"Jonathan Pageau","text":"And so tell us, first of all, let's start with this. Tell us a little bit about what this is. What. What's going on with the. With the album that you put out."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":208.16,"end":258.96,"speaker":"Matthew Wilkinson","text":"Sure. So the piece that I recorded is Bach's Klavier Ubyng 3. So if you don't know what a Klvr u bing is, roughly translates from the German as to keyboard practice. So there were several composers, for example, Bach's predecessor and Leipzig Johann Kunow, who would publish a work called the Kvir Ubun, meaning keyboard practice. And it would be a set of useful pieces that could be used for different reasons, perhaps liturgical or for entertainment, but those pieces would have a didactic function. So when people would get their copy of the Klever u Bing by practicing these pieces, it further helped build their technique and their understanding of music and most importantly, their understanding of improvisation."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":259.44,"end":260,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":260.48,"end":337.71,"speaker":"Matthew Wilkinson","text":"And probably partially because Bach himself wasn't a university graduate and wasn't a professor, unlike a lot of the other composers who had positions as prestigious as his, he took multiple opportunities in writing compositions to showcase really his breadth and artistry and to sort of make his statement on certain musical topics. So for this, the Klvr Uboung, the keyboard practice, he. He ended up publishing all four volumes of it. And even though he had a good relationship with a local publisher, they thought that the music was a little bit too difficult, so he ended up having to fund the whole project himself. Part one is Bach's six keyboard partitas. Part two is the Italian Concerto and the French Overture. Part three is the Organ Mass, as it's known. It's the one piece that's solely for organ. And then part four is the Goldberg Variations."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":338.11,"end":338.91,"speaker":"Jonathan Pageau","text":"Oh, okay."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":339.23,"end":366.72,"speaker":"Matthew Wilkinson","text":"And so four part. And so for part three, it's really like the exposition on what a chorale treatment is. And so a corral or a Lutheran Lutheran hymn, like a German Lutheran hymn, would often be played before the. Before everyone would start singing. So the organist would play out the tune, everyone would hear the tune, and then they'd kind of know how to sing it."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":366.72,"end":367.24,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":367.32,"end":403.4,"speaker":"Matthew Wilkinson","text":"And so there became this big tradition of taking a chorale melody and treating it in various ways. And so in this piece, Bach takes very specific, very influential chorales and treats them in all types of different ways. And in some sense, it's like his magnum opus on the chorale treatment. And the piece is extremely trinitarian. It kind of goes through all of the basics of the Lutheran faith, and there's a ton of symbolism all tied up into this work itself."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":404.15,"end":405.95,"speaker":"Jonathan Pageau","text":"Okay, so tell us a little bit."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":405.95,"end":407.31,"speaker":"Matthew Wilkinson","text":"And maybe we can dev a little more."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":407.31,"end":423.59,"speaker":"Jonathan Pageau","text":"I mean, tell us a bit about that, because I don't understand that completely. I have. You know, I. Music is not something I understand super well. And so how can it be trinitarian in. In it being musical? Like, what is it about the structures or how they set it up that makes it trinitarian?"}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":424.31,"end":433.92,"speaker":"Matthew Wilkinson","text":"Yeah. So this piece specifically, it's 27 movements long. So 27 matters, because what is 27?"}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":435.92,"end":437.28,"speaker":"Jonathan Pageau","text":"I know. What is 27?"}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":439.6,"end":442,"speaker":"Matthew Wilkinson","text":"It's three times three times three."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":442.32,"end":449.48,"speaker":"Jonathan Pageau","text":"Is it now? Oh, yeah, you're right. Yeah. Nine times three is 27. I was like, that's how."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":449.48,"end":449.84,"speaker":"Matthew Wilkinson","text":"That's how."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":449.84,"end":452.48,"speaker":"Jonathan Pageau","text":"I'm also not very mathematical. So."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":452.48,"end":452.68,"speaker":"Matthew Wilkinson","text":"Yeah."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":452.68,"end":454.88,"speaker":"Jonathan Pageau","text":"So three times three times three. All right."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":455.12,"end":527.59,"speaker":"Matthew Wilkinson","text":"And so the piece begins and ends in the key of E flat major and the key of E flat major. If you can read music, you'll know it has three flats. So, you know, I guess it could be an A major, but that would have probably not been great. That would have had, you know, three sharps. But it's an E flat major, so it has three flats. So there's a little bit of symbolism there. You immediately see three. And then the piece begins with a very famous prelude and ends with a very famous fugue. And both the prelude and the fugue are written in three sections. And so the beginning piece begins. It won't sound exactly the same on the piano, but I'll play a little, just so you can kind of hear. Begins with this sort of motif. And if you've ever heard that style, it's the style of a French overture."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":527.91,"end":528.55,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":529.19,"end":543.57,"speaker":"Matthew Wilkinson","text":"So the French overture is what they would play when the king came in. So if you were at. If you were listening to an opera up in the theater and they start playing a French overture, it's a signal that the king is coming in."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":543.57,"end":543.97,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":543.97,"end":582.18,"speaker":"Matthew Wilkinson","text":"So immediately you see, oh, this is, you know, Representing God the King. Then the whole second section of the prelude, he goes, which is actually not very contrapuntal. It's actually more in the gallant style, which is the style of CPE Bach. Bach Son. So it's the style of the son."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":583.54,"end":584.18,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":585.94,"end":625,"speaker":"Matthew Wilkinson","text":"Okay. Then he gets to the third section, and the third theme is. It's this long, flowing, rapid movement. So it seems as though it's either dancing or flying like the dove. Holy Spirit. You know, some of these things are kind of on the nose, but, you know, you can see it."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":625,"end":625.52,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":626.24,"end":947.18,"speaker":"Matthew Wilkinson","text":"It's for sure there. And he for sure thought about these things as he. As he was creating it. And then the same thing happens when you get to the fugue. You know, the fugue is called the St. Anne Fugue because the melody resembles oh God, our Help in ages past, which is the Hymn tune called St. Anne. And the first style is an older style, okay. That's called the Stila Antico. So it's the style of Palestrina. And then he gets into a little bit of a more modern style at the end. Not the end, but the second portion. So the second portion is otherwise known as a Spielfuge, which is a little bit more of a baroque style or modern style. It. And then the third section is a jig fugue, so three distinct sections. The third section, more dancing. Jig fugue definitely is something that he uses to portray the Holy Spirit. They're all in slightly different times. The first is in cut time, and the second is in 6, 4, and the last is in 12, 8. That's less. Less relevant, if you don't understand what that means, other than to know that they're probably proportional to each other. And there is a way in which each section of the fugue relates to the other section. And then he brings back all three subjects into the whole piece itself. So it's like one cohesive unit. There's a good argument that the E flat fugue is perhaps the greatest fugue that Bach ever wrote, and that it sort of takes the instrumental fugue and the vocal fugue and combines them together in this masterpiece. And so the whole. The whole kavir u bing 3 the whole organ mass is bookended by this prelude in E flat in three sections, this fugue in E flat in three sections which show different styles. And then the inner movements follow the different German chorales. So there's a Kyrie cristekirie. And he writes one setting for manuals only. Then he writes another setting that incorporates the whole organ. Then he has the German. Which is the German gloria. So there's three different German glorias, you know, Holy, Holy, Holy, Glory to God in the highest and on peace. And, you know, there's some great. Like, if you listen to the recording, you can tell there's some interesting. You can tell he's text painting. Interesting symbolism. So, like the fugetta on Allein gotten the hei. Er. Sort of sounds like angels in a way. And he actually writes stacado markings, which more or less mean that the hierarchy of values that you superimpose upon regular articulation you temporarily suspend when there are dots. So it's as though all of these angels are equal in these relatively jagged movements up and down, surrounding each other. And it's played super up high. And so you kind of hear the angel singing. And then he has two versions of the. These are the Ten Commandments, Die sindi heiligen Sengibot, two versions of the Creed Verglauben allen einen Gott, two versions of the Fata Unsa, the Lord's Prayer. Then he takes three distinct Lutheran hymns. He takes the Jesus Christus unsehirzumjordenkam, which is Jesus coming to the Jordan. And important because it's one of the sacraments, especially for the Lutherans, it's the baptism. And then he has this. Aus tifernot srei ist sudir, which is the German translation of Psalm 130, which was used as a confession. And he has this crazy movement called Jesus Christus unse heilen der von unden zorn gottes vahn, which is Christ who saves us from the wrath of God. So, you know, maybe scandalous to the. To the Orthodox and penal substitution and all of that, but a great movement nonetheless, you know."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":947.18,"end":948.78,"speaker":"Jonathan Pageau","text":"All right, so help us."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":948.78,"end":950.82,"speaker":"Matthew Wilkinson","text":"Help us so all throughout this, you."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":950.82,"end":1034.31,"speaker":"Jonathan Pageau","text":"Know, help us think through this, like. And so, like I said, so it seems like sometimes the meaning of the piece or the. The thing is hinting at is in the structure itself. So there are a few times where you say, you know, here are the. The types of sonorities that are happening. It's high up in the register. These sounds are kind of turning around each other. And so you get this sense of, you know, like singing high, singing angels that are dancing maybe, or that are kind of turning. And so I see that. All right, okay. I don't know if I completely hear it. I mean, I imagine it's also. You have to train yourself to start to hear this. But then there's some of the. Some of the Symbolism, which is actually extra musical. So, for example, you say he's referencing the style of his own son. And so, you know, that's not in the. In the music itself. And so now the trinitarian relationship is not. Or this. You know, the. The illusion in the. Is not in the structure of the music, but in its. How it's. How it's contained in the world or how it references other layers of meaning together. And so do you think. You think he was kind of going through all of these different types or trying to allude in different ways to. To. To meaning in those? It's hard for me to. To think that way because it looks a little disjointed to me."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":1035.03,"end":1059.02,"speaker":"Matthew Wilkinson","text":"Well, some of it is, you know, context in the sense of if you lived in the time of Bach, you'd kind of catch some of the jokes, you know, or, you know, catch some of the illusions. In the same way, if you read a T.S. eliot poem. Well, I'm not sure he was ever understood just reading a T.S. eliot poem, but, you know. Yeah, yeah, you have to have all the commentary there."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":1059.5,"end":1086.89,"speaker":"Jonathan Pageau","text":"The fact that if you. If you watch. You know, if you watch, I don't know, even, like, a modern movie or something where someone is making. Is referencing a Tarantino movie, then you'll know. Like, you just know that that's what's happening. And it can be happening in all kinds of ways just because you have that social connection, whereas we've lost some of these. There's these capacities, let's say, or we don't know these traditions. And so it can look a little arbitrary to us."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":1087.37,"end":1093.69,"speaker":"Matthew Wilkinson","text":"Sure. Like, if you watch, you know, interstellar, you can. You can definitely see. Oh, that's 2001 A Space Odyssey."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":1093.77,"end":1098.25,"speaker":"Jonathan Pageau","text":"Yeah. It's a reference to throwing an illusion to Kubrick."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":1098.33,"end":1098.89,"speaker":"Matthew Wilkinson","text":"Mm."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":1099.69,"end":1100.29,"speaker":"Jonathan Pageau","text":"Yeah. Right."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":1100.29,"end":1137.02,"speaker":"Matthew Wilkinson","text":"And I think so. There's. There's some of that, for sure. Like, there are definitely things that it's helpful to kind of know the context behind where, like, oh, this style is more gallant. This style is more palestrina. But if you lived in the 1700s and you went to church every week and in between the scripture readings, they were only singing Renaissance motets, then it would be easier to catch on to the fact of, oh, this style of counterpoint is a Renaissance motet. Whereas, you know, now you go to church and you're not necessarily listening to Renaissance motets, so you might not catch the same illusion. But I. Yeah."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":1137.02,"end":1137.98,"speaker":"Jonathan Pageau","text":"And also, we don't."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":1137.98,"end":1139.34,"speaker":"Matthew Wilkinson","text":"I think, the music itself."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":1139.5,"end":1174.87,"speaker":"Jonathan Pageau","text":"Yeah, I was Gonna say we don't. I think we've lost musical literacy. You know, quite, quite a few of us, we don't have those, you know, we have these illusions visually. We can recognize visual illusions and we can recognize, you know, meaning illusions, you know, but we don't have that musical language anymore. Right. Where we can, we can listen to a music, let's say a symphony or a fugue or something and we can say, oh, he's referencing something and now, you know, he's commenting on something. But only through musical means."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":1175.67,"end":1275.99,"speaker":"Matthew Wilkinson","text":"Sure. I think with Bach especially, but you know, also with older. I mean, with later classical compositions, some of the differences. It's not only illusion, it's like the vocabulary and the makeup makes it so that it's. There's always something to bite into. You know, sort of like the same with a really good movie. It's like if you knew interstellar, you wouldn't have to know that it's making an allusion to 2001 A Space Odyssey to get it. In the same way, if you listen to the Prelude and fugue in E flat, it's just, it's super majestic at the beginning. It's exciting and you might not need to know all of the illusions to catch it. And probably because of the vocabulary that Bach uses, there is something that feels sacred about it. It's just natural to writing in this sort of contrapuntal style and specifically Bach style, who. You know, almost everything Bach wrote was for the church. The majority of his composition compositions were made of. They were really cantatas of which we've lost a significant portion of them. But he had cantatas for basically every Sunday of a multi year liturgical cycle. And so almost everything he wrote was with scripture in mind. So it totally transforms his musical vocabulary. And I think there's something about like baroque music itself maybe, maybe more so than later music which contains this music of the spheres, if you will."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":1276.71,"end":1338.2,"speaker":"Jonathan Pageau","text":"Yeah. And why, like, what is it? Because I feel that like when I listen to Bach, I like listening to the fugues particularly. And there's something right. I mean, for sure there's something right. There's something of a hero's journey in the structure of the music that I can follow that I can kind of attend to. There is this, you know, you can. You get this sense of an order, like a statement, something that is clear and then you can see there's a play. There's like breathing in and out and it kind of goes away and comes back and is. And then finally it starts to reappear and then you kind of see it clearly again and it, it makes you kind of. So you have this. This sense of adventure and longing even and of remembering and then finally this coming back. And so for me, those types of structures are kind of easy to see how, why they are. They have that sense of the sacred in them. Like when you hear them, you feel like you're being carried in a special way."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":1338.68,"end":1382.02,"speaker":"Annie Crawford","text":"Hello everyone. This is Annie Crawford inviting you to join me this January for a symbolic world reading of Til we have faces, the book C.S. lewis calls for far and away the best I've written. Till we have Faces is Lewis's modern retelling of the myth of Cupid and Psyche, a mysterious tale of dark idolatry, classical enlightenment and the shocking discovery of true religious vision. In our four week online course together, we'll explore what CS Lewis has to show us about the nature of myth, the dangers of love, the limits of reason, and the secrets of genuine re enchantment. This is a book, an author and a class you won't want to miss."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":1384.02,"end":1445.09,"speaker":"Laura Diaz","text":"Tucson, the weight is over. Medi Weight Loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication, but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better, and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":1447.97,"end":1454.61,"speaker":"Jonathan Pageau","text":"And so tell us a bit about why contrapuntal music has that effect. What is it? What's happening to us?"}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":1455.41,"end":1479.1,"speaker":"Matthew Wilkinson","text":"Yeah, I think so. Let's take for example this fugue. It's a good example. The E flat fugue. Maybe just the first section. So a lot of what there is to digest in a fugue is you have a subject. And a lot of the difficulty in composing a fugue is composing a really good subject. Then you need a counter subject, so something that corresponds to it."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":1479.18,"end":1486.7,"speaker":"Jonathan Pageau","text":"So, alright, so give us the two in the fugue. Help us hear this like. So what is the subject in this fugue?"}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":1487.02,"end":1575.47,"speaker":"Matthew Wilkinson","text":"Sure. So in the first subject in the E flat fugue is. So that's it, that's the first subject in the fugue. Now then it repeats. So you could say that was in the tenor. Then it goes. But when it repeats, you have a counter subject on top of it. So I'll play both. So first the subject, now subject again with counter subject. So the is the counter subject and you'll hear both of those come back in different places. Okay, I'll point out real quickly that when the second subject comes in right here, the notes are E flat, D and G. And in German E flat is called S, like you would say that's sdg. And he sang Solo DEI Gloria right there."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":1575.47,"end":1575.87,"speaker":"Jonathan Pageau","text":"What?"}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":1577.55,"end":1588.83,"speaker":"Matthew Wilkinson","text":"Yeah, he signs everything with sola de Gloria. Glory be to God alone. And he's literally putting it in music right there. So at the very beginning of this fugue, he puts sola de God."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":1588.83,"end":1589.27,"speaker":"Jonathan Pageau","text":"That's amazing."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":1589.27,"end":1627.75,"speaker":"Matthew Wilkinson","text":"Right there at the beginning. Sometimes he signs his name too, because in German B flat is B or B and B natural is ha or H. And so every now and then, if you, you know, if you want to nerd out on this type of thing, you can search his music and you'll find. And that's his name. B, A, C, H. That's hilarious. So sometimes that's. Sometimes it's totally in the music and sometimes it's a very specific, specific interesting points in the music. Maybe where the golden mean is. For example, you know, he plays all these kind of crazy jokes."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":1628.55,"end":1634.87,"speaker":"Jonathan Pageau","text":"Okay, so. And what's important is that the subject is one hand and the counter subject is the other hand, right?"}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":1635.27,"end":1637.99,"speaker":"Matthew Wilkinson","text":"Not necessarily. It's just another voice. That's the way to think of it."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":1637.99,"end":1640.95,"speaker":"Jonathan Pageau","text":"Okay, so it's two voices because I mean, you could."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":1641.11,"end":1691.45,"speaker":"Matthew Wilkinson","text":"You could have a six part fugue in which, you know everything is playing something. And you might have two subjects and a counter subject in one hand, and then a counter subject in another hand. And. Okay, I mean, it can get very complicated. The. If you listen to the movement Aus Tiefernot on the cd, it's six parts. And so it's a six part fugue. And the pedal has two different parts at some times. And it's great on that organ because the. The winding is not. Is super old, and it's great to pull basically every stop on the organ. So the wind is struggling, and so it's as though. As though the organ is sobbing itself, you know, deep distress. I cry to you. Have mercy on me."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":1692.73,"end":1698.81,"speaker":"Jonathan Pageau","text":"The organ's out of breath and it's like, have mercy on me, Lord. That's amazing. Yeah. Actually, before you. Before you. Yeah."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":1698.81,"end":1700.33,"speaker":"Matthew Wilkinson","text":"And I think he knew it would be like that."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":1700.66,"end":1711.78,"speaker":"Jonathan Pageau","text":"Oh, yeah. So before you continue with these subject encounter, tell people about the organ, because we didn't mention it. The organ that you're recording that you were able to play this on."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":1712.1,"end":1789.08,"speaker":"Matthew Wilkinson","text":"Yeah. So the organ I played on is the Trost organ in Waltershausen. So one thing I did when I went to do my masters in Germany is I tried to play at least one or two of every organ builder who played Bach knew. And so the Schnickers, the Zilbermanns, the Trost, you know, So I tried to play at least one or two of each of those organs. So I really knew the. The sound that Bach had. And we know that Bach loved the organ builder Gottfried Trost because he dedicated another Trost organ in a nearby village in the Altenburg Schlosskirche. And when he was there, he did a couple things. One is he pulled a bunch of stops together to use as a solo stop. And evidently that caused a little bit of a ruckus because people were like, oh, you're not supposed to pull those together. And another thing that he did was he did a chorale or a hymn, and he kept transposing up on each verse. You know, something else organ players do every now and then that some people say, oh, that's cheesy. You shouldn't do that. But Bach did it. So if the master did it, you know, it's totally fine."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":1789.24,"end":1811.66,"speaker":"Jonathan Pageau","text":"Create that effect. We know what that effect feels like in a. In some time. I remember when I was younger. Yeah, you would. You would get that. You know what they're trying to do. You know what they're trying to do. All right, so. So basically, this organ was an organ. Not the exact organ, but an organization. The type of organ that Bach himself would have played on. If I understand correctly, Bach probably played."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":1811.66,"end":1858.37,"speaker":"Matthew Wilkinson","text":"This organ, so this organ. There's no technical record of him playing it, but he was in the area, passing by, and the same builder built another organ in a nearby village, and he's for sure associated with that organ. So Bach probably played this organ. It's a thuringian organ. So it's a little different than a lot of organs that Bach typically gets recorded on. So there's a lot of, you know, really niche, unique features about it, like the, like the way the mixture stops are slightly different. I mean, if you just listen to it and listen to other recordings of the same piece, then you'll be able to hear, oh, this is a really special organ. And this organ has lots of different color stops. So lots of eight foot stops, lots of. Of mutation stops."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":1858.37,"end":1866.97,"speaker":"Jonathan Pageau","text":"I have no idea. I don't know what any of that means, Matthew, but it's okay. I'll pretend like I do. I'll be like, yeah, all this stops. So the color stops."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":1868.09,"end":1868.57,"speaker":"Matthew Wilkinson","text":"Yeah."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":1869.77,"end":1871.33,"speaker":"Jonathan Pageau","text":"It's cool to think that in comparison."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":1871.33,"end":1878.65,"speaker":"Matthew Wilkinson","text":"To organs, there's a lot of different. A lot of different timbres on this organ. Okay, does that make sense?"}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":1878.97,"end":1879.85,"speaker":"Jonathan Pageau","text":"I know that more."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":1880.01,"end":1881.13,"speaker":"Matthew Wilkinson","text":"It's a wider color."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":1882.42,"end":1883.5,"speaker":"Jonathan Pageau","text":"All right. White color palette."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":1883.5,"end":1883.78,"speaker":"Matthew Wilkinson","text":"All right."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":1883.78,"end":1894.58,"speaker":"Jonathan Pageau","text":"All right, cool, cool. All right, so bring us back to the. Bring us back to the. To. To how this works. Like how the. The subject, encounter subject play with each other. How they, how they. They. They come together."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":1896.42,"end":2057.13,"speaker":"Matthew Wilkinson","text":"Sure. So, like, maybe we'll go through some. Some of this fugue just so you can kind of see like where the entrances are. We have the subject, then another entrance. This is faster than it goes, by the way. Then you have what's called episodic material to take it to the next entrance, then another entrance, then another entrance, then more episodic material to take it to the next entrance and in the bass. So a lot of what's great about a fugue is it gives you something that you can grasp onto. Like, this is the repetition of the same thing. Sort of like seeing patterns fractally. It's like, oh, that's the same pattern. Now it's here, now it's there. Then often in a fugue, it will go to a different place. So if everything is around E flat, it's centered right here. Then it'll often go to the five. So it'll start playing in that key. Or maybe the four, it'll start playing in the key of A flat. So where home is, where the pitch number one, you know, where the tonic is, where home is, will slightly shift and then it always comes back home towards the end, at the end. So, I mean, that happens in every fugue. Every fugue start has a subject as a counter subject. It has episodic material, and it takes a journey to a place where home is a different key. Sometimes two or three times. And then it always makes a return home. And it almost always begins with one voice and then it ends with, you know, beautiful, beautiful harmony all together. And so it takes all the different voices and it reconciles them and then it makes sense of the whole journey. So it really is sort of this sense of like progression and return."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":2058.65,"end":2097.65,"speaker":"Jonathan Pageau","text":"Mm, yeah. This process, like procession and return. Yeah, it's a maximus, it's. And so it has that neoplatonic idea in it, you know, And I mean, I can hear it. I know, because I. Like I said, I. I don't totally understand it, but when I listen especially to fugues, I, I get this very deep sense of, of satisfaction, you know, And I don't completely. I don't completely understand it, but what you're explaining makes makes sense. But then you said some. Sometimes there are. There can be many subjects and so would this. Then would you bring them all together in the end as well, or would you go back to the first one? What's the. How does it usually play out?"}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":2099.33,"end":2212.86,"speaker":"Matthew Wilkinson","text":"Well, so like with, with Bach, you know, there's. There's always variations on the, you know, on what's typical. But typically with a fugue, you have at least an entrance in each voice. So if it's a four voice fugue, there'll be four entrances of the fugue. And then it's typical that you go to two other keys and then you return home and then there's what's called stretto. And stretto is where you'll have the. Rather than. Oh, here's the subject. And now it's in another voice. They kind of layer on top of each other and they create this, you know, magnificent effect. Even though it's in the middle, you can hear a little bit of the effect of Stretto right here in the middle, middle of this first movement. So here. So there's a little mini Stretto where you had three subjects all coming in, all on top of each other. Generally a lot of the times at the end of a fugue, you'll have that. So now they're all coming in more rapid succession. Then maybe there's some extra credential stuff, some. Some fluff at the end. But generally you have a stretto at some point and usually towards the end of the fugue, you know, so that's another integral part of a baroque fugue. So. And there's like an implicit hierarchy there. You know, there's like the. There's the hierarchy of what the key is. So like you set a key, you come back to the same key after going somewhere else. You know, the. The voices, they have, like this interplay with each other. But I don't know, does. Does all of that make sense?"}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":2214.54,"end":2249.26,"speaker":"Jonathan Pageau","text":"No, I mean, it makes. It makes sense. It's, you know, it's. It's. Obviously, it's interesting, especially when you play it and we can kind of hear it happen. Happen together. And so this seems to be something very particular to the Baroque itself. You know, is. Was there some. How can I say this? Was there something before the Baroque that had similar structures or that used similar patterns of these, I guess, subjects that would play with counter subjects and resolve? Like, is that something that was completely new with the Baroque?"}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":2250.94,"end":2318.02,"speaker":"Matthew Wilkinson","text":"What the Baroque did, is it sort of solidified what the rules for imitation were? So if you go back to the earliest of instrumental music, you'll have what's called imitation or canonic imitation. So you create something, but it wasn't solidified. Like, you had to go to this key and then this key and then come back home, and you had to have this many iterations of a subject. I mean, all the rules that ended up becoming something solidified that make what we kind of know as a fugue weren't in place. But you still had canonic imitation from very early 1500s. So the idea of imitation, you create a little melody and then it repeats in another voice, or even in the same voice in a different way. That's been integral to Western classical music basically from its inception. And the idea of encounter point, too. I mean, from. From the very beginning, it's, oh, what note sounds best with this note? And how do we put them together?"}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":2319.54,"end":2325.38,"speaker":"Jonathan Pageau","text":"And so what is that? Explain that. What is counterpoint? What do we mean when you use that word? What are we referring to?"}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":2327.46,"end":2358.2,"speaker":"Matthew Wilkinson","text":"Yeah, counterpoint is just. You have one line. It's the line that accompanies that line. It's the harmony that goes with it. Maybe anachronistic to use the word harmony, but it's another line that goes with it. So, I mean, the counter subject is counterpoint to the line. So that upper line is counterpoint. Does that make sense?"}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":2358.2,"end":2391.37,"speaker":"Jonathan Pageau","text":"Yeah, no, it. I mean, it does make sense. I can. I can. I can kind of hear it. And so I'm interested. I mean, I'm kind of interested in the question of the. Of duality and how this use of duality in music, you know, maybe talk a little bit about. About that and the idea of the. The, in some ways, the resolving. Ultimately, I think in the end of the. Of the dualities. Do you. I mean, have some of the musical theorists or even the. The. The musicians themselves thought about in that term."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":2393.94,"end":2395.38,"speaker":"Matthew Wilkinson","text":"In the term of duality?"}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":2396.34,"end":2431.91,"speaker":"Jonathan Pageau","text":"Well, you know, I mean, when we talk about the idea of something like, you know, heaven and earth, or the notion of identity and its reflection or identity and its opposite, or, you know, I mean, obviously good and evil, all of these things, it doesn't have to necessarily be good and evil, but it's just this idea that the world plays itself, you know, between something like open and close, between these. These dualities that we experience. If that is something that. I don't know if that seems to be explicitly part of the music or this music particularly."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":2433.75,"end":2543.3,"speaker":"Matthew Wilkinson","text":"Yeah, I mean, you're making me think of just straight up consonants and dissonance. You know, the rules kind of shift back and forth in what consonants are allowed and what dissonances are allowed in composition or what were typically done. But sort of the. I mean, a lot of what a fugue is, is it's taking the notes that don't work and then it's reconciling them to, you know, its own pattern of being. You're also making me think, just thinking of duality in the Baroque and even before. There seems to be a complex structure to the music where you have multiple lines that are all working in harmony. So it's the reiteration of patterns all throughout. And then when you get to what is maybe the reaction to the Baroque, what comes immediately after then? Even though you can still have multiple lines, it's not like you don't have multiple lines all going. You don't have counterpoint. In the same way, it's as though the. The sense of the music becomes more strictly melody and harmony. You can think Mozart, Haydn. And so it's almost like there's like a dichotomy there. It's like, ah, here's heaven, here's earth. Rather than like the whole cosmos and its interplay. It's almost like separating the mediators. Oh, I don't. I don't need you to pray for me. I don't need Mary to pray for me. It's just me and God. You know, this sort of. It's really like a flattening of the hierarchy. I really think. I really think that is. And that's part of what makes. Part of what makes the aesthetic. Because you. You really go from this. What the ancients were really trying to portray was the music of the spheres. Maybe I could talk about that for just a second."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":2543.54,"end":2543.94,"speaker":"Jonathan Pageau","text":"Sure."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":2544.74,"end":2552.8,"speaker":"Matthew Wilkinson","text":"See what they were getting at. So do you know the concept of pitch is rhythm or rhythm is pitch?"}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":2555.76,"end":2556.56,"speaker":"Jonathan Pageau","text":"Please explain."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":2557.52,"end":2754.19,"speaker":"Matthew Wilkinson","text":"Yeah, so if you take, if you take any interval, you can slow it down until it becomes a rhythm. So you can take those two notes, that interval is called a fifth. And if you were to slow that interval down, I believe this is three against two, then you eventually get the rhythm because it's just this many hertz over this many hertz. So at a certain portion, it's that ratio. It's the ratio of three to two. And so you could take the ratio of four to three. That's either a third or a seventh, I believe. And so, but every interval at some point becomes a rhythm and that rhythm is a ratio. So you can think of the ratio as either a rhythm or really as an interval of pitches. And so even Kepler, he viewed the different orbits of the planets around the sun. And even this was like a heliocentric model, but he was still seeing like at its apogee, what is its relation to Earth? Oh, this orbit can be compared to this orbit is the ratio of 3 to 2. This orbit to this orbit is the ratio of 5 to 4. And so he could actually construct from those patterns legitimate musical intervals. So it wasn't. So the music of the spheres, I mean, it has sort of. It's like incarnation of sorts in music itself. And we know that there are tones that are produced by each planet. For example, like there, there is a rumbling. So, you know, it is a certain frequency. And so that frequency ratio to another frequency would produce both a rhythm and a pitch. And, you know, this is part of Boethius, the music of the spheres. But it's also super influential even all the way up to the Baroque. And it's also influential even in organ construction. So they were trying to look at the same patterns, three to two, five to four. And they would build the facades of the organs, the front line of pipes, around that same interval. So that then the organ, which would be way up in a loft, often with a route positive, or pipes behind the person. So if you were down with the congregation looking up, you might not even see that there was a person up there playing. But instead you would just hear music coming down. Specifically, specifically air coming through pipes sometimes which had faces on them and it coming down. And it was an iteration of the music of the spheres. So they were pretty explicit that this was supposed to recapitulate, in a sense, like the divine harmony of all things. And I think when you start getting into The Renaissance and this, like, radical, you know, human skepticism and all of this. Then you start to lose the fact that, oh, we're not actually trying to re. You know, re. And not to incarnate the music of the spheres. Rather, this is, you know, just for entertainment or joy or. Or to provoke the passions or something."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":2754.27,"end":2755.95,"speaker":"Jonathan Pageau","text":"Pleasure. Yeah, just pleasure."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":2756.51,"end":2816.92,"speaker":"Matthew Wilkinson","text":"And even in the articulation, like the performance practice for the Germans, this was not always the case like in America, but it's a thing I learned when I went to Germany. They viewed different beats as being stronger or higher up than other beats. So they had good beats and bad beats. So if you take like, a measure of four beats. Four beats in a measure. Well, beat one is the strongest. Beat three is the second strongest, but not as strong as beat one. Beats two and four are sort of tertiary. And that's also shown in how they articulate. It's shown in. So that you would actually give long. A little bit of a longer duration to the first beat and then a little bit of a less duration to the second, a little bit more to the third, but not as much as to the first, and then again less. And so maybe I can just kind of show what I'm. What I'm talking about."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":2818.12,"end":2828.68,"speaker":"Jonathan Pageau","text":"Makes me think of James Brown. James Brown and his first beat, like, was all about the first beat. He'd always kind of come back. He would call it, like, right, all right, go for it."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":2830.12,"end":2883.52,"speaker":"Matthew Wilkinson","text":"So, for example, there's a little bit more of a lilt there than if you just played verses. Does that make sense? Can you hear a little bit of the difference?"}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":2884.4,"end":2904.49,"speaker":"Jonathan Pageau","text":"You're intimating that within the very structure of the. The beats, that there's a hierarchy, a mini hierarchy in it there. And that plays itself out at different levels, like at the very. The smallest level. And then in the very concept of the. Of the. The structure itself, right?"}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":2904.49,"end":2957.23,"speaker":"Matthew Wilkinson","text":"And then everywhere that there's even, like, a cadence where, like, it temporarily. It does that. Not every. That's called a cadence, you know, where you. You go from this feeling to back home, you know, and you'll have, I don't know what, 10, 20 of those in a piece, you know, because you'll be cadencing to a different point or whatever. Each cadence is not the same either. So you articulate each of those in a slightly different way to show that there's this ultimate hierarchy. So there's a hierarchy of credential points, there's a hierarchy of beats. There's a hierarchy of the pitches themselves. So the whole thing is Intrinsically hierarchical because it's also reinstantiating the, the music of the spheres."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":2959.23,"end":2996.5,"speaker":"Jonathan Pageau","text":"Well, one of the things I grew up, you know, because I'm also Canadian, I grew up listening to Glenn Gould playing Bach, right? And he tended to play things very, almost like a machine. Like it was just straight. And he also tended to make the, the, the, the counter melody or whatever, the counterpoint, like equal to the melody. So everything was just kind of equal. I remember really liking Glenn Gould. But you seem to also, you seem to suggest that at least originally there was this sense of hierarchy all through the piece. Like this understanding of the, the relationship between the different parts as being always in terms of hierarchy."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":2997.45,"end":3081.31,"speaker":"Matthew Wilkinson","text":"Yeah, Glenn Gould is, Glenn Gould is interesting. You know, most real, like baroque purists pretty much hate Glenn Gould. Don't have a. I don't hate Glyn Gould. Yeah, he's a modernist. I don't hate Glenn Gould. It's a little bit of a testament to the Bach, to the genius of Bach, that it almost doesn't matter what you do with it, it still sounds good because it's Bach, you know. And with Glenn Gould, you know, he did a bunch of crazy stuff with it, but he could play ferociously clean and with tremendous excitement. And this, you know, I hear him doing these, you know, trills in the, in the left hand while everything else is going on. It's astounding the amount of control that he had. And he had some like, you know, interesting ideas when it came to Bach. So I'm not totally an anti Glenn Gould person. I don't totally hate everything Glenn Gould did. It's fascinating to listen to his Goldberg Variations from the beginning of his career versus the end of his career because it's, it's almost a super extroverted version compared to super introverted version. But it's. But I don't think anyone would argue that that's the performance practice the way that Glenn Gould did, did Bach. It's like not the way that Bach would have been originally performed there."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":3081.31,"end":3184.32,"speaker":"Jonathan Pageau","text":"Seems to me like. So one of the things that happened in the 20th century is the idea of the dialectic, you know, and, you know, Theodore Adorno and his notion of the, the kind of infant, this infinite dialectic, this idea that in some ways the dialectic has to be true opposites that just are fighting each other, right? That are combating each other. Whereas in the traditional vision of opposites, there is this sense of hierarchy, right? So there's a sense in which, in the opposite, heaven and earth have different Roles and heaven is the center and earth is the. Is the periphery, right? And we have the same image of masculine and feminine. You know, the man is the head, the woman is the body. And so the sense that in duality there is hierarchy, right? And it's. It's never a strict opposite, right? We say that God. That Christ has two natures, but that his human nature submits to the divine nature. We don't have the sense of true opposite, you know, in the. In the positive sense, which seems to definitely be a modern phenomena, like this sense of the opposition. We see it even today, like a lot of the remainders of Adorno's thought are there today, where we have this sense that in some ways the margin is a force that is as tremendous and as is equal to the center, to the identity. And so when we have them pitted against each other. Whereas what you seem to be intimating in your vision, even of the. Of the point and counterpoint, is that there's a natural hierarchy in the point and the counterpoint. There's a way in which the subject is the subject and the counter subject is like an echo or a helper to the subject. I don't know if I'm totally off here, but that's my sense of what you're saying."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":3187.04,"end":3286.77,"speaker":"Matthew Wilkinson","text":"You know, it's interesting, now that I'm thinking about it, what you're saying, it kind of drives home to me, like in fugue. It's not as though. It's not this dictatorial sort of hierarchy. Like there is a sense where there's perfect harmony between every voice. And so one voice isn't lording anything over another voice. And I get what you're saying, especially with the idea of heaven and earth, of masculine and feminine, not to bring up a super controversial topic within, you know, I'm Anglican, and within Anglicanism, there's a tremendous debate about women's orders. And there's this book written by this guy who's just lambasting the. Any. Anyone who would dare to call into question women's orders. And he does. He does so through calling into all of these patristic quotes about women being below men. I haven't read the whole book, you know, and I really should go back and hey, maybe Chrysostom said something sexist. I don't know. But I can just imagine if the quotes are, well, this is about, you know, the woman is below the man. And I'm like, well, from a symbolic framework, is earth below heaven? You know, it doesn't. Or is earth greater than heaven? Can earth exist without heaven or can heaven exist without earth? You know, does one lord over the other? It's sort of hierarchy. You know."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":3288.61,"end":3380.22,"speaker":"Jonathan Pageau","text":"The difference between Christian hierarchy and let's say more ancient or more kind of pagan forms of hierarchy is that our vision of hierarchy is a vision of love. It's not a vision of, like you said, tyranny over slaves. It's a vision of participation and love. And so the idea of the relationship between the heaven and earth is more like a dance. It's more like a kind of giving. You know, heaven gives and earth responds. And it's this kind of proposition and response that we see in the liturgy, you know, the. The relationship between the altar and the people. And so there are different functions and those functions are real and the hierarchy is real. But you know, we always have to remember that Christ washed the disciples feet and that Christ died for us, you know, and that in Christianity we have this sense that the top of the hierarchy or the higher aspect of the hierarchy manifests its height in the manner to which it gives itself to, you know, to those that follow, that follow. And so that is. That is of course a important to kind of. To understand that it. At least I don't know musically if you can hear it, but that, like you said, there's this. There's probably. There's a sense of hierarchy in the music, but that hierarchy is generative, it's generous. It's like. It's not, it's not. It's not like the idea of the subject which is trying to. To muffle the counterpoint, right? Or to muffle the counter subject or to like. To like squish it. It's rather this kind of. This dance."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":3382.38,"end":3435.52,"speaker":"Matthew Wilkinson","text":"No, for sure. I think it's exactly like you said. Christ fills the whole hierarchy. The hierarchy is its constant. What kenosis and theosis. It's both pouring out and God's condescension and then bringing humanity up. And so he fills out the hierarchy. It's like. It's beautiful, it's love. It's the reconciliation of multiplicity and unity. And that is what a fugue is. That's what great contrapuntal composition is. It's the ultimate reconciliation of multiplicity and unity through the iteration of different ratios and patterns at different levels. And so I think it's for sure there, the, you know, the. The idea of below and above is the. Is the thing that kind of people."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":3435.52,"end":3436.72,"speaker":"Jonathan Pageau","text":"Stick that sticking out."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":3436.72,"end":3438.4,"speaker":"Matthew Wilkinson","text":"To me, it sticks."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":3438.4,"end":3477.78,"speaker":"Jonathan Pageau","text":"But. So let's, let's look at what in Some ways happened, you know, in the modern age. I'd like to hear your opinion of that because there is a sense of. In many of the movements, the modern movements in like serialism, I guess, I don't know if that's how you call it. But this idea of somebody's removing hierarchy, right? Or at least making everything equal or like making every possibility manifest, like let's just go through all the possibilities and make sure that they're all there. Or in some ways, like this idea of the liberation of dissonance or the, you know, the embrace, embracing of dissonance, you know, I'm curious to know what you think or how you see that related to, let's say, what Bach was proposing."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":3479.71,"end":3568.45,"speaker":"Matthew Wilkinson","text":"I think aesthetically you see what happens with the progression from enlightenment philosophy to postmodernism. I think you see the same thing in aesthetics. You probably understand it way more than I do when it comes to visual art, but you for sure see it in music. But then there's a flip that happens at the end. So let's first get there, you know, with the Enlightenment and this constant. I think it's really with nominalism, you know, I think nominalism by itself sort of destroys the hierarchy. And it says, well now all there is is the nominal and the noumenal and the phenomenal. All there is is your experience and the world. And so there started to like seep in this bit of like anti hierarchy thing around like Kant, which is also happens to be around when like the gallant era and classical music is. You have Rousseau. I mean Rousseau is pivotal, pivotal, pivotal, pivotal to how we understand identity and how we understand what personhood is in the modern era. You know, Rousseau hated fugue. Rousseau thought that the only good music was that which he considered simple and elegant. And so it was just beautiful melody and harmony. And that was it. And couldn't stand counterpoint and you know, I can't stand."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":3568.45,"end":3575.17,"speaker":"Jonathan Pageau","text":"This is what we mostly have today, right? It's like the Beatles is just melody and harmony, right? What, what, what else is there?"}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":3576.77,"end":3804.14,"speaker":"Matthew Wilkinson","text":"Well, because there is something about that, that it's not intrinsically bad. It's. It's just readily. Apparently here's the melody, here's the harmony. It's easy, you know, and you can take, I mean you can take a hymn and do it just with melody and harmony behind it, or you can do it or that harmony itself, you can, you can go deeper and have lines within the harmony itself and it creates a more beautiful product. But, you know, it is what it is. But it's still not counterpoint. It's. It's not what. What came before. And then John Vervaeke said something I think was fascinating. I would love to know what he thinks about the whole classical era with regards to aesthetics. But he said with Kant, the Copernican revolution of Kant, where before Kant it was that which is real is the heavenly patterns. So as you move into rationality, you move into the real. Whereas after Kant, because of this, like, radical skepticism, as you move into emotion and to the phenomenal, you move into the real. And so it's not that which shows these heavenly patterns which is more real, but that which is more immediately apparent to, you know, your feelings and sensibility and pathos. And so the classical era progresses. Then you get into the Romantic era. And the Romantic era is all about that now. There's still, of course, there's still hierarchy. There's still even contrapuntal writing. Mozart himself, who's in the galant, the classical era, he had to do all of Fux's counterpoint exercises. Because no matter what, if you're gonna write Western classical music, that sounds good, you have to have some understanding of how to match consonances and dissonances. But it starts to get wilder and wilder, especially through the Romantic era. And so Beethoven is sort of that bridge from the classical into the Romantic. And by late Beethoven, there's some pretty, you know, the Grosse Fugue is some pretty wild experimentation with stuff. And then as the Romantic era goes along, finally you get to Liszt, and then they start playing with. Well, we've taken consonants and dissonance about as far as we can take it. What if we just didn't conceive of some of this as dissonance itself? What if we tried to take the concept of dissonance and sort of emancipate it so that we didn't view things the exact same way? And so then you have the second Viennese school. So you have, like, Schindler, Schoenberg, Berg and Webern, and early Berg is still pretty much in the Romantic aesthetic. It's. It's a logical conclusion of what had come before. Do you mind if I play, like, a couple lines of Bergson so you can hear. This is still a little bit romantic. So it's still somewhat romantic sounding like there's a. There's deep emotion into it. And you can tell sort of at the beginning, this is basically home. Yeah, yeah, you have, you. You have these points where you arrive and."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":3805.18,"end":3815.98,"speaker":"Jonathan Pageau","text":"Yeah, the way they use his dissonance in the first part sounds almost like jazz. It. It has this kind of emotional dissonance and then a little bit of hint of bringing you back. Definitely."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":3817.91,"end":3831.11,"speaker":"Matthew Wilkinson","text":"Yeah. And so there's these. If there are points where there's home, then there are points, you know, then you have a tonal center, which means ultimately there's a hierarchy of pitch nonetheless."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":3831.91,"end":3832.39,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":3833.35,"end":3899.39,"speaker":"Matthew Wilkinson","text":"You know, despite it. And so seeing that pattern and trying to truly emancipate dissonance, the only real possible way to do that was actually to superimpose in a very totalitarian sort of manner, what's called the tone row, which basically meant that then you couldn't repeat any pitch until all 12 pitches had been iterated. I mean, sometimes you'll hear repeated notes, but there's a way it works around that. Ultimately what you have is these tone rows, and that's called dodecaphonic music or 12 tone music. It's. It's Leitz Schoenberg. You get stuff like, I don't really know this piece. I'm gonna just slightly sigh, read a couple measures like, what is that? You know, I mean, there are."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":3902.35,"end":3902.59,"speaker":"Jonathan Pageau","text":"You."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":3902.59,"end":3905.31,"speaker":"Matthew Wilkinson","text":"Know, people will say, oh, Matthew just doesn't understand."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":3906.99,"end":3989.89,"speaker":"Jonathan Pageau","text":"No, but it requires huge amounts of effort to care for something that does not have a hierarchy, because that is what attention is. Attention is hierarchy. This is really a meta question that, that I think none of these people really thought about, which is that attention is hierarchy. It's saying, this is more important. I'm going to pay attention to this. Instead of paying attention to my fraying genes or to pay attention to, you know, the crack on the wall, I'm going to pay attention to this. And if you're telling someone, pay attention to something through a hierarchy of attention, pay attention to something which is trying to destroy hierarchy. There's something in it that is so unnatural. It's like in the very process that. That creates a kind of schizophrenic, like a kind of schizophrenic cultural vision where we think in these revolutionary ways, but we don't understand that, that all of it is necessarily couched, even through attention and memory and care and all these things in a process that is hierarchical. So it's ridiculous. I think it's ridiculous that, like, it's just ridiculous at the very outset of a project like that mean it's kind of, it's kind of interesting. It's kind of interesting marginally to say, how far can we go? How can we. How far can we push? And then people still care about this stuff. But ultimately it's a little bit of a. Like an elite project that doesn't lead very far, let's say."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":3991.41,"end":4076.19,"speaker":"Matthew Wilkinson","text":"Yeah, what's. What's weird about it though is it. Is it continues on until the 50s, but, but before I. Before I get to that. Right. So the way you can make it sound somewhat musical, especially where it's like right before 12 tone and it's 12 tone is you put phrasing on top of it and it's all gesture. So Schoenberg, from early to late Schoenberg has played a fair amount of Schoenberg myself, like in college. And I don't necessarily hate all of it. Some of the early stuff before it's totally deconstructed and it's totally 12 tone. Like the barracks of Sonata is a pretty beautiful piece. It's pretty dark piece, but you know, there is definitely some beauty to it. But when you get to the 12 tone stuff, the only way to have some semblance of emotion and music is to have really intricate phrasing on top of it so that you're performing the same gestures that you would be performing in Mahler or Beethoven or Rachmaninoff. And so it's those varied gestures that then give some coherence to the music. But what gestures are, is. I think gestures are themselves intrinsically hierarchical. So you sort of have to impose this little bit of hierarchy onto it so that, oh, now we get to the loud point and now we back off. Yeah, like that's a gesture."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":4077.07,"end":4078.51,"speaker":"Jonathan Pageau","text":"Yeah, yeah, that's what you mean."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":4078.75,"end":4157.22,"speaker":"Matthew Wilkinson","text":"And so that's going to a point and backing away from the point. And they realize this too, because then you get to Babbitt, Milton Babbitt, which has some really wild compositions. Let's see. I actually. Babbitt post partitions. Yeah, I cannot play this. This is absolutely insane. But he'll write ffff so fortississimo and P P. And then pianissimo. And that the amount of extreme detail that he would get. It's as though they realized we can't. If we, if we really want to be anti hierarchical and take all hierarchy out, then we have to have a system to impose, to impose also dynamic volumes to a absolute equality. And you know, they even do this, start doing this with rhythm and you get to total serialism. And total serialism is. I mean, it's that radical totalitarian superimposition of order. Ironically, that's the only way of achieving the emancipation of dissonance. That is, you know, the asserted aim of their project."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":4158.5,"end":4187.6,"speaker":"Jonathan Pageau","text":"Yeah, it's the order of a bureaucracy, is what it is. It's like a bureaucratic order. It's like, here's your social insurance number. Like, this is. This is the order. This is. You know, we'd have no hierarchy, but we're going to give you a number, and then everybody has a number. And so it's like this weird, mechanical, totalitarian system that is installed in order to liberate us from hierarchy, which is hilarious when you think about where it leads."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":4188.8,"end":4258.4,"speaker":"Matthew Wilkinson","text":"But it's not, you know, God is able to redeem. You know, God's able to take the most futile endeavors. And it's what you talk about, the flip of postmodernism. How do you. Yeah, yeah, there is that little bit of. Of a secret in there, which is that if no metanarrative is greater than any other metanarrative, and that then it allows for the recapitulation of beauty, so it actually allows for the recapitulation of the greatest metanarrative of them all. So it actually allows for a discovery of Christianity itself. It's like in the Matrix, right? So, like, you talk about. You totally ruined the movie the Matrix for me, by the way. You know, I was totally one of those evangelicals who looked at it and I thought, well, that's Jesus. And it made me super excited. And then you pointed it out that it's. Oh, it's actually Satan. And then now, as I thought about the postmodern flip, I thought, oh, but it's also Jesus again."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":4259.44,"end":4261.52,"speaker":"Jonathan Pageau","text":"Okay, maybe."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":4261.52,"end":4312.14,"speaker":"Matthew Wilkinson","text":"Maybe in the sense of, like, what is it doing? It's deconstruct. It's trying to deconstruct hierarchy. And so in so doing, it's in a sense, deconstructing, like, the story of Christ. It's like all these stories where in an attempt to usurp the masculine, they have to have the masculine lay their life down for the feminine, etc. You know, Neo lays his life down, and so there's like this sort of parasitic, deconstructive aspect to it. But at the same time, the only way that the story itself has any force is if Neo dies and comes back from the dead. So if they're gonna deconstruct the story of Christ, they have to recapitulate the story of Christ. So it's like, so a Christ figure there. There's no way around it, you know?"}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":4313.66,"end":4319.1,"speaker":"Jonathan Pageau","text":"No, that makes sense. So what does that mean in music, please? What? Like, so let me just."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":4319.1,"end":4319.98,"speaker":"Matthew Wilkinson","text":"I think it. Yeah."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":4320.78,"end":4393.34,"speaker":"Jonathan Pageau","text":"Let me just say one thing. So for sure, one of the things that I saw happen in post modernism is that the final emancipation is something like the, the emancipation of the tyranny of equality. Right, so exactly what you said. So in some ways it's saying in postmodern art, one of the things that happened is that mute, like the music that you talk about the painting became extremely tyrannical. All you could do was basically paint, color field, like one color things on canvases that, that were just these large. Like some of the late, the 70s painter around Greenberg were painting, like just. They would unroll canvas and just like basically just pour paint on because they had to remove all hierarchy. And so there was almost no way to do it besides this one kind of systematic way. And so what postmodernism did is in some ways said it wanted the freedom to play again with hierarchy, but without hierarchy. And so they basically started to reintegrate hierarchies into the, into the art in weird ironic ways. But it is this weird, this strange opening that you see in the postmodern and postmodern art."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":4394.78,"end":4440.74,"speaker":"Matthew Wilkinson","text":"Yeah, I think the same thing happens in music, you know, this opening of creativity. So I give two examples. One is, you know, may, if you, if you want to fit it nicely into a moment. I think the moment is when Arvo Peart leaves writing in a serial style and takes. I think it was an eight or nine year break and then comes back and now he's totally reinvented himself with this tintinnabile style or the style of the bells. You know that, that would be a point. Like if you were like a medieval historian, you would say with Arvo Pert's Credo in C. Do you know this piece, Arvo Pert's Credo?"}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":4442.1,"end":4447.22,"speaker":"Jonathan Pageau","text":"I don't know Arvo Pert very well. I just know I can recognize the style, but I don't know the pieces very well."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":4447.3,"end":4598.39,"speaker":"Matthew Wilkinson","text":"So he has this piece called the Credo, you know, the Bach Prelude in C major where he starts playing that at the beginning and okay, then he starts D. He starts deconstructing it and he, and he. And it gets wild. It's like a 20 minute piece. It gets really wild, some really crazy deconstruction happening. And then if I remember correctly, the, the choir sort of sings Credo on top of it. They're. They're singing the beginning of the. I believe in one God, the beginning of the Creed. But he just takes that, you know, the, the Prelude in C major, he deconstructs it. It gets to this weird 12 tone stuff. And then it comes back really fast. And then at the very end, the only thing that's left is the orchestra just plays a C and all there is a C. And then he takes his break. So if I was a medieval historian, you know, not worried about every single, you know, variation, or what about this composer who still wrote in serial music in the 90s? See, your narrative doesn't work because of this one guy, okay? But if I was like Eusebius, I would say with that piece, 12 Tone Music died. And then when he comes back, r Vo perit, he writes in this style where he basically takes one tonality, and then the entirety of the piece is just this slow repetition of several different patterns. And it's ethereal and mystical. And almost everything he writes is on generally an Orthodox text, almost all of it. It's all these mute, and it's sort of intrinsically sacred. And the irony is that Arvo Pere is the most performed living composer today. So in this crazy world of decadence, the most performed living composer, precisely because of the ability to basically write whatever you want because of the postmodern flip, is this devout Estonian Orthodox composer who's just taking the Great Canon of St Andrew the Cree and putting it to music. You know, it's. It's insane, you know?"}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":4598.39,"end":4602.55,"speaker":"Jonathan Pageau","text":"Yeah, that's. Wow. That's a great example of what postmodernism yielded."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":4602.87,"end":4762.94,"speaker":"Matthew Wilkinson","text":"Right? And to me, Messiane doesn't fit. Wouldn't fit into my sort of Eusebius style medieval narrative of how the Decafan music died. But Messianne, I think, is sort of of also an iteration of this. Now, I know I tried to turn you on to some Messian, and you were not the biggest fan of Messian, but I would argue that a little bit of what Messian has going for him, it does take some time. Whereas, like, I'm not sure, late Schoenberg, 12 tone stuff, you're ever gonna get to a point where you just listen to it and it's super emotional and. And you'll love it. But what Messiah did in this world where he had no rules is he just created different languages. And so he created an entirely different harmonic vocabulary. A lot of it was, like, centered around the birds. So he'd go out into the woods and just transcribe birdsong and write little stuff, like, into his music. He wrote a whole catalog of the birds. And it's like listening to Indonesian gamelan music or whatever, you know, at first you're like, what am I listening to? I do not get this. But if you were to, if you were to live in it for a while, you know, and to devote maybe like 20 hours to it, and then you listen into the Taronga Lila Symphony or the Quartet for the End of Time or the Piano Duo, the Visions of the Amen or the messian's 20 watches of the Night of the Infant Christ or any of his organ music, then there's a very similar aesthetic thing to Pert that happens in Messian where he takes you into this like trance state that's like deeply mystical. And like Bach, the majority of the stuff Messian wrote was also. It was Christian and theological and it was centered around the church and super influential. And so I know at first if people just go listen to Quartet for the End of Time for the first time, I mean, if you can sit there and listen all the way to the end, I don't know how you can listen to the, to the middle movement and the last movement and not feel something because it's. It. There's something that sounds slightly off, you know, but it's still beautiful and mystical. But there's definitely some weird stuff in there, you know. But I think Messianne is a little bit on the continuum to the more crazier side. But he also sort of inhabits that same space of the post modern flip that we now don't have these rules. So let's return to Christ."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":4765.5,"end":4814.48,"speaker":"Jonathan Pageau","text":"Yeah. Yeah. That's amazing. You know, man, this has been a great conversation and I, and you know, I, I think it, it's definitely brought me closer to kind of getting the music and understanding and it, and it, and it makes sense. So thanks for, thanks for coming on and everybody check out the, check out the new album. You know, if you, if you're really into music, it is worth getting the cd. It has a great, it has a wonderful booklet on the inside with more of some of my art and then a wonderful text by Matthew right at the beginning. And it's in French, in English and German. And so it's great stuff and a great picture, like really good looking picture of you right there. And so everybody check it out. And Matthew, thanks for. Go ahead."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":4814.8,"end":4896.63,"speaker":"Matthew Wilkinson","text":"I just want to say thank you for letting me use the, you know, your cosmic image on the COVID And the whole reason that I wanted to use that image, that I thought of that image was precisely because this piece for Bach, it's his longest organ work, it's his most mystical organ work, and it's the piece where he goes through all of the chorales that correspond to the essentials of what he perceived to be the Christian faith. So it's his magnum opus for the organ. And it's very spiritual and catechetical precisely because of that. It's like, well, what image is going to correspond to that? Because this piece literally covers everything, like the baptism, like the Gloria. I mean it's Christ's birth, his death, his resurrection. It's like the whole life of the Christian. It's like all put into music for Bach. So the only fitting image would be an image that's also an all encompassing image that then all also shows the fractal patterns of the music of the spheres. And so your image is perfect for that because there's only one cosmic image that I can think of, which is the one that you created, I guess now the one by Aiden Hart that he's now done. But your image is perfect. And thank you for putting it in color and for letting me use it."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":4897.19,"end":4952.99,"speaker":"Jonathan Pageau","text":"No, it's a joy people don't know this. And we're gonna end with this story is that, is that Matthew has been there from the very beginning. He is. Matthew's actually the very first person to like recognize me in public where I walked into a church. It was Holy ascension in Charleston. It wasn't like in 2017 maybe, or maybe even 2016, like right at the very beginning. And I walked out into coffee hour and I hear Jonathan Pedro, the symbolic world. And I turn around and here's this like he, this like giant strongman guy with like wax mustache wearing suspenders. And I was like, who is this guy? And, and since then we've become good friends. I've actually stayed at his house for weeks on end. And so, and so it's a great joy to be able to participate and it's an honor that, that you, that you asked to use my, my piece of art. I really appreciate it and yeah, wish you all the best, Matthew. Thanks for, thanks for everything you've done."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":4952.99,"end":4954.75,"speaker":"Matthew Wilkinson","text":"Yeah, thank you very much. I appreciate it."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":4955.81,"end":4970.61,"speaker":"Jonathan Pageau","text":"If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase. So go to thesymbolicworld.com and thank you for your support."}
{"episode_id":"SW - #373 - 2025-01-12 - Matthew Wilkinson - Mystical Bach and the Breakdown of Music","start":4971.41,"end":5032.45,"speaker":"Laura Diaz","text":"Tucson the weight is over Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project. Ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way and and the cost. The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweightloss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com."}
