{"episode_id":"SW - #398 - 2025-06-30 - The Time for Orthodox Art is NOW","start":0.16,"end":61.01,"speaker":"Laura Diaz","text":"Tucson, the weight is over Mediweight loss. They're officially open on North Oracle road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight and serious risks at mediweight loss. I got the same medication but with a customized plan, weekly check ins and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com."}
{"episode_id":"SW - #398 - 2025-06-30 - The Time for Orthodox Art is NOW","start":72.45,"end":76.13,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world."}
{"episode_id":"SW - #398 - 2025-06-30 - The Time for Orthodox Art is NOW","start":85.79,"end":90.35,"speaker":"Richard DeJournett","text":"Brothers and sisters, Reverend fathers, your grace. Christ is risen."}
{"episode_id":"SW - #398 - 2025-06-30 - The Time for Orthodox Art is NOW","start":90.67,"end":92.03,"speaker":"Jonathan Pageau","text":"He is risen."}
{"episode_id":"SW - #398 - 2025-06-30 - The Time for Orthodox Art is NOW","start":92.19,"end":163.57,"speaker":"Richard DeJournett","text":"It's good to see you all this evening. We are going to go ahead and get started so find a seat or sit on somebody else. And I know it's really wonderful to see everything so full. It's my great pleasure to have the honor of introducing my good friend Jonathan Pageau. And we were talking a little bit before and I was trying to decide how best to introduce him and I was like, well, what are my most embarrassing Jonathan stories? You know, there's also, you know, one of the things that people ask me quite often is how did you start working together? I mean, after all, I'm from Texas, thank God, and he's French and you know, and so how did. And so the quick story that I'll tell is that several years ago I was. I'm the sort of person, as most of you probably know, I just, I like to read really old, interesting, weird, obscure things. And so I was reading these things and I was posting about some of the stuff that I was reading on the. Specifically something called the Sibylline books which if you've watched our universal history videos, you go back for the first couple, you'll see some stuff in there about them."}
{"episode_id":"SW - #398 - 2025-06-30 - The Time for Orthodox Art is NOW","start":163.57,"end":165.05,"speaker":"Jonathan Pageau","text":"Anyway, so I was posting about this."}
{"episode_id":"SW - #398 - 2025-06-30 - The Time for Orthodox Art is NOW","start":165.05,"end":212.56,"speaker":"Richard DeJournett","text":"In the symbolic world community and I Think Jonathan was like, who is this guy? Or what is he posting it like? You know, and so we started having a conversation about this and then eventually said, well, let's do a podcast. And then the podcast turned into another podcast and turned into another podcast. And then basically, I sort of just moved in, you know, and then, you know, several years later, now what? It's been three or four years, I guess, since we started doing that series together. And we've got a wonderful publishing company, the Symbolic World Press. That's been one of the great joys and frustrations and all of those things of my life is to work on that with you. But we've got a table at the back, and there are some flyers that I think some of you were handed when you came to the door. Does anybody have a flyer? I meant to have one to hold up somebody."}
{"episode_id":"SW - #398 - 2025-06-30 - The Time for Orthodox Art is NOW","start":212.56,"end":213.08,"speaker":"Announcer","text":"There we go."}
{"episode_id":"SW - #398 - 2025-06-30 - The Time for Orthodox Art is NOW","start":213.08,"end":213.84,"speaker":"Jonathan Pageau","text":"Yeah. Thank you."}
{"episode_id":"SW - #398 - 2025-06-30 - The Time for Orthodox Art is NOW","start":214.96,"end":233.21,"speaker":"Richard DeJournett","text":"So there's some flyers you've gotten at the door, and I think we still have a few left. And these just. This has a little bit about our work, including a. A QR code. So there's two things here that I just want to call your attention to. Jonathan won't do this. He's terrible at marketing or stuff. Man, come on."}
{"episode_id":"SW - #398 - 2025-06-30 - The Time for Orthodox Art is NOW","start":233.21,"end":238.25,"speaker":"Jonathan Pageau","text":"My children have to eat. Jonathan. No. But I just want to point out two things."}
{"episode_id":"SW - #398 - 2025-06-30 - The Time for Orthodox Art is NOW","start":238.25,"end":257.77,"speaker":"Richard DeJournett","text":"One is that we have the next book in our fairytale collection. We have the first two back there at the table. If you haven't grabbed one already, please come by. We have a few left. But the next book in our series is Rapunzel and the Evil Witch, and this comes out sometime this summer. And it's really beautiful."}
{"episode_id":"SW - #398 - 2025-06-30 - The Time for Orthodox Art is NOW","start":257.77,"end":258.17,"speaker":"Jonathan Pageau","text":"It is."}
{"episode_id":"SW - #398 - 2025-06-30 - The Time for Orthodox Art is NOW","start":258.17,"end":305.71,"speaker":"Richard DeJournett","text":"Legitimately, it's one of the most beautiful books that I have ever read in my life, and I'm just so excited about getting to bring it to all of you. So there's a QR code here. There's going to be kind of a shorter release in the summer before the rest of the books arrive. And so if you want to be in on that first release, which is pretty limited, you can sign up for early access there. The other thing is that we're currently doing a course for the Symbolic World press, so some of you may know we have courses on literature, medievalism, the inklings, things like this. And so right now, Jonathan is teaching an amazing course. It's our Symbolism Masterclass. And it's really. Basically, it's all the things Jonathan won't say in public. You know, it really is kind of that, though. Like, I know that some of you here are actually taking the course right now. And there were some of the. There were some things like this last week."}
{"episode_id":"SW - #398 - 2025-06-30 - The Time for Orthodox Art is NOW","start":305.71,"end":306.39,"speaker":"Jonathan Pageau","text":"I was like, oh, wow."}
{"episode_id":"SW - #398 - 2025-06-30 - The Time for Orthodox Art is NOW","start":306.39,"end":307.51,"speaker":"Richard DeJournett","text":"He said the thing, you know."}
{"episode_id":"SW - #398 - 2025-06-30 - The Time for Orthodox Art is NOW","start":307.59,"end":308.55,"speaker":"Jonathan Pageau","text":"Anyway, it's great."}
{"episode_id":"SW - #398 - 2025-06-30 - The Time for Orthodox Art is NOW","start":308.55,"end":328.21,"speaker":"Richard DeJournett","text":"It's really, really great. And so we are actually offering a discount on that as well. So if you scan this QR code right here, you can use the code dxwtemp to get 10% off the cost of that course. So, anyway, get a flyer, check these things out. Check out our table in the back. And Jonathan, over to you."}
{"episode_id":"SW - #398 - 2025-06-30 - The Time for Orthodox Art is NOW","start":328.21,"end":329.73,"speaker":"Jonathan Pageau","text":"Thank you, Richard. Thank you."}
{"episode_id":"SW - #398 - 2025-06-30 - The Time for Orthodox Art is NOW","start":330.29,"end":330.85,"speaker":"Richard DeJournett","text":"All right."}
{"episode_id":"SW - #398 - 2025-06-30 - The Time for Orthodox Art is NOW","start":343.05,"end":1340.18,"speaker":"Jonathan Pageau","text":"And so, your grace, Reverend fathers, thank you for the invitation. It is always a joy to come to Texas, to come to Dallas. I'm starting to think of it a little bit as my second home. I really enjoy coming here. And as Richard was presenting, I really enjoyed my growing relationship with him. You know, when he said he was. When he said that he was reading the Sibylline oracles. Because the Sibylline oracles is a very, very strange and. And very niche thing that not many people know about, but it has a very strong, let's say, importance in this idea of what we call universal history, which is the sense that some of the things that the ancients were talking about were actually leading to Christ, and that the early Christians and that the church were able to discern that even in some of the pagan works or some of the stranger aspects, they're able to say, oh, wait, this is weird, but it also simultaneously points to Christ. And so these are the things that interest us. But today I'm going to talk to you about art. I'm going to talk about a very particular moment in which we are. Now, I want to say that we are in an extremely exciting moment. A lot of people who are coming here know that. So many people I know who are here today, our new converts, catechumen, a lot of young people who have discovered orthodoxy and have seen in our holy tradition a key, you know, and a key that opens up so many aspects of the world. Of course, our spiritual life, of course our movement, our struggle towards salvation, to be united with God and to Christ, but also something else, which is an entire network of relationships, of beauty, in terms of the visuals, in terms of the music, in terms of how these fit together, the architecture, you know. And so all of these things come as this revelation of something that we feel like we had slowly lost in the west, something that had been there in the early centuries, but that was slowly eroded. And so we have access to this whole Language that is coming to us. And when we discover this language, we realize that it's not alien, because some people say, oh, you know, Orthodoxy, it's really interesting because it's foreign, it's Eastern, you know, it's kind of spicy, it's Oriental, and there's a little bit of that which is. And some people are attracted to it, to that, maybe mystery at the outset. But once you start to live in the Orthodox Church and in the life of an Orthodox Christian, you realize that this language is the language of Christianity, like I said, the one that was there in the east and the west and was slowly eroded in the West. And so it's a way back, not only in terms of faith, but back to our own roots, roots that we feel like we've lost over time. And so it's an exciting time because all this energy is coming into the church, and all this energy is coming into the church at a moment when we feel like the culture around us is fragmented. We feel like arts, culture, music, cinema. Everything is just running out, right? The stories are running out. Nobody knows what story to tell. Nobody knows what images are important. Nobody is able to know what to listen to. You know, the music has been reduced to, like, mumble rap, like three beats that just are repeated, you know, after one, after the other. You know, the cinema has been reduced to this, basically propaganda. And so, you know, on the one hand, we are grieving, but on the other hand, it is exciting because when something decomposes, it becomes earth in which to plant a new seed. You know, when the darkness grows, then the candle shines brighter. And so it is an opportunity for creative people, for artists, for people who want to be able to speak into the chaos, to actually have a voice and to actually make a melody which has been drowned out for centuries, audible again. And not only for people in the church, of course, firstly for us in the church, but also for people outside. Because there is something undeniable about beauty that no one can stop looking at once they get a glimpse of it. When somebody walks into a church and walks under the dome, I don't care where you're from, I don't care what your background is, you cannot resist the effect that it will have on you. And that is true of the music, and it is true of the stories that we gather. The story of the saints, the legends, even the weirder stuff that kind of creeps in the margins of our tradition. All of these are an amazing network of things that we can capture, but in order to do so, we have to first understand the state of the world in which we're in and then understand what does it mean? What is it that we offer as an alternative to the current state. Like I said, we have to be able to understand the state of culture and the state of art in the contemporary world. Because sometimes with all the best intentions in the world and even with all the beauty that surrounds us and all the beauty that we're part of, we still have certain diseases inside us. We still have certain perverse ways in which we understand culture, we understand art, we understand human making. And we can, if we're not careful, we can bring these into the church, and we can also bring them into our desire to speak into the culture that's around us. So it's a good idea to kind of do the first. Do the medical inquiry and give the diagnosis. And then after that, we can look at how. What the. What I believe, how orthodox art and the orthodox vision is a cure for that disease. And so one of the things that happened after the Middle Ages that led to us, and it's a perverse element of some of the best art that the west has produced, is the idea of the artist and the public. It's the idea of the painter and the viewer, the performer and the public. We have this notion, right? And so when we think of art, we think of it in that way. That's another way we tend to think of it. We think that, well, what is art? I will go to a concert, and then I will sit, and then people will play music for me. Then I'll applaud, and then I'll leave. But first of all, there's nothing wrong with that. That is fine. But there is an issue in that problem, which is that at some point, art becomes something like a consumable, becomes something to consume. Art is a product just like a can of Coke or just like a hamburger. I got my popcorn and I got my movie, and I'm consuming this. So I'm a client, right? I'm a buyer. And now this is the product that I'm purchasing in order to satisfy certain needs that I have. Whether it's to be distracted, whether it's to be elated or whatever it is that I want to feel. And this is the way that we understand art. Like everything, cinema, tv, all of that. All of that falls into that category, okay? And so the image of this notion of art as a consumable, I love this because there's all these layers of consumables. And in this image, it's like, you know, we're gonna, we're gonna have a great night of art and culture. We let go, we go to see the symphony, play Star wars music. And so we have this beautiful experience of listening to the music from movie and you know, and it's, it's wonderful. Like it's great, it's fun, okay? And it falls into ultimately this, also this sense of fashion. Art becomes a slave to fashion. And what you realize is that we are obsessed with novelty and we are looking for novelty and we have a really high minded vision of novelty and we have this sense confused novelty with that dirty word progress, right? Art has to move forward. Art has to be new, it has to change, it has to break boundaries and everything. But ultimately what you notice is that really what it is, it's just fashion. I think fashion is another word for acidia, right? Fashion is another word for distraction. Fashion is another word for the cycles of attention, right? That we just, they just, you just have to keep like, how can I say this? Like the little thing has to come poke out again and shake at you so that you look at it and then you get bored. And then another thing comes up and pokes at you and you're like, oh. And then you get bored. And that's what the wheel of fashion in which you're in, you know. And what's interesting, like I said, is that there was a time when this was, could have been convincing. And I totally understand how people kind of went into this thinking, oh, this new movement of art, this new style of cinema, this new way of filming, this new type of music, it is breaking ground, it has progressed this progress and it is this new thing. But now we're at the moment where we've seen, now it's just all recycled, recycled, recycled. And that whatever supposed novelty happened in culture happened for very short bursts of time. Maybe at the beginning of the 20th century, maybe a little bit after World War II. And then now we're just basically recycling, you know. And so I watch my daughters all of a sudden wear jeans, like up to their belly button. And I'm like, wait a minute, how did the 80s come back? I thought that was like the most like kitschiest. Nobody does that now anymore. But like you have these weird things that just keep cycling back and it's like, but is there still this idea that it's progressing? But now because it's been such a long time that this way of thinking has been in the world, we can actually see its fruits, right? And we, you know, about Flash fashion, right? This idea of fashion that lasts literally for like three weeks, right? And everybody goes on these websites and they like, buy the latest, latest thing and then they wear it for like two weeks. And then if you still wear it after that, you're not cool if anymore. And it's just like these really, really fast cycles of attention. But like I said, that is winding down because at some point it just becomes a ridiculous. You notice that it's just a ridiculous carnival wheel that you're spinning faster and faster and that there is very little, first of all, actual novelty. And that a lot of novelty is really just like a little clown going like this and shaking, you know, looking for scandal in order to attract attention. Looking for some shocking thing that will attract attention. But it's been evacuated because, you know, it's like the suggestion of sexuality in, like 1950s rock and roll sounded really edgy and really exciting. But by the time you're like now and you just got like, basically a strip show on stage and just like this disgusting behavior, it just makes you want to vomit. Like, it's like, it was like this idea, I know this is pushing the boundary. Like, this is so exciting. And now it's just like, okay, yeah, thank you, but no, thank you enough, right? You need something more than that. Hi, this is Sarah from Hamilton, and I'm very happy to announce my first course with symbolic world Scripture, the key to reality. Over the span of five weeks, we will look at the scriptural vision of reality through the lens of the Temple. We will see how all the details of scripture orbit around the person of Jesus Christ, the eternal word of God and archetype of the world. And we will see how that christological vision firmly earths in place the concrete details of Israel's Torah and story. Through that lens, you will come to see how meaning and matter intersect and intertwine not only in the text of scripture, but in the very tapestry of reality unveiled by the Bible. So in that sense, there is also, like I said, this idea that related to the notion of consumable that I've already been talking about is the notion of art as revolution. And this is something that started to become very prominent, of course, in the early 20th century with all the painting movements. You had Picasso, Cubism, Surrealism, Futurism, all of these artistic movements that presented themselves not in continuation of what was there before, not as a taking forward of the flame in the sense of like a memory of where I come from that is being passed down to the person after me that we Know, we call tradition. But no, we're going to snuff out that flame because that flame is tyranny. That flame is. You know, it's oppressive because it stifles our creativity. We want to be free. We want to do whatever we want. We want to open up creativity in the most ways that we can. And therefore, we envision art as revolution. If you think about it, if you listen to cultural commentary, it just creeps in all the time. People are always presenting art as revolution, but at the same time, the revolutionary trope basically played itself out in the early 20th century. It was like a flash. We went from an exciting revolution to this. And it happened in 10 years super fast. Basically taking the most random object, putting it in the gallery and saying, this is art. This is, of course, Marcel Duchamp. Marcel Duchamp's urinal that was put up in a gallery in sea 1917. Caused a scandal, you know, because it was so revolutionary. Caused a scandal. People broke it. Sure. The artist was super happy, got attention, you know, I'm breaking the rules. I'm part of the revolution, you know. But what about, like, now? It's been 100 years since this happened. And now what? Right now? What? We just repeat this revolutionary gesture over and over and over? How did you think we could get. You never thought we could get a tradition of revolution? We have this tradition of revolution where we're just constantly turning this wheel and revolving anywhere. I just watched on the plane here, I actually watched the Bob Dylan movie A Complete Unknown. It's a good movie. It's definitely worth it. But look at this. He defied everyone to change everything. And in the movie, that's how he's presented, you know, and it's super interesting. I'm gonna spoil it for you."}
{"episode_id":"SW - #398 - 2025-06-30 - The Time for Orthodox Art is NOW","start":1340.82,"end":1341.38,"speaker":"Richard DeJournett","text":"Sorry."}
{"episode_id":"SW - #398 - 2025-06-30 - The Time for Orthodox Art is NOW","start":1341.54,"end":4100.12,"speaker":"Jonathan Pageau","text":"It's not like it's a big mystery, right? The whole movie is about how Bob Dylan gets trapped in the world of folk music. And he's kind of looking to break out and to break out of folk music and to move into rock so he can change the world. And it ends where he's at this folk festival. Like, it's a folk festival. It's a folk music festival. And the people at the folk music festival are just telling him, Mr. Dillon, this is a folk music festival. Like, that's the boundary of this place. If you want to come here, like, just play folk music. And he's like, oh, man, I can't do it. You know, break all the rules. I'm gonna break all the rules. And it just. I Mean to me, it's just so tired. It's like, are we still telling this story after a hundred years? Breaking the rules is not complicated. It's like, you know, it's not a big mystery. You have a pattern and you break it. I don't understand why that's such a big deal. All right, okay, I'm going to toss everything here right now. I'm going to show you that I don't care about this place. You know, it's like, okay, it's such a trope. Like, you know what it looks like rebellion looks like very clearly. You know, you just do something different. But that look, doing something different looks the same. It ends up just all looking the same, right? It's like, you know, a punk rocker wears a uniform. Folks. Like, I can tell a punk rocker from, like, a mile away because he's a rebel. And he looks like every other rebel that ever existed in the history of rebels. Okay? So. But it's really important to understand that, to understand this. And the thing is that it's still here today. This is an artist. His name is a Weiwei. He's probably one of the most important visual artists right now in the world. He's a Chinese artist. And here he is being an artist. He takes this beautiful vase, ancient dynasty vase, and he drops it and breaks it. And that is his great act of revolution. And this wasn't made in 1917. This was made, like, 10 years ago, 15 years ago. You know, there's a. His most famous piece of art is him, you know, flipping off the White House. Have you seen this image? Probably not. That's just a picture of him flipping off the White House. All right, that's it. All right, Mr. Owe, I guess, you know, but you have to be able to attend to it. You have to be able to notice it, because you'll hear it constantly. You'll watch a movie, and they'll say, oh, this has never been done before. This is a complete new way, complete revolution on how things were done before. But that's not even possible anymore. It's like everything in that sense has been done the revolution. One of the things, by the way, if you want to notice, interestingly enough, in terms of the revolutionary trope, is that because it's just been done over and over and over and over. Now, if you want to make art that's revolutionary, you almost have to, like, remind people of a world that was kind of orderly and traditional and then upend it, right? So what are you doing? You're just like, Recasting the tradition and then upending it, and then recasting it and upending it, right? So it's a simple move, but it's one which people think is the deepest aspect of culture. And that brings us towards this type of thing. That also brings us to this notion that you see now, which is that this idea of art as social engineering or art as propaganda, because a lot of people intuitively, at some point, realize that breaking things is not enough, that you can't just be breaking things. So people want to say, well, I want to make art that builds something. And I get it, right? I want to make art that participates, Participates in something, Participates in a project, participates in building something. But what we end up with, sadly, is something that is more akin to propaganda. And that has been in some ways the case, especially in the past two decades, especially in pop culture. We've kind of seen propaganda infiltrate the world of art in ways that make it just boring, because nobody likes propaganda. Actually, you know, this is actually. I actually decided to choose a version of Shepard Fairey's poster. This is actually quite nice. It's not like it's not the dribble of propaganda that we say, but you can see that it is fine art that is in the service of a politician. Right? It's fine art that's in the service of politics, in the service of a social ideal. But there are so many examples of this, and I decided to choose the deepest one. Yes. So, and this also brings in everything about, like, fashion and consumable as well. It's all kind of layered into the same image. And so Kevin Smith revamped He man for those. I'm sure everybody knows who he man is. He man is a figure of my childhood. Childhood was a toy. He was kind of like this barbarian figure. And they had toys, we had animations. And he's like this mythical world, obviously, downstream from Tokyo and all of that kind of mythical imagination. And, you know, it was campy, it was fun, whatever. It was the way to sell toys. We get it. Until they decide to revamp this, obviously, because now all the Gen Xers are adults with kids. So it's like, can we need to make things for the Gen Xers so that they can buy it for the kids and so that the kids like it. You know, that's how it works. A lot of recycled IPs are about that, like, capture the Gen Xers that they provide for the kids. And so he does this revamp of He Man. Look at the poster, like, right there. He Is he man? You know, he's got the power. He's in the middle. But when you watch it, what they do is they replace he man with a female character. This has been a trope that's just been going on over and over and over. It's like you have this character, it's the main character of your ip, and then you replace the character in the IP with a female protagonist. And of course, the reason you want to do this is for revolutionary reasons. It is for all the reasons that we know. But what it ends up doing, because it's not natural, because it's forced, because it's like trying to inject something into a story that has its own coherence, is that it looks fake and it's boring, right? Can we have a story with a powerful female protagonist, an interesting female protagonist? Of course we can. There'll be stories like that forever. We have stories in the Bible like that. We have great stories of saints that drove spikes into the heads of their enemies in the Bible. So it's not like that doesn't exist. It's not like we don't know about that, you know, but if you try to inject that stuff into a story, try to force it on us, right? It just doesn't work. It doesn't fit. And then we end up with a disaster, which is something that nobody cares about. And that has been for us to a great service. Because the past 15 years, 20 years, have been an increasing amount of these propaganda type stories, this kind of infecting of all the things that the Gen Xers cared about and basically subverting them towards political means, making them boring, making them uninteresting, making them lose money, Losing money, losing money. You know, Disney is just losing money on every single project that it's doing. They wrecked Star wars, they wrecked Marvel, now they wreck all the IPs that they own, trying to inject their political ideology, this kind of activist propaganda stuff. And now nobody cares anymore. And so in some ways, we reach the end. And I think this. I think this is the end. I went to see this movie. I did. I went to see it in the cinema. And it was a very exciting thing to watch because, yes, it was boring. Yes, it was injected with all kinds of nonsense. The story didn't make any sense. But the reason why the story didn't make any sense was fascinating because this Snow White movie is like two movies fighting with each other. When you're watching it, you can tell that there's two movies in there and they're duking it out because they tried to make it into a propaganda piece and then they showed it to people. People were so disgusted by it and the fandom was freaking out and so they panicked and then they put it off for a year. And then people. And they panicked again and they put it off for another year. And they refilled almost the entire thing. Made it into like a 300 million dollar movie. And when you watch it, you can see, you can see that it's over, right? Because you feel in it that they. They're like, oh, damn it. We have to reintroduce these things that we hate, these things that are actually part of the story. We actually have to have the prince kiss the one. Oh my goodness. It's so frustrating for them. And they put it here. If you watch it. It's funny because it's like obviously that scene in the movie, in the original story, in the fairy tale and in the early Disney version, that's the culmination of the story where the prince comes and she's dead, right? It's a resurrection moment. And he kisses her and he brings her into the kingdom of heaven. It's like the image of Christ. It's this beautiful moment in this movie. It's like kisses her and she kind of sits up and it's like, yeah, they put him in there. But they're really not happy. But like I said, it's a great sign. It's actually a great sign of hope because it means that everybody now knows that it's over. Now what do we do? Everybody's panicking. I have some insights into that world a little bit through friends and through people that I know. And nobody knows what they're doing. Nobody knows what to do. Everybody's panicking. And everybody had all these studios all have products that are in production right now that they know are going to fail, but they have no choice. They already put the money in, they're already kind of moving with it, but the ball's already rolling. They can't stop it. And they know by the time that it's out that it's going to fail. And everybody's scrambling to figure out what do we do? And so this is it. This is an opportunity. And the question is now what or what does this have to do with us? Now we offer an alternative. Now the problem with this alternative is that it's a very, very deep alternative. It is one which in the sense of revolution is deeper than the revolutions that we've seen from a very long time in the sense of how transformative it is. It is extremely transformative, but it means that we have to also understand that it won't be able to do the same things as the culture that was there before us was able to do, because that we're not aiming for the same ideas. So in the 19th century, Richard Wagner, who wrote these crazy, insane operas, was looking, and a lot of the artists were looking for the perfect work of art. And they were kind of saying, what is the most complete work of art, right? And this is what Wagner called the Gesamtkunstwehr, which is inside the complete art. What is the total artwork? And there was obviously argumentation about what is the most complete or what is the art that contains the most in it. And then Wagner came to the conclusion that it was opera. And why was it opera? It was opera because opera has all the arts brought together in one art. Because it's composition, right? It's a visual composition. It has music, it has narrative, it has a sense of architecture, it is inhabiting space, et cetera, et cetera. And so he thought, this is it. This is the perfect art because it brings everything together. Some people have said after that maybe the cinema is actually, you know, because. For the same reason, because you can have. You have the cinema, you have the visual composition, right? You have the narrative, you have the score, maybe you have even songs in it. And it kind of is an extension of this vision of opera into the culture. Now the question is, what is it missing? It's missing one essential thing, very essential thing, actually. It's missing the thing that I hinted at at the outset. It's missing participation. That's what it's missing. It's missing that it's not me sitting there watching the story, but that it's me in the story. That's the Gidant Kuntra. And that's what liturgy offers. Because in the liturgy, we have all of it. We have music, we have visual, we even have smell, which they don't have in the opera. We have the music, we have the architecture, we have the smell, we have all that we even eat. We even use our sense where we eat the body of Christ. So all of the senses, all of the cultural references are all drawn together. But at the same time, we are inside. We are not watching it from the inside. We are not consumers, we are not the public, right? We are in the. In the liturgy. And so. So. And you can understand, like, you know, for example, like the. It's okay. Like, we have. We have pews here. I have Pews in my church too. But you can kind of understand the resistance to pews in the orthodox tradition for just saying, this is not a show, folks. Like, this is your life, this is your story. It's the story, the thing that you're in. It's something that you participated. You are an actor, obviously not in the sense of theater, but you are an actor in the grand story, okay? And so that changes a lot now. It doesn't mean that we have to condemn, obviously, the more passive aspect of modern art. It doesn't mean that now going to the movies is evil or that, you know, I don't know, whatever, like, listening to music is bad. And I'm not suggesting any of that. But what I am suggesting is that understanding that and fully living that is like a root for everything else. It's like a foundation that is anchored in the highest thing, that if then it's going to move out into the world and then participate in the more, you know, secondary arts like visual art and all the things that are fine, that they exist, it creates this anchor which will help to prevent the disaggregation, the decomposition that we saw happen over the last 100 years. Because you have to realize that the way that it was set up in the story was already in a revolutionary way. But you can listen to them, right? You can even hear. I remember listening to some of the new atheists talking about that, and someone asked them about the sense of mystery and the sense of narrative and all of these things that the atheists, how do they get it? And they said, well, it's no big deal. We just get it from art. We read novels, we go to the museum, we do that. And so it was presented in the development as this great secular replacement for the liturgy. And some like. There's an interesting text by Helen Bakht, who's a French communist, mid 20th century, who wrote about going to the cinema. And he explained how the cinema had subverted the church. And he was celebrating it like, he wasn't criticizing. Yeah, we did it. We created. We created a secular communion, you know, where we all come together. And the old cinema, if you don't. If you don't remember, they used to have curtains. They could pull the curtains. And there was like a light, you know, the light goes down. And the seats were more like cinema seats, like theater seats. And there was a sense of this moment of awe and of wonder that we participated. The thing is that if that's not anchored in something deeper, what happens is what happened. It just decomposes it decomposes and decomposes and decomposes. And then you're sitting at home in your pajamas watching Netflix because that's the end of that. You thought we were all going to come together and celebrate the greatest achievements of human life. And it's like, no, you're going to be watching some stupid reality TV show, you know, at night. That's the end of that, Right? It's like, it's not what you thought. And so as Orthodox Christians, then it means that we need to embrace the kind of hierarchy also of understanding, which is that we have to be able to know and to remember and to participate in the fact that. That liturgical art is always the highest art. And why is it the highest art? Because it is the art that is dedicated to God. It's not dedicated to the human condition. It's not dedicated to the revolution, it's not dedicated to money, it's not dedicated to all these secondary things which infect the world of culture and infect the world of art. It is everything is the act of painting, it is the act of singing, it is the act of making furniture, of making vessels, it's the act of making clothing, it's the act of eating. It's all the things that humans do now brought together and offered to the heights. So it becomes a stable and real anchor for all human behavior, for all human making, for all human activity. And it holds it together in the highest and guarantees by our participation in it and our attention. Right? Our memory, or at least the possibility of always remembering what is the highest version of these actions. Right? Okay. And it's not just about art. When you sit at home and you eat as a family, if you remember that the highest eating is the one that you come take at the chalice here, and that your participation in your family meal is downstream from that. And you pray before you eat because you remember how it all lines up in the right way, that it anchors that together. That's true of all human activity. It anchors it. And you can see, like if you could just pay attention to how history developed, you can see what happened. The artists moved from writing music to God, to writing opera, to writing nationalistic type anthems or whatever, to writing pop music, to writing mumble rap all the way tumble down into. To just talking about nonsense, you know? And that's how it falls. And it's related in terms of a curve, right? And we're lucky because we're at the end of it. So if there was any doubt at the beginning and we don't have to be angry at the people who maybe let themselves be seduced at the time. Now it's like, come on, we've seen where it leads. Like, we know what happens, right? And so this idea, that liturgical idea, art is the highest art in that it is the source, you could say, of the highest form in terms of the language, in terms of the patterns that it invokes, in terms of the way that it strings things together, in terms of the storytelling, all of this stuff. Now, it doesn't mean that it's the most. What word am I going to use? Doesn't mean that it's the most most exciting in the. In the more mundane sense. And we have to be careful about that, because the highest doesn't mean that it's the most entertaining. Let's say that it's okay to be entertained, but the highest thing doesn't have to be the most entertaining. But if you anchor music, for example, in a society, in liturgical art, then you will have all the other. You'll have entertaining music, you'll have all kinds of things. You'll even have bar songs. All of that stuff will exist, but it'll. It will stop. It'll hold it together so it doesn't absolutely collapse into complete nonsense, right? It'll kind of create this cohesion. And so liturgical art, I think, has to be the highest art. As Orthodox Christian, it's not hard. You come to church, you venerate the icons, you listen to the music, we sing, we participate in it. Does it mean that every artist has to be liturgical artists? Not at all. And that's a real big danger for. Especially for Orthodox converts. Every Orthodox convert with a little bit of creative inclination immediately thinks they have to become an iconographer, maybe, and glory to God, if that's for you, but it's not necessary. Not every person in the church has to be an iconographer, but we still have to recognize that that is the anchor and that holds it together. This is an example I did. I put up an example of a reliquary that I carved with an architect and designer, Andrew Boole, for the Russian family, Tsari family. And you can see that, you know, it has a certain. It has a function. It holds the relics. It's not just a visual painting, not something that you put in a museum. It actually serves a real purpose, but it's also meant to be beautiful, well made, to be a celebration of the best things that we can make. And if you want to understand a lot of people, when they look at what I do. Some people get confused because they're like, what are you doing exactly, Jonathan? You do this icon carving, but now you're putting out comic books and. And graphic novels and T shirts, and it's like, what is happening? Like, what's the thing? Like, what's going on? And I would say that if you want to understand the. The reason why I do this, do this is because I am trying to see how. What I just have been talking about, how I can participate in its embodiment, which is how can I take the 10, 15 years that I took to study Orthodox iconography, medieval art, medieval imagery, all the tropes of that, all of the patterns in that language, and how now can I apply it lower and lower on the hierarchy, let's say, so that it reaches all the way into popular objects, popular Earth. How do we do that? That's one of the things that fascinates me most, because, like I said, if the Orthodox, all Orthodox, traditional countries, they don't just make icons. They have all kinds of things. They have their own national legends, they have their bards, they have their songs, they have secular images. All of that is kind of part of the mix. So if we're going to participate in a renewal in culture, how do we now embody that? Right? And I think that right now is what is exciting, because as everything tumbles and everything falls and everything kind of collapses, there is now a, you could say, an openness. An openness to a new story. Like a secret desire for a new story, a secret desire for a new image. Something that will revive, not the revolutionary aspect. Say it this way. A desire to remember, right? A desire now to remember instead of live in this chaos of revolution because people don't know who they are anymore. So how do I now remember? And this is what I think, in opposition to the way I presented you, the vision of our modern world. I think that Orthodox art can present three alternatives, which is not art as a consumable, but art as participation, right? Art also as. Not as revolution, but as celebration. And then also art as a type of Enlightenment. Enlightenment, not in the modern Enlightenment way, but in the sense of bringing light to people, not darkness, not cynicism, not just the passions, but bringing something that elevates them, that makes them more than what they were before. And because, like I said, we're kind of at the end where everybody is confused and nobody knows who they are, then people are also open and curious about that. How do we do that? So, of course, liturgy answers all these questions. Liturgy does all that, you know. But like I said, you know, here we are in church, and of course, glory to God. That's the most important part. But then, if we're going to speak out into the culture, if we're going to participate in the cultural form that are around us, what ways can we do it that we encourage these three? And at least for now, the thing that I'm excited about doing is kids books. And again, a lot of people are like, jonathan, why are you doing kids books and fairy tales and everything? Because I think that this is an immediate. It's an easy one. It's actually the easiest one. Let's do the easy ones first. We'll do the harder ones later. The easiest one, because it's a children's book. A book for children is a way you can access all three of them goes right away. Because reading a book to a child is participation. You sit in the evening before your child goes to bed. You sit in bed, you open the book, and the parent reads the story to the child. They are engaging in a relationship. They are not just treating this as a moment of performer and public, but it is a true moment of affection and mutuality that is being experienced. It's a little liturgical experience to read a story to a child. And so I thought, like, this is an easy way to go about this, kind of move into this space without slipping too much. And so what do we do then to make it celebratory? It's the same. So let's take the old stories now. The old stories have been forgotten. Not only forgotten, they've been ruined for the past. Like I said, Disney doesn't even want to tell them anymore. They actually hate the stories that they're guarantees of. They hate the story of Snow White. They don't want to tell it. They hate Seeking Beauty. They actually despise the stories that they've been guarantors of. The thing is that those stories are a possibility of remembering because they are, in the fact that they have been around for hundreds of years, if not millennia. They hold in them something a little similar to our orthodox tradition. It's obviously not at the same level as the sacred tradition, but it is a form of tradition, a form of passing down, a form of remembering, right? The fairy tales exist in this kind of vague medieval world that is the world of the ancients, that is being brought back and being remembered today. Just in the same way that we remember the lives of the saints, all these martyrs in the early century, that we feel like we are connected to Them in our celebration, in our memory of them. This is an easy way to do it. And like I said, how then, to tell those stories in a way that's enlightening. Because in the past decade, the fairy tales have been told, but what's been happening in those fairy tales is that they've been told more and more cynically with this weird kind of perverse derision in the story. I think Shrek is the best example where basically you have this mishmash of fairy tales and the entire purpose of the story is to mock it and to turn it upside down. If you don't think that's true, it's actually contained right at the very beginning of the story, the very beginning of Shrek. I don't know if you remember how it starts. It's kind of a little vulgar. But Shrek goes into the outhouse and he opens up the fairy tale book and he rips the page out and he uses it to clean himself before he walks out. He basically wipes himself with the fairy tale. It's like, that's it. If you want. That's a beautiful, kind of beautiful, ugly little synthesis of all the storytelling that's been going on for the past 20, 20 years or maybe more, you know? And so you can see it, how this kind of cynical approach. And so. But it's cynicism, like I said, like revolution. At some point, it runs out. Because now we don't even remember why we cared enough about these stories to make fun of them. So now we're going to keep making fun of something, but we don't even know what the value of it is, is that we're making fun of. So now is the time to retell the story. And that's what excites me right now, to say, can we retell these stories in a way that is celebration? And I remember when I started studying the history of art and the history of culture, I remember reading authors who complained about Byzantine poetry. And they complained about it because they said, Byzantine poetry is only panegyric. Is Byzantine poetry is just celebration. It's so annoying. It's like everything about it is always celebrating something. It's like, you know, yeah, that's actually the point. It's actually the point of art. It's what, you know, all Asian cultures, that is mostly the way they understood art. They understood it as a celebration, as a memory, as a participation in stories that made us who we are. So can we do that again now? I think the answer is. I think it's exactly the right time to do that. We also noticed that the children's books have also been completely infected in every single way. You think this is a joke? This is not a joke. This is a real best selling children's book. And the progressives of the future A is for activists. All right, so now how do we do it in practice? This has been the thing that kind of I've been asking myself is how do we integrate it at every level? Not just you take a fairy tale, you tell it in a certain way. You tell it in a celebratory manner, not in a cynical way. You tell it in a way that hopes to be able to enlighten the reader. One of the things I like about modern, most postmodern action storytelling is that like in Shrek, for example, one of the things that's interesting about it is that they have a kid's reading and they have an adult reading. You notice that in the most popular kids movies they do that. They have like basically a way for the kids to view it and they have a way for the adults to. You, you know, sadly, the adult version is always like dirty jokes. Like, for some reason it's like. I guess that's what they think adults care about. It's just like some kind of sexual innuendo. But I thought that's actually a really interesting idea. Like, can't we tell the fairy tale in a way that the child is hearing a story that is just a beautiful, simple story that they enjoy, but the adult is going like, oh my goodness. That's giving me insight into why this story is a important. So that's the approach that we're trying to take to the fairy tales. Can we do it now in terms of visuals? One of my great projects of my life, one of my great fantasies is that I want to see Byzantine stylization in pop culture. I want to see the beauty of the icons, the beauty of the way that things are represented brought into pop culture. Not in a way that's sacrilegious, because that could happen. Like you could do it in a way that would be sacrilegious, but in a way that is perfectly adapted to the story and that points in memory and in participation back to the prototypes which are in the church. So we've been doing it for those who saw the Snow White book that is out there. We already had one pass at it and the artist, Heather Paulington, who, in the meantime, since she did Snow White and also obviously converted to Orthodoxy and then has now been taking classes learning Ivanagaram she's such an amazing artist, and she just picked it up, like, so fast. And so now in this new book that's coming out, Rapunzel, it's really like the next level. So I'm going to show you some of those images. That's how I'm going to finish this. I want to give you the very first glimpse at Rapunzel. We haven't showed these in to anyone before, and so I decided to show these to you for the first time. So the key that came to us and this, I think it was Heather that found that there's a Russian school of painting called the palette school of painting, that when the revolution in Russia happened and the icon painters weren't allowed to paint icons anymore, they were kind of like in trouble and they didn't know what to do. Like, how do we continue to live? How do you continue to make things? What they started doing is they started taking their skills and then applying them to secular subjects. And there's these amazing lacquered boxes that they would create and they would sell to visitors. Like, there was a whole market for these things where they. If you look carefully, you can see that the stylization, the way that the clothing is made, the way that the faces are made, the space, you know, is downstream, you could say, from icons. It's not exactly icons. There's something more fantastical about it. There's something that's looser, something that we would never dare do in, like, an icon. But the memory is there, right? The sense of participation, the sense of connection is there. Here are a few more images. So you can see that the use of space is very similar to the way that icons are painted. This kind of vertical space. Also the capacity to show several scenes simultaneously in the same image. These are actually like the type of visual representation that medieval Byzantine art developed is very sophisticated, actually. And so taking that sophisticated capacity to interspersed narrative and to create different spaces, this idea of showing the inside from the outside, creating architectural spaces, you see that also in icons, all of this kind of movement into images that are now fairy tale stories, that are folk stories, sometimes history, celebration of important figures. And so here is, of course, the Firebird. So you see this beautiful lacquered box of the Firebird. So we decided, let's try to take this style, but we're not. And this is important for all the artists here. Tradition is not pastiche. Tradition is not nostalgia. Those two things are different. The idea is not to simply repeat things from the past for the sake of repeating them. That is as dead as the revolutionary trope. The idea is to integrate the language. You learn the language, you integrate it, and then you apply it in a way that is appropriate to the moment, to the space, to the image, whether it's in music, whether it is in whatever. That is true living tradition, right? That is the souls of people being transmitted like this, the breath, the spirit of people being transmitted from one person to the other, you know, and so we thought. We also want. There's this beautiful 19th, early 19th century, early 20th century kind of medieval revival style that happened in the west, you know, these. This type of illustrations that have this medieval scent, but they're also taking into account realism. So here's an example of a Russian illustrator, Ivan Hiliven, who also is doing this image of the fiber. But you can see that it's far more modern, and it's actually integrated some elements of. Of modernism, like the influence of Japanese print, how it connects this kind of vertical space that Russian iconography had developed. And so we're like. We want to make something that is steeped in this type of imagery, but also has taken into account, let's say, modern illustration and modern sensibilities. And so here is our first image image. And so here is our witch who is holding. Is she holding. He's holding the Rapunzel. He's holding the cabinet in her hand. So if you look at the floor, like the way that the plants are made, the way that the smoke is made, right? If you were paying attention, you notice it's not the same. It has a kind of sense to it. If you look at the smoke around the horses, all of this type of integrating this imagery into the story. And in terms of the. Who here has read the Snow White. This is Snow White book that I wrote. And so one of the things. One of the insights that I had that I wanted to bring into this story is I realized that Snow White and Rapunzel are like opposites, right? And so Snow White, you have this queen, and there's a young woman who is coming in, coming to age, you become beautiful and desirable. And so in the story of Snow White, the queen is jealous, ejects the daughter from, sends her out into the wilderness to be the prey, to be danger, to be in danger, ultimately trying to kill her. And in Rapunzel, you have the same situation. This young girl becomes beautiful, becomes desirable. But now the witch puts her up in a tower, locks her in, prevents her from having access in order to protect her completely from the outside world so that she doesn't face the abuse that Snow White had to face or something like that. But you realize that it's kind of two abuses, you could say, two types of abuse, two extremes. Right? And so in our version, we have the queen in Snow White become the witch in Rapunzel, move in to see same character moving from one extreme to the other. And her story will continue in the fairy tale series. But it gives you an idea of what I mean by hoping to give people a little bit of insight into these stories. The story is still for like an 8 year old. Don't worry, just read it. Kids will be totally fine. I don't explain any of this in the story. No explanation. It's just a story. So here is another image of a hermit. And so for those who know orthodox art, you can see the way that we've done the stones, the way that Heather has done the stonework and the cave. All of these are tropes that we see. If you know, the icon of Elijah, for example, the icon of saints that are hiding in caves, he kind of moved towards this type of imagery. And what I love about her work is that you can clearly recognize obviously the iconographic sentiment, but there's also a kind of looseness and fluidity which is more akin to modern illustration. Like there's a kind of. There's an ink. There's a kind of ink pen, sealing ink brush, and a lighting that is a little more vivid, obviously, than what you would see in an icon. A little more. So you have the scene in the tower, you know, not also being afraid of exploring, having more fantastical imagery. But you've also. You've always seen this in icons or in where you have the sun and the moon as almost like. As kind of anthropologized characters. So we're bringing that in there as well. We have Rapunzel in the tower. I'm so excited about this. Like, every time I. I see them, like, can't believe, can't believe we're going to. We're going to publish this. It's so exciting. So I just want to give you a little hint of what it is that we're doing. But I would say the conclusion to the talk is that this the time. Like, now is the time. Like right now, right now is the. Is the time. There are opportunities galore now. Then it falls back on the people that want to do this. Because one of the problems that we've had in Christian art, especially in America, over the past decades, is a tolerance of mediocrity. Call it that you have the sense that, well, if you make things that are kind of Christian, we can accept that they are kind of boring, kind of mediocre, and we'll kind of tolerate that because we love Jesus, you know, but that is definitely the wrong way to go. Like, I think it's very opposite of what it should be, which is that we have the best stories, we have the best music, we have the best visuals, we have the best everything. We really have the Gesamskunstweach. We have the total. Not only that, we are in a moment right now, which, unlike the ancients, we have access to all of it from the first century until now. Like, you can look at images from the very first Christians all the way to today, but you can listen to music from the Middle Ages until now. You can. All of these things that we have a storehouse, the entire history is presented to us on a platter, you know, and despite that, so many artists are just lazy. Like, just lazy in the sense that they think again in this weird revolutionary nonsense, that they're going to take it out of their own soul if they're going to come out the creativity out of their own, like, imagination or whatever. That's nonsense. That's not the way it works. Like, it's."}
{"episode_id":"SW - #398 - 2025-06-30 - The Time for Orthodox Art is NOW","start":4100.12,"end":4100.52,"speaker":"Richard DeJournett","text":"It's."}
{"episode_id":"SW - #398 - 2025-06-30 - The Time for Orthodox Art is NOW","start":4100.52,"end":4390.77,"speaker":"Jonathan Pageau","text":"It's handed to you by the people, those that came before you, right? It's a treasure that's given and you have to dive into it. You have to study it, you have to learn it. You have to become an expert. An expert. If you're a painter, become a good painter. Learn to draw. Even if you paint icons, learn to draw. Folks like, learn to paint, learn to draw, learn the music, learn the skills. Become the best that you can be. Study the history, study art history, study the history of cinema, study the history of music, study the history of the things that you want to be involved with and know and know that there is a way to save it, there's a way to baptize these things, but that it doesn't just mean doing, means reconnecting it, remembering, bringing it back in a manner that will be a continuity and a manifestation of the memory of the true Gesamt Kunstberg, right, of the liturgy. So I don't know how to do it for all the arts. I have no idea. It's actually amazing time, because this is. You can. Everybody has the opportunity now to experiment that and to try to see how can I make Christian skateboards. Like, I don't know doesn't mean that you're going to have images. Don't put icons on skateboards. Don't do that. But is there something. If I make something, if I make an object and participate in the creation of an object, is there a way that I can make it beautiful and a kind of remembering of something, even if it is more on the consumer side, even if it is more on the passive entertainment side? Like I said, I'm not saying there's anything wrong with a little bit of that. It's part of the world. But if we can connect it back, that is the key. And it's an exciting time, too, because a lot of artists are converting. We have. We have Martin Shaw here. Martin Shaw is one of the best storytellers in the world. He is one of the best storytellers alive today. And he is now putting that skill to the service of Christ. He converted to Orthodoxy, I think, now, three years ago, and he is seeing how to adapt his capacity as a storyteller into the Christian world. But there are ways to learn from these people, the images here. This icon is from Father Silvan Giustiniano. If you don't know him, look him up if you want to be an iconographer. He is an example of someone that is deeply, deeply imbibed in the tradition of iconography, but also has a deep knowledge of Western art history, of illustration. Illustration. He has just soaked in it, right? He has soaked in the imagery. And now when he produces icons, he has a level of subtlety and a level of understanding of color that very few iconographers have. There are many more artists that I can name. If you haven't read Loris, read Loris. It's for sale here. It's an astounding novel, and it is exactly that. Like, is it exactly a attempt to take all the legends, all of these wild stories from the past and connect them in a manner that gives us a truly contemporary novel that isn't pastiche, that isn't nostalgia, that is truly. That defends its space in the world in front of art critics, in front of social commentators. But it is a fully orthodox work of art, and that's what's possible today. And that is what. I don't know which of you here has artistic inclinations, but I encourage you to do that for those that don't have artistic inclinations. You have to support the artists, you know, because artists need patrons one way or the other. Like, it's important. And it's important for all of you. Know, there's a lot of clergy here. You know, icon reproductions are cheap. I know that's tempting. Get those laser printed icons. It's really tempting. I get it. But if we want the life of the church, if you want the culture, if you want the art of the church to be alive, you have to support iconographers and everything downstream from that. So thank you everyone. Thank you for your time. If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase. So go to thesymbolicworld.com and thank you for your support."}
{"episode_id":"SW - #398 - 2025-06-30 - The Time for Orthodox Art is NOW","start":4391.41,"end":4450.72,"speaker":"Laura Diaz","text":"Tucson the Weight is Over Mediweight Loss they're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight so safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project. Ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweightloss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today."}
{"episode_id":"SW - #398 - 2025-06-30 - The Time for Orthodox Art is NOW","start":4450.72,"end":4519.81,"speaker":"Announcer","text":"That's mediweightloss.com looking for your next Go to Smoke Shop. Stop scrolling. I've got you. Headshop.com is the number one online smoke shop already trusted by over 100,000 happy smokers just like you. They've got it all. Dab rigs, vaporizers, glass bongs, smoking pipes, even THCA flour. All in one place. Need a new daily driver? Grab a smooth glass bong or a classic smoking pipe. More of a concentrate fan. Their dab rigs, E rigs and wax accessories are designed for smoother, harder hitting sessions. And yes, they've even got legal THC flower. Best part Part, every order ships fast and discreet, which is why thousands of smokers keep coming back. So don't waste time hopping between shops. Shop the best in dab rigs, vaporizers, glass bongs, smoking pipes, and thca flower right now@headshop.com the number one online smoke shop, headshop.com has what you need. Check it out today. Oh, and because you're listening right now, you get 10% off your next order when you use the coupon code HSHOP at checkout. Go to headshop.com now and smoke smarter."}
