{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":0.48,"end":36.22,"speaker":"Jonathan Pageau","text":"Hello, everybody. I'm really excited to be here with Deacon Enoch. Deacon Enoch is, of course, an Ethiopian Christian, Towedo Christian. He also has a YouTube channel called the Philosophy of Art and Science, so you can look that up and find him. He's also on the Ephesus Network where he is doing several things with different types of orthodox discussions and everything. So I'm really excited to have him on because we're going to talk. You know, people can't get enough of talking about Ethiopia and the particulars of their traditions. And so we're going to look, go into that together."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":47.98,"end":49.5,"speaker":"Dcn Enoch","text":"This is Jonathan Peugeot."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":49.9,"end":51.66,"speaker":"Announcer","text":"Welcome to the symbolic world."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":61.96,"end":64.36,"speaker":"Dcn Enoch","text":"Thank you so much, Jonathan, for having me on the program."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":64.52,"end":99.24,"speaker":"Jonathan Pageau","text":"Well, I'm really happy. You know, it's funny because when I noted I mentioned that on the podcast, I said, you know, I kind of said for people to reach out if they wanted to. I got so many messages suggesting you. And then I realized that even that before that I actually got messages from people suggesting you. Like the first time, the first moment we did the first video, I had people talking about you. But I get so many messages that sometimes it just becomes like noise that I don't. I can't totally pay attention to. But then when I. After I asked that, then I remembered, I said, I think. I think many people have been suggesting him for a long time."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":99.48,"end":149.54,"speaker":"Dcn Enoch","text":"It's so funny that you said that because I've gotten a few people to comment and they think if I just reach out that it'll happen. But the podcasting world, for people to know, behind the curtain, it doesn't always work like that, especially when you have a large following the way that you've said. And I've actually been following your work for years. And I know you were surprised that I had already known you from your breaking down of Kanye as the fool to watch out for the stuff you've done with Jordan Peterson and Father Andrew as well. I had been following your work, and I've been sharing your artwork on Twitter whenever you would post the cosmos and everything like that. So it's really great. And then when Richard reached out to me, it was funny because Richard and I were already Facebook friends, but he's kind of pseudonymous, anonymous. I didn't realize how many Facebook friends I had. Him and I were already friends on Facebook."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":150.05,"end":165.89,"speaker":"Jonathan Pageau","text":"That's funny. Yeah. So a nice confluence of things kind of coming together. So maybe tell us a little bit about yourself. I know you live in the US Maybe tell us a little bit about your. Your involvement in the Church and kind of the way that you see it also as an American. Ethiopian. American, yeah."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":165.89,"end":217.34,"speaker":"Dcn Enoch","text":"So I love the Anglo Saxon saying, but for the grace of God go I. And it's very true. My service, my ministry is sometimes inexplicable to people outside of, you know, the Holy Ghost or anything to that effect. I was, I am born and raised in Los Angeles, California and I am the son of two immigrants who came to America one year before the fall of Emperor Haile Selassie's regime, which if you go on the conservative estimate was about a 700 year Orthodox Christian monarchy. And depending on if you want to say it's continuous or not, some people like to throw the number 3,000 year regime, including in the early days pagan, but beginning in the 300-00 A.D. orthodox Christian kingdom."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":217.58,"end":223.1,"speaker":"Jonathan Pageau","text":"So according to the official records, it's one lineage all the way back to Solomon basically."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":223.58,"end":223.98,"speaker":"Dcn Enoch","text":"That."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":223.98,"end":239.02,"speaker":"Dcn Enoch","text":"That's right. And there are a lot of people, you know, depending on if you're a member of the symbolic world or if you're one of the academic historians, how you want to count it. But the most conservative estimate would bring it back to 1270 A.D. that's the."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":239.5,"end":252.04,"speaker":"Jonathan Pageau","text":"Which is really, even if it's 700 years, it might still be the old, like maybe except for like China, like you know how they had these super long dynasties or Japan or something. It's probably one of the oldest dynasties in the world."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":252.6,"end":429,"speaker":"Dcn Enoch","text":"It's super old. And I didn't realize a lot of these things until I was an adult because you know, part of it is, is trauma that people in my parents generation faced and part of it is things that they did. But basically their generation was involved with Marxist Leninism. Some of them would like to claim that all they wanted was feudal reform. And, and I mentioned this not delve to delve too much into politics because it's so much of what makes up my being and where I am. And so Ethiopia's pivotal moment was 1974 when communism took over and all the former institutions were shattered. And it wasn't that it happened in a day. It was kind of a long process of decades that also involved the west and not just Russia. And interestingly enough, we had ties with the tsarist Russia too. So it's funny that we had later ties with communist Russia. And so the elites were, a number of them were executed by the communist regime and another of them were drained from the country during a time period of like 20 to 30 years. And so my parents left right before all of that took off and Then a lot of their friends were in the midst of that. So I grew up in a milieu of all of these people who were Ethiopian elites drained from the country and then who were living abroad and just trying to focus and, you know, assimilate to American society. So I assimilated very well. Both of my parents were trained in British schools, so, you know, they knew English before they came to this country. But they also were very strict about me learning the Amharic language, which is the official language of Ethiopia. And for me, I was raised really nominally Christian. I was baptized. I went to all the high holidays, but I was never a Sunday Christian. And I went to various schools. I went to a Lutheran middle school. I went to a Church of Christ, which is part of the revivalist American tradition, 1800s college, which made me confront the idea of Christ. And so in adulthood, I came to the church, started off pouring holy water. They realized I spoke Amharic, so they made me sing, even though I couldn't really sing. So I became a chanter. Then they said, oh, he's. He knows how to teach. So they made me teach in English. Then the priest started having me sub for them teaching in Amharic at funerals and other services. And then they said, you know, it's really weird that we have this unordained guy that we call Mr. Enoch, and we can't just call him Mr. Enoch. So let's throw this deacon title on him. So I have a little bit of a windy path and a different path. You know, most people in the Ethiopian church become deacons between the ages of like 8 and 13. I became it at the canonical age in our tradition of 25. So it's been about five, six years. And it's been a great train. And I predominantly focus on, on scripture and liturgy, but I have a little bit of competency and knowledge of some other parts of the church as well."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":429.56,"end":438.12,"speaker":"Jonathan Pageau","text":"So are there formal trainings or did all kind of imbibed into, like, within the church? Like, do you take. Have you taken classes or is it just this?"}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":438.84,"end":466.65,"speaker":"Dcn Enoch","text":"So in Ethiopia, there are formal schools. There's the traditional school, it's called Abernet, which actually in Amharic means fatherhood, which is great. And it's, you know, if you think about it from the educational models in the United States, it would drive, you know, educators here insane, because what they do is, you know, I'll give you one example. The administrator of my church, who's a monk, he's a hieromunk, he left his house at age 10. And he decided wherever he wanted to."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":466.65,"end":467.89,"speaker":"Dcn Enoch","text":"Go throughout the whole country."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":468.53,"end":508.77,"speaker":"Dcn Enoch","text":"And you have one school of poetry, you have one school of the main liturgy, which is the Eucharistic liturgy. You have another school, which is the non Eucharistic liturgy. And then you have another school dedicated to Scripture and patristics. And he went to and fro, to whatever school he wanted without anyone watching him. And he was a deacon at age 10. At 22, he decides to be a monk. And basically, you know, he got all of his church education between 10 and 22. And you can say it's like a hyper humanities program with indigenous PhDs, but, you know, he couldn't do multiplication, you know, because they don't study even the basics of arithmetic. All they focus on are church teachings."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":509.01,"end":509.73,"speaker":"Jonathan Pageau","text":"It's amazing."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":509.73,"end":511.65,"speaker":"Dcn Enoch","text":"And so there are different school."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":511.73,"end":516.85,"speaker":"Jonathan Pageau","text":"So it's like you go to one school to learn one aspect. And the one that really fascinated me was poetry."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":517.65,"end":591.46,"speaker":"Dcn Enoch","text":"Poetry, yeah. So it's called Qini, which kani, and G', ez, which is the liturgical language and the language of the right. Qni means to submit. And so the idea is you create poetry that submits to the Lord and glorifies him, and then also the saints, through whom which he is glorious. And there are a million different categories. I don't even know them all. But the two main ones, the two most important, because they have to do with communion time. One is called kvri iti, which means she is honorable, referring to the time, which is the moment in which the communion descends and is being distributed to the people. And that is poetry that is reserved exclusively about Christ and christological themes. And then you have the. Which is like the. Something like the. I don't know the full translation, but something like the rising incense, where you're allowed to speak of the cloud of witnesses of all the saints to glorify God, which is after the beginning. Poetry is. So people study the poetry in advance. They're not allowed to write it down. They're supposed to memorize it. And then they perform it in the church one time, and then, you know, they move on from there."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":591.46,"end":593.9,"speaker":"Jonathan Pageau","text":"That's it. One time."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":594.33,"end":602.73,"speaker":"Dcn Enoch","text":"One time. So there's original Ge' EZ poetry being created by tens of thousands of clergy every day."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":602.89,"end":603.93,"speaker":"Jonathan Pageau","text":"That is amazing."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":603.93,"end":607.61,"speaker":"Dcn Enoch","text":"Whenever people tell me Ge' EZ is a dead language, I say, hogwash."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":608.25,"end":612.01,"speaker":"Jonathan Pageau","text":"That is astounding. And so they perform it during the liturgy."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":612.17,"end":640.19,"speaker":"Dcn Enoch","text":"They perform it every Sunday during the liturgy at. You know, there are three different types of parishes, let's say Small, medium and large. Every medium and large, definitely. Every large parish will do it. If it's a basic church where someone's not trained in the poetry, where all they do is the main function of the liturgy, they wouldn't perform it there. For example, at my church, we don't have a poetry master. We have a couple priests who studied it a little bit. So we do it only on the."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":640.19,"end":645.11,"speaker":"Jonathan Pageau","text":"High holidays, but have to take them longer to prepare. Like they'll prepare their poem and everything."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":645.51,"end":654.03,"speaker":"Dcn Enoch","text":"Exactly. But there's a master at a parish, for example, that a friend of mine attends in San Diego. They do it every Sunday, which is the tradition in Ethiopia."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":654.35,"end":660.87,"speaker":"Jonathan Pageau","text":"That's astounding. And so are there some poems that are so. That have been kind of so intense that people remember them?"}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":660.87,"end":732.75,"speaker":"Dcn Enoch","text":"Let's say yes, and they're written down. There's different books, like, where they'll say freilikawant, which means the fruit of the sages, or Yelikawant Kane, which is the poetry of the sages. And they'll write them down in famous books. Actually, the administrator of my church, who I mentioned to you earlier, he's unique in that he learned this poetry, although he didn't master it. He learned this poetry from a nun named Mahoj Galanis. And she herself was the student of her father, who was a master. It's rare for women to enter these fields, especially at the highest level, especially to become a master and then to be teaching all the boys coming up in the faith. But there's one famous one where I'm gonna butcher it. People could go to my channel, where a friend of mine who studied for about a year, two years, he performed it on my channel. But it's something to affect speaking about the digits of Christ. There are a few different layers to the poetry. One of the layers is that it has to hit a certain rhythm. Because it's not just read aloud, but it's poetry that's sung."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":732.75,"end":734.91,"speaker":"Jonathan Pageau","text":"It's chanted, basically chanted."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":734.91,"end":743.15,"speaker":"Dcn Enoch","text":"So it has to meet the rhythm and the melody of the chanting. And then it has to have a basic meaning known as the wax."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":743.37,"end":743.53,"speaker":"Dcn Enoch","text":"And."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":743.84,"end":788.48,"speaker":"Dcn Enoch","text":"And then underneath the wax is the gold, which is supposed to be the christological meaning or whatever other religious meaning. And so there's a saying about how the thumb is greater than the other fingers. And how both Jesus and Nicodemus were rabbis, but they weren't the same type of rabbi. Jesus was the thumb and Nicodemus was one of the other digits. So the same way in which the Thumb guides the. The other fingers separating us from other creatures. Jesus is separated from Nicodemus. That's like one example of something they would do. And they would, you know, they would yell it. One person would yell it in Ge', ez, and then the person would. Other person would stand in front of them and would sing it before the congregation."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":788.48,"end":794.4,"speaker":"Jonathan Pageau","text":"Oh, okay. So the person performing will have a chanter, will then redo it, will actually sing it."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":794.8,"end":818.68,"speaker":"Dcn Enoch","text":"Yes. And usually the person who is speaking it is usually more learned than the person who's just singing it, because the fundamental basic levels are just repeating, like you said, famous poems of the sages or of the scholars and then singing it, singing these famous lines, whereas the actual construction of the original poetry will take a while."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":818.84,"end":877.09,"speaker":"Jonathan Pageau","text":"Yeah. That's amazing. That's astounding. I mean, I'm sure there's so many things like that that people don't know about that are just like an entire tradition of poetry that's recited one time in church. We have nothing like that. I mean, one of the things people complain about in the Orthodox Church and the Greek Russian church is the stifling. A little bit of the stifling of hypnography, where we feel like there isn't a lot of room for modern day poets or modern day people to kind of enter into the tradition and participate in this pattern of glorification and rising up the saints and rising up God. But, you know, but your tradition seems to have this balance of, you know, the normal liturgy. But then at each liturgy there is a moment where. But. And it's not just like kind of, I don't want to be insulting, but it's not like just like improvised hands in the air, you know, screaming a thing. It's an actual form that has pattern. And everybody recognizes as this poetry tradition. It's just astounding to me. Yeah."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":877.09,"end":889.94,"speaker":"Dcn Enoch","text":"And they're recognized usually as the most intelligent people. And usually they will not let you study scripture or patristics unless you've spent one to two years in the poetry school. Like that's a requirement at many of the scripture and patristic schools."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":890.1,"end":939.73,"speaker":"Jonathan Pageau","text":"Yeah, you wish they had that here, all those Bible scholars, that they could just study poetry. We'd get a lot of less. Like a lot of lot less critical historical nonsense that we get that we get now. So I have a big question for you. This is my big question, because I'll be honest with you. I think that both Richard and I, when we did the three episodes on Ethiopia, we were obviously a little Nervous because we're talking about something which in a way, is very far from us. And we're also talking about how when we look at Ethiopia and the tradition, the Christian traditions, and because it's related to the Ark and all of that, you've heard them. We talk about the stories and everything that's kind of this. Extremes going into extremes. And so my question from the beginning was, how would someone who lives in the church and worshiped in the church, how would they interpret the way that we saw it?"}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":940.6,"end":978.13,"speaker":"Dcn Enoch","text":"Well, I will tell you I'm biased in a little bit, but I'll tell you all the sides of it. And my bias is that while I am firmly rooted in the church, and, you know, I mean, my father's side of the family are basically Levites, you know, several generations of clergy, even though it skipped his generation. I grew up in the west, and so I have, you know, a native fluency in the Amharic language, intermediate knowledge of Ge', EZ and I've been serving in the church over a decade. However, there are still some parts of me which are Western. So one example I can give you."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":978.37,"end":1142.86,"speaker":"Dcn Enoch","text":"Is that any sort of deep conversation about the Ark begins to make Ethiopian Orthodox nervous. It's almost as if the mystery is cheapened whenever you talk about it. And so you'll see, I think, another aspect that's unique about Ethiopia, everyone has kind of like holy drapes or holy clothing and covers that you put on items. The Ethiopian Church, almost to the point of, like, secrecy or Gnosticism, hides everything. One thing I could tell you is we're in communion with the Comte and the Copts, have their clergy commune and finish the rest of communion in front of the entire audience. Without getting too specific to freak out the Ethiopians, I'll say the Ethiopians don't do that. And yet we're in communion. So there's something hidden there where nobody sees the clergy taking communion in our tradition. And it's like the Ark. There's very few things spoken about it. My bishop, actually, who's the bishop of Southern California, beginning in the 90s, began preaching explicitly, telling people what's physically written on all of the tablets. And a lot of people freaked out. But it's absolutely normal in terms of the elites who have always known this information. It's just this balance of, is this information only for the elites, or are we on YouTube now and hundreds of thousands of people will be hearing about it and talking about it? But I think both of you were extremely respectful. I told you before, we kind of hopped on. I have two kind of minor, maybe three minor points of contention, but overwhelmingly you were doing it from a place of love. And I think both of you were very well researched. The idea, on a serious note, of the extreme edge and the inclusion of the outsider, I mean, the Gentile par excellence. It's like it's not just a Gentile, but a dark skinned Gentile. Like that's what Ethiopia is always in scripture and the arc language that you all used as the container. I think it's going to be very informative for the English speaking Ethiopian world, for the diaspora, Ethiopian Orthodox. I think it's going to be very enlightening and illuminating as well. Like the whole Monster on the Lake story that you told, the fact that you asked the guide and he was reluctant and then he talked about that. I was crying on my way to work while I was listening to that episode because it's so true that some of the more secular tour guides wouldn't want to talk about that because they think something like that is embarrassing. But a Sabbath honoring monster is definitely noteworthy."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":1143.02,"end":1260.61,"speaker":"Jonathan Pageau","text":"Yeah, it's definitely. It was to me. It was like, I felt like I was in a. Like I was in a fairy tale. I was happy about it. I was like, I feel like I'm in a world of magic, you know, I mean, there are so many. When I was in Ethiopia, there were so many kind of magical moments. My guy knew the old guardian of the art, you know, because there's the one that was actually serving and then there was the one who was kind of retired but couldn't leave the precinct. And so he said, you know, would you want to meet him? And I was like, yeah, of course I want to meet him. Like, how can you even ask that? So he's like, okay. He's like, I just want to tell you, we'll go there, you know, I'll knock on the door, I'll tell you if he wants to meet you. But he said, don't ask him about the art because he's sick of hearing about that. Like, just don't ask him about that. And so I'm like, okay, cool. So we go there, he goes down, you know, it's like another door on the side, down at the bottom of the building. And he knocks and he talks to the guy. And then I see him come out, this old man covered in his cloth. And I mean, I don't know what to do. I just kind of smile and say hello and just kind of bow a little bit. And then he asked me, he says, is there something you want me to bless? And I was like, oh. And so I realized, I remembered that I had brought one of my very early carved icons. Like when I was in Africa, I was living in Kenya. I carve this little icon. So I'm like, yeah, I have this icon in my bag. So I go in my bag, I take on my icon. So imagine, like I have one of my very first icons that I carved. I hand it to him, he looks at it and my guide was interpreting for me and he says, oh, it's modern. Like, only an Ethiopian man could look at one of my icons and say, like, oh, it's a, it's a, it's very modern. Like, it's very, you know, it's not very traditional. So he, he, so he looks at it and he says words actually that I can't understand. And he spits on it several times, kind of spits and says and says the words and gave it back to me. And so I still have it. Obviously I'm going to keep it forever. I'm never going to get rid of that icon. It was one of those amazing. Yeah, there's just these kind of amazing, magical moments that I had in Ethiopia. So have you been to Ethiopia? Have you traveled?"}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":1260.85,"end":1370.69,"speaker":"Dcn Enoch","text":"Yes, I've been. I don't know exactly how many times, but something like 12 times. If you add them all up, it'll probably be two years, but it's one month, three weeks, two months at a time. Throughout my childhood. It's been a decade since I've been. But throughout my childhood I went every other year. And that's, I think, what strengthened my ties to Ethiopia. One of the things I left out of my short bio in the beginning is that with the fall of the regime in Ethiopia, the last vestige of this 3000 year dynasty is the Ethiopian Orthodox Church. It is the only thing that is still standing that preserves that. And so my parents weren't very outwardly pious. I would say they were inwardly pious in the way Jesus often would recommend throughout, for example, the Gospel of Matthew, the sort of Sermon on the Mount Life of not doing things for people, but doing things behind closed doors. And like I said, they kept the structure of it for me, but they never imposed it upon me. And it was really a love of Ethiopia, just being a proud Ethiopian that made me assess the situation and realize that the strongest institute of Ethiopia is the Ethiopian Orthodox Church. So going back home, I mean, you see that, like, I didn't grow up in the church, so I remember one of my earliest memories is being in Ethiopia at my grandparents house, both of whom lived on the same street. My grandparents had passed away the fathers, but the mothers were there and the priests would come to your house randomly, you'd feed them and you know, they do the house blessing. So he's doing the house blessing and he puts the holy water on my face. But you know, it's a little forceful because they expect you to, to have, you know, the cultural competency that I did not have."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":1371.01,"end":1373.33,"speaker":"Jonathan Pageau","text":"They know what to do. Like you didn't know what to do yet."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":1373.33,"end":1399.14,"speaker":"Dcn Enoch","text":"I had no. I walked up to my mother, I think I was about 10 or 20, 12 years old, and I said, if that guy comes and throws water on my face one more time, I'm going to beat him up. So you better warn him, you know, and to go from that to, you know, where I am now, where I have that, that understanding that that's a blessing, because again, none of it was explained. It just like assumed that everyone knows, you know, what's, what's going on. And especially diaspora kids do not always know."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":1400.42,"end":1427.81,"speaker":"Jonathan Pageau","text":"So one of the questions I have too is for example, in the west and in the Greek Russian world, the Eastern Orthodox world are there we have patron saints, right? So we have the saints, but the saints are also end up being localized somehow. But also localized, like parishes are named after saints. And we have a sense in which also people take on the names of saints and have their own kind of personal patron saint. So is that a tradition which Ethiopians also have?"}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":1429.11,"end":1478.64,"speaker":"Dcn Enoch","text":"So one of the minor points of contention is something that a lot of British writers have written about. And you know, it's really helpless. But the most recent biology has shown that we are not Sabaean. So they compared our DNA to Saudis to Yemeni, to Levantine to Egyptians to Sudanese. I mean, they're really trying to find the quote, unquote non African component. Everyone comes from Africa, but you know, all of Eurasia left Africa 60,000 years ago. So the quote unquote non African part of Ethiopians, particularly the Amhara, which is, you know, the ruling class for this time period we're talking about, is found to be closest actually to the Minoan civilization and to Tunisian Jews."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":1479.45,"end":1479.85,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":1480.49,"end":1621.56,"speaker":"Dcn Enoch","text":"And so that part of the biology I think goes to the hybridity that a lot of you were talking about. And so, you know, the patron saint culture in the west or you know, in the east, if we could call you the east and US Network, as you all joked about in the east and the west versus the orientation is this predominantly, I think, more individualized society. And us being this hybrid of, you know, Tunisian Jew, Minoan adjacent, which is our Eurasian side, has this individual component, but we also have our East African side, which is more communal. And so the patron saints are more regional than they are individual. I don't know of anyone who really has an individual patron saint. And there's no real formal process, although some people may do that, but there are certain institutions. I would say the capital city is a little different, but historic Ethiopia in the various regions would venerate the saint that's from their region who ends up in their region. You mentioned Abbo or Gabraman Fascardus, who's the saint who let the bird drink out of his eye. He's considered an Egyptian, but he is particularly, for example, not venerated in this region called Gwadjam, because in his story it is said that the evil eye was found there. So those people don't like to have him as a patron saint. Whether you go there from. Not Taklahaimanot, who's the one with wings that you mentioned, like the seraph, he is from a region called Shoah. And so while he is, because of other political reasons, also venerated in Egypt and in Eritrea and other places, the main place where he's venerated is a region called Shoah, which is where he's from. Aragawi, another saint whom you mentioned, one of the nine Greco, Syrian or so called Roman, you know, Eastern Roman, Rumi saints, he was, you know, Greco Roman, you know, like. But where he landed is modern Tigray. And so the region of Tigray and parts of Eritrea, modern Eritrea, is where."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":1621.56,"end":1692.99,"speaker":"Dcn Enoch","text":"He'S venerated the most. So it's super regional. In addition to that, like I said, if you live in the capital city, maybe your patron saint is whatever church, parish you grew up at, where the capital city would be different than the other historic regions. Another thing we have, I don't know if you have this tradition. It's called the. Which is the cup fellowship. So people will choose. You guys joked about, you know, how we, a medieval emperor introduced monthly holidays in addition to the biannual ones. So these cup fellowships will meet every month for the holiday of whatever saint they choose. And it's up to this group to decide. It could be two people, it could be 15 people, it could be 30 people. And what they do is they feed the poor in the name of this saint and then they feed themselves and they act as a sort of mutual aid program as well for each other. If there's a wedding or a graduation or a funeral, they cover each other's expenses as well, all in the name of this saint. And so in that sense, it's like a regional patron saint and then these small cup fellowship patron saints. But other than that, there's no real individual patron saints in the tradition."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":1693.15,"end":1724.13,"speaker":"Jonathan Pageau","text":"But the way you describe it, it seems like it's very embodied, like, especially in these cup fellowships, where people will actually kind of, let's say, see themselves as a. As a communion of love, where they help each other and they kind of support each other in the. Under the guise of a particular saint, obviously, ultimately under the guise of Christ, but kind of through the patronage of a particular saint. So, I mean, that's very interesting because it sounds like it's also a kind of social net. Like a kind of social net to help. To help palliate for tragedy and for suffering."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":1724.37,"end":1738.83,"speaker":"Dcn Enoch","text":"I gave you the idealized version. You know, sometimes that institution breaks down sometimes, and it's only a social event, you know, but. But when it is good, it's a charitable organization that also takes care of the people within and without."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":1739.55,"end":1766.9,"speaker":"Jonathan Pageau","text":"Interesting. Definitely. And so one of the things we didn't talk about, but I wanted you to maybe explain a little bit or talk more about, is that, for example, it seems like we have Christmas, right? We have the Feast of Nativity, but it seems. My perception is that Ethiopian Christians, they have tin cat, they have the feast of the baptism of Christ, but you don't so much have Feast of Nativity. Or do you have the Feast of Nativity?"}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":1766.9,"end":1768.1,"speaker":"Dcn Enoch","text":"Oh, we have the Feast of Nativity."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":1768.1,"end":1768.78,"speaker":"Jonathan Pageau","text":"Okay. All right."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":1768.78,"end":1769.22,"speaker":"Dcn Enoch","text":"Huge."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":1769.3,"end":1770.18,"speaker":"Jonathan Pageau","text":"It's huge."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":1770.74,"end":1775.34,"speaker":"Dcn Enoch","text":"Particularly in an area called Lalibela, where the monolithic churches are. I don't know if you had a chance."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":1775.34,"end":1777.3,"speaker":"Jonathan Pageau","text":"Yes, yeah, of course. I went to Lalibela."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":1777.46,"end":1777.94,"speaker":"Dcn Enoch","text":"Yeah."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":1778.5,"end":1785.94,"speaker":"Dcn Enoch","text":"That is Christmas. And they say Christmas in Lalibelat in Gunder or Epiphany, Theophany in Guander, and."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":1786.1,"end":1796.28,"speaker":"Jonathan Pageau","text":"Oh, right. Okay. So Nativity there, and then you go to Epiphany or Theophany in Gondor. Yeah, yeah. Well, that's where they have the big, huge pool in Gondor. Right. Where everybody jumps in."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":1796.52,"end":1814.92,"speaker":"Dcn Enoch","text":"And an aside for my Tolkien fans in the audience, I still stipulate, although I think people will contradict me, that I think both Roja and Gundar were named after Tolkien's knowledge of Ethiopia, because there's a city called Roja in Ethiopia, which is the old name of Lalibela before it was named Lalibela."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":1814.92,"end":1815.24,"speaker":"Jonathan Pageau","text":"Really."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":1815.24,"end":1827.25,"speaker":"Dcn Enoch","text":"And then you have the city of Gwendar. And these are the two cities that we're talking about. And those are the two human city states in Lord of the Rings. Right. Those are real places in Ethiopia. And I think that's too much of a coincidence."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":1827.33,"end":1837.85,"speaker":"Jonathan Pageau","text":"Yeah, well, for sure, for sure. Gondor. I remember hearing when I saw the name, I thought, well, this is way too close. This is way too close to Lord of the Rings. There's got to be some kind of."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":1837.85,"end":1839.49,"speaker":"Dcn Enoch","text":"Alibela is called Roja."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":1841.09,"end":1846.05,"speaker":"Jonathan Pageau","text":"Yeah, interesting. So there is. So people celebrate Nativity in Lalibela."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":1846.05,"end":1850.24,"speaker":"Dcn Enoch","text":"People celebrate Nativity and typically nativity is that period."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":1850.24,"end":1919.21,"speaker":"Dcn Enoch","text":"Each season of the calendar has its own name. That period is called Zemna Asterio, which means the era of revelation or being made clear or manifestation. And so Christmas is usually thought of as being celebrated with epiphany theophany at the baptism of Christ. That whole season is considered one season and people are. The hymnography of the church is the same. You sing baptism and Christmas songs like every day throughout that. I don't know the exact period. It's like two weeks or something. And of course there's a fast right before Christmas and there's a one day fast that sounds like a 30, 40 day fast. It's called the fast of the Prophets. And then there's like a one day fast usually in the middle of epiphany theophany celebration. And there's a monthly Mary holiday during that time too. And they call it like the manifestation Mary holiday. And then people usually think it has to do with the manifestation of Mary, but no, it's actually manifestation of Christ. But it's the merry holiday that lands within that period of the church cycle."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":1919.37,"end":1966.51,"speaker":"Jonathan Pageau","text":"Yeah, that symbolism, I think it's still there. We still have it in our churches. But it seems like it's very strong in your tradition, the idea of understanding the Incarnation and also the baptism in all this imagery of light. Right. As this kind of shining forth of the revelation of Christ. And so I think that that's just. It's a very powerful symbolism, especially for people today as we kind of, we come back to the story of Christ and the way that I'm trying to help people understand it, that it's the pattern of reality. Right. It's just a story. And so the idea of the incarnation is being this light which actually shines upon creation and helps us see it in its property form and helps us see, you know, what everything is kind of moving towards what the reason for all of this is ultimately something very."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":1966.51,"end":1971.83,"speaker":"Dcn Enoch","text":"Apply it to your tradition. There's something called Timur Tahubuat, which is the hidden teaching."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":1972.15,"end":1994.51,"speaker":"Dcn Enoch","text":"And it's one of these extra biblical writings which are performed. You know, there's a interpretation of it, but then there's also the text itself. And a friend of mine who studied it intensely has told me it's closest in the. In the Greek Orthodox communion to the mystagogy. And that's one of the things said both at Christmas and at the baptism of Christ or theophany."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":1994.51,"end":1997.11,"speaker":"Jonathan Pageau","text":"Okay, interesting. So it's called the hidden teaching, basically."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":1997.11,"end":2006.83,"speaker":"Dcn Enoch","text":"Yeah, it's called the hidden teaching. That's the name for it. But it's related to the mystagogy in the Greek."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2007.07,"end":2049.39,"speaker":"Jonathan Pageau","text":"Yeah, well, I mean, you see these, the mystic ideas, you'll also see them different mystic ideas as exactly kind of revealing the secret of what Christ is basically. You know, it's almost as if now for us it's become so tame to say something like he's God incarnate. Like as if that's not a big deal. It's not the most crazy, the craziest thing you've ever heard, especially that he dies on a cross. Right. It's like all these things are so. Are so mysterious that to remember how even in the early centuries they almost had to whisper it or they had to wait until people were baptized before they revealed like the fact that we're eating his flesh and blood. Like, you know, it was very. It's almost like you can't just say this out loud or else, you know, they're going to kill you."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2049.71,"end":2051.15,"speaker":"Dcn Enoch","text":"The catechumens must depart."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2051.63,"end":2081.33,"speaker":"Jonathan Pageau","text":"Exactly. The catechumens must depart. So one of the big questions I have is the man, like, is the kind of mystery of Lalibela. And so for people who don't know Lalibela is you've seen, everybody's seen pictures of them. But these rock dog churches that are kind of network together in the city of Lalibela. And so how do you. What is the function of Lalibela? Let's say, like what, liturgically, theologically, historically, what is it? What is the function of it?"}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2081.41,"end":2095.61,"speaker":"Dcn Enoch","text":"Well, I first, because of the History Channel, have to say it's not aliens. I have to first say that that Greek guy, he's. The fact that he's Greek, I'm like, come on, man, you got Orthodox in your family, at least you should know. He attributes it to aliens, but he agrees with Lalibela."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2095.61,"end":2096.77,"speaker":"Jonathan Pageau","text":"To aliens. Yes."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2097.17,"end":2190.82,"speaker":"Dcn Enoch","text":"On the History Channel, of all places. Because it couldn't be angels and humans in collaboration, which is what the Ethiopian story is, which is much more beautiful. And the story of Lalibela goes back to what I was saying earlier about people who nitpick at the 3000 year history of Ethiopia. So there's a clear start of a specific dynasty in 1270 AD and the dispute is whether that is a restoration or something totally new. And the reason why that dispute exists in the first place is because Aksum as we know it, the great ancient civilization, runs from about 180 to 300 A.D. pagan, and then 300 A.D. to about 900 A.D. as an Orthodox Christian kingdom. And that regime falls and is replaced by something called the Zagwe dynasty. And the typical Zagwe story is that they are descendants of the ministers of the Queen of Sheba, who intermingled with the ministers of King Solomon. So not directly of Solomon and Sheba, but of the ministers and all those people. And so that regime lasted about 200, 300 years from around 900 AD to 1270 AD when it fell. And that was the kind of interlude. And then whether Aksum and 1270 are connected, that's for different people to have their opinions on."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2191.38,"end":2196.26,"speaker":"Jonathan Pageau","text":"People say that in 1270 it was a restoration of Solomonic dynasty. That happened. Basically."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2196.34,"end":2207.63,"speaker":"Dcn Enoch","text":"That's the Solomon tradition. That's the tradition. And part of the historical tension is that pretty much all the information we have is from that Solomonic dynasty."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2207.95,"end":2211.39,"speaker":"Jonathan Pageau","text":"Yeah. So people say it's biased. It's. Yeah, that it's tendentious."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2212.19,"end":2222.43,"speaker":"Dcn Enoch","text":"And I have my good friend who knows about the hidden teaching. He's a big fan of that Zagwe dynasty, that intermediary 300 years. It's kind of."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2223.23,"end":2224.91,"speaker":"Dcn Enoch","text":"There's a very specific."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2225.39,"end":2236.84,"speaker":"Dcn Enoch","text":"The Ethiopian church is an amalgamation of three things of Antioch, of Alexandria and of itself, of Aksum. And we always have the Aksum element."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2237,"end":2256.02,"speaker":"Dcn Enoch","text":"But the Coptic element. Sometimes when people paint the story, it's like, oh, we were coptic till the 1950s. They don't realize that that Coptic connection was very feeble. And there's little historic evidence for it for sometimes like a thousand years. You know, sometimes they are said to have said a Muslim to be our archbishop."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2256.02,"end":2256.34,"speaker":"Jonathan Pageau","text":"Really?"}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2256.74,"end":2314.57,"speaker":"Dcn Enoch","text":"Yeah. Sometimes it goes 23 years, 100 years without sending a bishop. And people are like, well, what happened in those intermediary years? Well, what happened is Antioch is still right there. And there are some stories, sometimes in the 1200s, sometimes in 10, like a thousand A.D. where sometimes they say at one moment there were a hundred Syrian bishops. And it's like, why were there a hundred Syrian bishops? What were they doing there? You know, what was going on? My friend also believes that sometimes the Archimandrites that people describe as Archimandrites may have acted as sort of indigenous bishops in these intermediate years. There's a lot of lack of clarity. But anyway, all this is context for Lalibela or Roja, in which case that period, including Lalibela, who's a king, are a series of like four or five priest kings. Kings. And so they're both priests in the Ethiopian Orthodox Church, and they're also kings and emperors of all of Ethiopia."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2314.73,"end":2315.93,"speaker":"Jonathan Pageau","text":"So when is this again?"}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2316.73,"end":2319.13,"speaker":"Dcn Enoch","text":"Between 900 and 1270."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2320.25,"end":2327.61,"speaker":"Jonathan Pageau","text":"Okay. So that's. I'm sorry to say, but that's, you know, the legend of Prester John. Do you know about. Yes, that sounds exactly like. That's just what it is."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2327.77,"end":2329.25,"speaker":"Dcn Enoch","text":"That's like their kings."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2329.25,"end":2329.77,"speaker":"Jonathan Pageau","text":"Oh, my goodness."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2329.77,"end":2375.61,"speaker":"Dcn Enoch","text":"Yeah, that's. And that's what they were. That's what they were. And, you know, most kings grew up in monasteries to hide them so that they don't get slaughtered as potential claimants to the throne. But, you know, some of them leave when they're eight, some leave when they're 15. There are various accounts. I spoke recently about Emperor Theodoros, who's one of Emperor Theodore, one of the famous, very famous, uniting Ethiopian kings of the 1800s. And one of the most pivotal moments in his life is he was raised in a monastery, and at one point he's like 12 or 15. I forget his exact age. Marauders come and slaughter everyone in the monastery. And this is like, this is not a hagiography. This is the guy's chronicle. And he's the sole survivor."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2375.61,"end":2376.33,"speaker":"Jonathan Pageau","text":"Oh, my goodness."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2376.57,"end":2386.45,"speaker":"Dcn Enoch","text":"And so he became a little bit of a political realist after that. He still had the Lord's name on his lips, but some of his actions, people thought of him as a brutal."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2386.45,"end":2389.93,"speaker":"Jonathan Pageau","text":"Guy, but he was a little traumatized. Slightly traumatized. Ptsd."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2391.66,"end":2421.47,"speaker":"Dcn Enoch","text":"Imagine you live in a monastery and that happens to you. But so anyway, King Lalibela at this time, I think it also kind of coincides with the rise of Islam. And at various points, Ethiopia controls kind of modern day Yemen, parts of India, and that whole Red Sea route through which we saw in the past year in modern times that, you know, if the Suez Canal is blocked, people got to go all the way around Africa. And you have to realize Ethiopia ruled."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2421.47,"end":2424.03,"speaker":"Jonathan Pageau","text":"That, controlled that seaway."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2424.27,"end":2457.95,"speaker":"Dcn Enoch","text":"And so that 900 to 1200 is the receding period where the empire contracts and it's more local. And so the trade routes we had been pilgrimaging since early on, I don't know, 4th century, 5th century, to Jerusalem. Some people say that the Armenian Alphabet was made by an Armenian monk or priest who met up with an Ethiopian one in Jerusalem and used. Because they have an Indo European language of its own branch. They used the script from the Ethiopians, but they had totally different sounds."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2458.27,"end":2465.87,"speaker":"Jonathan Pageau","text":"Really? I'd never heard that before. So they would think that Ge', ez, like, the Ge' EZ script is what influenced Armenian script."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2466.11,"end":2469.23,"speaker":"Dcn Enoch","text":"Absolutely. And look at the Armenian script and look at the Ethiopian one."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2469.31,"end":2476.84,"speaker":"Jonathan Pageau","text":"Now that you say it. Now that you say it, I'm like. I mean, not an expert, but now that you say it, I'm like, they're a lot more like that than ours. That's for sure."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2477.32,"end":2526.98,"speaker":"Dcn Enoch","text":"Yeah. And Armenia is in our communion as well. But so these trade routes to Jerusalem, which had been around for centuries, get blocked because of the rise of Islam and the changing geopolitics. And so King Lalibela, who's also a priest, Father Lalibela as well, and a saint in the church, he decides to create a new Jerusalem, which is not to be confused, you know, with the heavenly Jerusalem, but a new kind of physical Jerusalem in Ethiopia, so that people don't have to pilgrimage to Jerusalem anymore because those trade routes were cut off due to geopolitics. And so that's what that whole Lalibela enterprise of the series. The main church is Giorgis, or George and St. George, and then there are several other churches around it built out of that monolithic structure."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2527.77,"end":2540.49,"speaker":"Jonathan Pageau","text":"And so. Yeah, so the idea would be that it's like. It's. Is it. But does it map onto Jerusalem? Like, is there. Some people tried to kind of find analogies between the actual city of Jerusalem and La Libela."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2540.49,"end":2542.89,"speaker":"Dcn Enoch","text":"Or you'll find, like, engravings of the."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2542.89,"end":2545.77,"speaker":"Dcn Enoch","text":"Star of David and for that matter."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2546.81,"end":2553.34,"speaker":"Dcn Enoch","text":"Imagery that later gets associated with a particular German regime. But that also is a much more ancient, simple."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2553.34,"end":2554.14,"speaker":"Dcn Enoch","text":"We won't get the."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2554.14,"end":2587.48,"speaker":"Jonathan Pageau","text":"Yeah. When Lalibela, I saw the craziest things I've ever seen, which is crusader crosses. And like you said, you see Stars of David with crosses in them. And. And like. And so that's. I mean, it's. You feel like you're looking at this puzzle that you can't completely understand because, you know, some of those crosses definitely look like hospital. Hospital. Or. Hospital. Hospital or crosses. And so I was like, man, there were people crossing. A lot of people came through here and the crossing of influences and the discussions must have been pretty vivid."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2587.88,"end":2588.36,"speaker":"Dcn Enoch","text":"Yeah."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2589.56,"end":2597.8,"speaker":"Dcn Enoch","text":"What people don't understand about the empire is the way in which it was extremely exclusive, but also inclusive."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2598.04,"end":2702.81,"speaker":"Dcn Enoch","text":"And you and Richard talked about the biblical canon and how open it is, and people got to know it's the west that has a closed canon. The Greek communion and our communion, the Afro Asiatic communion, have technically open canons. So at any moment the Holy synods could decide to add books to the Bible. And you know, that's their right. You know, that's their apostolic right. But in any event, you know, we just got books and writings from everywhere. One of the things from our monastic tradition, which I always point out to people, is that we have Aragawi Manfasawi, who's a different Aragawi, the spiritual elder, who I think his name is John Saba. And then we also have Marisaq, who is Isaac the Syrian. And these are two of the three. This is 2/3 of what we call the book of monks that every monk is supposed to read in our tradition. And they're post Chalcedonian members of the Church of the east, which only affirms the first two councils. And I know Isaac the Syrian is venerated in your tradition as well, and I often point to that as like, it's not even like one book. It's the majority of the monastic tradition. The texts they have to read are from the Church of the East. And you also talked about this liturgical rite that includes on Good Friday, the thief on the right. Well, we have that as well, and we actually have the expanded version. There's a whole play I've seen on YouTube of the Syriac version, which is like 15 minutes. Minutes. Our version is like an hour. And it's. It's really hilarious. You know, the cherub berates, the thief, is like, you're unworthy, you're wicked, you know, you're ugly. You know, who are you to come here before that and all this?"}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2702.81,"end":2710.29,"speaker":"Jonathan Pageau","text":"But eventually, you know, he gets in. Wait, so these are like. These are what, like kind of liturgical plays or kind of."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2710.37,"end":2729.68,"speaker":"Dcn Enoch","text":"Yes, it's a liturgical. So that one, the thief or the outlaw on the right, that's performed by the clergy on Good Friday. But the monastic books are just sort of writings that are supposed to be studied by all monks. And so we have John Saba, the spiritual elder, and we also have Isaac the Syrian."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2729.68,"end":2756.45,"speaker":"Jonathan Pageau","text":"Yeah, because Isaac the Syrian, how can anybody deny it? Like, he's so amazing. Like what he says is such pure gold that that's why I feel like, even if, even if for us, like in, maybe in practice, he was supposedly a heretic, like he says, nothing heretical. And he's so inspired that I think it just kind of. How can I say that? It soothes over whatever distinctions existed, you know?"}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2756.45,"end":2757.05,"speaker":"Dcn Enoch","text":"Absolutely."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2757.05,"end":2821.58,"speaker":"Dcn Enoch","text":"And I'll point if there are people, you know, who are in your audience, in your tradition, I'll point you to the book on Isaac the Syrian by Metropolitan Hilarion, which is a fantastic book. And it talks about how him, along with one of the Gregory's. I always get them confused. They get into this that all should be saved. And that is considered officially in the Orthodox Church a heresy. But he explains why he's thinking in that way. And that minor thing doesn't take away all of the great spiritual advice on silence, on how to read the Psalms. One of the pieces of advice he gives is that the way you should pray is you begin by reading the Psalms and you don't say, oh, I'm going to do a chapter a day or a million chapters a day. You just begin reading. And then when your body collapses, that's when you stop, you know. And that's what he says for you. If that's a sentence, good, that's your two year spiritual benefit. But if it's three chapters for you, then so be it. And if you do the Psalter all night, also, so be it."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2821.9,"end":2829.9,"speaker":"Jonathan Pageau","text":"That's amazing. Yeah, for sure, for sure. Some amazing things. So people. So do people still see Lalibela as a kind of pilgrimage place?"}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2829.98,"end":2830.58,"speaker":"Dcn Enoch","text":"Absolutely."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2830.58,"end":2831.1,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2831.18,"end":2838.7,"speaker":"Dcn Enoch","text":"Absolutely. As I said earlier, Christmas is the largest one celebrated there, but Pascha is also big in Lalibela."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2839.1,"end":2839.74,"speaker":"Jonathan Pageau","text":"Interesting."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2840.14,"end":2974.95,"speaker":"Dcn Enoch","text":"So we want to go there for any holiday. I mean, the amount of learned people in that area is ridiculous. Like the ratio of learned scholars. I mean, in the diaspora we have to beg for, you know, one or two learned scholars per church. But there, you know, you see like hundreds of clergy, you know, people. What people don't understand is the large churches. I said there were small, medium and large churches in Ethiopia, especially in the capital city, because that's where you can make some money. On a more cynical note, but the large churches in Ethiopia would have 300 clergy trained. I mean, think about what a service is like when there are 300, you know, and sometimes they have shifts, so they're working at. At different times. The administrator, the hieromonk at my church, he always tells me funny stories. And he told me there's a tradition of St. Jared or St. Yaret, and it's a book called, a part of the prayer of his books called Zainagis, which means God's reign or God as king. And so when your parish gets big enough, you can hire a Zainaggis chanter. So the job of this Zayn Aggyas chanter is between the hours of 3am and maybe 4:30am every day, whether there are a thousand parishioners or whether no parishioners arrive, is to pray and chant this prayer. And so all the large churches have this guy where you can go any day of the week, the church is always open and you go in at 3am and there's somebody there chanting this prayer. Exactly. And the idea is to, you know, Ethiopia, unlike other members of our communion, was never fully conquered. You know, we could say we conquered ourselves internally, but we were never fully conquered by another outside force. So our Christianity was not a Christianity in hiding. It was a Christianity, if anything, with too much prosperous ease, which gave us time to really develop these traditions. And so these large parishes try to resemble the angels and try to keep the watch so that at every hour of the day there is some sort of prayer going on and with a few meal breaks. That's very true, especially if you go to the monasteries."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":2975.19,"end":3006.11,"speaker":"Jonathan Pageau","text":"I imagine if they're doing that 3am prayer in just like a regular town church, I mean, the monasteries must be completely insane. One of the things that really distinguishes also Ethiopian Christianity from, let's say, the Greek Russian communion is the drums and the rhythm. And so I'm curious to know how like at least what other traditions about that, because, I mean, do people see it as coming from all the way from Solomon or are there other traditions about the use of the drums and the rhythmic instruments?"}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":3006.59,"end":3007.87,"speaker":"Dcn Enoch","text":"It's a very great question."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":3008.19,"end":3131.39,"speaker":"Dcn Enoch","text":"And this goes to the African side of our hybridity. We are, I mean, the cops can argue a little bit, but nobody can argue like us, that we are the African Orthodox Church. And so you better know we're going to have some drums. But yes, they have an asterisk next to it. And the asterisk is that they certainly seem very ancient. And again, it depends if you want to go with the mainline narrative of the church or go to what the historical evidence says, the main line of the church. Yeah, we'll tie it back all the way to the time of Judaism. The people searching for more and more evidence don't really see evidence of the drums before medieval times. And that doesn't mean that they weren't there. But it does mean that the tradition was less elaborate before there. And we're still searching for evidence. So there is, I believe it was. Father Mandorf was a professor of a friend of mine who went to St. Vlad's and he told this story, which I will tell again, that in your communion, the liturgy has this balance between Byzantium rite and the Palestinian rite and the Byzantine rite kind of baptized or Christianized, what was the pagan theater before. And so the elaborate elements come from that. Whereas the more monastic tradition of Palestine was more interested in kind of a simple psalter and maybe a psalmody plus that, but not much more. And we see the same thing within Ethiopia. So one of the extra liturgical or non eucharistic liturgical schools is called Akwaquam. And the Akwaquam tradition is where the drum is beat. That's where all the drum beating comes from, historically in Ethiopia, that has centuries of evidence. And then you have a more minor modern Amharic tradition which is established from about the 70s till now. Okay, and we could talk about that. But there's this whole."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":3131.39,"end":3136.63,"speaker":"Jonathan Pageau","text":"So you're saying it developed in a particular place within Ethiopia. Like it wasn't something that was universal before."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":3137.11,"end":3171.66,"speaker":"Dcn Enoch","text":"It was not. I'll tell you, my grandfather and a lot of his ancestors are buried at a monastery called Waldeba, which is in the middle of the land of which the civil war is going on right now. And Waldeba is southwest of Aksum, but northwest of Gundar. So it's kind of the halfway point between the city of Guandar and the city of Aksum, which were two major cities a long time and two former capitals of the empire. So Waldeba is square in the middle of that. It's a 5th century monastery, and they view the drum as worldly."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":3171.82,"end":3173.26,"speaker":"Jonathan Pageau","text":"Oh, right, okay, interesting."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":3173.98,"end":3188.02,"speaker":"Dcn Enoch","text":"The drum is forbidden at that monastery, and that monastery doesn't even acknowledge that whole Akwaquam tradition, which is this drum beating and elaborate swinging of the staff as well."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":3188.02,"end":3189.58,"speaker":"Jonathan Pageau","text":"Yeah, the staff, yeah."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":3189.58,"end":3225.27,"speaker":"Dcn Enoch","text":"They don't acknowledge. They use the staff just to hold themselves up. And they only believe in a cappella worship, similar to the rest of the Orthodox Church. And they do the main eucharistic liturgy and they do the liturgy of the hours. So what mind boggles many Ethiopian Christians, which many even I would say Ethiopian deacons don't know, if they don't know the tradition writ large, is that if you go on Pascha, the feast of feasts, expecting like the craziest drums if you go to that monastery, you're not going to get that. What you're going to get is the liturgy of the hours followed by the Eucharistic liturgy. And that's the same thing that they do every day of the year."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":3225.51,"end":3246.33,"speaker":"Jonathan Pageau","text":"Okay. So they don't. They don't even have kind of festal liturgies. And they. Yeah, I mean, that could be like the monastic. Like, just like all these monks. Even in our tradition, there are these stories of these monks that wouldn't chant melodies. Like they thought melodies were worldly, so they would just basically do it monotone, just so there wouldn't be any variation in their. In their chanting, you know? No."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":3246.49,"end":3283.14,"speaker":"Dcn Enoch","text":"Well, these ones will definitely not be monotone. They'll sing, but they only will sing the a cappella things, right? Yeah, they have this view. For example, my bishop, who I mentioned earlier, he used to love hitting the drum when he was a monk, and that's rare for monks. Bishops are forbidden from hitting it standing up. They can sit down and they could hit it during the slow part, but any sort of fast melody while they're standing, the bishops are forbidden. And he's antsy because if it were just up to him, he would love to still hit it, but it would scandalize the entire church for him to hit the drum."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":3283.38,"end":3284.26,"speaker":"Jonathan Pageau","text":"That's amazing."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":3284.58,"end":3302.81,"speaker":"Dcn Enoch","text":"Which is itself a holy instrument used to praise God. But it's just. It's seen as kind of beneath the position of a bishop. And it's rare among monks. It's usually a married priest or deacons, or now also choir members who could be men or women who would hit the drum."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":3302.97,"end":3345.26,"speaker":"Jonathan Pageau","text":"Well, when I was in Axum, I had a very strange meeting where I met three scholars from Tel Aviv, three Jewish scholars from Tel Aviv. And all three of them were kind of experts on Ethiopia, especially experts on Ethiopia, trying to find the Jewish connection, like, trying to see, you know, how close the Jewish connection is. And one of these scholars told me that in Ethiopia, they use what's called a sistrum, right? Which is a staff. And it has like a. It's hard to explain. It has. I mean, I'll post a picture of it. It has these little metal parts inside that move. And so you shake it and it chinks, right? It chinks like a. And he said that systromes were common in ancient worship."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":3345.26,"end":3345.74,"speaker":"Dcn Enoch","text":"They even."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":3345.74,"end":3348.74,"speaker":"Jonathan Pageau","text":"They exist in Egypt. They exist in all these ancient cultures."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":3348.74,"end":3350.54,"speaker":"Dcn Enoch","text":"In the Minoan civilization as well."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":3350.54,"end":3397.2,"speaker":"Jonathan Pageau","text":"Oh, okay. So what? They're described in scripture in the Bible. It talks about systems in the Psalms like part of the instruments that were used. And he said, right now, he said, in Ethiopia is the only place in the entire world where they still use this instrument. And for him, it was like a connection. For him was like a way to connect Ethiopia to kind of ancient Hebrew worship. Because he said, they still have this tradition from like thousands of years ago. And it needs to be almost like a continuous tradition, because if you just saw it just named in the scripture, you wouldn't know what it was unless you had actually had one in your hand and seen what it looks like and used it. So there has to be this kind of continual physical transmission of the instrument for you to get to now and still go to church and see people chinking this instrument."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":3397.36,"end":3415.16,"speaker":"Dcn Enoch","text":"I'll tell you a funny story. I have a lot of secular family, and we were at a secular Christmas celebration, which is funny enough, and they had a sistrum in their house, and we were playing charades. And so my family member is, you know, my parents age, and they know."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":3415.16,"end":3588.46,"speaker":"Dcn Enoch","text":"What it is, but their child has no idea what it is. So I wrote it in Amharic, which is and is called Sanatz Al, or in English the sistrum. And plural sistra, like any sort of Latin plural. And I wrote it in English and Amharic. And that poor boy, my little cousin, worked his best to try to charade what it was. He had no idea what it was. And when they saw what I wrote, they said, how mean and unfair are you? And I said, look, you have this object in your house. You're venerating it by having it there as a cultural prop. So we're gonna use it. But yeah, it's a general Eastern Mediterranean thing. So it includes the Jewish culture, like you said, Pharaonic Egypt and the Minoan civilization. If you look at the remains of their artwork, which is from the island of Crete, that was there before, you know, it was during the Bronze Age, before the Bronze Age collapse. So all of those civilizations had this very ancient instrument. Yeah, and that is part of the Aguaquam school, which is. It accompanies the drum. It's never by its. It's always accompanying the drum. And it also is related, that tradition has blended in with the poetry tradition. So it's used with the poetry as well. What the drum and the sistrum are never used for, and I always have to make this explicit, and this is every Ethiopian church, is that the Eucharistic liturgy is totally a cappella. This is for post liturgical celebrations, like hymns that are done or pre Eucharistic liturgical hymns use the word Kidan. When you're talking about the hagiographies, the full term is, which means promise or covenant. So there's the Salota Kidan, which is the prayer of the covenant, which begins the Eucharistic liturgy. And in the Eucharistic liturgy, there are, I think three to four, I think four places where a bell is rung to signify different things. When hallelujah or Hallelujah is said to begin the liturgy, a bell is rung. When the Lord have mercies are said, a bell is rung. When the communion descends, a bell is rung. And when the catechumens are told to depart. That's not in order. I'm saying it off memory. But at those four points, beginning of the liturgy, catechumen departure, which is the halfway point after the Gospel is read, the sayings of the Lord, have mercy and the descent of the Communion. At those four points, a bell is rung. Everything else in the Eucharistic liturgy is purely a cappella. Mouth alone is the instrument. But before that period, in a, in a certain specific time, and after that period, you're allowed to bring out the sistrum and you're allowed to bring out the kabaro or the drum, and you're allowed to use that to make music. But again, it's not compulsory and some of the monastics don't like doing that."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":3588.93,"end":3637.69,"speaker":"Jonathan Pageau","text":"Yeah, yeah. So we've been talking for a while, so I have one last big question for you, I guess, and then, and then we'll call it, we'll call it good. Although I, I could talk about this forever. Like, I could just keep going. I know, but I don't want, I don't want to abuse people's like, attention as well. So in, in the, in our podcast, one of the things we presented was this, this Byzantine tradition, actually Syrian tradition, but, but accepted by the Byzantines of the, the apocalypse of pseudo mythology. And so in this tradition you have this idea, and it's present in other Byzantine traditions as well. The meeting of Alexander in Ethiopia, the idea even that Alexander's mother was Ethiopian, and then the idea that the Roman Emperor will hide in Ethiopia."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":3637.69,"end":3637.93,"speaker":"Dcn Enoch","text":"Right."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":3637.93,"end":3667.54,"speaker":"Jonathan Pageau","text":"I don't know if you follow that story. So the idea that the last Roman Emperor will hide in Ethiopia, whatever that means, and that at the end of times will kind of rise out of Ethiopia, and that will be like Ethiopia stretching her hands out unto the Lord, and that will kind of signify the, basically the end of the world is what it Seems to be. And so I don't know if there are something like. I don't know if there are some traditions which are akin to that in Ethiopia or at least like what you thought when you heard that description."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":3668.11,"end":3753.28,"speaker":"Dcn Enoch","text":"I had never heard a tradition like that in Ethiopia. That doesn't mean it doesn't exist. I just haven't heard that. I think it's in Matthew 12. Right. That the Queen of the south will rise in condemnation of this generation. That's prophetic language from the Bible as well. Yeah, I have always heard this in politics. Who is the successor of Rome? Because I'm interested in the study of empire. And you see, you know, nobody in Byzantium called it Byzantium. They thought of themselves as Rome, even though they were conquered by Rome and became Romans. They were the eastern part of the Roman Empire. So you see the geographic Rome shifts from Rome itself to Byzantium, which thought of itself as Rome. And a lot of people nowadays ask like, who's the successor? And there are some people who look at the current modern Russian state that has exited communism and has got some sort of amalgamation of different ideas of when to intervene, when to not. And you know that military cathedral that they built has this archaeo futuristic vibe to it where it's like super powerful representation of the state, but also of the Orthodox Church. A patriarch. Kirill has also commented a lot on Ethiopian situations."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":3753.6,"end":3754.16,"speaker":"Jonathan Pageau","text":"Oh really?"}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":3754.4,"end":3754.88,"speaker":"Dcn Enoch","text":"Yeah."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":3754.88,"end":3765.88,"speaker":"Dcn Enoch","text":"Oh yeah. He's supporting the current Ethiopian regime which ousted during the reign of Donald Trump. It ousted this regime that was backed."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":3765.88,"end":3841.66,"speaker":"Dcn Enoch","text":"By the US for a long time. And Donald Trump, love him or hate him, his nonchalance towards Ethiopia allowed Ethiopia to kind of rule itself instead of being guided by the the global American empire. And so a lot of people think that Russia will be this prophetic. You know, Russia is the successor state to Rome for many reasons, because of the connections with Byzantium which connected to the original Rome. But as you said, it may be that from the extremities of the world, from the ends of the world, the Queen of the south may rise again. And there are many people. I am myself an Ethiopian restorationist and there are many others who are elite in the diaspora. I always noticed a lot of the people involved with the beginnings of St. Vladimir's were some of the people tied to the Russian elites who were expelled out of the country. And I think not enough people realized that. And the same thing has happened with the Ethiopian situation. And I'm hopeful something like that for happen. I don't know if that's going to bring about Judgment Day. Only the Lord knows when that time will be. But I do like you and like Richard would say that perhaps Ethiopia. I'll say it that way. Perhaps Ethiopia has a role to play."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":3841.98,"end":3877.99,"speaker":"Jonathan Pageau","text":"Yeah, that's for sure. I'm sure that Ethiopia has the role to play, but I think that we're all kind of fascinated to see what that is and kind of. I mean, I think that's been a fascination for mine forever. And my intuition, which I now see is just not an intuition at all. You know, I've. Since we did the podcast, I've had several people write me because I said things like, Ethiopia doesn't just have the ark. Ethiopia is the ark, and I've had Ethiopia. Now I've had Ethiopians write me and say, yeah, that's what everybody thinks. Like, you're not coming into some great insight. They didn't say it that way, but they're basically saying all Ethiopians think that Ethiopia is the ark."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":3877.99,"end":3895.46,"speaker":"Dcn Enoch","text":"And I'm like, okay, yeah, well, yeah, you have to be careful. We Ethiopians can vie. I don't know how the Greeks and the Armenians are. Maybe us three can compete to who has the most hubris and love and country and patriotism, but they're pretty up there. If you say nice things about Ethiopia, we love you."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":3896.18,"end":3927.44,"speaker":"Jonathan Pageau","text":"There you go. Well, I'm happy to know that I'm loved by some Ethiopians. I'm sure that'll be. That'll be something that will. That will be very useful to me one day, I'm pretty sure. And so this has been really wonderful. I really enjoyed it, and I feel like it could go on forever. So what I'm going to do is we're going to put this out and we're going to see the comments. We're going to see what people say, see what people ask. If you have questions, if you have things because there are so many roads, we could have gone, write it down in the comments and who knows? Well, maybe we'll just do a second part and go into what people want to hear about. So thank you for your time."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":3927.76,"end":3928.88,"speaker":"Dcn Enoch","text":"Thank you for having me."}
{"episode_id":"SW - #190 - 2021-10-28 - Deacon Henok Elias - Inside the Ethiopian Orthodox Church","start":3929.76,"end":3994.7,"speaker":"Announcer","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description and so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
