{"episode_id":"SW - #296 - 2023-07-13 - The Meaning Behind the Princess and the Pea","start":1.12,"end":45.9,"speaker":"Jonathan Pageau","text":"So we're going to talk about the Princess and the Pea. The Princess and the Pea is a fairy tale which was written by Hans Christian Anderson. And usually I don't like to interpret fairy tales that are, have an author, you could say, that are written by an individual. But because this story has an interesting relationship to Jack and the Beanstalk, which I interpreted last time, I thought it would be. It would be a good way to show people how these themes connect to each other and how they have surprising links between stories. This is Jonathan Pedro."}
{"episode_id":"SW - #296 - 2023-07-13 - The Meaning Behind the Princess and the Pea","start":46.38,"end":48.06,"speaker":"Jonathan Pageau","text":"Welcome to the symbolic world."}
{"episode_id":"SW - #296 - 2023-07-13 - The Meaning Behind the Princess and the Pea","start":56.78,"end":726.71,"speaker":"Jonathan Pageau","text":"The story of the Princess and the Pea is very simple. Most people know it very well. A prince is looking for a princess. But every princess that he meets, he doubts whether or not she's a real princess. And so he goes out on a trip and he travels all the different kingdoms around his own kingdom to find a real princess. But every time he meets a princess, there's something off about her. You know, she's too tall, she's too pretty, she's not pretty enough. She's. She has certain faults, which means that he is not able to see her. He. He always has doubts on whether or not she's a real princess. And so he comes back to the kingdom disappointed that he wasn't able to find his real princess. And one day, a strange woman comes to the door, knocks on the door of the castle. They let her in, she's drenched, she's dripping wet, and all she can say is, I'm a real princess. And so the prince is astounded to hear her say something like that. But they don't know whether who she is, they don't know where she's from. They have no idea whether or not what she's saying is true. And so the mother of the prince devises a test to find out whether or not this is true. She places a pea at the bottom of 20 mattresses and 20 blankets. And the princess, you know, dries herself, gets dressed for the night and then she sleeps on these 20 mattresses. Now, the next day when they wake up, the, the mother asks the, the princess whether or not she slept well. And the answer is, of course, no, I didn't sleep well. There was something keeping me up, there was something hard in the bed which was preventing me from sleep. And through that, that is how they recognize that in fact, the princess is a real princess. And the prince and the princess get married and they live happily ever after. Now, the story might seem very strange at first glance, but there's always a question. We need to ask why these stories persist, why they continue to gain our attention. And a way to look at the manner in which there's meaning in this story is to see it related to the story of Jack and the Beanstalk. I talked about the story of Jack and the Beanstalk in my last interpretation of a fairy tale. In that story, the mother is a widow and she's very poor. And. And one of the characteristics that she has is that she is. When Jack presents her with the magic beans, she is incapable of recognizing the value of the beans. You could say that she's incapable of recognizing the seed. And there's a relationship with her being a widow, not having. Having lost seed, having lost the man in her life, having lost the father of. Of Jack, being adrift, you know, and also not having access to meaning. There's a relationship between that and her incapacity to recognize the seed, to recognize the being that Jack presents with her. Now, in the story of the Princess, you can see that it's the opposite. The way to recognize whether or not the woman is the princess is her capacity to. To recognize the seed is her capacity to be sensitive and to discern the seed, even though it is very far away from her. And under all these different mattresses in the structure, you can also see a very interesting idea, which is that the mother is a poor widow, so she's down below, and she can't recognize the seed. So the. So Jack has to climb up above and get it from the hierarchy. In this story, it's the opposite. The princess is up above on the 20 mattresses and the 20 quilts. And she has to be able to recognize the seed which is below. She has to be able to find in the. The. The. The potentiality that is below, below the earth. You could say she has to be able to discern the. The seed. So the symbolism is very much related to the masculine, feminine symbolism In. In fact, you could say that Princess has to show is that she is what we could call the good earth. In the parable of the Sower, you see, there's the. The story of Christ. In the parable of the Sower, Christ throws the seed out on the ground. Some seed falls next to the path, and so it can't find its roots. And. And so the birds come and take it away. Another one falls in these rocks. And so it's not the right type of earth. And so the seeds aren't able to have good roots. And so when they come up, they die. And so. And some of the seed, you know, falls in the good earth. And the seed that falls in the good earth is able to produce a tree and is able to produce the. The fruit of the. Of the seed. And so you could say that the. The good earth is the earth which is capable of. Of recognizing, you know, being a host to the seed. And we can see that there's a relationship in. In all of that because the prince goes out into the world. He goes very, very far away. He goes on this journey to find the princess. And. And there's a relationship between that going out very far, trying to find good potential, you could say, out in the world, and the stranger who presents herself to the door. And. And so the stranger has a relation, has this idea of being. This potentiality, this unknown potentiality which presents itself to you. You know, this, this. This kind of dark possibility. You know, she's. She's wet, she's covered in water. And so there's this relationship also between chaos. She arrives during a storm. So there's this. This strange unknown potentiality which presents itself to. To the prince. Um, and the prince has to discern whether or not this potentiality is the. The. The right potentiality for him. So imagine this is. This is just something which is related to everyday life. So, you know, you have some possibility which presents itself to you, some opportunity, a job opportunity. Someone, you know, comes to your door and talks to you about something that they want you to get involved in. And the question is, you know, you have to now discern whether or not this is a good potential, a good potential for you, whether or not this is the right job, whether or not this is something you should get involved in. Because there are all these. All these things always present themselves to you. And you have to find a way to know whether or not these. This is the right possibility. And the way that you know whether or not it's the right possibility is the capacity of that possibility to recognize your seed, to know, to be able to connect with you in. In a. In a. In an almost sexual manner in order to. To give for some fruit in the. In the future, for it to. To produce fruit, something like that. And so the princess herself with. What's interesting to know is you can notice that in the story there's a. This idea of memory. I've told you about memory in other talks, this idea that memory is what connects you to the center, to your meaning, even though you move far away. So you have some core, some identity, something which. Which is the most important thing about you, something which makes you something. And as you move further and further away, you know, you're always in a danger of forgetting, of not being able to stay connected to. To that center. And in the story, what you're seeing is the capacity of the princess to discern the seed from far away. And so you. You have these layers and layers and layers. Imagine them as. As these multiple garments of skin that I always talk about. These multiple garments that are added and added and added. And the. The question is, are you able to still stay connected to the center even though you're far away? And the story presents it in a very, very intelligent and subtle way because it. Is it related to sleep? Now, sleep has to do with death, has to do also with distraction. I told you before the story of the disciples. Christ comes to Mount Gethsemane and he goes up the mountain, and he tells the disciple, as Christ is leaving them, you know, moving further away from them, he tells them, you know, stay awake. Do not fall asleep. Stay awake and pray. But as he leaves them, they get. They. They get distracted and they fall asleep. And so this is the story of the princess on the top of the mattresses. The idea is that she's incapable of being distracted. She's incapable of falling asleep because she is so sensitive that she is able to discern the center, discern the p. From very far away. And so she. She doesn't forget. She's incapable of forgetting. And it's funny because in the story, it almost. It almost seems like it's a. Like she's. Like she's too. She's too difficult. You know, she's so difficult that she's capable of sleeping on these 20 mattresses. But that's what makes her the princess. Because even though she's very. She could be very, very far away. She's this strange possibility which presents itself to them, you know, this. This. This chaotic potential. She is capable of being connected to the seed. Even though she comes from far away. She's able to not forget, to not be distracted by death, by sleep, by all that imagery of moving out, moving away from your core, from your identity. And so I think this can also be related to the notion even of fidelity. The idea of that idea that the princess will remain. Will remain true to the prince. Because even though she's very, very far away, she will not forget the seed, not forget the meaning, not forget her. Her connection to that reality, to her, to her wedding with the prince. And so all of these things are kind of implied, let's say, in the story. In the story. Symbolism. So So I hope that this can help you understand how this story relates to Jack and the Beanstalk, but also relates to our very existence. And how this notion of the good earth or the good potential is capable of recognizing meaning, capable of being connected to meaning, even though it comes from far away, or even though it is something which is moving away from the center."}
{"episode_id":"SW - #296 - 2023-07-13 - The Meaning Behind the Princess and the Pea","start":735.44,"end":772.53,"speaker":"Jonathan Pageau","text":"I'm Jonathan Peugeot and I'm inviting you to participate with us in our retelling and our celebration of one of the most iconic fairy tales of all. Snow White. A beautifully illustrated storybook, Snow White and the Widow Queen places our iconic character at the beginning of eight upcoming fairy tales which will speak to each other and and harmonize in surprising ways. Snow White and the Widow Queen rekindles an adventure which will make you remember, rediscover, but also marvel and wonder at our rich heritage of stories. A heritage that still has secrets to reveal even after centuries of being passed down to us."}
{"episode_id":"SW - #296 - 2023-07-13 - The Meaning Behind the Princess and the Pea","start":772.93,"end":774.65,"speaker":"Jonathan Pageau","text":"In the past few decades, we have."}
{"episode_id":"SW - #296 - 2023-07-13 - The Meaning Behind the Princess and the Pea","start":774.65,"end":897.91,"speaker":"Jonathan Pageau","text":"Watched many of our stories, our fairy tales, our myths become completely exhausted by efforts to deconstruct them, to reinvent them, and sometimes to even invert their original meaning. It has come to a point where we've almost forgotten why we cared about these stories in the first place. I firmly believe that for this reason, it is now time to retell and redisrupt our original fairy tales. In a spirit of celebration, of admiration and unashamed joy, I've spent the past two decades meditating on the strange narrative elements of Snow White and other fairy tales. After much thinking, and now bringing this story to our common hearth, we find in the fire of time ready to present hidden treasures most of us have never noticed. To accomplish this, I have paired up with Heather Paulington, a world class artist and designer who has worked on some of the most beloved film franchises of our time. Her work mirrors my writing in a collaboration that has produced a powerful synthesis of medieval style with the best of 19th and 20th century illustration. I love the Kickstarter model because we can make the book more and more beautiful with every stretch. Only we can offer art prints, a limited edition drawing by Heather, and even a Snow White illustration of my own. Finally, we're planning a super exclusive leather bound edition which pulls out all the stops. A storybook mantelpiece for sure. The profits of this crowdfunder will be used to start a new publishing company, Symbolic World Press, whose christening publication will be this very fairy tale series. Each book illustrated by world class artists. Jack and the Beanstalk, Cinderella, the Valiant Little Tailor and several more are next in line for publication. All existing in the same world and all fitting together like a puzzle moving towards the final, surprising resolution. After all that, there's no limit to."}
{"episode_id":"SW - #296 - 2023-07-13 - The Meaning Behind the Princess and the Pea","start":897.91,"end":898.75,"speaker":"Jonathan Pageau","text":"What we can do."}
{"episode_id":"SW - #296 - 2023-07-13 - The Meaning Behind the Princess and the Pea","start":899.95,"end":907.15,"speaker":"Jonathan Pageau","text":"It's time to reset the clock to retell our stories. So please join us in this celebration and creative venture."}
