{"episode_id":"SW - #083 - 2019-12-25 - Christian Life and Symbolic Living","start":12.56,"end":16,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the Symbolic World."}
{"episode_id":"SW - #083 - 2019-12-25 - Christian Life and Symbolic Living","start":26.33,"end":127.55,"speaker":"Fr Joshua Caswell","text":"I'm Father Joshua Caswell. I know many of you here and we have some visitors as well. I'm a pastor here at St. John Kansius Church and here at St. John Kansas Church in Chicago, we're very proud to offer the very best in philosophy, catechetics, culture and art. Today's speaker is certainly one who meets that standard. Jonathan Pageau graduated with distinction from the painting and drawing program at Concordia University in Montreal during the late 1990s. Quickly disillusioned with contemporary art, he discovered icons and traditional Christian images along his own spiritual journey. Rekindling his love of art through study of traditional forms, Jonathan developed a passion for wood carving. Jonathan delivers lectures every year at universities, conferences and other venues around North America. He speaks on art, but mostly on the symbolic structures that underlie our experience of the world. Through his well known YouTube channel and podcast, the Symbolic World, he also furthers the conversation on symbolism, meaning and patterns in everything from movies to icons to social trends. Yesterday evening, he spoke to us a bit about Kanye West's new album. Yesterday evening, Jonathan presented to the Catholic Art Guild, and today he shares an overview of his thought, Christian life and symbolic living. So without further ado, I welcome Jonathan Pujol."}
{"episode_id":"SW - #083 - 2019-12-25 - Christian Life and Symbolic Living","start":137.08,"end":981.04,"speaker":"Jonathan Pageau","text":"So, hello everybody. It was a great evening last night. I got to visit the church. It's pretty amazing, very beautiful. And there's something about, something about the groundedness of the church in the sense there's a folk element to some of the art. You know, these polychrome statues. I love that you have all these polychrome statues. There's, there came to be a hatred of polychrome at some point in our age. But the color of the altar in the small chapel, just the gold and the color, and it's an exuberance, right? It's a celebration. And it's that celebratory aspect that I want to talk about with you today. One of the things that people don't realize when you come to church. You know, we come to church for our reasons. We come to church to commune with God, to commune with people. But have you ever thought about the possibility that when you, you come to church, you. You're actually participating the, in the existence of the world. And I can say that, and you might have heard someone say that, that we participate in the existence of the world through prayer. And sometimes it can sound a little bit woo woo, or just kind of spiritual in a vague sense where we say it, but we don't know what it means. But I want to say technically, almost, let's say, scientifically, when you come to church, you participate in the existence of the world. One of the things that people have realized recently, let's say the modern world has been characterized by science. We all know, and science has been, you know, whether it's true or not, has been one of the bludgeons that the modern world has used to hit at traditional Christianity, to hit on religion through all kinds of means. And one of the things that happened is that the scientists talked about the world out there, talked about phenomena and analyzing phenomena, representing phenomena, trying to show mechanical causes of everything, and thinking that because they found the mechanical cause of something, that somehow it takes away its meaning. And they did that, they did that, and they keep getting deeper into the world, deeper into the world. And at some point, some people started to realize, oh, well, there's one thing that we haven't talked about, there's one thing that we haven't really explained, and that's consciousness. We use consciousness, we use intelligence to discover science and to discover the world and to smash on Christianity and to smash on religion. But one of the things we haven't done is understand consciousness. So maybe we should do that. Maybe we should try to understand consciousness. And then as the eye tried to turn and to look back inside, everything started to get very, very strange. And all the things that looked very stable started to not look as stable as they did before. And as scientists started to analyze human perception. Because at some point you realize, wait a minute, we are people looking at the world. It's not just the world out there. We have to take into account the fact that we are the people who looking at it. So we have to try to analyze the eye that's looking. And they realize that things are a lot more complicated. And it has opened the door to re understand our religious practices in a way that is surprising to many. One of the things that the scientists are realizing as they're studying consciousness, for example, is that when we look out at the world, we don't actually see things in themselves. Because the problem is that things in themselves, they scatter into detail if you really take the time to look at it. Anything like a microphone. I always use a microphone because it's in front of me. The microphone that's in front of me has a million details in it. There are millions of aspects just in this microphone. Every little piece of wire, every speck of paint, and then I could go deeper, and all the molecules that make it and then all the atoms that make it, it scatters into detail. Why can I say that this is a microphone. How do I do that? And it's the same for everything. I could spend hours and hours talking about just the corner of my cuff because there's a thousand threads in my cuff, and then there's a thousand little threads in that thread. And it just keeps getting. Just breaks down into detail. And the problem is, how do we know that something is one and it's not just a microphone? It scales up. How do I know that a family is one thing? Because it's a bunch of people. What's the difference between a family and a random group of strangers that cross each other on the street? How can I say that that's one thing? There's obviously many things. And then you can keep scaling up. How do I know that a city is one thing? How can I say that? How can I say Chicago and think that that actually exists in the world? How can I say United States of America? And so what they're realizing is that what we actually look at when we're looking at the world, even in terms of the base sense, but in this. In, especially in the way we understand it, is that we see purposes, right? And we. We have a. A magic capacity to cohere all the details into unities. And they use a word, they say emergence. They say there's emergence. So there's all this complexity. And out of this complexity, something emerges as one. But it's like they don't understand that it's just a magic word they use to describe something they don't understand. How is it that there's a bunch of stuff and now there's one? How is it that we can say that? What's fascinating is that once you understand that, once you understand that, then you realize that we are part of how things come together. As humans, we are made in the image of God. We believe that as Christians, we are made in the image of God. There's this story in. In Genesis where Adam names the animals. And you can understand it that way. You have all these. All this bunch of stuff coming crawling towards Adam, all these beasts, all these things. And then he picks out and he says, that's one thing. That's that, that's that. And he names the animals. And that's what human beings do. And one of the things that the scientists are realizing is that if there wasn't human beings naming things, we're not quite sure what actually would exist, because it all breaks down all the way to the quantum field or whatever. It all breaks down into all this, all this just possibility of existence. Now, this sound might seem very, very abstract, what I'm saying, but if you bring it back to people, because that's easier for us to understand because we're people, what's the difference between a bunch of people that are in the same space and people that actually have a group and are. Are an identity, that have an identity. What's the difference? And the difference is what you're participating in when you come to church. When you come to church, you have all this diverse bunch of people. Everybody has their story. Everybody has their reality, their problems, their. Their. Their economic status. All of this is all this multiplicity which exists. And everybody has their own problems and their own thing. And what are we doing when we come to church? To a certain extent, we are setting that aside, all that noise, let's say, and we are focusing in together on the same thing. And that's it. That's how a community exists, any community. For something to be a community, there has to be something that makes you. Brings you in common with the other people that are in a community. Now it can be. Could be that you, I don't know, that you collect stamps. It could be that it's a knitting group and everybody that's in the knitting group knits. Like there are all kinds of purposes that would make a group cohere. But the thing about the church is that we scale that up to the highest possible purpose. So the knitting group is fine, you know, and these little groups are fine. But when we come to church, what we're doing is we are bringing that up. We're. That's. When are we giving glory to God? We're worshiping the highest possible thing. So because we're worshiping the highest possible thing, because we're all together for the same reason, which is to look up together and to be part. To, to. To acknowledge the highest thing. Then it, then it becomes the. Becomes the anchor of reality. And, you know, if I had said that, If I had said that to you a hundred years ago, a lot of people wouldn't. Would have said, yeah, you know, whatever. Like this is just magical thinking. You're just, you're just, just superstition. But no, no, no, no, no, because we've had a hundred years now of people that have tried to destroy that. And we have seen the results. What's the result? The result is the suburbs. That's the result. The result is a bunch of houses spread out on land with a bunch of highways connecting these houses to Strip malls and to things. And there is no coherence. Those, those huge swaths of houses that are out there and have, you know, and then people go to malls and go to big, huge grocery stores. They are not communities. And we know it. Because I live in a suburb myself. You guys probably live in the city, I live in the suburb. And I barely know my neighbors. I know maybe the neighbor that's like one house down, maybe two houses down. I know them, say hello. That's about it. But four houses down, I don't know them. But now let's take a traditional structure. Let's look at a medieval village or a medieval town or a town. You know, I'm from Quebec. A town 100 years ago in Quebec, where I'm from, which used to be the most Catholic place in the world, by the way, and not anymore. How is a town I was living. So last year we were. My. My family, I were flooded and we had to move and we moved into this small town called Saint Placid, which is. Was like 30 minutes away, further out into to the boonies. And this, this town. I'll tell you about the town. The town. The first thing in the town that was built was what do you think? The church. The church was built before the town. And that is not a rare thing to happen in the history of the west where the first thing to be built is a church. The church is built for different reasons. Sometimes in the early church, the church was built because a martyr died there. And the church becomes. And the place of the death of the martyr. When you say that the, the martyrs, the blood of the martyrs is the seed of the church. That's literally how it happens. A martyr dies, they build a church and all of a sudden people start living around the church and houses start to build around the church. And then people, you know, and then out a bit further out, you need farmland because people need to eat. You end up having fields a little further out and then next to the church. Well then at some point, if there's a lot of people, we need some kind of, you know, public square. Build a public square, build a market, have a government type building, you know, the mayor's office or whatever. So. So you have the center of town that has the church and then has all the things that bring us together. The church, the. The public office, the public space. And the church is always higher than everything else in the town. That's not arbitrary. It's not arbitrary that the church is the highest thing. Why is it the highest thing Right. It's the highest thing, so you can. So that you can see it from wherever you are. So there's one thing that if we look in that direction, everybody in the town is reminded of what brings them together. So on Sundays, the whole town comes together, they go to church, they participate in this. This coming together. And you can see it as what I described. You can see it almost like this onion that gets peeled back. So you have, outside of the town, you have the farmland, then you have the town. Then in the middle, you have all the public institutions. And then in the church now, you have the nave, where we are. And then you have the altar. And then in the altar, in the sanctuary, you have the altar."}
{"episode_id":"SW - #083 - 2019-12-25 - Christian Life and Symbolic Living","start":981.12,"end":981.28,"speaker":"Justin Ward","text":"And."}
{"episode_id":"SW - #083 - 2019-12-25 - Christian Life and Symbolic Living","start":981.35,"end":1381.58,"speaker":"Jonathan Pageau","text":"And then on the table of the altar, you have the cup. And then in the cup, you have this invisible transformation. You have this spark of divinity, which is the reason why we're there together. And how do we know that that's happening? One of the ways we know is that it's the reason why we actually exist as a town. It's making us all. With all our differences, all our problems, all our little fights, all of this which remains there. But as we come together and we say the same words, we pray the same prayers, we all look in the same direction, we are manifesting that unity. And it's so much easier for me to say that today, so much easier for me to say that today, because, sadly, we have now seen the opposite. We have seen that when you don't have that, you have this fragmentation which occurs. We have people who slip and slip between the cracks. Do you think that there could be. This is a tough thing to say, but do you think that in a medieval town there could happen that something like a school shooter would appear. It's not possible. It's not possible because the network of knowledge goes all the way to the edge of the town. You have a wall around the city. You have this coherent thing which is all participating together. And so the anomalies will be identified. Nobody will completely slip into the cracks, because everybody is interconnected to a certain way. But in a world where you have all these suburban houses sprawled out in these massive apartment buildings, you can have someone who's there and that no one ever talks to, ever. And no one notices at all. And so I think that that is something that we need to remember. Because sometimes you don't want to go to church. Sometimes you wonder, why are we doing this? I'm sure none of you ever wonder that. I sometimes will have that little moment where I'm like, is it really worth it? Is it worth all the effort, everything? And the answer is absolutely. Because what it's doing to the community, what it's doing to the world, these little anchors that are left, it's also doing inside you, right? So it's not just the people that are coming together and, and looking all in the same direction, saying all the same words, acknowledging, you know, lifting up the highest thing. It's also happening inside you. You're doing the same thing because you're like the community. You have all these thoughts, you have all these desires, you have all these purposes that are sometimes not in alignment with each other, right? We have that all in ourselves. But what are we doing when we come to church and we stand and we look at the altar and we, we, we, we. We purposefully try to set our minds straight, to align things in ourselves in worship so that we also are aligning, we are bringing our things together. And obviously it's not, I say this, it's not 100%. You go back out, all the temptations are there, you know, everything is there again. But at least to reset your alignment, you know, at least to do that every week to come and to reset and to commune to participate with all these people in the same divine mystery. You are resetting yourself so that you have a little bit of, a little bit of alignment to go and to preserve you for the rest of the week. And like I said, we only know that to be true now so much because we also see the opposite. Like, if you've had periods in your life where you've been away from church, if, you know, people that have been away from church, you see it, the drifting, you know, and this falling into this kind of drifting desire to stay amused, to stay entertained, to stay distracted, you know, it's there, it's so strong on the outside, we see it. But, and, and we all have that, those temptations as well. But to come together at least, and for those that are able to do it more than once a week, thank God for that. If you have daily masses or if you, if you have vesper services and everything, that's wonderful. But at least to come together and to realign ourselves so that, and that gives us strength to face the crazy, insane, fragmented world that we live in. And so like I said, there's a traditional saying which is that the. Just holds the world together, right? And in the idea that the prayers of the saints are that which hold the world together. If we didn't have saints, then the world would fall apart. And that is not just a kind of speculative religious thing that doesn't mean anything. That is. That is really how the world works. Without nodes, without places, without centers that bring people together. Then the world just fragments and falls apart. And let's be honest, if there ever is a crisis, what do you think is going to happen in a world that is completely fragmented? If there's a major crisis in our suburbs, where you barely know your neighbor two houses down, what do you think's going to happen? It might not be pretty. It might be an opportunity, though. It might be an opportunity for people to actually come together, but it can also be an opportunity for everybody to rip each other's hair out, because we don't know each other, we don't trust each other. And so that is the little encouragement I wanted to give you to remember that as you come to church, you get dressed up in the Sunday morning and you make the effort to drive here, that you are not that. In a way, it's not just for you, though. It is for you that you are actually holding the world together to the extent that you're participating in this divine mystery. So, thank you. If anybody has any questions."}
{"episode_id":"SW - #083 - 2019-12-25 - Christian Life and Symbolic Living","start":1388.38,"end":1391.42,"speaker":"Audience Member","text":"Why are cities so important in scripture?"}
{"episode_id":"SW - #083 - 2019-12-25 - Christian Life and Symbolic Living","start":1392.86,"end":1394.38,"speaker":"Fr Joshua Caswell","text":"And how is it that we can."}
{"episode_id":"SW - #083 - 2019-12-25 - Christian Life and Symbolic Living","start":1395.9,"end":1397.9,"speaker":"Audience Member","text":"Reconstitute the medieval city?"}
{"episode_id":"SW - #083 - 2019-12-25 - Christian Life and Symbolic Living","start":1399.74,"end":1746.14,"speaker":"Jonathan Pageau","text":"So the story of the city in scripture is actually an amazing and very, very important story, because the story of the city is the story of the fall. Actually, the. If you look at how it develops in scripture, the people who found the first cities are the descendants of Cain. So Cain actually founds the first city, and then his descendants are the one that found not only the cities, but all. Everything you associate with human activity in terms of science and technology, even arts, music, are all developed by the descendants of Cain. You think, why is that? Why is that? The reason is because as the human person fell from the garden, in the garden, Adam and Eve are described as being naked. In the tradition, we say that they were clothed in glory, that their communion with God and their communion in the garden was sufficient for them. But as they got further from the glory of God, then they had to protect themselves from the world, right? God said as they fell, the result is going to be thorns. So you need to protect yourself from the thorns. So what do you do? You make clothing. You put on clothing, you supplement your existence. You add this layer to you in order to protect yourself. But then Cain kills his brother and he gets exiled further out. So imagine the garden as a mountain. It's the best way because it is a mountain. The mount. The Garden of Eden has a mountain. And when they fall, they go. They leave the top of the mountain, they go out further. Then they have to protect themselves from the thorns. And then Cain kills his brother, and God says, you need to go further out. Keep going. You have to go further away from the garden. So he goes away. And then there's more and more hostility. What does he have to do? He has to make communal clothing. So we have personal clothing, then we have communal clothing. And that's what a city is. You have a wall, and you have a wall just like you wear clothing. It's the same idea, okay? And so the city is an image of this fall and this necessity for humans to supplement their existence in order to survive in the world of death. And that grows and grows and grows and gets bigger and gets bigger. And then finally, weapons of war, war, the flood, right? So it gets bigger and harder and harsher and more protective and more technological and everything. And then finally it all breaks down and the waters come and wash it all away. So that is the cycle. That's the cycle that you see in. In scripture, in Genesis. Now, we're going through some. Something similar right now. I mean, we're definitely building up these walls in a. In a rather arrogant fashion because we think they're going to protect us. Now, the wonderful thing about God is that God takes death and changes it into glory. God is constantly doing that, taking something which is dead and transforming it, filling it with grace, filling it with life. And that's the story. So if you. If you understand that that is what God is doing. The temple, the tabernacle has the same structure that I told you about. It has. It has a center, like the center of the garden, with the glory of God descending in the middle. And then it has a bunch of veils all the way to the edge. And at the edge of the tabernacle tent, they had animal skins, just like Adam and Eve wore animal skins. It's a representation of the same structure. And then you can add to that the city of Jerusalem, which is around it. And so God is taking something which is actually a result of the fall and is trying to change it into a glorious thing. And that's why at the end of Scripture, the last image that is given to us is a city. It's a glorious city. It's a city made of gems and gold and. And it's a perfect shape. It's a cube, actually. If you look at the measurements, it's like this cube. And so from the garden to the city, that's the cycle of the fall. But now we have from the garden to the city, and it's the cycle of glory. And God takes everything. This whole dark world that we have, all of this trash, all of the bad intentions, all of the stuff that we're creating out of desire to give us ourselves power to give ourselves, to protect ourselves. God has shown us that he can transform it into a glorious thing. So the last image that is given in scripture is of the tree that's there in the. At. In the garden in the middle of the city with the river of life. And around it is the whole city. So it's like it's an image of everything. And the church has that structure, right? That's why the. That's why Christian churches were closed, because it also. The church also represents the new Jerusalem. The. The architecture of the church was developed in an. In a apocalyptic vision. Right? When you're in the church, the early churches, all the decorations of the churches were apocalyptic. It was Christ returning. It was the. The. The. The beast chanting the glory of God. It was the. The. The 24. The 24 elders, you know, in their white robes. It was all about the end."}
{"episode_id":"SW - #083 - 2019-12-25 - Christian Life and Symbolic Living","start":1746.7,"end":1747.1,"speaker":"Justin Ward","text":"And."}
{"episode_id":"SW - #083 - 2019-12-25 - Christian Life and Symbolic Living","start":1747.1,"end":1814.1,"speaker":"Jonathan Pageau","text":"And so our church has that same structure. The same structure from the garden with the altar and the communion with the host and the communion chalice at the center, all the way out to the gargoyles on the outside of the church. Everything is there. The whole world is represented in the way that the church is set up. So it's to say that there is nothing which is evil in itself. God. God uses. The problem of evil is always a problem of place. It's a problem of trying to put things where they're not supposed to be. So if we have the wall on the outside and the gargoyles on the outside, that's part of the story. And in the inside, we have the glory of God there. The problem always happens when you try to put the gargoyles in the sanctuary. Don't put the gargoyles in the sanctuary. Don't do that. Does that help maybe understand a bit why the city is so important in this story? That was a long answer, though."}
{"episode_id":"SW - #083 - 2019-12-25 - Christian Life and Symbolic Living","start":1814.1,"end":1814.5,"speaker":"Audience Member","text":"Sorry."}
{"episode_id":"SW - #083 - 2019-12-25 - Christian Life and Symbolic Living","start":1815.22,"end":2072.6,"speaker":"Jonathan Pageau","text":"Could you comment on maybe family life or some of our traditional practices? Like maybe is it relevant to have fasting and Lent and meatless Fridays, chapel veils, those sort of things? Yeah, well, one of the things that. So I talked about space mostly, you know, the city and all this. I talked about this. This idea of bringing things together. But there's also the problem of time. Time has the same problem. Time is this wheel that turns, and if you're not careful, it actually speeds up something that people don't like to realize. But it's funny, because now we can realize it now because everybody noticed. I don't know. I hope it's not just me, but I know everybody has noticed that time is speeding up. The world is getting faster. And the reason why it's getting faster is because of the fact that we have destroyed our markers of time. We have destroyed the things which give quality to time. And that's what our liturgical calendar does. If you do not make time about a cycle of. You could call it something like a normal cycle of repentance and celebration. You could call it something like that little death and glory. It's like these little moments where you repent and you celebrate. If you don't do that, then time's gonna get away from you and you're going to start running like a rat in a. You know, you're start running like a gerbil in a wheel. And that's what we see around us. So the idea of remembering saints, remembering Christ, participating in these rituals that we do, like fasting, like celebrating these different events through the year, like having processions. Processions are great ways to qualify space and to qualify time, to give it meaning, right? To give meaning to time. All of these things are a way in which the world actually, we're holding things together. We're making things coherent, because, like I said, if you. If that breaks away, then you're. I mean, everybody. We can see it. It's everywhere around us. We see everybody rushing, like crazy people and everybody running around like. Like. Like mad people, because we. We've lost that sense of being grateful and participating in the thing. That's why we, like, we remember the saints every day. We have all these, like. Every day in the. In the church is a feast almost. It's like a feast of this saint and this saint. It's always a feast. We're always. We're always celebrating something. And then there's also, like I said, the fasting, which is a. Let's say. Can I say this? A little death and a little death all the time. A little bit of. Add a little bit of repentance and celebration. Does that make sense? Yeah, I don't want to go into any, like, specific thing, but that's what. In terms of how it holds the world together, that's what celebration does, because we don't. What do we Celebrate. Now, what does our world celebrate? Who knows? I don't know. Rock stars, celebrities. That's what we celebrate. And it's funny because we use the same language for celebrities as we use for saints. Call them stars, we call them idols. We have all these words that we use to, to, like, celebrate celebrities for reasons that are nothing to celebrate. And when you celebrate things that should not be celebrated, things that are related to the passions, things that are related to our desires, then you get pulled apart. You get ripped apart. And people get ripped apart in their selves, in their communities, in their marriages. All of this is ripping people apart, depending on what they celebrate, because you can't avoid it. You have to celebrate. That's what human beings do. We worship. We're worship creatures. We celebrate things. We venerate things. So what are you venerating? And that's why we have to remember. That's why when we celebrate our saints, when we celebrate the important events in the life of Christ, in the life of the Virgin, in the life of our communities as churches, we are remembering and we are holding together. We're holding ourselves together."}
{"episode_id":"SW - #083 - 2019-12-25 - Christian Life and Symbolic Living","start":2073.67,"end":2099.35,"speaker":"Audience Member","text":"I know you didn't want to get into anything specific when it came to symbolism, but as a new Catholic, I've never veiled in chapel before. As a new Catholic, I've never veiled in chapel before, and I will today. Could you explain the symbolism of the practice to help me to internalize it for my experience today?"}
{"episode_id":"SW - #083 - 2019-12-25 - Christian Life and Symbolic Living","start":2100.72,"end":2100.96,"speaker":"Jonathan Pageau","text":"Wow."}
{"episode_id":"SW - #083 - 2019-12-25 - Christian Life and Symbolic Living","start":2100.96,"end":2101.6,"speaker":"Justin Ward","text":"The veil."}
{"episode_id":"SW - #083 - 2019-12-25 - Christian Life and Symbolic Living","start":2101.92,"end":2321.64,"speaker":"Jonathan Pageau","text":"Can ask me to talk about that. Oh, man. Talk about a minefield. No, I, I, I, I'm okay to talk about that. So the veil. The veil. There are two. I'm going to focus on one reason. There are two reasons. I'm going to focus on one which is easier to focus on. The veil has to do with this, this mystery. One of the problems that happens with the fall is we're away from the garden, right? We're kind of, we're kind of removed from the garden, and we look at the garden from far away. Now, Christ has given us a way to receive from the holy place. And so the, the, the priest from the altar will bring down the divine presence into the church, just, you know, in a way that is making us participate in the Incarnation itself. So from the holy place comes this mystery. But this is going to get tough because in the traditional church, in the ancient church, the holy place had veils too. Like in the Orthodox church, we still have veils. There's a veil which is just like the veil in the temple. There's A veil between the nave and the altar. And that veil is to help us understand the distance between us and the holiest thing. Now, in the temple, the veil never opened. The veil was closed. And only one person in the entire nation could go once a year into the holy of holies. And they had to tie a rope to his ankle, in his ankle, because he could just die there. They would have to pull him out because it was so closed off and holy. Whereas in the, in Christianity, Christ has opened the veil, but we still need the veil because we, if we don't have the veil, then we end up mistaking the mystery for something lower than what it really is. Now that's what happens if you, if you don't have some form of veil between the holiest place and you. Even that veil must open and things must come. But if you don't, then what you end up with in the end is you can, you can get communion in the mail. If you're a certain kind of Protestant and they send you little packets with like a little bit of wine, a little bit of bread, you can get it through the mail and then you can just have it at home while you're watching tv. Right. So what if you don't have that veil? You end up cheapening the mystery to a point where it doesn't have any mystery anymore. Okay. And so the veil that, that St. Paul talks about, the veil that he asks women to wear, that has the same meaning because each woman is a possibly an image of the Mother of God. Is it possibly an image of the Virgin? And just like the Virgin is veiled, just like she is the holy of holies, each woman has the potential of being that for her husband. And so there's this. There's this. That's why the. One of the reasons why the veil existed in the Christian tradition was to create that, to preserve the mystery of the holy place. That is one of the reasons. There's another reason which is more complicated, but I won't go into that one, but maybe that can help you a little bit."}
{"episode_id":"SW - #083 - 2019-12-25 - Christian Life and Symbolic Living","start":2323.56,"end":2344.6,"speaker":"Audience Member","text":"So I grew up in the suburbs of Chicago. And you describe the experience perfectly. I mean, it's endless sprawl. It's actually, it's like an anti Garden of Eden in the sense of there's not even a hill, it's just totally flat. And there are churches. But it definitely doesn't bind together the community. But when I growing up in the 90s, we had the mall."}
{"episode_id":"SW - #083 - 2019-12-25 - Christian Life and Symbolic Living","start":2344.6,"end":2345,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #083 - 2019-12-25 - Christian Life and Symbolic Living","start":2345,"end":2360.12,"speaker":"Audience Member","text":"And the mall actually did. It's not a sanctified place. But it definitely bound me and my friends. And you go there and there's a, you know, pretty. A lot of fond memories of this going away. Yeah. Shared communal experience and all that. But now there's not even really. They're not even. It's going away."}
{"episode_id":"SW - #083 - 2019-12-25 - Christian Life and Symbolic Living","start":2360.12,"end":2361.08,"speaker":"Jonathan Pageau","text":"The mall is going away."}
{"episode_id":"SW - #083 - 2019-12-25 - Christian Life and Symbolic Living","start":2361.08,"end":2368.62,"speaker":"Audience Member","text":"Right. So what do you see in your, you know, studying different trends and things like that? What do you see anything replacing them all?"}
{"episode_id":"SW - #083 - 2019-12-25 - Christian Life and Symbolic Living","start":2370.7,"end":2822.99,"speaker":"Jonathan Pageau","text":"The way you have to understand it is like there's a hierarchy in our human. In the way that humans function. There's a. There's a hierarchy, and you can see it. You can see it in the medieval orders where you had those that pray, right? You had those that fight, you had those that work. And in the ones that work, you could kind of separate it between those that were merchants and those that really worked. You kind of had four classes of people, right? And so the highest, the spiritual, is represented by the church, let's say. And then after that, the. The ones that fight would be represented by the castle or by the. The. The mayor's, you know, like some kind of public building, some kind of public office building. And then you had the market, right? And then you had the land where people worked. So that hierarchy is the way that the world exists. You can't avoid it. So what happens is, if you take the church out, you're like, yeah, we don't need this. What is it anyways? We just come together and we say a bunch of stuff like, yeah, it's meaningless. You just take that away. Let's take that away. What we can find. We can find identity in our nation that. We can find identity in that. Let's forget the upper part. So then we say, like, let's center it around our nation. Then we have flags, and we all stand around the flag and we look at the flag and we have, you know, different. Different celebrations of our nation. And there's nothing wrong with that. But if you're taking out the top part and you think you're going to find resolution in the. The lower part, you're in trouble because that's going to start breaking apart. And then you say, oh, well, then we can find resolution in the market, right? We can find resolution in the. And so the mall becomes a symbol of the market. And the market, the economy is what's going to hold us together. We don't have this identity in the nation anymore. We don't have this identity in the spiritual world anymore. But the market, the economy is what's going to hold us Together, we go to the mall and we're all together. But that's not going to hold. It's not going to hold. So you're not surprised. You can't be surprised that the mall is going away and that we're all going to end up fragmented, alone on our computers, shopping on Amazon and finding this weird distributed communities online and not interacting with our neighbors, ordering food even. You don't even have to get out of your house because you could order food, your house, and you never have to leave. Right. So it's like these completely fragmented individuals that exist sprawled out on a land now, what's going to replace it? Everybody's looking to try to figure it out. People are doing weird things to try to figure out doing, you know, like Star wars and Marvel movies and Harry Potter. That's where they're trying. Everybody's trying to find some kind of thing that's going to unite them. And then political ideology. People get into these weird political clans and they fight amongst each other because this unity, they feel like this is giving them purpose and giving them reason. And the last vestige is these weird online communities that are not united in space, but are weirdly united just on the Internet. But that's nothing. Like, those people are not going to help you if you're in trouble, if you fall in a ditch. I don't see where those people are going to help you. And so the only solution. And, and, and I say this because I have gone. I've gone through the effort to think, like, what really is the way, the only way? And the only way is the return to the church. There's. There's no other way. And I'm saying this not just because I'm a Christian, just because I'm. I'm saying this because this is really how the world works. Like, without the top part, everything else starts to fragment. There's no way out of it. Yeah, I've watched your commentary on Moana and the sacred femininity. Could you explain that to me? And sacred femininity and why it's important for us to sort of follow patriarchy. So the problem, let me phrase it this way now, the problem with the idea of patriarchy is that it doesn't totally understand how things work, doesn't understand that there's that which is said and there's that which is unsaid. There's that which is hierarchy under that and there's that which is not hierarchy. And you need both. The problem happens when one tries to be the other. Okay, so you can understand it as the masculine aspect of society and of culture represents the hierarchy, it manifests the hierarchy. But you can't just have hierarchy. It doesn't work that way. You also need the, let's say, the unsaid, private, the feminine, the space in which the world takes place, the holy place in which the world is unfolding and that manifests itself as the bringing potentiality, the questions, the frame of. Of the world. All of these things are what the feminine bring to the world. Now the problem is that. The problem is that we actually don't value that our society doesn't value that the modern world is actually hyper masculine. And the trick and the seduction that has happened is that somehow this hyper masculine world has convinced the feminine that it has to be like the masculine, that the only value that exists is to be masculine. To get in that hierarchy, you need to get that high position in a job. You need to scale up the hierarchy of the world and be represented in all these different aspects of hierarchy. And it's like, that's a problem. That's a real problem because the private space is shrinking. Our private world, our secret world of the family, the place where we discover that togetherness and that intimacy is shrinking at an incredible rate. And marriages are breaking apart, families are being shattered. All of this is happening because we don't value the feminine, because we don't value that secret place that we all gather together. We don't value that place. And so one of the things when I talk about that people think that I'm somehow promoting patriarchy. I'm not promoting patriarchy. I think that we need the hierarchy and we need the space. And I actually believe that the problem of the modern world, that we haven't valued the holy place, we just haven't. And we need to do that. And in the Moana video, what I was trying to show in those types of videos is that they somehow think that they're giving value to the feminine character by showing her supplant this male character and by removing the normal interaction between the masculine and the feminine, putting the feminine space, but then also having a feminine character who's interacting in a masculine way with the feminine space. It's like you're destroying the world when you're doing that right? Because that's not how the world works. Does that make sense? A little bit."}
{"episode_id":"SW - #083 - 2019-12-25 - Christian Life and Symbolic Living","start":2824.75,"end":2825.47,"speaker":"Fr Joshua Caswell","text":"Thank you again."}
{"episode_id":"SW - #083 - 2019-12-25 - Christian Life and Symbolic Living","start":2832.75,"end":2897.78,"speaker":"Justin Ward","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well, and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
