{"episode_id":"SW - #211 - 2022-01-03 - How Christmas Reorganizes the gods","start":0.08,"end":13.36,"speaker":"Jonathan Pageau","text":"It is December 26th, and I thought that since we are one day after Christmas, we could do a little meditation on the Christmas Troparion, which is a hymn that we sing in the Orthodox Church on every Christmas, one of the main hymns."}
{"episode_id":"SW - #211 - 2022-01-03 - How Christmas Reorganizes the gods","start":13.68,"end":15.52,"speaker":"Jonathan Pageau","text":"And we can look at how this."}
{"episode_id":"SW - #211 - 2022-01-03 - How Christmas Reorganizes the gods","start":15.52,"end":23.64,"speaker":"Jonathan Pageau","text":"Hymn shows the transformation that Christianity brings in the pagan world, the transformation it brings on the manner in which the."}
{"episode_id":"SW - #211 - 2022-01-03 - How Christmas Reorganizes the gods","start":23.64,"end":29.36,"speaker":"Jonathan Pageau","text":"Different gods are perceived, the way that the heavens are perceived, and how in a way, it's a continuation of the."}
{"episode_id":"SW - #211 - 2022-01-03 - How Christmas Reorganizes the gods","start":29.36,"end":35,"speaker":"Jonathan Pageau","text":"Ancient world, of the ancient pagan world, but it's also a transformation of the order of it and the way that."}
{"episode_id":"SW - #211 - 2022-01-03 - How Christmas Reorganizes the gods","start":35,"end":36.12,"speaker":"Jonathan Pageau","text":"It lays itself out."}
{"episode_id":"SW - #211 - 2022-01-03 - How Christmas Reorganizes the gods","start":48.04,"end":51.72,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world."}
{"episode_id":"SW - #211 - 2022-01-03 - How Christmas Reorganizes the gods","start":61.78,"end":64.02,"speaker":"Jonathan Pageau","text":"So the Nativity Troparian goes like this."}
{"episode_id":"SW - #211 - 2022-01-03 - How Christmas Reorganizes the gods","start":64.26,"end":68.98,"speaker":"Jonathan Pageau","text":"Your Nativity, O Christ our God, has shown to the world the light of wisdom."}
{"episode_id":"SW - #211 - 2022-01-03 - How Christmas Reorganizes the gods","start":69.3,"end":76.1,"speaker":"Jonathan Pageau","text":"For by it those who worshiped the stars were taught by a star to adore you, son of righteousness, and to."}
{"episode_id":"SW - #211 - 2022-01-03 - How Christmas Reorganizes the gods","start":76.1,"end":80.14,"speaker":"Jonathan Pageau","text":"Know you the Orient from on high, O Lord, glory to you."}
{"episode_id":"SW - #211 - 2022-01-03 - How Christmas Reorganizes the gods","start":80.14,"end":83.38,"speaker":"Jonathan Pageau","text":"Of course, there are several translations of this. Going to use this one."}
{"episode_id":"SW - #211 - 2022-01-03 - How Christmas Reorganizes the gods","start":83.38,"end":92.35,"speaker":"Jonathan Pageau","text":"It's totally fine. You can find other translations online that are completely fine as well, even though they're different. And so what is happening in this Troperion?"}
{"episode_id":"SW - #211 - 2022-01-03 - How Christmas Reorganizes the gods","start":92.43,"end":94.43,"speaker":"Jonathan Pageau","text":"So of course it is referring to."}
{"episode_id":"SW - #211 - 2022-01-03 - How Christmas Reorganizes the gods","start":94.59,"end":97.59,"speaker":"Jonathan Pageau","text":"The wise men, to the mages who."}
{"episode_id":"SW - #211 - 2022-01-03 - How Christmas Reorganizes the gods","start":97.59,"end":103.95,"speaker":"Jonathan Pageau","text":"Come from the east, guided by a star in order to find Christ born in Bethlehem."}
{"episode_id":"SW - #211 - 2022-01-03 - How Christmas Reorganizes the gods","start":104.11,"end":928.52,"speaker":"Jonathan Pageau","text":"Now, when they arrive, of course they don't arrive, it seems, arrive when he's born in the manger, in the cave. But the way it's represented in the icon of. Of the Nativity will tend to unite all those elements together into one, which is not only completely fine, but shows the. The deepest aspect of this mystery. So it says that the birth of Christ, our God, which is important, the birth of God in the world. Now the whole theme of the Troperion is related to light, but it's not only related to light. You'll see that it's also related to the notion of principalities, to the idea of these beings, these patterns that are up above in the heavens, that are up above us physically as we see them, but also above us in the more, let's say, meaning, sense, that is, things that are higher up in the world, that are more important, that show the meaning of other things that are below it. And so the whole theme is about. Is. Is bond, light. So it's related also to creation, to. To the idea of the manner in which creation described in Scripture, as, especially in the first chapter of John, as related to light. But it all kind of comes together in this triparian. And so the birth of Christ, or God, has shown the world the light of wisdom. And so when we talk about the light of wisdom, we're obviously relating meaning, the highest form of meaning and the most incarnate form of meaning, with light itself. And so by this incarnation, those who worship the stars were now taught by a star to worship you, to adore you. And so the people who worship the stars. Now, in order to totally understand this triparian, what you need to understand is that in the Old Testament, but not only in the Old Testament, in ancient cultures, there's a direct relationship between the stars and the gods. There is a relationship between the stars and the angels. We see that in the Old Testament, where the word for the stars and the word for the council, the divine council, the beings that are around God, that serve God in the heavens, they are the same words. And so this is the transformation that Christianity is bringing. That is, the people before the arrival of Christ, they saw the patterns up in the heavens and they saw the beings up in the heavens. Both physically, they could see the patterns of the stars, which were regular. And those regular patterns could map on to our more kind of chaotic world. Of course, everybody makes fun of astrology, but there is a manner in which astrology or basic astrology is. There's absolutely nothing strange about it or weird or surprising. There's a basic astrology which is that when we look at the world below, like if I'm looking at an apple rotting on the ground, it is very chaotic, and it depends on the elements. It depends on if it's wet or if it's dry, depends on if there are flies in it, if they're worms. All of this, all the stuff that's below is. Is messier, let's say. And when we look above, what we see are the regular patterns, those regular patterns, the transformation of the different amount of light that goes through the year, the waxing and waning of the moon, and also the procession of the heavenly bodies in the sky are regular. That is, they. They change. We can. We can calculate them, we can map them, we can know when these things changes, and we can predict when they're going to happen. Very, very precisely, more precisely than most of the patterns that you kind of see down here below. It's like a clock. It's like this giant clock by which now our lives and our days are managed by this clock. So the way that the light moves in the sky actually manages your day, right? It tells you when you're awake. It tells you, when you're sleeping, you, you know, it tells you what you can do. And it also is related to the season. So when certain things above are happening, you know it's cold, you know it's warm, you know it's time to plant, you know, it's time to do the different things you do. Now, of course, today, because we live in a world of technology, we're a little abstracted from these patterns. But you have to understand that in the ancient world, the people lived by these patterns. The heavenly patterns. You could say it related to the idea of the heavenly spheres. If you think of the, the Pythagorean description, when it says that the spheres of heaven are making music, the spheres of heaven are making this music that only the initiated, only the very wise can hear. Now, we tend to think of it in a very materialistic way, but music just means patterns, right? That is that the spheres of heaven have patterns, regular patterns, which are related to our lives and are related to the how we organize our life. Maybe think of it, think, think of it that way, that the heavenly patterns are related to the way we organize our lives, to the way we give meaning and structure and direction to our lives down here below. Now this of course, is the way in which the ancient people would interact with these heavenly bodies. Now of course, in the idea that we present here, and that also is presented in the Lord of Spirits, is that at some point people started to worship these heavenly patterns. They started to see them as absolute. Now there are many heavenly patterns and of course there are the heavenly bodies above, but there are also heavenly patterns in the sense that there are patterns of being. So there are certain patterns that manage, let's say, war. There are certain patterns that manage certain cities. There are certain patterns that manage different aspects of reality. Love, desire, you know, and all the natural patterns. And so people started to see them and started to worship them. And this is what we could call the fall of the angels or the fall of the gods. No matter where you see it happening in the story, there's a sense in which at some point these patterns started to ask worship for themselves. And this coincides, of course, when people started to give worship to those patterns. You can always see it bottom up or top down. It doesn't matter how you represent it. It's the same really. And so what Christianity does and what Christ does is he reorganizes this into the right, the right pattern, the right order. Where it is that those that worship the stars are now taught by those very star, by a Star to worship you, the Son of righteousness. That is the brightest light in the heaven, the light of heaven, which is the one by which we manage all our existence. The King of heaven, you could say. And so you can see this right in the Old Testament, where the Son is placed as the King of heaven. And now it's not just the sun, the physical sun, but it's the sun of righteousness. That is, the heavenly patterns are connected to meaning, just like they were at the beginning when it says that your nativity has shown the world the light of wisdom, now it's the light of righteousness. So it's connecting these heavenly bodies with the human experience or the human place of meaning and of morality and of human interaction. And so now the star that the wise men followed taught them to worship the origin of light, the source of light, the sun of righteousness, and to know you, the east, from on high. That is the analogy of the east in the world. That is the source of light which comes up in the morning, but now from above, the higher version of that, the higher version of the source of light. And then, O Lord, glory to you. Now, the troparian is doing very amazing things. It's doing what it says that the light did for them. That is, the troparian itself is talking about how the following of the star and the encountering of Christ reordered their world first in relationship to, let's say, reordering it towards the idea of the brightest light as being the most important light. But it reordered their word towards meaning that it reordered the heavenly patterns that you see above towards the higher meanings, which are the moral meanings, which are the meanings of our existence, the meaning of how we exist together and how we exist facing this highest meaning. So this is what happened to the wise men, to the magi. But it's also what's happening in the song itself. The song itself is doing that in its structure, which by using the heavenly patterns at every. Almost at every line pointing that heavenly pattern towards a spiritual pattern, towards a high pattern in the sense of morality, in the sense of spirituality, and in the sense of meaning. Now, this, of course, is what Christianity does. And you see, once you realize that that's what Christianity does, you also realize that it's already there in the story of Christmas. The troparion is only showing us something which is already there in the story at the outset. And so think now of the angels and the shepherds. Now the story of the angels and the shepherds is the same as the Story of the Magi and the star. Remember I told you at the outset that the star and the angels or the gods above in the ancient world were seen as the same. And so the Magi see this star above, which is moving in a manner, pointing them to the Incarnation. Now, the shepherds, they see in the heavens the patterns of heaven. That's what they're. They have an experience of the patterns of heaven, which is the experience of the angels singing what the Magi experience the pattern of heaven pointing them towards the Incarnation and with the. The shepherd's experience, that is the heavenly spheres singing for them, the heavenly beings singing for them. Those two things are the same in terms of what they are helping you understand of what is going on in the Incarnation. And this is of course, what Christianity does. This is of course, the true transformation which happens in Christianity, which is that Christianity doesn't deny the existence of the intermediary beings, doesn't deny the patterns above, doesn't deny the existence of principalities and thrones and all of these, all of these beings that are in between us and God, but rather it conquers them in a powerful way or it transforms them in a way that makes them not only these things which are competing with God and are trying to get our worship, like our passions, like all the different interests that we have, but is able to reorder them so that now these principalities, now these angels that are between us and God, whether it be your different capacity to pay attention to different things, whether it be the saints, whether it be, you know, you're the king, or all these principalities that are between us and God, they're able to reorient them so that they show us the higher pattern. So think of it like it's not that you worship your Father as God, but. But that encountering your Father in the proper way will help you understand something about God. And the way that God rules over you, the way that God loves you, you can see now through the pattern of your physical father. And so you can see the same with the King. And so when you interact with the king, when you interact with civil authorities, there's some, if they're properly ordered, what they can do is they can point you up to the higher patterns, they can point you up through the small amount of light that they have, can point you now up to the sun of righteousness, the origin of all light and of all meaning in the world. And so this is something that we've also, of course, been insisting on very much in the past year. I would say both myself and of course the Lord of Spirits podcast, which is to help understand that, especially now, today, as we're noticing the modern world and the modern kind of monolithic thinking break down, as we see these principalities re. Emerge and kind of reappear in the world, we're capable of seeing them, capable of interacting them, interacting with them. We have to understand that one of the things that Christ does, that the incarnation does, is that it's able to help us interact with them in a healthy way, in a way that points to the highest. But if we're not careful, if we, especially as the world moves away from Christianity, we. What we're going to see is we're going to see these lights, these stars, these patterns reimpose themselves for themselves. We're going to see pagan practices, we're going to see all of this stuff kind of come back where the competing principalities, the competing gods will start to fight amongst each other. And of course that will reflect itself in the world as groups and as people fight amongst each other as well. And of course there'll also be a, an overcompensation by the authorities to try to get that power for themselves, right, to fight the different principalities and try to gather the power in the state or gather the power in some. A few monolithic structures that will try to impose themselves. And so I was hoping that this could maybe give you a little bit of. Of magic for Christmas and a little bit of a perception of how powerful these stories are, even though we're used to them, even though we're used to hearing them, how they are really not just about a young boy that was born in Bethlehem 2,000 years ago, but they really are about the reordering of the very cosmos, both in the scripture itself, but then also in the way that we celebrate it. For example, in the Christmas troparian. So I wish everybody a Merry Christmas. Christ is born. Glorify him. And I will talk to you very soon."}
{"episode_id":"SW - #211 - 2022-01-03 - How Christmas Reorganizes the gods","start":929.23,"end":948.43,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion."}
{"episode_id":"SW - #211 - 2022-01-03 - How Christmas Reorganizes the gods","start":948.51,"end":949.75,"speaker":"Jonathan Pageau","text":"I will put a link to that."}
{"episode_id":"SW - #211 - 2022-01-03 - How Christmas Reorganizes the gods","start":949.75,"end":991.14,"speaker":"Jonathan Pageau","text":"In the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. And you can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon, the Pageau videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
