{"episode_id":"SW - #135 - 2021-01-10 - November Q&A","start":12.56,"end":7718.27,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. Hope everybody is doing well. We can start with Neil now. Dirt poor Robbins is there. I'm gonna try hard to pay more attention to the chat. Hopefully I can do that at some point. It's hard. So there are a lot of questions. Hey, Brad. It's good to see Brad here. Got my. It feels comforting to know that my crew is around Sabane. Wow. Sabavier. Yeah. Neil says reading chat is impossible. I don't know. I watch some YouTubers and they do it. It's amazing. It's like if. I think it's probably like a skill you're born with. So. All right, guys. So there are so many questions. There is no. There's no way that I could get through these. I think there's like 50 questions. It just keeps getting more and more at every. Every turn. So Shaky Raindrop says they finally joined the Facebook group. Great. Yeah, the Facebook group has just been amazing. It's just, you know, I'm so grateful to have all these people, you know, at that level of discussion is. It's really wonderful to see that. And kind of continuing on at that level. We also have all the articles that are going up on the symbolic world. JP Matso just put up an article today, again, going deep into the miracle question, which is, I think really important in terms of understanding how far we can go with this idea of emergence and emanation. So, so the miracle question is really interesting. The video I did with JP on that was a lot of fun as well. For those who are on. On supporting me somehow today I put up the patron subscriber only video, which was on Robin Hood. And I have to apologize because I, I, instead of putting the video on unlisted, I put it private. And so all these people went online and then couldn't watch the video. So it has been fixed. You can watch the, the, the Robin Hood video. And I'm sorry because, yeah, these last few weeks have been insane. These last few days we're supposed to move into our house like in two weeks at Tops and nothing is. It's like construction is a crazy world. I feel sorry for all you who are in construction. It's just crazy. And so every evening I've been there until like 9, 10 at night, trying to finish things up that I can do because I'm not a construction guy, but I'm trying to do what I can. And my wife is just like, you know, she's just totally tired of dealing with all the details and stuff. So anyways, that's my problem. But that looks, that's why my hair is so dirty. Look at that. I need to take a shower. It's horrible. So hopefully I will not be, I will not be insane in this, this Q and A today. So we'll go through everything. Is there some other announcement that I wanted to make? Yeah. Guys, make sure you, you guys, like, I don't forget that the, the Cliff Channel, it just keeps going. Lisa just keeps putting. And there's, there are a few people involved on the, on the Clip channel. And so I just want to say to, to just keep going and subscribe there because it's a lot of fun to watch these little clips. Like, even watching myself just sometimes I forget the things I say and so sounds like, wait, did I talk about this? And I'm like, I watch a, I watch, I watch a little clip, you know, to, to remember what it is that I said. Luckily, I haven't caught myself saying something that I think is completely crazy, which could be. Which could totally, which could totally happen. So. Yeah. All right. I am going to start on the, start with the website. Okay. All right, here we go. There's a lot of questions, man, stressing me out. All right. Okay. So here we go. So MJVL M J V I L I M I don't know how to say that. Not using. Okay, so according to Frank Sheet, in his theology Insanity, Genesis uses the verb create, presumably being Hebrew rather than made. Only three instances when God creates heaven and earth, when he creates man, and when he creates sea monsters. She says that says man is created because his soul is a fresh creation. He says he has no idea why sea monsters are created rather than made. Do you? I'm not sure I totally follow the argument. It's like I think it's kind of dropping into my lap like this. And I don't know exactly what that. I never heard that before. So I would have to check into it and see because I'm not sure exactly. I'm not sure exactly what it infers in terms of the difference between creating and making. So I would have to, I would have to look it up. So sorry, I don't have a better answer for you on that. So another. So MFP Rysl says Catholicism puts a lot of stress on the statement that transubstantiation is real and not symbolic. I know that you, for you, symbolic is not opposite to real. How do you then phrase the reality of the Eucharist to make a distinction that it is a reality and not just Mere play. You know, I once heard a deacon say this, and I know that he was quoting another theologian, that I don't know where he was getting it from. But I once heard a deacon in the Orthodox Church say, Catholics believe that the Eucharist is real. Protestants believe the Eucharist is symbolic, and Orthodox believe it is real because it is symbolic. That is, once you understand that reality is symbolic, that meaning is in what is the thing in which things culminate. Logos is the thing in which things culminate, then you can believe that it is. That it is absolutely real because it is symbolic. It's not. It's not just mere play. It's not. But then everything is like that. All of reality is symbolic. And so it's not like it's the exception. It's like the culmination of everything. So that's the way that I see it. And so I. I really do believe that it is truly the blood and body of Christ. But I would say most, Most orthodox would believe that it is also at the same time bred and wine. That it doesn't stop being bread and wine. That it is truly really the blood and blood, blood and body of Christ without destroying the elements or without sucking the elements into some other essence completely. That's the way I see it. Anyways. Someone's going to catch me and tell me that I'm. It's not right or being, I mean, heretical, which is possible. Man, I feel like I'm giddy. It's not good. It's not. I'm not in a good space. I need to change the space I'm in. So it's the story of. So Pneumayish asks, is the story of Joseph being played out in Christ, where he is written from the Jews among the foreigner, but then is revealed to be Messiah to them at a later time? I believe so. Sorry. I think that the story of Joseph just has so many jewels in it in terms of understanding Christ. And I do think that if we look on the large scale, I think that that's exactly what's happening. I think that. I think that the Messiah saved the foreigner first. And while he's saving the foreigner, then the Jews cannot recognize him. And there's. It seems like even St. Paul seems to refer to a mystery in which in the end, you know, this is going to flip or it's going to turn and then, you know, he'll be recognized. So I think that the story of Joseph is really a really good template to understand how Christ is acting in the world, especially after Scripture, like after the Bible, how Christ was given over to, was sold to the foreigner in his case for 30 pieces of silver by Judah. And then basically since then he's been a captive of the stranger until something happens, until the end or something. I don't know. All right, so David flor says, with YouTube's new terms tos being unfriendly towards creators, are you planning on focusing on other platforms for videos? And so look, all my videos are being uploaded automatically to Bitchute. And so there is a fail safe there. The videos are all there. I've been working in collaboration with a company called Content Safe. You guys can check it out if you're interested in that. They, they've been kind of, they kind of have my back. They're the people who are also making my website. They kind of have my back in the sense that they make sure that all my videos that I that go up are saved on Bitchute and they also even save them on a hard drive so that if I, if things go haywire and I lose all my content, then they will be able to afford it to me. And so for a pretty reasonable price a month, they kind of offer that service. So you guys, if you're interested in that, check it out. It's definitely something that. So if things go really crazy with YouTube, then there's Bitchute. But Bitchute is not good. It's just not a good platform. It doesn't, it doesn't. The thing about YouTube is that you can discover people through YouTube. It's easy to discover others through YouTube. It's harder to discover things through Bitchu. But having said that, it's obvious that my channel is somehow shadow banned. Several people have told me that they don't get notifications or that Paul Vanderklee just today said if I type the title of your discussion with rationality rules, he said only his video pops up in the search, but your video doesn't pop up and it's the same, same video. And so that's something that people have mentioned. And so, you know, if you. Anyway, so, I mean, I don't know how much we can push YouTube in terms of making sure people are subscribed, making sure that they have the notifications on, you know, sharing the videos so that the word gets out. But we're kind of bit shoots now. Know better? Like if I put up my videos on bit shoots, no, no one's going to see them. So it's, it's frustrating. It's frustrating on all platforms. On Twitter, on Facebook. I'm getting now. You know, I've started to have warnings on my Facebook post, and someone saw also a warning on my YouTube channel, which is hilarious. Someone was watching my video on, on the symbolism of flat earth, and there was like a warning underneath it. Talk as if, like. And then you can tell that YouTube just does it. I guess they probably associate certain things in my videos and because I also made a video on symbolism of conspiracy theory, and so they probably think that I'm a flat earther or something, which is hilarious. Yeah. All right, so Josh the mover asks, could you discuss the distinction between whole burnt offerings and partially burnt sacrifices? Is there a contemporary application for this language or are they simply antiquated categories that are no longer necessary because of the incarnation? I think the distinction is important. The distinction is important to understand. And it's important to understand in terms of like, extremes, you could say, because we have to understand that the partially burnt sacrifice was a meal. It was eaten by, by the people. Right. And so there are certain types of lives which could be called whole burnt offerings, holocaust offerings. And for example, let's say a, a mystic or a hermit who lives in his cave and, and he lives in secret his whole life could be called something of, like a holocaust offering rather than a, a, a regular sacrifice, you know, because it doesn't, it doesn't at least visibly end up looking like it participates in the physical world, but rather looks like it's completely given up to God. And the idea is that it does end up having fruits in the world, but those fruits are, let's say, more are less visible at the outset. They're more widespread and they're more, you know, and that type of person acts more like a pillar of the world. And you can imagine the Hobart offering kind of doing that as well, like this column of smoke going up into the sky, and then once you're done, there's nothing left. And so this, this, this pillar that acts acts as a kind of foundation for reality. And it's self sacrifice, you could say. And so I think that certain types of monastics are like that. And I also think that probably martyrs are also akin to Holborn offerings, where, you know, their lives are completely taken up and they're taken from the world. And so they don't, it's not, let's say, like, it's not like someone who helps the poor or is involved in the community or, you know, or someone who is, is in a monastery and ends up teaching others, you know, the martyr Just especially the young martyrs, the, the martyrs in the early church. And we don't know anything about them. And then they're. That we knew what we know about them is their martyrdom. And then they just go up in this whole burnt offering and then they act as seeds for the, for the church, more so than other types of sacrifices or more other types of communions with God. At least that's my understanding of it. So Samuel says in the Lord of Spirits podcast, Father Dominic, am I, I never pronouncing his word right, his name. Right, Sorry, Father. Father Stephen talks about the idea that Satan is jealous of mankind's ability to become sons of God through theosis, and this is not an angel's fate. How would you understand that pattern symbolically or in terms of the way you have explained fallen angels as wayward principalities previously? What is the symbolic pattern underlying this idea? And so, and so you could understand the idea that it is possible for something above to desire that which is below. And the desire for body. It's not, it's not that hard to understand the desire for body. And so you can imagine that as, as you desire stuff, right? As you want to get the new car, you want to get nice clothes, or you want to get a, or in my case, I want a house. You know, in that desire, if you, that desire can scale up and you can understand principalities that become obsessed with a, with a, a desire for that which is below and then lose themselves in that desire and kind of fall into it. And so it's, and so the, the normal communion of angels is a hosting of angels, right? And you can understand Abraham hosting the angels that come down. And so there's a proper relationship. And the hosting is akin to, you know, it's, it's, it's analogical to, to sexuality. It's not the same, but it's like a. Different versions of the same symbolism. It's a more, it's a less complete communion, let's say, than, than a sexual relationship, but nonetheless it is a type of receiving from above, you know, into a house, into your home, and then offering hospitality. And so I think that, that, and so one of the things that the, the notion is that the angels see us as, instead of being really, really high up, we are more of the union of all. Of all possibilities together. So we, we have invisible and the visible together. So there's a way in which we are more than the angels. And that's kind of a mystery, but there is a way in which we're more than the angels, because we are, we can properly unite with the physical world. We don't need, we don't have the intermediaries, let's say, between, it's like we are between the world and the angels. Just like we can imagine that the, that the angels are kind of between us and God, you know, and so they kind of see something similar. But we have access because we have the invisible, then we also have, we actually do have access to the higher spheres. So. And is that the way I understand it, by the way, you need all of you just check out Father Stephen and father de Jong's DeYoung's podcast. The, the last one on Giants was just great. You know, they said some crazy stuff in there that is like, is not gonna make, is not gonna make a lot of modernists happy. But their description of the Nephilim in that podcast was really wonderful because they basically explain, they explain both the, like the physical causality and they also explain how it links, really links to the, to, to this narrative pattern of. And these beings that are real that, you know, that these principalities are not just our projections. They, they're real and they have, they have will and volition in the world. And so they talk about how basically the Nephilim, the way that angels and women mated to create the giants was through ritual, ritual practice. And so a priest or a king would stand in and would be possessed by the, the God and then would have a relationship with, with a prostitute or, or a woman. And then that the fruit of that would end up being these, these kind of demonic beings or these beings that are possessed by these principalities. And so those were the giants. And I thought like, and it makes so much sense because it's something that you see happening. Like if you read even the story of Alexander the Great, there's a version of that happening in the way that Alexander was born. And if you see it and they talk about how in different cultures they found these, for example, like something like OG's bed, which is like this 15 foot large bed which was in a temple and was used for this type of ritual. And, and so, and it just makes so much sense to think about it that way and that it's a real, you know, it's secondary causes. They don't talk, we don't think about the secondary cause, but they explain it and, and, but it's nonetheless a real relationship between, between the, the two worlds. And so it's a. Yeah, it's really worth it. I would say that that that podcast is really is really a great right now if, like, if my videos, if my videos can act as a way to help people understand that podcast, and I'll be happy if that's what it can do. Because there is a danger in their podcast that people who are kind of too science fiction minded will listen to it and not understand what's going on. But if you kind of have a right grounding and understand this hierarchy of beings that exist in the world, then all of a sudden then you get this whole narrative aspect which is perfect to kind of dive into and participate in. So yeah, all right, so enough about, enough about that. So why is the structure of the world with heaven and Earth, man in the center, and the great multitude of cosmos microcosms not sufficient? That is to say, why does God have to exist outside of this system at all? Why take the extra step and acknowledge anything as transcendent? Well, the one thing that you have to be careful that God it's, it's a dangerous thing to say that God exists outside of this system because it's a way. God exists outside of the system. But in, in another way God permeates the entire system. And in another way the whole system is in God. And so it, it's, it's like, it's the infinite. It's the category of the infinite. It's not, it's not. God is not a being that is outside of the cosmos. That is just not how it is. And, and it's just traditional theists don't think that it's a very, It's a very, it's a late medieval, up to today way of thinking that has developed in the world to think of God as the arbitrary being which is outside of the, outside of the cosmos. It's more that the categories of being stack up and stack up and stack up. And then at some point you reach the place where being hints at something beyond it. Something which is both itself and not itself, which is both being and non being at the same time. And, and so, and that fills all and is the source of all, and all is in God. So all that language is to show you that it's not, it's not that. And so yeah, like, why is it not enough to have, you know, heaven, earth and man in the center is because there is even something about man's central position between the two opposites which, which gives us a yearning for something which is beyond opposites. Like our very position as the link between these two things gives, puts in us a yearning for that which is beyond duality. And our capacity to see a hint of that in us is enough to have an intuition of something which is beyond duality in a greater, in a greater way. And so at least that's the way I see it. All right, so Luca Ascovic asks you, and Rationality Rules talked about the difference between identity and behavior. Can you elaborate more on that? What does constitute pre Renaissance identity and how is it different from modern identity? Can you please compare examples of old identities with modern identities? And so that's a really interesting, it's a really interesting question. And it was really, it's really important because one of the things that we've seen in the modern world, especially in the last, you know, few decades, is we've seen an inversion of identity, like a complete inversion of identity. Because you could say that, that, that in a traditional world, in a normal world, your identity is your place in the world, it's your place in reality. And so it could be your place in all the different dynamic hierarchies of being. And so it's like you're a baker, or it could be a position that you hold, it can be something that you do, but it also has to be like a position that you hold. And so you can, let's say you can bake, you can make cookies, and you can do that, but you can also be a baker because you have that position in society where you are, you are, have a role, call it a role in society. And so usually identities are roles that we play. And so that's why man, woman, child, you know, all your jobs, you know, let's say in a traditional world you could always also have things like different aristocracies, clergy, the different roles you play. For example, in the medieval theology, you had the three orders, you know, those who pray, those who fight, those who work. And those were your identities, like you were, they were what you, you're. It's not, it's more than just what you do in, in the immediate sense. And so one of the things that that has happened is not only that we have been identified with what we do, because when we talk about homosexuality, it's even more than just what you do. It's your desire. We have, we are now identified with our desires. And so we, we're in a weird, we're in a weird world, upside down world, where in the traditional world there's something stable, which is your place in the world. It has a certain stability. It's not 100% stable, but you have a certain stability. And then you have all the impermanent aspects of you, and your desires are part of it. So, for example, like being a married man or being married, that's something which enters into your identity. It's a place that you have. It's a. It's a. It's a. It's a formal relationship between two people. And then you know that it's possible, even as you're married, to have desires for other people. It can happen. And so. But those desires are impermanent. And, and if you ride them through, you're just gonna get over. You're just gonna get through them and you'll continue on with your life. You have to work on focusing your desires in alignment with your identity. And so now it's like this weird reverse thing where your identity has to be focused and put in line with your desires. And the thing is that your desires are ever changing. And especially now, you'll see it, because before we had the only. The idea of, let's say, homosexuality, but that's going away because it's all fluid now. It's all about fluidity and, and, and, and, you know, gender fluidity. And your desires just. Just float and can end up on anything if you let it go that way. And people realize that. But then because our desires have become the focus of identity, then all of a sudden they realize that they can't have stable identities because their desires are just changing all the time. And so it really is a problem. Like it's a. It's a major problem to. To confuse. Like I said, it's not just behavior. Behavior already is a problem if you confuse just behavior with identity. But if you confuse desire with identity, that's even wilder. That leads us to destruction. All right, so Timothy Aspas Law Ask. Hey, Jonathan. I'm trying to figure out the relationship between the cardinal directions in the Old Testament. I see a strong connection between south and West. Both are related to death and multiplicity, the slavery of Joseph down in Egypt and the western waters in Jonah. I see a strong connection between north and east as they are related. To return to the source of identity, the garden in the east and Jacob going to his uncle Levan Levin in the north. My right to see south being closer to west symbolically than it is to east, as well as north being closer to east than it is to West. So a good way to understand it in terms of Bible symbolism is to understand. To understand east and west as being. It's opposite from us. And so it's like the vertical axis is east. And so the, you face east and then, so the, the east is the, the main direction you could say. And then wet, because the sun goes up and then west is the, the, the, the end of the world. And then left and right are more the extreme. And so the north is, let's say the south is the, the. That's where the sun goes. So the sun goes into the south and in the north, the sun doesn't go into the north. And so the north is a type of extreme, a high extreme you could say, especially in the scripture, because going north is up and then going south is down in the experience of people in scripture. And so it's more, it has, it does. In fact, north doesn't indeed have to do with the idea of source, you know, because it's the mountain. And so it's this, it's related to this idea of source. And you can imagine, you can just imagine the vision of these white capped mountains at the top of the, of the world and then going down south towards Egypt, you know, down into the desert and into, into a kind of death. But north and south are kind of like extremes and, and both of them have their dangerous extremes because if you read in scripture, you'll see that like the, the, the invaders always come from the north. You know, they come down like thunder, right? And they come down like this, this, these lightning bolts from heaven and come and attack. And so you see that in the whole image of Gog and Magog, you know, the idea that I talked about the Caspian gates in the north. And you see it also just in the idea of all these nomadic tribes that would come down from the north even in the time of Christianity, the Huns and the Khazars and the Turks and all of these tribes that kind of. And even the Vikings like they, they, they. So the north isn't necessarily always good. It's more an extreme of something above you which, which can also come down and, and take. Right? And so yeah, that's how I see it anyways. But there's probably a lot more. Matthew's book is really worth reading in terms of those, those directions as well, so. Dear John, so, so Nomad in Socks. No Nomad in Socks asks. I am struggling to understand why you have said in previous videos that symbolism shouldn't have to be explained. Instead you seem to imply that it should be felt or lived ignorantly in faith rather than known. So does that relate to Adam and Eve in the garden, living ignorant of the knowledge of the fruit? I always understood that symbolism was meant to be destroyed by being known and integrated, just like food. It is how we digest the unknown slowly into the known. The end goal being that all of the. Of the unknown of God will be properly digested. The high will come down to the low and the kingdom will manifest down on earth with unity in God. Then he gives me a few analogies. I think there's something about what you're saying which is. Which is right. I think there is something about what you're saying which is right and is also related to the notion that Christ said that all must be revealed, that everything that is hidden must be shown. But it is in fact a process of death. And so because it's a process of death, it just means it's a process of death. And so a lot of will be lost along the way. And so I do believe that in the end it'll all be integrated. But I also, I also see in the words of Christ this wise, you know, the wise saying that scandal must happen, must happen, but woe to those by whom it happens. And so there is a danger in ex. Making things explicit, which is when you make things explicit, people think they understand it by their ex. By the explicit knowledge, but they, they lose the, the lived aspect of it, you know, and, and so hopefully. Look, I, I do still think this is. Has to happen. And I do still think that it, at the point where we are. It's the best bet for people to climb the back. To climb back up the ladder. I would just say that. I would just say that we need to be careful not to think that because we understand these, the symbolism mentally, that somehow we have more than those who have a lived and experienced intuitive approach or, you know, incarnation of symbolism. That's mostly what I want to get to. So Adam says, hi, Jonathan with the symbol of red hair. I just watched Pono and the magician and Ponyo herself have red hair. So does the, the Disney Little Mermaid and supposedly the prophet Muhammad dyed his beard red. I didn't know that. Is any of this related or relevant? Yeah, red hair is very important. Has to do with red in general. Left hand wild symbolism. You know, Esau is red, but then Adam is also red. It has to do with Earth. Has to do with this kind of, I wouldn't say dissolution, but a loosening. You could call it something like that, like a loosening of things. And so it could be related, related to creativity, but it has also been related to. Sadly, it has been also related to kind of promiscuity. And if you look at the kind of the symbolism of Mary Magdalene, how she has red hair in the west and is related to that. And so it, it just has. It's a sim. It's a symbolism of loosening, you could say. And so that's why. So you can imagine Adam is red, red earth, and then God gathers it and then blows breath into it. But you could also imagine the, the redness of Adam. If it manifests itself in Edom, then, then it, it can also be a kind of fragmentation and a wildness. All right, so C.C. seretta asks, so. Hi, Jonathan. I read Loris. Good book. Thanks for the recommendation. In an unwinding, confusing world characterized by multiplicity, Arseny falls in love with a stranger. He fails to properly connect his earthly relationship to unity spirit, and it ends in catastrophe. Driven by the unifying power of his love for the stranger, Arseny rises to spiritual unity where linear times become cyclical, and in doing so, at the end of his life circles back to his great failure and is able to correct it. Obviously more nuanced in the book, but am I getting the gist of the medieval symbolism? I mean, I think that that's a pretty good. It's a pretty, It's a. It's a pretty nice summary of what happens. You know, it's a very complex book. It's really hard. It's something that really makes you think. It really is close to the level of Dostoevsky in terms of the complexity of the, of the actions that the character is taking and the complexity of the, of the reasons why he's doing things. And you, you, you know, in the accent he's doing. So it's, I mean, it's definitely worth reading. So Tan moose man ask. It's deer season. What is the symbolism of hunting? Well, the symbolism of hunting has to do with it. It has to do with masculine symbolism. It has to do with the notion of fixing something. And you know, so you could say it's something like hunting is like, it's also like making. Fixing the territory. So you, you, there's something moving and then you shoot it. You throw a arrow, you, you throw an axis, you throw something straight, something like something which is going to, to stop it from moving. And so, so you could even imagine that something like science is a form of hunting because it, it tries to fix. You know, it's, it's an, it's one of the actions of logos is the idea of, of fixing. And so that's why Christ talks about also being fishermen, you know, that to, to. To. To Take these moving things in the water and in the, in the fishing. It's more about gathering together. But you could also imagine that as hunting is it. God talks about how he puts the Leviathan on a hook, right? And so this, you can imagine this again, this thing going down into the water and then it stops the Leviathan from moving. It fixes it down. And so it is one of the actions of the logos, which is to fix multiplicity or to, to stop multiplicity from moving. And it's neither positive nor negative. You know, it could be negative too, but it can, but it can definitely be positive. So, Benjamin rba, with the passing of your countryman Alex Trebek, you guys know I'm French Canadian, by the way. I just want you to know that, that there's a very big difference between French Canadians and other Canadians. But that's okay. We won't go into that too much. What are your thoughts on the symbolic significance of cultural power of the show Jeopardy? Is there more a more metaphysical shortcoming in Westerns inflations of the importance of trivia? Any thoughts on the show's format, the question and answer? The name Jeopardy. I mean, it's like, yeah, definitely, it's fluff, mostly. I would say. I would say it's just fluff. It's fluff in the sense that it's, it's a, you know, it, like you said, it's trivia. This, this, this thing, this idea that random facts and all these facts have meaning in themselves, have value. At least that's how I see it. All right. Okay, so we're done with the website and let's move on to subscribestar. All right, so Nicola asks the question that I'm not going to answer. Usually, Nicola, I answer all your questions, but I'm not going to go into this. The creed of the Orthodox Church states that the Holy Spirit proceeds from the Father, but the Roman Catholics have the filioque addition. Can you explain what each of the statements mean and how did Filioko change the Western Christianity? I will be totally honest with you. I am, I am very much in line with the Orthodox creed. I am definitely Orthodox, but I don't fully get this. Like, I just don't. I. And it's a weakness on my part. I've, I've looked at people trying to explain it, you know, but I struggle to totally. I don't see, like, I can see how, I can see how it's a problem in terms of the formulation, but I don't see the connection between the problem and the rest. So when I read, I listen to some theologians, they'll try to explain how this change which happened, you know, in the Creed in the west, how it then gave birth to all these changes which brought about the modern world and all of that. I don't, I don't see it like, I struggle to understand the connection and maybe it's a weakness on my part. You know, I'm not, I'm not really a theologian, but I just struggle to understand it. So Nicola, I'm sorry, but I definitely, I definitely say the Creed, the Orthodox creed. So, and I. That's not going to change. But, but I, I don't have enough to explain it to you. So. Adrian M. Malian asks. It seems to me that the crossing over of the right left hand which you have referred to previously is bound up with St. Andrew. First he was a father of John the foreigner and also brother of the. To Apostle Peter, symbolically seems to have both left handed right hand associations. His preaching in Byzantium and to the Rus associates him with many Orthodox. With many Orthodox. Consider the second and third incarnation of Rome. Left hand moving to right. Also his crucifixion on the X shaped cross seems to be symbolic of his crossing over from the heavenly right to earthly left and vice versa. Do you think I am on the right track? What are your interpretations of St. Andrew? The way that I understand St. Andrew, definitely. I think St. Andrew is related to the left hand just because he's always, he's always on the left in icons and he has wild hair and so he has this wild hair which maybe comes from the tradition that he was, you know, a follower of John the foreigner. And so. But the way I understand St. Andrew is that he's the one who goes to the edge of the world. And so a lot of his symbolism and a lot of his stories have to do with going to the edge of the world world. And I think that's even. I was even writing to someone about this recently about. I think that that's also what the, what the St. Andrew's Cross is about. I think St. Andrew's Cross is about a cross which goes to the corners of the earth. And, and I think that that's what St. Andrew, you know, man is manifesting. And so yeah, okay, so Mr. Horse says, I'm wondering for what reason Christianity usually has more women in churches than men. Usually the ratio I've seen is 2 to 1. In Islam and Judaism I have heard that the reverse is true. Do you have some idea why this could be the case. I mean, it's definitely possible that the Mother of God has a role to play in that. It is definitely possible that the fact that the Church is itself feminine in the way that it is described, it is also possible that it is related to this symbolism of the. Of the. How can I say this? This recognition that the question comes before and the answer comes after. And so the body appears and then there's this connection, you know, and so the Mother of God says, yes, and then the Incarnation happens. And then you see that in Christianity. I talked about this before, in many talks, where after that you can see how there's always women preceding men in every, let's say, mass conversion. And so whether it's Constantine and his mother, whether it's, you know, Prince Vladimir and his grandmother, whether it's. There's so many examples, all these kings that convert, always their mother, their wife, their sister, converts before. Whether it's Augustine, where it's the Cappadocians, you know, it's just. It's just this. It's just a repetition of Mary Magdalene, you know, seeing the risen Christ first and then after that. And so it has to do with this relationship between masculine and feminine and the way that it's seen in Christianity, I think. All right. And so Mr. Kelly, Alvin Madden, asks, what meaning do twins have? Esau and Jacob were twins. St. Thomas was a twin. St. Luke mentioned that St. Paul's missionary team sailed in a ship that had the twin gods, Greek God Caster and Pollux, as a figurehead. Some cultures kill one of the babies when twins are born. Yes. And so twins. Twins have to do with the problem of two things which have the same, let's say this, the same body or are of the same, or come out at the same time, of the same womb at the same time in the sense that. And that's one of the reasons why there's this image of the good twin and the bad twin. This is just an inevitable structure that's going to show up. Because if you have two things that are, let's say that, that are balanced next to each other, then there's going to be an inevitable tendency to say good, bad, or, you know, black, white, or we, we. We are. We tend to have opposites when we have asymmetry. And so this is just an inevitable aspect. And so this is what happens in the idea of the twins is that you have a symmetry, but the symmetry appears as two opposites. So it's not. It's not symmetry in the sense that the Two are the same. It's symmetry in the sense that you have, say, you can imagine that both twins together are a total being, and because they're like two halves of one being, then they will appear with this. In this opposite. And so that is probably why many cultures will either kill or see one of the twins as cursed or evil or whatever, just because of this problem, this problem of, of. Of how we are built to, to. To cease, you know, and it's like, you know, it's funny because you see it, if you want to understand, for example, in the United States, you have two parties, and just because you have two parties in. Is just because you have two parties, then it will inevitably split right down the middle. And you'll always have, like, you know, of near 50% of people going one side and near 50% of people going the other side. And then they will, they will line up on opposite sides of every single, possible, you know, question that you can ask. And so they'll line up against each other. And it's just going to happen. It's just inevitable when you have two of something. And so, you know, and it's, it's. There's an opportunity in the sense that there's a dynamism in that, but there's also a real danger because, you know, you, you end up with these two opposites that are, that are just facing each other. And, and so that's the symbolism of twins. All right, and so now let's go to Patreon, which has like, 34 questions. I think it's like, it's quarter to 10. Am I going to be able to do this? We'll see. Let's see. All right. Okay, here we go. And so let's see. Let's just do this. Let's just go all out. You know, hopefully people. Lisa says Jonathan's panic lap. And so you can recognize the differences between my different. My different. Laughs all right. And so Brad says that you need to have a healthy masculinity, and that's why the church fell in the west and men don't attend. There is for sure, there is for sure a pattern in orthodoxy, which is kind of the opposite that I've seen in other cultures, which is that it's usually the men that want to go and then it's often the women who don't, or you'll find the opposite of men who go to church and women who don't. That I've seen quite a bit in orthodoxy compared to other traditions. All right, so Kevin Patterson asks I attended a professional development program called Landmark. They train you to let go of bad things that happened to you in your past by seeing was all your interpretation of the event which causes your suffering. Example, my father hit me and I attach meaning to it. I'm evil. Then they tell you all meaning is just an illusion and that everything is interpretation and all your judgments are just your machinery program talking. Is this the Antichrist message? Look, I would say that there's an aspect of this which is obviously problematic, right? To say that, that you can manipulate reality, let's say that you can manipulate facts in order to make reality what you want it to be is definitely a problem. That is definitely not, not, not true. But there's something about, let's say something, a glimmer in what you're saying which is related to something which is real, which is that you could call it more like attachment to something and so, or attention on something. And so, for example, if you hold on to things like if you, if someone hurt you or someone insulted you and you hold on to that, then it will make you suffer, that's for sure. But if you, if you forgive and if you let go, then that thing will cease to have power over you. So it's not so much about, about changing the. What happened or, or, you know, but it's really about forgiveness and not letting events and people have power over you through what they did to you. And so in that sense, I think that it's true if that's what they're doing. So G. Garcia asks. Hello, Jonathan. You don't typically talk about economics, but I was wondering what you thought about currency. Could we view replacing a gold standard for a fiat currency and attempting to control inflation as Tower of Babel esque? I would say definitely in terms of Tower of Babel. And so it's interesting because you can see that one of the things that the current monetary system, because it's kind of detached itself from, from hard goods or from things that are solid, then what it has done is it has opened up way more possibility. And so it's actually opened up all this possibility. But then it's also made value extremely fragile. And so it's made value extremely fragile and based on the whims of people. And so you can imagine that in, let's say, in a more traditional, normal world, you know, you needed goods. And so you, you know, you had a stone building, you had goats, you had cows, you had stuff. And no matter what would happen in the world, there would always be a certain value in those things, because those things are there and they exist in the world and they have, they have value. They have a reality. They have a reason why they're valuable. And so as we, as we kind of abstracted that into this system of value that is not completely linked, then it, like I said, what it's done is it's actually created a lot of, of option and opportunity, especially with credit, but it's, it's fragile and so it can crack. And everybody knows because, you know, you had moments in. We always forget it's not that far ago, let's say in the 19. In the 19. The 1930s crisis where the system collapsed. And it's not like there weren't. Wasn't any food. There was food, there were objects. But because the currency collapsed and because the whole economic system collapsed, on one side of the country people were dumping out food and into. Into the ground, and on the other side people were starving. And so that's the fragility of the, of the, of the monetary system. And so it could. That could definitely happen again. Hopefully not, but yeah. So Charlie Longoria says your video with Rationality Rules is great. Watch it a few times. Is there anything you wish you could have communicated better? Wish you had said at the time, thank you for everything you do? For sure. I think that I definitely failed in the way that I communicated with him, obviously. And you can see that I failed because I feel like. I feel like he missed the points that I was trying to make or that he was getting them partially, not totally. That's. At least that's the impression I get. And I also noticed if I. And so on his channel, I tried to read a lot of the comments and I think a lot of the comments came off as if I was just trying to justify what I think, justify my Christianity through argumentation, which I don't know. Like, I think that if you guys have watched my channel for, for the last few years, it's like, I don't feel like that's what I'm doing, but, you know, and so we'll see. So Stephen has said he, he was kind of disappointed also in the way that people are reacting to the video. Kind of like I am and the same, I think with my. I think that he really, really made it real, genuine effort. And I could see that he was making the effort, you know, and so I appreciated that and I saw that in my channel a lot of people were just kind of going after him, saying he didn't understand and everything. And so, yeah, he said that he would be willing to do another discussion. So maybe we will, but I would have to feel like it's going to be fruitful. So he said he's going to make a video to summarize his ideas about our discussion. And then maybe I'll do something similar, which I'll try to be more concise and take into account the places where I saw that I was not communicating properly or that I wasn't getting across. And then maybe try to summarize that also. And then we'll see if that, that seemed fruitful, then maybe we can have another, another discussion. But I mean, I, I can't say for 100 that it would be worth it. So. So Keenan Wang asks, I think about the symbolism of too much right handedness as fire and brimstone, too much left handedness as flooding. Is there a symbolism for how they come together? And so, yeah, it's complicated with the left of the right hand. It's complicated because, man, it's okay. You know, we talked about, I've talked about this several times, the problem of the cross, like how they cross over. But that's fine if you want to say, see it that way. You know, don't forget that it's the people on the left hand that go into the fire, right? And there's people on the right hand that go come into the kingdom. But you could, you can understand that it's the right which is casting out and it's the left which is bringing in. It just depends on how you see it. But let's say that the symbolism from how they come together is definitely something that you'll see in, in scripture, right? And so you can understand the symbolism of how they come together in something like the, the, like Israel, right? So, and so in the Old Testament, Israel is the place where these two extremes come together. And so the way you see it, the stories in which you see that is when the Israelites leave Egypt in order to receive the law of God. And so they're actually moving out of death and they're coming together in order to now receive like Adam is being gathered together in order to receive the law from heaven, right? And so this is what's happening when Israel is leaving Egypt. They're being gathered out from, from the ground, from the south, talked about that before. And they're going to receive the law. And as they're doing that, they are held together between two pillars. And there's the pillar of fire and there's the pillar of smoke. But it's more like A pillar of, of mist or like a cloud pillar. And so there's water and fire. That is kind of. And they are in between this water and fire. These two, these two pillars are like the two extremes which are guiding them in their opposite. Right. And so, so there's an image of that. And then if you want to bring it down closer to something smaller, you could say that so the people of Israel being gathered together, and then the temple in scripture is also that place, because don't forget that there are two pillars in the temple. And those two pillars are the equivalent of the fire pillar and the water pillar. They're two to their equivalent of the two, the two sides, let's say the two extremes. And so, yeah, so that's, I would say. And so you can imagine, like in Scripture, you can imagine that the fire comes from heaven. This is something which is always hard, harder, because lightning comes from, comes down from heaven. Okay. And then the water is there. Well, water comes from heaven too, sometimes. But you can imagine the, the, the, the middle as being something like dry land, you know, that inhabitable land. If you've read my Matthew's book, you'll understand that as well as that which is between the two extremes. Anyways, I, hopefully those analogies were enough for you to understand. It didn't sound like I was just saying anything. So Benjamin Kincaid says, hey, Jonathan, could explain why we refer to God the Father as the Father. Also, I've heard that the Holy Spirit can be thought of as the feminine piece of the Trinity. Is that a correct way of thinking about it? And so, I mean, God, the God is the Father because He is the origin of the world. Like he's the origin in the sense of He's. He's that out of which comes the Logos, you could say that way. And so the Son. The Son comes from the. The Father. And so manifestation comes down. And so the Father, if you, you understand it as ultimately this idea of the. All the naming, all the speaking, all the identities come down from the Father. And, and if you actually read some of the church fathers, for example, like Saint Ephrem the Syrian, he sees in terms of feminine. He actually sees rather the divine essence as he talks about the divine womb. And so he has this image of this kind of unspeakable or unsaid essence, which is something like the divine womb, out of which God, in which God exists as a trinity. And so that's rather the imagery that I've seen in some of the Fathers that I like in terms of how. Let's say the feminine functions and so. But the creation itself is also seen as the feminine counterpart of the. Of the Father. Anyways, that's mostly how I see it. Especially if you understand theosis. If you understand that the re. The reason for creation is theosis, then you can understand how creation has a feminine aspect, which is. Which is meant ultimately to be fully united with God and fully participating in God's existence. So yeah, those are the two. So Vic Serta asks, although angelic beings are ultimately genderless, androgynous, when they appear to the prophets and the saints, they appear as young men, probably due to them following the patterns of heaven and the Logos, which is masculine. But since all the foreign gods of the nations are fallen principalities, what about the foreign goddesses like Ishtar, Diana, Asherah, etc, what patterns did the spirits who manifest themselves as feminine follow? That's an interesting question. I hadn't really thought about that very much. I love to think about that. They would. The way to understand it would probably. To understand how it. Within. Within the world of. Of principalities, you could probably understand that there are something like feminine and masculine aspects of all the different aspects of reality which are being manifested in these different gods. And so that probably has something to do with that because it's too simplified. Like a lot of people have this theory about Mother Earth, which is too simplified in terms of understanding how the feminine appears in the world of kind of gods and goddesses. But yeah, I'd have to think about it more. One thing's for sure is that it seems like, like Mary, like the Mother of God has taken up all the titles, all the titles of these different goddesses. She's kind of taking them as. As, you know, and, and kind of in, let's say, manifested them in their proper place in relation, in relation to the infinite and not in a confused way. All right, so JL asks. Good morning. Evening, Jonathan. It's a long question. I'm gonna have to skip your question there, jail. All right, so a question. In your carving practice, how do you yourself find the right balance of abstraction? All right, so it's related to this problem of abstraction in the modern world. Let me read the comment. Okay, so I've been thinking a lot about abstraction and its effect on the modern world. We can turn on a light switch and expect the lights that come on without knowing what goes into its working. We use words in a way that we know not their metaphorical origins and if at all, only know how they describe the physical world. Perhaps. Okay, so I feel like it's corruption disenchants the world and can remove us from the present. A way out of this, perhaps, could be learning how the lights come on, or practicing gratitude before flipping switch. Or learning the etymology of the words we use. Question how in your carving practice, how do yourself find the right balance of abstraction? Obviously, forging the steel for your tools is too little. Abstraction. Mining the steel too little. Yet using the power tools, maybe too much. Surely you'd stop at programming a robot to churn out an icon of St. Christopher. Yeah, that's definitely. There's definitely a question that in terms of. It's like, I don't know if I would. I would. I don't know if I would use the word abstraction, but I think I understand what you're saying. You could say something. Yeah, something in the sense of being removed, you know, and it is the problem of using tools. And so I think that. I think that tools, you have to understand tools as an extension of your being. And there is a process by which the further away you get from your being, like, the more levels you add, the more there's a danger of the tool taking over what you're doing. And that is just something which seems inevitable. There's a great example of how Miyazaki was making animated drawings with animations using drawing. So he was drawing all the characters, and it was a very long and laborious process. So he was able to integrate computer generated animation, which he would then maybe animate over, but he would use the basic. The basic thing underlying the animation would be computer animated. Then Miyazaki noticed that the animators were now adjusting their designs and their storytelling to what the computer could do, rather than using the computer as a tool to express what they were trying to express. When he discovered that of his animators, he threw out all the computers and said, back to the drawing board, let's go back to drawing. I think that there's something about that. For example, if I'm working on an icon, the way that I've set it up is that I have a hierarchy of practice, which means that there are some work in the icon which is more like rote work. When I'm taking the background out, for example, I'm not at all afraid to use a. A router, like a, you know, a mechanical router. And, you know, if I'm cutting the. The boards, I'm not afraid to use mechanical tools. If I'm joining the boards, I'm not afraid to use mechanical tools. None of that bothers me. But for sure. The more I get into the figure, the more I get into the meaning of the piece, then the closer I will get to my hand until, you know, if I'm making the eyes, then I have a knife and I'm holding the knife, you know, right at the tip and I'm just kind of really, it's like my finger goes right up against the carving. And so I think that that's maybe the best way to understand it is that, you know, the closer you get to the parts of your life that are meaningful, the more you want to be connected. And then for the things that are less important or less meaningful, then you don't have to worry so much about, about that problem of being removed from it, you know, because, you know, it's just, it's just inevitable. Like you, you, most people in their households in the ancient times would have had servants, would have had people who work for them, who would have done other chores that they weren't necessarily kind of aware of. It's totally connected to. So that's the way I see it. Anyways, hope that answers because it is a hard question. So Paul Dimal asks. Hi, Jonathan, could you give us a brief overview of the symbolism of vaccines? Thank you for your work. And so the symbolism of vaccines is the double symbolism of the garments of skin. So on the one hand it can be death taking on some aspect of death in order to preserve yourself from death. So to take in an aspect of the disease in order to heal from the disease to, to, yeah, to take some of the poison in order to be immune to the, to the poison. But that's not, it's not a, it's not a one way street because, because taking in death is. Taking in death. Right? So if you, if you, if you give. And the, that's why the garments of skin are a dangerous, are dangerous road. They're on the one hand they're inevitable, but on the other hand they're dangerous. And this is related maybe to the, to the technology symbolism that we talked about is that the more you add on, the more you give in to this process of death turning against death, the more you are getting, the closer you are also getting to death. And so like, and so I think that in terms of the vaccines, I think that you right now is a time to be very attentive and not be weird about it. Just be attentive to what is asked of you in terms of the vaccine. Because the vaccine will come with other requirements. There we other things that it's not just the vaccine. There are other things involved and you have to just be attentive to all that is asked of us and all that is all that it encompasses in terms of not just some taking some vaccine or not. You know, there's nothing wrong. I don't think there's anything wrong with a vaccine in itself, but it is, like I said, it's a giving in to death. And so we have to. We just have to be attentive, not to compromise ourselves. So that's as close as I can get because, you know, it's like, we'll see. You know, a lot of people are scared right now because of, you know, Covid and all that stuff, and I think they have a reason to be. But it doesn't necessarily mean that we just have to be attentive and not give in to hysteria, but also not be naive about what's going on and make our decisions. Once it is time to make that decision, be ready for the consequences of your decision. All right, so ebay in the Psalms, the psalmist talks a lot about God delivering Israel from the heathen nations. As modern Christians, when we pray with the psalms that use this idea, we think of demonic principalities today. Yeah, that's definitely part of it. Another part of understanding this imagery in the psalms and how it can relate to you, it has to do with your passions. So if you read like in San Gregorio Venissa, you. You get that imagery all the time where the. The foreigner is your passions, right? Because it's this strange thing which is both seductive and destructive at the same time, which is on the edge of you. And so all the imagery that you see, like in, you know, for example, like when it says that Moses killed the Egyptian, also St. Gregory of Nyssa will say, see it as, you know, saint that, that Moses is put to death, his own passions and the exterior aspects of himself. And so I think that that's probably the best way. It's probably even better than to think of it as demonic principalities. Because your passions, you know, are closer to you than, than. Than demons. Even though there can be demons behind your passions, you'll usually experiment it. You won't have the experiment of it. Most of us won't have the experiment of an actual demon. You'll just have the experiment of an uncontrollable desire to do something, right? Or an uncontrollable personality trait which will take over your whole personality more than seeing some dark creature in the corner of the room or seeing some shadow or whatever. You read the Stories of the saints, especially the ascetics, and their life is so full of prayer and self awareness that they experiment these things in an even more immediate way. Like they seem to actually have a sense of these things almost. Almost in a. In a relational way. You know, with most of us, I don't think have that. I mean, if you do. Actually, probably not. If you do, maybe I feel sorry for you, actually. Unless you're. Unless you're an ascetic. So what is all the. What is this? Zeros in the chat? This is, this is. This is Neil's doing. What are you doing, Neil? All right. Okay. So Leo asks the Ian McGilchrist in the Master and his emissary notes that the right brain is critical for the expression of virtually every emotion. The only exception is anger. That's activated by the left brain. Its additional symbolism is. In traditional symbolism. Is anger considered to be fundamentally different to the other emotions? That depends. Like, that really depends. It is possible that it depends how you understand anger. Like if you understand anger as an idea of offense against you, that you're reacting to offense against you, then it could definitely be in line with the notion of what I call, or what Saint Maximus calls the right hand sins. Remember that the brain symbolism seems to be reverted from hand symbolism. And so the idea that it has to do with the sin of self sufficiency. Right. And so it's funny because I'm actually reading Master and His Emissary right now. I'm not super far into it. I'm still at the first chapters, but. But hopefully I'll have more to say about it once I'm further in. All right, so Arie Fisher says, hi, Jonathan. I'm painting my very first icon for my grandfather at the moment using the Mandelian image made image made without hands template. What is the symbolism of this icon and the legend behind its origin of Christ sending an image of his face on a cloth to a distant king to heal him? Does it have to do with Christ using a garment to move into the margins? Also, I remember you saying that you would give a critique if people sent you their icons. You still do that or was it just for carved ones or painted ones too? It's mostly for carved ones. But if you send me. If you send me an image of your icon, I'll critique it. But just be sure you're ready because I won't be nice to you. I will critique your icon. Some people recently have been very offended at the fact that I've been critical of their work. So Just be careful if you send me stuff. And so the idea of the Mandelian and the importance of the Mandelian has mostly to do with the reality of the image. And it has mostly to do with the reality of the image as, as in the notion of prototype, in the notion of how the image has a, has a spiritual reality to it. And so, so you can understand it that it's not the piece of cloth, it's the image. And so Christ, it's like a reversal of the second commandment or like an accomplishment of the second commandment, which is that Christ, God has given us back the image in Christ because you have to remember that we are created in God's image and Christ gives us back the image through the Incarnation. And so Christ puts his image on the cloth and then the image goes. And then the person is healed by the image. And if you look at icons, if you look at like crosses, for example, Russian crosses, for example, often the Mendelian image will actually be placed above the icon. So you can have the cross, for example, with cross, Christ on it. And then at the very top of the cross, you'll have the Mandelian kind of floating there at the top. And what, what it's talking about is the. Talking about how what you see in the icon is pointing you towards the prototype. It's point pointing you towards the heavenly image, the image that Christ, the, the. The image of God that God gave us in Christ, which is not just Christ in terms of his bodily existence, which it is, but it, it, it is ultimately some, there's something, there's some aspect of it which is transcendent and that the image of God and man has been, has been restored through Christ. Hopefully that answers that. I hope that was, that was clear. So, Sander, Sorry, I'm not pronouncing that right. So what have you recently come to terms with man? That's tough. I don't know if I can be explicit about that, but I think that, I think that I can. A thing that I've come to terms with recently is, has to do because I'm getting older. Like I'm in my 40s now, I guess, like 45, man. It's crazy. So I'm like 45. And so I think that I've, I, there's. I've come to terms with the fact that there are some aspects of my life which have formed and there's something about when you're younger that you, that you're in, that you're in a gestation period. It's like, it feels like everything in front of you is possible, right, because you, you know, the future is open and you're, everything is malleable. You're learning, you're doing all this. And so I, I've recently come to realize that where I am now, I've kind of shifted into another stage where in front of me are not all these possibilities and that there are some things which I'm never going to have and that are over. There's something that are finished in terms of possibility. And then there are some things which I've been given as precious tools and precious gifts and that I need to, to foster and to kind of grow. But came. It's kind of like, it's, it's my version of the, of like the mid, midlife crisis, you know, like some things are finished and some things I don't, I, I shouldn't still hope for because it's just, it's also not worth my time and energy. And then some things I have, I need to consolidate and, and that's what I've recently come to terms with. Sorry I'm not more explicit, but it's kind of personal. So. Jason Gattle Gadawaltz asked. Hi, Jonathan, please feel free not to answer this question. What is the symbolism of hate? I mean, I mean the symbolism of hate is you can understand it as. It depends that word man. It's just because of today you could understand it as being. Noticing that something is not what it should be and feeling an extreme passion towards the fact that things aren't the way they should. And so it's, I saying it more like anger. And so you can, I thought there, there is this idea, for example, that there are certain things which are good to hate. Like hate your passions to learn to hate your passions to learn to feel anger towards your own sins. You know, and that is definitely in terms of Christianity, that is the way that it's supposed to be turned. Like it's supposed to be turned towards your own failings and your own passions and your own sins. But obviously we tend to externalize it and, and hate others. So Elise Spinola asks, hi Jonathan, was the meaning of Christ entering Jerusalem on a donkey that has pretty much to do with Christ, with Christ mastering the foreigner. And so this is a really interesting thing. It's like this is one of the most interesting aspects of Christ's symbolism is that when the Messiah, when Christ enters Jerusalem sitting on a donkey, he's sitting on an impure animal. And even the rabbis and the early Christian fathers, they understood that text which talks about that the Messiah will come sitting on the, the, on the back of a, of a, of an ass, that it had to do with the Messiah, let's say dominating or mastering the impure, mastering the foreign, right. And you could see it as a form of conquering. But in terms of Christianity, it's the supreme, let's say the supreme joke of, of, of Christianity that he did do that, but it didn't do it in the way that people expected. You know. And so Christ entered on a donkey and he ended up also, you know, riding Rome. But it, it didn't happen the way people expected. He didn't take over with a sword, right? And so he kind of, he went in, took over from within. And then, you know, 300 years later the emperor was converting and you know, the, what the Jews expected Christ to do, to take over, to, to vanquish their enemy, to vanquish the, the, the Romans, Christ did it, he just did it in a different way. And so that's what the Christ sitting on a donkey is related to. So Christopher says, when does humility turn into self loathing? I've always looked at humility as a chief virtue, as pride is a chief sin. Sometimes I find it hard to draw the line between the two. Even the church fathers talk about despising the flesh. What do phrases like this mean in that context? Thank you and God bless. And so this is the, this is going to be tough for you guys to understand that we are, we are in a way supposed to, to, to have a form of self loathing. The problem with the way that people see self loathing today, not loathing, but like self diminishing. We're not, we're supposed. The saints see themselves as nothing and in that they become the greatest. The problem with the way that we understand it today, you know, this idea of low self esteem, it's like the low self esteem stuff is actually a form of pride. It's not a form of humility. Like people who have low self esteem and are depressed because they have low self esteem are depressed because they think they deserve better. They're depressed because they, they think that they, that they should be better than what they are. And so because they have this, this idea that they should have more, that they should be better, that they should do this, then that's why they have low self esteem. But if you just think you're nothing, then you're not gonna, you're not going to have that problem. I'm not saying that look, this is what I see in the text. Please do not see me this way because I definitely do not have much humility, as you've noticed. But that's what I see is like I. What, you know, there's a, there's interesting, there's actually an this is, it's not even a Christian example that comes to mind is one time I heard someone asked the Dalai Lama about someone who is shy, you know, and the Dalai Lama said that shy people are too self important and that's what makes them shy. People who are shy are self centered and, and, and are thinking about themselves too much. And I think it's the same with people who are, who say they hate themselves in the way that the modern person hates themselves and then, you know, you know, is become self destructive in, in a, in a bad sense. It's because they, they don't really hate themselves. They are unhappy with the way others treat them and they're unhappy with the way that their life is going and they think that it should go better and they think that they should do that. They should have more, but they don't. And so it makes you feel like, yeah, sorry guys, that's tough, man. I know that what I said, what I'm saying is tough, but that's definitely what I see in, in the Fathers. And it's the difference between real humility and kind of low self esteem. All right. Okay. So, so Svetlana, Svetlana asked, would you please explain the pattern and hierarchy of intercess, intercessory prayer within marriage, monastics and the world communion of saints, angels, etc? Does the Incarnation reinforce or interrupt the need for intercessory prayer? No, I don't think it, it definitely doesn't interrupt the need for intercessory prayer. It grows it by like hundreds of hundred times. Like, how much intercessory prayer do you see in the Old Testament? You don't see a lot of intercessory prayer. You'll see the prophets pray for others, you'll see the priests pray for others, and then you'll see people, you know, ask for forgiveness for their sins and do all that. But the idea that we're all praying for each other constantly, that we're supposed to, that we're constantly supposed to be praying for everybody and that we're all kind of praying for each other in this network of Logos where we are all looking out for the best of others and they're all looking out for our best, and we are all praying for our authorities and our authorities are praying for those that follow them. And this kind of circle of prayer, and this circle of logos is really one of the most amazing aspects of Christianity is this, this, like, it's a network of speaking and of asking and of, you know, and so this, this idea that we attend to the needs of others, that we attend to, to in our relationship with God is really an image of the church itself. Like, it's a, it's an image of, you know, and how we ask the saints to pray for us, and we ask others to pray for us. And so we pray for others, they pray for us, and then we ask them to pray for us, and then we ask those who are already glorified to also pray for us. And so there's this like, massive, like, circle of constant prayer, which is constant logos, constant interaction of meaning in a community. And so it binds us together, you know, and I say that, and I'm horrible at intercessory prayer. Like, I, I, I struggle to make it, like a really important part of my, of my, of my life. Like, when someone asked me to pray for them, usually, like, I think about it for a little while and then I used it. Like, I see people, these amazing people, like prayer warriors who have, you know, know, like lists of people and that people that have asked them to pray for them, and then they, in their daily prayers, they'll like, name off the names of the, of the different people and have thoughts for all these people that have asked them to pray for them. Man, like, I wish I had that discipline and that fervor. Okay, so Chasen Lindsay says. Hey, Jonathan, I'm curious if the Eastern Orthodox have the same stance as Catholics on creation coming ex nilo. A lot of your talks have been about the creation of the world. There seems to be an implication that something other than God does exist, even if it's just some vague, undefined, chaotic potential that God organizes into being. Is this perhaps instead an issue with how modern people interpret the concept of nothingness with the water describing genetics to be classified as nothingness by ancient people, while a modern person see it as material phenomena. Thank you for any insight into this. So the idea to understand that God, the importance of creation ex nilo is that there is nothing opposite God, that God is beyond all categories. God is beyond all definitions, all name all distinctions. And so God creates two extremes in. And so usually I don't talk about that first part. Because that first part, what is there to say about that first part? It's like God creates heaven and earth, right? And so usually when I'm talking about creation, I'm always talking about what comes after that. It's like that even in scripture, it almost feels like the way that when it says God created heaven and earth, it's almost like it's not even part of the day. Sometimes it feels like it's not even part of the day. It's like before even the days. It's just this thing. Just this thing which happens beyond all categories. And so God creates these two categories, heaven and earth. And these two categories are also not like, really part of creation. Like, in terms of physical terms. There are these two extremes of being, these two extremes of existence. You know, there's the extreme of potentiality and an extreme of name, essence, or whatever you want to classify it. And it's only really like on the third day that anything that they're talking about is actually talking about anything that has to do with what we encounter. Like that we. Any category that we actually encounter. Like, you never encounter pure heaven, or you never encounter pure unformedness. And that's not nothing. It's. It's already. It's already lower. It's already not. What, what. What is talking about when it says that? When we talk about how God created out of nothing, it. We're. When we say God created out of nothing, we're pretty much saying that he created it out of himself. Like he is. He is. I don't want you to get like a pantheistic vibe from what I'm saying, but it's mostly to say that it's an outpouring of God, but it's not. He is all in all in the end. Like God is all creation is in God, and God fills all creation. And although there isn't. There's an absolute separation between the infinite and the finite or manifest world, there is also a complete, inevitable, complete, let's say, permeating of God in the world. It just can't avoid that. So, sorry. Hopefully you guys aren't reading this as pantheism. That's not what I mean. But it's. Yeah, it's mostly. When we say ex nilo, it's mostly that because you see in. In other mythological groups more other mythological stories where there's this sense that the world starts with duality. It starts with these two beings in conflict or these two beings that are lovers, you know, and God. And in the creation that we find in traditional Hebrew scripture or in Christianity and in other traditions have the same thing, is that the infinite is beyond the first duality. It's not. Yeah. All right, so hopefully that answers that. All right, so Nick Scott asks. Hello, Mr. Pesco, is there anything symbolic about the moon and its phases with regards to how it might affect the human body? I assume there are many places of symbolism surrounding the harvest, but the rest of it always seemed a bit new Agey to me. Thanks in advance. I mean, if you want the, the moon, if you understand the moon, it's mostly almost, you have to understand the moon as how it is a, it's a, it's a waning waxing, that's the moon. It's understand the moon as moving from darkness to light and from light to darkness. And so in that sense it's more, it's more related to kind of immediate patterns. And so, you know, and it's related also to the cycle of fertility in the sense of the women's monthly cycle as well, which is related to this, this becoming full and being and being able to receive light, being able to receive seed and then becoming dark and then, you know, not being able to receive seed. And so it has to do with that. Hopefully that makes sense. So Drew McMahon asks, you talk about how Jesus fills the hierarchy, that he is the first and the last, encompasses the top and bottom and is both Cain and Abel. Does this idea follow all the way down to Satan? Is Jesus also somehow. Is Jesus somehow also Satan? It sounds like a blasphemous question, so forgive me if it is out of line, but I'm trying to see how far and deep the idea goes and trying to understand how Satan can fit in a world of an all good, all knowing, all powerful God. So it's important to understand that when I say that Christ is. Fills the hierarchy and that when I say he is both Cain and Abel, I'm not saying that Christ is the person of Cain and the person of Abel. I think it's really, be careful about that. I'm mostly saying that he is healing or saving the, the, the aspects of, of Cain and Abel, like the problem of Cain and Abel, Christ is manifesting the solution to that problem, you know, by offering the sacrifice of bread and offering his flesh. Right. And so there are other aspects of Christ which are, which are uniting Cain and Abel together. And I think that in terms of Satan. Yeah, I mean, I think that for sure I would have to say that the best way to understand that is, is mostly to understand how Christ, you could say Christ replaces Satan is a better way to understand that. It's not to understand that Christ replaces Satan in the sense that Christ replaces the. The. As he fills up the hierarchy, then this place of the first angel, or the highest angel, or, you know, the angel of the. Of. Of that is the. The highest in the hierarchy, which is filled with pride. Christ flips that and he becomes the first in the hierarchy through humility. And so he actually takes the place that Satan has. He fills that with himself, you know, while remaining God at the same time. Obviously, I'm not saying that he. That he is losing himself in this. This. This going down. And so that's probably the best way to understand how Christ, you know, let's say, inverts the. The fall of Satan, that. That through humility, he takes the first place where that. Whereas Satan, through pride, lost the first place. Hopefully that helps to understand that a little bit. Is there a symbolic significance to the two different notion. On Judas's Judas, his death? You mean on the two ways that it's described that he died? Yeah, it's true. Like, I've. I've actually thought about that, but I don't think I've totally found a solution because they look like they're kind of these two extremes, right? The. The two. That. There's one. What is it? That's like he hangs from a tree. And then the other one is that he. He dies. But I forget. That's horrible that I'm not. What's the other thought? It's something about how he, like he. His innards, like, exploded or something that he bashed. He's bashed on a rock. So he falls headlong and he hits his head on the rock and he. And he. And he dies. And so, yeah, so you could. I think that that has to do with the two extremes. So it's like he hangs straight down from a tree or then he falls down and hits his head on a rock. And so it seems like it has to do with that, like a vertical and a horizontal extreme. But I haven't thought about it enough, probably, because it's probably really important. Actually, I should probably think about it more before I answer that. All right. So Jesse Blaney asked, as the drama of COVID continues, are we fated to relive out the story of Daniel and the lions? And the deeper question here, if. Is if biblical stories are archetypal enough to manifest physically. So I'm not sure I understand what you mean by Daniel in the lines. You mean the idea of not being asked to worship something and then refusing? I mean, sure. I don't know if it's. If it has to do With COVID But that's obviously something which can always happen, you know, and, you know, communism was an example of that. Exactly. Where people were asked to worship something and. And then if they refuse or if they continued to place God as their highest focus, you know, in they continue to place God as their highest focus, then it was trouble for them and they would end up in the Gulag. Maybe not everybody, but at least those that were. At least those who were. That would publicly refuse to bow down, like Daniel did, you know? So Amy asks. Hi, Jonathan. I would like to elaborate more on the culture of war regarding Big tech. You brush on it in your recent interview with Rodrier, where you both spoke of the danger of data collection and the soft totalitarian state that's been created because of it. I increasingly feel as though the culture war is heightened on these platforms and is used as a tool of conditioning and control to promote engagement through outrage. Yeah. Ensuring Big Tech can make as much money as possible mining and selling our data while we focus on each other. Are you able to shed light on understanding the structure of manufactured chaos and control? Thanks. I think that this is really an example of, you know, when I told you that I've mentioned this a few times, it's like when I told you that AI is probably the best way you can understand a fallen angel. I think that there's something of that going on. Like, I really think when you listen to Jack and what's his name, Facebook guy, Zuckerberg, you really feel like they. That they lost control of their monster. It's like they had these intentions of making these, these, these, these creatures. And, you know, and you can imagine them as the mad scientists, all excited, and then they pull the switch and they're like, it's alive. And they're all excited, and then all of a sudden, all the side effects of their project starts to manifest itself, and now they are stuck. And so I don't think that they planned for outrage to become the center of social media, but I think it's because they don't know what human beings are, that they failed to see that and that they don't have the wisdom needed to do what they did, which is why it happened. And so now that it's happening, for sure, there's definitely people that are going to politically maneuver that to their advantage. And I think that that's. Of course, it is the danger. This whole tech thing is dangerous because. Although for now, the companies mostly want just to sell us stuff, but we can see how the companies are being politicized and so as the companies are becoming politicized, then the data mining is going to become more and more politically tinted. It's just inevitable. There's no conspiracy about it. It's just happening already. And so, yeah, I don't know. It's like, at some point, what's going to happen? I mean, maybe we'll have to leave the. So the, the platforms. It's possible that can happen. So Norm Clone says. Hi, Jonathan. Might an idea of the Christian might. Might a function of the idea of the Christian eschaton be as a means of hope or guidepost to pull you out of the lowest of lows when your story no longer affords you meaning and you find yourself in between stories? Any other insight you may be able to offer into this mystery would be great. Greatly appreciated. I think that, yes. That it can play that role in the sense that I think that like anything you do, if you have your eye on the end, then you'll do whatever you're doing better. Right. If you're making a table and you don't have an eye on the end of the table, then you're not going to make a very good table, are you? If you're distracted by other things as you're making the table. And so I think that the idea of, of eschaton and having this notion of end, you know, and the Church fathers sometimes represented also as your end. Like, you know, remember death, but also remember the judgment. Like, remember judgment. That is a way to stay focused on the end and then try. And then you will make. You will live your life the best way if you, if you are attentive to the end. But. And so in the sense that it can pull you out of the lowest of lows, mostly lows, in the sense of when you're being distracted by your passions and you're being distracted by the world and by riches and by all the crap, you know, that is around us. Like, when you're too distracted, then focusing on the end is obviously going to help you to stop being so dispersed. So John Valenzuela asked, hi, Jonathan. What are your thoughts on the grit reset insofar as it relates to patterns that are playing out in the world. Thanks for all you do and keep up the good work. Well, I'm probably the thing about talking about that on YouTube is that I'm gonna get banned and my videos are gonna get shadow banned, but I'm not gonna stop myself completely. But I, you'll notice sometimes I try to avoid using certain words and I Try to use other words and just so that I can say what I need to say. And I'm not going to get banned. But I think that the thing we need to pay attention to in terms of all of this, it has to do with the question of systems of total control and system of total identification. And I've talked about this before in my video on. On 666 symbolism. I might make another video on that. Because this notion of the possibility of encapsulating someone's identity in a quantifiable way is extremely dangerous. It is an extremely destructive act upon human nature that you can think that. So like Schwab's. One of Schwab's contentions is that the next decade will join, will create something which will fuse our biological, physical and digital identities completely together. And so this is impossible. This is a complete impossibility. And to try to do that is a. Is a truly like satanic gesture because you can't contain everything. You just cannot. There are no systems of absolute control. And to try to create it is a Tower of Babel, the likes of which have never existed before. And so, and especially if, like you are, your identity gets swept up in this online space, it gets swept up in these online systems. It also means that you can be erased from existence. And that can really happen. We've seen some glimmers of that already, and it seems like it's all going in that direction. Connor Mitchell asks. Hello, Mr. Pedro. How many questions are left? Man? There's a lot of. There's a lot of questions left. All right, Salami Jo, in your work you are very much concerned with reviving many of the pre Enlightenment Christian traditions of the West. With it being the 400th anniversary of the Mayflower Compact. I was wondering, for us ethnocentric Americans, is there any traditions and folktales of early colonial America or Canada to Appalachia, Old west, et cetera, that you believe have enough cosmological patterns to it to be worthy of discussing? And if you would do a symbolic review of any of them. Thank you for your time and for hearing my request. I don't think I know enough of your folktales, so I don't really know, like, I don't know what it is. Like, I know in Canada, I. I told you guys, I'm just not, not as much a Canadian as I am a French Canadian. So I do know a lot of French Canadian legends. And they're. Some of them are pretty, are pretty powerful. A lot of them have to do with the devil, like kind of folk Catholic tales about the devil hiding in different, different guises and stuff. And so I'd be happy to talk about that if you guys point out to me which American legends are, are actually worth their salt. Maybe I can, I can see if they can. If they can hold up when they're being analyzed. So. Hi, Jonathan, what is the symbolism. So Dorothea asked, hi, Jonathan, what is the symbolism behind St. John the Apostle resting his head on the chest heart of Jesus? I mean, I think that it, it's a very, I think it really has to do with St. John's mystical function, how St. John reveals the mystery of Christ. And so you kind of have the three, three gospels that are, are, are, are extremely important, but are more exterior in the sense that they seem to manifest more to talk about events and talk about things that happen. Whereas in St. John's I mean, the level of mystical discussion that happens in the gospel of St. John is astounding. You know, I always find it funny. Like, I remember when I grew up, people would tell. I remember, like people in my church where I grew up would say, would tell people to read the gospel of John first, I guess, because they like John 3:16, and they would tell people to read the Gospel of John first. And I was thinking, man, you should never read the Gospel of John first. You should read the Gospel of John last. Because you. How could you understand the things that Christ says in that gospel if you don't even have a sense of who Christ is? Because some of the things he says are just wild and they're wild and we go. We just like, gloss over them when he says, you know, I be one like I and the Father. And this whole discussion about unity between him and the Father and how he wants that, he wants people to be one at, you know, the way that he's united with the Father and the Father in him. The Father, Father and them and them and the Father. And it's just like this, like, wow, this like, whole discussion of, of how God is related to us and how we can enter into the life of God. Like that is stuff. That stuff is hard to deal with. All right, hopefully that that answers that. So the wakeful Azer Jonathan, my friend who you helped last month with the question on the resurrection, suffers from extreme anger at the peoples responsible for starting the Iraq war and other wars. He longs for justice and retribution and links this desire to his Protestant upbringing. How does this longing fit into the symbolic worldview? I observed that this longing also fuels the SJW phenomena. And indeed my friend became very political after he lost his faith. I mean, I think I understand. So the thing about, the thing about Christian anger or Christian frustration at injustice is that it has to cycle. It's not, it's okay to look at the world and notice how unjust it is and notice how people are not being the way they should and, and how evil people do evil things. I think that's totally fine and I think it's important to not be naive about that. But I think it has to always cycle back inwards. We also always have to see how, as Christ told us, if you hate your brother in your heart, then that's as bad as in terms of spiritual effect on you. It's as bad as killing them. Like there's something, there's something about this inner examination which always, always has to be part of it, you know, And I think that that's probably the way to deal with it is you always have to be willing to, as you're angry with the world outside noticing the injustice, you always have to kind of look back on yourself, see how you participate in that and see how you also hate your brother. And that can at least maybe alleviate a little bit of the, the feeling of that you are, that you have self righteous anger, you know. All right, so Radu Bompa asked Matthew makes some points about, about this in his book, but could you bring some more insight on the symbolism of Sabbath maybe in relation to the eighth day? And so the Sabbath is very, very mysterious. It's a very mysterious thing about the idea of rest. And especially in Christian symbolism there's like, if you, if you've ever been to an orthodox service for holy Saturday, man, the mysteries that are in that text are just insane. Like the idea that the day that Christ is in the tomb is the Sabbath, like it's the holy Sabbath wilds, It just, it just really crashes all your categories. And so, so it shows you that there also is an aspect of the Sabbath which is, there's an aspect of the Sabbath which is holy. And there's an aspect of. It's a very con. It's a very difficult category because there's an aspect of the Sabbath which is holy and is set apart. There's an aspect of the Sabbath which is death in the sense that it's that which remains which shouldn't be calculated. And so that which remains which shouldn't be calculated is also related to the holy. This is why I keep telling you guys that there's a relationship between Death and glory, which is why we have martyrs, which is why we have all of this. And I'm not saying that death is good. It's not. It's not the point. I'm saying that there is a relationship between the garments of skin and the garments of glory, that they're made of the same stuff. And that that's why a martyr, by humbly accepting death for something higher, transfers that death or that rest into a type of glory and so into something holy. And so that is the mystery of the Sabbath. I can't say more because, man, the Sabbath will just wreck your brain if you try to think about it too much. And the eighth day has more to do with this kind of resolution in Christ of both his death and his resurrection in his person. So the eighth day is the first day and the last day, the day of eternity, you could say, in which the problem of the Sabbath, or the question of the Sabbath and this day of rest, remainder, glory is also connected to production. And that's what creates the holy city, right? That's what creates this, this final image of everything which contains both the productive world and also this, this, this, this glory which shines upon it. You could say, like, I'm talking in total metaphorical terms, guys, and I'm sorry if. I'm sure anybody would listen to this, this would be the first time that they hear me talk about something, but will think that I'm just spouting absolute nonsense. Hopefully for those who have watched enough of my videos, you see that I'm not, or trying to talk about things that are very difficult to think about. So, Walrus King, I'm not going to ask you. Sorry, I'm not going to read your question, man. It's just too much. I'll send you a little note because it's an important question. I'll send you a little note and we'll talk about. All right. So Brandon asks, what is the deal with Seth, the son of Adam? I've heard that there is a linguistic connection between Seth Set, the Egyptian God, and Satan. Could this Seth be related to Satan? I don't think that it has anything to do with Satan, really not. And I'm not sure that the Seth in Scripture has any etymological relationship to Satan. And even the whole set thing, I think, is not like, I don't think it's totally legit. Sorry, I'm not totally sure that that's legit. For all my love of the man who, who, who propounds this, this, this idea Seth is related to the, the. The re. To the rest, it's a restarting. So you can understand the. If you understand the genesis as these little cycles. All of, all of Genesis is like these little cycles. And so one of the cycles ends with the Cain killing Abel and then Cain being exiled. And then Seth appears as a, like a new beginning and like a new Adam. So it's like a, it's like this, this. So you can imagine Adam and Eve fall, they get chased from the garden and then Eve gives birth to, to Cain and Cain is a new Adam. And so it's like a restart and then that falls apart. Cain can. Kills Abel and then that falls apart. And then there's a new beginning with Seth. And then after that there's there are other cycles which, especially the one which goes all the way then to the Flood. So then there's this relationship between two genealogies, the genealogy of Seth, the genealogy of Cain, which are in conflict with each other, which leads ultimately to another end. And then Noah starts the game again on the other side. And so it's like these cycles. So that's what Seth. So there are all these weird traditions about Seth being let back into the Garden of Eden. There are all these traditions about how Seth was given a branch from the tree of Life or a branch from the tree of Knowledge that he planted, that he gave, passed down his lineage and was planted by Noah. Like there are all these weird traditions which are there to help you understand that Seth plays the role of Adam in a new cycle. That's the best way to explain it. All right, so Oliver Erickson asks. Hey Jonathan, thanks for making the silliness of Christianity tangible. What, what is your view on Buddhism and how does the notion of emptiness relate to the Christian God? I make the silliness of Christianity tangible, man. That's almost like an insult, I guess. Not sure I understand that, but what is my view on Buddhism? It's like, I think, I think Buddhism has a lot to, to offer in terms of helping you understand stuff. I think that, I think that it lacks some aspect, to be honest. I think that. I think for sure. I think that Mahayana Buddhism has more fullness in terms of the things that I'm talking about and in terms of the, the Great Chariot and also the, the idea of bodhisattvas and this notion of bodhisattvas that sacrifice themselves in order to then go and get the others. And so I think that in that there's something which is similar or akin to the self sacrificial love that you find in Christianity. And so I think that there are some interesting things in Buddhism, but I do feel like there still, at least to my sense is I still feel like there isn't that notion of this just total joining of heaven and earth. There's rather this desire to kind of ascend and leave behind, you know, the illusory aspects of reality. But if you. This idea of illusion is. Is a problem. It's like the notion of illusion. Every time someone tells me that something is an illusion, I always, like, think it's an illusion. So if it's an illusion, it's an illusion of what? Like, for something to be an illusion, there needs to be something. There needs to be something behind it, which it's. It's an illusion of. And so I really struggle with. With some of those aspects. And so I think that, for example, like, like I've read the thing about Buddhism is it's a wide too. It's like. But I have read sometimes where the notion of emptiness in Buddhism is formulated in a way which seems to not deny the relative reality of all the different layers of manifestation. And so when I see that kind of stuff, I'm like, okay, this is better, like, at least in my understanding. But yeah, I still think that it doesn't, it doesn't offer. It just. It doesn't offer what, what Christ offered. But I, but, but it's. There's the definitely like, you know, I take a Buddhist over a new atheist any day. All right, all right. So, Jan Peter Jager asks, among Western painters, there was the lining color debate. What would be according to an orthodox approach from iconography to this question? I mean, the lion and color debate, I think it's just the general problem of opposites. It's just a one manifestation of these, of the tendency we have or the inevitability we have to organize the world in terms of opposites. And so, you know, I, I think that you can transpose the color line debate in the history of iconography. You can. You can definitely find painters that paint more from within towards the line, and then some painters that paint more from the line towards the color. And, and so there's a tendency to marginalize the line in some traditions and then some tendency to. To see color just as a filling in of lines. Right. And so I think that definitely you can see, you could probably understand it in a left, Right, type of symbolism, you know, with the importance of limits, whereas the importance of a kind of improvisation. You know, that's probably something that you could Understand. You could understand some of the history of iconography related to these types of opposites. You could say. All right, so I think I'm done with the questions. It's like these Q and A's keep getting longer and longer, and what's going on with that? All right, let me check to see. I think I did see some. Some. All right, okay, so I see that. All right, so Honest Joe Biden. No, it doesn't start there. It doesn't start with Honest Joe Biden. He started with Andre Johnson. So what do you. So Andre Johnson says, what do you think is interesting in the legends of Charlemagne and his peers? One of the. The thing that I find interesting in the. In the legend of Charlemagne is just how superhuman he comes out in a lot of these legends. You know, like, if you read the. If you read the. The Song of Roland, for example, it's like Charlemagne is. It looks like this old God that is, like, who's like, hundreds of years old and is, like this gritty, almost, you know, like inhuman. Almost like inhuman character. And so I just. I just like the fact that people are capable of kind of telling those stories. And so that's probably like the Song of Roland, probably. Obviously, and I'm just being cliche here, is obviously probably my favorite legend in terms of Charlemagne, you know, and how it manifests this. This relationship to the outsider, you know, and also, like, in the legend of Charlemagne, you really get, like, a. Like an interesting vision of the outsider, you know, the. The Saracens and how they're caricatured. But if you go. If you. If you. If you understand the caricature as. As this inevitable projection into the other, you know, and understanding this inevitable kind of monstrous presentation of the other, then you can kind of understand it. And there's something about the way that. That they're presented that can help you understand the process itself of how we view strange things and how they present themselves to us. So that's probably one of the most interesting things I find in the legends of Charlemagne. But they're not as good as Arthurian legend. I mean, that's probably wild. So they've been mostly discarded. All right, so Honest Joe Biden, what does he ask? So why does my luck seem to be so inordinately bad? Come on. You just won the. The. You just won the presidency. Your luck is probably. You probably. I'm not gonna say anything about your election. Americans. All right, okay. So my personality seems to be quite winning at times, albeit I am a bit of a contrarian. But it doesn't add up. It shouldn't be this bad. What the F is going on feels metaphysical. I mean, I don't know. It's possible, you know, when things go bad for us, it's. It's probably usually a time for us to re examine our priorities, no matter what the reason for it is for. For things to go bad for us, you know, so. Sorry. I don't know. I don't know. So Matt asked, what do you think of Eastern Catholicism? And you're trying to get me in trouble here for $5? So have they successfully integrated west and East? Or are they trying to tie together two things that do not fit? So I would say that Eastern Catholicism is playing. Is. Is. Is playing the role of the margin. It's playing the role of an in between category for the positive and negative aspects that that has. Which means that on the one hand, it will always be seen. It will always be in danger of being seen as a compromise from both sides. It will be seen from the side of the Catholics as a possible bridge to get the Orthodox into their thing. But if there's ever a true union between east and west, and I don't mean like a fake, you know, fake compromise union, but an actual true union of communion, which would happen through a mutual understanding of the divides and a reconciliation of the theological divides and ecclesiological divides, then those Eastern Catholics would play a central role in making that happen. So that's what I think. And I have sympathy for people who go that direction. I just. I definitely have sympathy for them because, you know. Yeah, it's not easy. Our options are not easy, folks. It's the end of the world. What are you gonna do? All right, Paul Vander Clay. Hey, Paul. That's awesome. Never done a super chat before. I just want to support Jonathan and his channel. It's good to see you, Paul. I don't know if you're still around. It's. It's. We've been going at this for a long time. You know, I didn't watch your video. Paul made a video about my discussion with rationality rules today. So I have to watch that. Watch it tomorrow. I will definitely do that tomorrow. So it's good to see you. So Mac W asks Charlemagne named is sword joyous. Was it to incarnate the happy warrior archetype? I think that it definitely has something to do with that. There is something about. So you got. Are certain sword styles cruciform for symbolic reasons. I think that. I think that. I think that at the Beginning they def. Probably necessarily, at least not consciously. But I definitely think that as Christianity developed then that image of the cross and the sword, definitely that symbolism could not be avoided. And so they became joined in very strange and contradictory ways if you think about it. But nonetheless you can't avoid it. And I think that Charlamagne did embody that. If you, when you read the things about Charlemagne, he did seem like a really impressive character. Like he, you know, he, he would like to, I mean some of it's not great. Like he was obviously had many, many women and he, he would, you know, he would like hang out in hot baths. Like he loved to take hot baths with people. And he would have all these meeting in these like kind of spas where he would hang out with his aristocracy. He was definitely a character man. All right. So the Sid asked. Hi John, if you could explain the symbolism of smoking cigarettes or a pipe. Also, any tips for someone looking to start carving? That's an interesting question because there definitely is a difference between a cigarette and a pipe. There's something aristocratic about a pipe for sure. And then there's something about egalitarian about the cigarette. And even in the whole aesthetic that the cigarette was used as, there's something industrial about the cigarette and egalitarian. And the pipe has something, I think maybe also because the pipes were carved or handmade or have a. Have. Cigarettes are a throwaway, like you just throw them away. Whereas pipes have a, they have this artistic quality to them or they're made by an artisan and. And so they have a, A more. Yeah, there's something aristocratic about them. I can't totally explain it. I'm being totally intuitive about this. So Stephen Anderson for 420. Oh, the Sid, he get 70 czars. I don't know what those czars are. Are. So Stephen Edison, USD 420. My evolutionary psychology made me give you money. That's hilarious. Yeah, that's hilarious. All right, so the new guy for 1999 USD says, Can you do an in depth video on the symbolism and nature of the Force and if it would be considered a sort of deity suggests the existence of a supreme deity or just an amalgam of religious philosophical ideas. I think that's, it's really interesting because the Force at first was trying to represent a kind of pantheistic, general, non personal spiritual like energy or whatever they call it. So it was always super new Agey from the beginning and, and then it morphed into like these midichlorians or whatever. These like These like microscopic beings that. That. And so it's really. It's really great because it's really the opposite of anything spiritual. It's really the opposite. It's like, it really is a kind of. If a materialist could come up with a religion, it's the force, like, because it's medichlorian, it's like this. Physically, you can find these physical little creatures that are acting like together in a kind of. What is it, like a midichlorian democracy? I don't know how it works, but it just. I just. Adam. Sorry. Sorry to mock Star wars, guys. I know you all love Star Wars. I like Star wars too. But the. The. The midichlorian thing just is. It just. It just blew it for me when that happened. So. Bobby Joe says I'm a Mormon. And your discussions and videos have significantly broadened my understanding that. My friends just wanted to say thanks to. For all you do well. Thanks, Bobby Joe. Little Saigon for $5 says, did you see Sam Harris officially left the IDW over certain members entertaining the possibility of voter fraud. Yeah, whatever. The idw. You guys know, I never identified with that. I never identified with the idw, but it's okay. All right, guys, I think. I think. I think we're done. And so what. Thanks for. Thanks for. Thanks for coming out, guys. And these are getting longer and longer. Maybe one day I'll be able to last for three hours, like a Joe Rogan of some kind. And so it was good to talk to everybody, happy that everybody showed up. And I will see you guys next month. So bye. Bye. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to. To get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
