{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":0.16,"end":61.93,"speaker":"Laura Diaz","text":"Tucson, the weight is over Mediweight loss. They're officially open on North Oracle road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight and serious risks at mediweight loss. I got the same medication but with a customized plan, weekly check ins and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com as you say, those are."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":61.93,"end":73.81,"speaker":"Peter Leithart","text":"Patterns that are there in life as well as in the text. And part of the value of recognizing the Bible is it illumines those life patterns. We can begin to see the movement of our lives through these Bible eyes."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":73.97,"end":86.35,"speaker":"Jonathan Pageau","text":"Yeah, I mean I think that that to me has been the most crucial thing. You know, a lot of the things that I do is to help people see how the Bible in some ways is the trues version of a pattern that fills everything. You know, it's not."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":86.35,"end":86.63,"speaker":"Peter Leithart","text":"It's."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":86.63,"end":195.86,"speaker":"Jonathan Pageau","text":"You know, it's actually the pattern of creation itself. It's the pattern that God created the world with. And therefore it can be found in all things. But in scripture definitely it appears in its most pristine form. So in some ways it's a. It's like a tuning fork even beyond even just the morality. Because we often think of the Bible as just offering us moral codes. But beyond the morality. It's a structural tuning fork for. For our. This is Jonathan Pedro. Welcome to the symbolic world. Hello everyone. I am here with Peter Leithart. I think most of you who are watching this will know who he is. Peter is the president of the Theopolis Institute. He's also writt written number amount of books. You know, he's been in ministry also for most of his life. And so those of you have seen that I've already interviewed someone from Theopolis. And what you don't know is that one of the very first public discussions that I had, I went to University of Toronto. Someone came right up to me. His name is Berl. Hernia check. Great, great guy. He gave me a book by James Jordan called Through New Eyes. And I never heard of this whole strain in kind of Protestant thinking. And I explored some of the images, and I thought it was very beautiful to see this. This powerful, plunging into the worldview of the Bible and kind of taking very seriously all the analogies and the typology. And it was similar to the things that I cared about. And so I thought it'd be a great, great way to continue the discussion with Peter. And so thanks for. Thanks for talking to me."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":195.86,"end":200.14,"speaker":"Peter Leithart","text":"Yeah, thanks for having me, Jonathan. It's a pleasure to meet you and to have a chance to talk to you."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":200.7,"end":206.25,"speaker":"Jonathan Pageau","text":"So tell me a bit about the origin of Theopolis and kind of what the mission of your institution is."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":206.25,"end":389.58,"speaker":"Peter Leithart","text":"Yeah, well, you pinpointed a key origin, and that's James Jordan. Jim ran a ministry called Biblical Horizons in the Panhandle, Florida, for many years. I was part of a group that did an annual conference for about 25 years down in the Panhandle of Florida. And we explored the Bible. We did a lot of work on obscure passages of the Bible. We did a lot of work on the Levitical sacrifices and on the Temple and Tabernacle. Jim was very fascinated by the Temple visions of Ezekiel, and so he gave lectures on that. And we had worked together for 25 years. It dawned on me in my mid-50s that we were all getting old and we had no institutional setup to enable our work to last beyond our lifetimes. Biblical Horizons, Jim's organization was set up as a way for him to do his writing and teaching. But Theopolis was set up in order to capture and then expand on and perpetuate what we had done in Biblical Horizons. And that's a key theme of Theopolis, and that is trying to deepen a Christian's understanding of Scripture. We have various programs. Our key program is a fellowship program where pastors and seminary students, people who aspire to church leadership, go through the program. And it's largely a Bible program. The other aspect of it has been a liturgical effort. Jim Jordan, again, is the inspiration for this. When he was in Texas many years ago, he started reading writers outside of our Reformed Protestant tradition, like Alexander Schmemann, a Russian Orthodox writer, Jean Danielleu, Roman Catholic, Henri de Lubeck, another Roman Catholic. And we started thinking through liturgical issues still within a framework of a Reformed Protestant understanding of worship, but with these other, more Catholic influences. So the one part of Theopolis is liturgical theology. So biblical and liturgical theology are the two primary things. And our conviction is that the church exists to provide living waters for the world. The image of Eden, where you've got the Garden of Eden with waters flowing from it, that image of a place of God's presence with waters flowing out, that's picked up in the Temple and picked up in Ezekiel's vision of the temple. That's the vision that we have for mission. But it starts with what happens in the sanctuary. It starts with worship. It starts with our understanding of Scripture. And when we are deeply grounded in Scripture and when we're embracing the beauty and the richness of the Bible, worshiping faithfully, gathering around the Lord's table, then churches of that sort provide living waters that renew the world. So that's the basic vision of Theopolis."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":390.06,"end":414.14,"speaker":"Jonathan Pageau","text":"I'd like you to take me back to the first moments, these first discussions you were having with James Jordan and yourself and kind of discovering. Maybe take me back to how. I don't know how it felt or what it is that you were experiencing, discovering all of this. Like, was it a kind of archeology where you were finding it from the texts themselves, or was there reading, you know, church fathers or rabbinical writers? Like, what was this? What was the bubbling?"}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":414.59,"end":503.58,"speaker":"Peter Leithart","text":"Yeah, there were a lot of different influences, some from the church fathers, not primarily, I don't think. And there were some from other contemporary scholars. I would say again that Jim was the main inspiration. He has a biblical imagination that I think is unparalleled. And so he was inspiring a lot of our interest in it. And we got attached to him, and we started kind of looking over his shoulder as he was reading the Bible, trying to figure out how he was doing it and trying to imitate what he was doing. And then over the course of a couple of decades, you have a small group of teachers that are working together, and we almost developed a single mind. We're thinking about the Bible in similar ways. We can almost finish each other's sentences. When we make a little passing comment about a passage, then we know where it's going to run after that, because we've all been working together for so long. But, yeah, it was really more what you called archaeological. We're trying to figure out what the text means. Our premise, our beginning premise was, as Jim likes to say, the spirit does not waste his breath. The Scriptures are inspired by the Holy Spirit of God. And there's nothing in there that's extraneous. So even the things that seem like you could just dispense with them are there for reason. And so coming to the text with that conviction, I think that was. That's really the basic premise of what we were trying to do."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":503.9,"end":529.27,"speaker":"Jonathan Pageau","text":"Yeah. You mentioned going into the difficult text, you know, and that really is in some ways the test. And I understand that, like some of the texts in Leviticus, you know, some of the stories in Judges, all of these maybe tell us one of the moments where you've had an insight, where you just. A story that just made no sense or something that looked completely random or arbitrary. And then suddenly that connection, you know, I've experienced it too, but I love hearing about that."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":529.27,"end":834.61,"speaker":"Peter Leithart","text":"Yeah, well, I think probably in the Book of Judges would be a good place to think about because one of Jim's early works was a commentary on the Book of Judges, and so he's favorable to the Judges. He thinks of them as Christian heroes, not flawless heroes, but Hebrews 11, the great list of the faithful from the Old Covenant that includes a number of the Judges. So even people like Jephthah, whom we think of as primarily think of somebody who made a rash vow and perhaps sacrificed his daughter. He's listed in Hebrews 11 as one of the heroes of the faith. So it was. There's things in the Judges and one of the things that really more of a pattern than something that's a single episode, but it's a recurring pattern that occurs not only in Judges, but in other parts of the Old Testament. You have people who are killed by massive head trauma. You have Sisera who goes into the tent of jail. She puts him to sleep and then pounds a tent bag through his head. A couple chapters later you have Abimelech, who is the son of Gideon, and he's attacking a tower and a woman tosses a millstone from the top of the tower and it crushes his head. You move into First Samuel and you have David doing the same thing to Goliath. You have these head crushing moments that once you see a few of them line up, then you think, this is deliberate. There's something going on here. And the obvious thing is that goes back to the promise of Genesis 3 that the. The Lord is going to give to the woman, the seed of the woman who's going to crush the serpent's head. And so you have this recurring theme of head crushing events. That. That was. That. That's. That's a theme where you have, you know, an odd way to die. It doesn't happen a lot, but it seemed to happen an awful lot in Bible times that people died by massive head trauma. But I guess, you know, something like Leviticus, the things that. The things that have come home to me are things like just the structure of sacrifice. I puzzled over that. I'm currently writing a commentary on Leviticus, and I puzzled over sacrifice for a long time, and I suspect it's true generally in Christianity, certainly among Protestants, that what we notice in the sacrifices is the violence of killing. You have an animal that's alive and you slice its throat and drain out its blood, and then you put it on the altar, and it looks like a straightforward enactment of the cross or prefiguration of the cross, where you have some substitute, some representative dying on behalf of the sins. But recognizing that that's just one moment of sacrifice, and recognizing that sacrifice is both death and transfiguration and that the movement is through death to transfiguration and glorification, recognizing that movement of sacrifice has been a key moment. If I could mention one other thing, one other maybe, maybe good example, what Jim, I think, taught us to do was to recognize that the odd details fit into sequences and patterns and storylines. So there's this really strange moment after Jacob has left Laban's house. Laban's caught up to him. Laban didn't want him. Laban has been abusing him for years. But now, once he's left, Laban doesn't want him to leave because he knows Laban's been prospering because Jacob's been there. And so he catches up with them and he says, my household gods. You've got my household gods. And they are there, but they're under saddle and Racha's sitting on them, and she claims to be having her period. Odd little moment says something about the. The power of those gods that they can't even, you know, push a woman off of them. They can't make any noise. They can't say, help, help. I'm, you know, Rachel's sitting on me. I'm over here. I'm over here, Laban. But it's also an act of humiliation of the gods. And once you put it in that context, then you see it's part of an Exodus storyline that runs constantly through the Bible. You have it in that story where you have David, Jacob, rather, departing from a land of oppression. The oppressor chases him down and tries to capture him. The gods of the oppressor are Being humiliated. And then Jacob goes on and re enters the land. And there's a conclusion to that as a re entry of the land. The same thing happens in the big Exodus. In the book of Exodus, a lot of the plagues are directed against gods of Egypt. Isaiah is full of this when it talks about the great second exodus out of Babylon and all of the humiliation of the gods. He's mocking the gods. Israel still worships idols and they don't realize that they're carving an image out of wood and then they're burning the rest of the wood to warm themselves and to cook their food. So the humiliation of the idols is a recurrent theme, but it seems like an odd little detail until you see it in that kind of sequence."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":834.77,"end":883.85,"speaker":"Jonathan Pageau","text":"Yeah, yeah, I've definitely thought a lot about that story. I am kind of like you when I see stories that look completely crazy in the Bible. Like, I get fixated on them and I'm just trying to, like, why is this here? Like, why did they mention it? You know, why is this detail worthy of mention in the story? You know, and I definitely also, in terms of this particular story, there seems to be a relationship also with the idea that Rachel is bringing back the residues of this world into. Into Israel and that this is actually related to menstruation as well. Like, it's kind of residue of the cycle that's being carried into the. Into the land. And that will in some ways have repercussions later in the story of Israel in terms of not destroying the old gods and kind of keeping the, you know, keeping the old things that you should have left behind, you know."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":883.85,"end":928.45,"speaker":"Peter Leithart","text":"Right, that's a great point. Once they get into the land, Jacob tells them to put away the gods that they brought out of Haran. So there is a moment of repentance, but that is a recurring thing, of course, you get all the way to the end of Joshua. And Joshua, in his farewell speech to Israel, tells them, reminds them that they worshiped idols not only in Ur, where Abraham came from, but they also worshipped idols in Egypt. And I think that's the first time we have an explicit statement about Israel had succumbed to the Egyptian idols. But it's all the way until the conquest is over now and there's still clinging to those old gods. So, yeah, that is definitely a part of the story of Rachel."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":930.45,"end":984.93,"speaker":"Jonathan Pageau","text":"And so I think one of the interesting things, and maybe you can comment on this and tell me what you think, is that there's a strange moment where, you know, if we look at some of the more materialistic approaches to reading scripture, like 19th century type academics, you know, that had a very historical minded and very, you know, it seems to be that as you take the, the more you take the Bible seriously, like the more you actually want to understand this completely in every detail, in every aspect, that you cannot avoid analogy. Like you cannot avoid using modes of interpretation that use this noticing of repeating, repeating patterns. And I'm curious if how you see that in relationship to believing that these things happened. You know, this is one of the criticism people have about scripture. How do you see the relationship between the event and aspect of the story and this patterning of the, of the, of the stories."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":985.49,"end":1033.53,"speaker":"Peter Leithart","text":"Yeah, on the, on the point about analogies within different stories of. And accounts of the Bible, obviously that's there and that's in some sense that's recognized by the critical scholars that you mentioned. What they do with that though is dull and unimaginative. Not, not to mention just plain wrong. You know, if you got two stories of Abraham deceiving a king, he goes down into Egypt and he tells Pharaoh that Sarah is his sister, he goes to Gerar and he tells Abimelech the same thing. You have those two stories, that must be two traditions. They must be competing traditions. And the editor who put those two together a few chapters apart apparently didn't notice that they were idiots."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":1033.53,"end":1044.05,"speaker":"Jonathan Pageau","text":"All these idiots in the past, these morons that spend their entire lives reading these texts from their. Since they were babies until their death. And they're so stupid that they just stuck these things together randomly."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":1044.05,"end":1126.1,"speaker":"Peter Leithart","text":"Yeah, so yeah, it's. It's a, It's a very. It's a. It's a bad way to read it. There's structural things going on there. The parallels between Abram sojourn in Egypt and Abraham Sojourn and Gerar. There's. Within the text there are structural parallels and then there are nuances of difference between the two. I mean, Pharaoh. Pharaoh is not. Pharaoh is not favorable to Abram. He just chases him out in Genesis 12. Get out of here. You brought plagues in my house. When you get to Gerar, Interestingly, when Abimelech finds out what's happened and why the wives in his household have been. Their wombs have been shut up. He asked Abraham to pray for him and Abram there first time anybody in the Bible is explicitly described as a prophet. And it's Abraham who's praying for Abimelech. So you have this shift in the attitude of the Gentiles to Abraham between the Time in Egypt and the time you get to Gerar. And if you're just thinking these are two variations of the same story, you miss a crucial part of the progress of the Abraham story where he's actually having an effect and finding a more favorable reception among the Gentiles later on in the story than he did at the beginning of the story. So that was. Can you repeat the second part of your question? Because I think I've lost it. You mentioned analogy."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":1126.1,"end":1169.35,"speaker":"Jonathan Pageau","text":"No, I mean, I think that the. I think you did answer the question. The second part was about, you know, how people will criticize the event aspect of it. Right. In the way that you did, where they'll say. They'll say, well, you know, one of these is a version of the other, and we just stuck them together, you know. And, you know, I think you definitely answered what you're saying. And there's even more to that, which is that it's like our lives are made of rep. Repeating stories all the. Like our entire lives are constantly. Like every. Every wedding, every. You know, it's like we just. Every Sunday, every Saturday, like every week, every day you go to bed, you wake up in the morning, and the weird idea that. That the world doesn't rhyme that way, even though your entire life rhymes that way, is such a strange way of seeing reality."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":1169.35,"end":1310.89,"speaker":"Peter Leithart","text":"Right? Yeah, that's. Rhyming was exactly the word that popped into my mind when you first asked the question that it's not just the stories that are in the text that rhyme. Because you could explain that by saying, well, you've got this scribal tradition, and you've got scribes who know the old stories. And so they're making up new stories about people who never existed, about events that never happened. But they're using the materials of the old stories just to connect them with that tradition. I think, in fact, I mean, recognizing those kind of relationships. One aspect of typological interpretation, I think typology is not. Is not merely a way of reading scripture, but it's a theory of history. And the theory is that history rhymes because God is a God of consistent action. God does the same thing over and over again. That's on the face of it in the Bible. I mean, when Israel's in exile, when they're being oppressed, all they want is another exodus. And they keep reminding him of the old Exodus. Do it again the way you did it in the past. The other thing, too, this is another example of that. We talk a lot about chiasms at Theopolis. A Particularly literary structure, where you have corresponding sections within a text. The first part of a text corresponds to the second part, to the last part. The second part corresponds to the next last part, and you kind of move into a center. That seems like a really kind of weird way to organize a story or an argument. It's actually very common in the ancient world. It's not just in the biblical world. You can find that. You can find chiasms all over Homer and other ancient texts. But it's also, as you say, it's just the pattern of human life, the daily pattern of human life. We wake up, we have a meal, we work for a bit. The center of the whole day is the midday meal. We work a little bit more, we have another meal, we go to bed, and we sleep, and then we start over. Every day is structured like that. Lives are structured like that. We begin as helpless infants. If we live long enough, we end as helpless, virtual infants. And as you say, those are patterns that are there in life as well as in the text. And part of what the value. Part of the value of recognizing the Bible is it illumines those life patterns. We can begin to see the movement of our lives through these Bible eyes."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":1311.97,"end":1354.49,"speaker":"Jonathan Pageau","text":"Yeah, I mean, I think that that, to me, has been the most crucial thing. You know, a lot of the things that I do is, is to help people see how the Bible in some ways is the truest version of a pattern that fills everything. You know, it's not. It's. You know, it's actually the pattern of creation itself. It's the pattern that God created the world with, and therefore it can be found in all things. But in Scripture, definitely, it appears in its most pristine form. So it. In some ways, it's a. It's like a tuning fork, even beyond even just the morality, because we often think of the Bible as just offering us moral codes, but beyond the morality, it's a structural tuning fork for our lives. You know, So I don't know if you thought about that a little bit."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":1354.49,"end":1397.89,"speaker":"Peter Leithart","text":"Yeah, I think that's analogous to what John Calvin says early on in his Institutes of the Christian Religion, which was his major work of theology. He's talking about the relationship between the created natural knowledge of God that we have and special revelation in Scripture. And the image he uses is lenses, spectacles. So because of sin, because of our lethargy, for various reasons, that we don't see the world clearly. And we need Scripture in order to recognize what's actually there. So it's not that the Bible puts us in an imaginary world that's separated from the real world. It's a. Gives us a. Gives us access to the world as it actually is."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":1399.49,"end":1478.42,"speaker":"Jonathan Pageau","text":"That's a real. That's a huge shift because there's a kind of unconscious bias that we saw in a lot of modern, I think, textual criticism and a lot of modern, even biblical scholars is, in some ways the lens they have is actually kind of modern rationalism. That's their lens. And then they look at Scripture with that lens, and then they break it down and they cut it up and they do all these things. But there is something about the way the Bible is written and the way the Bible has functioned in Christianity from the very beginning, which is closer to what you're saying, which is you have to. Have to step into the world and then take the Bible on as a set of lenses to look at the rest of the world with. And that changes completely the perspective in which even you. The way you approach the text, the way you interpret them, the way that you. You also act with a kind of reverence towards the aspects that you don't understand, because that's something that you see all the time in biblical scholarship, a kind of arrogance towards things that they don't. That they don't understand. And maybe you can take us down the slide because you said that this way of seeing has also affected the literature, your vision of liturgy. So I'd like to hear a little bit about that. Like, what are the things that. What kind of changes has it brought to your liturgy?"}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":1478.42,"end":1646.69,"speaker":"Peter Leithart","text":"Yeah, this is related to that question, but it's part of a response to your previous comment, and that is, I'm a Protestant. We put a heavy emphasis on word teaching, the preaching of the word. And I think in a lot of Protestant circles, what that means is you're using the Bible in order to extract doctrinal content, or you're using the Bible especially in post Reformation. There's certain strains of post Reformation Protestantism where the primary goal is to extract some applicable moral exhortation in medieval terms. What you're trying to get out of the Bible is tropology. You're trying to give moral direction. And I'm certainly not opposed to moral direction. I think the Bible does give us moral direction. But when I teach pastors, when I talk about preaching, I encourage people to think of what they're doing, not only in terms of telling the truth, trying to encourage people in love and good works, but also to target the imagination and enable people to see the world rightly. That is to see the world through the lenses of Scripture. So part of the answer to the question of liturgy is the way that preaching is done and that preaching is, I think, rightly targeted, not just at the will or at the understanding, but also at the imagination. The other side of it. I mean, we, at Theopolis, we use and advocate for fairly traditional forms of liturgy. If you were to come to a Theopolis event, what we're doing is, looks like a prayer book liturgy similar to a prayer book liturgy in the Anglican Church, similar to a Lutheran liturgy. This has not been the primary, that's not been the primary mode of liturgy in the reformed tradition. So we're something of outliers within our own, with our own tradition. But there's a number of things I think that the typology has affected. I mean, just think in terms of the events of baptism, of the Lord's Supper, the two sacraments that Protestants, most, most all Protestants would acknowledge. Some Protestants would add, would have several others. But you have. Those are, those are biblical rituals. They're biblical rituals that have this incredibly rich setting around in the Bible. I mean, you think Alistair Roberts was just here teaching at our fellows program, and he did a lecture on baptism. And if you're going to start talking about baptism, you're going to start in Genesis 1, when the world is formless and void and darkness is over the face of the deep, but the world."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":1646.69,"end":1649.37,"speaker":"Jonathan Pageau","text":"Starts, is above the water. It's like right there."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":1649.37,"end":1706.12,"speaker":"Peter Leithart","text":"Yeah, the world starts in water. And then you try to trace the themes of water throughout the entire Bible. It's, you know, everything is there. That's all part of our understanding of baptism. But then that all comes to a focus. All that biblical symbolism and all that biblical, all those biblical patterns, all those biblical stories are taking concrete, real form within the church when somebody's baptized or something is true with the Eucharist. When you celebrate the Eucharist, you're having a meal, but again, you're gathering together all these countless meal events that are in the scriptures. You could say the liturgy is where those types become concrete and real for the church. Those types of water rescues by water, destruction and renewal by water, those types of covenant meals, communion with God, all those, all those events of the Bible, they become concrete and real for the church and the liturgy."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":1706.52,"end":1741.75,"speaker":"Jonathan Pageau","text":"Yeah, yeah. And this is something, you know, you talk about Father Alexander Schmeemann. You know, this is something that for modern people, it's kind of hard to understand that the sacraments, you know, let's say the sacrament of communion it grounds reality for us. Right. That it becomes in some ways the model for all our other little communions, for all our family meals, for all our celebrations. All of these things, they need a peak. They need something that. That holds the meaning of all these other aspects together. And that isn't something that just happens in your head."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":1741.75,"end":1741.95,"speaker":"Peter Leithart","text":"Right."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":1741.95,"end":1784.99,"speaker":"Jonathan Pageau","text":"It's not. It's not just like a theory, something that you have to actively engage in. And then. So that's also. That's true for that. It's true for baptism as well. Baptism grounds so many aspects of the, you know, the cyclical aspect of our life, you know, the waking and the sleeping, the, you know, the. All the aspects of our life that are related to death are bound in the baptism of Christ and our participation of that. You know, St. Paul says, he literally tells us that we are dying with Christ and resurrecting with Him. You know, it's like it's related to the cross. It's related not just even to the baptism of Christ. It's a little image of what's going to happen later in his life. And so it's a grounding of our reality. And it's not just a flight of fancy. We actually have to do these things."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":1784.99,"end":1898.87,"speaker":"Peter Leithart","text":"Right. Yeah. Schmeman has been hugely influential on when I say our theopolis understanding of liturgy again. Jim Jordan first introduced me to Schmeman's work, and the little cluster of people that were around Jim all read it and devoured it. And when I taught for a number of years at New St. Andrews College, I always assigned for the life of the world. And very frequently it was the favorite book that the students read all year because it didn't read like theology. It read more like poetry than theology. But it's. It's. Yeah, I can't. It's. It's been really formative, not just because it's so compelling and beautiful, but for the reason you said you take these most ordinary things of life. Bread is the staple food of every society, and that becomes that staple food of society, of every society, becomes a means of communion with God. You take wine, which is a more sophisticated kind of drink of celebration, but still it's universal in some form as a festive drink across cultures. And God has assigned these two very simple things as means for communion with him in the liturgy, which is not. This is Mammon's great point, as you know, it's not this little island of communion in a world where we never commune with God outside. Rather, what's happening in the eucharist. Inside the liturgy is the concentrated form of what's happening constantly. So in our meals, as you say, we're communing with God. But then Schmeman says, you know, you come across a daffodil and you're seeing the glory of God that's displayed. And so everything becomes. Because the Eucharist is at the center, everything becomes a moment of possible Eucharist, a possible communion with God, of thanksgiving, of delight, in his beauty and glory."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":1899.27,"end":1963.8,"speaker":"Jonathan Pageau","text":"Yeah, yeah. And I think for people to understand this, it's something that is part of reality just all around. You know, you can take simpler example that, oh, don't go all the way up into communion, you know, into the. To the Eucharist or into the sacraments. But if you take the idea of a. Like a contract, for example, like a formal contract. So you. You have these moments where you have a formal contract where you, you know, you two. Two people stand together and sign a piece of paper or shake hands in a very formal way. You know that these types of kind of almost ritualistic moments, they are the peak of just everyday promises that you make that you keep. Everyday moments that you are. You have to promise something to someone or you have to say you're going to do something and then you do it. They normally culminate into these. These kind of shiny moments that become examples of. Of all the daily things that we do. So, and it's the same for everything. Like you imagine we just had the presidential inauguration. You know, you have someone who stands and promises and does this really formal thing, but this becomes a shining example of things you do every day in your life."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":1964.12,"end":2068.23,"speaker":"Peter Leithart","text":"Right? Yeah. Yeah. So you have those. Again, in the reformed tradition, we would call them covenant moments or covenant memorials, Covenant experiences that are formative for everything. If you go down to the other level, this is a pattern that Jim Jordan talks about in Through New Eyes. He goes through the creation account, and the creation account repeats the same series of actions virtually every day. Not without. Not without variation, but virtually every day. God takes the world as it is. God tears the world into pieces, changes it. He assigns new names or he gives new assignments to things. He puts it back together in a new form, and then he says it's good, he enjoys it. And Jordan points out that that pattern of taking hold, tearing things apart, giving things new name, reassigning things, and then sitting back in a joint is just the pattern of human action. That's what we're doing all the time. You're baking a cake, or if you're writing a book or if you're mowing the grass, you're doing that kind of creative action in the world constantly. And the Bible gives us. What it did for me, when I first read through New Eyes was. I think I went for months in this kind of state of elevated awareness that everything I was doing was replicating the actions of God in creating the world. And everything I was doing because of that was altering the world in some fashion, contributing to the ongoing glorification and ongoing fulfillment of the world. Even the smallest. Even the smallest human action are participating in that."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":2068.8,"end":2123.76,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah. I often say that the text in Genesis 1 is not a scientific text. It actually contains the scientific theory within it. It actually. The structure of how God creates the world is the macro version of how the scientist looks at a phenomena, identifies it, evaluates it, you know, and declares whether or not it's good. It's like that's how everything we do basically, is even every act of perception. When we're grabbing a glass to drink, you know, we're seeing it, we're evaluating it, we're deciding if it's good, and then we bring it. You know, we use it in that context. Of course, God, everything he does is. Is good at the outset. But you can see if you take the image in the beginning and you make. Match it with what happens at the end, you can see that they're reflections of each other. Like God evaluating the world is what he does in creation. Anybody does at the end as well. It's. That's just part of how we. We exist as humans. It's wild."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":2123.76,"end":2124.28,"speaker":"Peter Leithart","text":"Yeah."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":2125.72,"end":2140.6,"speaker":"Jonathan Pageau","text":"And so I guess my next question is, how is this being. How. What is your perception of how this is being received, you know, by. By the people. By the people in your tradition, by the people around you. What is. What has been the. Because now it's been. How long has Theopolis existed now?"}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":2140.68,"end":2142.44,"speaker":"Peter Leithart","text":"Theopolis is 11 years old."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":2142.52,"end":2143.64,"speaker":"Jonathan Pageau","text":"11 years, yeah."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":2143.64,"end":2377.08,"speaker":"Peter Leithart","text":"But as I said, we had a couple of decades of prior work that was along very similar lines. That was on a very small scale. The conferences that we had for those 25 years were maybe attended by 50 people, if we had a good turnout. So it was almost like a working group, which was a very fruitful thing because virtually the same people were there every year. We were thinking together over these things. Theopolis has a bit bigger spread. It's hard for me to judge what kind of effect it's having. I mean, you could summarize it as some people are very entranced and energized there's this kind of electric jolt when they start recognizing things in the Bible and in the world that they hadn't recognized before. This was the experience I largely had teaching. I had students who had been going to Sunday school all their lives. They had all the bits and pieces of the Bible, many of the bits and pieces of the Bible in their minds, but nobody had ever put it together for them. And so showing how parts were formed into coherent storylines and recurring storylines, and seeing analogies between different parts of the Bible, I see light bulbs popping up, going off constantly in my student's head. So that's the reaction of some. There's a fair bit of hostility, as you might expect, in certain quadrants of the Maybe, maybe especially Protestantism. I don't know if that's the case or not, but there's a certain hostility. It seems we look Catholic because of our liturgical. Our liturgical life. We look irrational, and we're playing fast and loose with the Bible because we're interested in all these and digging into the details and looking at the weird parts of the Bible. So there's, you know, obviously it's a mixed reaction. I do think that. I imagine that you've had this experience and stepping back and just looking at the feel of the culture more generally. Again, I have very little sense of no finger on the pulse here, but. But given my total ignorance of what's going on in the world, it does seem like there's a hunger for what's been missing. I know that you've had a good response to the kinds of things you do. I'm thinking. I'm reading through Ian McGilchrist's massive book, the Matter With Things right now, and it's not a theological or overtly Christian study, but he's doing a lot of the same kinds of things that we're talking about in the way that we. Way that you engage the world and way you think about the way reality is organized. And so I think there does seem to be this cultural shift where there's more openness to this. I think there's only so far you can go. If you're. Go back to our discussion of critical scholarship on the Bible, how far can you go? You're dividing verses of the Bible into multiple different sources. One word goes here, a few words go there. I mean, you're left with sand. You got nothing left. And even with. Even among Bible scholars who still believe that you have this shift over to, well, let's look at the text as a whole as it's Actually, it actually presents itself. I'm thinking of people like Robert Alter, a Jewish commentator who's. I think he believes all of the. All of the critical scholarship about how the text came to be as it is. But what he's interested in is looking at the text as it. As it currently is and trying to understand. He's giving a bit of credit to those editors that they knew what they were doing."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":2377.48,"end":2438.29,"speaker":"Jonathan Pageau","text":"Yeah, I mean, that's. That my, like, I've. My default position, you know, and it's kind of. It's a little controversial because I'm being dismissive, but I just say, okay, fine, the editors, the author, just get over it. You know, it's like. And then, then just stop, stop. Because, you know, imagine if you took, like. Can you imagine if you took Marvel's movies, like the Marvel Infinity War saga, and then you started watching it and then saying, oh, well, this little bit of the story comes from like this little series in the 1970s that Jack Kirby did with this. And you start breaking it down, like, every reference and saying, well, this doesn't hold up at all. This is not a coherent thing. You know, it's just a bunch of ragtag things being pulled from all these different. It's like, what. What are you doing? Why. Why would anybod about this. It's like the Bibles, you know, these Bibles that they have all the. They have the, the. The little footnotes with like, this is part of this text and this part of. It's like, don't give that to someone in church. Who is that for? It's not for those people. It's a horrible thing to do to people."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":2438.69,"end":2446.97,"speaker":"Peter Leithart","text":"Yeah, and. And I mean, then if you did that, I mean, there would. There would be a case to be made for all of those little connections you're talking about."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":2446.97,"end":2449.33,"speaker":"Jonathan Pageau","text":"Yeah, but not for. In church. Like."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":2449.33,"end":2471.49,"speaker":"Peter Leithart","text":"Yeah, but even, Even if you, if you think about the, The. The movie and you're taking. You're trying to extract all the little references, you can disassemble any text into a collection of intertextual references. You can do that. But that doesn't say anything about what the text actually means, because the text is what it is. And you have to account for the text as it is, not merely trace out its different influences."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":2471.81,"end":2501.26,"speaker":"Jonathan Pageau","text":"Yeah. Even simple as saying it doesn't account for the text existence, like, as simple as that. Because it exists because people cared enough about this text to transmit it. And breaking it down into all its references does not account for the text really, at the first level of why the text is there in the first place and not just has not just been forgotten like all, like, you know, most texts in the history of the world or most little or most religions and most recently, like this one is still around. And there's a reason for that, you."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":2501.26,"end":2543.87,"speaker":"Peter Leithart","text":"Know, And I mean, and I don't think this is extreme to say that critical scholarship. I'm not attributing this to everyone who's worked in the critical vein, but I think overall it's a Satanic. Satanic delusion that estranges people from the word of God and, you know, not demonizing the particular practitioners. But I think overall that's the effect of it is to turn the Bible into something again, it's dull, it's uninformative, it doesn't awaken the imagination. It's just so much fodder for scholarly disassembly. And that's ultimately satanic."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":2544.03,"end":2647.42,"speaker":"Jonathan Pageau","text":"Yeah, I totally agree, but I love that you're willing to put it so clearly. You mentioned earlier about the change that's happening in culture, and I think you're absolutely right. What I see in the younger people is in some ways, because the worldview. In some ways, I mean, I don't know if it's the Enlightenment worldview or just the modern worldview. It's kind of breaking apart. You know, it's breaking apart as we're noticing, you know, our societies don't hold together anymore. We're noticing that things. The cohesion of the. Of our. Of our world and of our life is. Is fragmenting. You know, people are, you know, how can I say that? It's awakening in them the desire to be able to perceive the big story or the bigger stories. And so I think that, that, that that is happening and it's happening in almost every single field. You know, the whole problem of complexity and the problem of multiplicity and unity, all of these questions are being asked whether it's in science, cognitive science, you know, and in organizational theories. All of these theories are trying to account for the. What we could call a kind of vertical causality, Right? Something that brings multiplicity together into one. And so because of that, I think people want the. The story and they can see it when they look at Scripture and what also what Scripture has done for us, if you take it at a meta level, the way in which Scripture has been one of the threads that has held Western civilization or you know, for the past, the only thread possibly that has held Europe together for. For 2000 years, that even they can even imagine that Europe exists is because even though they fought all the time, they had this thing that held them this, at this, this higher peak that held them together. And so people are trying to understand what that is, I think."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":2647.42,"end":2832.88,"speaker":"Peter Leithart","text":"So right now, I think there is definitely a generational dynamic to that. And I've encountered that a number of the men who associate with Theopolis have encountered that. In the early 2000s, there was this big hubbub in reformed churches that in my mind it got very confused because it, you know, it's a theological debate that's, that's carried out on the Internet with all, with all of the, you know, all of the self restraints and care that you would expect from an Internet debate. Zero. But so, and I think there was, there was definitely a divide. So the, the more established people from my generation, maybe a little bit older, but more established pastors and theologians, we were doing, to my mind it was mainly about baptism and the efficacy of baptism. We were trying to take seriously what you just said a few minutes ago. Paul says, don't you know that you have been baptized into Christ? You have been baptized into his death, you've been buried with him so that you can rise to the newness of life. We wanted to say Paul means that that's what's actually happening in baptism. That's a controversial thing to say in certain Protestant circles. And so there was this older generation that was very hostile to it. But yeah, the people that gravitated to the position that we were articulating were largely the younger generation. I do think that that generation dynamic is there with all the pluses and minuses that come with the generational divide like that. The other thing I was going to say, just to go back to our earlier discussion, I think about the critical scholarship and all that. Luke 24, Jesus teaching on the road to mass has been a main passage for us at Theopolis. And the thing that it brings together, a number of things we've already talked about. One of the things that strikes me about that is the fact that these two disciples walking along the road to Maeus are joined by Jesus. Jesus is there speaking to them and they don't recognize him until he starts talking. Teaching the Bible, but teaching the Bible in a particular way. Teaching the Bible is the story of the Christ and still they don't recognize him until he breaks bread with them. So I think in my mind, what we have in a lot of churches, I'm not talking about churches that have adopted liberal critical views of the Bible, but churches that Neglect this kind of the typological, symbolic dimension of the Bible. Jesus is there. I have no doubt Jesus is there, but I don't think they fully recognize him because they aren't reading the Bible properly and they aren't breaking bread very frequently. So it's the combination of a Christ centered teaching and proclamation of Scripture which, with the sacramental life, those two things are the things that make Christ knowable in the church."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":2833.68,"end":2928.5,"speaker":"Jonathan Pageau","text":"Yeah, that's beautiful. That's a beautiful way of seeing and you know, related to what you were saying, I wonder if you think that like one of the things that I grew up in, I grew up Baptist and there was this weird opposition, right, this weird opposition between in some ways the liberal Protestants that were dangerous because they believed all these weird critical ideas. And because of that, they basically didn't take the Bible seriously in terms of their practice. They could relativize all these aspects of Scripture because of this kind of critical method. And then we had the kind of fundamentalist approach which was like, no, it's the scripture and everything. But there was this weird suspicion about allegory. Right. Or analogy. I remember even my youth pastor, who I love dearly, still love him today. You know, he said, he said, I found out that in the Bible it says that the serpent was naked and he was like blowing his mind and he couldn't, he couldn't hold on to it. He was like, he said, well, does it, what does this mean? What does it mean, like in terms of like Adam and Eve being naked, everything. It was like crashing his whole reality. But I think that what you're doing. And in some ways I believe, in some ways the older, more traditional way of actually reading scripture cuts through that, like right through it. Because it's saying, it both says, because it's saying, because we take scripture so seriously, we have to dive into this type of interpretation because it is just there in the text. If you don't, you miss out on some of the beautiful things that God is doing, you know, for us. If you, if you ignore the imagery that moves from Genesis to Revelation, you're missing out."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":2928.58,"end":3040.17,"speaker":"Peter Leithart","text":"Yeah, yeah, great point on the divide that you describe. If the, if you have those choices. I'm a fundamentalist and I like to use that term just to shake people up. I did a series of books that kind of introduced Theopolis and I called them Theopolis Fundamentals. Just to claim that heritage of confidence in the Scriptures as true and without any kind of qualification or hedging the Bible is true. That's, I Believe that. But yeah, you do have this. The hermeneutics of the fundamentalist movement tend to be hostile to allegory, hostile to symbolism. And it's the grammatical historical is what's, that's where it's at. And I think again, the story of Jesus on the road to Emmaus I think shows how that's how dangerous that is to limit it to that, not recognize the christological dimension. And then I think too there's some pretty overt places in the Bible, I think the Gospels, Jesus tells parables and you hear from experts on the parables. The parables are not allegories. Don't try to find one to one correspondences between what's in the parable and what Jesus means by it. But then you watch Jesus interpret the parables. Oh well, Jesus seems to think they're allegories because the sower is the son of man and the seed is the word of God and the different soils that it goes on are different kinds of people. That looks a lot like an allegory. So that if you're going to be, if you're going to be a fundamentalist and believe, you know, stick with what the Bible actually says, then allegory has to be an option because it's actually in the text. That's, that's the way that Jesus reads his parable."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":3040.41,"end":3099.44,"speaker":"Jonathan Pageau","text":"But I think that the key to, at least the key that I've seen in helping people through this crisis, sometimes for them like a kind of crisis of meaning, is really that typology is the key and that it's not that there are allegories that you can just metaphors that you can just play with and that you can just. This is very serious work. This is actually comparing stories with each other, noticing stories, structural relationships, and always asking yourself how does this reveal the Logos in the story moving towards the incarnation? And once when you do that, then it's actually, it's quite serious work. It's something that you can criticize if someone gets it wrong. It's something that you can say, well, you missed this aspect. Did you notice this in the story? You seem to be ignoring some part of the story to make your case. But if you take this part seriously, then you see what it does. And I've actually found that this kind of typological interpretation can be quite, quite rigorous if you take it seriously."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":3099.44,"end":3190.69,"speaker":"Peter Leithart","text":"Oh yeah, yeah, I agree with that. And I would make a distinction. I mean, historically when like medieval Western theologians talked about allegory, I think they were talking about something Very close to what we mean by typology. But you also have sometimes have these forms of allegorical interpretation that take you out from the text. So you have something going on in the text, but what it means, it means what it's supposed to mean in some other realm. I think there might be a way to get there. But I think the kind of cross comparison of different episodes of the Bible and recognizing, as we said earlier, that the biblical history rhymes because history itself rhymes, that God is doing recurrent kinds of things, never identical, but there's this kind of repetition and spiral in music. I think I'd like to use musical metaphors to describe it. You got a theme in variations, you've got an Exodus story early on in the Bible, and then you've got all kinds of variations on the Exodus story. And learning to hear those or recognize those when they happen, I think that is, rather than stepping outside the text to try to find some meaning outside, I think one of the things people might worry about there is that you're just working internally to the Bible. It never hits home with life. I think we've already, we've already addressed that. But I think your point about what you're looking for in the text, what's being revealed in the text is the eternal word of God that is carnated Jesus, the Christ."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":3191.17,"end":3217.39,"speaker":"Jonathan Pageau","text":"So it also happens to be the structure of reality. It's actually the structure of your experience of your everyday, all the time experience, experience. It doesn't, it's not, it can be, it can't be different from that because that's the structure. I mean, it's not structure. The Word created the, the world, folks. Like the divine logos, the one that's incarnated in Jesus, is the one that created the world. And so the world has a shape which is akin to the Bible. It kind of has to, you know, how could it not?"}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":3217.63,"end":3319.72,"speaker":"Peter Leithart","text":"That's exactly where I was going. So he's the one in whom all things cohere. He's the one who is with the Father in creating the, the world. So yeah, it's. So I think that that worry, that typology just kind of, it's inapplicable. It's not the case. I think the other thing, this is something I learned very deeply from Jim, is that again, going back to the idea of recurring patterns in the Bible, which are the recurring patterns of life, when you begin to recognize that, you can begin to see where in a story arc you might be, you can kind of anticipate, you know, if you See these recurring Exodus stories. Are we still in slavery? Have been, We've been redeemed from slavery. Well, what happened to Israel? When they came out of Egypt, they started complaining. They, they, they were afflicted by Amalekites. So if we've been brought out of some kind of Egypt, then those are the things that are on the horizon for us. Or if we're in a position where it's more like a Judges, something more analogous to the period of the Judges than where the Lord is raising up somebody who's going to lead his people out of slavery. So I think you begin to see how. Because the church's history has the same kind of shape, the same kind of recurrent shape. And it's not applicable in the sense that you can get three points of application at the end of the sermon, but it's applicable in the sense that you give people this big picture of reality in which they can locate their lives and they can begin to navigate within the world faithfully because they're engaging the world through this, through these biblical patterns."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":3319.88,"end":3441.76,"speaker":"Jonathan Pageau","text":"Yeah. And often, I think that often some of the texts, like in the Church Fathers, sometimes you'll read certain interpretations that at the first level, they just seem wild because they really are allegorizing the text, say, like, this is mercy. This is like, they'll attribute it to the virtues or to the vices and stuff. And usually if you take the time to look at what they're doing, you realize that there's actually, there's actually a typological reading underneath. And what they're doing in the algorithm is really just applying it. It's an application of the structure now to your everyday life and to your struggle with the virtues and the vices. And they're not, they're not saying, like, this is the meaning of the text. They're saying, you know, like the, the simple. Like the hardest example. Right, the hardest example is the bashing of the children on the stone. You know that, that text that all the atheists love to bring up, you know, this idea like, I'll bash your little ones on the, on the stones. And the, the Fathers say that. That's the thoughts. Right. It's like, it's the idea that you have to, you have to stop something before it grows and becomes mature so that it doesn't. So that it doesn't have the strength or infancy. Exactly right. And so it's pretty dark because it makes sense in the text, because that's what the text is referring to. It's saying, we're gonna. And it's. It's like, it's a. It's not a moral. It's not a Christian moral thing, but it's saying if you have enemies and you. If you don't kill their children, then those children are going to come and get you back. And so the application for us today is in the light of Christ, in the light of the. The one that gave his life, that sacrificed himself, you know, that is willing to take, you know, evil onto himself. Then that becomes an internal struggle to fight the little things that are growing, that if you don't fight them when they're little, then they'll come back to get you. So the analogy is completely, completely coherent, and it's actually the best. It's the best interpretation for us as Christians because, no, we don't want to go and bash, you know, our enemy's children on Torak. That. That doesn't make sense in light of Christ anymore."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":3442.52,"end":3525.53,"speaker":"Peter Leithart","text":"Yeah. The paradigm that I've fallen into is the medieval fourfold method of interpretation. And I realized I had started kind of using that pattern, not so much because I learned about it and started applying it, but just in preparing sermons, preparing for teaching. I mean, the fourfold pattern is you have the literal sense. This is what the text says, what it means. You're looking at all the. You're looking at all the literary tropes and things as part of that. But then it also is proclaiming Christ. That's what's called the allegorical sense. But then, because Christ also has a body, because Christ has members, whatever the text says about Christ is also somehow applicable to you and to the church. And that's where you get the kinds of things you're talking about. You can move from the Christological interpretation to thinking about virtues and vices and dashing the infant, evil thoughts that occur in your mind against the rock of Jesus. So that movement, I think, has been helpful. And I think you're right that a lot of what can be easily dismissed as fanciful in the Church Fathers is operating in something like that vein. It's something that's downstream from a. A type. What. What we're calling a typological reading."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":3525.77,"end":3621.5,"speaker":"Jonathan Pageau","text":"Yeah. And we, I think it's. To me at least, it's been important sometimes to trace that for people because. Yeah, you know, because it's become too obvious. You know, we just read. We read the Father. We don't understand just how seeped in Scripture they were and just how it was basically the world that they lived in. So sometimes we have to break down some of their readings. Like I, you know, I love the St. Gregor of NYSE's Life of Moses, one of my favorite texts, you know, but sometimes in that text he just goes, he just cuts right through and says certain things that if you read about the first glance, like, where does he get this? You know, and it's, and it's been my pleasure to say, okay, let's take this and let's, let's break it down. Let's show how you can get there from a, from a strict typological reading and then ultimately come to what he's saying, you know, to help people say that he's not just, just, he's not just mouthing off, like, he's not just kind of making it up as, as he goes along. And you, you know, and I think, I think it's, that's especially important to do today, you know, just because our biblical literacy in modern world, especially in, you know, and, and this is something in the Orthodox Church which is needed, you know, in, in our situation, because the orthodox world is done like it's over. And so even people that become, that are orthodox, let's say in America or in Europe, they have the same problem as everybody else. They live in a secularized society that doesn't have the Bible and Scripture and the Christian tradition as the basic, you know, mind, a worldview in which to live. And so they have the same problem as everybody else. They need to make those connections more explicit now."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":3621.58,"end":3692.17,"speaker":"Peter Leithart","text":"Right, right. Yeah. I think Augustine would be another example, and particularly I think of the iterations on the Psalms where, I mean, he did not have an Internet electronic search engine to cross reference the Psalms. He was doing it all from memory. But he reads a verse of a psalm and within the next few paragraphs he is everywhere, all over the Bible, connecting all kinds of things that this particular verse reminded him of. And yeah, I don't endorse everything I find in Augustine, but a lot of it works because he's working within a framework that's Christ centered, Christological. He's working a framework that really heavily emphasizes the union of Jesus, the head with the members of his body. So every time he sees something about Jesus, he knows it's also something about the church. But it's just astonishing that from his mind, just his knowledge of Scripture, he's able to make all these connections. And it seems almost instantaneous."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":3692.25,"end":3703.61,"speaker":"Jonathan Pageau","text":"I'm sure it's annoying to know that so many people had memorized the Psalter. I'm nowhere Near. It's not even on my horizon to memorize."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":3703.61,"end":3713.49,"speaker":"Peter Leithart","text":"I mean, if you're a Benedictine and you sing through the Psalter every week, you know, you do that for 10 years, then you're going to have them all memorized."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":3713.65,"end":3726.13,"speaker":"Jonathan Pageau","text":"Yeah. They're just going to have seeped into your existence. And so what do you hope for, let's say, for the future for Theopolis, but also for this vision of Scripture and how it integrates into our life?"}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":3726.77,"end":3915.85,"speaker":"Peter Leithart","text":"Yeah. Well, at Theopolis, we see ourselves as a service to the church. We're in a particular quadrant of the church, but we believe that what we have to say is valuable to Christians in all different traditions. And so we have a Catholic spirit. We're not giving up on our convictions as our particular confessional, doctrinal convictions, but we want what we do to have to be edifying to the Church at large. I think that's happening. We have a pretty wide readership. We get students from a variety of different churches in our programs. We've had one Orthodox student go through our fellows program. Happy to have more, but we've just had the one so far. So we have. As far as our hope for the churches, we would play some part in reviving and renewing what I think is a very ancient way of reading Scripture. I think it's been refreshed and perfected in some ways by later developments, but it's rooted, as you're talking about, in the Church Fathers rooted in the New Testament, the New Testament's way of reading the old. But we want to play some role in seeing that seep into the church and to deepen the way people read the Scriptures. As you know, that's one major part of renewal of the church in general. I wrote a book a number of years ago called the End of Protestantism, where I made the argument. The title had a twofold intention. One is, what is the goal of Protestantism? To my mind, the goal of Protestantism is to renew the entire church. That was the goal of the original Reformers. They didn't want to create a new church. They wanted the Roman Catholic Church to be renewed and reformed by the word of God. But if that happens, if we see the word of God embraced by churches, by all the church, then Protestantism as a separate body of churches doesn't need to exist anymore. We just have one church. So that renewing of biblical typology and of deep biblical reading is part of. I don't want to make it sound pompous. We're not pretending like we're doing this, we're accomplishing this. We want to play some small role in seeing the church as a whole renewed toward the end of seeing the church won with one confession, one mind, one lip. And I think that's what Jesus desires for his church, a church that's drenched and saturated with the word of God and confesses with one voice."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":3917.66,"end":3991.49,"speaker":"Jonathan Pageau","text":"I mean, I think that it's interesting because in some ways, you. There is a symphony of these types of people coming up in different spheres. You know, you talk about even people that aren't Christian, like Amy Gilchrist, you know, and I think Jordan Peterson plays some role in that as well. There are several. It's as if it is something that's happening right in culture, and the people that are moving in the same direction are kind of recognizing each other across the aisle and saying, okay, we're. We're not exactly. And we. And I think it's also part of the honesty of this is to recognize the differences, to say, okay, I'm reformed. These are, These are my. These are the things that I won't budge on. And the same with me. I'm orthodox. But we can recognize the places where we come together, and especially in terms of this beautiful capacity to see the images in scripture play with each other in this dance that animates the world. So I'm really excited. I've been. I've been excited since I discovered what Theopolis is doing. And I think, you know, and interestingly enough, Dean Arnold, who, some of you may know who watch this channel, he is editing James Jordan's Revelation Interpretation. Right. And I think he. I think he published. I think it's published. Yeah, I think he published it a few months ago. Right."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":3991.49,"end":3993.41,"speaker":"Peter Leithart","text":"Three. Three volumes he's come out with. Right."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":3993.57,"end":4007.27,"speaker":"Jonathan Pageau","text":"And so. So, yeah, so this discussion is happening in the, in the, in the back rooms. It's happening everywhere. And so, you know, and we're. We're definitely looking forward to seeing it continue. So, Peter, thank you for your time and thanks. Thanks for engaging with me."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":4007.27,"end":4010.15,"speaker":"Peter Leithart","text":"Yeah, thank you, Jonathan. It's been really fun. Appreciate it."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":4010.47,"end":4025.47,"speaker":"Jonathan Pageau","text":"If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase. So go to thesymbolicworld.com and. And thank you for your support."}
{"episode_id":"SW - #385 - 2025-04-02 - Peter Leithart - The Bible As a Way of Seeing","start":4026.19,"end":4087.22,"speaker":"Laura Diaz","text":"Tucson. The weight is over Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight and serious risks. At mediweightloss, I got the same medication but with a customized plan, weekly check ins and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweightloss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss. Com."}
