{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":0.32,"end":105.03,"speaker":"Jonathan Pageau","text":"Hello, everybody. I am delighted to be here with Father Maximus Constis. Father Maximus is really one of the world's most renowned scholars on Saint Maximus the Confessor, of whom I talk about a lot on this channel. Hopefully even non Orthodox people by now will know who that is and how important he is. He has translated many of St. Maximus work. He's also written his own book, in particular, the Art of Seeing, which is a powerful look at icons. And so he has this interest in patristics, in scholarly work, but also in art, which is why it seems like our stars were meant to align at some point. And we get to this discussion. He is, right now, he's a professor of patristics and Orthodox spirituality at Holy Cross Seminary. He was a professor at Harvard. He was a monk for many years at Simon Petra on the Holy Mountain. He's the director of the Papas Patristic Institute right now. And so, as you see, he is someone who not only is a scholar, but is also a monk and a spiritual practicer. And so I'm really excited to be able to talk about Saint Maximus and also about art and about how these two things come together to help us understand the world today. This is Jonathan Pedro. Welcome. Welcome to the symbolic world. And so, Father Maximus, thank you so much for taking the time to talk to me today."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":105.43,"end":107.67,"speaker":"Fr Maximus Constas","text":"Sure, thanks for having me. It's a pleasure to be here."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":107.83,"end":132.88,"speaker":"Jonathan Pageau","text":"And so my first question is, you have become one of the world's most renowned scholars on St. Maximus. Of course, you come at it as an academic, but also you made these discoveries as a priest and a monk. I would like to hear a little bit about your journey and how the work of Saint Maximus informed your academic career, but also your own spiritual path, your own spiritual discoveries."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":133.36,"end":376.9,"speaker":"Fr Maximus Constas","text":"Yeah, I mean, I should say that there are many people in North America and Western Europe and in other places who have distinguished themselves as really great scholars of Saint Maximus the Confessor. I may or may not be one of them, but there are many people who deserve that kind of praise. He is a complex thinker and writer, as you know, and it takes a group of people to approach him from different perspectives to, you know, really begin to get at all of the issues there. So one person can't do it alone. So hopefully scholars work together as a team, as part of a community, and we do what we do. My sort of doctoral work was in patristics. So there's kind of an actual fit there, though. My initial studies were on the kind of classical Christological controversy of the fifth century. And it wasn't until some years later that I became a monk and received the name of Maximus, after Maximus the Confessor, that I became increasingly curious about my new sort of patron saint. And so I began to read, because years ago, there was very little that was available in English, and I never had a course on Maximus the Confessor, so he was, for me, anyway, somewhat, you know, uncharted or unknown territory. Then I received an invitation from Dumbarton Oaks, which had just launched a new text and translation series known as the Dumbarton Oaks Medieval Library. And if your viewers are interested in some patristic and Byzantine texts, there's a growing number of volumes there that they would find to be of interest. So I had an opportunity to contribute something to the series. I decided I would choose a work by Saint Maximus that wasn't available in English, and I chose the Ambigua. Of course, I found out after that that the Greek text needed to be edited and all of that, so I'm not going to get into those details right now. But the book was completed and finished in 2014, and it's in two volumes in that series. And if I can toot my own horn a little bit, they tell me that it's consistently been the number one bestseller in the business series, Dumbarton. Yeah, it sold an incredible number of units. So. And in case anybody's jealous or envious, I don't get any royalties, so. The other thing that's worth mentioning, maybe, is that this was a project that I began and completed, you know, at the monastery. And it'll forever be a part of that experience for me, because I think undertaking and trying to complete a project like that outside the monastery, for me anyway, would have been much more challenging and maybe even impossible. The monastery provides you not only with the stability and the routine without significant disruptions and interruptions, but you also have a particular focus or clarity or quality of mind that is hard to find outside of that environment. I mean, you forget what that quality of mind is or what that clarity of mind is. And then you. Then you need to remember. You forget to even remember to. So you have to remember to remember what it is that you are or who you are. So I think it was really a gift of the monastery that enabled me to engage all of the complexities of his language and concepts, because I often look back on that project and I sometimes wonder how I was able to do it, because I live in Boston now and I teach, and it's just a different world. And your energy and attention is Just a very different thing. So."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":377.86,"end":389.15,"speaker":"Jonathan Pageau","text":"Yeah, because if I understand correctly, when you started translating the Ambigua, you had never fully read it before. Like, you really kind of dived in. All feet first, let's say."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":389.15,"end":415.01,"speaker":"Fr Maximus Constas","text":"I mean, it's a lengthy word and it was available only in Greek, and it's very difficult to read. So you start at the beginning and you just don't get very far without a translation or a better text. And so it was a voyage of discovery. Definitely. I mean, it was sort of a. Because I was not familiar with the text, it often felt like there was a revelation on every page, was all new to me at the time."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":416.05,"end":429.81,"speaker":"Jonathan Pageau","text":"That's amazing. And you didn't mention it, but you did have to do yourself, collating some of the Greek texts themselves. You had to find these different manuscripts and texts and try to read to find the best version or to bring about a good version of the Greek itself."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":429.97,"end":472.94,"speaker":"Fr Maximus Constas","text":"Yeah, going into it, I thought it was going to be a quote, easy translation project. And then I found out that the text was in just terrible shape. The Greek text that we had published in the standard Greek metrology was just riddled with errors in places. It was saying the opposite of what Saint Maximus had written. So, fortunately, I had the training for my doctoral studies, and I had to round up the actual manuscripts and collate them and establish a better edition of the text, which is what you see in the. So it was a big project. It took three years, but I enjoyed every minute of it."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":473.66,"end":520.17,"speaker":"Jonathan Pageau","text":"And so, like I mentioned at the beginning, we both have several things in common. Of course, one is a love of Saint Maximus, me, let's say, as an amateur. But also we both have a love of liturgical art and icons in particular. And there is a deep connection between the two in works like the Mystagogy, where Saint Maximus creates this strict analogical relationship between a human person and the actual architecture of the church, the church building. And this is, of course, in line with how St. Maximus creates this microcosm, macrocosm relationship all through his writing. And so could you help us understand a little more how Saint Maximus does this, how he links the visible to the invisible, the architecture to the body, these types of relationships in his work."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":520.73,"end":958.56,"speaker":"Fr Maximus Constas","text":"Yeah, I don't know if, unfortunately, it's the right adverb to begin with, but this is a. When you're dealing with anything in Maximus the Confessor always tends toward kind of a thorny complexity. So there's always multiple steps. You kind of have to negotiate. And I think the first thing to say, is that there's definitely what you would call a sort of aesthetic dimension to his writing and to his worldview. I mean, he sees creation as a theophany, as a literal manifestation of the divine. So how could, how could this be devoid of something that could be fairly called, you know, an aesthetic? But the problem is, is that that aesthetic, so called, is really part of a much larger phenomenon. And it would really be reductive to isolate it from that larger, let's just call it phenomenon right now. I mean, it would be like separating the body from the soul or sensation from intellection, and focusing just on one dimension of this larger kind of organic whole. I think something similar happens when people identify Saint Maximus as a philosopher. And there's definitely a philosophical side to him. But to reduce him to that, I think, is to impoverish all the other things that make him who he is. Now, it's intellectually very respectable to say you're studying a late ancient philosopher, but it's not really an accurate representation of who he was or what he did. So again, so aesthetics should not be abstracted from this kind of larger metaphysical and cosmological fabric. I mean, there's also a liturgical fabric that's part of this too. So it really needs to be seen in these, in this larger kind of atmosphere or environment. But the question, though is really interesting because the relationship between the visible and the invisible, it's a very old kind of question or problem, finds an interesting development or clarification in Maximus. And this is important, I think, because many people think that Christianity is some kind of dualistic religion or that it's somehow hostile to matter or hostile to the body or things like that. Now, I mean, that might be true of some Christian traditions, I don't know. But I think it's very difficult to level such a charge against orthodox Christianity or against Maximus in this particular case. I mean, it's true and obvious, I think, that the Greek fathers made use of the Platonic tradition, which is why they often get implicated in this charge of dualism. But the Platonic tradition was not nearly as dualistic as most people imagined. I mean, for the first thing, you have, you have sort of the early Platonic dialogues, which do tend toward a greater degree of dualism. But the later Platonic dialogues like the Timaeus and so forth, move in the direction of a very different construal of, let's say, the physical and the spiritual. And by the time you get to a writer like Plotinus, who's kind of the so called father of Neoplatonism, is writing about 300 years or so after Plato. Plotinus, I mean, is so far beyond any kind of Platonic dualism that he consistently avoids Plato's spatial categories of above and below. For example, the forms are above, and they're reflected sort of in this lower world. And he really avoids that kind of language. And he replaces it with words and concepts that begin with the Greek preposition prefix sin, like sin or synthesis or synergy or synoptic or synesthesia. Right. This is a part of speech that unifies things. So Plotinus doesn't like to see things separate. He likes to see them coupled in some way. I mean, united or unified in some form. Because he himself sees the unity in all things. And this is the way his sort of philosophy unfolds. Not as a kind of, you know, disjunction of the spiritual and the physical, but they're on a kind of a continuum. And I couldn't tell you where exactly. Somewhere in the Aeneid, he makes this great quote where he says, sensations here. And by here he means in this life, in this world. Sensations here are dim intellections, but intellections there, he means in the spiritual world are vivid sensations. They're on this kind of continuum, and they're sort of the same thing, but just in different places. And therefore they have different sort of valences. Now, I mean, here's what we need to locate Maximus. I mean, in this later Neoplatonic tradition that is decidedly not dualistic at all, but embracing this kind of formula or model of unity. And this is. We see Maximus everywhere, interested in the immediacy of things and the kind of, you know, mutual presence of things to one another, and even a kind of mutual interiority that things have to each other, not their opposition, whether it's spatially construed or otherwise. And this is. This makes sense because he was partly reacting to the originist tradition, which was more dualistically Platonic in that sense that I just described. And there was no real difference there, because in the kind of Gnostic ascent of the mind, you know, back toward the one, I mean, differences would fall away. So gender would fall away and the body would fall away, individuality would fall away, and there would be this return to a kind of, you know, homogenous collective state in which there was no person or individual. And, of course, Maximus is pushing back against this. So he comes down hard on particularity here. But, you know, within this kind of union. So I think the key here maybe is the Christological teaching of the Council of Chalcedon that many people are familiar with. Because it's the position that Christ's two natures are related to one another through these famous four adverbs, that the two natures are neither confused or altered. So that means they retain their integrity. One is not elided with the other or confused or conflated with the other. So they're without confusion and they're without change. But they're also. They also coexist inseparably and undivided, indivisibly. So it's sort of like wanting it both ways, that they're totally one, but they're also, at the same time, totally distinct. I think that becomes his Christological model for this unity without confusion among the constituent elements of whatever it is, the body, the world, the church, you name it."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":959.04,"end":1007.22,"speaker":"Jonathan Pageau","text":"And what's interesting, at least to me in his theory, his approach, is that you can really apply it fractally at almost all levels of reality. And it actually becomes like a theory of. Becomes a theory of reality, which is even today, people are noticing the problem, let's say, of unity and multiplicity. But St. Maximus really offers this capacity for things to both exist to a certain manner as one, but also without containing their multiple elements at the level at which those multiple elements are real. But that this doesn't prevent them from joining up together. And so it creates like this, this massive movement where all things can both exist at the level they exist, but are united to their different purposes, coming together up all the way into Christ and into God himself."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":1008.18,"end":1043.36,"speaker":"Fr Maximus Constas","text":"Right. I think it's funny because I think in our world, at least nowadays, we're trying to sort that question out politically. And that may or may not be the best place to do it. But we have our own version of this dilemma, let's say, not in terms of metaphysics and the one and the many and so forth, but in terms of the kinds of, you know, social identity, cultural politics and things like that. So it's funny how the kind of the language, or not the language, but the conceptual structure remains in place, but it's construed on a very different level."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":1043.68,"end":1091.28,"speaker":"Jonathan Pageau","text":"Yeah. One of the theories that I've had about the modern world, or like, let's say late Christianity and modernism, is that it is. It's a kind of deincarnation where you start to have ideal, idealist forms manifest themselves. And at the same time you have this kind of gross materialism. But both of them seem to kind of split. And so at the same time, as you have people Being all these types of materialists, you have theosophical ideas and all these esotericists going on at the same time. Whereas St. Maximus just offers this beautiful capacity for synthesis where the highest spiritual insights are not contradictory to the phenomena in which they are embodied. They actually are. They hold them together in very similar way as the way that Plotinus was mentioning it, how you quoted Plotinus at the outset."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":1092.08,"end":1136.86,"speaker":"Fr Maximus Constas","text":"Yeah, I think you could see this as a kind of almost baroque philosophical construction, but you could also say that you could also see it as a kind of exegesis on some very basic principles in the Gospel. So because something like something as small and as minute as a mustard seed. Right. Can somehow be a symbol of the kingdom of heaven, or that a human being, a human person can be the image of God suggests that, you know, there's some sort of analogical world here that contains symbolic correspondences. In other words, that there are particular entities or things in the world, but they're not unconnected or unrelated."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":1137.9,"end":1193.85,"speaker":"Jonathan Pageau","text":"So what I'd like to look at is we see how St. Maximus draws these analogies across different levels of being. And so he says things like, the liturgy that we encounter in the church is also happening invisibly in you. And just as Christ manifests himself in the Eucharist, Christ manifests himself in your heart. He does these plays where he's constantly moving across different levels of being to show something which is not just an interpretation of Scripture or an exposition of tradition, but really ends up being like, we're talking about a theory of reality itself. But what I'd like to. Because he does talk about this liturgical space and then the inner space. And so I'd like you to talk a little bit about how liturgy and asceticism shape the world we live in. You know, how we embodying these practices can help us make sense of things that, you know, that we don't usually attribute to the sacred or to religion itself."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":1194.41,"end":1226.15,"speaker":"Fr Maximus Constas","text":"Sure. You had mentioned Saint Maximus work, the mistagogy, and that's really where so much of this kind of comes to the fore. And I'll take advantage of the opportunity to mention that the Patristics Institute that I'm directing these days will be holding a. Sponsoring a conference on the Mr. Goji in early April. You can find out more about it on our website. We have a great lineup of speakers, and we have more speakers that we'll be announcing, and we're hoping it'll be a very exciting and important events."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":1226.15,"end":1226.31,"speaker":"Jonathan Pageau","text":"So."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":1226.31,"end":1458.9,"speaker":"Fr Maximus Constas","text":"Sure. Liturgy and asceticism are Two things that most people might not associate because like so many other things, they get separated. That liturgy is over here, and asceticism is somehow somewhere else, perhaps even in tension with liturgy. So, I mean, in the mystic OG Maximus describes this sort of movement across the three spaces or places of. Of the church building, which for him are not narthex, nave and sanctuary, but nave, sanctuary and altar table. So it's not three spaces, but it's three places, I suppose, around which liturgical activity unfolds. So the movement for him, though, is not simply a liturgical movement, but it's also an ascetic movement. Now, how does that happen? That happens because he takes the convenient number of three, three liturgical spaces, and he correlates it to the three classic stages of the spiritual life or of spiritual progress, by which I mean what Evagrius would have called the first Age, praktiki, which means practical asceticism based. Basically, it's the keeping of the commandments. It's the sort of entry level kinds of ascetic practices. You need to kind of get on the path and start moving forward. That would be the activity that takes place in the nave is sort of asceticism, let's say, basic asceticism. Then the sanctuary is the space of contemplation, which is what you arrive at after ascetic practice has somehow purified consciousness to the point where it's able to see certain things that it couldn't see earlier. And then after that, mapped onto the altar table and the Eucharist is the experience of union with God. So the liturgical movement now becomes simultaneously a sort of ascetic and contemplative movement. And people see this, I think rightly so, as an attempt, again, to synthesize the kind of Dionysian tradition that Maximus inherits, which is all about hierarchies and liturgies and clerical orders and religious services and these kinds of things. Heavily ritualistic, right? And heavily hierarchical. That's the one element that he takes. The other element that Maximus has sort of inherited is the kind of the Evagrian spiritual tradition, which is where the stages of the three stages of spiritual progress come from. And he basically fuses the two together. He maps the one onto the other. So we have this kind of interesting convergence of, let's say, ecclesiology, church structures with the ascetic life and the spiritual life and the mystical life, again, things that are often subject to a kind of disjunction. He has brought together in the place in the church, in the place of the liturgy. So I think some people might be familiar with the way he's mapped this same ascetic trilogy or contemplative trilogy onto the clerical orders of the church. Because he says that the deacon is the one who has purified his consciousness through ascetical practice. And the priest, he says, is the one who has illumined his mind with the knowledge of creation. That's the vision beyond the surface of creation into the intelligible structures of creation that he calls the lohi. Then the bishop, he says, is the one who has perfected his mind, mind in union with the Trinity. So it's the three architectural spaces of the church, it's also the three clerical orders that all coalesce in this kind of contemplative moment. That's sort of the first step of all of this. And you see, with Maximus, you're always playing, what is it, three dimensional chess or something. Right."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":1459.94,"end":1498.09,"speaker":"Jonathan Pageau","text":"Do you see? Because I see something similar in the Life of Moses by St. Gregory of Nice where he creates this ascetic movement up the mountain into the divine darkness. But then when he reaches into the divine darkness, he receives the plan for the tabernacle. And it's very fascinating because when he receives the plan for the tabernacle, St. Gregory describes the tabernacle as a church. And he says things like the pillars of the tabernacle are actually saints. And he has the architectural pattern, but then he also has a. A human pattern where he maps on the different participants of the church onto this architectural structure."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":1498.65,"end":1541.47,"speaker":"Fr Maximus Constas","text":"Right, that's a great point. Yeah. I mean, that's actually definitely something that should be brought into the way the body and the temple correlate with one another in the mystagogy. On the one hand, this sort of percolates up from Christ in the Gospels, identifying his body with the temple. So we have a very good precedent for these kinds of analogies. And you have Paul saying things like, well, the body is. Your body is a temple of the Holy Spirit. So that the later writers like Maximus, others develop this connection in the way that they do is again, it's not. It's not. It might seem exotic or unusual, but it does have deep roots in scripture. I mean, in these cases."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":1541.79,"end":1566.67,"speaker":"Jonathan Pageau","text":"Yeah, because we are the body as a church. We are the body of Christ. Christ says that his body is. He alludes to his body being like the temple, and then our bodies are like temples. The analogy is already there in scripture. Most of the analogies that the Fathers will kind of open up for us are already there. In the text, but they just help us see them when we don't tend to see them in the first place."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":1567.07,"end":1613.57,"speaker":"Fr Maximus Constas","text":"Right. My impression is that these writers took scripture very, very seriously. I mean, literally too. But not only literally, but they began there. And they would read things like the Lord saying, you know, the mustard seed is an image of the kingdom or whatever, and they would say, all right, we'll accept that as true. But now the question is, under what sort of conditions might a statement like that be possible for that to be true, for that to work, what exactly has to be going on? What sort of a world does it need to be so that a mustard seed can somehow have this relationship with this sort of noetic reality called the kingdom?"}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":1613.73,"end":1641.82,"speaker":"Jonathan Pageau","text":"Yeah. When what you see is that they think that way, like their mind is Scripture. It's amazing they don't even explicitly sometimes make parallels. And you almost have to know Scripture yourself to realize that they're connecting different images together. Like when I read St. Ephrem, I get that so much. He doesn't tell you where he's getting it, but you almost have to know all scripture to then see, oh, why he's saying this because of this text in the Psalms and this text in Scripture, and he's connecting them without telling me that he's doing it."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":1642.38,"end":1925.18,"speaker":"Fr Maximus Constas","text":"The other day with some students, we were reading Origen's prologue to the Commentary on the Song of Songs, and Origen gives you every impression that he knows the entire Bible by heart and can move between books and chapters and verses, I mean, faster than a database could. It's really just extraordinary to see, I mean, someone with that, I mean, he was rare, it was a rare gift that he had. But it's extraordinary to see what can be done when one has that kind of awareness of the text, let's say that deep knowledge of it. But I wanted to go back to what we started to say about the movement through the temple space, liturgical movement. Because if the goal of everything is the vision of God, which is sort of unity with God, then whatever stands in the way of that vision needs to be addressed. Which is why so many of the church fathers spend their time talking about the passions and other kinds of obstacles to the vision, not because they're fixated on the negative aspects of human existence, but they want people to be well so that they can have this relationship with God. But if you're saddled with all kinds of, we would call them things like addictions and self destructive behaviors and so forth, you're not going to, you Know, get very far down the road toward the vision of God. I mean, there's that. They'll quote the Beatitude that blessed are the pure in heart, for they shall see God. So the vision of God then presupposes purity of heart. So before we sit around like fools talking about the vision of God. We need to talk about what's obstructing that vision. How do we attain purity of heart? Because that seems to be the proximate goal that will get us to the ultimate goal that we've been called to arrive at. And this is, I think, a big part of Maximus's approach to. It's not. It's not all sort of beatific visions. There's a. There's a labor that has to take place. There's a kind of agony of birth that consciousness has to go through. So our disordered desires, he would say, are kind of misinterpreting the world to us. We're seeing the world through the lenses or the filters. Of our disordered desires, of our passions, as he would call them. These places in life where you've gotten stuck or fixated on certain things. And the passions are interested in pleasure, not the truth. So they'll never get us to the truth of what's out there, what's in the world. So there has to be this reformation in a sense of consciousness, of awareness. Which they call purification. And other kinds of terms like that. The way that I think of it is through a helpful kind of phrase. In which we can say that every depth has a surface. But not every surface has a depth. So that's why we need to attend to the depth of things and not just to the surfaces. And I think this is a particular challenge for us in our day and age. Because we are obsessed with surfaces and fascinated with surfaces. And have a very hard time seeing past them. Because all of reality has somehow been absorbed into these surfaces. And we take the surface of the phenomenon. As the kind of ultimate object of a desire. But once you're able to see through. Once the surface of creation becomes transparent. And I'm not just seeing what I'm projecting onto it. Based on what my own libido wants to do. Once I'm able to, you know, see through the transparent. Once the world becomes transparent to me. Then I'm able to begin to see what Maximus calls these intelligible principles or structures of creation. Which is the presence of God in the world. It's the presence of God to the special way that God makes himself present to that world. And Once the saint or the artist grasps that or intuits in some way that intelligible structure, then he or she is able to begin to transform the world on the basis of, I mean, that again, that principle of divinity that is kind of informing the form that we see."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":1926.14,"end":1942.78,"speaker":"Jonathan Pageau","text":"And one of the things that's important is these patterns or these structures. They're not just the way we think of scientific rules or these. These kind of abstract patterns, but they. They call us, right? They. They are modes of being, modes of engaging into with the world."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":1943.34,"end":2010.74,"speaker":"Fr Maximus Constas","text":"These are not the laws of nature, right? And they're not even subatomic elements. They're. They're spiritual principles, actually. I mean, he calls them the logi, which is the plural for the Logos. So it's the particular way that the Logos makes itself present to a thing, which is to say that the Logos is not present to a rock in the same way that it's present to a tree, in the same way that it's present to a human being, in the same way that it has a particular mode of presence that is analogous to or in proportion to particular beings. And to take it a step further, that mode of the Logos, presence to particular things makes them what they are. It's that act of creation in a sense, right? So he calls them the lohi. And so through the created form, one has the possibility to see the Logos particularized by the uniform Logos made multiform in the plurality of the world, and from there to proceed to a more direct or immediate understanding or relationship with the Logos itself."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":2011.62,"end":2027.86,"speaker":"Jonathan Pageau","text":"And ultimately, one of the secrets is that these logi, if you pierce them enough, they're ultimately the Logos, the Logos himself, that ultimately, behind the multiplicity of the. Of the logi, you find the one divine Logos."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":2028.74,"end":2035.03,"speaker":"Fr Maximus Constas","text":"He says quite clearly that, you know, the many logi are the one Logos, and the one Logos is the many lohi."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":2035.03,"end":2079.44,"speaker":"Jonathan Pageau","text":"And yeah, and so one of the things that surprises a lot of modern Christians that I've noticed is they have this idea that the Incarnation is a reaction to the Fall, right? The Incarnation is their God. You know, we sinned, we did all these bad things. God descends into the world to take our place. All of that type of language. But in St. Maximos, and not just him, but definitely Saint Maximus, it appears very clearly that the incarnation of the God man is not only a reaction to the Fall, but is actually the very purpose of creation. And so how can Christ and the Incarnation as the culmination of all things, help us make sense of our purpose, our lives and our ultimate destiny."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":2079.68,"end":2239.13,"speaker":"Fr Maximus Constas","text":"Yeah, I think that's exactly right. I mean, without reducing it to a caricature, I think a Western Christian tradition has concentrated on this narrative of, of redemption. In other words, on the story of the fall and then the redemption of the fall through Christ and through his suffering, his suffering and crucifixion. That seems to be the kind of major narrative of so much traditional Western Christianity. But from the perspective of a writer like Saint Maximus the Confessor, and I think you could say more generally from the perspective of the orthodox theological tradition, that story, fall and redemption is actually a smaller story within a larger story, sort of a smaller arc, if you will, that comes under this much larger arc. And the larger arc is not fall and redemption, but creation and deification. So God creates the world, brings beings into existence for no other reason than to ultimately unite them to Himself. That's God's purpose in creation. If you read St. Basil's Hexahema, his commentary on the opening verses of Genesis, he says, well, he comments on the verse, you know, and God saw that it was good. And then he asked, well, what exactly is God looking at that he thinks is so good? And then he has this beautiful sort of kind of romantic passage about is God seeing purple mountains majesty and you know, red sunsets and, you know, these kinds? He says, no. He goes, that's what we would think might be beautiful, right? But that's not what God is seeing at all. God is seeing, he says, the purpose for which he brought things into being. And that purpose is union with himself in Christ. And that's what he sees and that's what he says is beautiful. So that's the divine plan for the pre eternal divine plan is for creation and deification. This is interrupted. There's a parenthesis that opens up the smaller arc, as I'm calling it, of transgression and redemption. And St. Maximus says that, okay, the manner or the mode of God's plan had to change, but the purpose never changed. The goal always remained the same. God never took his eye, in a sense, off that aim, even though he had to get at it from a slightly different way because of the contingency, let's say, of the fall. So it was modified by human free choice and sin, but not done away with in its sort of larger form or features."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":2239.69,"end":2264.58,"speaker":"Jonathan Pageau","text":"And there's a way in which we also. He goes very far some actually, because it's not just us. People might tend to accept that humans are meant to be deified or meant to participate in God, but there's a sense in his writings that it's everything, like all of creation, somehow at the level at which that's possible. Is meant to be united and be part of the life of God. Participate in the life of God."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":2265.06,"end":2295.16,"speaker":"Fr Maximus Constas","text":"Right. I mean, this is kind of a common idea among the Greek fathers that the human person who was created last in the biblical account is kind of the sum or the summation of the creative effort. Because it's in the human person that creation attains consciousness, that matter attains consciousness in the human person. So the human person now becomes the agent within creation that has the ability to recapitulate, let's say, within itself, the whole of the created order."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":2295.48,"end":2303.5,"speaker":"Jonathan Pageau","text":"This is, I think, really important for people today. Because one of the problems we have is this tendency in scientism to try."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":2303.5,"end":2303.86,"speaker":"Fr Maximus Constas","text":"To."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":2305.62,"end":2352.93,"speaker":"Jonathan Pageau","text":"View things and view meanings as apart from man. But what St. Maximus offers, and it's actually an interesting solution to the problem of emergence and the problem of all these phenomena. Is the notion that no man is like a funnel where all of this meaning gathers into. And there's no way to see the meaning of the world. And there's no way to see the purposes of things in creation without going first through man. And that can really change a lot of the way in which people. It brings us back to the more ancient way of thinking. We can understand what Aristotle. We can reconnect with some of the things that Aristotle talked about in terms of final causes. If we see them as coming into man as this fulcrum which joins the two, the invisible and visible together."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":2353.33,"end":2468.17,"speaker":"Fr Maximus Constas","text":"Yeah, absolutely. And I think we can give this another twist. Because it's not simply the human person that's the key or the linchpin here. Or one of the words uses is the workshop. All of these things sort of are kind of. Maybe it's an artisanal or an artistic metaphor, but it's the human person in Christ. Because we failed to attain the goal that was established for our nature. Which is why Christ came and did it for us in a sense, or. And showed us the way and made that way available to us. So it's not just a human thing. It's a human divine kind of work. You hear lots of words today like justice or equality or, I don't know, truth or righteousness or whatever they are. And they're largely detached from any kind of context. And of course, we proclaim them very loudly. And we demand them and insist on them. But I think, you know, in the Christian tradition, not just the orthodox tradition now But I think in the whole Christian tradition, those words don't exist, not simply apart from human beings. They don't exist apart. I mean, they don't make sense apart from Christ. In other words, the whole tradition is this personalist tradition. There are no abstract categories out there like justice or righteousness or equality or identity or, you know, you name it. And all of these things have their locus in this redeemed humanity that we find in Christ. So it's his truth, it's his justice, it's his righteousness. And, you know, I think a lot of this kind of language, this sort of this fragmentation of the language has crept into many Christian traditions, but I think we adopt it at our own peril because it's to forget this larger context in which those words originally were defined in a sense and made sense."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":2468.89,"end":2495.94,"speaker":"Jonathan Pageau","text":"Yeah, we see it in the modern attempt to demythologize the Scripture and to try to abstract these moral principles out of the narrative. But we can see where that leads. You know, we can see in the. In the 20th century and the 19th, 20th century, with the revolutions and all these. This chaos, we can see where to remove it from the narrative, from the ritual, from this participation. You know, it leads us into scary places."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":2496.66,"end":2514.34,"speaker":"Fr Maximus Constas","text":"Right. Because first you abstract the categories or the concepts, then you impose them on societies or communities. And, you know, as you said, there are more than enough examples just from our own recent history to illustrate what can go wrong. So sadly."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":2514.66,"end":2640.7,"speaker":"Jonathan Pageau","text":"So one of the things I mentioned at the outset is that we both have a love for art, liturgical art, but art in general, culture, and how it is that Christians can connect to culture. And this is really something that I'm seeing that many artists, especially Christians artists today, they really struggle at how to position themselves in the world. And one of the images that you bring about in your writing, which I found very beautiful, is you talk about the gifts. That is, when people bring the gifts into the liturgy for the bread and the wine to become the Eucharist. You mentioned that it's not just about giving up the raw materials, but it's also bringing up human activity because these things have already been transformed. And so you get a sense in which it is this art which is also being brought to then be offered back to us as the blood and body of Christ. But there's also another important thread in the ascetic tradition of the Church. You know, we see it in Hesychasm is this suspicion towards imagination. And I've seen many artists who kind of approach Orthodoxy become completely bewildered when they read the philokalia or they read these ascetic writings, and they're completely. They struggle on what to do because they don't understand the relationship between human making and this. Also suspicion of imagination. And so one of the things that I was surprised to notice is I saw your name in the credits for a recent movie, A Hidden Life. And so I thought, oh, interesting to see that you have some connection with this project, which many people have seen as being a powerful example of a Christian story being told. And so what advice do you have for artists, for musicians, architects, but also writers, filmmakers, people who. Who want to create culture today, whether sacred art or secular art? And how is it that they can do this as Christians or even as secular people who want to act in truth and make beautiful things?"}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":2641.98,"end":2894.97,"speaker":"Fr Maximus Constas","text":"Yeah, I think I hear two sort of broad questions there. And the first thing you started to talk about was the role of art, I suppose, or what can artists take from, let's say, the liturgical experience or the life of the church? And I think you mentioned the gifts. That's why I say this. And it's interesting. I mean, one issue is that under pressure from a certain form of scholarship, we have this. We insist on this idea that, well, the Eucharist is a meal. And anything that detracts from a kind of, you know, dinner, like, atmosphere is somehow wrong or bad. Now, obviously, it's a meal. Historically, it began as a meal. But we always want to avoid reductionism. So if you think about the Eucharist, I mean, what happens? Maximus describes this liturgical movement through the church that climaxes on the altar table with the consecration of the Eucharist, which he covers in silence, by the way. He doesn't comment on that particular moment. But we don't offer wheat and grapes alone. We offer bread and wine. Which means what? That we take the gifts that the Creator has given us. And with the power of technology and mind that the Creator has also given us, we transform those gifts into something more than what they were. And again, that rests on the ability for the mind to see, okay, what qualities in here, within this wheat and within these grapes that can be transformed. And it can bring out something even greater about them. And we offer that back. And as you know, we offer that and we say, thine own of thine own, or your own of your own, your own gifts from your own gifts. This is what we offer back to you. We have nothing else to give God. Everything we have, we've received from Him. But we don't just say, okay, we're Re gifting the same gift you gave us, we express our gratitude by transforming it and offering it back in this remarkable, truly remarkable way. And this liturgical moment, let's say this liturgical act, I think, becomes paradigmatic, or should be paradigmatic for all human activity. So, I mean, this means that something like work in science or in society should be based on wisdom and reason and not on another kind of a calculus or the organization of the social world. There should be justice and compassion, not expedience or profit or something like that. And for me, the examples that come readily to mind are how this kind of paradigm inspires human art and human artists to sort of unearth the spiritual potentials. Just like what was in the wheat and what was in the grapes. There are spiritual potentials within all matter, within marble, within wood, within pigments, within all kinds of things, to unearth those principles and then to sort of show them forth in the place of the Church in monumental art and architecture. So that's the work of the artist, at least as it's understood within the patristic tradition and the Orthodox tradition to enable. In other words, I think it's Dimitri Staniloy who talks about this, and he speaks about it very beautifully. He says the insight and the art of the artist, the techne of the artist, is that thing, that practice, which enables the elements of creation to join in the magnificent chant of the liturgy. Right. They're voiceless until we give them that voice that they have. There's an inner potential that we bring out, and then we. And that enters into the space of the church, where everything is transformed. There are no raw materials lying around in the church. Everything is polished and carved and worked and drilled and painted. And. Right. It's. This represents a trans. Represents an icon, in a sense, of the whole universe in a state of transformation."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":2895.35,"end":2935.74,"speaker":"Jonathan Pageau","text":"There are two images that come to me right away is in reading this description of the gifts being brought up. First of all, the first thing that comes to me is the parable of the talents, which I would never would have connected to this, but seems to really join into this image of bringing God, giving us things, and then us having to make it fruitful and then bring it back. And the other is the New Jerusalem itself. There's an amazing little description of the New Jerusalem where it says that the glories of all the nations are gathered into the Holy City, into the New Jerusalem. So this idea that all these positive things. Of what? Of human activity are gathered into this final image of the Holy City."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":2936.62,"end":2965.52,"speaker":"Fr Maximus Constas","text":"Well, the other idea there, though, is that it's not a return to a garden. There's a movement from garden, from a, quote, natural state to what? To this urban fabric, to this magnificent human artifact in. It's not a human artifact, but the image that's used is not of a forest or a grove or garden, but it's of a built environment. Right. A structure, an architecture."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":2965.76,"end":2970.92,"speaker":"Jonathan Pageau","text":"And so how. Sorry, yes, that's what I wanted, because that's the hardest part for artists is the aesthetic part."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":2970.92,"end":2972.8,"speaker":"Fr Maximus Constas","text":"Is the aesthetic part of the aesthetic part?"}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":2972.8,"end":3003.31,"speaker":"Jonathan Pageau","text":"Well, the part where you read how. Because we know, let's say I create things and I know that there is a buffer, there's a place like between any and the tradition and the making, which would be something like imagination. And I know that I use my imagination to create things. And so it's hard for us, when we read the texts that are so suspicious of imagination, to know how is it to live? Like, how can we join these two things together?"}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":3004.6,"end":3332.02,"speaker":"Fr Maximus Constas","text":"Right. You know? Yes. Right. So that's a big. There's a lot of people I've heard from others that concerned about this. The other day I watched with some of my students, Tarkovsky's Andre Rublev. Anyone who hasn't seen it is encouraged to run out and do so. But it's largely about. I mean, obviously Tarkovsky has projected his own artistic struggles into the figure of Andrei Rublev, who, despite the fact that it's a three hour movie about an iconographer, he never picks up a paintbrush. Right. Because the problem that Rublev is facing, which is the problem Tarkovsky was facing, is how can one be an artist? How can one create or be creative in a world torn apart by violence and hatred and suffering under oppression? So there's that. It's sort of like that famous statement by Teodor Adorno that poetry after Auschwitz is barbaric, which actually Adorno retracted at some later part. But there is a question about just how does one proceed to be artistic or creative in a world such as ours? But I think the precondition, to go back to what I said a moment ago, the precondition for artistic vision or creativity has to begin in that place of asceticism, in a sense, a kind of self denial. You know, there's. There's a great passage from one of Tarkovsky's journals from the. From the 70s, and he says extraordinary things about artistic talent because he was nothing if not a great artist. And he says that talent is not so much a gift from God, it's really. It's It's a cross that the artist is doomed to carry, right? Because there is a kind of, you look at this, a demonism in art, right? I mean, great writers and alcoholism and all these other cliches that we have, or, you know, rock stars and the stuff that. The trouble they get into and whatnot. I mean, there's something about art that can be. That can be dangerous, let's say, or, you know, you pay for it with your soul. Deals with the devil. Think of all of the popular cliches. And so he says it's a cross to be carried, which I think is that ascetic moment where whatever we have, like Saint Maximus says, everything needs a cross because it's either too much or too little. Nothing is quite right, and it needs to be crucified, in a sense. Is that great? It's a Buddhist once said that I like the cross because it crosses out the eye, right? So, you know, Iris Murdoch talks about the unselfing of the artist that has to take place. She uses the image of Marseilles, who's flayed by Apollo, which, again, is sort of the price that the artist has to pay or should pay. And since you mentioned a hidden life, one of my favorite scenes in the whole film is where the main character, Franz Jagerstetter, is in his church, which is being the wall paintings of which are being refurbished, I suppose, by an artist. And Jagerstadter is sort of the church warden. So they spend time together and they're talking, and the artist is this very interesting figure. He's a voice for somebody or something. And he's almost like Theophan, by the way, in Andre Rublev, because he's a little. Not exactly sarcastic, but maybe a touch cynical or world weary, whatever. But he says at one point, he says he's talking about the role of the artist, the role of the iconographer, in a way. And he says at one point, how can I be painting these images? He says, how can I paint what I haven't lived? And then at the end, it becomes a voiceover. It's the same artist speaking, and Malick plays the voice as a voiceover, as over this beautiful landscape with the setting sun. And the last thing he says is, one day I hope to paint a true Christ, which to me is just. That was worth the price of admission alone. So it's like, I have a friend, he's a painter. He's a priest in California. He's a fantastic painter. He actually painted the portrait of me that you see on the Inside flap of the Art of Seeing book. I was camera shy at the time, so I had a portrait commission as a favor, as an expression of his friendship. But he said, once I asked him what. I said, what is art? He said, he goes, art, he said, without even thinking. Art is the search for an archetype. Just sort of what the painter in Hidden Life is saying. One day I hope to paint a true Christ. And we have this theology in the church of image and likeness and the image. It's not just a formalist kind of thing where the image bears a resemblance to the archetype, to the source, but the image longs for the source, it yearns for the source. It's not a visual thing only, it's a relationship of desire that's created because the image that emerges from the archetype longs for reunion with its source. That's why I say that art is this sort of search for an archetype. I mean, still haven't got to imagination yet, but we're getting there."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":3332.02,"end":3429.6,"speaker":"Jonathan Pageau","text":"Okay, do you. What do you. I mean, I think that what you're saying is very powerful. I, on the one hand I see it. On the other hand, I have these immense contradictions, you know, because I, in my own experience, let's say, like in my own experience, I've found the strange moment where, you know that the works that say I'm making icons, I'm making icons for churches, I'm making icons for people and the works which are objectively better sometimes. And that when people look at them, they'll say crazy things like, you know, oh, this is the Holy Spirit did something. And I know that when I made that, I was not. Like, I was not there. Like I was in a massive fight with my wife or I was completely, completely off the road. And then the opposite sometimes isn't necessarily true. Like those moments where, you know, I'm really rigorous with my daily prayers and I'm doing the Jesus prayer I'm doing that won't necessarily produce better icons. And so it's like I struggle because I can see what you're saying in the ideal, but in the practice, it seems like there's a strangeness about our path which doesn't necessarily. Sometimes I see it almost as, in a way, it is kind of grace in the sense that just like a priest can, let's say, the liturgy is efficient no matter what the priest is going through. And so sometimes I get the feeling that maybe that's what's going on because I can't account. Let's say, for the quality of my work in my spiritual life. That's a very strong confession I'm making. But it's true."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":3430.94,"end":3537.96,"speaker":"Fr Maximus Constas","text":"No, I mean, there are different moments, right? I mean, you're right. I'm talking about the ideal. Because that's sort of like the point of light that I'm gesturing toward. That's the goal, that's the aim, that's the ideal. Without ideals, without these things, where would we be? But that's not all there is. I mean, you know, saying every day in the life of a married couple over 50 years was like just an ongoing honeymoon, right? I mean, if it was that, by the way, it would mean they never grew in their relationship either. They say, oh, it's not like it was when we first got married. Well, thank God for that, right? Because you're supposed to be standing still. So, I mean, what you're describing is sort of somewhere else on the map. It gets back to the struggle. It gets back to this kind of, you know, burdensome, sort of mixed situation that we're in that Paul describes, you know, in terms of the things that I want to do, I don't do and the things that. Well, you know, how the rest goes, sort of. And Saint Maximus describes this as. We're in this kind of middle state right now between creation and then deification. And, you know, there's this being and then there's well being and then there's eternal well being. We're in this middle place where we're trying to be. Well, we're trying to live properly. But of course, no, I mean, it's like the parable of the wheat and the tares. I mean, everything is mixed together in this life. St. Paul says, there's another law at work in my members that's hostile to God, that doesn't want God. That doesn't mean that that's all there is to you. Just because you're having a bad day, it doesn't mean God can't work through you. I'll spare you the injurious analogy of God speaking through the ass in the Old Testament."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":3538.92,"end":3541,"speaker":"Jonathan Pageau","text":"I'll take it. That's okay. I'm fine with that."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":3541.15,"end":3562.19,"speaker":"Fr Maximus Constas","text":"No, I can do better. You're a nice guy. I'll do better than that. Even the high priest spoke prophecy that year, not knowing what he was saying, but because of his office. Right? I mean, who can unfold all of these mysteries of life? I mean, they're just the complexities of what we're called to sort of try to Work through."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":3562.27,"end":3569.15,"speaker":"Jonathan Pageau","text":"But what is your advice for the proper use of imagination? This is the hardest one. I kept the hardest for the last, for the ending."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":3570.35,"end":3700.14,"speaker":"Fr Maximus Constas","text":"Well, I think there's a lot of confusion about this word in the first place. And I think when most of us hear that word and use that word, we're probably conditioned by, I don't know, the Romantic period and people like Coleridge and what they had to say about the power of the imagination. It's also coupled with this kind of particularly modern understanding of the artist as a sort of isolated creative genius. So all of those things get, you know, mixed up with all of this. And in English, imagination is a nice sounding word. So this image is a nice word and there's imagination. And we're always talking about reimagining things and that's always a good thing or whatever. But in funny, in. So it's innocuous. Imagine image. Imagination. In Greek, though, the word for image is ikon or ikona. Right. In the modern version. But imagination in Greek is fantasia. Yeah, fantasy is where we get our English word fantasy from. So we're not. We're not even in the same ballpark anymore. So imagination, you know, that sounds good, right? That sounds nice. But fantasy, that's already a different kind of idea or experience. And I've heard many modern day church artists, whether they're iconographers or church musicians or church architects, and they're all saying, look, we don't want to be condemned to repeating the prototypes of the past. We are creative artists. We have our talents, we have our gifts and we want to do our own thing. That's what people a long time ago did. Where did those prototypes come from? Somebody conjured those things up. So why can't we do the same? I've heard that. I've heard this many, many times. I'll come back to this, but before I do, I want to lay out a couple of things that I think are critical in this conversation. Just make two points. Basically, everybody knows the story of Jacob's dream where the poor guy goes to sleep with a stone for a pillow and then has this dream of the heavenly ladder. Now, when he wakes up, what does Jacob do?"}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":3701.18,"end":3703.1,"speaker":"Jonathan Pageau","text":"He raises the stone and he anoints it."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":3703.49,"end":3904.11,"speaker":"Fr Maximus Constas","text":"He builds an altar. He basically, he builds an altar. So the vision that he had, which is not a product of his fantasy or imagination or because he was sleeping on a rock or, you know, the food he had for dinner, is somehow influencing it. No, we understand it to be a revelation that's given to Him. So the divine revelation that he receives somehow spontaneously results in the creation of sacred space. That's the kind of, the minor example that I have, the major example that everybody knows is, and it's the best one is Moses entry into the dark cloud where he sees what the archetype, you mentioned it earlier, of the celestial tabernacle. This is revealed to him, and God gives him specific directions about how to construct it and on what days and what materials to use. And an entire plan, a blueprint for reproducing in matter this immaterial reality for this material image of the immaterial and invisible celestial tabernacle. So we have this heavenly archetype or this heavenly form that now becomes reflected and built in the re presented in the material world. Now, most people, if they heard that sentence alone, they would say, oh, he must be talking about Plato. It sounds like there are forms up there and then they sort of have their material shadows down in the world where, leave it where we live, right? But Moses lived about, what is it, a thousand years before Plato. Right? So this is why you have that great saying by the 2nd century philosopher Numenius, who gets it from an earlier Alexandrian, Hellenistic, Jewish thinker, Aristobulos. And he says, well, he says, don't get too excited about Plato. He said, after all, what is Plato if not Moses speaking Attic Greek. Yeah. So this is not the Platonic view of the world. This is the priestly view of the world. And we deny ourselves this tremendous resource if we dismiss it as so much Platonism. So the idea, I think, in other words, any artist who thinks that art is about putting across an idea or propagating a personal thought or some sort of. I mean, I would ask that person to think about these biblical passages and what they've meant to the church, right? And that maybe iconography is not reducible to art in the modern sense. And maybe the making of icons is not simply some private creative thing that I do or that you do to sort of satisfy some creative impulse. Now, having said all of that, I don't want to deny a place for the imagination, but it has to be tempered. It has to be disciplined, it has to be educated. It has to be part of this larger liturgical movement that we've been talking about here, which is why nearly all so many iconographers in the church are saints. I mean, Andrei Rublev was recently."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":3905.63,"end":3999.71,"speaker":"Jonathan Pageau","text":"So, no, I think that your insight is right. And the way that I kind of see it is that there's a hierarchy to say it that way. That is, there's a way in which you have, like, you can imagine something like you have, you know, the life of the saint, and then you have the hagiography. And then a little bit lower down on that ladder, you'll have something like legends about these saints that are, you know, they end up being a little more fantastical, you know, and so there's a sense in which we don't. We kind of look at these legends, we find them fun and amusing, or we find them interesting to help us kind of see a bit further. But then we also have higher versions of these stories, and you see it. It almost seems like you see that even in apocryphal literature, where we have Scripture and then we have certain apocrypha which are pretty. Let's say, pretty kosher in a way. And then it kind of comes down into all these more and more fantastical versions of apocrypha. But even in those fantastical ones, we might have some little glimpse. There's a little seed that will be carried and will be kind of kept in the tradition. That's at least the way that I try to see it. And so what it does is it leaves a possibility for something like a hidden life, which is obviously not a liturgical work, it's not liturgical art, but it connects through little seeds to something that we can find at, let's say, at higher levels of participation in the liturgy. For example. I know, if that layout makes sense to you."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":4000.01,"end":4088.4,"speaker":"Fr Maximus Constas","text":"Yeah, there's definitely, to use your word, there's definitely sort of a hierarchy of forms, let's say, everything from, you know, things revealed in Scripture to apocryphal stories. Some of them have greater value than others and so forth. So. But I think the thing to also say is that often these very seemingly naive kinds of stories contain, you know, tremendous wisdom. Right. There's one of my former colleagues, he's since reposed God rest his soul, was an authority on the Gospel of Luke. And Francois Bourbon, he was a Swiss scholar of the New Testament. And his work was remarkable because, I mean, he knew the Gospel of Luke better than most people. And he was also interested in these apocryphal traditions that were based on the Gospel of Luke. And he saw these not as aberrations, let's say, or departures from the canonical narrative, but simply different forms of exegesis. Because if you thought about what the story was saying, it wasn't some hokey kind of, you know, I don't know, Aesop's Fable or, I don't Know what I mean? But he said this is really just another way of unfolding the biblical account by either by expanding it or by. So it doesn't always work because. Because there are some apocryphal texts that church has condemned or dismissed or whatever, but others it's been happy to make use of."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":4088.72,"end":4169.36,"speaker":"Jonathan Pageau","text":"Yeah, we sometimes don't think there's Christian would be midrash, but I think definitely there is, which is this interpretation through storytelling. We don't tell you the meaning. We expand parts of the story that are invisible or that are in between other facts. And by expanding those, you can actually see the connection that exists between the different aspects of the original story more than you could before. And it seems like that's definitely something which exists in Christianity. There's amazing legends in Jacques Varadjin's golden legend, this legend of the cross which describes how the cross was taken and then it became the rod of Moses. No, not the cross. The tree in the garden became the rod of Moses and all these different things until it then becomes the cross of Christ. And you think, okay, that's wild and crazy. Exactly. But you think it's crazy. But then if you look at how the exegesis, like how the. The Fathers will interpret the meaning of the cross, you'll see that, no, it's actually doing in a narrative way what the Fathers would do in a. More. Just in a more descriptive way, which is, you know, there is a connection between the rod of Moses, his staff, the cross and the tree. And so you can do that in a manner that brings it all together in a story. So."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":4169.36,"end":4215.44,"speaker":"Fr Maximus Constas","text":"Yeah, right. I mean, there's Romanos the melodist, who's this very famous 6th century liturgical poet, has a poem on the crucifixion and he talks about the cross being planted on Golgotha and the roots of this. Because the word for wood in Greek, xilon, is the same word for a tree. So when you say the cross was planted, you're saying this tree was planted. Just the wood, in other words, was planted. The wood of the cross, the tree and the roots of the thing of the cross penetrate deep into the earth and they puncture the body of death. So it's sort of like the world tree in a way. Now, whether or not Romanos knew about that, I have no idea. But the idea presented itself to his mind, and there it is in that Kondakia, in that poem. So."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":4216.24,"end":4251.03,"speaker":"Jonathan Pageau","text":"Wonderful. Well, we've been going for much longer than I planned because this is just a great conversation, but I think that we've given people quite enough to think about and to explore. And so I encourage everybody to look into the conference which is happening this spring, that you can go. The people that are going to be there are really the summits. I've mentioned many of them on this channel before. And so I think it would really, it would be a good place for a lot of the people watching these videos to learn more about Timaxis and how he connects to the world today. And so, Father Maxwis, thank you for your time. Thank you for taking this time with me. I really appreciate it."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":4251.35,"end":4252.99,"speaker":"Fr Maximus Constas","text":"It was a lot of fun and."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":4252.99,"end":4254.71,"speaker":"Jonathan Pageau","text":"Maybe we'll do it again. I hope so."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":4254.79,"end":4255.67,"speaker":"Fr Maximus Constas","text":"That would be great."}
{"episode_id":"SW - #208 - 2021-12-20 - Fr. Maximos Constas - The Relevance of St. Maximus the Confessor Today","start":4256.07,"end":4318.74,"speaker":"Jonathan Pageau","text":"Thank you, Father. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon, the Pageau videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
