{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":2.64,"end":267.36,"speaker":"Jonathan Pageau","text":"On this episode of the Symbolic World podcast, I'm putting up the very first public conversation that I had with Dr. Jordan Peterson. This was originally posted on his YouTube channel, but I thought it would be interesting for people to follow the story a little bit of how all of this came about. I met Jordan in 2015 because I was interested in some of his ideas on symbolism. And then in 2016, everything blew up around him. Everybody knows the story about gender pronouns and everything that was happening. And it was very strange because I had seen him for the very first time six months before that. I had seen him in the spring of 2016. It was the first time I had met him in person. And when I met him, I had a very strange intuition that I had to communicate one information to him. And the information that I had to communicate had to do with his vision of chaos, because Jordan often talked about chaos, and he talked about chaos as being on the edge of being so on the outside of the city. But for some reason, I had the intuition that he really needed to also understand that chaos exists in between things as well, that we need to understand it that way, that in between categories, there are buffers of chaos which separate the categories, but also, let's say, is the place where there's an. An aspect of confusion, an aspect of indeterminacy between the categories. And so I talked about the monsters on the bridges. I talked about this notion of the crossing of the river. And so six months later, when everything exploded around him concerning gender pronoun and the notion of people who have identities or pronouns that don't totally fit within normal categories, I was really surprised. And so since I had met him, Jordan had asked me to come on his channel to do an interview to talk about art, to talk about symbolism. And when I went to see him in the fall of 2016, it was two weeks after everything had blown up around him. And so when I saw him at his house and I stayed at his house for. For a day or so, he was completely frazzled. His eyes were like a deer in headlight. Still, he totally couldn't understand what was going on, why this was becoming so big, and why his whole world was being turned upside down. But still, despite that, he kept insisting, I really want to do this interview. I really want to do this interview. And so at the beginning of November, one day before the election of Donald Trump in the United States, Jordan called me and said, do you have some time? I'd really like to do the interview today. And so we did. And what you are going to hear is the result of that discussion. In it, we talk about art, of course, and about the problems of contemporary art, the relationship to traditional arts. But then we also talk about the question of things that don't fit into categories. In that same conversation, on that same day, we also had a discussion about the Metaphysics of Pepe, which many of you might have heard. So I'm going to put up the Metaphysics of Pepe in my next episode and I'll give you a bit of the story surrounding that so that you understand why we ended up putting up the Metaphysics of Pepe. Almost. I think it was almost a month and a half after we recorded it. So I hope you enjoy this and I'll see you on the next episode. This is Jonathan Peugeot. Welcome to the symbolic world."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":277.85,"end":292.41,"speaker":"Jordan Peterson","text":"Today I'm talking to Jonathan Pageau, who I think is touched with more than a little bit of genius. And he's a Quebecois artist and a carver, sculptor. And I'd like to start by letting Jonathan tell us who he is and what he does."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":293.62,"end":328.35,"speaker":"Jonathan Pageau","text":"Okay, so, yeah, I'm an icon carver, which means that I make carvings for churches and for people of traditional images. So I get commissions and I work within a traditional language of Christian art. I've been doing that for about five years now, full time. And before that I actually lived in Africa for seven years, working with artisans there, trying to help them in their business practices and their design skills. So I have a very kind of strange and varied background. I studied fine art at Concordia University here in Montreal in the. Yeah, in the late 90s. So, yeah."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":328.35,"end":331.95,"speaker":"Jordan Peterson","text":"So how many full time icon carvers do you suppose there are in Canada?"}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":332.75,"end":342.63,"speaker":"Jonathan Pageau","text":"In Canada, I'm the only one we're about actually in the entire world where we're very few. I actually know most of them. Yeah. Yeah."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":342.63,"end":352.93,"speaker":"Jordan Peterson","text":"Well, it doesn't sound like a very easy thing to monetize. So how in the world did you go from being an art student trained at Concordia to being a carver of icons?"}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":353.25,"end":402.44,"speaker":"Jonathan Pageau","text":"I studied painting and drawing at Concordia. On the surface, I was doing really well. I actually finished first in my class. But there was a malaise the whole time I was working there. Because I'm a Christian, I grew up a Christian. And I was trying to figure out how that would connect to my art practice. And so I was looking, trying to figure out symbolic languages in painting and trying to find ways to talk about bigger, bigger questions, metaphysical ideas in my paintings. But I didn't have the language, so I was really just groping around Almost blind. And. Yeah, and at the end of my time at Concordia, the professor who was supervising me, she basically said on the very last day, she said, what are you doing here? This is not, this is not the place for you. After that, it kind of left me dangling, you know, and questioning a lot of things."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":402.6,"end":406.04,"speaker":"Jordan Peterson","text":"So what sort of education did you get at Concordia?"}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":406.04,"end":426.68,"speaker":"Jonathan Pageau","text":"All the fine arts programs now, I think Pretty much almost 100% are based on contemporary art practices. And so very few universities, very few programs teach technical skills or teach you, you know, how to draw in a classical way. So they're actually not really teaching anything. It's hard to know exactly what they're doing."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":427,"end":460.87,"speaker":"Jordan Peterson","text":"I guess it was. Ever since the 1960s, there has been this idea in the art world that technical skills and ability just aren't that important. And that the important thing is to find your, I would say your political voice. But it's, it's very strange to me that this has occurred because it seems to me that before your voice is anything but a. An off color croak, you have to become a disciple of a discipline and an apprenticeship and, and learn the tools and trades of your craft and learn how to be an artist. Because there's a technical end to that."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":461.52,"end":493.87,"speaker":"Jonathan Pageau","text":"I mean, this is really almost an image of the world as it stands now. The purpose, or the stated purpose of modern, especially postmodern art was to free the artist, to break away all the things that were holding the artist back in terms of rules and in terms of just the way that things were presented. But what ended up happening is that there were no more legitimizing objective or strong legitimizing structures around the art. The only thing left was politics and relationships and status, basically."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":493.87,"end":553.95,"speaker":"Jordan Peterson","text":"So, you know, there's a big literature on creativity and it's strongly, which I know very well, my lab designed the Creative Achievement Questionnaire, which is used, it's been used in hundreds of studies now to assess lifetime creativity. And so I've spent a lot of time looking at the measurement of creativity and also trying to understand creativity. And the literature strongly suggests that when you impose restrictions on people, it actually makes them more creative rather than less. Because part of what creativity is is the overcoming of obstacles. You know, imagine someone who writes poetry in the haiku format. Well, it's, it's very, very restrictive and obviously arbitrarily so. But the fact of the restriction is partly what makes the poetic form possible. The same thing is true if you think about playing a game. There's a, there's far More things that you can't do when you play chess than there are things that you can do. But there's still an infinite number of variations of chess games. So this idea that there's a dichotomy."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":553.95,"end":556.91,"speaker":"Jordan Peterson","text":"Between structure and rules and creativity is."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":557.15,"end":560.75,"speaker":"Jordan Peterson","text":"Is perniciously false and contradicted by the evidence."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":560.99,"end":641.17,"speaker":"Jonathan Pageau","text":"And when you. When you start to explore the art world and the way it works is. There's an irony there that it purports to not have boundaries on creativity and structures on creativity, but they're actually extremely strict, and they're hidden. They're kind of this pernicious thing underneath where actually you have to present things in a very, very precise way for it to be able to enter into the legitimizing structure of the gallery. It's like the message that I was trying to work on and the structure of contemporary art just didn't fit together. And so at some point, I gave up on art. I had to work. You know, I had a studio, and I closed it down. I just destroyed all my paintings. It was actually a moment of kind of spiritual crisis for me. And it's in that moment that I discovered medieval art, I discovered traditional Christian art. And when I discovered traditional Christian art, it was exactly what you were saying before. The forms of Christian art were kind of developed as a community, you would say, as a. The Christian community developed these forms that were actually extremely powerful and created like a cosmic map, basically. And so you could use these images as a type of algebra to create sacred language. And so discovering that, I just felt like, yeah, it gave me so much possibility."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":641.25,"end":670.02,"speaker":"Jordan Peterson","text":"Yeah, well, you're going back, like, 800 years, 900 years into the history, maybe even farther than that, back into the history of traditional art. So you say you discovered Christian iconography. And I also know that you're an orthodox Christian, which is a strange thing for a Quebecois. So, I don't know, you're a pretty rare bird. So maybe you could say a few words about the discovery of the iconography, how that came about, and also how it is that you converted to orthodox Christianity."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":670.34,"end":792.09,"speaker":"Jonathan Pageau","text":"Well, I mean, those two things are very intricately related. I think during university, just like a lot of people, I kind of got into an intellectual and spiritual crisis. I was reading Derrida and Baudrillard and all the postmodern theorists trying to wrap my head around this, like, what does this mean for me and what is going on? And it's in that kind of crazy time that I started reading the church fathers and reading more Traditional authors, people who talk about traditions in different cultures, and realizing that this was really the solution, for me, at least, it was the solution to kind of get out of the chaos that the modern world had kind of fallen into. But it came with the art. So looking at the art and seeing the patterns emerge and seeing that those patterns in the art were the same as you find in Scripture and the same that you find in liturgy and the same that you find in the stories that are around us, even stories that aren't actually Christian, to see those patterns emerge is what really caught my attention. And so I was looking. At first, I wasn't necessarily going to be Orthodox. I could see the patterns coming through, and I was trying to figure out, and I couldn't find them in my own milieu, which I grew up evangelical. And so I was looking for it. I couldn't find it. I looked at Catholicism, but finally I felt that in looking at Orthodoxy, I felt like Orthodoxy was the type of Christianity that had preserved the most of that ancient worldview and was still living it today. So it's a living tradition. You know, when you say you went back 800 years, in a way that's true, but it's not true for the Orthodox because they continue to perpetuate those forms until today. I mean, not that they didn't go through rocky times, obviously, it's been crazy for orthodoxy as well. But for some reason, they've been able to constantly revive their forms, you know, and today it's a thriving. A thriving part of Christianity."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":792.25,"end":795.85,"speaker":"Jordan Peterson","text":"Well, you know, this idea of this."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":795.85,"end":845.21,"speaker":"Jordan Peterson","text":"Return and the continual revivification of traditional forms reminds me of two things. It reminds me of the old Egyptian stories about Horus and Osiris. And Horus is the Egyptian God of vision and attention. So he's the Egyptian eye and the. The falcon. And after Horus defeats Seth, who's the sort of Egyptian precursor to Satan, and reclaims his throne, he goes down into the underworld to rescue his father, Osiris, who Seth had chopped up into pieces. And when he's down in the underworld, he gives Osiris one of his eyes, which Seth has torn out. He gives him one of his eyes and then brings him back up to the surface, and they rule Egypt together. And the union of Osiris and Horus was like the pharaoh's soul."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":845.53,"end":845.97,"speaker":"Jordan Peterson","text":"So there's."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":845.97,"end":864.13,"speaker":"Jordan Peterson","text":"There's this ancient idea, it's expressed in more places than in Egyptian mythology, that it's the duty, it's the sacred obligation of someone who's awake to journey to the underworld and revivify the corpse of his father. And that unites the individual with a living culture and also makes the culture alive."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":864.13,"end":867.13,"speaker":"Jordan Peterson","text":"Because, of course, culture, in some sense, because it's the product of."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":867.46,"end":984,"speaker":"Jordan Peterson","text":"Of the dead, is a dead. Is a dead entity. It has to be continually revivified by the living. And then you see that echoed in more modern form, oddly enough, in a Disney animated movie in Pinocchio. And Pinocchio is the story of the struggle of a puppet, a marionette whose strings are being pulled by forces that he does not understand. It's the story of his struggle towards individuality and rebirth. And a number of things happen to Pinocchio. He has to learn not to lie. He has to learn not to be a neurotic victim, because that's actually one of the temptations. It's that it's. It's his agreement that he's a neurotic victim, that that places him on Pleasure island, where he virtually where he's in danger of becoming a jackass and a slave to totalitarians. Interestingly enough, after he leaves Pleasure island, he goes to find his father, but he can't find him. And a note from the Holy Ghost essentially tells him that his father is at the bottom of the ocean in the belly of a giant whale, and the whale is also a dragon. And so then Pinocchio has to go down to the bottom of the ocean in his half jackass form and rescue his father from the belly of the whale. And he does that by mastering fire. And interestingly enough, in the the Pinocchio video, he's assimilated to the Christian symbol of the fish in the belly of the. In the belly of the whale, Geppetto catches a bunch of fish. He thinks to eat them, and then he catches Pinocchio and confuses him with a fish, doesn't realize that having caught Pinocchio, he's caught his own salvation. Then they work together to get out of the whale's belly. But there's this very old idea that especially in chaotic times when everyone's turned into a jackass and a tool of totalitarians, that the way forward is to journey to the deepest possible recesses of reality and revivify the father. Something everyone needs to know."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":984.32,"end":1050.27,"speaker":"Jonathan Pageau","text":"And there's something. I mean, we'll see as our conversation continues, you'll see how for me, at least this goes is that for me, going back into the Christian tradition and reconnecting with the Christian tradition has actually opened my eyes also to the world around me. So Those patterns that I find in my own tradition, the patterns that are kind of feeding my life, once they're integrated now, when you look around you, you see them, they appear everywhere. The world is actually made of those patterns. And you can recognize. You can recognize those patterns in contemporary, you know, culture, and you watch a movie and you can see that these are the same patterns. But the best way is, like, the danger is to do it in a. Simply, in an intellectual way. I mean, that's kind of our danger. So connecting to a tradition, you know, becoming orthodox and. And living it through liturgy, like liturgy. When you go to church and you participate in the liturgy, you're physically engaging in these sacred patterns. And so it's a way to make it almost a bodily experience."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1050.67,"end":1062.39,"speaker":"Jordan Peterson","text":"Right? Well, it's interesting, you know, the Christian emphasis on the resurrection of the body, which is, of course, something that modern people have a very difficult time with. I mean, people can perhaps swallow the."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1062.39,"end":1073.41,"speaker":"Jordan Peterson","text":"Notion that the soul is immortal, but the idea of the resurrection of the body is something that just seems beyond the pale. But there's a logic to that insistence, and the insistence is that there's something."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1073.41,"end":1094.17,"speaker":"Jordan Peterson","text":"Sacred and necessary about the body and that it can't be forgotten when discussing both spiritual, say, and sacred matters. And it's definitely the loss of the body that's part of what constitutes, part of the rootless nihilism that characterizes the modern age."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1094.45,"end":1096.53,"speaker":"Jordan Peterson","text":"You know, learned that partly by reading."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1097.25,"end":1103.65,"speaker":"Jordan Peterson","text":"Carl Rogers, because one of the things that Rogers talked about was the necessity. Jung talked about this a lot as."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1103.65,"end":1121.34,"speaker":"Jordan Peterson","text":"Well, the necessity of bringing the body into alignment with. For Rogers, it was more with the voice. And he claimed, for example, that you could feel with your body essentially whether or not your words were aligned properly with your being. And certainly, I've certainly learned that that's."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1121.34,"end":1123.34,"speaker":"Jordan Peterson","text":"True and that you can learn to."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1123.34,"end":1131.66,"speaker":"Jordan Peterson","text":"Determine when your voice is making you stronger physically and when it's making you weaker physically. A very, very useful thing to pay attention to."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1131.66,"end":1184.55,"speaker":"Jordan Peterson","text":"One of the iconic figures that you've carved and that you're interested in is St. George. And I've been very interested in the figure of St. George. I think the story that's encapsulated in St. George is certainly one of the oldest stories known to mankind. It might be at the core of the oldest story, because basically what it does is present human being, the individual, in a. In a. In a battle where the individual society and the individual are being threatened by the re. Emergence or emergence of a carnivorous, reptilian, carnivorous predator. And I think the roots of the St. George story go all the way back to the time when the distant ancestors of human beings were living in trees and being and being preyed upon by predatory snakes."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1184.55,"end":1225.36,"speaker":"Jordan Peterson","text":"And that's about 60 million years ago, back when there were still dinosaurs, by the way. An anthropologist named Lyn Isbel at the. @ UCLA has done a series of studies showing that the reason that human beings have such amazing vision, because we can see better than any other animal, except for birds of prey, is because our vision evolved to help us detect predatory snakes in particular as they crept up on us through the underbrush. And she established that by noting that there was a powerful correlation between the prevalence of predatory snake predation in primate populations across the world and the acuity of primate vision."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1226.57,"end":1227.73,"speaker":"Jordan Peterson","text":"And it's also the case that our."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1227.73,"end":1254.85,"speaker":"Jordan Peterson","text":"Vision evolved, just as the story in Genesis suggests, because of fruit, because we see colors, because we can detect, to detect ripe fruit. And so Genesis insists that human beings got their vision because of snakes and fruit. And that seems exactly right from an evolutionary perspective. But you can imagine the idea in St. George. There's a dragon that reemerges from its. It's a lair underground, and it's a."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1255.01,"end":1259.89,"speaker":"Jordan Peterson","text":"It's an eternal dragon, immortal dragon, and."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1260.13,"end":1354.05,"speaker":"Jordan Peterson","text":"It threatens the community. And St. George goes out to. To fight the dragon in single combat. And as a consequence, he. He frees a virgin from. From the snake's grasp, just like Harry Potter does in the second Harry Potter volume when he goes down underneath Hogwarts to free Ginny, who's the virgin Virginia, from the grips of the basilisk. And the basilisk is the thing that turns you to stone with a single glance. And Harry Potter is revivified, by the way, by the phoenix's tears. And the phoenix produces a rebirth, right, because the phoenix is a symbol of death and rebirth. And so there's. The St. George story is embedded right in the depths of the Harry Potter story. But I think it's predicated on the idea that human beings, men in particular, forever have been fighting off the predations of the natural and the social world. And the. The idea that you free the virgin from the grasp of the serpent is that women have preferentially chosen to ally themselves with and mate with men who are capable of facing the reptilian predator. And so it's the basic evolutionary story of mankind, that human beings learn to fight back against predators, maybe to even find them in their lair instead of waiting for them to attack. And that women, in their gratitude for that, in their Gratitude for the protection of infants. Like, there's often images of Mary raising."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1354.13,"end":1359.5,"speaker":"Jordan Peterson","text":"Christ up out of the way from a predatory reptile."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1359.5,"end":1403.63,"speaker":"Jordan Peterson","text":"Right. And that's in reference to the Genesis comment that this, that Mary will bruise the head of the serpent with her heel. It's, it's an extraordinarily, extraordinarily deep story. It goes deeper than just the idea of the serpent too. Because the ultimate serpent, in some sense isn't the one that lives in the external world. The ultimate serpent might be the one that's in the heart of your enemies, or if you make a metaphysical transformation in your thinking, even beyond that. The ultimate serpent isn't even the one that lives in the heart of your enemies. So it's not the natural snake or the crocodile or a predator like that. It's not the vicious barbarian that's come to the gates of your castle to steal your belongings and make off with your women. It's the snake that lives in your heart."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1403.87,"end":1404.43,"speaker":"Jordan Peterson","text":"Yeah."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1404.43,"end":1411.47,"speaker":"Jordan Peterson","text":"And that's why Christianity insists on the association between the snake in the garden of Eden and Satan."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1413.22,"end":1428.02,"speaker":"Jonathan Pageau","text":"Yeah. I mean, I think that if you think of the world in terms of macrocosm and microcosm, the idea that certain structures repeat themselves at different levels of reality."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1428.18,"end":1428.54,"speaker":"Jordan Peterson","text":"Yeah."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1428.54,"end":1429.3,"speaker":"Jordan Peterson","text":"That's like music."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1429.7,"end":1525.81,"speaker":"Jonathan Pageau","text":"Right? Then you can think of this idea of a world as having in the middle a tree or across or something like an axis in the center. And as you move away from that access from the axis which defines the space, basically like a flag or something, like a post. As you move away from that center, you're moving further and further from what it defines. And you're approaching chaos, basically, you're approaching chaos, which is. In the negative sense, it's chaos. Right. In the positive sense, it's also potential. It's the potential from which that world will grow. So on one side it threatens the inside, if you will, and on the other side, it is the potential by which that thing will grow. And so the dragon in St. George's story, there are actually several versions of the dragon. In some versions, in the most known versions, St. George will kill the dragon, but there are lesser known versions of the story where he actually tames the dragon and turns the dragon into his pet. And there's versions where he tames it, then kills it. There's different versions of the story, but it's to show this idea of as you move out, sometimes there's something on the edge that appears on the edge and you can't define it. It's this chaotic Thing. The dragon, in traditional way of representing it, isn't just a reptile. It's actually a hybrid creature. It usually has a mix of lizard and it has hairy feet and wings. And so it is. It's this."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1525.81,"end":1530.81,"speaker":"Jordan Peterson","text":"Yeah, it's a monster. It's a monster. It's an amalgamation of things to be."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1530.97,"end":1533.17,"speaker":"Jordan Peterson","text":"Frightened by, but also treasure."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1533.17,"end":1543.05,"speaker":"Jordan Peterson","text":"Because the dragon doesn't only guard virgins, it guards treasure. It's in contact with what you fear and despise, that the treasure is to be found."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1543.53,"end":1543.81,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1543.81,"end":1547.09,"speaker":"Jordan Peterson","text":"You know, your, Your notion about the center point, say, with the flag or."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1547.09,"end":1548.45,"speaker":"Jordan Peterson","text":"The cross, reminded me."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1548.45,"end":1563.77,"speaker":"Jordan Peterson","text":"Reminded me of the way that children react with their mother and their home. And so what a child will do when, when he or she is exploring the world is make contact with the mother and that. And, and that's in the center of the household. So you could think about it as the mother embedded in society."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1564.49,"end":1565.53,"speaker":"Jordan Peterson","text":"The child will."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1565.61,"end":1576.7,"speaker":"Jordan Peterson","text":"Will comfort himself with contact with the mother and then go out into the world to the point where his fear overcomes his exploratory tendency. And then on the."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1577.18,"end":1593.14,"speaker":"Jordan Peterson","text":"On that edge he'll play and further his psychological development and his mastery of the world. And then when he wears out and maybe goes beyond his limit, he runs back to the center point for comfort. And then the next time he goes out, he can go out a little bit farther. Yeah."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1593.14,"end":1621.88,"speaker":"Jonathan Pageau","text":"And so that, that structure, basically, that is basically the structure of everything. I mean, it's the structure of a society, it's the structure of a family. And like you said, it's also the structure, structure of an individual where on the edges of our person we have these desires that exist on the edge of our person. And those desires are very dangerous because they can lead us into a lot of a mess, but they're also the tool by which we further ourselves."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1622.2,"end":1639.11,"speaker":"Jordan Peterson","text":"Right. Well, that's very similar again to Jung's idea of the incorporation of the shadow and also Nietzsche's idea of beyond good and evil. I mean, Nietzsche bent meant by that, at least in part, beyond the conceptions of good and evil that are basically thrown up by nothing but cowardice."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1639.51,"end":1639.87,"speaker":"Jordan Peterson","text":"Right."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1639.87,"end":1651.11,"speaker":"Jordan Peterson","text":"So you try to make yourself into this little restricted thing that's basically the Jungian Persona. And you define yourself as good if you never go outside that little box. But to be truly good, you have to go way outside that box."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1651.75,"end":1724.81,"speaker":"Jonathan Pageau","text":"So if you think. Take this as a. As a worldview, I mean, basically that. That has become my own worldview. It helps you to identify what's happening around you. So on the periphery of the world, there are these marginal things that exist kind of in the buffer between order and absolute chaos. And those things, they rear their heads up. And so we have to have a. We transact with them in different ways. Sometimes tame them, sometimes you have to, you know. You know, like a dragon, you have to kill it. Sometimes you have to just ignore it, too. Like, monsters just have to be left alone, basically. Like, they're too big to deal with yet you just leave them alone. And to me, this is really related to what you're going through right now. It seems like this is where we are right now in our society. Our obsession with liminal things right now in the world seems to be a sign of something. You know, the word monster actually comes from the Latin word which means to show. Right. As a portent. In French, we actually still have the verb monterey, which means to show. It's from."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1724.81,"end":1726.37,"speaker":"Jordan Peterson","text":"So it's demonstrate in English."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1726.45,"end":1742.76,"speaker":"Jonathan Pageau","text":"Yeah, there you go. Demonstrate, exactly. So the word a monster is a portent of something. It's like a harbinger of change or a harbinger. That's something you need to pay attention to because something is happening. And so right now, like."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1742.84,"end":1746.84,"speaker":"Jordan Peterson","text":"So to demonstrate. To demonstrate is to demonstrate."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1747,"end":1747.96,"speaker":"Jonathan Pageau","text":"Yes, Right."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1747.96,"end":1748.36,"speaker":"Jordan Peterson","text":"It's to."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1748.36,"end":1752.52,"speaker":"Jordan Peterson","text":"It's to take the monster apart and make it into something that's you can deal with."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1752.76,"end":1753.12,"speaker":"Jordan Peterson","text":"Yes."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1753.12,"end":1754.12,"speaker":"Jordan Peterson","text":"That you can master."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1754.12,"end":1754.52,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1754.52,"end":1760.84,"speaker":"Jordan Peterson","text":"That's like Marduk in the old Mesopotamian myth. Because Marduk, who's the Mesopotamian hero God."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1761.64,"end":1764.44,"speaker":"Jordan Peterson","text":"Confronts Tiamat, who's a monster, and cuts."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1764.44,"end":1774.45,"speaker":"Jordan Peterson","text":"Her into pieces and makes the world. And actually, one of the names of Marduk that the Mesopotamians had was he who makes interesting and useful things from the combat with Tiamat."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1775.89,"end":1777.01,"speaker":"Jordan Peterson","text":"Yeah, yeah."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1777.01,"end":1815.48,"speaker":"Jonathan Pageau","text":"I mean, so right now, if you look around, if you think of the social manifestations that are going on, like, just take zombies, for example. Like, that's the greatest example, because a zombie is an in between figure. It's something that is neither dead nor alive. It stands in between two categories. And so in the case of the zombie, the zombie, because it is in between the categories, it acts as a parasite. It starts to eat the interior, the brain, actually. Exactly. Yes. It's looking for meaning. And so it wants to eat the thing that's inside. It's trying to devour it."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1815.48,"end":1815.88,"speaker":"Jordan Peterson","text":"Right."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1816.28,"end":1817.96,"speaker":"Jordan Peterson","text":"That's the corpse of the culture."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1818.12,"end":1872.89,"speaker":"Jonathan Pageau","text":"Like the story of Oedipus. And the Sphinx is the perfect kind of image of this. So the Sphinx appears as this undefined monster. Right. It's a mix of a Woman and a lion and a bird or whatever. It's this thing that appears. And so. And what it is, it's a question. It's saying, like, what am I? The monster is a question. Or it's an enigma. The person coming for it is faced with this enigma and the danger. So one possibility is that you name the monster and you're able to integrate it. The other possibility is that you're eaten by the monster. Those two things are a real reality on the edge of things. So when you come to the edge of something, you have this image in traditional stories of the bridge. You come to the end of something and there's a bridge, and on the bridge there's a monster. And so you have to face this monster. Because when you're on the bridge, you're in a dangerous place. You're in between."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1873.38,"end":1877.38,"speaker":"Jordan Peterson","text":"You're in between categories, right? You're in no man's land, you're in no man's land."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1877.38,"end":1897.66,"speaker":"Jonathan Pageau","text":"And so the monster comes and wants to devour you. So it can be either this idea of the monster asking a question, asking an enigma for you to be able to cross the bridge. And so this is what's happening right now. Right. And so there are some elements that come from the margins of society which."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1897.66,"end":1903.87,"speaker":"Jordan Peterson","text":"Are the ones that I've been dealing with or has been the people who don't fit into the gender categories."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1904.03,"end":1921.31,"speaker":"Jonathan Pageau","text":"Yes, yes. And so we're in a situation where those. That manifestation of hybridity. Right. Because if you look at the categories that are used, they are trying to be the category of multiplicity itself. Yeah, they're trying to be the category."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1921.95,"end":1929,"speaker":"Jordan Peterson","text":"That's why the categories are multiplying beyond name. They started with just non binary and now it's up to 70 online."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":1929.4,"end":2004.3,"speaker":"Jonathan Pageau","text":"Yeah. What it is, it's a decomposition. Like it's a decomposition of a category. You come to the end of something and it starts to decompose. I know in your talk you talk about the Ouroboros, the serpent eating its own tail. Well, this is my vision of it, is that when you first see that serpent, it actually looks like it's the tail that's eating the head. And then after a certain transition, then it becomes the head eating the tail. So imagine a fruit falls on the ground, the ground starts to eat it, it starts to decompose. And once it's fully decomposed, then something happens, there's a flip, and now the seed starts to use the earth and eat the earth to become a tree. And so there's that moment at the end of something where there's a flip that happens, like an inversion, and then an inversion of an inversion that happens. It's a very chaotic time. And that's the moment where we are in right now. And what you're going through, like the finger that you put your finger on, something very, very critical, and that's why there's so much noise about it, is because you're standing right in that spot and you're telling everybody, pay attention to this monster. Like it's right there in front of us."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":2005.1,"end":2018.59,"speaker":"Jordan Peterson","text":"You talked before with me about two biblical stories that, that shed some light on this. And you were talking about Abraham and the stranger. And so maybe you could walk through that, because I thought that was an extremely interesting analysis."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":2018.75,"end":2135.91,"speaker":"Jonathan Pageau","text":"Okay, So, I mean, the way that in the Bible and in most traditional societies, the way that you would deal with the strange, okay, the thing that comes from the margins, you know, it's the stranger in a global way, it's the strange thing. The way we deal with that is through hospitality, right? The first way we deal with it, right? The first way we deal with something coming from the outside and that doesn't fit into our world is through hospitality. So hospitality means that you receive this thing as a stranger, and there's these implicit rules of how you interact with them so that there isn't a mutual destruction, basically. And so in the Bible, we see those version of good hospitality and bad hospitality play themselves out. So in the story of Abraham, Abraham receives three strangers, and he receives them into his tent, and he feeds them and he gives them. You know, he receives them properly. And the strangers are also acting properly in his tent. You know, they're eating his food, but they're being respectful of the house. They're not stealing things. They're not, you know, trying to seduce his wife or doing the things that you're not supposed to do implicitly when you're in someone else's house. And because of that, the three strangers announced to Abraham that he's going to have a child. So Abraham is in his 90s. You know, he never thought, right, they're angels, right? They're angels, but they're secretly angels. That's what's important is that in the strange, the strange, because the strange is an ambiguous category. It can contain both extremes. It can contain both the angel and the devil, right? These three angels come to him and they announce that he's going to have a child. And so what they do is that the strange now acts as this potential that we talked about."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":2135.99,"end":2138.47,"speaker":"Jordan Peterson","text":"Right. So it's a fructifying agent in that story."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":2139.11,"end":2141.51,"speaker":"Jordan Peterson","text":"And so it's the case that, like."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":2141.59,"end":2146.57,"speaker":"Jordan Peterson","text":"An orderly structure has to allow an element of chaos, an element of the."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":2146.57,"end":2151.05,"speaker":"Jordan Peterson","text":"Strange into it in order to become something new and even to maintain its."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":2151.05,"end":2155.09,"speaker":"Jordan Peterson","text":"Own survival because things have to become something new as they move forward through time."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":2155.57,"end":2169.25,"speaker":"Jonathan Pageau","text":"Right. And so in this. In that case, the stranger becomes the means by which Abraham's marriage is fucked up. So he grows, his family grows through this. Right. Interaction with the stranger."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":2169.41,"end":2169.81,"speaker":"Jordan Peterson","text":"Right?"}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":2170.3,"end":2225.48,"speaker":"Jonathan Pageau","text":"So now these same three strangers, then they go to visit Abraham's brother Lot, who's in Sodom and Gomorrah. And then, although Lot receives the strangers appropriately, the inhabitants of Sodom and Gomorrah, they want to rape these strangers. They want to sexually assault the strangers and rape them. And the angels blind the people around them, and they're able to escape. And because of the wrong interaction and the wrong sexual interaction between the stranger and the people of the city, the city is destroyed by fire. And then it leads even further. It leads to Lot having an incestuous relationship with his daughters. And so it's like the whole world just kind of. It collapses because there isn't a proper approach to hospitality. And. But it. You know, and in that story, you see how it's actually."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":2225.56,"end":2234.68,"speaker":"Jordan Peterson","text":"So there's an intimation in there too, is that if the. If the. If the interaction with the stranger is handled properly, then everything becomes more fruitful."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":2234.92,"end":2236.88,"speaker":"Jordan Peterson","text":"And if the interaction with the stranger."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":2236.88,"end":2245.48,"speaker":"Jordan Peterson","text":"Upsets things, say, as basic as sexual interactions between people, then the entire society can become destroyed."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":2245.64,"end":2276.21,"speaker":"Jonathan Pageau","text":"Exactly. And I'm using those two stories, but those two stories repeat themselves in all. I mean, there's so many stories where you see that often it's not just sex, it's often food. There's sex and food. Those are the two things that. The two major ways in which we integrate the world. So, for example, like the story of Hansel and Gretel, for example, is a perfect example of where the desire to eat the people that. To eat your guests. Right, right."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":2276.21,"end":2279.35,"speaker":"Jordan Peterson","text":"Or, for example, mother, too, in the."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":2279.35,"end":2281.55,"speaker":"Jordan Peterson","text":"Hansel and Gretel story, because she's too."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":2281.55,"end":2284.39,"speaker":"Jordan Peterson","text":"Good to be true, and then she's all compassion."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":2284.39,"end":2288.55,"speaker":"Jordan Peterson","text":"The witch in the Hansel Gretel story, and you can tell that because she has a ginger. She's."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":2288.55,"end":2291.63,"speaker":"Jordan Peterson","text":"She has a gingerbread house. It's made of candy."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":2291.63,"end":2292.03,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":2292.03,"end":2293.79,"speaker":"Jordan Peterson","text":"And like a house made of candy."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":2293.79,"end":2294.95,"speaker":"Jordan Peterson","text":"Is too good to be true."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":2295.11,"end":2303.91,"speaker":"Jordan Peterson","text":"That's the social justice warrior overemphasis on compassion and Inside, she's just fattening the kids up, constantly taking care of them."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":2303.99,"end":2306.47,"speaker":"Jordan Peterson","text":"But her fundamental wish is to devour them."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":2306.8,"end":2307.12,"speaker":"Jordan Peterson","text":"Yeah."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":2307.12,"end":2308.88,"speaker":"Jonathan Pageau","text":"So like an example, and they just."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":2309.12,"end":2309.68,"speaker":"Jordan Peterson","text":"One more thing."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":2309.68,"end":2313.2,"speaker":"Jordan Peterson","text":"They've been abandoned. Those kids have been abandoned to the."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":2313.68,"end":2317.84,"speaker":"Jordan Peterson","text":"Predations of the evil mother because the family broke down."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":2318.08,"end":2318.76,"speaker":"Jordan Peterson","text":"Like they're."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":2318.76,"end":2319.12,"speaker":"Jordan Peterson","text":"It's."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":2319.12,"end":2321.6,"speaker":"Jordan Peterson","text":"It's the stepmother who tells the father."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":2321.6,"end":2324.72,"speaker":"Jordan Peterson","text":"If I remember correctly, to abandon the children in the forest."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":2325.28,"end":2325.88,"speaker":"Jonathan Pageau","text":"Yeah, yeah."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":2325.88,"end":2327.2,"speaker":"Jordan Peterson","text":"And so it's the breakdown of the."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":2327.2,"end":2337.99,"speaker":"Jordan Peterson","text":"Family that leads to the children being threatened by the Oedipal mother who's too good to be true. She's compassion that's gone completely beyond its tolerable limit."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":2338.15,"end":2340.55,"speaker":"Jordan Peterson","text":"Yeah, it's a cautionary tale, that's for sure."}
{"episode_id":"SW - #004 - 2018-06-01 - Tradition and Things That Don't Fit - With Jordan Peterson","start":2340.95,"end":2402.16,"speaker":"Jonathan Pageau","text":"You see that there's the story. There's so many stories of how the relationship between a host and a stranger goes wrong. And sometimes the push comes from the host and sometimes the push can come from the guest. Like there's an Ethiopian tradition where it's almost an inversion of Abraham's story where a man receives three guests into his home and the three guests serve him food, which ends up being a human being. So they kind of trick the host into becoming a cannibal and then the host becomes like an out of control cannibal and eating people all over the place. So you can see how the story can go both ways. The relationship with the strange, there can be a push from the inside, from the, the right hand, let's say the order hand, there can be a push towards that causes the chaos. But it can also come from the guest, can also come from the stranger which can push from his side or from their side and then create the chaos."}
