{"episode_id":"SW - #161 - 2021-06-06 - April Q&A","start":12.56,"end":7912.41,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. All right. Hello, everybody. And so. All right, so I see. I got Brad is there. Sweet. Let's see who else shows up. What do you got? 43 people. All right, we got people in the. In the chat. So welcome to the April Q A. It is Holy Week, and so here we are. This Holy Week is very strange with COVID and everything. My own parish is struggling just to celebrate. We're struggling. So I'm actually going to be going to two different parishes during Holy Week to be able to do the different services. But, you know, that's how it is. This Lent has. Anybody who follows me on Twitter will know that this Lent has been not the best Lent. You know, you can tell how I'm doing just by social media. If I'm being. If I'm like posting cocky stuff and being a jerk on social media, it usually means that I'm not doing very well. So, you know. All right, so a few things before we start last month. First thing is last month I raffled off some. A few things and I didn't send them yet. And so I said that if I haven't send them yet, I'm not going to raffle off two more T shirts. Two more shirts until I send them. And so I should be able to send them soon. I just haven't. But the emails are out and so the people. So I will send them soon. So sorry to those people who won last month and have been waiting to be contacted by me. Yeah, like I said, this whole month, but that's okay. All right, and so what's the other thing? Yes, the other thing is that last month I totally forgot subscribestar in terms of the questions. And so I will be starting with subscribestar this. This month to compensate for that. And so. Yeah, all right, so we will get through this. Is there anything else I need to. To announce? I don't know. All right, so I will start with subscribestar. Okay, so from last month. X. Oh, so the way it works. Sorry, for people who are the first time in the Q and A, the way it works is that if for supporting me on patreon for like $10 or more, you get to ask questions in advance. And so all these are the questions I'm going to go through. And then at the end I will go through the super chats and answer those questions. And so I usually do have time to get through everything. It's hard for me to pay attention to the chat because usually even just answering the the, the, the questions from, from the different platforms, it ends up being like two hours long. So. So, yeah, so if you want. So, so, yeah, so, I mean, I am trying to do some surprise streams once in a while now, if you notice. Some carving streams I'll do, I will do more. And so then in those, in those kind of surprise streams, it's easier to ask questions and I can pay attention to the chat more because it's more kind of improvised. So pay attention to those if you want, but I can't tell you when they're going to be because I don't know when they're going to be. All right, so here we go with subscribestar from last month. So XRD asks, would you say there's a connection between vegans and Cain in their seeming unwillingness to make the right sacrifices? I don't want to pick on vegans, but after seeing recent stories of parents who force veganism on their children, now these kids end up severely, severely malnourished, some even dying by the time authorities get to them. I've begun wondering where veganism fits in all of this. So it's one of those interesting things that, so at least like vegetarianism that say monks are vegetarian. So monks, orthodox monks don't eat meat in theory. You know, I'm sure in practice it happens once in a while, but in theory they don't eat meat. And also there's a notion in scripture that people didn't eat meat before the fall, not just before the fall, but actually they weren't supposed to eat meat before the flood. And that's why after the flood it says that God gave permission that people eat meat with, without the blood. And so you had to bleed the animal in order to eat it. And so there's a sense in which eating animals is a kind of condescension of the Fall on one hand, but on the other hand, there's also something about it which, how can I say this? It's kind of like you have to not see it necessarily as good or bad, but you do have to see it as a kind of condescension of the fall. And so I think that eating meat is fine. I don't think that there's anything wrong with it, but I think there's all. And just like, I also think that it's okay for soldiers to go to war and to, and to fight off enemies in terms of when, you know, when a country is being attacked by foreign invaders. But I think that all of these things are kind of condescensions to the fall, let's say. And so. But it's not the same as veganism because I don't think in Scripture there's any sense that people were vegan, rather just vegetarian. And so, because even in the story of Cain and Abel, it would be very odd to think they weren't supposed to eat meat. And so in theory, Abel didn't eat meat, according to the story, but he still had animals. And so what were their animals for if he's not going to eat their meat? And so milk, cheese, like, I don't know, wool. So. So they did use animals, just. Just not in the story. They did use animals, just not eat the meat. So, yeah. All right. So that was the only question on subscribestar in March. So let's go to see if there are any questions. So there are no questions in April. That. Okay, so you know what? There is one. I'm going to be very. I'll be. I'll be nice. So big lasagna on subscribestar Ask. I've noticed that the more I learned about symbolism, the more my humor got better. I've read some articles that people 100 years ago laughed about 50 minutes a day. Nowadays, it's about five minutes. Does this make sense to you? I don't know. I mean, I think that. I do think that there was definitely, in traditional societies, there was definitely just more joy. In general, we have this weird image, like in movies and stuff about these dark traditional societies. But in reality, because they were together, because they would. They would just spend all their time together, they would probably. You're right. They probably would laugh more because they were just together. You know, it's. If you're alone, you don't laugh unless you're. You're watching some funny movie. But even then, like, you wouldn't laugh out loud as much as you would when you're with people and you're kind of with friends and stuff. So it's possible. But it's good to have a sense of humor if you understand symbolism, because if not, it can actually take you to a very dark place. So, you know, you guys know that I laugh all the time for bad reasons, but it's probably good for me. All right, man, I'm in a weird mood. This might not go well. I hope it'll be okay. All right, so let's move on to the Symbolic World website. Just to remind you guys, as you know, the Symbolic World site is being redone right now. And so I'm working, actually, even Redoing the logos and just the whole aspect of it and how it's going to integrate the different things that I'm working on. But not just me, also all the other people involved in the symbolic world. So that's coming soon. We will also have a platform for discussion there because right now the Facebook group is still hanging on, but we all feel like it's just a question of time before even the Facebook group gets shut down, because some of the posts are getting shut down. And so just a question of time. Yeah. All right. All right. So cs, CS Streetsell or C Streets Ask, can you explore the symbolism in the story of Samson? You mentioned him moving the doorway to a hill, and there is the lion and hundi event as well. Is he a Nephilim? No, he's not a Nephilim. He's a. He's definitely. His symbolism is related to symbolism of Nephilim in the sense that because he is a. He's an Israelite who is attracted to foreign women, who's. Who wants. Who has relationships with foreign women, then there is a. There is a relationship with the idea of Nephilim or this idea of like, the people higher up on the mountain, going down the mountain to get potential from that which is impure or that which is not in your level of identity. And so that's what happens in the Genesis story. But from angels to men. But you can understand it at different levels, right? So the different warnings that, for example, are given by Solomon about going to the strange woman, and he says, the strange woman's foot. The strange women. The feet of the strange women goes down into Sheol, so her feet go down into hell. And so this is this idea of, like, this idea of that which you don't know being kind of on another plane is you. And you have to be careful because you can waste your seed, right? Your seed could be lost in the darkness, let's say. So that is one of the aspects of the symbolism of Samson. But there's also a mystery, which is that it's like, how do you flip that? How do you make it total? Because ultimately we believe that God is the God of all things. And so how does that turn like there's a reality to the. To the. To the symbol, to the structure. But then there's also a way in which even that aspect or the strange has to be saved. And that's what Christ. That's what happens with Christ. Because Christ, the story of Christ with the Samaritan is all about that. The story of Christ with the Samaritan is all about Christ going towards the strange woman and marrying the strange woman, you know, and that's why, like I said many times, that's why Christ marries Rome. That's why Christ saves Rome, because he is, in a way, he is. He's. Let's say he's marrying the daughters of Cain, like he's marrying Cain. He's doing. He's. Rome is Cain. Rome are the descendants of Cain in terms of what they mean. And so there's an aspect of the symbolism of Christ which resembles the symbolism of the Nephilim. Just like this idea that one of the interpretations of the. The symbolism of the Nephilim is that the, the. The daughters of, of the sons of Seth married the daughters of Cain. Well, that's what Christ is doing. Christ is marrying the. Marrying Cain. But he. But he does it in a way that isn't. That doesn't fall. He's able to do it without falling. He's able to kind of gather all of this strangeness into himself and transform it, you know, so it's not the same. It's. It's almost like one of the aspects of what Christ is doing is, is. Is healing the rift of the. Of the first chapters of Genesis, like healing those different. Those different rifts and those different problems. So. All right. I need to not spend too much time on each question, or else I'm never going to get through. All right. All right. So Josh the mover asks. Hello, Jonathan. A quick question of validity. After careful consideration. Prayer. I've elected to take Saint John of Damascus as my patron saint when I'm baptized. Well, congratulations, Josh. That's awesome. At some point, I would like to commission a diptych with Saint Damascene on the left and the three hands icon of the Theotokos on the right. Would this be considered a violation of any iconographical rules? Would it be more correct to have them commissioned at separate icons? I've not seen the diptych with those icons together before. I don't want to be in any way innovative. So it's fine to have icons with different saints and have them, like, in a line or have them related to each other. You see that in kind of what's called family icons that people would commission. So that's fine. The problem is mostly you have to be careful when you make an icon of the Mother of God you don't want because in a way, she is kind of the summit of sanctity in the human level. And so I'm not sure I've ever seen an image where she is just kind of facing another saint besides Saint John the foreigner or Saint John the theologian. So I'm not sure. I'd have to think about it. I'd have to think about it. And also, I mean you could just have them made as two different icons. I mean it wouldn't be that difficult to just have the two panels and then you can, you can put them up the way you want. Maybe that could just be an easy solution to avoid any confusion. Right. So in the wounds asks hi Jonathan, any advice on navigating the symbolic worldview with kids, especially a very literal minded five year old. He loves folk tales, myths, Bible stories and we talk about the deep patterns in them, but he often returns to but did this really happen? Is the hero plays character real? I would say like, especially for a five year old, like you should just tell them the stories and not interpret them. Like there's no point in interpreting the stories. For a five year old you just tell them the stories and then you don't need to go any further than that. The interpretation will come later. So if you just tell the stories and you kind of rejoice in the stories, at some point maybe you can avoid the question of, you know, did this really happen? I would say for sure. In terms of fairy tales you can say that, you can. It's easy then to say no, that it didn't really happen in, in this way that you, you think in terms of scripture, I would just answer yes to all, all the stories. And in terms of saint stories, I would just also answer yes to all the stories. So that's how I would, that's how I would do it. So you could always answer it happen once upon a time. You could say, you could just answer that. All right, so Adam says, hey Jonathan, you seem to have a grasp on how 2020 would go and have predictions for 2021. So when will Jacob and Esau meet? Yeah, I can't answer that one. When Jacob and Esau meet. As for 2021, I mean it's pretty much, it's pretty much on route for just being a continual, a continuation of the clampdown mode. And so that seems to be what's on the menu. Just a continuation of last year, I think, and also just making it acceptable, like just, just making everybody just accept that this is the new normal as they say, or this is the inevitable. Yeah. All right, so New Mash asked his Solomon a prefiguring of Christ, Joseph and King David have a lot of relevance to the story of Christ. But Solomon also seems to be relevant, too. I've noticed. He appears to be an eschatological figure where all the rebellions are put down, there's peace in the land, the temple is built, and he rules as the wise king, and all the nations of the world come to honor him. Yes, of course. Exactly. And I think I don't even have to answer. The Song of Songs is usually attributed to him as well. Sounds like the eschaton to me. And so I think you're right. I almost don't have to answer. I almost don't have to answer your question. So he's a prefiguring of Christ in that you could say that he is. Yeah, definitely. In terms of the idea of peace and the idea of the temple and also the idea of the queen of Sheba, you know, of his relationship with the ends of the earth. You would say, you know, like the queen of Shiva coming. Coming to kind of ask questions of him is something like the wise men coming to worship Christ. And so there's this idea that, that he connected to the ends of the earth. All the, all the characters in scripture are prefigurations of Christ. That one's actually an easier one. Some of them are harder. Some of them are like Samson is a harder one in terms of understanding how. But they all are. All right. So Luca Ascovic asks in chapter 35, symbols of space and time, foundations, stone and scandal. Stone. In my brother's book, the language of creation, your brother quotes the Bible with wisdom. The Lord founded the earth with understanding, he established the heavens. Later in the chapter, he quotes with wisdom, a house is built. With understanding, it is established. With knowledge, its rooms are filled. I'm struggling to understand what these sentences mean. What do wisdom, understanding, and knowledge mean in this context? I. I'm not going to answer that, man, because it's like pretty much that you could say that it. That kind of stuff is exactly what the, the. The. That's exactly what the book is about. But a little thing you could understand, for example, in terms of. In terms of understanding the idea of wisdom founding the earth and understanding establishing the heavens. You need to understand. This is one of the things Matthew talked about all the time, is this cross thing happened where with wisdom from above, he founds the earth below. And then with understanding from below, he establishes, he creates a foundation. He establishes a solid ground for the heavens. And so just for example, then understanding that can help you understand this, this relationship between the invisible and the visible. How one of Them provides form, you know, for, for that which is below. And that which is below provides support. Support and let's say making explicit of that which is above. And so maybe that's the, the best way to understand that. So you can understand like wisdom and under, wisdom and understanding and then knowledge as the union of the two. That's probably the best way to understand it. So wisdom is like under is like the seed. Understanding is, is like the, the, the, the. The explicit aspect of it, you know. And so the difference between the wisdom of a car, like knowing what it's for, and the understanding of a car, how it works, like in terms of the, the mechanisms of the car. And then with knowledge, that's how you use, that's you. That's how you fill the car with knowledge. You use the car. So when you're using the car, you need to have this basic notion of how the car works in terms of what it's, what it can do and what it can do, the purpose of the car or the pattern of the car in terms of its spiritual purpose and reason. And then you can, then you can use the car. So I hope that makes sense. I hope that helpful this stuff is. It's hard to talk about. I also don't want to put words in my brother's mouth, but that's how I would understand it. All right. Okay. So David Flores asked with the human animal hybrid news coming out, I can't help but see the human animal gods of Egypt and other cultures. You have already mentioned that AI has patterns of an idol. If AI is an auto made of gold and silver, what does the human animal hybrid idol of flesh and bone mean? Is it the same as centaurs or something entirely different? It's very close. The idea of the animal human hybrid is very close to the centaurs and the satyrs in ancient mythological thinking, a really good way to understand what human animal hybrids are. So they're like in a basing of humanity. Right. And you can see that even in terms of the ethical problems that people are seeing with, with this hybridization of this making of chimeras, they understand that there's a danger of creating a lower caste of humans. And so of a human that is more basic, that is more flesh, you would say, in terms of spiritual understanding. And so that's what these hybrids are. And even in mythological thinking. So the centaur, for example, like in, in Greek myth and in Roman stories, the centaur is constantly trying to like, rape women. He's constantly trying to like, steal like the, all the stories of the centaurs, like stealing Hercules's wife. There's this mat. There's this big story about how centaur says he's going to cross. Think so. If you know the story of St Christopher, you can see it's related, actually. So, so Hercules is on one side of a river and he has. The centaur comes and says, I will carry your wife across the river for you. And so this beast, like a boat, like a, like a support, is capable of carrying like an ark, you could say, is able to carry the Hercules's wife across the river. But now different from, let's say St. Christopher, different from the ark with the animals in it. When the centaur comes to the other side, he's like gonna run away with her and he's going to take her with him and so she's going to be lost, you could say. And so the story usually has it that Hercules shoots an arrow. So you can see like the kind of the masculine or the order reaffirming itself. He shoots an arrow across and then he kills the centaur in order to be able to get his wife back. So you can see how these stories, like these patterns, they, they play out in different ways. It's the same pattern, but it just plays out in different ways. So that's mostly the way to understand the problem of the animal human hybrid is that it's kind of a lowering of humanity in terms of the human animal gods of Egypt. It's more about totemizing. So it's more about seeing the things in the world and how their patterns manifest certain realities and then kind of elevating that in its pattern, pattern, form. And so, you know, so it's kind of like, I mean, you could say something like, you know, the God of rain. So rain is a natural phenomena, but that, but it has a pattern, it has patterns. It comes and goes in certain patterns. And so you can totemize that and then have a God of rain. And. But you can do the same with animals. And so certain characteristics of animals will manifest certain realities. And then, and then that's how you get these animal human hybrids. So it's probably the best way to understand that. And a good like it. And that's a negative version, but there's a positive version which is the tetramorph. Right? In the tetramorph you have also these animals that are brought up into their pattern and they kind of manifest different aspects of divinity in, in the, in the tetramorph. So you don't worship the tetramorph, you don't, you don't sacrifice to the, to the, to the cherubs. But the, the, the type of symbolism that they're engaging with is similar to the symbolism that will give you these, these kind of gods with animal heads. Okay, but like I said, it's not the same. You don't worship them, but it's similar in terms of the, in terms of what, it's, what it's doing with the, with the, with the images of the animals. All right, and so Erosa77 says this is a question about contextualizing the Christian message in missions to non Christian people. Coming from a low church Protestant tradition, I'm increasingly appreciative of big T tradition. Seems to me that tradition is the product of contextualizing gospel originality, a message revealed within the interaction of Semitic and Hellenistic worlds in Palestine to other ancient cultures contemporary, especially prize admissions values. Contextualization efforts that include attempts to shed as much cultural baggage of the missionary before engaging in the target mission culture. And this will almost be by necessity lead to a shedding of tradition. What are the losses when Christians missionaries plant new churches without a reference to ancient tradition, be it in liturgy, history, devotional practice for the lady, etc. And so, I mean, there's a difficulty of course in losing. It's a game. Like, it definitely is a difficult game to play and it's also one that honestly usually will just play out in a long term. And that's one of the things we struggle because we don't have the patience anymore to deal with kind of a long term story. So for sure, in terms of the idea of stripping down the traditions, you have to be careful because Christ embodies himself in things like he embodies himself in, in particulars. And so if you try to just remove them, you can end up with something which is not really Christianity. But it's. But like I said, it's a tricky game. Like let's say you can look at the way it happened in like Russia and Bulgaria and how the Orthodox evangelize different peoples. Is that at first probably the Orthodoxy in Russia, they translated into their language. And it does seem like, for example, they let happen certain things, like certain analogies people saw between their ancient gods and the new characters, like the saints and with Christ. And so they weren't afraid of saying, of helping people see through their own tradition what it is that Christianity was talking about. You know, so that seems to have happened also like in terms of Evangelizing the northern people. There's a danger there too, which is you can also kind of misstep and then end up with weird kind of syncretism. But yeah, I'm happy that I don't have to make a lot of those decisions because it must be very difficult to kind of find that balance. All right, so alphonse asks. Dear Mr. Peugeot, my question maybe would be, are we in the start or middle of a new wave of Gnosticism? Gnosticism is like Christianity on mushrooms. Dog Metzger. Yeah. So what's going on in this coming age of Aquarius? I don't, I don't. Yeah. Joe DMT Rogan on meditating, Sam Harris, who also documented his mushroom trip, his wokism, another form of trying to get redemption and salvation through certain kinds of rules and behaviors and rituals we liked. Would you like to elaborate your thoughts on Gnosticism, the critic of the Church Fathers, and how to avoid a mix up of symbolism with certain Gnostic ideas like ig, the truth of the existence of angels, demons, heavens and so on. So the biggest problem with Gnosticism is there's really one big problem and most of the, Most of the lower problems emanate from. Emanate. I use that word. It's hilarious, talking about narcissism, like the lower problems will be connected to the higher problem. And the higher problem of Gnosticism is mostly the idea that. That the lowest God created the world and that the world itself is, Is a kind of. Is fallen in its, in its very origin. And that the, the, the. The supreme, let's say the infinite or the, you know, the, the. The highest infinite principle does not have any contact at all with anything below him. It's like this completely self. Self, you know, self looking self. Monad. It's a monad. Right? And so Christianity doesn't present a monad as the infinite, but a trinity. And so already in the infinite there's this sense in which multiplicity and a certain dynamism is part of infinity itself. And that avoids a lot of problems. And so, so, so then. So Gnosticism always ends up being some kind of idea that, that the world itself is fallen. And so you need to be able. Through different. Through different acts of meaning, through, through rituals, but rituals as like keys, as these, like secret keys that you can, that you can unlock doors and then ascend this hierarchy of heaven in order to free yourself from this corrupt world and corrupt body. And that is not at all what Christianity is. Christianity is about embodiment and about Incarnation. And although it does, is suspect to people who are a slave to their passions or a slave to their bodies, it's clear from the very beginning that Christianity is not against the body. And its rituals are not there to make you escape from reality, but is there to integrate reality and to participate in the fullest sense in reality. So if you look at the Orthodox Communion in the Orthodox liturgy, you'll see there are references to angels all through the liturgy. And for example, it talks about Christ being carried by the angels, by the orders of angels, down into the communion. And so there is this sense that there is this descent. But there's also other places where it talks about we who represent the cherubim, like we who are part, are becoming analogous to the angels at our level and participating in this giant pattern. And so there is in a sense that we. That we have initiation rituals in order to escape. Escape the world, but rather to. To kind of have a full experience of what creation is. So that's probably the best way that I could talk about that. All right. It's from Mikao. So what is your opinion on abstract icons? Malevich treated his black square as a sort of icon. He kept hanging it high in a room's corner as if it were an Orthodox artifact. Nowadays the image is practically treated as an icon of art, as if art was a spiritual being to be worshiped. Recently I saw an exhibition of modern, semi abstract Orthodox art. Some of them were really moving in a good way. You could say that traditional icons are an abstract art anyway, so it depends. So this is a great discussion that's happening right now in, let's say, in Orthodoxy. So you could actually see that Malevich is black square, his supremacist icon is something of Gnosticism. Like, there's something about the desire to reduce the world to just patterns. And so it's like, hey, I'm for patterns, right? I love patterns. That's what I talk about all the time. But the patterns have to be embodied. They're not. You don't have access. I mean, you can have access to the pure pattern, but it always manifests itself in an embodied form. And so abstract art is. There's something about it which is dehumanizing and something about it which is alienating to the. To the human person. And so let's say one of the tendencies in modern. In. In the modern times has been to. Because some of the abstract artists. This is a complicated question, but some of the abstract artists, especially Maurice Denis, who was. Who is a modern kind of Modern Catholic artist. And there was part of this kind of weird modern Catholic revival of art. He saw him, and not just him, but other theorists saw icons as being the root in terms of abstraction towards modern abstract art. But I think that that's a problematic understanding because you could say in a way that traditional icons are less fleshy than Renaissance art, less kind of passionate than Baroque art, let's say. But to say that the, the, the Orthodox icon is more abstract is to, to act as if the fleshiness of Baroque art and of kind of romanticism or academic art is more real, is more embodied. And that's not right. You know, that embodiment doesn't mean the fleshy passions. Right. There is a, there's a kind of a, there's a balance in the, in the Christian body, you would say. And I think that the icons try to manifest that balance, that sober balance, you could say, of the body. So that's what I think. What time is it? 9:30. All right, so Nelson, Justin, Evan, ask how should an Orthodox Christian rightly order their finances? How are you asking me questions like that? Do you have any big picture suggestion about how to handle money in a spiritually responsible way? Example, how to plan retirement without credit interest? Can luxury purchases be justified? Man, you guys, this is not. You should ask your priest a question like that. I mean, I think that, I think that you have to, like, I could just tell you the way that I've, I, I've done it, and my wife and I have always done it is we, we've always just been very grateful for whatever it is that we have. And we've been very poor and we've also been more fortunate in certain times. And so, so we just, we just go at it one step at a time. And to be honest, I don't have investments. And, and I, I'm not saying that that's the way to go. I'm not saying that that's the way to do things. But it's both of us, both my wife and I have a sense that that's not the best thing you can do with your money, is like invest. Of course, if you're just going to squander it, then that's not better. But it, I think they're. Yeah, I think that it, it's. I don't think there's one way to go about it. I think that you just have to be attentive to the way that, that God kind of presents this, this possibility to you in your life and be attentive to what's going on around you, to the questions around you, to the needs around you, and, and just act. And just act based on that. But I don't, I'm not against investment and I'm not like. I don't think it's wrong. I also like the idea of luxury purchases is complicated one, because it's very. It's a relative thing. All right. Okay. So blank asks. Okay, blank. So how do you do? Could you discuss the symbolism of the two Witnesses in Revelation? How do we understand them in terms of the end of the world? Specifically the end of the world we're in? I've heard in Protestant circles that they are related to John the Baptist, Elijah and Enoch. Do you think this is accurate or no? I think that that attribution to John the Baptist, Elijah, Enoch is a pretty universal one. I don't think that it's come. I think that it comes from the church, Father. I don't remember exactly who, but I think it's a very ancient understanding of. Of the Witnesses. And I mean, it has to do with the idea of those which were taken up, those that were taken up without dying. And so that's mostly the idea of the. You know, there's a. There's a pattern that kind of at the end of a world, there are the. There are these characters that are taken up. And then before a change, it's like a. It's kind of like the. At the end, things kind of separate. And there's a moment of transition and there are certain elements which go up, let's say. And that's what Enoch is. That's also what Elijah is. That's why in the Elijah story, there's the Enoch story, there's the flood, and then in the Elijah story, there's also the crossing of the river with the garments of skin. And so that's trying to show you that this is a transition, that then Elisha is going to start a new world. And Elisha starting a new world. There's a lot of his miracles that are there to show you that he's starting a new world, like raising the axe head. And, you know, there are these different miracles that are there to show that. And Moses is the same too, right? So Moses dies, but his body is taken up. So. So yeah, that's usually the way that it's understood. And so the idea is that you could say that these witnesses will appear at the end, before the end of the world. And so. So there's a sense like you could understand it, like you can understand it. The way that Christ said of John the Baptist that he is the Elijah that will come. So you can understand that before the end, there will be Elijah that will come, there will be an Enoch, there will be, you know, another John the Baptist that will, that will manifest before. Before the end. So. All right, so Christian asks, what is your experience with tarot cards? And do you think it is okay for Christians to use them for symbolic purposes? I don't really have any experience with tarot cards. I would say it's probably best to avoid them. Like, to especially avoid people who are using them, because people do use them as a kind of weird, like a kind of weird divination. And there is warnings in Scripture against divination and the tradition against that type of action. You know, you can understand why it's dangerous to, to want to devise your future or to want to use pattern understanding as a way to give yourself power towards your future. And so that's a dangerous game to play. And the thing about it is that it's probably not completely hogwash, which is why it's dangerous to play with those games. So if you want to kind of just look at tarot cards and try to understand, because they're certainly using, they're certainly using some, some patterns that are, that are connected to something. Like they're not, they're not arbitrary, but I would say just to be careful because it's not. It's a, It's a dangerous road to, to get on. All right, so VSAC 28, 2008 says. Hi, Jonathan. I've been reflected on liturgical circum. Circumvolutions. They seem to define sacred space. Great insensation at the beginning of liturgies, established center, sensing, singing, transformed the world. So these different cycles of sensing and symbolize sacred transformations. The direction does not seem arbitrary. Sometimes clockwise, sometimes counterclockwise. Could it have something to do with symbolism of the right and left? Or could it refer to cosmic symbolism, sunwise connection, or even interplay, or both? I, you know, I'll be totally honest with you. I've been thinking about that a long time in terms of how it works in the liturgy and the, the. How the processions work in the liturgy. And also they're like, I think your intuition is, Is very good in the sense that there seems to be, in the way that the Christian church is set up, an interplay between two symbolisms. One is left and right hand, and then the other is north, south, east, west, and so the left side. So if you're In a church, and you're facing east, right? The left side is north. So the left side is dark and the right side is south. And so this, the right side is light. And so there seems to be something of that in the way that even you can see if you look at medieval churches, the way that they would decorate the churches, they, they definitely were taking that into account. And so the, the northern transept would often be like the dark transept. And so they would have weird symbolisms. In the northern transept, for example, it. I think it's in. I think it's in Notre Dame or in Shacht, not sure which one. They, they have all the weird stories in the northern transept. They have all the foreigners, all the, all the strangers. In the Old Testament, they have the, the story of the ox cart with the golden hemorrhoids, all the weirdness, like all that kind of, that kind of loose symbolism of something which is kind of loose and not attached to, to the, to the center, the, the righteous. The righteous strangers, you would say, you know, and all these other kind of strange stories. And then, and then the south side, then there'll be more like New Testament stuff and everything. So there's definitely something about that in terms of. And so they, the idea of like, coming out in the north, like that the origin of the sun, even the origin of the sun is in the north, like, that's something that's hard for people to understand. The sun comes up in the east, but it's like the seed of the sun is down in darkness, right? It's hidden in the darkness. And so the idea that the origin is in the north, but it reveals itself in the east. Right. And so you can see that, how that would be like this, this, this kind of procession from north, but it doesn't totally, like, it doesn't completely jive to me, so I probably shouldn't be talking about that, but it's something I'm still thinking about, I've been thinking about for 20 years or whatever. All right, so Timothy Aspaslaw says, hey, Jonathan, what is a good way to help someone understand or experience what Rene Guinon calls super rational? I mean, that's what we, when we talk about the noose, that's what we're talking about. It's the idea of direct intuition. And so it's. You experience that all the time. Like, you experience super rational all the time. It's just that we're not used to having. We're not used to understanding those experiences. Every time you, every time you Experience unity in anything. You're experiencing something which is super rational in the sense that the rational can analyze the parts, but it can never jump to the unity. And so unity is always super rational. But then once you have the unities, then you can do it again, Right? So it's like you can analyze the parts of the chair, and then you jump up to the chair. And then when you have chairs and other things, you can analyze those, then jump up to higher categories. And so that's what it is. And so imagine that like in yourself, where you have all your thoughts and you have all your passions and all your desires and all your. And all your multiple personalities and all of that. And then once in a while, you can have this glimpse of something which unites it all together. And it's beyond thought, and it's beyond. It's like a direct experience, you know, It's. It's. It's beyond analyzing it. It's. So that's probably the best way to understand it is to see how we actually experience that. We actually experience that quite a bit. Like, we just don't recognize it. So. All right. All right, so I'm moving now on to. To Patreon and getting a. A little glance at the chat. I'm happy to see that Neil from Derpa Robbins is there. Sweet. And symbolic memes is there. Always funny stuff. Lisa's there. Cool. All right, so, yeah, look happy to see everybody in there. Thiago is there. Nice. I did. Was on your channel. Look at me going through the chat. I'm becoming a real YouTuber after four years of doing this. All right, and so dirt for Robin says symbolic memes is the best. Yeah, the. The. The. The memes are. Are hilarious. Oh, they always. They also work on. On, like, often work on, like, several levels. And I'm like, man, he's really thinking this stuff out. Okay, so let's go. Let's go into Patreon. All right, so Jason, and we're all curious about who symbolic memes is. One day we will discover who you are. It's gonna happen. All right, so Jason, he says, symbolic music. I don't make them. They just manifest themselves. That's hilarious. All right, so Jason Gadawaltz says, how would you describe Virgil in the comedy Human Reason? A poet. I think that. I think that at least especially in the comedy, Virgil is playing several reasons. Roles for Dante. On the one hand, he's playing. He's playing the role of that which inspired Dante. And so it's. It's a It starts out as a personal. At a personal sense, it's that he is the one that is like Dante's mentor, you could say. And so. And so, in that. In that sense. But his mentor, you would say, twist up to a certain level. And so, yes, he does also represent something like reason and also something like. For. At least for Dante definitely represents the poet. And so. Because. So you have to understand that. So Virgil is the. Is. Is Dante's inspiration, but he's. He's. Is really is his inspiration. So not just personally, but in the sense that the descent into the underworld meme, like the descendant to the underworld structure, is in the aeneid, right? It's part of the aeneid, and it's part of the writings of. Of Virgil. So you can imagine that Virgil would have Homer, you know, kind of guiding him along. And so Dante sees himself as. As a. As just like Dante is taking Virgil's notion of the descendant to the underworld and then joining that with Christianity. Okay, so that's what. That's what he's doing. And so that's. That's what's happening in the. In the story. It's like, that's the. That's how. That's also what's happening as Virgil guides Dante up the speed of the. Up the levels. And then at some point has to stop, and then Dante moves up higher and, you know, has. Ends up with a. A saint. Ends up with. Now I can't remember his name. That's horrible. Who guides Dante up? The guy who wrote. Who. Who's like, wrote the Templar chart for the Templars. Like, I know. I know who he is. I just can't remember. Oh, that's horrible. It's horrible that he's not. That his name isn't coming to me. All right, will we continue? So that's what. So that. I think that's what. That's what it is. It's gonna come to me, and then I'm gonna. I'm gonna feel really stupid. All right. So Norm Grandin says, I'm not sure how prevalent the seven last words of Christ are for orthodox, but these words as Christ's last sermon, placed under the themes of forgiveness, Father, forgive them, salvation, today you will be with me relationship. Okay, so he goes through all the seven way heavenly in the Catholic faith. I wonder what sort of symbolic story arc you might see there. Perhaps a summation of his ministry, covenant fulfillment, or even as a resume of the Christian story as a whole. I'd have to think about it, to be honest. I've never thought about the last words of Christ as an arc or as a story, so I'd have to think about it. It's definitely something which sounds plausible at the outset, so I would definitely have to think about it more. All right, so Connor Mitchell says, why does Russia hold almost a mythical boogeyman role in Western society, or at least in the American mindset? I mean, because you need one, I guess they realize that they need one. They tried to get rid of their boogeyman, and then they realized that they. That they. That they kind of need it. And so we went back to it. The funniest thing about the Russia US Story, there really is, like, a wisdom and understanding what happened in terms of how. How. How things happened. And so. So you can think about it, like, in terms of Christianity, let's say. So you could think about how, let's say after the Revolution, you know, especially let's say after World War II, during the Cold War, the US were sending missionaries. They would send people with, like, that would smuggle Bibles and would try to, like, inject Christian Christianity into. Into Russia. And then, so there was like, this secret action, this. The secret seeds that were being planted in Russia. People bringing Bibles and trying to pray, praying for Russia, praying for the salvation of Russia, like this massive kind of attention and movement from Christianity into this dark place that Russia was. And Russia was doing the same, right? Russia was sending their spies over to the US Infiltrating culture, you know, trying to affect popular characters. And. And let's say you have these. These theorists, that Communist theorists that end up becoming very popular in. In the US Institutions and kind of infiltrating US Institutions, this whole idea of the long walk to the institutions. And so you have this secret action on the. From the Russians on the Americans. Then you have the secret action from the Americans on the Russians. And then this, like, this secret seed grows up, and it makes it that they flip. They, like, switch over. And so all of a sudden, America becomes this, like, secular, you know, wasteland, and Russia becomes this, like, new bastion of Christianity. I mean, think about it, how crazy that is. Like, how just nuts that is that that happened in our lives, that we saw that flip happen completely. It's nuts. And so. But it can help you understand how. How reality works, how it's like these secret seeds that we're planting. You know, it's like even now, like, let's say that this work that we're doing. I talked about this recently with Paul Vanderklay, this idea that the work that we're doing now, let's say what you guys are doing with me and the symbolic world people. And it's like we're not getting massive attention and it's probably better we're not. There's a sense in which the work we're doing of like re. Enchanting the world or helping people see the re. Enchantment of the world is like this secret work that's happening. And it's going to grow. Like it's, it's going to grow because it is, right? It is the end of the, of the cycle of, of, of the d. Of like disenchantment. And so it's gonna, it's gonna happen. And, and I think like, I, I really do believe that, that in 10 years or whatever, so a lot of people are going to start to think symbolically and not even know where it comes from. They don't even know. They don't have to. It doesn't matter. But it'll have grown up and it will have had its, its fruit. So it's an interesting, it's an interesting, interesting way to understand how the world works. Sorry, I didn't totally answer your question, but I think I, I did in the end. So Paul Dumal says. Hi, Jonathan, you have mentioned that we should not read too much into dreams. Is it because they are by nature unreliable or only because the vast majority of us lack the discernment to analyze them? By extension, do you think that all modern psychological theorizing about the meaning of dreams. Freud, Jungian is worthless? Thank you for your work. So the reason why you don't want to pay too much attention to dreams is that it's kind of like, so dreams, in terms of consciousness, there's something like the waters of chaos. And so consciousness arises out of this water of consciousness and then goes back into it. So it's like this cycle of awake and sleep. It's the cycle of, of life and death. It's the cycle of work and Sabbath, right? It's this cycle of light and dark. So the, the, the sleep is like a little flood. And I think if you read Matthew's book, you'll see that he, he talks about that. And so most of dreams are just like chaos. They're just like, they're just chaotic and they, and you shouldn't, you shouldn't give too much attention to that. And I don't know, like, maybe it's just me, but I know some people that, that pay a lot of attention to their dreams and there's something unhealthy about that. They end up being. It's almost like they're living in their dreams. It's like they're, they're, they're, they're living in their dreams rather than living in the, in the real world when you're not careful. But the thing about that is, so you can understand, the best way to understand is like, it's like the, on the water, the lower waters. And so these lower waters are like these waves and this chaos and this kind of bubbly stuff. But the lower waters are also the place of like a mirror, you could say. And so if the waters are still, let's say, then once in a while they can become a mirror for higher things. And so that's why people do have real visions in dreams. And so they do have true revelations and dreams. You see it in scripture, you see it in the tradition, you see it all over the place that this happens. But most of the time, because we're not saints, because we're not, most of us don't live in prayer with still minds. Most of our dreams are just a mess of chaos and of desires that are crossing each other and contradictory things that don't make any sense. And so it's dangerous to, to, to, to pay too much attention to that. So, so yeah, so that's what I think. And the church fathers, they, they really warn people against paying too much attention to dreams for those, I think for sim. Like for similar reasons, because most of the time it's just chaos. So Dom Palermo says it is not what goes into a man that defiles the body, but that which comes out. Porn images are not inherently bad, say in the hands of a blind man. This simple frame can be used to assess the question of psychologically coerced DNA treatments. I personally do not condone abortion. Rolling up my sleeve is not a symbolic moment. For me, the Pope is relevant. I'm not, I'm not sure where you're going with this, dude. The Pope is irrelevant. He's not my Pope. Individuals make choices, and identifying with the religious aspects of the meta story or not is a choice. I find this to be a potentially dangerous modern line of presupposition. How can we better show that the participatory actions of the individuals is not separate from the movement of the whole in material action and invisible meaning? I'm not sure. I'm sorry, Dom, I don't totally understand your question and I. And I'm so sorry about that. All right, so Micah Mueller asks at certain points from premonitions or heartfelt prayer, I will be struck in the back of the head. A shiver will down my spine like there was a thought or idea that I was too large to bring to realization. What is the meaning of this from a phenomenological or symbolic perspective? Is it related to the snake sliding down the tree or bird too large to nest? I mean, I understand. I don't know, like, in terms of the physiological description, but, you know, I mean, I think that we can sometimes we do have these kind of terrifying experiences of connecting to, to a reality that is bigger than us. So I think that's what you're describing. So I'm not sure though, if it has to do with like a snake sighting on the tree, but for sure there is there. We do. Like, we. I understand what you mean in the sense of suddenly being kind of overwhelmed by a sense of, of. Of almost like sacred terror. And I think it's. It's good. Like, it's good that that happens to us and we. It's good if it can help us to understand how bigger the world is and what we're able to perceive. So, so that's probably good. So Ryan Pinkham says, have you read St. John of Damascus on dragons and ghosts? No, I have not. Seems to be talking about physical animals, beasts in terms of ghosts, really physical animals. I understand dragon symbolism, but you think they physically existed? It doesn't seem that crazy to me. And so of course dragons existed. I mean, dragons probably exist now. It just, it's just, I'm just when I talk about dragons have to have to have an effect on the world or else people wouldn't talk about them the way they do. What I'm trying to help people understand is that the dragon is, is a, Is a different type of category than just the like, regular type of categories that we, that we use. And so, so you could encounter a dragon, but then someone else might encounter a dragon. It won't be the same dragon. It'll be like another phenomena that will be a dragon. So the dragon is like, is like. Is kind of like this unknown monster, this unknown being, this unknown animal, unknown, terrifying, unknown phenomena, you know, and so, so I think that people did encounter dragons, and I think people especially encounter dragons when they're in places they'd never been before. And they especially encounter dragons when they're in like, new lands or in the, you know, in, like in the. In out on the ocean, you know, sea. Sea monsters and all that stuff. That's where you encounter dragons when you're in places where there are things that you don't know. You know, there are things crawling underneath that you don't understand. So I hope that makes sense. So it's like I, I don't think you could ever dissect a dragon and, and have like a zoological category that you could have dragon DNA. How about that to say that I don't think dragons are like that, but I do think you can encounter them, that's for sure. Hopefully that makes sense to you. In reading the Gospels on the Passion, I was struck with the many seemingly arbitrary events that occur in these stories. Huh. Could you imagine, could you maybe go into the meaning of Christ not bearing the cross and Simon of Cyrene? Why isn't this part of all the Gospels? I mean the reason why it's not part of all the Gospels is not as important in understanding, let's say, the mystery of that, of that moment when, when a character from far away carries the cross of Christ for him. You know, it's, it has to do again with, with, with, with like it has to do with something, something like Christ is going to sa. Christ is going to save Rome. Christ is going to save the Ethiopian eunuch. You know, all these, these far away characters that, that this is actually, this is actually how it's going to play out. At least that's how I understand it. So. Kevin Patterson asks. Hi, Jonathan. I was touched by your story where a priest crossed himself upon seeing your icon carving for the first time. I want to make such art which participates in Divine Liturgy as your visual arts do. Though I struggle to accept the lower place given to my proclivity towards, let's say, movement, arts, music, cinema, stage performance. While in pagan traditions the shaman would be highly revered for the same role. What is the highest form of these arts? How can these skills participate in the Divine Liturgy? I mean we have this like we, it's called, I mean the priest is moving. The priest is, is, is acting and like acting in the sense of, of, of moving in the space and moving in the church. We have processions which move around the buildings and the, the, the organization of those movements is, can be very touching. You know, a good procession, a beautiful procession can be really transforming. We don't, we don't understand that because we're so far from that. But a good, a good procession can really affect the world. Like there's a parish, there's a Catholic parish in Chicago that I went to and, and they totally understand that. Like they, they in Chicago, they, they, they organize these These processions, like, these massive processions, huge, with like, everybody vested and. And incense and, you know, these banners and. And. And, you know, like, maybe. I don't know if they carry statues and stuff, but, you know, you get. In Orthodox tradition, they'll carry icons on banners and they'll carry holy objects and stuff, and they have these processions through space, and they kind of. Let's say they. They transform space, you know, by. By. By moving into it, you know, with this kind of holy movement. And so I think that that's the highest aspect of that. So. Yeah. So Connor asked. Hello, Jonathan. I've been watching your videos for several months now and greatly enjoy your content. I'm reading through Genesis and the way that Lot's daughters take advantage of him really struck me as odd. Is this just an example of how depraved the city of Sodom had gotten, or is there a deeper symbolic interpretation that I'm missing? Yeah, there is a deeper symbolic interpretation that you're missing. So this is the tough stuff, guys. This is the tough symbolism. Yes. So Susan Martin says St. John of Cancius in Chicago, they're the ones who are doing these. These. These great processions. Okay? So the. The story of Lot's daughter in. In that moment has to do with the end of a world. And it has to do with. It has to do with the. The. The lever. It. It's. It's. It's using the same symbolism as the lever. It. So the what? The leveret is the idea that if a man dies, then the. Then. Then his brother can give a son to his wife, to his widow. And so the. The idea of taking your brother's wife is completely immoral. Like, it's completely wrong. And so in. In. But in the end, like in this weird moment of end of the world, there's a. There's a weird thing that happens. Like there's this strange type of symbolism. You see that in the story of. In the story of when. When Joseph goes to Egypt. And then I can't remember the names of the character in the scripture. What is wrong with me? There's a. There's. There's one of the sons of. One of the sons of Jacob. His. His own son dies, and then the name's gonna come back to me, I hope. And. And then he gives. And so his wife doesn't have a child. And so he says to his other son, you need to give a child to his. To this woman. And. But he refuses to do so. And so he dies the son. And then He. It's like the other son, and then the other son dies too. And so this woman is, like. Doesn't have a son, and so she actually ends up. She actually ends up, like, sleeping with the father in order to get a son for herself from her husband. So this. Like, that's the. That's the weird moment, man. That's the strange. That's the strange thing that happens at the end of the world. And so it's not to say it's not about. It's not to say that what Lot's Daughters did was moral. It wasn't. But it's just in the story, you see. You see this type of flip happen, like this. This. This breakdown of meaning, like this breakdown of coherence, and that's what leverage symbolism is about. It's about this. This weird break in terms of normal, coherent causality, and that's what. And it brings about, you know, the resurrection. So. Yeah. Yeah. So it's Judah. It was Onan. Exactly. There you go. You guys. You guys have got it. And so Onan was the. The. But Onan was the son that didn't want to give a daughter. Didn't want to give a child to Judah's stepdaughter. Judah's not stepdaughter, but the daughter of his son, his first son. Yeah. So onanism. So onanism is a. Is a. Is actually a word for masturbation or, like, because it's wasting seed. And so Onan didn't want to give a son to his brother's wife, and so he wasted his seed and so not to give her a son. So. Yeah, so that's. That's it. Sorry, this is getting weird. Okay, so let's keep going here. All right. So. So Arie Fisher says, I asked Verveki on his Q and A yesterday what he thought of your assertion that reality is more like a hierarchy of beings than abstract Platonic forms. He ended up spending half the Q and A answering this question. I should listen to that. So I'll do my best to synthesize. His answer says, because there is a pluralism of seeing the forms as either personal or impersonal across history and cultures, reality is deeply ambiguous, suggesting that the two conceptions are probably highlighting different aspects of the same reality. Because the similarity between our personhood and the forms is not technical because of the combinatorial, explosive amounts of similarities between any two identities, but rather has to do with its relevance to us. On what grounds can you legislate what people should and shouldn't find Always relevant. Doing so would suggest that you have found the answer to end what has so far only been a proliferation of pluralism. Thus we should make. Thus we should take an evolving relationship to the sacred, not a resolving one. I'm not sure I understand the second part of that, but I agree that in a way, I agree that there is. That there's a sense that. That. That there's both and that there's relationship between both. And you find some, like, resolution of that in the idea of, let's say, something like the virtues, right? Which are both. The virtues are both like. They're like embodied patterns that you. That you manifest, but they're also understood as angels. And so you have this. You have places where these kind of come together, but you have the idea of patrons. Like, the idea of patrons means that because we are persons and we are the ones doing the relevance realization, right? So intelligence ends up infusing into. Into that. And so intelligence scales up. I'd love to. I probably should talk about it with John. That would be. Probably been looking for. For like, a. A subject to talk about with him. So maybe that could be a good subject to talk about with him. All right. So, Romer ask. Hi, Jonathan. And congratulations on reaching 666patrons. That's odd. It's an odd thing to say. So what symbolism stories from the Bible do you find most puzzling or impenetrable? Are there any chapters that you would be especially interested in discovering the meaning of? I think still. Revelation is still man, that book. And so it's like, I. I did this one video on Revelation, and I'm trying to write the second. The second one. And I'm, like, struggling because there's so much. It's like. It's. As soon as you start talking about it just splinters into a million directions. And so it's really tough. And so I feel like there are many chapters in Revelation that I don't totally understand, that I just don't get. It's. It's just too dense. It's so dense. It's like every word, every sentence is. Is like a little world that you have to unpack. And so it's very difficult. I mean, to be totally honest with you, I. I feel like. I feel like the story of Jesus is a story that I don't understand still. There's. There. There are things in there that are just. I mean, I have these glimpses, and sometimes it's like I have glimpses and then they vanish really fast, and they. They kind of go away. I can never really. I mean, it's probably best that I can't. It's probably. That's. That that's part of. But definitely like that story. There are also a lot of stories in Judges which I have, like, I have, like, inklings about, but some of them are just so strange that it's hard to really capture what's going on. And so, like, Matthew said he was going to write a book about the Book of Judges, and I was like, yes, write a book about the Book of Judges, but I don't know if it's going to happen. I hope that would be awesome if he could do that, because the Book of Judges is really hard to understand. Some of them you can get, and then others you're like, this is. Obviously has meaning. This obviously has meaning, but what's going on? All right, so. Dear Jonathan, Tom Holland points out in Dominion that God boasts to Job about wrestling with Leviathan. Holland portrays this as a remnant of early religions where such stories were central. What is your reply? Why was it necessary for God to wrestle with Leviathan as Leviathan's creator? It's definitely not a, it's definitely not a, A remnant. I mean, you could say it's a remnant, but it's. It, it follows all the way into the New Testament, you know, when it says that, that God defeats the Leviathan, the great Satan. And so there's a sense it has to do. I mean, in this sense, it has to do with the idea of God as bringing order to chaos. Like, that's one of the aspects of light, of the divine Logos, of, you know, and so you could say that the idea, like I've mentioned this recently in a few talks, where this, like, strange image at the end of, of Revelation where it says that there's no more ocean, right? And so with this image of the New Jerusalem, and it says there's no more ocean. So that's like also saying there's no more Leviathan. Like, the. Those two things are very close. And so it's like Leviathan has been defeated, Chaos has been. Is gone. It's all. The whole world is full of the glory of God, let's say. And so that's what it's referring to. That's what it's culminating to, at least. And so if, if, if the source, like the physical source or like the, let's say the textual reference that is used in Scripture comes from, you know, other traditions, that doesn't bother me one bit. I mean, whatever, that's fine with me. But it's still part of a puzzle that's moving towards this final image, you know, of the serpent being cast down, of the ocean being dried up and this, this chaos being finally completely, being completely defeated. So. Hello, Jonathan, I don't know if you've answered this before, but why is it important for the hair of Medusa to be made of snakes? I mean, it's such a, it's such a, it's such a. It seems to me like it's such an intuitive thing. Like it's such an intuitive thing in the sense that. Right, so hair is a. Hair is like, is the covering. Hair is like, is also death. You know, hair is the dead things. It's like a dead covering that you have on yourself. And so it's like, doesn't it make sense to you that the, the, that the snake would be like the hair in the sense that. Even, even if you just would like to mix Christianity and Hellenic myth, like the snake brings about death, brings about the cycle of death, right? He changes his skins, he loses his skin and he changes all the time. And so like this, this change also the change, like Medusa changes people to stone. And so she's an agent of transformation in the, a dark sense. And so that's what snakes are. They're, you know, they change hope. That makes sense, you know, and, and it's like, how do you, so how do you, how do you stop the Medusa? You. How you give her an identity? Like if she sees herself, then she's she and then she's done. It's like she. So, you know, makes a lot of sense. You freeze her. If you, the way you stop the snakes and the dead snake hair as you freeze her. I think that. I don't know that that's as close as I'm gonna get to that one. So Enrico says, any thoughts on symbolic meaning of us trying to become a star faring civilization, trying to reach the heavens or names of the space X rockets, etc? Is it something positive, like an Abrahamic call to look at the stars and leave the father's house? Or more like a Tower of Babel story? So the first thing to understand is that the space is not the same as heavens. It's just not. Space has become the ocean. So the symbolism of the ocean is the symbolism of space. The way we understand it now, going where no man has gone before is a seafarer's story. It's an explorer story. It's a, you know, it's like, it's like Saint. It's Like Alexander the Great going out into the strange lands. And so that's what, that's what space exploration is about. So it doesn't really, it doesn't really have to do with, with going into heaven in the traditional sense. But is it also a form of Tower of Babel in the sense that it is? There is a certain arrogance because you're really going into death. Like you're, I really don't think that we're ever going to become a star faring civilization because I mean ever is a big word, but let's say at least not in the, on the foreseeable horizon. It's as if you could. It's, it's like, it's like asking a whole civilization, it's like asking people to live under the, under the ocean for a very long time. It's like technology can hold out chaos to a certain extent. But if you go, if you try to like live right in the chaos like all the time, at some point the cracks, you can't avoid the little cracks, they're going to start to, the water is going to seep in. You can't. So you can't live in space. Space is death. Space is absolute death. It's, it's the most hostile place that exists that you can think of. It'd be like living in like a, you know, like a molten lava. I mean you could do it, but it's not, you can't live like that forever. So I don't think that we could really become a star faring civilization. All right, so I. Jonathan, what is the meaning behind not blessing the firstborn in scripture, when Jacob crosses his hands, I came to remember you say that flips occur at edge of categories. Is this a transition point in the story? Yeah, that's a, I, I've talked about this before. That's a difficult, it's a difficult text to interpret because you're not sure which way it's going. And so you can understand that Jacob. So Jacob steals the blessing from his father. And so there's a, there's like this, this flip where Esau is supposed to get the blessing, Jacob takes it from him. And so when he crosses. So when Joseph, who is Jacob's favorite son, comes to have his sons blessed, the idea that Jacob crosses his hands. And so it's not clear whether he crosses his hands because he's trying to reproduce the same pattern. And he's being tricky Jacob, tricky, tricky Jacob again. Or there's another tradition which is that Joseph, out of respect, presented the children the other way around, out of respect for his father, knowing that his father was the second born and got the blessing and that then Jacob crosses his hands to restate. To restate the right way. And I'm not sure which one it is. So. So yeah, it does have to do with this flip between the left and the right, for sure. That's. That's definitely what it has to do with. And it has to do ultimately with the problem of, again, the problem of how Christ ends up blessing Cain. You know, the firstborn gets blessed again. Get. Rome gets blessed. Because Israel is the second born. It's always the second born. Israel is the second born from the beginning, you know, from. From the time of Abel. It's the, the whole mythological structure around Israel is about the second, the second born. And so there's a sense in which there's a flip that happens in Christianity. Yeah. So JL says. Sorry, Joe says, I remember an episode of the television show 30 Rock where we're. The Alienkovic parodies a parody song and it results in an earnest patriotic country western anthem. Weird Al becomes normal Owl Is humor only ever subversive? Solely act, solely recreative. Also, since being baptized, I've managed to retain to some extent a few cool cat, obscure secular type friends. And I've noticed an increase in the mockery of things that were originally mockery themselves. Yeah. Something irks me about the advent of Shrek memes and their ilk, but I can't put my finger on it. Every blessing. Not sure about what you mean in terms of that, but for sure there is. For sure there is exactly that. Like, there is the idea of irony kind of turning back on itself and, and you know, it's inevitable that'll happen. That's kind of this double flip that I talk about, or I talk about watch the fools in terms of watching the fool kind of restate the normal. In the end, that's definitely what it's all about. And so, yeah, that's maybe that is what Shrek is about. Like, I've never really thought. I've never really thought about it. Maybe the Shrek. Because Shrek is the ogre, right? Shrek is the, is the weirdo is the. Is the excluded one. And so the idea of like mocking Shrek for being, you know, the whole tip the fedora thing and the, that whole kind of aesthetic of the, of those Shrek memes, those were, those were maybe having to do with that, like a double weird kind of weird, double mocking. I haven't thought about it. So much though. So Drew McMahon asked. Hi, Jonathan, do you have any thoughts on the veganism movement that seems to be taking over? Every restaurant and fast food place has some beyond meat or impossible burger option. Yeah, yeah. The aesthetics of the vegan is important to understand because there's a transhuman aspect to it, like a weird technological aspect to veganism. It's strange. You wouldn't think it, like you'd think that veganism would kind of have a kind of earthy vegetable look, like a, you know, like a back to the earth type aesthetic. But it has a weird kind of techno, you know, technological food aspect of it. And so even the, even the term like impossible burger is interesting in terms of understanding the strange extreme that it represents. But yeah, it's an, it's, it's definitely an odd thing. My feeling about it has something to do with this weird. Like it's not because I mentioned earlier about how the, the monks are vegetarian and that they also live, but I think that there's, it's weird deincarnation, this veganism. Like this especially the aggressive kind of veganism. But I'm not sure I need to think about it more. So. Marshall McLuhan G. Garcia asked. Sorry, I'm not saying I'm not. I forget to tell you to, to mention the names. Nathan Hart says, reading Dominion, I can't help but start to feel that the temporal evolution of Christianity is deterministic and that even if traditional Christianity were to be restored to its former status, the process would merely repeat itself and we'd be back where we are today. Do you think this is true? Or the Reformations that took place. Unique, not inevitable. And so I think they're inevitable, not in a deterministic way, but in the story will play itself out way in the sense that, you know, Christ said, Christ said, he said there has to be scandal, but it doesn't mean that they're good. Like, it doesn't mean that their scandals are good. He also says, but beware, you know, don't be the one by which the scandal comes. So it's like the, the, the story of Christ. It's like, it's like saying that Christ was gonna die. And so it's like it was, it was part of the story, but those that killed them still killed him. It's not, it's not like they're absolved of their thing, you know, although Christ does say, you know, forgive them, but still, like they still bear the responsibility for their actions. And so, so Christianity has to go through this and And I don't think that traditional Christianity will, will be restored to its former status. I don't think that's going to happen. And I don't think that's what we're doing. It's like, I don't feel like that's what I'm doing. Like, I'm mostly trying to, to, to plant seeds, I would say. But I, I, I, Although I say that. Okay, look, so I say that. But here's Russia, right? So here's, here's Russia where, you know, it's. Although they're not the main. Although they're not the majority, they're still like, the Orthodox Christians are still. It's, like, driving force and culture. So who knows? Really? Like, seriously. I shouldn't say. I shouldn't, I shouldn't speak too, too fast. All right, so G. Garcia says Marshall McLuhan talks about a conceptual bias of the Western world. Can you elaborate on this? This seems to, this, I'm not sure. Like, I don't know. Like, I'd have to read what Marshall McLuhan says. This seems related to you and Jordan's conversation, personally speaking, I think I understand conceptually, this hierarchy of being you talk about, but what does it mean to get past mere concepts? And so maybe, maybe that's what you mean in the sense that, like, I keep talking about how ultimately these patterns are embodied. Like, they're not. Although we talk about them, we think about them, there's a, there's a way in which they have to be embodied, they have to be lived, they have to be engaged in. And so it's not just about, not just about sitting around and thinking about them. Right. Ultimately, that's why, that's why I say, like, ultimately you have to go to church. You have to get involved. You can't just think about it. All right, so Jan Peter Jager says, could you explain the symbolism of the Marble King legend, of the Repose King in Orthodoxy? Do you mean like the last emperor legend? I'm not sure I know which legend you're talking about. And you might be talking about the idea that the last emperor will kind of awaken at the end or this. There are different ideas about how, for example, like, the people who celebrated the liturgy, like, kind of walked into the walls and kind of became part of the walls. There's this whole idea that something at the. When Constantinople fell, you know, that there was this freezing of something and that it will awaken in the end. You know, maybe that's what you mean. I'm not sure. But this idea of the hidden king or the king that is waiting to come back, it's obviously a Christian trope. Like it's the trope of the return of Christ, but it's also the trope in Arthurian legend and these other types of legends. And it really is this kind of return to the king motif that you see in Lord of the Rings. So. And that's what I think it means, if that's what you're talking about. So Dorothea says, could you comment on the Queen of Heaven in the book of Jeremiah and her relation to the Mother of God, especially since some of the things the prophet is condemning sounds like medieval Marian miracles. Thanks. And so the way to understand that is, is, is to say something because one of the things I keep telling you guys about is that Christianity is ultimately a non, dual thing. It's not Christ offers the manner in which things get saved. And so like if you listen to the, if you listen to the Lord of Spirits podcast, you know, they really go into this very well. So there's a sense in which, let's say these hierarchies of gods that existed, that this is actually what God wanted in the outset, that God set upon the world, these guardians, these principalities that were there to, to in, in like a hierarchy of being supposed to manage at their level the will of God in the world. And so then those principalities rebelled against God and tried to take worship and power for themselves. So it's not, it's not, it's. Yes, it sounds abstract and it sounds like just something that's hard to understand, but you can understand it at a lower level if you want to. Right. You can understand that, that there, that, that there's a country with a certain organization and that the country, the army, they have generals, and those generals are there to manifest the will of the emperor, let's say. And to, to, to, to have wars and different, different, you know, to be able to, to, to manifest the will of the emperor and the different aspects of, of, of the kingdom. And then some of those aristocrats decide that they're just going to stop at themselves. They're just going to take it for themselves. And, and therefore they start to gather money. They take the worship, they take the money, they take the things of the people, but they don't, they don't offer, offer up to that which is above them. And they try to be little gods in themselves. And that's what this is talking about in terms of these lower principles that are, that are getting power for themselves. But that aren't participating in the giant pattern the proper way. They're revolutionary. And so. And so the idea would be that the Queen of Heaven is still a real function in the. In the world and that Mary plays that role in a proper way, in a way in which she says yes to God, in a way in which she offers worship to God. So the icons of the Mother of God show her worshiping Christ. The icons of the Mother of God show her praying to God. Right. So when you look at an icon of the Mother of God and she's praying, she's praying up. And so the image of the Queen of Heaven is one which is giving the honor, whatever it is that comes to her, offering it up higher. So that's the difference between the divine council, which is being reinstated through the saints and through our reigning with Christ, through our capacity to rule with him, and the ancient hierarchy of gods. But what's going to happen is it's not surprising that you're going to see the patterns are actually going to resemble. But obviously Mary, if you look at her story, if you look at images of her, if you look at everything about her, there's nowhere where she keeps that honor for herself. Nowhere. She's always offering it up. So you could pretend that that's not what's going on and you could say, oh, no, yes, it looks like she's offering it up. It looks like she is. But no, it's all idolatry. But it's not idolatry because there is this whole movement up towards the God of creation. And so the honor that we give to the people that manifest God to us, they are carried up into the highest. They don't stop at them. It's the best way to understand it. So you will see the tropes of ancient. The titles of ancient pagan gods. Those titles are not necessarily wrong. Right. So it's like you don't like the idea of, let's say, the God of war, but you don't have a problem with St. Michael, the commander of God's army. Those are similar just that one is subject. Is subject and offers his service and his worship up to the infinite. And the other has a lower sense in which he can do his own thing and can kind of tyrannize the world and. Right. And. And make people slaves to his own. To his own passionate structure. So I don't know. I hope that's. I hope that helps. I feel like I'm going further and explaining this stuff to you guys that I ever have all Right. So Kent Anhari says. Hi, Jonathan. Blessed fast. Here's something that might interest you, provided you're not already aware. The long stand standard translation of the first Hermos of the past. Paschal Canon in the Antiogan Archdiocese calls Pharaoh the persecuting giant of old. This is a mistranslation from Arabic, where the word that should have been more properly rendered tyrant could also mean giant. Yeah. This isn't the case in the Greek or Slavonic text, but has always felt a bit to me like Moses's horns. Yeah. Which you've elsewhere talked about as a kind of symbolic, productive mistranslation. Any thoughts on the relationship between pharaohs, tyrants and giants? Any more examples of symbolically productive mistranslations you can think of? That's a great example of what I'm talking about because for sure, the pharaoh, especially the pharaoh, there's something about Egypt which is connected to this whole idea of giants in the sense of the. The absolute stranger. Right. And so you can understand that in the relationships of people in that time, the Egypt. So let's say Egypt really represented this, like, ancient. Like this ancient non. This ancient power that wasn't submitted to the God of Israel. And so it has. It really is this kind of ultimate stranger which is related to the idea of the. Of the giant. So that's a great. That's a great example of what I talk about. All right, so Charlie Longoria says, what do you think it means that more and more people are adopting pets rather than having kids. Yeah, I saw a bumper sticker saying dog mom, and another saying, I love my granddaughter. Oh, man. And it creeps me out, especially because I think having kids was the last thing attaching people to some sort of transcendent. Good parents want the best future for their kids, but I can see a world coming where people just want the best for themselves. Yeah, it's definitely a sign like this. This sign of the. The sign of the people having pets is definitely. I mean, it's fine to have a pet. I have a cat. It's okay. But it's mostly the problem of. Of this kind of. You know, there's a. There's a. There's like a prophecy. It's not a prophecy, but there's a description in Plato's Republic where they talk about democracy. And it's hilarious because it's. They're basically describing the world we live in. But one of the descriptions in democracy is that people end up treating their animals as their equals. It's like, yeah, you totally understand the problem of gaining legitimacy from that which is below. Like, what that does. Like, it ends up. It devolves, right? It starts to devolve and then we start to think that. That, you know, that the animals should have rights and then the robot should have rights. And then, like, you're going to keep going, you know, the trees will have rights and then the grass will have rights. And it's like this weird thing where it just kind of starts to devolve because there's no sense of. There's no sense of normal. This normal hierarchy. Then you don't know how authority ends up working. So, yeah, it's definitely a sign of the times, that's for sure. All right, so Josh Anderson says, hi, Jonathan, what do you think is the power behind a movie or modern story with a meta reality? For instance, wizard of Oz, where Dorothy wakes up to reality with her relatives playing major parts in the meta reality. The Matrix, Ranier wakes up from the meta reality. Or finally, Truman show, where everyone else is in on a reality you're not allowed to be part of because you're the subject of a meta reality. I feel as if our culture has a fascination with these types of plot devices. And I'm wondering, on a symbolic level, what do you think drives the popularity and admiration these movies often serve? So I don't think all of these are the same. So I'm not sure the Truman show is the same thing as the Matrix, let's say, in terms of that notion. But yeah, yeah, yeah. So, I mean, I think that the. You could say that what these types of stories do is that they are talking about the intuition we have, that there's something missing. Like, there's something missing in the world. And so it's like, what is that? There's. That. That. That. The sense that. The sense that this world is not enough. And so that's. I mean, you could say that that's really where the religious. All the religious impulse comes from and kind of condenses into. And so that's. But it's not just about this representing these layers of reality, let's say, like in the Matrix. But it's. It's every quest story, every story where you're. You. Every MacGuffin story. Right? Every. Every story where people are fighting over something that they need, something that they're missing. If they could just have that thing, then everything would be okay. So it's like, that's just this weird human condition we have, which is ultimately this desire for the infinite. Like, it's ultimately the Strange position we're in as intelligent beings, you know, to have this upward movement, to have this movement towards. Towards more. And so I think that's what it's about. But the funniest. The funniest part of this, the. The funniest are the simulation people. Like, the people who. Who say that the world is a simulation. And like, I just find that so hilarious because what is the simulation of? And so it's like, I completely agree that the world, in a way, is a layers of simulation, but it's not in a bad sense. But you could say it's a layered world of realities that are stacked on each other. And so that's a traditional way of understanding it. And so let's say the lower rungs of the world are heavier and have more layers on them. And. And as you kind of remove the layers, you have access to more reality and more light, you could say. And it also helps you understand or helps you see the reason for the lower ones. Not in a. It's like. So it's not like a gnostic sense where you're just. Where you're. Where you're. Where the body is bad or anything, but it's mostly that it's like as you move up, you kind of see the reason for the lower things. But it's. But the way that people phrase it, it's so superficial. It's like, it's so. It's so superficial. So I kind of joke and say, like, the world is a simulation. It's called language. It's just language is the simulation in the sense that it's the condensation or, or even concepts, or even any form, any. Any particular. Making particular ends up being what you would call the simulation, right? Because it's pointing to something which transcends it. But it's also, it's manifesting it in a. In a approximate way you could say. And so that's that feeling. Like that feeling we have that there's something more. Anyways. All right, so Eliana asks. Hi, Jonathan. Most of the fictional movies and TV I like come from all over East Asia. Things like anime, but also movies and dramas. Can you offer any guidance on symbolic interpretation, understanding of stories that emerge from non Western cultures in general or Asian cultures particular, particularly. And if you happen to have seen Heaven's Officials Blessing on Netflix, any thoughts on that specific show? No, it's like. I mean, I think I've told you guys that I. That I actually don't watch a lot of stuff. And so I, you know, once in A while I'll like watch. Like I watched one Division, then I made a critique about it. And so. So the sense that I have, let's say. And so the one series that I. I have been kind of watching very slowly is. Is Attack on Titan. Just because the pattern of it, the visuals of it were. So when I, When I saw what it was like, this story is obviously talking about something very, very much about what I'm talking about in terms of these, this. This wall, this city with walls, and these giants that are coming in from the outside that are trying to attack the city, but then turns out that it's actually related to some kind of sin that you don't know about. Like, I'm not finished yet. But there's. You. Seems like there's some kind of sin that's hidden but which is causing the giants on the outside. And so it's actually pretty. It's actually seemed pretty good. And so like, my intuition is that maybe the East. East Asian stories haven't completely tumbled into like ideological, Ideological blah. Like just this ideological nonsense that we're falling into. So I don't know. But like my daughter's really into anime and so she's really. She really gets a lot from that stuff. So I hope that's what it is. But there's a lot of dark stuff in East Asian stuff too. Like there's. Man, there's some dark stuff there too. Like, I'm not saying they're completely. They've avoided the. The depravity of our culture, that's for sure. All right, so, Julius Bar Daitis. Sorry, Julius. Hey, Jonathan. Last month a part of my question was about what an angel of London would be if the city were to burn. From your answer, it was clear that principalities and spirit in general can exist without embodiment. No, no, no, that's not what I said. So the follow up. Are there some ways for us bodily beings of conceiving this unembodied existence? And more importantly, the manner that unembodied interactions occurs. So an example could be maybe the war in heaven. In what way would an angel fight a demon if there were no matter? Because that interaction to express itself in. Is this interaction ungraspable for human beings? All the best. So first of all, I didn't say that they were completely un. Without body. And so. So you could. A good way to understand it. What I was trying to explain is that if the. If the angel of London is still the angel of London, if the city burns because there is a manner in which London exists outside of time, you could say in. Exist in the totality of all things that exist. And so angels don't have the same. They don't exist in time the same way we do. And so that's really what I was trying to get to. It's not that they exist. They just exist disembodied when. While the. While the city of London has burned down. But that they are always the angel of London. To the extent that London has a stretch in space and in time, that is that actually as a hierarchy of manifestation in the world that has a limit. But then all things have that. And so anything that angels. The only thing that is infinite is God. And so anything that angels are heads of have an extension in space or time, and that's what they're heads of. But they all exist. All of this exists in the eternal reality, you know, that is that. That is all contained in this eternal reality. That is God. And so anyways, it's hard to talk about this stuff in a way that is easily understandable. So hopefully that, that's. That's the. That's the best I can do, I guess. All right, so I think that's it. But for some reason it says me, tells me there's two more comments Patreon, but I can't see them all. Right, so I've got a few more questions in. In that Patreon that appeared. Sorry. So Kenan Wang asked, what do you see as the meaning of the different points of perspective orthodox art? What do you make of the overlap between this aspect of orthodox art and Cubism? Or is there a connection? So there are different interpretations of that. I, I tend to see it as. The way that I tend to see it is that it's closer to how you actually experience reality. And this is. People are going to find that hard to believe. But the thing is that the idea of representing something in a static position, like the idea of representing reality, like if you stop and you take a picture and you think that that's the closest representation of reality, that's not true. It's not. That's not how we experience reality. And so like when I experience a building, let's say, or I tend, I tend in my experience to want to have the best vision of something in order to remember it. And so there's a. There's an angle, like a best angle by which I can. By which I can experience a building and remember it knowing that I'm moving. Right. So it's like I'm Walking in front of a building, and I'm seeing it from different sides as I'm moving. And so then I have a memory of that building. And that memory will just be in the best position of. To represent not just the building, but even the different aspects of the building building. And so I think that that's what's going on in. In orthodox art. It's like a compression, a compression of an experience that actually happens in. In. In time and in space, into one. Like, into one thing. But it's not like the Cubist, because the Cubist did it in an abstract way, did it in a kind of pushing it to a level which had nothing to do with human experience. But whereas I think the way it happens in icons has more to do with a. With a more embodied representation of how you. You kind of experience these buildings as you walk around them and these different objects and these different things, and not as this kind of stop in time and. And try to fix the world in one. One thing. But there are different theories about that. There's also this whole theory about inverse perspective, which I'm not so sure about, but that's. That's. Like I said, that's the way that I best understand it is. Is as this. The problem of representing reality in. So, for example, like a good idea. Like, for example, you'll see in icons and you'll see in ancient art this idea that things are represented bigger depending on their meaning rather than their actual distance in space. But it. But that's also closer to the way we actually experience reality in the sense that if I'm looking in the landscape and I'm focusing on something, like I'm focusing on one tree in the landscape, if I represent that in a painting, how can I tell you what I'm focusing on? Because if I just represented flatly as this picture that I just take a picture and there's this tree. But if I was focusing on this one tree, I need a way to show you that that's the important thing in the image. And so making it bigger is a totally intuitively normal way of doing that. It's like I'm saying this is the important thing in the image, right? Because I'm making it bigger, I'm bringing it closer to you, just like you actually experience that. So when you focus on something, you experience it as being closer to you. Even if it's further from you in space, you will experience it as being closer to you, to your experience than other things that are closer on your. In your perceptual. Field, but that you're not paying attention to. So anyway, so that those are the kind of things that I think are part of why they're represented that way. But it's not. It's not like a set thing. So what are your. So Susan Martin asked, what are your favorite movies that have positive or uplifting symbolism that are not part of the postmodern propaganda? Have you seen films like the Tree of Life or the Kingdom of Heaven or films by Tarkovsky? And so, I mean, I love, like, we talked about East Asian stuff. I love the Ghibli movies. I keep pointing people to that, especially if you have kids. All those movies are wonderful in terms of a. In terms of. Of a. Of a powerful storytelling. You know, I think, for example, like the Lion King by Disney was just right on. I. There's not a lot wrong with the Lion King in terms of kids movies especially. I did. Wasn't a big fan of the, of the Tree of Life, to be honest. I just. I just struggle to get through that. It's so. It seemed like disjointed to me. So Tarkovsky movies, I think, definitely are dealing with some very powerful things. I just watched nostalgia recently and it was tough. It was hard to get through because it was. It would really required a lot of attention, but it had some very powerful imagery in it as well. So. And I think, like, how can I say this? I think, like, despite the propaganda, let's give you an example. Like, so. So Marvel. Marvel movies are being completely invaded by propaganda. But like the story of. Of Tony Stark sacrificing himself using the Gauntlet at the end of the. The series, that was a great. That was a great move. Like, that was a great image of a Christian virtue embodied in a story. And so, and so I can still see a lot of the other crap that's going on, but I can also recognize that there is nonetheless, these little glimmers, you know, appear through that. So Matthew Mole Brandon says, can we use symbolism for democracy, freedom, as in the past, in a similar way as religious symbolism that connects to our meaning? The US the dollar bills are full of meaning, but now just ornaments. I'm not sure I totally understand your question. So let me say this. One of the things that the US has done that has helped it is trying to frame their democracy under God. So the idea of putting on the dollar bill and God we trust, a lot of people criticize that because they think, oh, it's money and it's stupid to put that there. But I think these are kind of last ditch efforts to unite the people under the transcendent reality. Because I think some people realized early on or maybe in the past century or so that democracy isn't enough. Like democracy can't hold a country together. And so you need to call upon something higher. So you need something to unite you, you. And so April, man, there's a lot of questions, guys. Not sure I'm going to get through these. Let's try. All right, so Louis Dura for $5 says, why was Adam made from dust? Why was Eve made from his rib? Deistic thinking would suggest God would have made them both out of nothing. Ha. Interesting. Well, no, they wouldn't. And so the idea that God made Adam out of dust is you, you want to understand, you know, emergence and you want to understand consciousness. That's what's going on. It's so, so God gathers in all the dust, gathers in multiplicity. That's what you are and that's what you do. You multiplicity gets gathered into a place and then the spirit of God is blown into man. So the meaning, the spirit, the invisible pattern gets injected into the gathered dust and that's what creates man. Right. And so at a lower level, that's how everything works. Like, that's how reality works. Because we can't, we don't create out of nothing. We only God creates out of nothing. We create out. We. At a lower level, we gather dust and we, we make, we condense it into unity. And so we, we can notice the multiplicity and unity in things and we participate in that coming together. So that's why Adam is made out of dust, because he is an image of all of creation in a way. He is a condensation of the bringing together multiplicity into unity. And then God asks him to do the same, let's say by naming the animals afterward. And then why was he made from his rib? So this has to do. There are different ways of understanding that. One is my favorite way of understanding is mostly the idea that Adam was cut in half. And that's probably, it's like it was made from his side is probably the way that I best like understanding that. So Adam. So it says in scripture that God created the male and female like God created them. God. God made the dust blew into the nostrils and, and God. And. But then in the first version it said that he created the male, male and female. So this like, ambiguity of how in a way, Adam contained both to get at the beginning and then was separated into, into two. And that's Kind of why it seems like the church fathers, like St. Gregory of Nietzsche, for example, says things, weird things, like how Eve was created as a provision for the fall. God having known that man would fall, is why Eve was created. So. Yeah, but like, there are different. St. John Chrysostom, for example, talks about how Eve was created out of the rib of man to be. To not be subject to him at the outset, but that they would be equals in like, maybe that Adam would have a role of primacy, of origin, but that Eve would be his equal in the way that they would interact. So. All right. So. Alan Tam, $5. Thank you. Phil Cohen, $10. I recently became academic, mostly due to your work, many years. To you and your family. Thank you, Phil. Thank you. So, Devin Shane for 499. So if you watch the Chosen and if so, what are your thoughts? Advice for a Protestant inquiring into orthodoxy. So I wasn't a big fan of that, I have to say. I watch it with my family and my, my wife really loved it and my son loved it. My daughter didn't like it. I, not. I, I didn't like it very much. I'm sorry. It's just hard. It's just hard to make a story with Jesus as a character. You're just very difficult. I'm not saying it's impossible. I'm not saying that. But it's just really hard because. And so I felt like that's. I felt like the Chosen was trying to make Christ into. Into just this, like, happy go, lucky hipster pastor. And it's just not, it's not working for me. Sorry. All right, so, so Ulysses k. Hughes for 5 Euro says, after your last video and your talks on the Divine Comedy, can you tell us some thoughts on Milton's Paradise Lost? I would, I would have to. I don't think I could wing that. I would definitely have to. I mean, I think maybe one day I will make a video on that. That I think it's important in the sense of. I think it plays a role. I talk about it a little bit in the Montero video where I definitely think the image of Satan the way that it's developed in, in Paradise Lost plays a role in modernity and, and kind of this understanding of this heroic Promethean devil. And so there's definitely that. But I would, I, I would have to. I would have to prepare myself because it's a big subject. So. Sorry. So the ABC 123-456-399 for $20 US says the symbolism of the ultimate angel treacherom, specifically the circle with the three wings on them on both sides below the main angel. What supposes the ultimate angel tetramorph, specifically the circle with the three wings on them, both side. I don't understand your question. Sorry, abc. Are you talking about the drawing that I did, like the ultimate angel Tetramorph, that the. The design and I'm not sure I understand the question. Sorry, man. All right, Stephen Anderson, for $8. Is there a connection to masculinity and hunting? Feminine being, farming? How one seeks out opportunity, the other creates environ? I don't think so. I don't think that there's. I don't think that there. That there's a relationship between that. I think that both in, let's say, hunting and in terms of farming, I think that there's. There's. There's both masculine and. And feminine in both of those. So. So, Noel. And you can think about it. Like, you could think about the masculine and feminine aspect of hunting. Be interesting. For example, you could think of. Of baiting as a kind of more feminine action in the sense of. Of seducing or drawing in or creating a place to attract. To kind of attract things, you know, to create an actual place. And then, you know, shooting an arrow or spear or something would be a more masculine action. So maybe that can make sense. All right. So, Noel Tham, for 4.99. Would you ever consider doing a vid on the Book of Enoch? Yeah, definitely. Definitely. I think especially now with like, all the. All the. The Lord of Spirit stuff going on, I'm kind of. I'm thinking that that's gonna happen at some point. It's so funny because I've been kind of avoiding talking about this stuff too explicitly because I felt like people weren't ready for it and they would just not understand what it's talking about. And, you know, it's like God has funny ways sometimes. And just like all of a sudden, like, the Lord of Spirits appears and it's like everybody's just rushing in. And I'm thinking, that's awesome. Like, it's wonderful. I'm really happy for that. So, yeah, definitely. I should probably do that. So. Courtney Wiley from 499. Love your work. I never see many women in your chats. Is it against Eastern Orthodox teaching for women to participate in this kind of discourse? I don't think so. I don't think that's what it's. I don't think that's what's going On. I think that. I mean, like, I. I've. I think that I would need to. I don't know why. It's hard to totally explain. I guess I would say this. Like, this is. There is. Okay, so I think that it's. It's normal. This is going to sound weird to a lot of people. Like, I'm not a preach. Like, I'm not an official person. I think it's inevitable that men should want to talk to men more than talk to women, and women should, in general want to talk to women more. Just sort of like a weird, healthy thing about relationships. And so I am always very, like. For example. I'll give you an example. Like, I'm always very cautious. I almost never will have, like, dinner or a coffee with a woman alone, unless it's like a very old lady. Like something that's very clear. But. But I'm very, like. I'm super careful about that stuff. And so it might be boiling out in my behavior online. It's possible. And I'm sorry if that's what's happening, but I did. I have had some conversations with some people, and there's a video with Dr. Paula Boddington which is coming out, which is coming out soon on AI again, and on the ethics of. She's also an expert on the ethics of AI, but also on the ethics of kind of biological, medical, bio stuff. And so there's a video coming out in the next few weeks on that. So that'll be. That'll be fun. So. So that might be what it is. I'm not sure. I don't totally. It's like, I actually just gotta move organically and just invite people and people that come on. On my horizon. I invite. I don't have a system, really. You guys are having me, like, trying to understand my own behavior here. All right, so process Raul from $5 says, hey, Jonathan, big fan of your videos. I wanted to get your opinion of orthodox theologian David Bentley Hart. I don't think that's. I. I don't. I don't. I'm not going to answer that question. I'm sorry. Process. I don't want to answer. If you have a question about specific things that he said, I will answer that question, but I'm not going to answer an opinion on him. That's. That. That's not a good idea, I think. All right, so don you go teeth for 7. 99. I think it's Australian. Mads Mason Bradford for $10. Australian. I think, in terms of symbolism, is there a Relationship between a train and a serpent. Interesting. I don't think so. I've never thought about it. I never thought about that. I'd have to think about it. Because it slithers, I guess, because it's flexible. Maybe I have to think about that. All right, so, James Schwartz, for $5, how might someone send you a piece of digital art? And would it be possible to hear your initial reaction live like this? It's always possible to send me stuff on email. You can find my email on my carving website. I don't kind of advertise it just outright, but you can find it if you're looking for it. Whether or not I'm going to answer just really depends on what I'm going through. Sometimes I get 20 messages a day of people kind of trying to get my attention for something. And so because of that, I've actually tended not to answer people. Not out of. Not because I don't want to. Just. Because if I do, I end up spending my whole day in front of the computer, which I already end up doing, despite that. And so, And I need to, like, I need to carve. And so I would say, like, in the past month, I haven't carved a lot because there's. Especially since the Jordan Peterson interview, there's been so many things that require my, like, attention and answer to. And, and, and so it's difficult. But if you send me something that's awesome, like, that's totally awesome, I'll answer. You know, it doesn't mean that if it's good. I doesn't mean that if I don't answer, it's bad. But if, but if it's. If it's like, astoundingly awesome, then I'll probably answer. So you can, you can give it a try. Rich Gray, can you help me with Christophanies in the Old Testament? I don't know how to answer that. It's a very vague question. I mean, the sense that, that there are images in the Old Testament which seem to point to the Incarnation. And so I, I would say that that's it. So, like, different images that, you know, like, let's say the. I'm trying to blank right now. My mind is drawing a blank. It's like the Old Testament is full of them. So, for example, like, the image of, like, okay, the image of the ancient of days with the Son of Man. And so it's like, that's a. That's an image of Christ that is kind of starting to appear. And so there are different versions of that. All right. So David Furtado says for 5 BRL, I know what that is. When reading the Bible, should we use the meaning of the words had back then or use today's meanings of the words? I mean, I think you need to, to use as much as possible, try to get the meaning of the word and the, the old meanings of the words. But ultimately you hope that the fathers and the saints and the translators and all these people have been able to transmit these in a way that is relevant today. And so it's not just a weird desire to be accurate because that doesn't, usually doesn't give much, so. Chandler Turner, $5 USD Most of those my age, mid-20s, who don't outright reject religion, there's a strong draw towards perennialism. What is the argument against it? I would say the easiest argument against perennialism is that it ends up acting as a weird pseudo religion. Like, it ends up acting as something which stands above religion. And then people can think that they're superior to religion in their perennial position. And so it ends up acting like a, like a weird prideful kind of idea that I, that I can, I can judge the other religions. And that's what you end up seeing with friendless, is that they, they're often like saying, well, this is, this is good here, this is bad here. This is, you know, they, they kind of have this strange, think they have this strange capacity to stand above everything and to, and to judge it. And I think that that's deadly for the soul, you know? You know, I don't, it's not a, it's not a real path. It's just like a weird abstraction. So, so that's what I would say, the bane argument, at least that I have against it, so. David Koziar for 1144 CID do you have any thoughts on Gnosticism and why God would be calling out, asking where Adam is in the garden? Could this be a demiurge, the false God speaking, since it's not omniscient? Thanks. So this is really, this is actually a really important question in the sense that everything that God does in scripture, everything that God says, every way that you see God in scripture is a condescension. And so the idea that God acts out in the world in a way that humans can understand, it doesn't mean that it's a demiurge or a false God. It just means that God, since God is the source of all reality, then God manifest himself at the level of reality that is appropriate to whatever God is. Wherever God is appearing in the world. And so we can't see these gestures or the fact that God appears as an angel, or that God appears in the burning bush, or that God appears in these different things, or as the glory of God that descends in the temple. We can't see that as a limiting of God, but rather just, let's say the just God revealing himself at the level where he's revealing himself and then pointing ultimately to something which transcend. Transcends that. That manifestation. So anyways, that's. That's the way I understand it. It's the best way I understand it. So the villain report for 49.99. Hello, Jonathan. I saw you speak on the issue of the resurrection being literal, but you laughed at the question and seemed to be unconcerned with it. Do you believe it's literal? Sorry, I'm laughing again. Villain report. How is that knowledge found? Thank you for your unique perspective. I don't know what that word means, the word literal. Like, do you mean that you. Okay, so if you mean that you'll be resurrected with the same body, the same. In the same. Can I say this at the same. With all the same limitations and characteristics that you have now, then no, that's not what the resurrection is obviously not. The resurrection is obviously more than just this body that I can. It's more. And so that. But the resurrection is real. It's not just a metaphor. It's not just a. It's not just a. And so. And so if you, when you read what's the way that St. Paul talks about spiritual bodies, I don't totally know what that completely means. I can have inklings of it. I can have intuitions of it. I can trust St. Paul enough. I can trust Christ enough to understand what that's kind of pointing to, but I don't completely see it. I can understand the story enough to trust that nothing is lost. How. Say it that way. That if the world is non. Dual, if, if reality, if reality exists, then there's a manner in which it exists in a totality of existence. And that totality has its own reality. And that includes bodies, and it includes body. But I don't totally. I can't completely see it. I have intuitions of it. And so I think that anybody who thinks that the resurrection just means. That just means that whatever I look at in the mirror, like the saggy thing that I look. This hairy saggy thing that I look at when I, When I'm looking at myself naked in the mirror, it's like if that's not what the resurrection is. I'm sorry to tell you. It's like it. That. That's not at all what. There's nothing. The transfigured Christ that appears in the gospel seems to be an image of the resurrected body. The ascending Christ who ascends into heaven seems to be an image of the resurrected body. And there are moments in the tradition. For example, Saint Seraphim of Sarov manifests shows to his inquirer what the resurrected body is. Is. Or what it would it. And, and what he manifests is like pure flame. And that's what the person sees. And so it's like there's. The resurrected body is not a. It's not an obvious thing. It's not a. It's not a. It's something you understand in the story, but you'll understand you can't understand in its reality until you experience it. And so I haven't experienced the resurrection. All right. I recall you saying, so John Lefebvre says, I recall you saying, you listen to Kanye as Jesus walks. Have you listened to Kendrick Lamar's good kid Mad City? He's steep in Christian symbolism and would love to hear it. So it's funny because I saw who was it I saw talk about that recently someone talked about that on Twitter. And I was sitting and I start. It was weird because I was in idiot. I wasn't thinking. I was sitting at the table and I was with my daughter and, and someone said, oh, this, this video, this album has like Christian symbolism and I would love to hear your take. So I'm like, okay, so I was drawing with her and so I, I like, I put it on, which was like the stupidest thing that I could have done. So I put it on and like after one minute I'm like, okay, let's turn this off. As I'm sitting here with my 13 year old daughter. And so no, I didn't finish listening to it. So, I mean I'm. I guess I'll listen to it at some point. I don't know, I just thought it was extremely. It started off let's say rather, rather crass and crude, which I'm not like, I understand, I'm not a, not a prude or anything, but. But I'll listen to it on my own time at some other point. So. Carlos Vargas for 499. Hey Jonathan. More news on God's Dog. It's coming, it's coming, it's coming. But I, I don't have it told. I don't have A definite date. All right, Patrick Morrison for $10 USD. Best wishes, Jonathan. Thank you. That Laura person 999, did he happen to see the Kanye and the Sunday service choir perform at DMX's memorial service? Interestingly, Kanye has been wearing a black veil at recent public events. I have not followed that, no. Like I, I really, I haven't followed, say I haven't followed Kanye's recent things. I know that he's getting a divorce and everything. You have to be careful a little bit because like, sometimes I feel like maybe. How can I say this? Like I said watch the fools and just be careful. Like I didn't say follow the fools or, you know, so, you know. Yeah, I think there's still, there's still some things that are going to come out of Kanye, but yeah. All right. So Guillaume for 6.99 Canadian asked me a question in French. Le Quebec dansonita, David, spiritual grab. And so sorry, Guillo, I'm gonna have to translate that in English because everybody, I would say 98 of the people watching this. So he says Quebec seems to be in a grave spiritual state, even existential state. Is there hope? I often have difficulty finding some. And how about. Guillaume, let me say this to you, is that I have, I have a similar thought and I think you've, if you've followed me, you know that I have this kind of despair regarding Quebec and the French speaking Canada. But Quebec has a way of moving in block. Like it has a weird tendency to kind of shift in. Everybody kind of shifts at the same time. And so there might be a shift on the horizon, who knows? You know, all we can do is plant seeds. And I've started like this is something that, you know, as Covid kind of winds down. I'm going to be emphasizing some more local stuff, French stuff. I started the French podcast with JP Marceau. If you go on my French channel, Jonathan Pageau francais, you will find we've already done, I think like five episodes of our podcast in French. And I'm going to start to be more present in French speaking world. So hopefully it'll help me be more connected to French Canadians at least. And hopefully we can plant some seeds for something. So Christian Stander asks, hi, Jonathan, please can you explain how God is at the same time the essence similar to the chair of the cup and also personified entity we talk to. So God is, is, is is not. It's three persons that's important to understand. And so God is infinite God. I mean God is not. Is, is, is Is the infinite. It's not the same as a chair. So it's not completely. It's not something that I can answer. I'm not good at this. Also at that kind of question. And then running out of steam as well. All right, so the new guy for 499, are there examples of warrior saints in the Christian tradition? And if so, does one stand out to you? Any who are literal, historic figures? For sure, yeah. I mean, I mean, for sure. Like, there's definitely St. George, who is kind of like the ultimate warrior saint, but there are other war saints and Demetrios, Saint Mercurius. There are plenty of them, and some of them were historical figures for sure. So the villain report goes back and says, did Christ actually resurrect in reality in the same way that I had breakfast this morning? In reality? Did it really happen? I want to believe, but I don't want to lie to get there. And so read the scripture. Okay. What's. What's written in scripture is what happened. So if, if that helps you, it's like, yes, Christ did resurrect in reality. And, and it's not exactly in the same way that you ate breakfast or the banality of your eating breakfast in this morning. It's not the same way because it, it. It doesn't have the same effect on reality that eating your breakfast in this morning had. It just doesn't. I, I can't. Sorry to read the story and look at what happens. Look at how the disciples don't recognize him, and then all of a sudden they recognize him. Look at how Christ appears in the room, you know, with all the doors closed. Look at how, look at how he ascends into heaven. He's standing there with the disciples, and he vanishes up, and then these two angels are there. It's like, that's not how you ate your breakfast this morning. I don't know what happens when you eat your breakfast, but that stuff doesn't happen when I eat my breakfast. And so, and so, yes, it definitely happened, but it's not at the same level as your breakfast. So I don't know how else to answer you, my friend. So, yeah, all right, I think we're done. I think we're done. Some of these keep coming in. I see symbolic memes is. Symbolic memes deserve that. I, That I look at his next question. So symbolic means for $5 says, how can perennialism become a religion? If revac is religion? That's not a religion. Clearly states it's not a religion with the cringe face. You're getting getting into trouble with, with, with my friend there, so. Yeah, exactly. All right, guys, so thanks for. Thanks for your. Thanks for your time, guys. I'm going to, I'm gonna go. I'm gonna go. And, and so thanks for your attention, everybody. This has been the longest Q and A I think that I've, that I've ever done. And so thanks for, thanks for attention. Thanks to Brad and to Jacob and to Lisa who were there doing all the dirty work of working on all your comments. And so I really appreciate it. I will see you guys next month. And so, everybody, thanks for your attention and I will see you next month. Bye. Bye. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pajot videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
