{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":0.24,"end":4,"speaker":"Jonathan Pageau","text":"I would like to welcome you to episode 24 of the Symbolic World Podcast."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":4.08,"end":8.96,"speaker":"Jonathan Pageau","text":"On this episode, I will be playing for you a discussion that I had with Nicholas Kotar."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":8.96,"end":16.52,"speaker":"Jonathan Pageau","text":"Nicholas Kotar is a fantasy author who writes stories that take a lot of."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":16.52,"end":23.08,"speaker":"Jonathan Pageau","text":"Its sources from Russian fairy tales and from ancient stories. And so he's a very interesting person. We talk about Tolkien, we talk about."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":23.08,"end":25.44,"speaker":"Jonathan Pageau","text":"Stories and how they fit in the world today."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":25.76,"end":43.52,"speaker":"Jonathan Pageau","text":"And so enjoy. This is Jonathan Peugeot. Welcome to the Symbolic World."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":53.93,"end":107.02,"speaker":"Jonathan Pageau","text":"I am here with Nicholas Kotar. I hope I'm saying that right. Nicholas is an author. He's a deacon in the Orthodox Church, but he's also an author of fantasy fiction. He's written articles for the Orthodox Art Journal, and I'm sure he's also a translator, and he's a smart guy. And I met him as he wrote an article for the Orthodox Arts Journal about the lives of the saints. And the way that he approached the lives of the saints through a different vision really excited me because it connected with the way I see storytelling as, let's say, as a structure around which reality kind of manifests itself. And he's also written some articles connecting the lives of the saints to Tolkien's work. And so a lot of interesting things to talk about. And so maybe, Nicholas, you can introduce yourself a little bit and maybe talk just briefly about the work that you're doing and the novels that you're writing, and then we'll go on with the interview."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":107.77,"end":416.76,"speaker":"Nicholas Kotar","text":"Okay. Well, the novels I'm writing come out of a very long period of thinking about the need for storytelling in the modern world and what that storytelling should look like. And it also comes from my own deep desire to tell the kinds of stories that Tolkien told because they've resonated with me and with so many people throughout these decades on a very, very profound level. When I went to seminary, I had to start to reassess a lot of my worldview, as odd as that might sound. In the seminary, usually you think you'd come in, you already have a worldview formed, but that's not the case. You have to come up against a lot of misconceptions that you might have, against a lot of difficult realities that the church manifests within the world, because it's a. It's not a purely divine institution that exists out there somewhere, but it's, you know, it's enmeshed together with humanity, with all. With all those problems. And one thing that I came up against, came up against again and again, was the reality of the church's way of storytelling and how it didn't mesh very well with. With the way the history is told nowadays. And it fascinated me. And I remembered my first encounter with this sort of disconnect between modern historiography and hagiography. I was still in college at that point in University of California, Berkeley. This was at a class of Russian, Eastern European and Eurasian studies. It was a kind of a survey course for undergraduates. And my professor was talking about the life of St. Vladimir, the baptizer of Rus. And he kind of laughed very, kind of provocatively at the idea that he could be a monogamist after his conversion to Christianity. Because for those who don't know, Vladimir was a famous womanizer. I mean, he was. And if any of you have had the pleasure of seeing the new Russian movie about his early life called Viking, highly recommended, by the way. It shows that aspect of his personality very well. He was kind of a more Viking than Rus, kind of a wild man, loved his women. But something happened after he converted, and at least this is the way the hagiography tells it. And I was really shocked that everybody seemed to laugh together with the professor in not accepting the possibility of this sea change in St. Vladimir. And it made me think and made me realize that basically. And I learned later on in more systematic fashion that modern historians consider most hagiography to be nothing more than legends. You'll see the icon of St. Eustace over there. I don't know if you can see it in detail, but he's very symbolic for me because his story of hunting the deer and finding the deer in the wood and catching it and then seeing the cross in the antlers and Christ from the cross begins to speak to him and convert him, appears in actually several different lives of saints. And because of that, St Christopher's sorry, St Eustace's life is considered to be legendary by the Catholic Church. So he is considered to not have existed. And that doesn't sit well with me because. Well, because that would mean you have to throw out more than one baby with the bathwater. So when I was in seminary, I started to study this more systematically. And I came across this disconnect in the modern mindset and a kind of inability to accept the reality of storytelling as it was always told throughout history and replacing it with this sort of positive, positivistic, scientific method way of thinking about history, where the only thing you can believe in are things that you can see in the primary sources or in the secondary sources, things that can be positively identified as having existed. And I had a problem with that because as a student of history, I know that you can't look at a document as a datum in the scientific sense, because it was written by a human being with his own preconceptions in a certain time period, which we don't understand very well. And if we don't try to encounter the point of view of the person writing those primary sources without stamping onto that person the preconceptions of the 21st century, then we're missing everything that that primary source might have to tell us. So actually, these lies of the saints, even though they are anachronistic, very often in the modern historiographical sense, they are actually telling us something very profound and something very deep, and they are telling something to us that is very true. And for that reason, the Orthodox Church, at least, has never shied away from its hagiographical tradition and continues to have, you know, the lives of the saints as part even of liturgy. So that's. That's where. Where I started to approach this question, and that's where I actually don't remember who approached me to write the essay, whether I approached you or what. But anyway, that's how. That's how it started."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":416.92,"end":452.85,"speaker":"Jonathan Pageau","text":"Right. No, I. I think that. I totally agree with you. I think that some. That's a place where we really connect in terms of the way we see the world. You know, when we. When we look at any ancient story, you. You know, people will read. Will try to. Let's say they'll read the Iliad, and then they'll try to parse out of the Iliad little bits that maybe they could use and then retell a historical version of what might have happened at Troy. You figure you have, why are you doing that? What is it helping you with?"}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":453.09,"end":458.68,"speaker":"Nicholas Kotar","text":"And in the process, missing the point of the Iliad completely. Right, not the Iliad anymore, but also."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":459.24,"end":499.49,"speaker":"Jonathan Pageau","text":"Missing the truth of the Iliad or the truth of the Trojan War in the sense that the way that the Greeks told the story of the Trojan War encompasses what that event was in their lives and in their society, what impact that event had in their society. So if you go back and now you try to mince it up and kind of pull out some little bit of historical fact, and you say, well, yes, we're so happy we found this historical nugget and you show it to the world, but now you don't understand why that story is the basis of a large part of Western civilization. You neither curated it of any importance."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":500.05,"end":669.06,"speaker":"Nicholas Kotar","text":"And you can't understand the story on its own terms. And you can't understand how it can inform your way of thinking. Or your way of dealing with the outside world. Which is the point of literature on some level as well. So, yeah, and this sort of. There's an interesting philosopher whom I haven't read too much, but just a little bit. Hans Georg Gadamer, who's a mid 20th century philosopher. And he talks about this approach towards history. And he says that it's like having a conversation with someone where you're staring at that person and you're not talking to him. You're just letting them talk with a little notebook. And you're writing down everything that they say. And staring at the way that their eyebrows move up. And, you know, his hand moved that way. Let me write that down. It's important. And you're not talking. And so history is. You're examining history as though it's some sort of a specimen. While he says that a much more holistic. A much more intelligent and much more productive way of viewing history is to actually have a conversation with it. Which means actually listening to it and then providing your input in the middle. You know, this sort of image of a conversation between two people. Meaning you come with your preconceived notions. But then you also listen to the preconceptions of the people in that distant time period. And kind of transcending time in that conversation. And that's really what history should be. You should be encountering people from a very distant time period. In a way that makes them very real to you. And in a way that can inform your own perspective. And your own experience of the world around you. And it's a way to make the world around you a more vivid and a more living place. Which is a problem nowadays, I think, because we do notice that people are retreating from the natural world. They're not seeing the world around them in very clear and very beautiful colors. They're retreating to the comfort of their computers. And to the comfort of the virtual realities and augmented realities. I mean, I don't know if you read this or not, but there was this essay about underestimating America's collapse that came out a few days ago. I forgot who wrote it. But it's another one of these doom and gloom things. But what was interesting is it was picked up by the American conservative. And I think it was Rod Dreher that added a little bit of his own context to it. And he said. He noted this. I'm sorry I mentioned this. This is really bringing the conversation a little bit down from the heights of history. But he showed a. A tracker of the number of views on. On pornhub during the missile disaster in Hawaii and right before it happened. It was at some, like, extremely low point. Nobody was doing anything because that was when the warning was going out and everybody was freaking out. Nobody was on pornhub. And as soon as the warning was revealed to be fake, the number of users of pornhub shot up an incredible percent compared to the user data for the last week before and last week after. It was completely incomparable."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":669.06,"end":673.7,"speaker":"Jonathan Pageau","text":"They were finding their religion, they were finding their relief where they tend to look for it."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":674.02,"end":696.33,"speaker":"Nicholas Kotar","text":"Exactly. Yeah. And this is. I put to you that this is a direct result of looking at history and looking at the world in this sort of incorrect, Hans Ger Gadamer way of looking at it, trying to examine it and seeing what you can. What you need to get out of it and using it for your own advantage, rather than having a conversation with history, with literature, in a way that you can learn the perspective of people from a different time period and help that inform the way you live."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":696.49,"end":756.61,"speaker":"Jonathan Pageau","text":"Yeah. And I think that the way you live is really the right way to see it. That is the purpose of studying these stories. The purpose of telling these stories isn't just to gather all these. All this data and facts. Who knows exactly why you're doing it. The purpose is to find ways to live, find warnings about how not to live, and also to, let's say, create a kind of glue which holds your world together. You know, I always talk about the patterns that inform a world. And when you read fairy tales, when you read old stories, when you read the Bible especially, and you encounter that in liturgy. In liturgy, because you live it, you know, you're physically engaged with it. It's almost like you're fine tuning your perceptions and you're fine tuning your soul to be living in a. You know, in a. In a proper. Or let's say at least a colorful and alive in a live manner instead of this dreary. Yeah, this dreary."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":757.89,"end":1012.6,"speaker":"Nicholas Kotar","text":"It didn't use. It didn't used to be a problem. Right. I mean, this is something that people did naturally before. It seems to be an issue with the modern, postmodern, whatever human being. But it used to be natural because people were raised with these stories, and these stories have been retold in basically the same format since this. Well, since we have written records before we've written records. I mean, a lot of these stories come from oral tradition. And it's interesting. I've thought about this a lot, and it seems to me that part of the reason that the west has lost this connection with his stories is of course, it's lost its connection with its Christianity and in the reality of the world today is that. And part of the disconnect between people who consider themselves churchy, so to speak, and people who are spiritual but not religious maybe, is that the worldviews are so marked different that you could be having a conversation. And I'm not talking about having conversations with somebody in the past. I'm talking about having a normal conversation with somebody across the table. You could be using the same words, the same language, and the person across from the table doesn't understand you at all. Or they think they do, but they don't. And you have basically people talking across from each other. And you see this in the ideological warfare that we see or in that famous Cathy Newman Jordan Peterson interview, which, which was, you know, tremendous. But, but, you know, and, and I'm interested in transcending that, that gap. You know, personally, that's why I write the stories that I do, to bring it back full circle to what we're talking about originally. And I find that, that the medium of fairy tales in particular, and it's not just me that thinks this, but I find them to be particularly effective for people now because they. Because people are no longer interested or moved by the traditional religious narrative, Whether it's Christian, whether it's. Whatever, it doesn't matter. But people still respond at a. On a very intrinsic level to the questions posed by fairy tales. And this is something that. For example, there's a Russian philosopher by the name of Ivan Ilyin who lived in the late 19th, early 20th century, who writes a lot about Russian fairy tales. And he has a. He has an article on the spiritual meaning of fairy tales that I've translated, that's on my website. And he basically says if I can quote him a little bit. He says that the fairy tale. He's talking specifically about the Russian fairy tale, but it's true of any fairy tale. He says that it asks questions like this. Sorry? Oh, yes, questions like this. What is happiness? Is it enriches or not? Is it in love or is it in freedom? Is it perhaps in goodness and righteousness? What is self sacrificing? Leaven? Why is it important? What is fate? What does it mean that smart people often get the wrong end of the stick and idiots get happiness? I mean, these are very Very profound questions that we sometimes don't even think about on a rational level, but that worry us on a very, very deep and intrinsic level. And to tell. To write novels from the perspective of these stories is to talk about those same questions that Dostoevsky was talking about in the 19th century or any of the great realistic novelists of the 18th, 19th and early 20th centuries, but in a way that I think now accesses people's experiences in a more direct way. Because I don't think that realistic fiction has the same power to move people as it did in the 19th century, for whatever reason. Maybe it's because we've gotten to a point where style trumps substance. I mean, some of the Pulitzer Prize winners of the last few years in particular. I'm thinking of the Goldfinch. I don't know if you've ever read it by Donna Tartt. It won in 2007, I think, if I remember correctly. But, I mean, I couldn't get through 100 pages of it. It was like. It was a long exercise in writing pretty sentences that while the characters were doing extremely stupid, juvenile things to each other and just people would just like. Like the Russians say, like a hamster in a wheel, just making the same mistakes over and over and over and over again, not learning from them and just being extremely unpleasant throughout the whole process. But it's described in incredibly beautiful language. So you're supposed to be moved by it. And I just felt like throwing it against the wall."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":1015.64,"end":1049.3,"speaker":"Jonathan Pageau","text":"So maybe you can tell us a little about. Because I've been. My solution, let's say, to the problem that we're talking about, you know, now has been visual art, you know, going back to traditional iconography, to medieval image in the west and Orthodox icon in general, and trying to use a. The traditional languages into, let's say, a coherent visual language for today. Doing these videos, trying to get people to wake up to this. So I'd like to. Maybe you could bit of how. Because you're writing these novels. So maybe you can tell us a little about your process and especially about how you. You're trying to bridge this gap with your. With your novel that you're working on."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":1049.94,"end":1079.68,"speaker":"Nicholas Kotar","text":"Well, for me, it's. It's all it goes. Because my first experience with the fantasy genre was, but mostly Tolkien, because he told a kind of story that seemed to suggest a lot more than it was written on the page and initially drove me kind of crazy because I'm reading this and I feel. I'm feeling the level of, well, not quite Scripture, but certainly great literature because there's. And it's talking about such, such profound truths and to me, how he did it. So I started to study him a lot just in my own being. His, his critical literature and his essay on fairy stories."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":1079.68,"end":1080,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":1080.4,"end":1134.29,"speaker":"Nicholas Kotar","text":"Which I used in my, in my third article for, for the Lies of Saints series. He has a very interesting. And I'm not sure how. How folklorists consider him in terms of his method, fairy tales, but I don't care because the way he. The function of fairy tale makes so much intrinsic. And it really spoke to me as a writer, so I thought I would somehow repeat his process. And basically what he talks about fairy tale has. Has something going for it that's, that's very helpful in terms of getting a message across if about it in that sense, and that's that it has something called arresting strangeness. I love this phrase that he used. It stops you in your tracks because of its strangeness, but it, but it forces you to stop and reassess what you're looking at. But what's interesting is that he doesn't then go and say the arresting strangeness is what it is for its own sake. Meaning we're not creating a Pandora, like, like what's his name?"}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":1135.25,"end":1136.77,"speaker":"Jonathan Pageau","text":"Salvador Dali, let's say."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":1137.33,"end":1247.44,"speaker":"Nicholas Kotar","text":"Right, okay, yeah. No, but I specifically said Pandora because the Avatar, the movie Avatar, because people after they had. They had watched that they were having withdrawal syndrome or whatever. Like they couldn't. They couldn't not be in the, in the imagined fake world of Pandora. Like they couldn't come back into the real world. And that's. That's fantasy gone bad, and that's. That's arresting strangeness for its own sake. Right, but Tolkien says arresting strangeness has a point. And the point is that it stops you and it forces you to look at the world that you are in and to notice it anew and to notice it with fresh eyes and with fresh glasses on, so to speak. And what that does is it not only forces you to reassess your relationship with the created world around you, but it makes you listen to what that created world is telling you. And what fairy tales do, and rather what fantasy does in Tolkien's system, is that it tells the kind story that was actually reflected in history with the incarnation of Christ, but it also reflects in a kind of weird. Not in terms of history, but not in the kind of. In the way that we are trained to look at history. But basically, the incarnation of Christ is the myth that came true. It's the bringing down into history of all of the myths that have been told before the coming of Christ and all of the stories that were told, the happy ending stories that were told after his resurrection and ascension. So it's a kind of view of history that is starting from a middle point and going outwards like ripples in a pond, as opposed to starting at a single point sometime in our past and moving forward towards some sort of progressive future, which is the way we tend to look at history nowadays. And it's not a very helpful way. And it's certainly not, it's certainly not the way that man used to look at history in the Middle Ages. There's a great article by Evgeny Vodolaskin, who wrote the novel Loris, which is."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":1248.32,"end":1255.91,"speaker":"Jonathan Pageau","text":"Yeah, everybody's read that. By the way, if people are asking for a reading list, Loras read Loris. It's a, it's an amazing book."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":1256.31,"end":1397.59,"speaker":"Nicholas Kotar","text":"Yeah. And he's talking about how the medieval man looked at history not as a circle because then there would be nothing more than repeating patterns that we can never get out of it. And that's pretty depressing. Day of history but as a helix, like a helix where it's something. There's a repeating pattern happening throughout history where events repeat themselves, but they repeat themselves in a different time and in slightly different meaning. But the previous event that it kind of echoes is no less important and is no less real, even if it never happened. And that's what's so interesting about this view of history, is that actually medieval man didn't write fiction. Writing fiction was a sin. But at the same time, medieval man accepted the fact that these lives of the saints might have some things that kind of don't jive with, with, with reality because they, their experience of the divine was something that happened on a very everyday level. Like they. Everything that happened to them, whether it's weather, whether it's the things that happen to you in your life, is a manifestation of the presence of God. And so for them, looking at these, reading these stories is a reflection of reality. Even though these things might not be true, they are true because they express something very true about the human condition. And even if they're not positivistically true, meaning they never happened in terms of our modern view of history, it doesn't make them any less less true. And actually, of all people, Neil Gaiman talks about this a lot in his lectures, which is fascinating to me because I don't think he's particularly religious guy, but it's just there's something about fairy tales, and Tolkien captures it in a very profound way because he basically says that man, as a created species, has a responsibility to tell stories, because by doing that, he is creating a secondary world in his stories. And in that secondary world, he can populate that secondary world with reflections of the primary world truth, so to speak, that makes people reassess those truths in a new light because of the arresting strangeness. And so the eternal truths about the human condition can then be understood in ways that perhaps somebody wouldn't be able to accept listening to a sermon or listening to somebody just speaking to them across the table."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":1398.71,"end":1399.43,"speaker":"Jonathan Pageau","text":"Sorry about that."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":1399.83,"end":1400.39,"speaker":"Nicholas Kotar","text":"Cheers."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":1401.11,"end":1453.37,"speaker":"Jonathan Pageau","text":"It's good that you mentioned Gaiman. I think it's important to understand, when I look at Neil Gaiman's work, I feel like he had a very, very profound intuition at some point about the structure of the world and about the structure of stories. Not just him, but other people who come from the comic world, like Alan Moore as well. But just like, let's say. Let's say radical feminism today, they also have had a strange symbolic vision, let's say, or an understanding of the symbolic world. It's just that they're exploring the fringes of it and they. They tend to glorify the fringe aspect. And so that's why Gaiman talks about. That's why his characters are, you know, like the dream master and Anansi the spider, the trickster, all. All these figures that exist in the buffer zones of reality. And I think it's important because in a way, that's where we are today, in the world."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":1453.53,"end":1454.41,"speaker":"Nicholas Kotar","text":"Oh, yeah, absolutely."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":1454.65,"end":1483.8,"speaker":"Jonathan Pageau","text":"But finding a balance where that, let's say, chaotic dream like world and the more inverted trickster world has a place, but then connecting it also to the more heroic figure, or, let's say, the memory of our traditions and has to happen, or else, you know, we're going to. We're going to get stuck in Anansi's web and then that's the end of the west for us. You know, Anansi's all great with his stories, but if you get stuck in his web, you're dead."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":1483.8,"end":1565,"speaker":"Nicholas Kotar","text":"Yeah, you're dead. Yeah. Well, no. And that's what's so interesting about fantasy right now. I do maintain that it's a very powerful genre, but it's not. Not all of fantasy is able to do that particularly well. Particularly well. And certainly almost no modern fantasy is trying to take the journey back from the fringes to the center. All of it is sort of glorying in Uncovering the ugliness of the fringes. In particular, there's this fantastic series by a writer, her name is N.K. jemisin. It's called the Broken Earth series. It's basically a symbolic retelling of slavery in the US but it kind of moved into a far distant future where the slavery aspect is flipped around and the dominant race is dark skinned and the slave race is white skinned. But basically it's her working through her experience of being a black woman in the United States and all the racism that she has to deal with. And it's not able to go very far at the end of the series in terms of coming up with any sort of world altering solution to this problem. It stays at the fringes, it finds some sort of transcendence, but it's not able to go very far. So since we're talking about my books, this is ultimately what I'm trying to do with my novels. And this is why give us the title?"}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":1565,"end":1571.68,"speaker":"Jonathan Pageau","text":"Because people that don't know, like, tell us what the title do not give us a. Give us a little glimpse of what you're doing so people can know what to look for."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":1572.16,"end":1690.04,"speaker":"Nicholas Kotar","text":"Okay. Well, my first novel is called the Song of the Siren. The siren being not the siren of Greek legends, but kind of an inversion of that. She is an amalgam, a half woman, half bird creature. But rather than being someone whose song drives you insane, she's someone from Russian mythology or kind of folk mythology who calls. She can, her song can drive somebody insane, but it's the kind of insanity that drives them away from the world and towards paradise. So she's a bird of paradise that occasionally comes down to the world and sings to certain chosen individuals who then can't rest until they either hear the music again or until they leave the world entirely with. With their bodies and their spirits kind of ascend upwards. So her song kind of erupts into the world, into my secondary world, which is a kind of fantasy version of Old Rus, 9th, 10th, 11th century. And the main character hears the song and he's unable to rest until he does something with it. But basically he's the hero figure. But this is not a traditional hero story. It's very much a kind of a breakdown of the hero story in the sense that he does have to go on a journey from the fringes to the center, but his journey is extremely convoluted. He's a reflection of me in a lot of ways. It's constantly making mistakes and constantly trying to get back to the center. But Constantly being drawn back to the fringes for various reasons. The series at large, a five volume series. The title of the whole series is called Ravenson, which is kind of a pun. It has to do with something that happens in book one. So I'm not going to tell you why it's called Ravenson, but it does have to do with the Raven. The Raven being this kind of demonic figure in Russian fairy tales who plays a very important role in shaking up the world of my main character and forcing him to reassess his reality and try to find the truth. And you. Which is what we've been talking about. So."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":1692.04,"end":1742.61,"speaker":"Jonathan Pageau","text":"Well, so maybe. Yeah, so I. Maybe you can tell us a little bit about Russian fairy tales because one of the things that has, you know, my wife is from Slovakia and one of the great things about, about meeting her, I mean, obviously that's. You can't limit it to that. But one of the great things about meeting her was discovering Slavic fairy tales and so moving, you know, in my. As I talk to her mother and she showed me these, these old books of kind of Slovak and Czech fairy tales and discovering characters like Baba Yaga and all these amazing characters and finally discovering Russian fairy tales and the Firebird and all the amazing stories there. So maybe you can tell us a little bit about your connection to and maybe how Russian fairy tales differ a little bit from the Western fairy tales and how you're trying to plunge into that."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":1743.57,"end":2036.09,"speaker":"Nicholas Kotar","text":"Yeah, absolutely. I mean, I grew up in them. My first memories are of my parents telling me these stories before I went to bed. I mean, they're my most vivid memories. I still remember the books that I used to leaf through even before I could read the pictures in them. And a lot of those drawings and paintings are so vividly still stuck in my head that they come out in actual form in my writing. I mean, I actually paint with words those pictures that I remember from my childhood. But they're really interesting. I find them very useful not only because I stew in them so it comes out whether I like it or not, but because they're different enough. First of all, they're similar enough to northern European fairy tales, like Scandinavian or German fairy tales that people can read them and say, oh, I kind of remember this sort of idea particularly there's this story about the dragon's heart. I think it's an old German story about how there's this evil dragon and he can only be killed if you find his heart, but his heart is. Is stuck inside a chest and the chest is on Top of a tree and like. There's these levels of like or it's in a needle and the needle's in an egg and the egg is in the chest and the chest on top of a tree. Right. So that motif happens in Russian fairy tales as well, very often. And it has to do with this character called the Deathless One who's constantly dying and coming back to life. Like in every fairy tale, the Deathless One dies, but in the next fairy tale he's back again. So it's just very interesting. But in particular, what I find so fascinating about these is that they are not traditional good versus evil tales at all. At all. They're very messy. The main characters do really stupid things and a lot of times they're complete morons. In particular, the famous one that informs my first book is one of the many versions of Prince Ivan and the Gray wolf. Prince Ivan is a sniveling idiot who's constantly whining. The only thing that ever happens to him is comes through the agency of this wolf. And we have no idea why this wolf is helping him, he just does. And so there's this. There's this wildness about the stories, this sort of wild chaos that can be good or it can be bad. And it depends very much. It depends very much on sort of the spiritual state of the main character. And this is particularly visible in the. In the Ivan the Idiot stories because, well, they're fascinating in a historical sense as well. But the Ivan the Idiot story is. It's basically the youngest son in a family of boys. And he's the one, he's lazy. He's literally described as rubbing the snot off his nose with the sleeve. I mean, these images are just. And he sleeps on the petchka on the Russian stove which has a ledge which is warm. The lazy people, all they ever do is sleep on the ledge. Lazy people and cats, that's the place for lazy people in cats. So all he ever does is sleep there. And yet when push comes to shove, he gets the princess, he beats the evil Tsar, which is a different conversation that has to do with Russian history and all that. And it's not because he's an idiot. It's because he's not tied to the rule bound world of logic, of consequence. He's connected to something different. Like he leads with his heart. And so things happen to him because he's connected on some level to. To the spiritual world. And the spiritual world works through him because he's not an empty vessel so much as he's able to let it kind of channel through him. And Baba Yaga is a wonderful example of this because she can eat you or she can give you the magical help to go and defeat the big bad guy. And it all depends on who you are. First of all, if you're a woman or a man, traditionally, she eats the boys and helps the girls, which is interesting in its own right. But also, you have to. You have to go through different kinds of ordeals before she can help you. And this is all very connected to Russian paganism, actually. And if we go back to Ivan Ilyin, what's so fascinating about these Russian fairy tales, the way he looks at them, is that they are a bridge between the cultural world of Russian paganism and the cultural world of Russian Christianity. And they have a bit of both. And if we. Tolkien writes about this, too in his famous essay on the Monsters and the Critics, where he talks about Beowulf and how Beowulf, although written by a Christian, possibly a Christian monk, celebrates the beauty of the old wistfully, with a kind of sense of impending loss, without willing to throw out all of the old as being inherently bad because it's connected to paganism. He celebrates the sort of the raw, savage beauty of it, but also celebrates the inevitable transformation of that raw savagery into something that can be tamed and yet retain that. That ember of wildness at its heart. And that's. That's. Russian fairy tales do that very well. They, they. They live in this world that if you study folk history, in particular Russian paganism, they live in a pagan world, but the characters oftentimes do Christian things. So it's."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":2036.17,"end":2107.56,"speaker":"Jonathan Pageau","text":"I think that that's really. If. When Christianity goes right, that's what happens. It seems like one of the things that Christ does. We talk about this in the Orthodox Church a lot is the possibility of taking the world and baptizing it and then taking out of it those things that can continue on and that aren't so wild that they're useless, but that they can participate in the world. And so it seems like the best of Christianity in the Celtic world and in the Northern European world, but also in Rome, too. We're used to the Roman Christianity because it becomes, let's say, the mainframe for Christianity. But a lot of the Roman world was taken into the church and, let's say, transformed so that it could be the vehicle for a civilization, basically, that continued on until today, really. And so that's really. When Christianity goes right, that's what it can do. Is take these stories and bring them into even the Scandinavian stories. People always. I always have these neo pagans come to me and. And talk about, oh, you know, Odin and this and all the old pagan stories. And I just laughing in my mind and thinking, do you know who wrote your stories? Christians wrote your stories."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":2107.88,"end":2109,"speaker":"Nicholas Kotar","text":"Not pagans."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":2109,"end":2125.08,"speaker":"Jonathan Pageau","text":"Christians wrote your stories. They're the ones who transmitted them. They're the ones who made them participate in Western Europe and became part of the thread of the great story of Western Europe. And so you have to at least acknowledge that before you tell me about Odin and hanging on his tree, you know."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":2125.08,"end":2154.39,"speaker":"Nicholas Kotar","text":"Well, I mean, that's the. Hang on the tree thing is, you know, you can only really appreciate the beauty of that story if you're looking at history in the way that those people who wrote those stories intended. Where the central point of history is not the deep past, it's the eruption of the divine into the human, and everything rippled out from that. Like I was saying. So Odin hanging from a tree is an echo, even though it's in the past, technically. Right. It's still an echo of the story of Christ because it's, you know, time doesn't matter, not in that sense."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":2154.55,"end":2224.97,"speaker":"Jonathan Pageau","text":"And you also have to. You also kind of have to see that the reason why the. Let's say the Christians wrote it down when the Scandinavians converted to Christianity was also probably. Because there are probably innumerable versions of the story of Odin. One, A few of them got written down, and those that got written down were the ones that were, let's say, capable of emerging into this new world that was taking form. You know, and so that's something that is. That really needs to be understood. Because when you encounter oral. Let's say you encounter oral traditions and oral cultures, you'll see that their culture, their stories are so. Are multiple, and there's so many versions of them. When they get written down. The question is, why was that version written down? And then the whole worldview comes into. Comes into. So the stories. I'm. I love the Scandinavian stories as much as I love the Russian stories because I can see in them, you know, like you said, a preservation of this kind of chaotic wildness, but then also a connection to a more. A more ordered and let's say tame world at the same time. So hopefully that we can. What we can all do well."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":2224.97,"end":2336.21,"speaker":"Nicholas Kotar","text":"Yeah. And at the end, the important thing, and this is where Tolkien comes, comes back again, is that every one of the stories, even if they. Even if they have chaotic middles, they always end happily. And that there is a lot. There's a lot to be said about the happy ending on a sort of almost ontological level. I hope I'm using that word right. But it's because. And Tolkien even says that the best. That the only good. If you want your story to be good, you have to give it a happy ending, because. And it has to be a very specific kind of happy ending. He talks about something called the EU Catastrophe. And it's a fascinating thing because the Yukatastrophe for him is basically everything is everything to the main character. Everything that can possibly happen, everything bad that can possibly happen to the main character happens. And it comes to a point where there is absolutely no hope and there's nothing he can do about it. And at the last second, there's a turn and something ineffable or something without it being deus ex machina. It's not that. It's just something. Whether it's circumstances, whether it's he himself or whether it's people around him, something shifts and suddenly that all falls away and he's able to come out triumphant. And not only is that a reflection, of course, of the. Of the cross and then the resurrection, but it's also, on a very deep level, a reflection of the human experience, because how. How often do we, human beings have to go through absolute hell before we. Before that little turn happens, and that that terrible thing that happened to us then starts to make sense and gives us the kind of meaning that then will let us not only live on, but to make something of our lives that is beautiful for ourselves and for those who are. Who live around us and for those who see us. And on those different levels, the happy ending works, and it's very important. So, yes, tragedy in the Greek sense has its place in literature, but the best kinds of stories will always have happy ending. Tolkien says. And I totally agree."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":2336.53,"end":2401.09,"speaker":"Jonathan Pageau","text":"No, and I think I agree. And I think that it's something that I had never really thought about specifically, but it makes sense in terms. If you look at Dante and you look at, let's say, if you see Dante's story as a bringing together of all the threads of medieval Christianity into kind of one massive story, you really see that. You really see exactly that story that you're talking about. He really frames it well, that basic descent and then ascent, which now is everywhere. You watch any movie, it always is the basic structure of a story. And people are so used to it that they've actually stopped seeing it. They just almost expect it. And they don't understand that that basic frame, which is really a Christian frame, has become their worldview. And if you remove Christianity, let's say, from the picture, you might tumble back into the very gloomy underworld of Greek thinking or pagan thinking in general."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":2401.81,"end":2519.78,"speaker":"Nicholas Kotar","text":"Well, yeah, and it's true, and it's sort of disingenuous. I think of a lot of people to exist in this story framework and to consciously reject the narrative of Christianity because of exactly what you said. But at the same time, I think that, that the stories should still be told in that way because the reality of that and its reflection in the patterns of our own lives is something that's so profound that if perhaps repeated enough times and done. Done in a good enough way. And I'm talking about making writing really, really good literature here. I'm talking about the kind of. Kind of fantasy that isn't just repeating the structure that Tolkien gave to the genre. There's something about. People talk about fantasy being Tolkien esque, so to speak, and that there's this certain kind of fantasy that's now no longer in vogue. But it's not Tolkien esque, actually. It's more Terry Brooks esque because Terry Brooks, what he did, this is incredible, but he took the Lord of the Rings story and he rewrote it almost scene for scene, but with different characters. And unfortunately, without the deep, profound underlying structure of Tolkien's secondary world. Because Tolkien had been writing that world throughout his life and he had been creating that mythology for himself and for his country. I mean, it was, it was literally a mythology for England. He had been doing it his whole life. So when Terry Brooks took this and made it more bite sized, everybody took after him. So all the elves and the dwarves and the orcs and all that stuff we see recycled over and over again. And even the, even the wizard figure, the halfling figure, the, you know, the young man, the ingenue who has to come out and find himself in the world. And I mean, the ending of this sort of Shannara is remarkably banal. I mean, compared to what happens in, in the Lord of the Rings, it's basically a message of self realization. Like, you know, I am what I am who I am, and that's great. No, sorry, you've missed the point. You've gone through a thousand. You've gone through a thousand pages of this, you know, terrible ordeals, and all you can come up with is that I am who I am. That's lovely. Okay."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":2523.38,"end":2610.49,"speaker":"Jonathan Pageau","text":"One of the things about Tolkien that I really appreciate And I think one of the reasons why he can also give us a solution to the morass we're in is that he creates a hierarchy, let's say, of, you know, of beings. You know, he creates this, this traditional, really is like a traditional hierarchy of beings that kind of ascend and up to the creator figure. But what he also does is he, he spends the whole book, the Lord of the Rings, talking about the value of the lowest rung of that hierarchy and how the, let's say the periphery is, can act as a frame and a guardian, let's say, or a holder of the tradition, and is the one that's able to kind of carry it through to the end of the story. And so the Hobbit is the only one who can carry this ring, this periphery, and bring it to its, you know, being able to, let's say, throw it into the fire so that it doesn't consume the world and then kind of restart the world. So it's not. And so that's why the hero figure in the Lord of the Rings isn't, you know, Eragon isn't the king, although he's important in the story. It's the smallest figure who then is able to restart the whole story. And so to me, that kind of helps us. It's something, it's a lesson for our age, let's say, to try to understand the places in the margin and the periphery that can help us to flip things back on their feet, let's say."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":2611.28,"end":2767.41,"speaker":"Nicholas Kotar","text":"Well, yeah, well, what's, what's so interesting about that is that it was largely an accident that Tolkien included the Hobbits in his larger, in his larger world because he wrote the Hobbit as a separate thing and it gradually became part of the larger mythos. But it was possibly the most brilliant thing that he ever did because they're so grounded in everyday reality, they're so set apart from the, from the epic that inhabits the world of the Silmarillion, for example, and yet they're within it and they're part of that world. And even though they are 19th century English gentlemen from the country, they're still encountering the kings of old. And for our time, this is why, this is why it's such a popular book, is because whether he intended to or not, he was able to exactly do that, to talk about the exalted things, the epic things, the really true things about the heart, but through the prism of the small men of the smallest person, you know, and if there's one line in the movie that I can sort of, I mean, it's kind of cliche, but it, but it's true. It reflects Tolkien's worldview even if, even if it's spoken in the language of self, self help books. But it's when Galadriel tells Frodo even the smallest person can make a difference. And of course, if you take it out of its context, it sounds like, yeah, go, you know, go to the serious self help. I'll pull out a book and you can become a bestseller in five seconds. But it's not that. It's that even the downtrodden, even those who have no hope, even those who are the literally smallest, who have no strength, they can topple kingdoms, but it's not because of them. It's because they are able to put their trust into the larger story. And Sam talks about this incredibly on the way to Mordor when they're about to lose faith. He reminds Frodo that they are actors in a larger story and that they are going to be sung about, that people are going to sing about them later as, as members of that larger story. And they're no longer going to be Halflings, but they're going to be legends. But in the dirty reality of real life, they have to just one foot in front of the other, one foot in front of the other, do what you have to because this is, this is what you have been given. This is your duty. And Tolkien was very big on duty. And if that's all you need to do. And in the end, even though Frodo cannot do what he's supposed to do, he fails, right? He's not the hero. He fails, right? And some people consider Gollum taking the Ring and falling off as being the biggest cop out in the history of literature. But actually it's a very realistic and very accurate depiction on purpose by Tolkien of the way that providence works in this fallen world of shadows."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":2768.29,"end":2809.59,"speaker":"Jonathan Pageau","text":"Because also if you see Gollum as a, if you see Gollum as a kind of mere reflection of Frodo, I think that's not, it's not a strange way to see it. You can almost see Gollum as the dark side of Frodo. Like they're just one being. There are hints in the story that show that Gollum is what Frodo could become if he let himself go. And so the fact that at the end it's kind of like death, you know, the idea of conquering death by death and how this dark fallen figure finally, you know, even despite himself, is the one who Goes. Goes into the fire with the ring. And it's as if, you know, as if also his dark side is going into the fire with that ring as well. So I don't think it's a cop out at all. I think it's a great."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":2809.59,"end":2810.03,"speaker":"Nicholas Kotar","text":"I agree."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":2811.23,"end":2812.03,"speaker":"Jonathan Pageau","text":"Great idea."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":2812.27,"end":2814.15,"speaker":"Nicholas Kotar","text":"No, I do too. Yeah, for sure."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":2814.15,"end":2839.67,"speaker":"Jonathan Pageau","text":"All right, so look, we've been going for about an hour and so we've got some great stuff. We should probably do this again. Another conversation. But maybe just to finish us off, just tell people again the title of your series, of your books where they can get them and also where they can connect with you online. I know you've got a website and you got a blog. You're doing all this stuff. So maybe give us your shout outs and we'll set up another conversation at some point."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":2839.91,"end":2899.05,"speaker":"Nicholas Kotar","text":"Okay, sounds great. Okay, so the series is the Raven Son series. You can find it anywhere where books are sold on Amazon in particular, I do have paperback versions. For those of you who think that independently published authors only do ebooks. No, I have paperback versions as well. My website is nicholaskotar.com and if you will, if you don't mind, Jonathan, I will do a shout out for the Kickstarter right now. I don't know when this video is going to come out, but until February 7th, I have a Kickstarter going to fund the rest of the series, books four and five. That's been going very, very well. And the reason I want to bring it up is because it's an opportunity for people who like to listen to audiobooks, to get access to my first three audiobooks, which have not yet been produced, basically for as low as $5. I mean, I'm opening it up as a free gift to anybody who contributes at the $5 level or higher. So it's an opportunity to help me on a purely monetary level, but it's also an opportunity for people if they want to experience my writing."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":2899.93,"end":2902.73,"speaker":"Jonathan Pageau","text":"Also, they can win a carving by me that I'm going to make."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":2902.89,"end":2904.33,"speaker":"Nicholas Kotar","text":"How could I forget that? My goodness."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":2904.73,"end":2913.96,"speaker":"Jonathan Pageau","text":"I'm going to carve. I'm gonna carve a siren for Nicholas to participate in his Kickstarter. So you can win a carving by me if you help Nicholas publish his books."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":2914.92,"end":2928.28,"speaker":"Nicholas Kotar","text":"I can't believe I forgot that. That's it. Yeah. So basically, whoever gives, I think $50 or over, maybe it was $20 or over, we'll have a chance. We'll be put into a draw for this card. So. Yeah, there we go."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":2929.8,"end":2933.88,"speaker":"Jonathan Pageau","text":"So, Nicola, it was great talking to you and I for sure. We'll try to do this again."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":2935,"end":2936.36,"speaker":"Nicholas Kotar","text":"All right, Jonathan, sounds great. Thank you."}
{"episode_id":"SW - #024 - 2018-12-03 - Discussion with Nicholas Kotar - Tolkien, Fairy Tales and Telling Stories Today","start":2939.56,"end":2995.5,"speaker":"Jonathan Pageau","text":"Thank you for listening to the Symbolic World podcast. As you know, this podcast is for now based mostly on my YouTube videos which I am transferring into audio format. Please go ahead and visit my YouTube channel. There are more videos there on different subjects that I'm not going to put into audio. And please share this to your friends. I know a lot of people know about the YouTube content, but not so many people know know that this is also a podcast. So share it to your friends. Share it on social media. And if you can, feel free to support this financially as well by going to my Patreon page which is Pageau videos. Strangely, you can go there and you can support it at any amount that you want. A month for all the patrons. I do a monthly Q and A, a live Q and A in which people can ask questions in the chat and I try to to have a more personal connection with with people. The YouTube comments have become difficult to follow and to answer. I'll see you soon."}
