{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":12.08,"end":143.06,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. All right, so hello, everybody. It's a very strange backdrop. For those who don't know, I am in Florida and I am doing a seminar on Exodus with Jordan Peterson. So I don't know if you guys. I think I posted a picture of Jordan and I on a Jet Ski, which seemed to have caused some reactions. So we're a bunch of people here and we're doing this seminar on Exodus, which is actually why I'm doing this in the morning because Jordan has been keeping us pretty busy. And so there was actually an event last night at his house and some pretty intense discussions. It was good stuff. But I decided to change the date and time for this morning. And so. All right, so as you people know, patrons ask these questions in advance. And recently I've been doing it patron, only the Q and A. But I decided to make it public this morning just because it's a strange time and I thought no one's going to show up, so I might as well make it public. All right, before we start, I do have a few announcements to make. So for those who don't know, there's going to be an event in September. September, starting September 15, it's the consciousness and Conscious seminar with John Vervecki and myself and also Paul Vanderklay. So it's going to be a really great event, several days, and it's in Thunder Bay, Ontario. It's just going to be a lot of time to talk and to discuss. We're going to do a barbecue and an Airsoft and it's going to be a lot of hangout time as well, getting to know each other. I never met Paul Van der Klee in person, so I'm really looking forward to that. And kind of on the same front, there's also in Europe something called the Bridges of Meaning Festival. And so wait, I need to find what's going to be the date. But so the Bridges of Meaning Festival is going to be. Is Paul Vanderklee and Burn Power and a bunch of people. I think two more V's is going to be there. I'm not sure. Sorry if I, if I, if I make a mistake."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":143.3,"end":143.94,"speaker":"Neil","text":"It is."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":144.42,"end":157.86,"speaker":"Jonathan Pageau","text":"Anyway, so it's all, it's in August, late August. And so anyways, check it out. There's going to be a link in the description. Look at for the European Bridges of Meaning Festival. Yeah, a lot of fun stuff on the horizon. All right, so I'm going to start."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":158.34,"end":158.74,"speaker":"Neil","text":"Look."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":160.1,"end":165.94,"speaker":"Jonathan Pageau","text":"All right. I mean, oh, man, someone's at my hotel. Let me just say get. Let me just Give me a second."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":167.01,"end":300.44,"speaker":"Neil","text":"What do you want? Croissants? All right, all right, all right. Look, Jonathan's live. Okay, everybody, I've got him distracted. He's eating a croissant right now. That's how he pronounced it. And when he's done with that, he's gonna have some poutine. So finally, you're gonna get some real answers today. So, congratulations. I'm appearing as Jonathan Pojeon. My alter ego is here, and I'm ready to answer Patreon questions. Welcome, everyone. Oh, I can read the chat. This is exciting. Hello. Thank you for knowing my name. Someone. Okay, so we have a. We're going to start off with some questions from the website. Oh, isn't there an intro? There needs to be, like, intro music. Like, this is. Hello, I'm Jonathan Pajan, and this is the symbolic world, Jurassic Park. That's a problem. All right. Okay, from first, from the website, Eric Salander says I didn't pronounce that right and on purpose. Hi, Jonathan. Or Jonathan, I hope all is well with you and that you are blessed in your undertakings. Well, this guy is very polite. Revelations 12:5. Oh, we're already off to a bad start here. She bore a male child who was to rule all nations with a rod of iron. Iron is multiple, hard and brittle, as you stated in one of my previous questions. Yeah, but it's also not how come Christ will come to rule with rod of this kind of material. P.S. will you be one of the people taking on Exodus with Jordan Peterson on the Daily Wire? Well, I will not, but Jonathan will. And so that's probably why you're not going to want to watch it, because it's going to be him and not me. All right, so the question really is. It's not even a good starter question. Um, I'd rather talk about my new diet I'm on. So now I'm down here in Miami, I realized that I could, like, trump the Carnivore diet and that you can actually absorb all the nutrition you need just from staring at complex patterns on men's shirts down here. So that's pretty much all Eric needed to know. Oh, Jonathan's. Jonathan's done eating. I better get out of here. No, I was just talking to somebody."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":300.44,"end":301.28,"speaker":"Jonathan Pageau","text":"You were helping me out there."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":301.28,"end":304.78,"speaker":"Neil","text":"Yeah, yeah. Thank you so much. Yeah, you can skip question one. I already got it. Okay."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":304.85,"end":361.18,"speaker":"Jonathan Pageau","text":"All right, so Neil has been. We've been hanging out. It's been great. And so we thought we would surprise everybody a little bit. All right, so I will answer Eric's question. And so she bore me out child. So why is it that it says that Christ will reign with a rod of iron? And so the way to understand the rod of iron in general is to understand it as an increasing in power. And so if you look at the manner in which the statue of Nebuchadnezzar appears, right. In the vision of Daniel, you have the head of gold, then you have the, I forget, like the body of silver, the arms of brass, and you have the legs of iron. And so it really is. Understand that we're going towards the end, the end of the world, basically. And so we're moving towards the end. And so the power, the authority is transforming itself more and more into power. And so that's the reason why you will see that it is said he will rule with a rod of iron. So as you can see, Neil didn't, didn't know how to answer this question."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":361.66,"end":365.34,"speaker":"Neil","text":"I actually just gave people a question they're more interested in."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":365.58,"end":371.66,"speaker":"Jonathan Pageau","text":"Exactly. Yes. Because we know Neil is very good with the complex pattern shirts. Although you're, you're, you're."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":371.66,"end":377.02,"speaker":"Neil","text":"Well, today. Well, there's, there's some complexity here. There's a story to this. This is, you know, like an adult."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":377.02,"end":379.22,"speaker":"Jonathan Pageau","text":"Version of Winnie the Pooh. Yeah, but."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":379.22,"end":384.58,"speaker":"Neil","text":"Yeah, it depends how you mean adult, but yes, yes, like grown up. There we go. All right, that sounds better."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":384.58,"end":440.99,"speaker":"Jonathan Pageau","text":"Okay. All right. And so. All right, I will continue. So, Benjamin Rva asks, is it significant that the ninth commandment is to not bear false witness against our neighbor rather than a broader command not to lie? Is there a distinction being made here between testimony and propositions? Yes, I definitely do believe that. You know, I think you could say something like, yeah, it would be good if we didn't lie. But I think the real moral question is more about our intention. And so I think the idea of talking about false witness rather than just the idea of not using factuality is much better. And it's actually much closer, I believe, to the Christian tradition, because if you look at some of the hesi as the church fathers, especially the desert fathers and the monastic fathers, you will see that they will sometimes not use, they will sometimes actually use things that are not factual in order to bring about a higher truth and a deeper intention."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":441.12,"end":441.28,"speaker":"Neil","text":"That."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":441.35,"end":453.03,"speaker":"Jonathan Pageau","text":"So I'm not saying that you should lie, but it really is about intention and about communion rather than something which is just about whether or not something is factual. All right, does that make sense to you?"}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":453.11,"end":465.19,"speaker":"Neil","text":"Well, nothing makes sense, you say, but I just like to be associated with you. Hey, Cormac Jones. Is that who's next? Yes, I just talked to Cormac. We talked last week. Super interesting guy. How well do you know him?"}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":465.43,"end":467.51,"speaker":"Jonathan Pageau","text":"I think we've talked a few times or once or twice."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":467.51,"end":492.52,"speaker":"Neil","text":"Yeah, well, he's been writing some screenplays, and he made an interesting distinction between this topic, style of story he was trying to write, and he called what we were doing homesteading, which I kind of liked, where it's, like, kind of meant to build in a traditional sense, like a traditional story, the way it builds out. And he deals with these stories, I guess, that are, like, more fringe oriented, and it's pretty interesting. Anyway, smart guy. I love his stuff. He's written for the symbolic world."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":492.52,"end":494.12,"speaker":"Jonathan Pageau","text":"Yeah, he's done a good job with that."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":494.12,"end":498.04,"speaker":"Neil","text":"You should check that out. If you haven't. You're all patrons right now, so you probably have this."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":498.04,"end":500.04,"speaker":"Jonathan Pageau","text":"I made this public this morning, so there's a bunch."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":500.04,"end":506.54,"speaker":"Neil","text":"Oh, you did? Hey, follow Derpo Robbins, my band subscrib. And, like, I'm almost at 10,000. All right, all right."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":506.94,"end":511.06,"speaker":"Jonathan Pageau","text":"Okay. So here we go. So to your mind, just shameless. Totally shameless."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":511.06,"end":511.7,"speaker":"Neil","text":"I'll go for it."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":511.7,"end":627.36,"speaker":"Jonathan Pageau","text":"To your mind, what is an iconographer doing when he or she depicts a demon on an icon? This could be in horrific forms, as on the icon of the Ladder of Divine ascent, or in disguise, as an old man tempting Joseph in the Nativity icon. In either case, it seems to be an invocation of a demon giving it a body expression. But apparently this can be done without evil purpose. Would it be possible, alternately, for a Christian filmmaker to invoke a demon, giving it a cinematic body of expression, and have this not be to evil purpose? So, Cormac, you've got a. Your question is very good. And I would have to say that it's a question that does not lack controversy. There's a lot of controversy within the world of iconography of if and how we can or should represent demons. And there are really different schools of that. So if you look at Eastern, One of the differences, you could say, between Western art and Eastern iconography is that Eastern iconography is far more liturgical, and so it's used in the Church a lot more than the manner in which images were used in the West. And so what it does is that it makes. I think it makes the imagery more succinct, like more concentrated, and the meaning is actually very, very concentrated in Eastern iconography. In Western Iconography, there's more variation. And so sometimes you can understand the meaning by seeing more variation. And so you have to ask that question. So some iconographers will not represent demons in icons because you're supposed to vent, especially an icon you're going to venerate. And so it makes it more complicated if you're venerating an icon and then there's a demon there. Honestly, I do not subscribe to that. Because if you were going to go down that line that you represent in icons only things that should be venerated, then you will come to very, very ridiculous levels where there are many things, like you said exactly in your message, that you won't represent Joseph being tempted by the old man because you know that secretly the old man is the devil."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":627.36,"end":627.96,"speaker":"Neil","text":"You won't."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":628.6,"end":697.96,"speaker":"Jonathan Pageau","text":"Like, are you going to represent the soldiers next to the cross? Like, you're not never going to represent. You're not going to represent Judas in the icons or in the icon of the Last Supper, for example. And so I think that we have to be a little. And so the manner in which people that do represent demons in Eastern icons, they tend to represent them as completely black in the sense of lacking light. And so this is a way in which maybe you can play a little bit with the manner in which icons represent themselves in light. If you look at those icons of the Ladder of Divine Ascent, the demons in those icons are usually represented as just as black shadows. And so that's different than in Western art, where they're represented more as Chimera, as monsters. But I really like that representation to help us understand. So I think it could be possible in a movie to represent a demon. But you're right, you would in some ways be invoking the demon, not in a weird magical way, but that you are definitely bringing it on screen. And so you have to make sure that you're not doing it in a gratuitous manner. Well, in the same way, honestly, that you also would not have Jesus in a movie because you would."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":698.24,"end":698.72,"speaker":"Neil","text":"You wouldn't want."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":698.72,"end":707.32,"speaker":"Jonathan Pageau","text":"You would have to be very careful to not do it in a gratuitous manner. So you just have to be careful and think about it and maybe ask other people's advice when you're writing it."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":707.32,"end":736.53,"speaker":"Neil","text":"So what's your take on the consistency of demonic possession in movies? It seems like every director for the last. Well, since the Exorcist certainly has displayed it the same sort of way. There's something in the body that doesn't belong there that it can't behave consistently. There's always this sporadic kind of outbursts and pulling in of information almost. Almost randomly. What do you make of that? Because there seems to be a real agreement about that depiction of what possession looks like in film."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":736.69,"end":810.87,"speaker":"Jonathan Pageau","text":"Yeah, I think. I mean, I think it's fine. I think the idea of showing possession is to show exactly the idea that there's something ruling the body that should be ruling the body, and that is making the body do things that it shouldn't. Obviously, in movies it will always be exaggerated, but there's a manner in which I think that's also okay because movies are not reality. Movies are stories. And so just like in the stories, sometimes the demons will have physical form, like they will actually be. You know, you read these crazy stories about, you know, St. Margaret, you know, being eaten by a dragon and then escaping the dragon by piercing the dragon out and everything. So you have these very, very embodied stories. And so I think that if we understand that movies are not just. They actually aren't just a, you know, a depiction of raw reality, but really our story that condense things. I think it's okay to use even sometimes to have like. Yeah, you could have. You could even have like a physical demon that you see looking like a gargoyle or something. That I think that that could be fine if it's done properly. And that if the symbolism makes sense, it's when you make it upside down and you would make a demon be the good guy or something like that, like they would. That they would probably do today, then that's when you have a problem."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":811.19,"end":811.75,"speaker":"Neil","text":"All right."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":811.99,"end":895.28,"speaker":"Jonathan Pageau","text":"All right. So. C. Streetsel asks in Universal History, would Nazi, German and the Holocaust be related to the pattern of Assyria? Specifically when Assyria was used by God to judge the nations and to destroy Israel and Judah, followed by Assyria being judged for its own wickedness. Both resulted in a remnant of the Jews returning to rebuild and resettle Israel. And so I would have to say that that is a. It's a very controversial question. It's a very controversial thing. There are actually some Jews in the Orthodox and in the Hasidic camp that believe that. That believe that. That's one of the reasons why we use the word Holocaust. The word holocaust is a word which refers to sacrifice. And so there are some Jews who believe that the Holocaust was like a kind of sacrifice that led to the founding of Israel. And there. There are others who are more careful and do not like that. That association. So, for example, we are here now doing this Exodus seminar. Dennis Prager is here, and someone mentioned that because we talked about the sacrifice of the Israelite children before the Israelites were able to leave Egypt, someone asked about that and the relationship to the Holocaust and the founding of Israel, and he had a very negative reaction. He said he doesn't like that interpretation. So there are really two schools on that question. All right, so Wedge, Young man says hello, Jonathan. So no more jokes, huh? Not about that question."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":895.36,"end":898.88,"speaker":"Neil","text":"Well, gee, come on. Give me. Give me a softball here. That's right."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":899.28,"end":945.33,"speaker":"Jonathan Pageau","text":"Hello, Jonathan. I have a question, but wanted to thank you first. My father died a couple of weeks. Well, oh, Lord have mercy. I know I wouldn't have handled it as well as I did if it wasn't for the enlightening and encouraging vision that you and Jordan Peterson have shared. My faith is stronger than it's ever been. Thank you for playing a part in that. Well, thanks. That's. That's very nice. My question is regarding Luke 17. When Jesus is talking about the days of the Son of man. After Jesus finishes describing the days of the Son of man, the apostle asks him where. Lord Jesus responds, wherever the body is. Where the eagles. There the eagles will be gathered together. I don't fully understand this. Would you share your thoughts? Thank you for your help. Where the body is, there the eagles will be gathered together. I don't think I've even remembered."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":945.33,"end":953.03,"speaker":"Neil","text":"I remember reading the word eagles in that verse. Like, this is a different translation than I read. Wonder what else it gets translated as. Yeah. What's the verse?"}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":953.11,"end":956.79,"speaker":"Jonathan Pageau","text":"It's Luke 17. Which was. Which is the chapter."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":956.79,"end":964.47,"speaker":"Neil","text":"Yeah, yeah. Hold on. Patristics is here. The channel. The two brothers. Oh, yeah, yeah, yeah. We should give them a shout out. Their. Their channel's great."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":964.47,"end":973.95,"speaker":"Jonathan Pageau","text":"So, yeah, I'm just giving everybody. You're just. You're just wonderful. So check out. Check out Patristics. Two. Two filmmakers from there for New Zealand, Right?"}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":973.95,"end":976.62,"speaker":"Neil","text":"Well, I don't think originally from New Zealand, but they live in New Zealand."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":976.69,"end":976.89,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":976.89,"end":1013.66,"speaker":"Neil","text":"Deal. Real short answer. So, like, my description, I've sent this channel to a bunch of people. There's something about it where it's like. They're, like, simple, like, really well researched answers, like, great, great content to the actual. What's the word for it? The copy, like the script and. But then there's, like. There's like 10% of, like, Ron Burgundy from Anchorman in there because he's got his tea and he's got his set, and he's got his mahogany chair, and I love it. It's just Got a great vibe. So you should definitely check it out. Every video produced so far, I really liked the one recently did on the Sign of the Cross. Okay. Thought that was touching."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1013.66,"end":1014.3,"speaker":"Jonathan Pageau","text":"So check it out."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1014.62,"end":1016.46,"speaker":"Neil","text":"I'm still trying to find, you know."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1016.46,"end":1082.04,"speaker":"Jonathan Pageau","text":"This, so let's give me a chat question. So Alan asked, what do you think about Jesus being represented in movies? I've always felt uneasy about it because I fear about attributing certain fictional characters to Christ. I honestly, I don't believe that it's impossible, but I do think that we should approach that with much trepidation and we should be, you know, if someone was going to put Christ in a movie, they should do so with fear and trembling and be really worried. Because I think, like you, I have been very disappointed, let's just say in recent representations of Christ on screen, because you can see, it's almost as if it becomes like a mirror of the people who will put him on screen. And so people will put Christ on screen in a way, and you can just recognize them. It's like, this is your theology, this is your vision of the church, this is your vision of everything. And now you're concentrating that into your figure of Christ. And so it is, I think, I think in some ways, just like Christ does in general, if you were going to have a fictional version of Christ, it can really act as a judge on you. You know, it can really kind of manifest itself as being a judge on you."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1082.04,"end":1082.36,"speaker":"Neil","text":"So."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1082.36,"end":1083.6,"speaker":"Jonathan Pageau","text":"All right. So please."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1083.68,"end":1100.8,"speaker":"Neil","text":"Yeah, okay. So it's in the context of the, you know, two women will be grinding together, the one will be taken, the other one left. Two men will be in the field, one will be taking, the other one left. And then he answered and said to him, where, Lord? So then he said to them, wherever the body is, there the eagles will be gathered together."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1101.28,"end":1104.32,"speaker":"Jonathan Pageau","text":"That's very interesting. I don't think I'd ever even thought about that."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1104.48,"end":1110.24,"speaker":"Neil","text":"It thinks, I think, of a vulture image right away, like, but that's not. The eagle isn't the same type of carrion eater."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1110.24,"end":1110.56,"speaker":"Jonathan Pageau","text":"No."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1110.56,"end":1111.08,"speaker":"Neil","text":"So it's not."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1111.08,"end":1181.95,"speaker":"Jonathan Pageau","text":"So, but it does not reference to that. But it might be a reference to that. And it might also, in a certain manner, be a reference because the, the. The rapture, Raptor or, you know, and rapture or whatever. Like the idea of a. Of the idea of a rapturous bird is often an image of heaven, but it's you. It's often very often an image, a negative image of heaven, which is like heaven comes down and takes you Know, you have this idea when, when Samuel is. Is warning Israel about not having a king because he's saying if you have something above you, it's going to act like, like a raptor and it's going to come and take you from the world. So I think that this might be what it's suggesting. It's like if, where the body of the church is, then the idea that God will come and take his in a positive way, though this time. Well, I mean, it makes sense because Christ used images like that that might seem negative, but that are positive. For example, when he talks about St. Peter becoming a fisher of men, you think, okay, when you fish, you bring it up to eat. Just like the bird comes down and takes in order to eat. But in that, in that question, it's like we become food for God in the positive sense."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1182.99,"end":1183.39,"speaker":"Neil","text":"Yeah."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1183.39,"end":1185.31,"speaker":"Jonathan Pageau","text":"So I think that that's probably what. What's going on?"}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1185.31,"end":1190.27,"speaker":"Neil","text":"Well, you do it that way. I just jump in mouth first, and I don't like people to watch me eating. So it's."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1190.51,"end":1198.75,"speaker":"Jonathan Pageau","text":"So, yeah, so between the, the question and the, you know, whether those that brought the water up or those that laughed. Water. Like a dog, right? Oh, yeah, like a dog."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1198.75,"end":1201.67,"speaker":"Neil","text":"Oh, of course, of course. Yeah. I get to be part of Gideon's army."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1201.67,"end":1202.58,"speaker":"Jonathan Pageau","text":"All right, all right."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1202.81,"end":1203.69,"speaker":"Neil","text":"Yeah, exactly."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1203.77,"end":1206.89,"speaker":"Jonathan Pageau","text":"All right. Someone is asking, who is the other guy? What do you say?"}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1207.37,"end":1208.09,"speaker":"Neil","text":"Jonathan."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1208.33,"end":1209.25,"speaker":"Jonathan Pageau","text":"Jonathan Pajan."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1209.25,"end":1214.97,"speaker":"Neil","text":"If you don't follow my Symbolic World channel, you should definitely wrong answers only."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1215.29,"end":1239.25,"speaker":"Jonathan Pageau","text":"So those that, that are just showing up, this is Neil. The great Neil the Grade has a band called Dirt for Robbins. And he just put out a wonderful series of clips on YouTube which were like this beautiful fairy tale called Queen of the Night. And you also have to definitely check that out. Neil and I collaborate quite a bit, you know, just in our discussions. And he has a very powerful symbolic intuition, though he is a little bit of a clown, though."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1239.41,"end":1240.21,"speaker":"Neil","text":"That's not true."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1240.53,"end":1413.47,"speaker":"Jonathan Pageau","text":"So, okay, so Ramal asks, hi, Jonathan, you said recently that you have been reading the book Meditations of the Tarot by Tomberg. What are your impressions of it so far? Also, if you've already read up the fourth letter, the emperor, what do you think about his idea about authority, freedom, and the king crucified God? And so I am reading it, but I am reading it very slowly. And so for now, I do appreciate it. There are some things that are strange about the book, like his reference to, for example, reincarnation. And as people have told me that later, he really refers to Teilhard de Chardin, which. Not a big fan of Teilhard, but I would say that his worldview in general and the way that he describes vertical causality is very close to what I talk about in terms of the symbolic world. And he also is adding some interesting language that I think that can maybe. That I'll probably be using because it can help modern people understand the manner in which magic happens. Magic, not in a weird way, but just the notion that there are some causalities which are not just at the mechanic. Well, not there are. One of the most powerful type of causality is the one which comes from. From above and moves down below. So. So no, I have been enjoying it and I'm. And when I get back home, I'm looking forward to continuing my reading. All right. So Eagle's Wing says, hi, Jonathan. What is the symbolism of human flight? It is a reason developed technology and so follows a pattern of garments, of skin and of prideful and dangerous overreaching by humanity to some degree. But it strikes me that this symbol might be particularly significant since the human desire for to fly is so ancient as to be almost mythical in and of itself. Reference some of the Psalms, Daedalus and Icarus and ancient cave paintings. As a professional pilot myself who's passionate about flying, I'm also curious to know how such lofty desires might be redeemed and not fall into the naturally prideful tendency. Since it originated as a kind of Tower of Babel trying to reach the heavens, becoming like birds which are of heaven. How can it be rightly ordered for man to fly? So I think the first thing we need to be able to do. So one of the things that's happened in the past few centuries is that there's been something of a materialization is maybe the best way to understand it, where it is that because we've moved away from our simple perception of phenomena and we've kind of moved into technical perception and also technical use in order to engage with certain phenomena, then what that leads to is a kind of materialization. It's hard to explain it, don't think of it scientifically, but it led to materialization because we're engaging with the heavens materially and we're engaging with certain types of patterns materially, where in the past we weren't. And the same with light, the same with all these things. And so because there's a kind of materialization, the heavens are. The heavens that you fly in a plane are just not the heavens that are described in the Bible. They're Just not the same heavens."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1413.47,"end":1413.79,"speaker":"Neil","text":"Right."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1413.79,"end":1458.5,"speaker":"Jonathan Pageau","text":"The outer space is more akin to like the ocean that a mariner would go on and encounter monsters in, than it is related to the spheres of heaven that is talked about by Dante. So we first of all have to be careful not to confuse those. And it's not arbitrary, it's meaningful. That it is in engaging with these aspects of reality mechanically and through the garments of skin that they materialize themselves. And so there's no problem, like there's nothing wrong with the garments of skin, like I've said many times, and there's nothing wrong with flying in an airplane. It is, it can become wrong if like that Russian astronaut, you go up into outer space and then you think that you've disprove God because there's no like God floating above. Right. That becomes."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1458.5,"end":1460.22,"speaker":"Neil","text":"There's absolutely no spaghetti or monster."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1460.22,"end":1467.9,"speaker":"Jonathan Pageau","text":"That's right here. That's right. So that's when it becomes ridiculous. But I think properly understanding it in its place, I think that there's no problem in flying."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1467.9,"end":1500.03,"speaker":"Neil","text":"Well, I'd add in a non comedic sense too, that there is, you know, all technologies is an extension of what people already do. Just, you know, sometimes an exaggeration of it in the sense that we do already travel. We can travel within our own bodies. And so thinking of the aircraft itself as an extension, like a steed, like something that expands your ability to do that to, let's just say, jump really far, I think that's something that's becoming harder and harder to see, that technology is all based on human activity and also growing one of our own strengths."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1500.03,"end":1529.42,"speaker":"Jonathan Pageau","text":"Yeah, no, you're right. But there is like. I have to say though, maybe this could be like a little different take on it. I think that. I think that for someone who is spiritually attuned, I think that going up in an airplane and seeing the world from so high above and seeing the patterns of reality from. From that high, I think that that could be a very powerful moment if it was approached with the right heart. I do believe that though, so. So there's that as well."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1529.42,"end":1535.34,"speaker":"Neil","text":"Bette Midler agrees. That song from a Distance. Okay, I won't do that."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1535.34,"end":1535.82,"speaker":"Jonathan Pageau","text":"All right."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1535.82,"end":1536.86,"speaker":"Neil","text":"Copyright infringement."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1536.86,"end":1543.48,"speaker":"Jonathan Pageau","text":"That's right. On YouTube, if you sing, our videos will be because you do the imitation so well. I thought."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1543.88,"end":1545.48,"speaker":"Neil","text":"I didn't want people to know I."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1545.48,"end":1547.4,"speaker":"Jonathan Pageau","text":"Had a Bette Midler impersonation."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1547.48,"end":1549.24,"speaker":"Neil","text":"No, I didn't mean to let that out."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1549.24,"end":1631.5,"speaker":"Jonathan Pageau","text":"All right, so a pauper says, what determines a value hierarchy? And why do different value hierarchies exist. And so value hierarchy is something which lays itself out based on an aim, a purpose. And so that purpose can be multiple. It can be everything from a virtue, you know, that. That you aim at. And so you can see the different levels of attainment of that virtue. But it could also be something like, you know, whoever makes the best pizza would also be something like a value hierarchy. And so it really is only the hierarchy manifests itself only because we perceive something that is worth. Worth attaining, that is worth aiming for. And hierarchies will naturally manifest themselves out of that. And so that's just how it exists. And you could understand it like all these value hierarchies scale into each other. They, like, fractally exist in each other. And they are ultimately held together by what we could call the good in the Platonic sense. But really they are held together by the source of all things, which is the God of love and the divine Logos into which all reality is folded. And so what's important to understand is that there's a manner in which, just like in the natural world, there are these, like, you could see it, like all these hierarchies that you notice in the natural world are these phenomena. They have a form, but there's also a kind of dance to it."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1631.66,"end":1632.02,"speaker":"Neil","text":"Right."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1632.02,"end":1650.94,"speaker":"Jonathan Pageau","text":"You can't have an absolutely rigid system. You could have a rigid system where you have all the value hierarchies all in a pyramid. It's more like it's something that is. That does have a structure, but is also cascading and there's a kind of dance which happens. So if you try to lay it out and lay everything out, you're going to run into trouble."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1651.97,"end":1671.49,"speaker":"Neil","text":"Yeah, I kind of love people that are, like, just anti hierarchy in general, but don't really understand what they're saying, because to knock down a hierarchy and describe why hierarchy is bad, you have to have a hierarchical structure. So I just. I don't know. I think that's one of the funny things about the way that word's seen now too, you know, for people who don't understand this place."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1671.57,"end":1689.04,"speaker":"Jonathan Pageau","text":"All right, so I have to say that Brad and Lisa are in the chat and I'm very grateful that you have showed up because they've been going through really a lot of difficult times. So I'm very grateful that you guys are showing up despite everything you're going through. Guys, so thank you so much. Thanks so much."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1689.28,"end":1692.52,"speaker":"Neil","text":"I think Bradley came just to make fun of me. He couldn't miss the opportunity."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1692.52,"end":1696.32,"speaker":"Jonathan Pageau","text":"But you, you you have a voice. He's in silence. You should make fun of him right now."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1696.4,"end":1699.16,"speaker":"Neil","text":"Oh, wow. I really could. I really could do something."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1699.16,"end":1701.44,"speaker":"Jonathan Pageau","text":"But you don't want to incur the Brad, though."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1701.44,"end":1702.76,"speaker":"Neil","text":"I'm gonna be. Here's the hammer."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1702.76,"end":1703.64,"speaker":"Jonathan Pageau","text":"Here's the hammer."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1703.64,"end":1707.58,"speaker":"Neil","text":"I'm gonna be the bigger man here and just say, you know, get well soon, Brad."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1709.66,"end":1900.39,"speaker":"Jonathan Pageau","text":"But we love him. And we love you guys, Lisa and Brad. We love you guys. All right, so here we go. So Gioad asks. Hi, Jonathan. As in one of your videos, you had briefly mentioned that Leviathan is a sea monster. After reading Job, I saw many connections to him in Christ. The fish symbolism, of course, the fire from the mouth and the tongues of flame. Through the Holy Spirit, he is regarded as a king. And the power of God. The etymology of the name Levi, Hebrew name for united, joined Levi's priestly caste with no land, and Athens, Greek for eternal life. Is that really the. I'm not sure. Anyways, there are many more connections per se and cosmically that I see. But the question is, in spite of its negative connotations, is Leviathan a wise decision for a boy's name in an inverted world, or is this symbolizing of sea monster? Scandalous. In the orthodox faith, I would avoid naming your son Leviathan. I think that would be a good idea. I think it's important to understand that the Leviathan plays multiple roles in scripture. And you have to really understand the Leviathan as being the bottom of the world. So, you know, really is this kind of serpent at the bottom of the world or the serpent that is around reality? And so being that the Leviathan is on the one hand a perfect image of. Of the. The opposer of the devil, of Satan. But there are places in scripture where that is not the case, where the Leviathan is actually represented as God's pet, basically, because there is no total duality in God. There is no complete duality in God. All things exist in their proper place. But the Leviathan is of course, the best image for the opposition of the world, really, in an ancient mythological sense of Tiamat, this dragon of chaos, which tends to oppose God. And so. But as for your perception of the relationship between the Leviathan and Christ, I think you're actually onto something to a certain extent. And it has to do with the fact that in Christ's incarnation he went to the bottom of the world. And that's why he's represented as the serpent, for example, as the serpent, the bronze serpent, or even on the cross, he's represented as a serpent. But we have to be careful not to confuse that, say, Christ who fills the entire hierarchy and also manifests aspects of the. Of death and of the bottom of the world and just that symbolism as something to kind of revel in. And so you probably be best not to revel in Leviathan or snake symbolism on its own, but only as it pertains to its relationship to Christ, if that makes sense. All right, so choose. Agape says, what can we learn about love from the story of Abelard and Eloise? Would they have had a happy ending today? If so, why? I mean, I think from the story of Abelard and Eloise you can learn. You could learn the story. I mean, that story has a lot to do with pride and a lot. I think it is, in a certain manner, some of the first stories in the Christian tradition in the west where we do see someone who, let's say, who gives themselves to their passion out of pride, especially Abelard, because he was so prideful. And then, you know, I'm not saying that the consequences that they suffered, that Abelard was castrated, like, I'm not saying that the consequence that they suffered."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1900.39,"end":1901.47,"speaker":"Neil","text":"Castrated with a hammer."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1901.47,"end":1927.15,"speaker":"Jonathan Pageau","text":"Yeah, good stuff. So I'm not saying. I'm not saying that Abelard deserved what he got. You know, I don't want to say that, but I do believe that it is in some ways an image of. And you're right, that if that story was written today, it would probably end well, but it's rather. For us, it should rather be an image of a story of someone who. Who thinks that they're above reality and that their actions have no consequences and. Yeah."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1927.15,"end":1935.27,"speaker":"Neil","text":"So did you know that Kate and I met in a musical about Abelard? I was cast as Abelard and she was cast as Eloise. Really? My wife and I met that way. Yeah."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1935.83,"end":1937.83,"speaker":"Jonathan Pageau","text":"What's your take on it, the story?"}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1937.83,"end":1944.63,"speaker":"Neil","text":"Well, I. Shakespeare also allegedly based Romeo and Juliet on this story. And that's a tragedy as well."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1944.63,"end":1945.03,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1945.03,"end":1991.01,"speaker":"Neil","text":"So I think that Shakespeare at least saw something about the pattern where, you know, that it matched the complexity of life and sort of the inevitability of these kind of actions. So someone who. Whose job was to stay pure, you know, as a 12th century philosopher and theologian, he was supposed to stay pure and undefiled, you know, was trying to have this. This sort of pride about what he was teaching at the same time, take this thing on the side that was forbidden. So I think that's how, if you're writing a tragedy, that's how the story ends, sadly. I mean, also, you have to consider in, you know, if this took place in 2022, I think that Abelard, he would just be the name of, like, some kind of new synthetic fat substitute. So that's pretty much it. That's all you needed to know on the subject. Abelard on your chips is delicious."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":1991.09,"end":2274.01,"speaker":"Jonathan Pageau","text":"Okay. All right. And so we are moving to the Patreon questions. So for those who are just dropping in, you know, I get questions from my supporters from the website and also from Patreon. So we are going to Patreon. All right. So Norn. Norn. Ironman asked. My wife and I have been trying to have children for many years and have suffered two miscarriages, the most recent of which was a few years ago now. My wife turned 40 recently, and I turned 41. But I kept telling her not to give up hope. I always think of the story of Abraham and Sarah when I'm trying to reassure her. But I've recently been wondering, what is the deeper symbolism behind the story? In it, Abraham basically has given up hope. So is it wrong for me to think of it as a way of reassuring myself, I understand it may never happen, but what is God trying to show us about how we should feel in this situation? So I think that it's one of those things where we have to be. On the one hand, I agree that we should look at scripture and kind of find hope in scripture, but we should also be careful not to see that scripture is there to help us. How can I say this? That historian scripture is there as a kind of map of our own experience. Exactly. Because. So it's very important to understand that in the story of Abraham, the reason why Abraham is losing hope and should not lose hope is that God told him that he would have a son. Clearly. So that's also part of the story. It's as if God told Abraham he would have a son, and then the possibility wasn't manifesting itself to a point where, in a manner in which that you could say there was no way that this could be something that came only from Abraham and Sarah. And so it was stretched to a limit where Abraham was so old and Sarah was so old that the birth of their son appeared as providential and so carried with it that kind of providential sense. And so you could say that, for example, in your case as well, that long desire, it's not exactly the same, but let's say that desire to have a child for such a long time and to be patient and to Keep your heart. You know, if God grants you that wish, then in a certain manner, that child will be more precious to you than to someone, you know, who gets married at 19 and gets pregnant right away, just in terms of experience. And so I think that. So I think that. I don't think that you necessarily have to give up hope. Of course, it is possible that that is not what God wants for you and that you will not have a child. But if you do, then maybe you can see how this longing that you've had, this longing for many, many years, you know, will also put weight and value in the miracle if it happens. So we pray that it does for you. All right, so Matthew o' Hare says, what's your understanding of why Christ had to return to the Father for the Holy Spirit to come? So the way that I understand this has something to do. This can be very speculative because it's actually something I've been thinking about a while, and I've been kind of playing with it, and I don't totally understand it, but it has to do with the pattern of the ascent before the beginning of a new world. And so you see that before the Flood, Enoch gets taken up, you know, and there's also the destruction of a world. So it's like the end of a world and the beginning of a world. And so Enoch gets taken up, and then there's a flood, and then there's a new beginning. Elijah gets taken up, and, you know, and it's the end of the kingdom of Israel. And then there's a new beginning with Judah. And then ultimately Christ gets taken up. Jerusalem itself is destroyed. But it's also the beginning of the church and of this universal church. So there seems to be something about how in order for something new to happen, the head, the Logos, has to be kind of taken up into heaven, is the only way to say it. And what that does is that makes things, on the one hand, collapse because everything was held by that head somehow, and then everything collapses. But that also leads to the new Spirit, right? Because when we say the Holy Spirit comes down, you have to remember that that's what happened at the beginning of creation. The Spirit of God which comes down on the water, that is how the world comes to exist. The Spirit of God which blows through the Red Sea and opens it up to reveal the new earth. That is how it happens, right? The Spirit of God descends on Christ as he comes out of the water to be revealed publicly as the Son of God. So the Holy Spirit coming down isn't Just like an arbitrary thing. It's something which reveals dry land."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":2274.01,"end":2274.33,"speaker":"Neil","text":"Right."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":2274.33,"end":2297.19,"speaker":"Jonathan Pageau","text":"And so in scripture, in the New Testament, it's even wilder because it's not just dry land. It's like a fire that burns and kind of fills the world with its drying capacity, like revealing the body in its fullness. So I think that it has something to do with that. It has something to do with how Christ has to leave the world to kind of fill the world with God's presence completely."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":2297.35,"end":2311.67,"speaker":"Neil","text":"Yeah, that's that short parable about unless a grain of wheat dies and falls, it remains alone, but if it dies, it produces this harvest. And so Christ explains that, so there's a larger participation in him that follows through the spirit."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":2311.67,"end":2319.07,"speaker":"Jonathan Pageau","text":"All right, how about this, Neil? If you. If you're able, like, try to kind of try to participate a little bit in the chat. Not participate, but like, see if there."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":2319.07,"end":2319.47,"speaker":"Neil","text":"Yeah, yeah."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":2319.47,"end":2322.51,"speaker":"Jonathan Pageau","text":"If anybody says anything intelligent in the chat, it rarely happened."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":2322.51,"end":2323.63,"speaker":"Neil","text":"Never, right? No."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":2323.71,"end":2325.07,"speaker":"Jonathan Pageau","text":"Nobody said something."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":2325.23,"end":2327.15,"speaker":"Neil","text":"Bradley will. Will block them."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":2327.15,"end":2327.87,"speaker":"Jonathan Pageau","text":"You'll block them."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":2327.87,"end":2334.19,"speaker":"Neil","text":"If they say something, they say something good. So what's this with 28 degrees Celsius? Who uses Celsius?"}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":2334.19,"end":2335.63,"speaker":"Jonathan Pageau","text":"What is that, Canadian man?"}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":2335.79,"end":2339.95,"speaker":"Neil","text":"Oh, wait, is this like French for like, accept or ban? I'm gonna block people."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":2340.43,"end":2343.23,"speaker":"Jonathan Pageau","text":"That's somewhere. Don't comment on those being blocked."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":2343.31,"end":2343.95,"speaker":"Neil","text":"They don't."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":2344.04,"end":2344.96,"speaker":"Jonathan Pageau","text":"They don't deserve our attention."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":2344.96,"end":2345.68,"speaker":"Neil","text":"All right, got it."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":2345.68,"end":2351.56,"speaker":"Jonathan Pageau","text":"All right. So sorry, sir, a Jafka asked, what is the difference between a healthy religion and a sect."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":2351.8,"end":2352.2,"speaker":"Neil","text":"Cult."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":2352.6,"end":2468.74,"speaker":"Jonathan Pageau","text":"Wow, that's a weird question. I mean, religion is based on. Religion is. Are based on true revelations. Right? They're not just someone who. And they also are never something new. They're never something self declared. So listen, actually, this is if you wanted to think, to look at it, even in terms of Christianity. So a prophet. Let's not even talk about a religion. Let's say prophets and religious authorities are never self declared. So if you want to know if something is a sect or cult, the first thing you can see is, where does that guy come from who told us that this person had authority? Are they just self declared as being revealers or whatever? Whereas even the story of Christ, Christ goes to his own cousin, St. John the foreigner, and then he asked St. John to baptize him. And St. John is like, why am I baptizing you? You should be baptizing me. And Christ says it has to happen this way. Even though Christ had the ultimate authority in the way that the story laid itself out, he had to receive his authority. From above. And that there had to be like a public vision of that. But it also had to come through this prophetic line of prophets where it was almost like St. John was also initiating him or kind of acting as someone who is pointing to him and saying this is the one, right? This is the Lamb of God who takes away the sin of the world. And so that's why you can understand that also when Christ came into the world, he didn't just start a new religion. That's nonsense. Jesus did not start a new religion. He came as a revelation of the manifestation of God which happened in the time as the God of Abraham, Isaac and Jacob, but also as the God of Noah and as the God of Adam. And so it's a continuation, not a, not a new thing. So most of the sects and cults you will see are like self declared pastors or self declared gurus or self declared this. And they're. That's a good sign right away to know if something is total nonsense."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":2469.06,"end":2514.31,"speaker":"Neil","text":"Yeah, I think the short of it too, like every friend I've ever known that's been in the cult, there's always a leader. Just a real basic way to look at it too. There's always seems to be a leader who's trying to supplant your decision making power with their own. You know, they're trying to, they're not trying to build you up to go out in the world and make better decisions. There's this kind of micromanagement kind of approach too. Now Jonathan Henry, he was asking, I think he's about asking about your heavenly mountain picture here can be understood like fractally as each soul covered with fig leaves, outwardly reliant until baptism when the living water Christ returns. I've always been fascinated with this image, but this, but the whole idea here is that the image does work practically on every level."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":2514.39,"end":2748.73,"speaker":"Jonathan Pageau","text":"Yes, yes. So the image of everything can be seen as an image of a person. It can be understand, of course it's not, but it can be applied to a person where the highest aspect of you is something like Christ in you. That is the highest aspect of you, the aspect of you where you actually touch the infinite. Where it's in some manner not you anymore, but it is nonetheless in you. And then you have the different faculties of the person, the different faculties of the soul leading also to the garments of skin and to the place in which we, you know, fall apart into, into nothingness. So, so it is definitely an image of, of a person. All right, so Norm Graudin says a question about the book of Tobit. What's the symbolic significance of Tobias getting the liver, heart and gall from a fish? Using the liver and heart to cast out Sarah's demon, using the gall to remove the film from Tobit's eyes? Did the fish connect to the coin Peter finds in the fish or the gall to Psalm 69 that was given to the suffering man? And so this really is in my vision. It's something. It is like an apotropaic practice. And so it's really taking something of fish like this and also taking something of death and using it to cast out death, like to cast out a demon so you could think about, like, taking the gall of a fish, you know, and to remove the film from Tobit's eyes. Like, Christ takes dirt, like, takes dust on the ground. So that could be like the ultimate version of that, where he takes dust on the ground and uses it to heal the blind man. That is the way that I see it. And so the fish, the fish symbolism is extremely complicated. It's very complex because on the one hand, the fish represent that which is that below in the water, you can see it that way. And so there's a negative aspect to that. It can also appear as life, which is hidden in the waters. You know, like these shiny things that are still bright even though they're deep. They're in the deep. And so, so there's a kind of a double symbolism about fish. And so, for example, like when St. Peter finds the coin in the fish, in that case, the fish becomes just this, like, kind of dark potential. And then the surprise is the coin inside. But sometimes the fish itself acts as this surprise. Like, oh, it's. It's all dark and there's this shiny, moving thing in the waters. Yeah, so it's. It's a complex symbolism, definitely. All right, so Abe says, what is the symbolism of St. Michael being in the second of the second lowest choir of angels, archangels? One would expect an angel of a higher ranking choir to be the one to lead God's angels against the dragon and his angels during the war in heaven. And so I understand your intuition, but I think you have to understand that the highest aspect of reality is not fighting. And also the highest aspect of reality is not managing. The highest aspect of reality is worship. So the highest choirs of angels, their function is actually not turned towards us, it's turned towards God. They surround the throne of God. They worship, they sing, they act as veils for the throne of God. And so that's why the highest angels are actually in some manners, not involved in the things of humans. And then as you come lower, then you. You see kind of an activation of God's will into the world through these lower choirs of angels which are now relating directly to us. And so you could understand that, you know, the. Maybe you could see it like the higher. Higher choirs of angels are acting subtly on the angels that we see as acting more explicitly, let's say. And so the manner in which, for example, the higher choirs of angels would be experienced by the archangels, you know, they might see them in a kind of maybe more active role because they're closer. But that's very speculative on my part. But that's why. That's why is because contemplation and prayer and worship is higher than fighting and managing the world."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":2749.13,"end":2755.01,"speaker":"Neil","text":"So there's no chance. It's not that they had too many tenors at the higher choir already. And Michael, was it? No. Okay."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":2755.01,"end":2756.37,"speaker":"Jonathan Pageau","text":"He was more like a real important."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":2756.37,"end":2764.41,"speaker":"Neil","text":"Question here, I'm noticing. I can't skip this one. You know, Jacob the fool Jacob. Yeah. He says, what's the symbolism of a grown man wearing jorts he made himself?"}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":2764.49,"end":2765.81,"speaker":"Jonathan Pageau","text":"I didn't even know. What are jorts?"}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":2765.81,"end":2767.89,"speaker":"Neil","text":"Jorts are like. You cut jeans into shorts."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":2767.89,"end":2771.53,"speaker":"Jonathan Pageau","text":"Oh, man, that's like rebellion. I think it's just rebellion."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":2771.61,"end":2773.21,"speaker":"Neil","text":"I feel like you found a picture of me online."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":2773.21,"end":2779.99,"speaker":"Jonathan Pageau","text":"I think, Jacob, I think you're. I think you're. I think that when you see that, you see someone's secret, deep rebellion in their hearts."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":2780.07,"end":2780.43,"speaker":"Neil","text":"Yeah."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":2780.43,"end":2783.51,"speaker":"Jonathan Pageau","text":"No, but I've worn jorts before, but I'm grown up now, so why would."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":2783.51,"end":2791.15,"speaker":"Neil","text":"I do that, Neil, That's a question for Jacob, because. I don't know. He don't wear Jordans. Not standing up now."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":2791.15,"end":2801.87,"speaker":"Jonathan Pageau","text":"All right, all right. So Alex Cilento said, Jordan Peterson, ask Muslim Christians and Jews to unite over our book in order to protect what is sacred. What is your take on this idea? Is this possible and."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":2801.87,"end":2802.76,"speaker":"Neil","text":"Or pragmatic? Go."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":2803.08,"end":2960.74,"speaker":"Jonathan Pageau","text":"So for all my love of Jordan, I think that. No, I don't think that we are people of the book. Honestly, I do not think that Christians are people of the book. I think we're people. I think that saying that we are those who worship the one God, it would be better, you know, in order to understand what it is exactly that binds us, because our book doesn't bind us. You know, the. The reality is that. That, that. Oh, I understand, you know, Islam, the way that it sets itself up is that it supersedes Christianity, and it supersedes Christianity and Judaism in ways that are very extreme, because although they keep the story, they've changed the very essence of the story. So they, for example, so they say Christ, but they say Christ was not crucified. And so they say Abraham, but then they say it wasn't Isaac who was the preferred son and the one who was going to be sacrificed. And so in some ways, they keep the story, but they really remove what, at least for Christians, is the very core and essence of the story. And so I think that, nonetheless, I do think that the fact that Christians, Jews and Muslims believe in the God of Abraham and that they also do have a monotheistic direction, I think that that might be a better place for us to be able not to unite together in a. In a. In a direct way, but see each other sometimes as allies, especially in a world where things are falling apart, you know, and there's this, like, there. There are satanic orders that are appearing around us. I think that in that case, it would be very useful to. For Christian Jews and Muslims to work together to the extent that they can. Just like I believe in the same thing in Christianity, I think I'm not a fan of simple ecumenism, where it's like we're all just going to get together in Kumbaya. I think that we have to recognize the reality of our differences and also understand the manner in which we are joined together to the body in which we commune. But I will ally myself with Protestants and Catholics every day of the week in the places that it is appropriate to do so. And so I think in terms of Jews and Muslims, I think that is the same. And you could also, to be honest, you could actually extend that even bigger and say there is a manner in which all traditional religions of the world could ally themselves in some ways to fight the AI system of Antichrist, which is kind of looming on us where this kind of weird, secular, technocratic world. So I think that there could be ways for us to unite across all kinds of different groups."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":2960.74,"end":2962.62,"speaker":"Neil","text":"Let's say. You got more croissants over there?"}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":2962.62,"end":2962.82,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":2962.82,"end":2963.22,"speaker":"Neil","text":"I don't know."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":2963.46,"end":2964.54,"speaker":"Jonathan Pageau","text":"Someone's like, what's going on?"}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":2964.54,"end":2965.98,"speaker":"Neil","text":"Who's next? Coming in the room next."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":2965.98,"end":3194.51,"speaker":"Jonathan Pageau","text":"Why are they yelling? All right, so it's gonna beat me up next. All right, so Marcus Davis says, what is more representative of the logo? Speaking or writing? I think that's pretty clear. It is speaking. Next question. So Express says, hi, Jonathan. Sorry, I. I'm being a little simplistic, but I think that it's clear that speaking is closer to the Logos, and you have to understand it. So if you can imagine in your mind an image of the icon of Christ, you will see that Christ has in his right hand. He holds up his hand as a blessing, which is the speaking in the sense of the direct influence. And then in his left hand, he holds a book, which is something like the roundabout, the indirect, but also the fixed. And so logos is something fluid. Fluid. Not in the bad sense, but fluid in the sense that it is direct and it is. You know, it. It holds the spirit directly. Right. When you speak, you push the spirit out is the best way to say it. Whereas the. The book would be something like inspired by the Spirit in the sense that the. The Spirit has made it happen, but it is fixed. And so it's. It's more like a boundary or a. Or a bulwark against error. Okay, so maybe that's a good way to understand the difference between speech and writing. All right, so express. Hi, Jonathan. I hope this finds you well. And I was wondering if you'd be able to comment on the significance of embodied aesthetic practice as they relate the margin and historical transition periods. Thank you in advance. Yes, I understand the question. I see it's phrased a little weirdly, maybe, for people, but I think I understand what you mean. So what you mean is that there's a manner in which, as we are in transition periods, as we are kind of at the end of something moving into the beginning of something, we can notice that even in the manner in which art is represented, whether it be for us now, like movies and music, all this stuff, whether it be in the past, whether it be sculptures or whatever, that you will see a kind of aesthetic of the marginal, of the confused. For example, at the end of the Roman Empire, there was this obsession with the hermaphroditic figure. And so you would see quite a few representations of the hermaphrodite. And so you could say, well, same thing is happening now. It's actually a sign of the end when you see the hermaphrodite, you know, manifested over and over, this confusion of identity just being. Becoming popular. So I would say that the best way to understand it would be that we need to be able to have things in their proper place. So it's not wrong to use ambiguous symbolism. Think about the way in which I'm using the icon of St. Christa, for example. It's okay to use ambiguous symbolism, but you have to understand where its place is and what Its role is. So the difficulty that we have now is that people, let's say, worship ambiguity. People have taken something which is something like abominable and have put it into the altar. Right. When the abomination is in the highest place, that's when you know, like the end is coming. Right? That's when you know when it's the end. When people have taken the abomination and put it in the highest place. Someone has put a gargoyle. So gargoyles are fine in a church, but if you see. If you go into a church and there's a gargoyle on the altar, Right. You know that we're in trouble. Okay. And so, so, so that is the best way to understand it. So you have to be wise and you have to be able to see to what extent you're acting in passion and. And in just in kind of dark curiosity or dark desires. But it is okay. Not only okay, but I think it's important for us to recapture ambiguous symbolism and let's say the aesthetic symbolism of the margins. That makes sense."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3194.59,"end":3210.51,"speaker":"Neil","text":"Yeah, it does. Well, I mean, you can see that too, just in pop culture, in a movie like Shrek, where they occupy all these fairy tale forms and he starts out, you know, with a. He makes sense as an ogre, the way he's behaving and whatnot. But then the whole point is the ogre becomes king, but the ogre stays an ogre."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3210.51,"end":3210.83,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3210.83,"end":3231.24,"speaker":"Neil","text":"And so you start to realize that they're just picking up things from fairy tale world and using them like costumes on normal personality and people types instead of as more of a cosmic image to represent a pattern to civilization. Because if the ogre sees an ogre remains king. Well, that's, you know, you have the hermit in the center of the world. What, like, how is he going to look out for the rest of the people?"}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3231.32,"end":3232,"speaker":"Jonathan Pageau","text":"Yeah, it wouldn't."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3232,"end":3234.36,"speaker":"Neil","text":"Like it's a bad story at that point. It loses."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3234.92,"end":3266.5,"speaker":"Jonathan Pageau","text":"Shrek is an upside down story on purpose every. The whole time. I mean, it is. It is definitely not only an upside down story, but if you watch Shrek attentively, right at the beginning, they tell you that this is going to be an upside down story. And that happens in the outhouse, like, you know, right away. Because when he goes to the outhouse to do his business, he takes a fairy tale book, a beautiful fairy tale book with like beautiful images, and he rips the pages out, a page out, and he uses it to wipe himself. And so that's Shrek, all Shrek. Is that image right there."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3266.5,"end":3267.78,"speaker":"Neil","text":"And smash mouth."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3268.5,"end":3269.42,"speaker":"Jonathan Pageau","text":"Smash mouth."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3269.42,"end":3269.86,"speaker":"Neil","text":"Yeah."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3270.34,"end":3271.06,"speaker":"Jonathan Pageau","text":"It's just."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3271.06,"end":3272.38,"speaker":"Neil","text":"It's not a great combo."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3272.38,"end":3276.98,"speaker":"Jonathan Pageau","text":"All right. Oh, because the song, I was like, why? Okay."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3277.3,"end":3278.54,"speaker":"Neil","text":"More copyright infringement."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3278.54,"end":3278.9,"speaker":"Jonathan Pageau","text":"Yes."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3279.46,"end":3281.1,"speaker":"Neil","text":"I only got eight notes in. Not even."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3281.1,"end":3282.02,"speaker":"Jonathan Pageau","text":"All right, so we should be."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3282.02,"end":3282.31,"speaker":"Neil","text":"Okay."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3282.62,"end":3284.06,"speaker":"Jonathan Pageau","text":"And you didn't do it so well this time. So."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3284.06,"end":3288.86,"speaker":"Neil","text":"Well, yeah, on purpose. I didn't want to. I didn't want to shatter your screen."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3288.86,"end":3352.85,"speaker":"Jonathan Pageau","text":"All right, so Maximus Maguire says. Hi, Brother Maximus. Could you tell us about a time when something in the orthodox tradition seemed very symbolically off and then you discovered it wasn't? Oh, man. There are definitely examples of that. And okay, so this is the best one. So in the 6th century, there is a famous image of Christ at the Last Judgment. This is in Ravenna. You can look it up. And so look at the story, last 6th century mosaic of the Last Judgment. Mosaic of Last Judgment. And so you see Christ sitting, and then he has his hands out, and so on his right hand he has the sheep, and on his left hand he has the goats. And then behind him, he has a bright red angel and a bright blue angel. But the red angel is. Is on his right hand and the blue angel is on his left hand. And that bothered me for 15 years. Like, it just bothered me so much. I was like, why the red angel should be on Christ's left hand with the goats, and then the. The blue angel should be on Christ's right hand with the."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3352.85,"end":3353.41,"speaker":"Neil","text":"The sheep."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3353.57,"end":3361.37,"speaker":"Jonathan Pageau","text":"And it's only much more much recently that I've understood how the left hand and the right hand cross like this and how the."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3361.37,"end":3361.73,"speaker":"Neil","text":"The."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3362.05,"end":3399.07,"speaker":"Jonathan Pageau","text":"The cause and the effect are actually opposite. And so once I've understood that, then I'm like, okay, so then I could see, for example, that the same issue happened in the icon of the transfiguration where you actually saw a crossing of the left and the right hand from the prophetic to St. Peter. Anyway, so I've been thinking about that a lot, so it doesn't necessarily always have to be represented like that, but definitely it makes sense that it is represented that way. So hopefully that makes sense. But it's a symbolism that I still struggle to communicate clearly. That's why I haven't made, like, a full video about it. But it's coming up."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3399.07,"end":3400.83,"speaker":"Neil","text":"A baseball player in the baseball glove."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3400.83,"end":3401.83,"speaker":"Jonathan Pageau","text":"Look who's in the chat."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3401.83,"end":3403.15,"speaker":"Neil","text":"Oh, Kate to grade."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3403.15,"end":3404.23,"speaker":"Jonathan Pageau","text":"Who's Kate to grade?"}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3404.23,"end":3413.39,"speaker":"Neil","text":"I don't know. She's wonderful. As far as I know, that's all I know. Kate, you missed it. We were Talking about Abelard and Eloise earlier, you would have especially liked that she's an expert on Eloise."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3413.39,"end":3418.6,"speaker":"Jonathan Pageau","text":"So, Kate, I'm taking good care of Neil. Like, yeah, he's not getting into any trouble at all."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3418.68,"end":3423.16,"speaker":"Neil","text":"He's feeding me and stuff. It's really helpful sending me to bed at a proper hour."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3424.68,"end":3501.86,"speaker":"Jonathan Pageau","text":"All right. And so here we go. So Brandon asks. Hi, Jonathan. Hope all is well. Spent a lot of time thinking and learning about God, but less communing with him in prayer. That is probably all of our diseases. So mine as well. My assumption is that communing with God is of far greater importance than thinking and learning about Him. Yes, you are right. However, I can't help but think that hitting the books still has a role to play. What are your thoughts on the relative importance of these two things and how they interplay with one another? God bless you and thank you. So the best way to understand it really is that it's much lower on the ring of importance. It's much lower on the ring, the hierarchy of what we should be attending to. But that, like you said, it does have its place, and to a certain manner, it can be proper preparation for our prayer life. Although we should be aiming towards prayer. But I. I think that all of us, especially that live in a. In a secular world that we. That. That, you know, we go to church once a week or twice a week. It is. It is something that we all struggle with and we're distracted and I struggle with the same. But I think that, you know, we do what we can, and with the grace of God, you. It's good that you. It's better that you learn about God in reading about that in books than you learn about other random things or evil things or whatever it is you're doing. And so hopefully we're all moving together towards a deeper and more profound prayer life."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3502.1,"end":3506.42,"speaker":"Neil","text":"Now. Do we really live in a secular world or a world that thinks it's a secular world?"}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3506.58,"end":3579.12,"speaker":"Jonathan Pageau","text":"I would say to the extent that the secular world is an extension of the sacred world, if we could see it that way, that it is kind of like the outside. So the manner in which, like I was reading St. Gregor of Nyssa again just this week, and he does talk about the difference between, let's say, the sacred reality of the church and of its mysteries and the secular world, the pagan learning, scientific learning, all these things, he does oppose them, and he sees it as one should simply be subjugated to the other. And so he talks about, for example, he uses the image of Moses's wives. The fact that Moses, or even Moses's mother, for example, is a great, great version of that, where he says Moses had two mothers. He had a Hebrew mother and an Egyptian mother, and that the Egyptian mother is all of the secular world, you know, like I said, learning philosophy, etc, etc, and that it is useful, but that, you know, he got his milk like he got the actual. The food he would get from his true mother. And so if we subordinate, let's say, the secular world to the sacred, then it actually ends up being, like you said, in some ways, it actually just flows from it. It actually kind of is just another instantiation on the ladder of the same type of thing."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3579.44,"end":3584.8,"speaker":"Neil","text":"Yeah, but if yogurt is just milk gone bad, how do we know when yogurt goes bad? It is."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3586.56,"end":3588.88,"speaker":"Jonathan Pageau","text":"It's a hierarchy. It's just a hierarchy, you know."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3589.28,"end":3590.04,"speaker":"Neil","text":"Got it, got it."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3590.04,"end":3620.19,"speaker":"Jonathan Pageau","text":"That's how we get out of all these questions. Hierarchy. All right, so Anders Rostad says. Hi, Jonathan. What is the symbolism of having pictures of the royal family by the toilet? What? This is common practice in Norway, typically in old cabins. I've heard that the practice started because back in the day, paper for magazines were used to clean oneself. However, the pages with the picture of the royal family were not used for this, but saved and put on display instead. I've never heard anything of this. I never heard any of this. So."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3620.99,"end":3621.87,"speaker":"Neil","text":"Works for me."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3622.19,"end":3626.83,"speaker":"Jonathan Pageau","text":"Yeah. So I'm afraid that I cannot answer. Do you have an answer? Do you have an answer, Neil? It's very odd."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3627.07,"end":3629.23,"speaker":"Neil","text":"Yeah, but it's not the right one. Continue."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3629.47,"end":3633.39,"speaker":"Jonathan Pageau","text":"All right, so, Dorothy. All right. Wesley. Wesley Swank is there."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3633.71,"end":3634.27,"speaker":"Neil","text":"All right?"}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3634.27,"end":3635.23,"speaker":"Jonathan Pageau","text":"Oh, but he's been."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3636.6,"end":3638.04,"speaker":"Neil","text":"Someone's been. There's a lot of blocking."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3638.04,"end":3639.16,"speaker":"Jonathan Pageau","text":"Sorry, sorry. A lot of blocking."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3639.16,"end":3645.88,"speaker":"Neil","text":"You should see behind the scenes, the chaos of YouTube, yogurt and milk. Summon the bots. That's it. I'm sorry I mentioned yogurt."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3645.96,"end":3670.76,"speaker":"Jonathan Pageau","text":"Come on. Wesley's not a bot, though. Wesley is our friend. Oh, yeah, yeah, yeah. He's our friend. All right. Sorry. So Dorothea says, what is significance of the wife of Moses rather than Moses himself performing the circumcision of their son? Then she touches his feet with the foreskin, question mark. For some reason, it reminded me of the painting of the Virgin standing on the head of a snake. And I guess you could view circumcision as something like a snake removing its skin, but I don't know. So the way that. The way that."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3671.24,"end":3672.36,"speaker":"Neil","text":"St. Gregory of Nyssa."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3672.36,"end":3759.5,"speaker":"Jonathan Pageau","text":"That's right. It's always. I gotta go back. St. Gregory of Nyssa. So the way that St. Gregory of Nyssa describes it is that it has to do exactly with the foreign wife. And so Moses marries a foreign wife and she is like a companion, the way that secular. The secular world is a companion to us, but that. That companion has to purify its fruits, you could say. So it's not just okay on its own. And so that's what circumcision is. So you could say that the way that it's seen is that in circumcising her son, the wife of Moses, let's say, purified the fruits of their union and made it proper, you know, and so removing the garments of skin, which is the mark of the foreigner, is the manner in which that happens. Now, the fact that the foreskin is touched to the feet of Moses, this is not St. Gregor Nyssa. This is my own intuition. I think it has to do with Moses's sandals. And it's to relate. So St. Gregory of Nyssa relates directly circumcision with removing the sandals at the burning bush. But he doesn't talk about that story, particularly about that. But I think that's what it is. I think that, you know, he understands it completely and he doesn't give you all the details. So I think that the fact that. That the wife, that Deborah will touch Moses feet with the. The foreskin is to help you understand that when Moses removed the sandals, it's something like the circumcision itself."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3759.74,"end":3807.07,"speaker":"Neil","text":"And then. Well, also, he kind of sums that chapter up or that little section up with something practical. Because in the life of Moses, he's really giving this very practical advice on how to understand these things that happened in the story, in the life of Moses, but also like a takeaway. So his principal takeaway from that, I thought was so cool, was the idea that, you know, taking the foreign wife. It's okay to entertain foreign philosophies and look for the good in them, but as long as no defilement remains, right, if you leave the defilement with it, you know, if you pick up this practice or like someone was talking in the chat about, you know, other religions that seem to have some good symbolism and things like that, like, all good is God's good in that sense. But at the same time, if you. If you leave the foreign element that defiles the practice, then it's no good."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3807.23,"end":3807.51,"speaker":"Jonathan Pageau","text":"No."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3807.51,"end":3807.83,"speaker":"Neil","text":"And you."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3807.83,"end":3864.27,"speaker":"Jonathan Pageau","text":"And you really have to take it like this is. This is extreme. So, for example, you know, the fathers or the ancient Christians, they would read, you know, something like Metamorphosis by Ovid. They would get, you know, powerful intuitions and powerful moral intuitions from them. But if you read Metamorphosis on its own and there's scandal after scandal, everything about it is scandalous. The same with Plato. So we can take things from Plato that are. That are powerful and useful. And you can even read the Symposium, for example. I've talked, I've mentioned this before. You can read the Symposium and view the manner in which desire is transmuted into higher goods. But it's like, yeah, but they're also a bunch of pederasts. And like, that's not good. Like, we have to be able to get rid of the aspect of it which is, which is dangerous. And, and so, so, so that's what I think. That's the work that St. Gregory is calling us to do as Christians in kind of purifying pagan knowledge towards a better purpose."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3864.51,"end":3864.91,"speaker":"Neil","text":"Right."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3865.23,"end":3868.11,"speaker":"Jonathan Pageau","text":"All right, so do you see something in the."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3868.43,"end":3869.79,"speaker":"Neil","text":"I'm just going to make sure it's okay."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3870.56,"end":3870.96,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3870.96,"end":3888.8,"speaker":"Neil","text":"I mean, this is interesting to me. Mika. Hey, guys. I'm new to these questions today, Q and A sessions. My question is the following. How to know when one, including myself, can. I think that's realized being an Orthodox Christian. What are the marks of being true Orthodox?"}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3889.2,"end":3944.11,"speaker":"Jonathan Pageau","text":"I mean, if you mean like external marks, like, you, you have to be baptized, you have to be Chrismated, and then you also have to go to confession and you have to, you have to commune. Like, that's how those are, like, say, the external marks of being Orthodox, you know, so there is, There is something which is embodied. It's a practical thing. It's not just about what we think or what we believe. And then you have to say the creed. You have to, to. You do have to believe certain things. You don't have to believe everything that every Orthodox believes, but you have to. There is a certain quantity of things and it's not clear. It's organic, it's in negotiation with the, with your priest, with your history, with, with the hierarchy of things that you have to adhere to. But that's how you. That's how you know. You know, if you're not, if you're not. If you're not baptized and you're not Christmated and you don't commune, you are not Orthodox in any way. Not even like little Orthodox."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3944.11,"end":3944.47,"speaker":"Neil","text":"Right?"}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3944.47,"end":3959.24,"speaker":"Jonathan Pageau","text":"Because. Because I think that any, even the most Protestant denomination, like that, more the most kind of, let's say, Even home church would believe that you have to be baptized. Right. That in order to be truly participating in the body."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3959.32,"end":3991,"speaker":"Neil","text":"I mean, and now that's true. That's one of the things that's confusing for some people, I think, with the reading Acts, because there are moments where you find these pockets of people that have believed in John's baptism. But there's the. There's an actual, like hand to hand transfer of the church in body too, that the apostles would go out and then they would receive the Holy Spirit, not just the baptism too. So that's something when you're trying to understand Orthodoxy too, I think it's hard to understand in the modern world because we think of everything as just the propositional knowledge, not where the body resides and how it resides."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":3991,"end":4002.04,"speaker":"Jonathan Pageau","text":"Yeah. So when you were Chrismated, when you were baptized, and then you're Chris mated, you get the 2 of what Neil's talking about. There's baptism and then there's reception from above of the Holy Spirit."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":4002.37,"end":4050.11,"speaker":"Neil","text":"Yeah, that's a longer conversation too. But one of the things I think that is hard to understand too, prior to, you know, the last, you know, 500 years, is that most of the arguments and attempts at schisms in the church, for a long time, no one, it seemed like there didn't seem to be any power to just break off and start something. That lasted for a long time. It was. It was almost like you're working at a police department nowadays and you had some difference of opinion about, like, what the police ought to be doing. You can talk to your boss about it, you can try to change people's minds, but you can't go and start your own police department. That's right. And so, you know, you have no authority to start your own police department. So there was a more embodied way of looking at what the church was, where people were really arguing over for what this body should be doing and believing more than they thought they could be. Like, well, if there's a difference of opinion, we have the right to go over here and just start our own police department, if you will."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":4050.19,"end":4120.64,"speaker":"Jonathan Pageau","text":"All right, so Blake straight asks if Christ fills the hierarchy and Christ is in all things, is communion the gift given to help us understand this like God is everything, but as regular human, it's impossible to live in this perfect, this world of perfected love for very long. So communion is our portal towards this re understanding. So I think I would be careful to, let's say, formulate it as just understanding. It really is knowledge in the deepest sense of A man knowing his wife, it is an embodied participation. So that's first thing. But in a certain manner, yes. I think that the best way to understand it is that just like Christ is the pinnacle, let's say, and is the incarnation of God and man, and that to the extent that we are in Christ, we participate in that reality. In the same way, communion within the life of the Christian is the pinnacle of that, of the place where we encounter God and we receive God in us. But then that also pours out and flows out into everything else. And so you have to see it in terms of hierarchy. Hierarchy, that's the answer to everything."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":4120.8,"end":4136.8,"speaker":"Neil","text":"I think, too, in a modern sense, the words do this in remembrance of me people. I think in a modern setting, that word remembrance is. Means like, oh, just, you know, emblematically or. Or, you know, propositionally. That's what's really important here, the explanation of what we're doing, not the act itself or the sacrament itself."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":4137.12,"end":4217.27,"speaker":"Jonathan Pageau","text":"Yeah, and. And I mentioned this before, but. But memory is the manner in which we are connected to something which is distant from us. So it's not a. It's not just a theoretical connection, but it is a true connection to something which is far away from us. And the notion of pure memory is something like a paradox where the pure memory that Christ is giving us is something where it is both distant, that is, it is bread and wine. But we say it is fully the body and blood of Christ, not just a sign, not just an emblem, but it is a true transformation and especially the orthodox tradition, while it also remains red and wine. So it is a paradox. Of course it is, but it also. If you. If you. If you peer into the paradox with the right eyes and the right disposition, you'll notice that it really is, in a way, the ultimate representation of how reality actually lays itself out, you know, in terms of how patterns, you know, multiply themselves. And this idea of the memory, of the principle which has given the. The pattern that you're participating in. All right, so Jared Widener says. Hello. Jonathan, could you comment on the symbolism of either excessive or restrictive drinking of water? I don't know. Do you have an insight on that? I don't. I don't know."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":4217.27,"end":4223.27,"speaker":"Neil","text":"I can just start talking about it. Isn't that what you do? You just don't sound like you're doing."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":4223.27,"end":4224.59,"speaker":"Jonathan Pageau","text":"Is that how you usually do it?"}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":4224.59,"end":4233.04,"speaker":"Neil","text":"Yeah. How would you start talking? Well, you guys know, the water is. It's. It's not actually wet. It wettens. That's the first thing we need to understand about water."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":4233.28,"end":4318.42,"speaker":"Jonathan Pageau","text":"All right, so we have to stop now. So, so the. I mean, I think that. I mean, I don't know. I've never thought about this. Like, I mean, obviously if you drink too much water, you will feel bloated, right? And you internal flood, and you'll feel an internal flood. And if you drink too little water, then you'll be dehydrated and you'll feel something like a desert. So your lips will start cracking just like the ears start cracking. Your little microcosm. I don't know if that's what you mean. I'm not sure. Or if you mean more like fasting maybe. I'm not sure. Anyway, so that's the best I can do. Sorry. All right, so Tiered says, what is the symbolism of stress and the resulting need for distraction? So, I mean, it has to do with work and rest. I think that's probably the better way to represent it is that we have work and that work builds up, you know, in us and it also, it uses up our energy. And then when we rest, then we refill ourselves. Like, right, we say we. We replenish ourselves or revivify ourselves. So it's best to understand it like work and sleep. But also, like you said, it could be distraction in the sense of, you know, of doing things purposefully and then playing games or just kind of talking with friends in a way that also is refreshing. So it's the difference between purposeful action and then rest from purposeful action, you could say. All right, so Nate Barker says, hey, Jonathan, do you have any tips or guidelines for interpreting stories symbolically?"}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":4321.3,"end":4321.7,"speaker":"Neil","text":"Next."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":4321.86,"end":4334.1,"speaker":"Jonathan Pageau","text":"Next. I have a grasp on a main symbol that you and Matthew talk about. Heaven and earth, space and time, margin. But I often have trouble interpreting what a story or a part of a scripture is trying to say on a symbolic level."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":4334.18,"end":4338.1,"speaker":"Neil","text":"So can we allot the rest of the time for this one? This is a good one."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":4338.42,"end":4461.1,"speaker":"Jonathan Pageau","text":"It is a very good one. So there's. There are a few things. So one is the pattern that Matthew, for example, sets out in his book is. Is the. Is the very powerful. It's almost geometric, right? It's geometric, it's mathematical. It is this kind of pure pattern where if you see the pattern, then you start to see it manifest itself in the world. But you also need a kind of experience. So just because you read Matthew's book, you probably won't have enough to then go and interpret everything. You have to practice that. Practice also means filling up the pattern with information, with details. So what you need to do is you need to read a lot of stories. You need to read the Bible, Read the Bible, read the stories, know the stories. Like, do you know the stories? You know, can you, if I ask you, can you tell me the sequence of Genesis? Like, what are the different stories in line? And if, can you know after that what happens in Exodus and Joshua and the Judges? Like, you have, let's say, a basic story structure in your mind of history of the Bible. And then, then you also probably need other stories, especially in our world now, like, do you know your fairy tale? Do you know? Do you know the stories? And so once. So there is a kind of work that you have to do that is not just learning the pattern. And then when you know the stories and you have them in your mind, especially if you have them in you, then the connections will start to happen, if you're attentive. And you'll start to see the patterns and you'll start to see, well, this is a stand in for that. This is a stand in for that in that story, especially within scripture at first. And then slowly your muscle is going to say, your interpretation muscle is going to start to manifest itself. So that, to me, honestly, is something that I think is important. And so you have to be patient. And it takes time and it takes like anything, it takes practice and it takes attention. And I think slowly you'll, you'll get there."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":4461.42,"end":4518.35,"speaker":"Neil","text":"So, yeah, I love some of the guidelines you've given in the past about these things too, that like, also it should work fractically up and downwards. Like it can be the element of the story, can be description of an internal process. It can be a description of like a family in action, a city, a cosmic pattern. Also looking for things that appear in the story as a condensed pattern that happens in reality. You know, for example, if you're watching a story and you see someone go to a crossroads and they're going to sell their soul, like this is like a fun trope in movies I like. And so that pattern happens slower in real life. Have you ever known someone who's, who's been going after something at the sake of everything else? You can see that they'll make these incremental decisions. They won't necessarily sign one document one time and that's the moment they sold or sold. It's something that happens over longer period of time and it gets condensed. And then the other side of it is there's patterns and stories that are things that happen very quickly in life that are expanded like the actual pattern of the story itself. And so if you start to see those things, I think it becomes more helpful to interpret."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":4518.35,"end":4593.1,"speaker":"Jonathan Pageau","text":"Yeah, that's really good advice. It's definitely good advice to always, when you're looking at a story, try to apply it at different levels of reality. Like, you'll see it when someone asks a question. Or sometimes when I'm interpreting a text, you'll notice that I'll often give an example, like a personal example, a social example, and maybe an analogy with another story to try to kind of move across all these different levels and different instantiations to verify whether or not my intuition about the story is right. If you don't do that, that's when you can kind of be led astray, especially with details. People get caught up in details of stories and start to interpret a symbol on its own, but you always. That's another advice, too, is you always have to interpret whatever symbol you're interpreting within the context of the actual story, but then also in analogy with other stories and other levels of reality. And so another thing, like, for a more complex story, one of the things that you were pointing to, Neil, is that you'll often see it within the story. You'll see a fractal relationship, which is that the elements of the story will manifest the bigger narrative, the bigger structure of the story. And so if you can start to see that, then you're probably on a good. You're probably looking in the right direction."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":4593.1,"end":4640,"speaker":"Neil","text":"Yeah. I think Tokens on Fairy Stories is a good sort of adjacent work to this idea, the way he's explaining some of the patterns. I think Tolkien was very careful not to injure the story as he breaks it down, which I think is something. You know, you can see that in the. In the story of Peter Pan that when he's been telling these stories about Peter Pan, their dog Nana drives the shadow off, because that's the grounded one. Trying to keep everybody grounded and to go on this journey and to kind of break. Because Peter Pan, especially in the Disney movie, is a really clear, like, discussion of symbolism and past storytelling in the modern world. So they recognize right away that there's an injury you have to do to the story to make it participate in a more real, like, practical way. And so that's where Wendy gets the needle and thread, and so is the shadow back."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":4640,"end":4640.44,"speaker":"Jonathan Pageau","text":"Shadow."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":4641.08,"end":4668.82,"speaker":"Neil","text":"Right. And so. But it's also warning, like, you know, because in that. I think that movie, they left the pain out of it. But, I mean, in the play, there's some pain associated with that, sewing that back onto Peter Pan's foot. And I think that's also an important thing to think about, that you don't necessarily have to understand it explicitly to participate in the story to its fullest at all. And sometimes you can actually make it a little bit like you're. Instead of being in the story anymore, you're looking at a little snow globe you've shaken up. So you do give up something when you try to break down the story too."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":4668.9,"end":4680.67,"speaker":"Jonathan Pageau","text":"Yeah, definitely, because the story will have more than just the analysis that you give of it. But if you're aware of that, then you can be careful when you're doing the interpretation. So, yeah, good advice, Neil. Good stuff."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":4681.07,"end":4682.51,"speaker":"Neil","text":"I did it. I did it, guys."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":4682.51,"end":4714.22,"speaker":"Jonathan Pageau","text":"The best answer you're given so far. All right, so. So Greg Garcia says. Hi, Jonathan. The phrase it was meant to be is becoming increasingly rare. Technology allows near infinite potential to be realized. Modern people see almost all aspects of their lives as contingent from the marriage to their friendships, communities, their. Their jobs. The paradox of choice exists in. Even for toothpaste. I was wondering what you thought of the phrase it was meant to be. For instance, do you think you were meant to start a YouTube channel?"}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":4714.86,"end":4715.74,"speaker":"Neil","text":"I like this question."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":4715.74,"end":4829.79,"speaker":"Jonathan Pageau","text":"Yeah, it's a really good. It's a really good question. No, I do think that there is. There is a sense in which some things are meant to be. And. And I think that you could say, like, in some ways, like, what's meant to be is that we all become. Are joined to Christ. Like that we. That we. That we. That is what's meant to be. So ultimately that's what it would be like. We're all called to theosis. That's what's meant to be. For us to become God through participation, but then lower, at lower level, then that can appear in different ways. But I do believe that what's meant to be will always be directed towards that ultimate goal. And so even if it's negative, like, sometimes there is suffering, sometimes there's danger, there can be death, there can be disease, but that ultimately to perceive it as meant to be should be in the manner in which it leads us towards a higher good. And so I do feel like. I do feel like, for example, that I have some kind of a mission, like, I guess is the best way to say it. And I. And in some ways, I've. Both my brother and I have felt this for a very long time, like, you know, for 20 something years. But we were just. But also just biding our time and just doing the things that God put in front of us to the moment when the opportunity to kind of come out and start to do. To do what we thought we were supposed to do didn't. I don't see it as being a YouTube channel. I see it really more as participating in the re. Enchantment of the world is something that, honestly, I felt like for 20 years, I felt like I was going to somehow have a little. At least a little participation in moving that along. And so when I saw it glimmer in front of me, it was not difficult for me to recognize. To recognize it and to move towards it. I don't know. What about you? What do you think about. Do you feel like some things are meant to be like that?"}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":4829.79,"end":4830.27,"speaker":"Neil","text":"Yeah."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":4830.75,"end":4832.75,"speaker":"Jonathan Pageau","text":"See it as meant to be in your own story?"}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":4833.23,"end":4840.27,"speaker":"Neil","text":"Yeah. Yeah, I think so. But not everything. I mean, you can be malignantly optimistic about these types of things too, and, you know, reframe your life."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":4840.67,"end":4851.14,"speaker":"Jonathan Pageau","text":"Yeah. Some people are deluded, and that's why I'm careful, because some people are definitely deluded in, like, in their. Like, they're meant to be, like, oh, yes, well, God wanted us to be divorced. Like, that was meant to be."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":4851.14,"end":4955.46,"speaker":"Neil","text":"Right, right. And so. But I mean, in. In general, in culture, it was meant to be. I mean, that's like the back end of the fact that. That there's. There's this way the world has been ordained to be. Like, so when we have an. Someone's having a moral argument, they're saying, well, I think it ought to be this way. And someone else saying, I think it ought to be this way. There's a credential at the bottom of that. And the credential is that the universe was ordained and ordered a certain way. And so that. That perspective is becoming more and more rare so that it would make sense that also the other side of things it was meant to be, would be more rare. I was trying this out on people last night, too, because I think there's a secret, newer problem that you can see with Twitter is that all assessments of what is of quality, like the fact that something is good or bad, is really becoming something that people doesn't believe exists outside of whatever the public impression is of it. So, you know, the financial space is becoming a space to be manipulated by perception only, not the actual value of the product anymore. And I think this is a breakdown that's happening on a very, like, the very bottom level of reality. So I think that's a problem too. So that's the Whole point when you're talking about Re Enchantment is to bring back the idea that you're part of the story. What you see out the window isn't an arbitrary series of events that has occurred and you've somehow accidentally appeared in the middle of them. But it's. It's a style of storytelling that puts you as part of the story, as part of the music, that your life matters. And. And what's going on has. Has a context that actually matters. So I think that's important. That's one of the. The necessary things about Re Enchantment, because it's the answer to nihilism and just this despondency people have because nothing's meant to be and nothing ought to be one way or another, except for whatever the public can argue out and controlling their perception."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":4955.46,"end":4959.34,"speaker":"Jonathan Pageau","text":"All right, so Matthew F. Says, what is the symbolism of balding?"}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":4959.34,"end":4960.86,"speaker":"Neil","text":"Oh, he's saying that because I'm here. Because."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":4960.86,"end":4961.58,"speaker":"Jonathan Pageau","text":"Are you balding?"}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":4961.58,"end":4962.42,"speaker":"Neil","text":"No. A little bit."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":4962.42,"end":4964.22,"speaker":"Jonathan Pageau","text":"I started balding with a lot because."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":4964.22,"end":4968.46,"speaker":"Neil","text":"Of COVID I just couldn't grow a beard, so I just started pulling it out in clumps."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":4968.46,"end":5005.4,"speaker":"Jonathan Pageau","text":"All right, so. So it's. This is actually a good. It's a good question. To help you understand how symbolism can sometimes be surprising is that sometimes. I think that sometimes symbolism can. Can represent things that are even opposite to each other, but they're framed by a category. And so balding is definitely like losing your extensions. Right. Losing the man, in which you kind of reach out into the world. And so it can be an image of. It can be an image of concentration. So I think a good example of that that's interesting is, for example, in the story of Elijah and Elisha."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5005.4,"end":5006.4,"speaker":"Neil","text":"I knew you were going there."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5006.4,"end":5070.01,"speaker":"Jonathan Pageau","text":"Yeah. Well, I think in that she bear. The she Bear. I think in that story, there's a whole play about the idea of, like, hairy garments and garments of skin. And so. So it's the end of a world, and Elisha gets taken up and he leaves. He. He, like, drops his hairy garments to Elisha. But Elisha is also bald as, like, a new beginning, as if, like, he's also kind of lost the fruits of the old world or something like that. And so. And you can see it, like, the idea of the hammer that floats up the top of the water. Like they're different images that are kind of. Seems to be wanting to show that. But also there's a play. So it's like he's bald, but then he calls the she bear. That seems to be Related directly to receiving also the garments of skin from, from Elijah. So there's like this. He has a relationship with animality. It's not totally clear to me, but I think that that's where you can kind of see how there's a play once you, sometimes, once you read, you can see the themes. Like there's definitely a theme about animality and hair, baldness. All of these things are playing together in the story of Elijah and Elisha."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5070.89,"end":5100.15,"speaker":"Neil","text":"So I thought you had that take. There's also this. Okay, so we'll just take graying hair, for example. So the idea that the highest mountains are topped with white snow most of the year. And so that's one of the symbolism of the graying. But also I think that balding is actually a positive symbol for people in the same sense that over time, like the idea that over time you're moving up to the mountain. Now it's a snow covered peak. Well, there's the same notion with going bald in the sense that at the higher up the mountain you go, the vegetation stops."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5100.15,"end":5100.55,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5100.63,"end":5106.71,"speaker":"Neil","text":"So it's like an ascent into Wiz. It's like a. It's like a. Over time you're growing in wisdom and gaining perspective."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5107.03,"end":5108.83,"speaker":"Jonathan Pageau","text":"That's great. That's a really good interpretation."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5108.83,"end":5109.39,"speaker":"Neil","text":"You're welcome."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5109.39,"end":5114.39,"speaker":"Jonathan Pageau","text":"Yeah, they're better than the other one. You're doing well. I should have you on more often."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5114.47,"end":5117.51,"speaker":"Neil","text":"No, no, no, no, no, no. Never do that. This is not what people want."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5118.55,"end":5178.17,"speaker":"Jonathan Pageau","text":"Watch, watch this. Q and A have like three times as many ideas of the other one. All right, so Manuel Motild says. Hi, Jonathan. The icons that show the spirit coming down, Annunciation of Pentecost seem to be similar to Egyptian Aten iconography. Aten was represented as an orb above with life giving rays coming down on his creation and had no material body like the one. Like the other Egyptian gods. Is there any symbolic significance behind this? I think there is. I think there is a relationship between Aten, but also Ahura Mazda, the manner in which Ahura Mazda was represented, and Aten as this globe with wings, sometimes as being the idea of God beyond manifestation. And that is honestly, that's the way we represent God at the top of icons. As a. As a circular glory, sometimes a circular glory with just a hand coming out, sometimes just a circular glory, sometimes like a circular gory which is moving towards darkness, so has light on the outside and darkness on the inside."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5178.19,"end":5178.35,"speaker":"Neil","text":"And."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5178.98,"end":5202.5,"speaker":"Jonathan Pageau","text":"But honestly, I totally agree with you. I think that it has to do with the manner in which other ancient Worlds have represented a monotheistic God. And so it's also a good example for people who think that monotheism is just in one place in the world. It actually has instantiations that were there in other cultures or in other places."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5203.06,"end":5206.87,"speaker":"Neil","text":"Sean's about to create a rift in the sacred timeline. Read it, you'll see."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5206.87,"end":5313.1,"speaker":"Jonathan Pageau","text":"Sean, what is the symbolism of the work you are doing? Talking about symbolism? No, but I mentioned this before. Actually, I mentioned this before. It's that there, it's, it's actually quite. It's not a. It's not a simple good is to say. To say it is that when you explain symbolism, it. You could see it as a crutch maybe sometimes, or maybe you're hoping it's going to be like a, like a. What is it you call it, like a EKG or whatever. When you jump start someone with like. So you're basically jump starting someone with an electric current that in normal times you would kill them by using it. Right, right. And so I think that it's a. It's a dangerous thing to do because on the one hand, if you, when you explain something, you can limit it and you can also denature it. But when we come to like the end, where things. Nobody sees meaning anymore, it can also act as, as a crutch for a little while and also as a kind of restarting mechanism. And that is what we hope at least that it will be doing. But we, like I know Matthew, for many years, he. He asked himself whether or not he should talk about that because he felt like it could become. It could actually be like explaining symbolism away is maybe a good way to say that. So. But as you see, I mean, we've taken our. Made our decision and we do believe that in the end it is right now better to explain. Like my take is like, I'll explain symbolism and tell you to go to church. Because what I'm saying doesn't reduce the meaning. That's not the totality of what it is. It is about experience and about participation. And hopefully this explanation will at least help you dimly see why it is you should participate."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5313.18,"end":5334.14,"speaker":"Neil","text":"Yeah, no, I don't think it's. I think it's actually there's an awesome opportunity in the moment we're in, in the sense that these things were more implicitly understood for a very long time. And we kind of watched them get squashed out by this modern way of thinking and the modern way of seeing. But it didn't get so far out of sight that it was Totally lost. So now what I think what's happening is we're going to have both things at the same time."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5334.7,"end":5337.42,"speaker":"Jonathan Pageau","text":"That's an interesting idea. So, like the new Jerusalem kind of thing."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5337.42,"end":5362.42,"speaker":"Neil","text":"Yeah, it's going to actually be more. It's going to be more established because not will it return, because it's a more satisfying, meaningful way of looking at the world, a more embodied way of looking at the world. It's satisfied, more satisfying in every direction, I feel like. But at the same time, we're also going to have the structural understanding to back it up and protect it into the future. So I think right now, as a storyteller, it's an incredible time to be alive. I'm excited. All right."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5362.42,"end":5375.35,"speaker":"Jonathan Pageau","text":"No, I think you've definitely convinced me. I think when you were talking and saying that we have both, like, I really did see the difference between the innocence in the garden and a fall, and then finally the garden with the city, you know?"}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5375.35,"end":5375.83,"speaker":"Neil","text":"Yeah."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5375.91,"end":5383.71,"speaker":"Jonathan Pageau","text":"So we will. So we'll both have, you know, the technical understanding or the, you know, the manner which explain it, but also the."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5383.71,"end":5387.55,"speaker":"Neil","text":"Intuition, the natural patterns and the architectural patterns at the same time."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5387.55,"end":5394.15,"speaker":"Jonathan Pageau","text":"Man, that's good. Good stuff. All right, I'm going to stop. I'm going to stop complimenting you because I just have to compliment you after."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5394.31,"end":5398.27,"speaker":"Neil","text":"No, I just compliment him the whole time before we come here so he'll let me on."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5398.27,"end":5398.71,"speaker":"Jonathan Pageau","text":"That's."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5399.17,"end":5402.77,"speaker":"Neil","text":"He's like, oh, this guy's trustworthy. He seems to really understand it. Thanks."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5402.93,"end":5538.7,"speaker":"Jonathan Pageau","text":"All right, so Alex Couch says, what is the symbolism of the true cross of Christ being broken into pieces and given to people around the world? I feel like it should have been kept intact and preserved. I actually really like the idea because the cross is itself that extension. You know, it's like it's an extension from the center to the edges. And so I think I like the idea that the cross was actually. Pieces of the cross are sent out to kind of COVID all of. All of the world. Yeah. So that doesn't bother me at all. All right, so here we go. So someone asked, are you a Gnostic? And the answer is, no, I am a Christian. But, I mean, that's the best answer. All right, so Annie Crawford says, I was listening to the episode on Egregor's while also reading Rousseau. It strikes me that his concept of the general will, which is an emergent reality, may be a form of egregore for Rousseau, the general will of those who come together in social contract as the true sovereign of the state. However, what exactly general will is ambiguous and it seems to serve nothing higher than itself. Yet this principle governs much democratic political theory. In rejecting monarchy, have Western democracies really been creating and serving egregores? Is this why democracy is always a precursor to tyranny? Yes, I do believe that. I do think that democracy is a problem in the sense that it's often. It's the best way to say it. It can often be just secretly guided in the sense that you think that it's all these people that want something, but it's because they're under the influence of something else. That's why they want it. And so what happens is in the democracy, that influence will separate itself, and so there'll be different influences. And so people will embody a particular aspect of the world and will be under its influence and then will vote for that, that they will want that. And so I think that that's why ultimately leads to kind of impossible opposition that cannot be resolved, or it leads to an actual fragmentation and breakdown of the wills into like all these different parties that are fighting amongst each other, ultimately leading again to a tyranny. So I think you've got a good. A good grasp on that."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5538.7,"end":5558.62,"speaker":"Neil","text":"Have you ever read that hideous strength by C.S. lewis? Yeah. Yeah. Because, I mean, there's something with the conversation about Egregore is I think you have in that story, and I guess it's a little bit of a spoiler, so cover your ears if you haven't read it yet. But they create this machine that's supposed to bring back the spirit that they love from the past, is supposed to guide them, but that's not what occupies the machine."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5559.24,"end":5559.6,"speaker":"Jonathan Pageau","text":"So there's."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5559.6,"end":5569.6,"speaker":"Neil","text":"There's something about this discussion of Ergors. I kind of feel like, yeah, there are certain. Maybe there's certain spirits out there that are happy for you to think that you invented it, so now it could control you."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5569.6,"end":5570.16,"speaker":"Jonathan Pageau","text":"Yeah, exactly."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5570.16,"end":5579.72,"speaker":"Neil","text":"Because I just don't see. I don't. I don't see things really manifesting that way, that there really is something that can exist in the heavens that came just bottom up. So."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5579.72,"end":5580.32,"speaker":"Jonathan Pageau","text":"Yeah, exactly."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5580.32,"end":5606.43,"speaker":"Neil","text":"All right, you're right. Okay, so can I do. Right. Yeah, go for it, Austin Rush. Well, I'm going to give Austin Rush a, you know, question here because they complimented me. No. Would you. They would love to see something about the story symbolism in the story of Gideon. And I've always been fascinated with the story, too. I've always thought it's been a really. It's a Real beautiful scene too. In a really interesting scene. So did you ever do anything on Gideon? I don't think I have answer many questions."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5606.59,"end":5617.09,"speaker":"Jonathan Pageau","text":"No, not most people I know. I don't think many people have asked questions about the Serb Gideon. So maybe I could do that, I could do a video. But I would have to think about it because it's a, it's a complex story. There's a lot of stuff going on."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5617.25,"end":5618.93,"speaker":"Neil","text":"With a little lantern reveal at the end."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5618.93,"end":5669.58,"speaker":"Jonathan Pageau","text":"Yeah, yeah. The trickery, that trickery that's related to light, you know for sure. Like the, the, the fleece has been, is an image that a lot of the church fathers use. But I have to think about it more and maybe we could do that. All right. Okay. So Nick Egginsberger says. Hey Jonathan, seeing as both the left and the right hand are important symbols, I was wondering what the symbolism of the left handed person would be. I'm sorry if you have spoken on this before. I was not able to find any concrete answer to that. And so you know, in most, I think in most traditional societies the left handed person would have been guided towards using their right hand. They would have been rectified. It's a direct way of saying it. And so the thing about being left handed is that you are in a way. I'm left handed by the way. So I really feel. Yes. So I can say this."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5669.73,"end":5671.73,"speaker":"Neil","text":"That's why I was killing you in arm wrestling last night."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5672.85,"end":5689.05,"speaker":"Jonathan Pageau","text":"So, so, so the, the left handed person will appear as an exception and as a marginal person. And will be awkward. Will be more awkward because the world is made for right handed people. So for example, like when I write."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5689.05,"end":5690.61,"speaker":"Neil","text":"Rules of the world are made for right handed people."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5690.61,"end":5697.87,"speaker":"Jonathan Pageau","text":"So it's like when I write, you know, I smear my hand because I'm writing over the text that I'm writing."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5697.87,"end":5698.31,"speaker":"Neil","text":"Yeah."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5698.31,"end":5708.07,"speaker":"Jonathan Pageau","text":"So that's a little example. But it's like when I'm driving a car, I always like if I'm drinking something I have to like put the drink in my other hand because I can't drink with my right hand drink."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5708.07,"end":5708.99,"speaker":"Neil","text":"You can't even do that while I'm."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5708.99,"end":5711.71,"speaker":"Jonathan Pageau","text":"Driving up so much."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5712.43,"end":5719.95,"speaker":"Neil","text":"So much coffee in my new coffee. So much like more than that was in the cup. It was magic. It's great."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5720.51,"end":5772.96,"speaker":"Jonathan Pageau","text":"So I think that, that, I think that that's what will happen and so the left handed person will appear as more awkward. But I do think that there's also another possibility which is that the world will naturally rectify even if like so, so A good way to seeing it is that we don't live in a world where they force, let's say, left handed people to write with their right hand anymore. But the world naturally rectifies us. It just kind of happens. And so because of that there's a man in which sometimes the left handed person also has more scope than the right handed person because I end up being ambidextrous much more than a right handed person would be. So there's a disadvantage, but that disadvantage can be turned into an advantage, just like you could say the same way in which a marginal person themselves can have more flexibility, let's say. And so I think that that's the way that I see it."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5772.96,"end":5828.61,"speaker":"Neil","text":"Well, you see this too in a real practical example in two different sports, one's golf and one's baseball. In golf it's only like 4% of the golfers are left handed. They're underrepresented because golf clubs are expensive. Most of the golf clubs in the world are right handed. And as a left handed person you're less likely to have easy access to clubs. Right. So, but then a sport like baseball, you can see which is more like a head to head combat. Left handers are far more overrepresented because for a right handed pitcher it's harder to throw to a left hander and people are face less left handed. Picture pitchers on the way up. So it becomes awkward to hit against a left hander. So there is like, there is like a surprise to being left handed, like when it comes to combat is that, you know, you're used to training against right handers, right handers, a left hander who might not even be at your skill level can just totally catch you off guard. So there's something about a surprise in the left handedness. But also like most things, like it kind of shows us things we would take for granted if it didn't exist either. Just, you know, aspects of the world."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5828.61,"end":5831.41,"speaker":"Jonathan Pageau","text":"Yeah, but I remember seeing that when I was doing fencing when I was younger."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5831.69,"end":5832.01,"speaker":"Neil","text":"Oh."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5832.25,"end":5840.37,"speaker":"Jonathan Pageau","text":"I mean I could the same, I could beat people that were clearly much better than. Yeah, but I was always fighting against right handers, so I had trained that way."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5840.37,"end":5840.61,"speaker":"Neil","text":"Right."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5840.61,"end":5845.45,"speaker":"Jonathan Pageau","text":"Whereas they, they would rarely fight against left handers. And so they were struggling to kind of figure out how to get in there."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5845.45,"end":5850.25,"speaker":"Neil","text":"Ah, who wants to see a Jonathan Pajo fencing video? Oh yeah, let's get one of those up here."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5850.25,"end":5971,"speaker":"Jonathan Pageau","text":"All right, so Joshua Foreman says Mrs. Harris goes to Paris is a modern take on older stories. And the much better movie Mrs. Harris, which are plays on the story of Cinderella. I don't think I know what you're talking about here since you've not covered Cinderella in full to my knowledge. What is the basic symbol, the basic symbolism of the story of Cinderella from the perspective of the woman? I ask from the woman's perspective because of these modern takes, but also because as a symbol of the bride of Christ, Cinderella seems pertinent to our current situation as loved lovers of a true savior. So I don't know. I don't even know what that is. Ms. Mrs. Harris goes to Paris. But Cinderella is an image of. It's an image of the, the. The. The gold hidden in the fish. Right? It's the idea of beauty hidden in ashes. And it's the idea that you have to be attentive and that there's something about femininity which is also in a way, hidden in the lowest, in the lowest. And if you, if you have the right attention, then you will find that secretly hidden in these low places are. Can be the highest thing or the most beautiful thing. And so I think that that's what it's about. It's about hidden beauty. And so that's why, that's why she is made beautiful by her fairy, you know, fairy godmother. And that's why, you know, the prince doesn't know her. He sees her beauty, but then he has to search for her and he has to search the land. And that's why it also has to do with the shoe, because it has to do with the bottom of reality. It has to do with like finding. Finding precious things in. In hidden darkness. Yeah, that's why it's the shoe as well. And so it's so also why whether Cinderella means ashes. And so. So it's cinder. So she. Because she, she lies in the ash. And so she, she is herself, let's say, related to the ash. And so you can think of it like almost like an alchemical process too. Like the idea of. Of transforming the ash into gold, let's say."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":5971,"end":6001.85,"speaker":"Neil","text":"Well, I think too is just as a storyteller, it's a very winning pattern. I mean, it engages people and it gets used inappropriately sometimes because of that. Like, you know, but a good example of that is like Harry Potter living under his, you know, distant relative staircase and that secretly there's something royal about him. There's a sense of royalty to him. He's destined for something. And that Cinderella, the same kind of thing. And you can kind of imagine there's a relatability for people who feel just part of the herd out there and unseen that there, there might be something about them."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":6001.93,"end":6122.19,"speaker":"Jonathan Pageau","text":"You see it in the story of Christ. Christ hiding in the cave with the animals in the lowest place in the manger is another version. What's the ultimate version in fact of that notion of the hidden, the hidden good. And so, so yeah, hidden in the cinders. Hidden in the cinders is Abella. So Ken Lowry says, I've been looking into bridging between evolutionary theory and Christianity. These strike me as analogous understandings of humanity in relation to the transcendent from the perspective of rational particularization and spiritual revelation, religio of particulars respectively. Both frames depend on a progressive revelation, discovery of heaven into earth, chaos into order, etc. I'm wondering how you might approach this bridging as the frames you have communicated are. Only once I see this bridge developing upon. And so I think it's an, it's a possible interesting venture. I would be careful. How can I say this? It's like I say this. I think I said it often. I think I like the notion of natural selection. I think that's wonderful because it, it actually reveals the manner in which being persists and it also, you know, it reveals the teleological aspect of reality, how things are moving towards, towards purpose and that this framed everything. But I definitely do not like evolution as a, sorry, evolution as a story. And so I would, I would just be careful to evolution in the sense of the way they historically describe all this like procession of, of beings, you know, and I find that just not, I just find it's not a very good, it's not a very good story. So that's what I would be careful of. Like I, I think that natural selection and the process that have been uncovered about that can be extremely useful for the religious person state. But, but that the story, if you go too much into the story part of it, it will. The Genesis story is a much better description of reality than that description than the description that the evolutionary biologists give us of, of the origin of things, let's say. Does that make sense?"}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":6122.19,"end":6141.83,"speaker":"Neil","text":"Oh yeah, totally. Well, the Gospel of John even kind of takes it, you know, to a more, even more, more relatable level because the, the truth and everything that's being exposed ends up being a person in Christ, the word, the logos. So I think yeah, I like your answers. That's why I watch these things. I'm watching it very close this week."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":6142.39,"end":6181.47,"speaker":"Jonathan Pageau","text":"So Joshua Foreman says if the shape of all creation is A pyramid triangle, all pointing up to the headstone, which is Christ, the incarnation of God. What is the shape of heaven? And so there are different ways to represent it. And also, like, by the way, there are also different ways to represent creation. You know, the pyramid is one way that is very useful. And so you could. You could understand creation. You could actually understand it if you saw it at the mountain going like this. You could also understand heaven as a. As a triangle pointing towards the. Towards the. The summit of the mountain. That is one way of understanding it. You can understand it as a. As just the hierarchy itself."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":6181.79,"end":6182.15,"speaker":"Neil","text":"Right."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":6182.15,"end":6232.29,"speaker":"Jonathan Pageau","text":"So that is, even, even on the mountain, you could understand that heaven is the ascent itself. It's the vertical relationship of beings. That is what heaven is, whereas earth is the horizontal relationship of being. So at any level of reality, you could understand that the vertical causation is heaven wherever you are, and that the horizontal causation is earth. So all the elements of something that's earth and the man, in which those elements come together and jump into a name or an identity that is something like going into heaven or, you know, the influence of heaven, the gift of heaven, all these ways that the Bible talks about it, you know, and so I think that that's probably the best way to, to understand it. There are different ways to represent it, but it's better to understand it, you know, because."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":6232.77,"end":6233.25,"speaker":"Neil","text":"Yeah."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":6233.33,"end":6292.97,"speaker":"Jonathan Pageau","text":"All right. So Ross Bird says, hi, Jonathan. What do you make of the parable of the unjust steward in Luke 16? I'm not going to answer, Ross, because I think I've answered this a few times, but I don't totally understand this. And, and it's. It's funny because. Well, let me read it. Let me read it. Maybe people can help. The steward is getting fired, so he goes to the master's debtors and cancels a portion of their debts. In the end, the master commends the steward and says, And Jesus says, I tell you, make friends for yourself by means of unrighteous wealth so that it fails. So when it fails, they may receive you into the eternal dwellings. And so it is a very, very mysterious description, but I think. I think it has something to do with the fact that reality lays itself out in a. In a pattern despite our will, even like, despite our. Our intentions. You could say that these things are going to happen. And so that is, like the best intuition about. I have. I don't know. Neil, have you thought about this story?"}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":6293.37,"end":6293.97,"speaker":"Neil","text":"I have, yeah."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":6293.97,"end":6295.21,"speaker":"Jonathan Pageau","text":"Actually, we'll go for it."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":6295.37,"end":6373.56,"speaker":"Neil","text":"Wow. Okay. Well, no, there's Something. Part of the mystery of some of the parables and the Sermon on the Mount is that, you know, Christ is doing something. I don't. I don't know if you've seen it anywhere else in the world at that point is that there's. There's a way. I guess the best analogy for it is the. The night sky reflecting in the ocean is that there's a reflection of the heavens above that's here. And then there's the way the heavens actually are. So there's an economy of the reflection where people can mistakenly think they're climbing. Okay, so, like, you know, the Beatitudes are like, blessed are the poor in spirit, blessed are the meek, for they shall inherit. And it's talking about all these things that according to this. This economy in this temporal lifetime, they sound like you're at the bottom. But if you recognize that what he's exposing, that part of what we're. What we're doing here is seeing a reflection of the heavens, that what the first shall be last and the last shall be first, is that. That the ones at the bottom are actually, you know, of the highest economy for heaven. So, okay, so getting into this, it's. It's another. It's like a double. You love double inversion. So there's a double inversion here is that you have this. It's like, you know, you can't love God and Mammon at the same time. But then he's still. He's showing you ways that seem like a trick within the system that it can actually be used to create something. Like, even that can be used to point to something eternal."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":6373.87,"end":6375.55,"speaker":"Jonathan Pageau","text":"Yeah, but in this case, what."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":6375.55,"end":6375.87,"speaker":"Neil","text":"What?"}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":6375.95,"end":6380.03,"speaker":"Jonathan Pageau","text":"Why, like, make friends by means of unrighteous wealth?"}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":6380.19,"end":6381.39,"speaker":"Neil","text":"By means of like, meaning."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":6381.39,"end":6404.71,"speaker":"Jonathan Pageau","text":"So he's basically releasing debt. Yeah, he's releasing debt for his master. So maybe. So maybe it could be something like that. We also kind of participate in the. Like, in forgiveness in some ways. Like, of course, somehow that, like, if we act on behalf of others, like we forgive on behalf of others, even that somehow this is going to surprisingly, like."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":6405.03,"end":6429.31,"speaker":"Neil","text":"Yeah, no, right. But that's like. So you're connecting it back. What you're connecting it back to is also this idea. Whatever you bind on earth will be bound in Heaven. Whatever you forgive on earth will be forgiven Heaven. So I see that in the pattern too. But, you know, it's a surprise in the sense that, like, there's. If you don't want your debts to be held against you, you forgive others their debts. And so it seems to be participating that. But in, like, a surprising way, because there's almost something sneaky about it."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":6429.31,"end":6430.23,"speaker":"Jonathan Pageau","text":"There is definitely something."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":6430.31,"end":6438.58,"speaker":"Neil","text":"Yeah. You know, but I mean, that's part of a pattern that happens in the Bible. There is, like, the. The holy trick, and it seems to be participating in part of that for me."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":6438.9,"end":6445.86,"speaker":"Jonathan Pageau","text":"All right, I'm gonna keep thinking about it. One day I'll try to give, like, a very most. The most concise thing I can give."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":6446.02,"end":6453.38,"speaker":"Neil","text":"So that's my thought on it, which is good. It's good. That's all right. Hey, Dougie. All right. I'm sorry. Saying hi to people. All right. All right, what we got? Any other questions in there?"}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":6454.74,"end":6791.94,"speaker":"Jonathan Pageau","text":"All right, so this next question is very odd. So girl next door says hello. I'd love to hear your thoughts on the two women in Revelation. I know you have mentioned the harlot briefly in previous talks, but hope you can do an episode addressing them or at the very least share some thoughts in the Q and A. So, yeah, so I have talked about the harlot more like the whore of Babylon more. And I think definitely they are represented as somehow being the opposite of each other. So the difference between a mother who has a child and that. That mother is gets. She gets raised up, right? She gets taken up to the top of the mountain, I think it is, or raised up towards heaven. And then the harlot, she is. You know, she's mixture. She's chaos. She's all these things. And so she gets eaten by the. By the beast. So I think that that's probably the best way to. To understand it and that. And so the idea would be that in the moment of the harlot and the beast, like in the moment where this thing below is playing itself out in terms of tyranny and chaos and all of that, that the purposeful life, the woman with the child, the one with the seed, it gets taken up very much kind of like we talked about before, in terms of Elijah, or in terms even of Christ going up and so that the world will kind of collapse. So it seems like there's a sense in which that's what's going on. The woman with the child gets taken up and is protected, hidden, while the world is kind of going into chaos and tyranny, and then there'll be like a return, let's say, in order to start the world again. Something like that, anyway. So that's my understanding of that. All right, we're almost done here. So Dominic Elias says, shalom, brother Maximus. Christ is with us. How do you see the 10 plagues relating with the creation of the world, as with the wedding of Kanah. So for sure, the 10 plagues are an undoing of creation. Clearly, they're an undoing of creation and they actually scale all of creation. They start with water, and then they move up to dust, and then they move up to the world, to the animals, and they keep going up. And then they affect man directly with the boils. And then they keep going up into the heavens with hail. And. And so water and fire falling together at the same time. And then you have predators coming from above, these locusts that come down to destroy the world. And finally you have darkness. So it really is like an undoing of creation which starts below and just goes all the way up into that, into the heavens. But it also is in many ways a reverse of what's going to happen as they leave Egypt. It's super crazy because so if you look at the pattern, you can see, like, the fire and water mixed together, and that's what's bringing death. But when the Israelites leave, you have fire and water appearing as two distinct columns of reality, one guiding during the day, one guiding during the night. When they get to the sea in the plagues, there's an east wind that comes and blows the locusts into the world. And then when you get to the sea, there's also a wind which blows open the sea in order to create the world. So in the plagues, you see, like the wind or the spirit of God, or the heavens acting like a predator which comes down to devour. And then you see again the heaven and the spirit of God acting like a wind which reveals the world again for a new beginning. But the most mysterious is, of course, that this leads to two things. It leads to two taking of the firstborn. The first is something like the end of a world where God removes the seed from the world, removes the firstborn, and that's the end of their world. But then there's also the voluntary sacrifice of the firstborn, because if you read the text, it immediately goes into telling the Israelites that they also have to sacrifice their firstborn, but that they are offered a redemption so they can redeem their firstborn with the sacrifice, with a willing sacrifice of a pure animal. But it's like the willing sacrifice is what begins the world. The accidental or like, inevitable taking away of the seed is what. So it's like if you don't sacrifice willingly, it's going to get taken from you. You're going to Die, and you're going to lose the things that you find precious. But if you purposefully sacrifice, then they will be redeemed. You would. It's like if you give up things, they will, in a way, be given back to you in a very strange and mysterious way. And that's actually like, the secret of how a world begins is the willingness to give up towards a higher purpose and then getting the world in exchange. And so. And so that's why I said that it's related to the wedding of Kana, because in the wedding of Kana, it starts with Christ changing the water into wine. And then. But when the mother of God asks Christ to solve that problem, what does he say? He says, woman, it is not my time yet. And it's like, what? This seems like the craziest thing. But he's saying he knows that if you change the water into wine, the firstborn will die. He knows that, but he also knows that it's him. He also knows that he has to give himself up as the firstborn, as the sacrifice, as all of those things coming together to restart the world. And that's what's being played out in that story. It's wild. It is the final version of the plagues of Egypt."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":6792.1,"end":6817.64,"speaker":"Neil","text":"Thanks. Work, hotshot. That's good. I love that sepal, too. I mean, there's a little epilogue to that in the sense that what happens at that wedding feast is that the normal pattern of love and relationship and marriage is that over time, the quality of the wine declines. Right. But you know, when Christ inhabits this relationship that, you know, the best is yet to come."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":6817.64,"end":6818.64,"speaker":"Jonathan Pageau","text":"Yeah, but it's also."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":6818.88,"end":6820.2,"speaker":"Neil","text":"Ecstasy is ahead. Yes."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":6820.2,"end":6878.37,"speaker":"Jonathan Pageau","text":"And it's a mystery about how the end becomes the beginning and how. And it's a mystery because what Christ does in the sacrifice, when Christ died on the cross, he is both. He said he is both the firstborn of the Egyptians being taken and the redemption and the firstborn being given, acting as the redemption of the firstborn at the same time. So it's like he. It's like crazy. Like, Jesus story just drives you crazy. It's like. It's as if what happened in Exodus is being condensed into one thing. Both sides are appearing at the same time. It's like when we say that Jesus is both goats, right? He's both the sacrifice of atonement and the scapegoat. It's like. It's. All of that is coming together in the cross. And I think that for the story of Exodus, Christ is. Is both the Child of the Egyptians being taken up and the redemption, sacrifice, willing redemption, sacrifice given instead of all the firstborn. And it's like it just shatters you when you think about it."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":6878.37,"end":6879.33,"speaker":"Neil","text":"Yeah, it's crazy."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":6879.41,"end":6882.29,"speaker":"Jonathan Pageau","text":"All right, here we go. I think we're almost done."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":6882.29,"end":6883.33,"speaker":"Neil","text":"That's the end. That's the end."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":6883.33,"end":6902.58,"speaker":"Jonathan Pageau","text":"All right. So, Chandler Turner, I should end with that question because, man, I don't know if I can do another one. All right, Chandler. Good evening, Jonathan. In one of your recent conversations, you said you've been reading parts of Meditations of the Tarot. Yes. My question is, do you have any insight into Le Pen du Lepondu? Do you want me to do a French accent?"}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":6902.58,"end":6903.18,"speaker":"Neil","text":"Oh, please."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":6903.26,"end":6919.7,"speaker":"Jonathan Pageau","text":"Feel that this image of the upside down man is relevant not only to my life but to our broader moment. So I have to know. I haven't gotten there, so I have to. I will. When I read that part, I might, like, maybe after I'm finished reading it, I might do. I might do, like one video on. On the. The nuggets that I got from that book. Maybe."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":6919.7,"end":6920.1,"speaker":"Neil","text":"We'll see."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":6920.1,"end":6993.93,"speaker":"Jonathan Pageau","text":"We'll decide once we finish reading it. Drew McMahon asks, Can you talk about the story of Sodom and Gomorrah? Was the major sin in hospitality? Something else. Why is homosexuality such a big focus? Thank you. So I will explain that to you. I will explain to you very clearly that it's fractal lack of hospitality. It's fractal abuse of hospitality. And so there is a type. There's a type of bodily interaction with others which is proper hospitality, which brings about life. And there is a type of bodily interaction which is coming in from the back door, which is in hospitality, which is an abuse of hospitality. And so there's a direct relationship between the abuse of hospitality, which is done at a social level, and the abuse of hospitality, which is being threatened at a personal level. And so hopefully that will settle that question for good, because. So it's not about homosexuality at all. It's about abuse of hospitality. But it does have sexual connotation that's more to do with. With sodomy than with homosexuality as a general character, as a. As a general characteristic, let's say. And so in a real simple sense."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":6993.93,"end":7003.57,"speaker":"Neil","text":"There'S like the food plays a major part in the story. Right. Very beginning with the hospitality in the sense that, you know, Abraham sees this. He wants to feed the angels. Yeah. But also feeds his people."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":7003.98,"end":7011.22,"speaker":"Jonathan Pageau","text":"But not just that. He has proper hospitality towards the angels. And that will give. That will bring what Brings a child."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":7011.22,"end":7011.62,"speaker":"Neil","text":"Yeah."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":7011.62,"end":7030.91,"speaker":"Jonathan Pageau","text":"It will bring a proper relationship of hospitality between Abraham and Sarah. So there's a social hospitality which is reflected in a sexual hospitality. And then when they get to Sodom and Gomorrah, there's the same thing, a social hospitality which is threatening a sexual. In hospitality."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":7030.91,"end":7034.19,"speaker":"Neil","text":"Right. Well, I mean, so the. But like, it could be."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":7034.19,"end":7061.82,"speaker":"Jonathan Pageau","text":"Yeah, it doesn't. Oh, it's not just. It's just sodomy. It could be rape as well. Rape is also an abuse of hospitality. So there are different ways to manifest sexually the abuse of hospitality which leads to death. But that is definitely one of them and that. It's not arbitrary why we use that word to talk about. And. And in the ancient world, sodomy was a general word to talk about, let's say abuses of hospitality in the sexual sphere where it wasn't a proper relationship."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":7061.98,"end":7066.7,"speaker":"Neil","text":"Well, yeah, the appetites were leading the action as opposed to, let's say, legacy."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":7066.86,"end":7073.1,"speaker":"Jonathan Pageau","text":"Yeah, there you go. That's a good way to think about it. So. So yeah, that was just such a wonderful question to end on."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":7073.1,"end":7080.86,"speaker":"Neil","text":"Yeah, of course. They always do that to you. I feel like that's like who picks your questions or lets Lisa sort through them? She just likes to drop those kind at the end."}
{"episode_id":"SW - #246 - 2022-08-06 - July 2022 Q&A","start":7080.94,"end":7173.21,"speaker":"Jonathan Pageau","text":"All right, so. All right, so everybody, thanks for your. Thanks for your time. And so I hope you enjoyed our special Q and a with Neil. And so we're gonna hang out still in Florida for a few days if you want to hear more about, like, the. The whole winning of Khanda thing and the crossing of the Red Sea. I am recording this Exodus seminar with Jordan Peterson, which should go up on the Daily Wire, I guess, in the next few months. So thanks everybody and yeah, we'll see you soon. Bye. Bye. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that it's quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially. Going to www.thesymbolicworld.com support or else on Patreon the Pajo videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
