{"episode_id":"SW - #262 - 2022-11-18 - Fr. Hans Jacobse - The Crisis in Masculinity","start":0.08,"end":23.92,"speaker":"Fr Hans Jacobse","text":"I have to stop being apologetic about it. Women want strong men and men want feminine women. They want their women to be women and women want their men to be men. Okay, let's just say it. There's this collapse of the sexist into kind of this uniform totalitarian egalitarianism, because that's what it becomes. It's death to the soul."}
{"episode_id":"SW - #262 - 2022-11-18 - Fr. Hans Jacobse - The Crisis in Masculinity","start":24,"end":68.42,"speaker":"Jonathan Pageau","text":"It's even more complex than what you're saying because. Because there's this totalitarian, egalitarian, you know, fusion of everything. It also creates strange, parasitic, extreme male figures. And so what you end up having is you have a weird, parasitic version of hyper masculinity which becomes popular in things like gangster rap or, you know, 50 shades of gray. All these images, violent, dangerous men. And then you have these insane kind of horror, almost like prostitute images of hyper feminine, broken down images, and they become extremely popular. So on the one hand you have this idea that we all have to be the same, and then you have these figures that look like caricature of a caricature of a caricature of what, a man and a woman."}
{"episode_id":"SW - #262 - 2022-11-18 - Fr. Hans Jacobse - The Crisis in Masculinity","start":68.5,"end":88.84,"speaker":"Fr Hans Jacobse","text":"Yeah. It becomes freakish. The distortions become freakish. Because if everything is melded together, it's the only thing that you can see. It's the only indication of distinction left, which still conversely affirms that the fundamental distinction, the binary, is true."}
{"episode_id":"SW - #262 - 2022-11-18 - Fr. Hans Jacobse - The Crisis in Masculinity","start":100.92,"end":102.44,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot."}
{"episode_id":"SW - #262 - 2022-11-18 - Fr. Hans Jacobse - The Crisis in Masculinity","start":102.84,"end":104.6,"speaker":"Jonathan Pageau","text":"Welcome to the symbolic world."}
{"episode_id":"SW - #262 - 2022-11-18 - Fr. Hans Jacobse - The Crisis in Masculinity","start":114.74,"end":157.92,"speaker":"Jonathan Pageau","text":"So, hello, everybody. I am very happy and honored to be here with Father Hans Jacobs. I've known Father Hans for several years. I actually have a very powerful moment where he prayed for me several years ago at the very outset of my speaking engagement. And I was very encouraged and touched by the work that he's doing. And I've seen that he's doing all this amazing work with young men. He is a priest at the St. Peter's Orthodox Church in Florida. He is also the leader of the St. Paisio's Brotherhood, which is a movement that is looking to help young men to find their way, to find a positive and healthy masculinity in their lives, but in the church as well. And so, Father Hans, thank you for talking to me."}
{"episode_id":"SW - #262 - 2022-11-18 - Fr. Hans Jacobse - The Crisis in Masculinity","start":158.24,"end":162.88,"speaker":"Fr Hans Jacobse","text":"Yeah, my pleasure, Jonathan. It's great to be here. It's good to see you again too."}
{"episode_id":"SW - #262 - 2022-11-18 - Fr. Hans Jacobse - The Crisis in Masculinity","start":163.12,"end":176.45,"speaker":"Jonathan Pageau","text":"Yeah, it's good to see you. So, Father Hans, tell me a little bit about what you see as the situation, let's say, in terms of masculinity in the society, but in the church as well, and also what you see as a. As a way out or as a way Forward."}
{"episode_id":"SW - #262 - 2022-11-18 - Fr. Hans Jacobse - The Crisis in Masculinity","start":176.93,"end":349.95,"speaker":"Fr Hans Jacobse","text":"It came out of a personal crisis, Jonathan, which I won't go into detail, but basically I was brought to a place and it's by the hand of God. It really was where, you know, I was known as kind of a cultural warrior. And I kind of was, right? And then some events happened in my life to really cause me to rethink that. I took three years. I took three years. And it was a humbling experience, but those experiences are good. And long story short, I prayed one day and I said, lord, what do you want me to do? What am I supposed to do? And quite literally, he said, open your eyes. Meanwhile, some young men entered my life and I began to help them. Learned a lot. And the opening eyes moment was this, that there were guys falling off the cliff. They were falling into the fire, right? And instead of me trying to change, you know, the culture politically and, and socially and all that, you know, writing articles and all that, I just started dealing with these guys one on one. And those are the people that God brought into my life. And I began to see what the problems really were, and I began to learn how to deal with them. And I did that for about five years. And then I was invited by Father Patrick Henry Reardon to speak at a Touchstone conference. And I brought some of this stuff and I gave a talk. And after that talk, it went on a slow, viral, and these young men started calling me up from all over the country. That's when I realized that what I had been given here, it's a discovery. But what I had been given to by the Lord was very powerful. It was very, very powerful. And men were healed by it. Men were healed by it. And it had a lot to do with coming out of what I call coming out of the Matrix. Okay? The Matrix is really a cultural form is what it is. And even the gospel is reduced just to propositions. You and Jordan Peterson talk about that a lot. And it's very effective. It's very, very effective. And then I use a lot of what both of you come up with because it's. You've thought through it and you, you give me concise ways to say it. And I call it the Matrix. So the guys want to come out of the Matrix. You know, boys want to become men. They don't know how. And the masculinity in the culture is so denigrated, but so is the Christianity. It's just reduced to propositions, is what it is. Which, which, you know, on a. I would say on a psychological, spiritual, soul level, it's basically behavior modification and it doesn't work. And we need soul transformation. And that's the beauty of orthodoxy. It's the power of the orthodox faith of really Christ in the transformation of the soul and of the human person. Well, started bringing that forward and see these men healed. And it's. I have to say, it's the most meaningful work I've ever done in my life. That's what it is in a nutshell, Jonathan."}
{"episode_id":"SW - #262 - 2022-11-18 - Fr. Hans Jacobse - The Crisis in Masculinity","start":350.03,"end":356.35,"speaker":"Jonathan Pageau","text":"So what does it look like in terms of the type of practices or the type of work that you're doing with them?"}
{"episode_id":"SW - #262 - 2022-11-18 - Fr. Hans Jacobse - The Crisis in Masculinity","start":356.59,"end":873.76,"speaker":"Fr Hans Jacobse","text":"Well, it's a lot of one on one and a lot over the phone. And I talk to a lot of guys. I talk to probably three or four guys every day. You know, that adds up over the month, Right. I don't even look at my minutes anymore. But like I say, I've got the, what is it, the extended unlimited plan, right? I got a good phone. Yeah. But I grow to love these guys. And these guys really take the counsel. You know, there's something about the beauty of truth. And it's this. I mean, truth has to be spoken. It has to be spoken. And truth enters the world first through a word, through what is spoken. And you know, truth itself is self verifying. There's nothing higher than the truth. Okay, the truth is the truth. But there's a resonance in the soul that occurs to the man who hears it and is seeking truth. Truth, of course, manifests itself ultimately as Jesus Christ, because he is the truth. And truth thus is ultimately very personal. So the transformation in, in the heart and the heart is the center of the soul, the transformation of the man occurs deep on the inside. And here, you know, the scriptures are so beautiful because it is a seed planted. It is a seed planted. And that, that seed germinates and grows. And you see the transformation in these men, it's just beautiful. It's one of the most beautiful things I've ever, I've ever seen. And it, it happens in again and again to see, to see a person grow into what I call their personal particularity, right? To become a true son of God and then to become their own man. Because those things work hand in hand, they don't work separately, right? And it's, it's really a wondrous thing. It's, it's a recreation that I'm privileged to see with my own eyes. Brings great meaning to life and it posits them. So one on one, initially a lot of encouragement and just simple instruction. But out of that that's how it started. But out of that, I realized that this problem is really huge and that there are many men, many men who want a more solid sense of their own masculinity, and there's no place to find it. There really is not. And so this also presents a very unique opportunity for the church. And I think the means by which the gospel will be spread in our cultural particularity. All right? Every generation is different. Every generation has its own problems. So out of that, out of that grew the concept of the brotherhood, which I just started. Two men came to me and said we had to start this. And I, I, I'm cautious now of committing myself to things because I've had a lot of false starts in my life. And I realize, you know, just don't fly off and do something just because it's good, it sounds good. And I thought about it for six months and prayed about it and said, yeah, we have to do this. And so we started the brotherhood, and we're building that out now. Again, it's a learning as you go operation, but we're getting there and it's getting some traction. And my goal is this, is to build brotherhoods all around the country. That's what I want to do. That's my goal. Because it's through brotherhood, it's through brotherhood that men find themselves. So what I say now, and I say it a lot, is men learn how to become a man from other men. And that requires brotherhood and that requires real, authentic communion between men because we draw our masculinity from each other. And this fits perfectly with orthodox anthropology. You know, there is no such thing as a single individual. And it ties into. And this is where I find your work so helpful, Jonathan. It ties into the very structure of the creation. You know, there's a congruency between the structure of the soul and the structure of creation. And there's a particular order to that, but it's ontological. Okay? It's not a schematic. You know, it's not a drawing of a computer chip that you look at in this great complexity. It's not that it's alive. And the energy that vivifies it all is love is love, right? And, and this love itself has character because it flows from God. And the Fathers teach us, yes, that the character is virtue, the cultivation of virtue. And the cultivation of virtue is actually what brings the structure which is latent into life. Like looking at an animation of a topographic map. Then all of a sudden, you know, the mountains form and the Valleys form. And you can see it in 3D. That's what it's like, right? And it just flows with this beautiful, creative, benevolent energy which is actually reveals to us the character of God, the beauty of the creation and the fundamental goodness of man. And you see this and you know, the guys, they come in just really beat down, really, really beat down, just defeated. But there's something in their soul that longs for this life. And again, you start explaining it to them and it resonates. That's the truth, right? That's how the truth works in us. It begins. It begins with language. It really begins with language. But why wouldn't it be any other way, Jonathan? Because the world was created by speech, right? God said, let there be light. And there was light. And you know that I'm getting a little excited here. I know this. But what's so beautiful about this is, you know, the power of that primordial word that is replicated in the preaching of the gospel. That is because what it does, it's not a new. Well, it is a new creation, Paul says, but it's really the recapitulation of a fallen creation towards the kingdom of God, when all things will be made whole. And it begins in the soul. And here, you know, this is, say, Maximus the Confessor, right? Man as a center of the cosmos. But that's what I discovered. And so, you know, the first issue is always pornography, self abuse, the sexual stuff. We're a sex obsessed society. But I see that in a materialist world, philosophically, okay? And coming out of materialism, back into symbolism, really. You talk about this a lot. You know, in a materialist world, all you have is sex. It's the only material point of transcendence because the sexual desire is a unit of desire ultimately in the body. It brings together body, soul and mind, right? It's a beautiful gift from God, but tremendously misused in our day and age. But if a person is looking for transcendence, but they're locked in the shackles of materialism, right? Then the only way you can go, the only way you can find transcendence is, is. Is through sexuality. And that really messes people up because it's such a powerful thing. So it's the reordering of that. It's really the reordering of that. And one of the reasons I have success here with people getting out of pornography and all the attendant behaviors is an insight I received. And it was from Saint Maximus the Confessor that. That the foundation of all desire is a Desire for God. And so the healing from these, these, these maladies or their personal maladies, but they're in a sense, you know, culturally determined because of the way our culture is, is really to redirect the desire. To redirect the desire. What's missing here, I'll tell you what's missing here is that man's native, and I'm talking about men, men, A man's native desire to create is actually subverted into the sexual desire, which itself is a sexual desire. They get all mixed up together and the man becomes defeated. And here the beauty of orthodox ascetical discipline separate that. Right? And direct that creative desire into productive work. Right? And the gratification that he's seeking through, through self abuse and behaviors like that is actually met by honest work with his hands, right? And that's. Once a man experiences that, then he is on the path to healing, which is to say, you know, the, the vivification of the proper ordering and structure of his soul. I got way ahead on my question, but that's what I do."}
{"episode_id":"SW - #262 - 2022-11-18 - Fr. Hans Jacobse - The Crisis in Masculinity","start":874,"end":911.11,"speaker":"Jonathan Pageau","text":"No, that's correct, Father. So maybe let's start, Let me, let's start with. Because I think one of the difficulties that we, that men have had especially is that there's been a displacement about what it is to be a man in many directions. So we have no, we have the images of the sports star or the action hero, that type of image is there. But then we also had the image of the, of the feminized man or the, you know, the man who basically denies his own masculinity. What do you think? Like, how would you describe what it is to be a Christian man?"}
{"episode_id":"SW - #262 - 2022-11-18 - Fr. Hans Jacobse - The Crisis in Masculinity","start":911.26,"end":911.42,"speaker":"Fr Hans Jacobse","text":"Man?"}
{"episode_id":"SW - #262 - 2022-11-18 - Fr. Hans Jacobse - The Crisis in Masculinity","start":911.42,"end":916.7,"speaker":"Jonathan Pageau","text":"What, how does Christianity preserve, transform. What image of masculinity does it present?"}
{"episode_id":"SW - #262 - 2022-11-18 - Fr. Hans Jacobse - The Crisis in Masculinity","start":917.1,"end":1067.78,"speaker":"Fr Hans Jacobse","text":"Well, you know, we have models in the lives of the saints, okay. And you see really different personality types in the lives of the saints. But I would say that, that fundamentally, and this is a little abstract, It's a little abstract, but you know, you help guys find this. I mean, fundamentally, the definition of true masculinity is to, to define for yourself who you are and what your purpose in this world is. Now every man desires that some men sublimate it. Any man who is self aware and, and has some measure of self honesty, okay? That's the central question that can only be answered in communion with our Creator. But how do we come into communion with our, our Creator? It's through brotherhood. It is through brotherhood. I mean, everything that God gives us is mediated. It's mediated. And it, you Know, it's mediated through matter. It is, it God's energy is not amorphous. It doesn't fly around and we kind of catch it. It's mediated to us with great specificity and most often through other people. And it's, it's, you know, the best counselors are the people who have gone through the things themselves and worked it out and then they give what they have received to, to the young. And so masculinity, masculinity is coming into self knowledge again of who you are and who God created you to be. So it's self knowledge, but it's also purpose. A man needs that it is realized and actualized in communion with other men. So true masculinity is a man who is on his journey with God in a journey of self discovery, self disciplined towards the work that God has called him to do, whatever that work might be. I tell the young guys, they say the most exhilarating journey you can go on is the journey of self discovery. They really like that. They really like that. But what is the Christian walk? You know, it's a discovery of God, but the discovery of God and then the discovery of ourselves. So that's what it is in the interior life, exterior life. It is the cultivation of virtue, which means to protect and provide. That's what it means."}
{"episode_id":"SW - #262 - 2022-11-18 - Fr. Hans Jacobse - The Crisis in Masculinity","start":1068.5,"end":1078.67,"speaker":"Jonathan Pageau","text":"And how do you see this, let's say, the relationship of the, of masculinity with the feminine in the church or in society. How do you see those things being related to each other?"}
{"episode_id":"SW - #262 - 2022-11-18 - Fr. Hans Jacobse - The Crisis in Masculinity","start":1078.75,"end":1255.68,"speaker":"Fr Hans Jacobse","text":"I believe that there's a fundamental structure in creation. And you know, I went to Denmark, as, you know, very, very secular country, all of northern Europe is. And my takeaway, my personal takeaway, I gave a lot and I received a lot. And one of the things that I, I received, and I'm going to start speaking on this more clearly, is that assert that the world is patriarchal. Just assert it. Okay. Because what I was doing is when I talk about patriarchy, I always had the arguments of the detractors in the back of my mind. And I would tailor what I said to answer the arguments, the detractions. And I came away saying, no, no, no, no, no, don't do that. The world is structurally patriarchal because God is Father. And so that means that male and female have their own unique contributions. They do. But there is an ordering to this, and the ordering is this. And I can feel it inside me, right? There's always that tendency to self center because you know what the culture is thinking, how they're going to react, but that men have to be men, so women can be women. And that's a difficult thing to say because a lot of women will object to that. But the, the nature of their objection is, is one that is caused by the collapse of masculinity in the broader culture. I think if men become men, then women will find their way as well. And this goes deep. And I can't say I understand it all, but I think about it a lot. But, you know, out of the Prospero, which is the Theotokos, it's the matter. It's the material, right? Comes the Lamb, who is Christ in the chalice. It's the body and blood of Christ, but the body and blood come from the Theotokos. All right, so there's a complementarity and, and, and a deep, deep interdependence between male and female in all of the creation really is. But to, to, to think about these things. That's as far as I'm going to go, because the rest of what I have is just speculation. I'm not really ready to talk about it, except for this point. To think of these questions outside of political categories and cultural polemics is very difficult. It's very difficult. We have to recover something that we have lost. We have to recover something that we have lost. Male and female, in the, in the creation has to do with matter and meaning. It does. You need both. You need matter to reveal the meaning. You need meaning to give matter its purpose. And so it can fulfill its teleological aim. Right. And it's wrapped up in that somehow, Jonathan. But I'm waiting for you to work on it."}
{"episode_id":"SW - #262 - 2022-11-18 - Fr. Hans Jacobse - The Crisis in Masculinity","start":1257.76,"end":1429.65,"speaker":"Jonathan Pageau","text":"No, I think, I think that you've got the basics right. You know, there is a sense in which the. For sure, in the Church, the, the first thing to understand is that, of course, human beings are not just their gender. There's an aspect in which we can go beyond. Like, what is it? I mean, the notion that Christ says that, you know, in Christ there is no male, female, like that is absolutely true. But there's also an aspect to which we are gendered. And in the respect that we are gendered, then we do manifest certain realities in the world. So it's important. First of all, it's important to make that distinction because sometimes when we talk about men and women, people can think we're just reducing it, human beings to their gender. It's like, no, we're not. But we're also not pretending as if that's not a way in which the world is laying itself out. And the way in which the world is filling the world with his glory is through this beautiful relationship between male and female. And so you're right, the feminine is the one. Let's talk about Max and feminine in general mostly because then it's not just about human beings and their gender, but the feminine is the space. And that's why the theotokos is, is presented to us as in all those images, you know, the ark, the temple, all the images of that which sustains from below, that holds or that gives body, the mountain, the ladder, you know, everything that supports. And then, then the male, the masculine, let's say, manifests itself as the seed, as the meaning, as the, you know, the, the top of the mountain, as the place where things, heaven and earth kind of come together. And so you see that all through the, all through the imagery that is, that is there in the Old Testament and in the New Testament. So the relationship between head and body. And in some ways, let's say in spiritually, we are all feminine in relationship to God. Like we are all called to become the bride of Christ. And that, that doesn't. So at that level there's no issue. Like it doesn't bother me to think that I'm the bride of Christ, but I also have this other, this aspect of myself which is gendered in the world. And in that aspect I am, I am, I am masculine, I'm a man. And I have to play the role that, that that entails, which is, as Christ says, you know, to the idea of the head of the family, that type of imagery which is this reflection of the role that Christ plays in regard to the church. So these are the things that are, culturally, they're very difficult for people to understand, but that's, that's the way in which the pattern kind of, let's say I use the word fractal a lot where it happens at every level of, of reality. And in, in even in yourself, you also have that relationship. You could say there's an aspect of you like the, the, your body has a certain aspect which is more feminine and there's an aspect of you, the meaning making part, which is more masculine. And those relationships happen even within yourself. There's a, let's say there's a part of you that, the part of you which is, which sustains the meaning, which is, which is equivalent to let's say, the, the feminine and in every other way."}
{"episode_id":"SW - #262 - 2022-11-18 - Fr. Hans Jacobse - The Crisis in Masculinity","start":1429.81,"end":1529.23,"speaker":"Fr Hans Jacobse","text":"Yeah, well, it's, it's real interesting. And see, that's my answer because I get asked, well, why don't we have female priests? I think that's where the answer lies. Because if you have a female priest, you have a symbolic collapse. Because in the chalice, you have the body and blood of Christ. In the female body, you have the creative prowess of creation, of new life. Men don't create life from their bodies. Women do. Yeah, okay, so if a woman is holding the chalice, right, and the chalice contains the body and blood of Christ, but the body and blood come from the theotokos, because it's a theotokos who gave the Logos his human nature and makes salvation possible on that level. Right. A male especially would look at the woman and the chalice, and I think you have a collapse. You have a collapse of meaning. Right? And the distinction between what we're trying to define here, between the material world and the world of meaning, all right, it collapses. And so a male priesthood actually is a preventative against that kind of a collapse. It holds together the distinctives, the binary distinctives, okay, that are necessary within the very. The operation of the world, within the operation of society, and remove that. And what happens? And we see that we're getting into cultural polemics here a little bit, but we see that in the churches that have adopted a female priesthood, within 10 years, they're into all sorts of sexual confusion."}
{"episode_id":"SW - #262 - 2022-11-18 - Fr. Hans Jacobse - The Crisis in Masculinity","start":1529.47,"end":1589.63,"speaker":"Jonathan Pageau","text":"Yeah, no, but I think it's important to mention because, you know, 20 years ago, 30 years ago, 50 years ago, we only had the promise where people were saying, oh, we need. We need equality. We just need this to happen. Female priests, it's the future. They know, it's the further revelation. It's the further filling of the Holy Spirit. All these arguments that they had. And so it's like, okay, some churches did it, but now we have the fruit. So let's look at the fruits so we can see what the fruits are. And we can see the churches that have done that, what happens to the church itself, how it falls into confusion, falls into revolutionary thinking. It has this type of revolutionary approach to reality itself. Up to the point where the bishop here of the Anglican Church, she was the first female bishop, and she made a speech where she says, I'm paraphrasing, but she says something like, now is the time for us to reach up and grasp divinity for ourselves. And you're thinking, eve, no, not again."}
{"episode_id":"SW - #262 - 2022-11-18 - Fr. Hans Jacobse - The Crisis in Masculinity","start":1590.59,"end":1591.87,"speaker":"Fr Hans Jacobse","text":"Yeah, yeah, yeah, yeah."}
{"episode_id":"SW - #262 - 2022-11-18 - Fr. Hans Jacobse - The Crisis in Masculinity","start":1591.87,"end":1597.51,"speaker":"Jonathan Pageau","text":"What is happening? Like, it just doesn't take long before the. The pattern sets itself up again really fast."}
{"episode_id":"SW - #262 - 2022-11-18 - Fr. Hans Jacobse - The Crisis in Masculinity","start":1597.51,"end":1681.46,"speaker":"Fr Hans Jacobse","text":"It's. Yeah, yeah. And I understand that, you know, that Revolutionary thinking is inevitable. You know what it is? It's just the decentralization of Christian cultural categories. That's really what it is. I can't go any other way, remove Christ from it. Right. The categories still remain, at least in Christendom or memory of the categories, let's put it that way. Right. That's the period we're in right now. So it can only go revolutionary. But this is. I'm kind of a revolutionary myself, but I think in a good way. I've been telling people this the last few weeks especially. I said, you know, we're really going to have to get to a point where we rebuild culture. That's what's going to happen. This is probably going to have to play out. These things do. And then they die of spiritual exhaustion. The problem is, I don't say that lightly because there's a lot of carnage along the way. There really is. I mean, and the suffering. The suffering is real. Two points on that. But what I want to say is that I think I've already started it, right, by bringing restoration to these young men. And I'm starting it now. It's much more important than kind of winning the culture wars. Yeah, Start rebuilding culture now, because that's what's going to be needed in 10 or 15 years. Do it now. And that's what part of this work is. And then my second point. I forgot Jonathan, but it'll come back to me."}
{"episode_id":"SW - #262 - 2022-11-18 - Fr. Hans Jacobse - The Crisis in Masculinity","start":1683.14,"end":1726.43,"speaker":"Jonathan Pageau","text":"But I think that that's the right approach because there's a sense in which the darker things get, the more light will shine brightly. And so, you know, if. If you have men who are examples of loving positive self, sacrificial masculinity with authority, though, you know, not just that. We have the sense that self sacrifice and, and love just means being weak. That's not what it means. That's not what it meant in the case of Christ, who was constantly, you know, reproaching his. I mean, Christ is not a soft figure, but he's constantly, constantly, you know, like, snapping back at his disciples. But he was willing to die for them and die for. For all those around him."}
{"episode_id":"SW - #262 - 2022-11-18 - Fr. Hans Jacobse - The Crisis in Masculinity","start":1726.43,"end":1997.6,"speaker":"Fr Hans Jacobse","text":"So this is what I tell my Protestant catechumens. I'll ask them, well, why did. Why did Christ die and on the cross? And they'll, they'll. They'll tell me, well, to forgive us of our sins. I said, well, wait a second. There was forgiveness of sins before Christ came. There was even baptism before Christ came. The baptism of John was for the remission of sins. So why did he really come? And they're stumped. I say he came to conquer the devil. We call him the conqueror. Right. And it removes kind of this, this, this feminized gloss that is over American civil religion. Right? Removes. And look at him and realize that the crucifixion on the cross was a voluntary self sacrifice. For what reason? To free us from the tyranny of the devil. And I contend that what I call the matrix behind it is demonic power. And the demonic power is to blind men to their own manhood and their masculinity. So going back to pornography in particular, I believe it comes from the depth of hell to destroy the characters of young men before they can become. Before they realize who they are and what they can become. Right. So there's a spiritual warfare to this. Now, what ties it in, and this is the point I forgot, is that you said when darkness increases, the light is greater. That is so true. I see the grace of God so powerful, especially in the lives of these young men. And when they need encouragement, I tell them because it's true. And I see it over and over again. No one desires their healing more than God. God is on their side. They've never heard that. They don't believe it. They're beat down. But it's objectively true. The grace that flows to help them overcome and to help them to be stronger is so consistent and it's so strong that I just know it's coming. Say the prayer. It's coming. I believe that, that this path and this work is directed ultimately by our Lord and Savior, Jesus Christ. And it's absolutely necessary that it gets done. So consequently, part of the reason too, for the brotherhood is that I want to build resources to give to other priests. That's what I want to do. Because a lot of priests, now you mentioned it at the beginning, where, you know, the churches are just being, are filled up with catechumens. Well, they're, they're being filled up primarily with young men like Intention, by the way, with the woman questions. When the guys get themselves together, the women will follow. That's my prediction. Right. But we don't know what to do. You know, I've spent the last 10 years doing it a little longer than that. So I've learned a few things. But I'd like to pass this knowledge along because it's new. It's something new. And we, we have to learn how to do it. And that's another reason for the brotherhood. You know, Jonathan, it's different this time. Around because, you know, when I first became a priest was like 20, 20 years ago, 25 years ago, you know, it was basically my catechism was, okay, what was your religious tradition? And then you kind of tailored the catechism to that to show them where Orthodoxy was different. I. I call it now, you know, orthodoxy and 10 easy lessons. Basically, it was that. But my catechism changed once I started dealing with these guys and was basically how to walk, how to find Christ and how to walk with them. And the history and all that came later. The theology was fleshed out through their own direct experience with him and the inner transformation that they experienced. It's much more. I would say the catechism is much more existential, experiential, that type of thing. Not so much here, but a lot here. Because these guys, and this is the difference who come into the church now, they come in out of. Out of their pain. It's their pain that compels them to look upward. And then they start going on YouTube and they find you and they find all this orthodox stuff. Right. And that's what brings them into the Orthodox church. Yeah. And they come in specifically for healing."}
{"episode_id":"SW - #262 - 2022-11-18 - Fr. Hans Jacobse - The Crisis in Masculinity","start":1998.24,"end":2011.16,"speaker":"Jonathan Pageau","text":"And so how are you going to scale what you're doing? I guess, because now it's mostly you being a mentor, you know, kind of father to these young men. And so how do you see this scaling in terms of having these brotherhoods in other places?"}
{"episode_id":"SW - #262 - 2022-11-18 - Fr. Hans Jacobse - The Crisis in Masculinity","start":2011.16,"end":2075.94,"speaker":"Fr Hans Jacobse","text":"Well, I'm not building an organization top down and really broadcast. Okay. Basically what I'm doing is doing virtually what I hope to see done in real time and locally. So we're getting information out there. We're learning as we go. We're going to start classes where guys sign up for and they're going to have to pay for it. Okay. You got to have some skin in the game. All right? And where there are certain areas in their life, they want to improve on this and that. We'll have classes on it, accountability groups, groups of, you know, maybe 10 guys. And they hold each other to account. Right. We'll build that out. And all this information that we have that we're just going to give it away. If a priest wants to do this in a local church, fine. If a bunch. If guys want to get together and do it on themselves, fine. Okay. It's to generate a movement for the creation of brotherhoods. Because guys crave brotherhood. They crave the love of a brother. That's how we're going to scale it out."}
{"episode_id":"SW - #262 - 2022-11-18 - Fr. Hans Jacobse - The Crisis in Masculinity","start":2075.94,"end":2133.87,"speaker":"Jonathan Pageau","text":"Yeah. I mean, and it's a. It's a great idea because that used to exist. I mean, it's so funny because it used to exist where they were these groups, clubs, male only type organizations where men were together by themselves in groups and would just have this bonding. And it's funny because those, all those groups were attacked systematically by the feminists nonstop for, for like decades and decades, you know, saying that it's sexist and you should have women in these groups. And they all succeeded. So all the groups are gone. And now it's super interesting because now you go to a gym and there's the women's only section or now you go to it, you go to the thing, they have women only clubs and you're thinking, what, what, what, what happens? Wait, wait a minute. How did this, how did this happen? You know, like you're realizing that it's important to have spaces in which women only can interact with each other. So yeah, we need those for men too. Now. They're all destroyed. So, yeah, so thank God for something like what you're doing because yeah, we're."}
{"episode_id":"SW - #262 - 2022-11-18 - Fr. Hans Jacobse - The Crisis in Masculinity","start":2133.87,"end":2157.84,"speaker":"Fr Hans Jacobse","text":"Going to rebuild it. That's what we're going to do. And I see it in the lives of men. You know, I, you know, I go and speak and one of my, my conditions is no women. Now it's not that this is a secret society. These, these talks get recorded, they're public. Right, But I've got to speak only to men because when, if there's a woman there, it changes, it changes everything. And I have to think it's the same with women. Yeah, right."}
{"episode_id":"SW - #262 - 2022-11-18 - Fr. Hans Jacobse - The Crisis in Masculinity","start":2158.48,"end":2189.18,"speaker":"Jonathan Pageau","text":"It's not wrong that it changes that it should change it. But it also means that some subjects or some dynamics are not possible as soon as the genders are mixed. You know, it's like if you have men and women in the same space and it will create a certain type of dynamic which, which is just neutral. It's neither good nor bad. It just depends what you want. But some things that you would want to have only men, because you want to create, you want to foster a certain type of, of dynamic or relationship or pattern of interrelationship that you can't have if there's a woman there."}
{"episode_id":"SW - #262 - 2022-11-18 - Fr. Hans Jacobse - The Crisis in Masculinity","start":2189.34,"end":2236.55,"speaker":"Fr Hans Jacobse","text":"And women. Now the feminists are going to draw and quarter me for this. But they're wrong. What I'm saying is right, women, I just have to declare it. I have to stop being apologetic about it, okay? Women want strong men and men want strong, feminine women. They want their women to be feminine. They want their women to be women. And women want their Men to be men. Okay, let's just say it, all right? There's this, this collapse of the sexist into kind of this, this uniform totalitarian egalitarianism, because that's what it becomes, right. It's just horrible. It's death to the soul. It's death to the soul, Father."}
{"episode_id":"SW - #262 - 2022-11-18 - Fr. Hans Jacobse - The Crisis in Masculinity","start":2236.55,"end":2295.37,"speaker":"Jonathan Pageau","text":"It's not as. It's even more complex than what you're saying because. Because the desire, the desire that men have for women to be feminine, the desire that women want men to be masculine, because there's this totalitarian, egalitarian, you know, fusion of everything. It also creates strange, parasitic, extreme male figures. And so what you end up having is you have a weird parasitic version of, of hyper masculinity which becomes popular and things like gangster rap or, you know, 50 shades of gray, all these images of, of hyper masculine, violent, you know, dangerous men. And then you have these insane kind of whore, you know, almost like prostitute images of hyper feminine, broken down images and they become extremely popular. So on the one hand you have this idea that we all have to be the same and we all have to be exactly the same. And then you have these figures that look like caricature of a caricature of a caricature of what, a man and a woman?"}
{"episode_id":"SW - #262 - 2022-11-18 - Fr. Hans Jacobse - The Crisis in Masculinity","start":2295.45,"end":2325.77,"speaker":"Fr Hans Jacobse","text":"Yeah, it becomes freakish. The distortions become freakish. Because if everything is melded together, it's the only thing that you can see. Yeah, it's the only indication of distinction left. Which still conversely affirms the fundamental distinction, the binary is true. Because how else could you see it if your soul wasn't longing for that, that particular distinction? It goes back to the structure of things again."}
{"episode_id":"SW - #262 - 2022-11-18 - Fr. Hans Jacobse - The Crisis in Masculinity","start":2326.33,"end":2348.5,"speaker":"Jonathan Pageau","text":"There's a manner in which, you know, Christianity, for example, will mediate and will, let's say, tame the extreme desire for the extremes, let's say, and will bring it into something that is purposeful. But as soon as you, if you take that away, then it's not as if those opposites go away. It's that they become, they become, like you said, they become insane caricatures that are ridiculous."}
{"episode_id":"SW - #262 - 2022-11-18 - Fr. Hans Jacobse - The Crisis in Masculinity","start":2348.66,"end":2350.26,"speaker":"Fr Hans Jacobse","text":"Yes. It becomes freakish."}
{"episode_id":"SW - #262 - 2022-11-18 - Fr. Hans Jacobse - The Crisis in Masculinity","start":2350.34,"end":2351.3,"speaker":"Jonathan Pageau","text":"Yeah, freakish."}
{"episode_id":"SW - #262 - 2022-11-18 - Fr. Hans Jacobse - The Crisis in Masculinity","start":2352.5,"end":2408.99,"speaker":"Fr Hans Jacobse","text":"I mean, this is, this is how, when you try and understand how is it that people get caught up in these perversions? That's how it's really distortion. If we can see human ontology in the way that Saint Maximus the Confessor describes it, which is kind of a repudiation that man is innately evil. And the whole kind of Calvinistic anthropology that swept through the west and it's still Large, largely there. I think that those cultural. That those ideas formed in some of these cultural presuppositions that bring us in that freakish direction, if you can see it in the way in human anthropology, like in the orthodox understanding, particularly St. Maximus a Confessor, you can also begin to understand how this freakishness emerges and how people get caught up in these vices. There's a certain logic to it, you know, it's. It's the logic of distortion. Let's call it that."}
{"episode_id":"SW - #262 - 2022-11-18 - Fr. Hans Jacobse - The Crisis in Masculinity","start":2409.23,"end":2442.28,"speaker":"Jonathan Pageau","text":"Yeah, it's. And it's. We tend. I use the word parasitic. I like that. John Vervecki has that word. Parasitic. A parasitic process, which is the idea that it's a desire that's good in itself, but when it gets disconnected from its true purpose, it starts to turn on itself, you know, out of pride, out of this self looking back at itself. And so it becomes a caricature. Exactly. Becomes a kind of freakish version of what the. What's actually making it exist, which is a good. That it's supposed to be aligned to. And so then it all becomes these weird kind of. Yeah, freakish caricatures."}
{"episode_id":"SW - #262 - 2022-11-18 - Fr. Hans Jacobse - The Crisis in Masculinity","start":2442.52,"end":2499.83,"speaker":"Fr Hans Jacobse","text":"And I always see the benevolence of God in there, and I really do because I'm confronted sometimes with things that people have done or what they're. They're entrapped in. Right. Vice. Vice is really real and vice can. Can really hold a grip over a person's soul, but that can be broken. The vice can be broken and the soul can be healed. Because. And this is the remarkable thing, it's just. It just really is. It gives me so much hope because God is good. Because God seeks to free and heal the person. They're synonymous. Freedom and healing are synonymous. Right. And then even a person caught up in something like that and can find his way out, can find his way out through Christ and be restored to what is natural. Be restored to what is natural. That's orthodoxy. It's just beautiful."}
{"episode_id":"SW - #262 - 2022-11-18 - Fr. Hans Jacobse - The Crisis in Masculinity","start":2500.07,"end":2514.63,"speaker":"Jonathan Pageau","text":"Well, thanks, Father. I think. I think that's a great way to end the discussion. I really appreciate the work you're doing and I'll ask everybody, you know to go check out the. The St. Paiso's Brotherhood, the website. We'll put a link in the description. And Father Hans, thanks for your work and, and keep going."}
{"episode_id":"SW - #262 - 2022-11-18 - Fr. Hans Jacobse - The Crisis in Masculinity","start":2514.63,"end":2514.95,"speaker":"Fr Hans Jacobse","text":"We."}
{"episode_id":"SW - #262 - 2022-11-18 - Fr. Hans Jacobse - The Crisis in Masculinity","start":2514.95,"end":2516.27,"speaker":"Jonathan Pageau","text":"We will be watching."}
{"episode_id":"SW - #262 - 2022-11-18 - Fr. Hans Jacobse - The Crisis in Masculinity","start":2516.51,"end":2527.23,"speaker":"Fr Hans Jacobse","text":"Yeah. And same to you, Jonathan. Keep it up. We need you. We need you. You do a lot for us. So thank you very much. Thanks, Father. Okay. God bless you."}
{"episode_id":"SW - #262 - 2022-11-18 - Fr. Hans Jacobse - The Crisis in Masculinity","start":2527.55,"end":2589.6,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description and so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially going to www.thesymbolicworld.com support or else on Patreon the Pageau videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
