{"episode_id":"SW - #047 - 2019-08-03 - The Amazing Christmas Symbolism of Little Jack Horner","start":0.8,"end":19.4,"speaker":"Jonathan Pageau","text":"In this episode of the Symbolic World podcast, I am playing for you a reflection I had on the Christmas symbolism of Little Jack Horner, that famous nursery rhyme. This will be the last video about Christmas that I'm posting in the middle of the year. As I've said before, hopefully within a."}
{"episode_id":"SW - #047 - 2019-08-03 - The Amazing Christmas Symbolism of Little Jack Horner","start":19.4,"end":20.72,"speaker":"Announcer","text":"Few months I will have caught up."}
{"episode_id":"SW - #047 - 2019-08-03 - The Amazing Christmas Symbolism of Little Jack Horner","start":20.72,"end":25.64,"speaker":"Jonathan Pageau","text":"All the videos and the podcast so that my videos on YouTube and my."}
{"episode_id":"SW - #047 - 2019-08-03 - The Amazing Christmas Symbolism of Little Jack Horner","start":25.64,"end":27.6,"speaker":"Announcer","text":"Podcast will be coming out at the same time."}
{"episode_id":"SW - #047 - 2019-08-03 - The Amazing Christmas Symbolism of Little Jack Horner","start":27.76,"end":52.68,"speaker":"Jonathan Pageau","text":"But nonetheless, I think that thinking about nursery rhymes, something that can seem so silly, so immediate, can harbor some very profound symbolism. I think it is a worthwhile exercise to do in order to understand narrative and symbolism. So I think you will enjoy this and we'll next time you hear about a Christmas video from me, it'll probably be actually around Christmas."}
{"episode_id":"SW - #047 - 2019-08-03 - The Amazing Christmas Symbolism of Little Jack Horner","start":52.92,"end":54.68,"speaker":"Announcer","text":"And so just to remind you that."}
{"episode_id":"SW - #047 - 2019-08-03 - The Amazing Christmas Symbolism of Little Jack Horner","start":54.84,"end":63.82,"speaker":"Jonathan Pageau","text":"Everything I'm doing online, these podcasts, the videos, my presence is possible thanks to your support. So please go to thesymbolicworld.com and see."}
{"episode_id":"SW - #047 - 2019-08-03 - The Amazing Christmas Symbolism of Little Jack Horner","start":63.82,"end":65.66,"speaker":"Announcer","text":"How you can support this podcast."}
{"episode_id":"SW - #047 - 2019-08-03 - The Amazing Christmas Symbolism of Little Jack Horner","start":65.66,"end":69.94,"speaker":"Jonathan Pageau","text":"Of course, by sharing this, by subscribing, and also by leaving a review wherever."}
{"episode_id":"SW - #047 - 2019-08-03 - The Amazing Christmas Symbolism of Little Jack Horner","start":69.94,"end":91.22,"speaker":"Announcer","text":"You listen to podcasts is also extremely useful. So I hope you enjoy. This is Jonathan Peugeot. Welcome to the Symbolic World."}
{"episode_id":"SW - #047 - 2019-08-03 - The Amazing Christmas Symbolism of Little Jack Horner","start":102,"end":550,"speaker":"Jonathan Pageau","text":"So, as I've said before in other videos, what's important to understand when we look at this nursery rhyme is to look at the structure. If you go online, if you go on the Wikipedia page and you try to understand the meaning of this nursery rhyme, you will find all kinds of theories about some historical grounding in the Middle Ages or in, you know, later history and how it appeared in the 18th century as social commentary on this or that event. And what you'll find is that it's not clear exactly where it comes from. And to be, to be honest, my point is that it's not that important. What's important is that out of the thousands of nursery rhymes or songs that came about in those times, this song was kept and this song was selected. And the reason why it was kept and selected is because it taps into something which is deeper. The structure of the nursery rhyme taps into a deeper reality. And in fact, it can help us to understand some of the symbolism which surrounds Christmas. And I've done a few videos on Christmas recently focusing on, let's call it, you know, the positive aspects of Christianity. But this particular, the positive aspects of Christmas, this particular nursery rhyme actually shows us a flip side of the symbolism of Christmas, the negative aspect of the whole symbolic structure around which Christmas organizes itself, related, of course, to the solstice. Now first of all, let's look at the elements. So you have this little Jack Horner who goes and sits in a corner and he's eating his Christmas pie. So he puts in his thumb, pulls out a plum, and he says, what a good boy am I. So this nursery rhyme is amazing. It functions on so many levels. It's going to be very difficult for me to. To fully unravel all the beautiful symbolism that is in this nursery rhyme. So let's kind of start and we'll go at it line by line. Hopefully we can get to. I can get to show you the mystery. Now, first of all, Jack Horner, There are two things in that name. Little Jack Horner. So the first is the Jack part. The Jack part is. It's complicated. Jack is a figure which appears in many nursery rhymes, many stories. And the Jack has to do with Jacob. It relates to the notion of Jacob. It has to do with this idea of. It has to do with this idea of how the. Just can somehow be a trickster and how this. I talked about, you know, this notion of the trickster as flipping things upside down, but that at the end of something, the trickster can also flip things back on their feet. And so Jack has to. Has to do with this idea. You see it in the story of Jack and the Beadstock, where he's a thief, but his thievery is able to restart his family's story by stealing from the giants. He goes into this world of dark giants and he's able to steal from them. And by doing that, he restarts the cycle of his family, which was poor, in which it didn't have anything. Now, this nursery rhyme has the same structure. And so we'll go through it, we'll get to it. Now, little Jack Horner. So the Jack, first of all, the Jack has to do with this notion of the trickster, which goes to the edge and is able to flip things around. Then Horner, the notion of Horner, you have to see it as rhyming with corner, of course, I've told you about, in other videos about the relationship between certain word symbolism. I haven't gone a lot into word symbolism because it's difficult to talk about just in a video. And it also can seem very, very obscure to people. But there are relationships of words, etymological relationship, but also sound relationships, which you meaning can appear in the relationships of sounds between different words. So horner and corner. Horner has to do with horn. And so this idea of a horn. Now, horn, corn, crown, all these words are related to each other in terms of their meaning. The notion of a crown on the head of a king is related to the word horn. I've talked about this in the notion that in Hebrew, for example, there's a word in which the word for glory and the word for crown, the word for horn, they're all the same. It led to a confusion, or let's say a very mysterious interpretation in the Western church, where when Moses comes down from the mountain and. And it says, you know. And it says that he had glory, that he was shining, and people couldn't look at him. You could also interpret it as he had horns on his head. And so he. And so you could see medieval representation of Moses with these horns on his head. And so you can see it. The idea of a horn, the idea of a corner, the idea of a crown with all these points, all of this is related to the same symbolism that is this idea of moving into an extreme, going into the point of something, the place where this comes together, but also the place where something ends, okay? And so the solstice, both solstices can be seen as these horns, as these corners where the sun is going down, down, down, down, down, and then starts to go back up, or the sun is going up, up, up, up, up, and then starts to go back down. And so there's a relationship between this whole idea of the solstice as this darkest time, this idea of the horn as this point which comes together, and also just this notion of the extreme as well. The idea of the extreme and this. All the symbolism of the extreme is extremely, very difficult to understand. It's quite intense, let's say that it's not easy to get to. So, anyways, let's get back to our little friend, Jack Horner. So Jack Horner sits in a corner and he eats his Christmas pie. Now, the traditional understanding of this nursery rhyme is that it has to do with a form of opportunism, a form of someone who profits from a situation."}
{"episode_id":"SW - #047 - 2019-08-03 - The Amazing Christmas Symbolism of Little Jack Horner","start":550,"end":551.32,"speaker":"Announcer","text":"In kind of a bad way."}
{"episode_id":"SW - #047 - 2019-08-03 - The Amazing Christmas Symbolism of Little Jack Horner","start":551.48,"end":755.87,"speaker":"Jonathan Pageau","text":"And so it's been related to, in politics, for example, where something bad is happening, a war or a bad situation, and out of that, someone is able to put their thumb in and pull out a plum. And so for. There are several political cartoons which show, for example, Abraham Lincoln, who. Who, you know, through this whole situation of the Civil War and the situation of the south, he has this plum, which is Louisiana, and he pulls out this plum as this thing that he can pull out of the dark south as his precious thing that he can rely on, okay? And so you can see it also in terms of any type of political situation where a bad thing is happening and then somebody is able to profit from it. And so Jack Horner goes into his corner, and he's got his pie all for himself. He's got this pie, and he's hiding in the corner. You know, he's not. He's not sharing it. He's hiding in this corner. And then he puts in his thumb, and he pulls out a plump. Now, there's a lot of. There are a lot of things going on in that symbolism. So this notion of entering into the corner, entering into the extreme, entering also into the. The hidden place. I've told you about this hidden place or this dark place in several of my videos. And then in this dark place, he's holding this pie. And the pie, you have to understand the pie as the bottom of the hierarchy, the pie as this food, as this potentiality, but also the way the pie is made, it's hiding its contents. And so it's like a gift wrapped in paper. Under the tree, under this corner, you have this wrapped gift which is hidden. And so Jack Horner plunges his thumb in, and he pulls out a plum. Now, the plum is the same as this spark. It's the same as the golden ball that the frog goes to get down to the water. I've been telling you about this symbolism forever. So Jack puts his thumb into this unknown place. Like he's fishing. You know, he's putting his. He's putting his fishing rod. He's throwing his fishing rod out into the dark waters. Then he goes in and he pulls out a precious thing. A plum, a seed, a, you know, pearl, whatever, how you want to imagine it. That's the imagery that's used, okay? And then finally he says, what a good boy am I. Now you can see how that. What a good boy am I, Cuts in with the whole idea of Christmas, where, you know, this notion that if you're good, you will get a gift. But now you see that it follows the very same structure, this notion of this hidden gift. He goes into the corner, into the solstice, into this dark place, to the darkest place. And then he's able to go in and find a precious thing out of this dark place, okay? So it's the same symbolism as Christmas, as Christ hiding under this mountain, hiding in a cave, the darkest place. Think of a cave as a corner that goes down, and think of a mountain as a corner that goes up. And so Christ goes down into this corner that goes down and there appears the hidden Christ in that hidden place."}
{"episode_id":"SW - #047 - 2019-08-03 - The Amazing Christmas Symbolism of Little Jack Horner","start":756.1,"end":756.5,"speaker":"Announcer","text":"Okay?"}
{"episode_id":"SW - #047 - 2019-08-03 - The Amazing Christmas Symbolism of Little Jack Horner","start":757.38,"end":839.97,"speaker":"Jonathan Pageau","text":"So the structure is the same. And you can see the same for the political opportunism that I talked about. The structure is the same. But what's important and what is helpful in thinking about the little Jack Horner story is that it shows us how symbolism is structural. It's not moral directly. It does refer sometimes to moral things, but the symbolism is structural. And each structure in terms of symbolism also has a dark inversion. And so, in fact, you can imagine that the, the, this story of little Jack Horner, although it follows the same structure as the Christmas story, it is a upside down version of the Christmas story. It's a, it's a dark version of the Christmas story that is, you can see it first of all in the notion that he pulls out the plum and then he says, what a good boy am I? And so in that gesture of saying, what a good boy am I, you can see the difference between, for example, the notion of being judged by Santa Claus as to whether or not you're good. You can see it as Adam, as Eve reaching out to take the fruit for herself and saying, what a good."}
{"episode_id":"SW - #047 - 2019-08-03 - The Amazing Christmas Symbolism of Little Jack Horner","start":839.97,"end":841.33,"speaker":"Announcer","text":"Boy am I, what a good girl."}
{"episode_id":"SW - #047 - 2019-08-03 - The Amazing Christmas Symbolism of Little Jack Horner","start":841.33,"end":913.32,"speaker":"Jonathan Pageau","text":"Am I. I am the. I am independent. I am my own judge, I am my own author. And so here I am going to reach out and take this, this fruit from the tree. So Jack Horner plunges down into the pie and he takes the fruit for himself in a way that is. It's a negative fruit way. It's not. It's not. It is not. It doesn't. It shows us the negative aspect of that symbolism, okay? And so you can imagine, and that's why it refers to profiteering. That's why it refers to, although following the same structure, going into a dark place, going into a place where things are chaotic, things are falling apart, there's war, there's conflict, there's all these problems. And then finding the golden thing in the darkness and, and pulling it out, right? Not in the notion of wanting then to restart the world, this idea of going down into the darkness and finding meaning, but rather to do it in a way that is profiteering. And is there to just bolster my own interest in a selfish and fallen manner. You could say thank you for listening."}
{"episode_id":"SW - #047 - 2019-08-03 - The Amazing Christmas Symbolism of Little Jack Horner","start":913.32,"end":968.17,"speaker":"Announcer","text":"To the Symbolic World podcast. As you know, this podcast is for now based mostly on my YouTube videos, which I am transferring into audio format. Please go ahead and visit my YouTube channel. There are more videos there on different subjects that I'm not going to put into audio. And please share this to your friends. I know a lot of people know about the YouTube content, but not so many people know that this is also a podcast. So share it to your friends. Share it on social media. And if you can, feel free to support this financially as well by going to my Patreon page, which is Peugeot Videos. Strangely, you can go there and you can support it at any amount that you want. A month for all the patrons. I do a monthly Q and A live Q and A in which people can ask questions in the chat, and I try to have a more personal connection with people. The YouTube comments have become difficult to follow and to answer. I'll see you soon."}
