{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":0.56,"end":114.92,"speaker":"Jonathan Pageau","text":"Hello, everybody. I'm very happy to be here with Toomer Wys. Many of you have seen his work, you've heard his music. Tumor Wys has made many fusion of music with audio clips, and part of that has been going through some of my talks. And recently he went through one of my first public talks, which was called Pentecost for the Zombie Apocalypse. It was given at an oca, at an Orthodox church meeting with all these priests. And the bishop was there as well. And it was a moment that was very unnerving to me because it was the first time that I was talking to all these bishops. So I took a lot of time to prepare. I really wrote it down and I memorized it and rememorized it. And I know that Marvin is his actual name. Marvin noticed that he was very prepared, and so I think he kind of grabbed on that and thought it would be a good idea to bring it all together and to make almost like a musical out of my. Out of my talk. So I was really impressed what he did, and I'm definitely looking forward to talking to him about it and you know what, the choices that he made and the decisions that he brought about in this musical. This is Jonathan Peugeot. Welcome to the symbolic world. So, Marvin, it's really good. We've met before on not in person, but in Zoom. So it's good to talk to you again. I'm really looking forward to hearing about what your decisions were. Maybe you can start and tell us what it is that made you want to do this, because it was a massive project."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":115.4,"end":206.28,"speaker":"Marvin","text":"Right. So generally what made me go into this kind of music, we call it Flow Fi, Akira the Dawn, for example, who also made a song with your, calls it Meaning Wave is that. And you talk about that in your talk too, is that there is this hunger for meaning. And I feel that in myself and I see that also in the world and in my friends. And it seems like it's. So most of the music and entertainment culture in general is meaningless. There's nothing that you can grab onto. It's nothing that you can, let's say, use to also learn about the world and learn how to act in it. And I felt the strong urge to kind of participate in changing that, especially after I found out about what Akira is doing and after I worked with him for a bunch of like, I think six months or something like that. And I started with Peterson's, with Jordan Peterson's works, because that's also how I got into all of this in general. Like his interview With Kathy Newman, of course, and then his biblical lectures, which also brought me on the way towards the church. And then I was talking to Jacob and Lisa, who both loosely work with you on your channel. I think Jacob's a moderator. Lisa manages the clips channel, Right."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":206.6,"end":207.64,"speaker":"Jonathan Pageau","text":"Yeah, exactly."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":208.04,"end":246.74,"speaker":"Marvin","text":"And I think it was Lisa who mentioned the Pentecost talk to me and said, it's really standing out from everything else that you've done. And so I gave it a listen and I instantly heard what she said. And you mentioned it, too, that you prepared it a little. So it's already a little segmented and it's already a little like poetry, I think I would say. And that also made it really easy. So I just listened to it and then I cut it up into the different pieces. And then I said, okay, let's see how far we get with this."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":247.54,"end":251.38,"speaker":"Jonathan Pageau","text":"You've been working on this for like a year and a half, maybe like it's been a while."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":251.46,"end":302.65,"speaker":"Marvin","text":"Yeah, about. I think I started cutting it up in maybe March last year or something like that. But then I focused on a album I wanted to do from Peterson's Talk, who daresay he believes in God. Because I thought, to me personally, it was a preparation for going into Pentecost and the icons themselves, what you talk about. So I thought it would be better to release that first. But I had some problems contacting Jordan again after he gave me his initial. Okay, obviously, I think it's. Yeah. And so then I just thought, okay, then I'll focus on the Pentecost album, because I had the preparation that I needed from the album so then I could get into your stuff."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":303.29,"end":311.05,"speaker":"Jonathan Pageau","text":"Yeah. And you put it out on Pentecost. It came out on Pentecost Day, which is a nice little move on your part to have that."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":311.85,"end":334.57,"speaker":"Marvin","text":"Yeah, right, right. I initially wanted to get it out on Halloween last year when we did the livestream. Well, it didn't quite work out, but that's good because then I had the time to finish the songs properly and all of that. And yeah, I'm very proud of what came out of it and also surprised that it worked out so well."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":335.21,"end":356.42,"speaker":"Jonathan Pageau","text":"So I'm going to surprise you with a question. So before we go into some of the songs, some of the clips, if you can resume the talk, I guess you've listened to it so many times now. If you can resume the talk into a short sentence or short statement, what would you say that the talk is about? Sorry to put you on the spot there."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":356.42,"end":443.61,"speaker":"Marvin","text":"No, no, no, no problem, no problem. I would say Christ is here for everyone, and without exception, for everyone, everyone can come to him. I think that's the message, and that's definitely the message that I got from it. And, yeah, I get a little emotional thinking about that, to be honest, because your whole emphasis on St. Christopher, for example, like the monster that wasn't able to pray or fast or abstain from anything, in the end, being able to carry Christ across the river and to join the church and to become a saint, it's so intensely moving. And because I also. I wasn't in a very good place, let's say, for a long time. And also still not really when I started engaging with your content, you know, drug use and all of that, like, the modern world stuff. And I didn't think that there would be any place for me in the church. And so there was also no real motivations. Why would I change anything, really? Because how would I fit into that? Yeah, but that. I mean, I was wrong with that. And your talk showed me. And I mean, now I am part of the Orthodox Church and I'm even considering becoming a priest."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":444.17,"end":448.89,"speaker":"Jonathan Pageau","text":"Oh, my goodness. I didn't know that. Well, you've got the beard already, so you've got that going."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":449.33,"end":451.57,"speaker":"Marvin","text":"Yeah, that's exactly what my priest said, too."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":451.73,"end":459.73,"speaker":"Jonathan Pageau","text":"He said, you've got the beard, so you're. That's amazing. Congratulations. When would you receive in the church? I don't remember."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":459.89,"end":468.45,"speaker":"Marvin","text":"When that happened was in, I think, March 13th. So it's like three to four months now."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":469.01,"end":469.65,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":469.81,"end":482.01,"speaker":"Marvin","text":"And yeah. Yeah, that was a big chunk of that is because of you and your content for sure. So thank you very much on this note for a second."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":482.17,"end":488.17,"speaker":"Jonathan Pageau","text":"Well, glory to God that you came through the threshold. So I'm happy to hear that."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":488.33,"end":495.85,"speaker":"Marvin","text":"Yeah. So I think that's the sentence that I would bring it down to is like, Christ is there for everyone, and everyone can join and everyone can be saved."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":496.17,"end":507.75,"speaker":"Jonathan Pageau","text":"Yeah, that's awesome. So you prepared some of the songs or some of the clips from some of the songs that we can kind of listen to a little bit and then we can talk about. So go ahead, set it up and we'll go in there."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":508.15,"end":509.59,"speaker":"Marvin","text":"Awesome. Will do."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":510.55,"end":516.19,"speaker":"Jonathan Pageau","text":"So we live in a time of monsters. I announce this to you, but I."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":516.19,"end":519.51,"speaker":"Jonathan Pageau","text":"Think all of you already know that."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":523.11,"end":551.14,"speaker":"Jonathan Pageau","text":"We only need to glance at popular culture to realize this. At the narrative level of our culture and our stories, we've become obsessed with monsters, with the strange alien, with the marginal, with the glorification of the exception of things that don't fit most of us here probably grew up with Sesame street, where we were told that monsters."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":551.14,"end":551.82,"speaker":"Jonathan Pageau","text":"Are our friends."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":554.62,"end":556.42,"speaker":"Jonathan Pageau","text":"And it's no longer in fiction."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":556.42,"end":556.94,"speaker":"Jonathan Pageau","text":"By now."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":559.12,"end":590.46,"speaker":"Jonathan Pageau","text":"The monsters have left the dark spaces under our beds. They have left our nightmares to come out into the open at a social level. We can feel and see all around us the growing polarization, acceleration of what we can only call the breakdown, the decomposition of culture, a progressive dissipation of the center which rallies us as a society."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":591.58,"end":591.98,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":592.14,"end":626.23,"speaker":"Marvin","text":"So that was. Yeah, the clip from the first song, Monsters and the Second Coming. I think this one came about a little later in the whole process, except for the intro, which, when you listen to the album, you'll see that there's like a minute of introduction to that song, which is just weird sounds like UFO sounds and like ominous robotic breathing and stuff like that, which then culminates in the drums, you know, getting into it just to make it a little eerie and set the tone."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":626.39,"end":657.42,"speaker":"Jonathan Pageau","text":"Yeah, there's something. There's definitely something even in the way that you kind of parse out. You modify the rhythm, you know that there's this kind of slow. There's this kind of slow move. It reminds me of some of the, like. Some of the music that I was listening to in the late 90s, this kind of intense slow movement, you know, this guitar. But is. How can I say, this kind of bringing you. Bringing you somewhere, but in this intense slow manner. And so that's what I was getting from that when I listened to it the first time. Nice."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":657.42,"end":673.5,"speaker":"Marvin","text":"Yeah, that's also what I was trying to cause the listener to feel, let's say, when I was doing that. I like that when it is slow, but it's this kind of unstoppable, even though it's slow, like it's going to go forward anyway."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":673.81,"end":711.08,"speaker":"Jonathan Pageau","text":"Yeah, that's a good image. Like this kind of slow but unstoppable movement that's coming towards you. Definitely. That's a good way to describe it. And so that was. It's funny because when I listen to myself, I can hear. Because I was reading and I had memorized at the same time. And so I can hear the mistakes that I make. Just in terms of grammar, I can make a few grammatical mistakes, which is totally fine. This is where people realize sometimes that I'm not a native English speaker, even though people think I am. I make these strange grammatical mistakes in the way I'm speaking. Sorry, that. That's what I'm hearing. It's hard for me not to hear that when I'm Listening to it."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":711.24,"end":733.56,"speaker":"Marvin","text":"No, I understand it. I think if it were the other way around, I would notice that too, because I'm also not a native speaker. Like, my native language is German. But there are even some. A few moments where because you made a grammatical mistake, that's what made it possible to have it align with the rhythm of the song. So I'm happy about that."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":733.64,"end":800.95,"speaker":"Jonathan Pageau","text":"There you go. It's like I actually. What I was actually doing was changing the grammar to, you know, to fill the beat. That's what I was doing. Yeah, it was all. It was all. It's all deliberate from the beginning. And so that's the first song. And that's really just my kind of. My introduction talking about monsters and just kind of getting people. Because I was dealing with a lot of people at that time, if you have to think this was like in 2017, I think so we were dealing with. With people even. I think it was late 2016, maybe, dealing with people that had never heard my content at all. And so I was going in cold for most of the people in the audience and trying to kind of paint a general image of something that. Paint a general image of something that was maybe they never ever thought about. And so it was. Yeah, it was really nerve wracking. So trying to get little images of Sesame street and these monsters that kind of pervade our culture to get people to realize something they never realized. Even though it's so obvious, once you've seen it. Right. It becomes so obvious. But a lot of people don't see it. They just imbibe their culture."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":801.27,"end":817.24,"speaker":"Marvin","text":"Yeah, even our buses, they have these little machines where you check in your ticket and they are called ticket monsters now. And they are also painted in that way that it's like a little monster that you have to feed. It's everywhere. That's."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":817.24,"end":871.65,"speaker":"Jonathan Pageau","text":"Yeah, exactly. Well, once you start to see. You start to see, let's say, the pattern of what's going on, then. Then it's hard to turn back. You just. It just. You just notice that it's. And it's get. It's increasing too. It's just like the things that I talked about in 20. It's funny because this year, if Covid permits, who knows. But in. In the fall, I was asked to come talk to the same group, so the same oca, it's the Diocese of the south. And they have their. Their kind of meeting of all the priests and the bishop together. So they asked me to go speak at their assembly again. And it's just so Funny, because everything I said, which was in almost was there, but now it's like times. It's times 10 now. And so I don't know how I'm going to deal with that in terms of doing a talk again to all these priests. I've been thinking about it, like, almost obsessively. Okay, so how am I going to outdo myself now with that talk that I did four years ago? Nice."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":871.73,"end":874.85,"speaker":"Marvin","text":"I'm looking forward to that. Then we'll have a part two."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":875.33,"end":878.61,"speaker":"Jonathan Pageau","text":"Have a part two of the musical. Indeed. That's hilarious."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":879.97,"end":893.41,"speaker":"Marvin","text":"How did they react to it? Because for me, it was easy to accept all of that because I was on the outside and I was kind of a monster. So I liked hearing that. But people who are on the inside might not. What was the reaction?"}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":893.73,"end":957.26,"speaker":"Jonathan Pageau","text":"I would say at least my impression of what happened was extremely positive. It was. I would say that at some point I felt like I had the audience kind of hypnotized. I don't know how else to describe it. At first, I was kind of looking out and I was seeing puzzled faces. And then as the talk went on, all of a sudden I could see people get into the groove of what I was saying. And then by the end of the talk, I think there was really, like, a buzz. I don't know how to explain it. Like a buzz in the audience. And so I really. It was overwhelmingly positive, I would say, in general, the reaction that I've had from my hierarchy has been overwhelmingly positive. Obviously, I've been worried about that because I'm talking about things in a way that are a little surprising to some and maybe are not from the same angle. And so I was always worried that people wouldn't understand what my purpose was or what I was getting to. But I haven't felt that I've really been supported by my own bishop and then by, you know, just by the hierarchy in general. So that's been wonderful."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":957.58,"end":978.3,"speaker":"Marvin","text":"Yeah, that's awesome to hear. Also, I mean, I'm not completely surprised because the Orthodox Church is much more embedded in all of this mysterious stuff, let's say, than. Well, the different. The other churches. But, yeah, that's really great to hear and also reassuring, let's say."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":978.62,"end":1102.99,"speaker":"Jonathan Pageau","text":"Yeah. And I do still get some pushback because of the icon of St. Christopher, and I sympathize with that. I totally understand that some priests are not happy that I am making images of that icon or just talking about it or posting about it, because it was condemned in a Russian. Late Russian council. In a council that is under Peter, the great Peter the first. But the most interesting thing about that is the reason why they are angry about me promoting the icon is actually the reason why I'm doing it. Because they think that I am demonizing the other, that I am kind of portraying this idea of the alien as a monster and all of that. And I keep trying to help them understand that it's a saint. It's an icon of a saint. And the people that love that icon that I've encountered are people who feel like that monster. Right. It's not like I'm saying all these evil monsters is that that image is actually calling people who feel in them an aspect of marginality, of being misunderstood, of being. They identify with that. And that's like the weirdest thing for people to understand that some people really do. We all, to a certain extent, have that in us. You know, like an aspect of the gargoyle in us. But I think some people in some more. Some people in particular have feel more that way. And so I think that that icon is playing the opposite role of what he thinks it is. He thinks it's pushing people away, but I think it's actually attracting people that are the weird and the strange because it's still an icon of a saint. And they can identify with the story of not being able to fully fit in, but then nonetheless having a place and having a role to play in that story. So it's a funny situation, but still I sympathize with people who are annoyed with me. That's like the biggest thing that I've gotten in terms of pushback has been about the icon of St. Christopher."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":1103.07,"end":1117.95,"speaker":"Marvin","text":"That's interesting. I thought that if you were to get pushback, I thought it would be because they themselves wouldn't like the icon. Like, I don't like to see this as part of the tradition. I thought that would be the problem, but I get that, too."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":1118.83,"end":1154.58,"speaker":"Jonathan Pageau","text":"Well, that's why they don't like it, because it's suggesting. Because it's talking about the stranger as almost like. As a monster. And also because they don't like the idea of dehumanizing. This idea of kind of dehumanizing people, which is right. They're totally right. It's like they're completely right. But that's the whole mystery of this encounter with the strange and how we are able to then ultimately find ways to bridge. You know, that's what Saint Crucifer ends up being, is a bridge from the inside to the outside. So it does always have A strangeness to it. So. Yeah."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":1154.58,"end":1177.37,"speaker":"Marvin","text":"Which is also mystery itself is like part of. Part of. I've been talking about that to a friend of mine. Mystery itself is kind of part of being and part of the pattern. It's not like mystery is something that's only not revealed. It's like mystery itself is a stone that fits into the wall or something like that. I think you get what I mean."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":1177.69,"end":1222,"speaker":"Jonathan Pageau","text":"Yeah, exactly. That there is an aspect of reality which is not properly represented. And because of that it appears to us sometimes in these types of strange forms, let's say. And so on the edge of the world you encounter a dog headed man. But then at the edge of the holy of holies you encounter a beast with four wings. It's like humans with wings. I know you think it's not as weird to have a human with wings, but it's still weird. Just because we're used to it doesn't mean it's not weird. Like a man with a dog headed face. It's like those are weird images too. They're images that are pointing to something like you said, which is not fully graspable in our category. Right."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":1222,"end":1227.93,"speaker":"Marvin","text":"I mean just think of the. I think the Ophanima, like these wheels within wheels which have like."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":1227.93,"end":1228.81,"speaker":"Jonathan Pageau","text":"With eyes on them."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":1229.21,"end":1244.97,"speaker":"Marvin","text":"Like what is that? Yeah. If that isn't weird. So. Yeah, I get what you mean. We're just used to the image of people with wings. I would say that's just. It's more normal to us because we see it more often."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":1245.13,"end":1292.92,"speaker":"Jonathan Pageau","text":"Yeah, we see it more often and we think that it's similar, but it's like a lot of the angels are warriors too. Just like St. Christopher. It's almost like they're reflection. St. Christopher stands on the edge of the world and the angels stand between us and God. They stand on the edge, but on the other edge. Right, the edge, the bridge between the higher and the lower. And so they both appear as warriors, they both appear as a form of hybrid. But it also makes sense that their hybridity is different and that they would have something like the head of a human and then the body or the wings of a bird. Whereas on the other edge, which is the very edge of the world, then you would have something like the head of an animal on the body of a. It's almost like the reverse. But it's also showing the place in the hierarchy in terms of strangeness."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":1293.24,"end":1301.24,"speaker":"Marvin","text":"Yeah, right, right. I hadn't even noticed that yet, this turning it around. But yeah, you're right. Okay. Yeah. We could get into the next clip."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":1301.4,"end":1302.28,"speaker":"Jonathan Pageau","text":"Yeah, go for it."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":1302.44,"end":1372.21,"speaker":"Jonathan Pageau","text":"As the narrative fabric of our world begins to fill in quantities that are barely possible to believe with images of the monstrous, as we feel the world being torn apart by fragmentation and conflict, we are simultaneously as individuals being constantly assaulted by images, images with the purpose of awakening our own desires. We've come to the point where we, most of us, so many of us, have been accustomed to the constant exposure to the stranger and stranger fringe of desire whilst being enticed by the siren song to indulge, to give into the waves and the storm and to sink into the mire. Those two things, the edge and the end, they represent the same structure. They're the same thing in our stories. Those two things, the edge and the end, they represent the same structure. So even when he is a zombie, man is a microcosm."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":1373.4,"end":1382.76,"speaker":"Marvin","text":"Yeah. I don't know if you noticed, but the image that I used is kind of. It's not explicit, but you get what it kind of looks like."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":1382.76,"end":1383.08,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":1384.36,"end":1392.12,"speaker":"Marvin","text":"I thought it was funny. I was walking outside of my house and just saw it. I thought, yeah, we can use that. We can use that."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":1395.48,"end":1433.44,"speaker":"Jonathan Pageau","text":"I like this one a lot. Just because also, there's more surprise in the way that you played with the words and everything. And listening to it really, really made me remember what some of the things that I was able to do, because it was so written it was. I was able to constantly move between the analogy between the desire, the monsters, the edge, all of this, trying to kind of play between these different levels to help people see what I was talking about, like, allude to desire and then to siren songs and to. To these monsters that are on the edge but that are participating in your desires. And so I was like, yeah, I was trying to do that. I remember now."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":1433.68,"end":1464.59,"speaker":"Marvin","text":"And it worked out very well. Now, to me, it seems like you were starting different threads in the beginning and then bringing them more and more together. And the more you progress, the more you. So. Oh, yeah, he talked about that like, two minutes earlier. And then it's referencing back and forth and that's. It also makes you have these aha moments where you get the connection between the different levels of symbolism, let's say."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":1464.75,"end":1504.35,"speaker":"Jonathan Pageau","text":"Yeah, that's always been. What I've been trying to do all the time, is to try to surprise people by these connections that they don't expect. And that kind of comes together. But the way that you described it makes sense. Also makes sense of the puzzlement, the puzzled look that I was getting at the beginning. Right. It's like, where is he going? Where is he going? Because that's exactly what you said. It's like I'm kind of pulling on these threads and I'm pulling them together, but you can't see yet, you know, what the. What the image is. And then slowly it kind of builds up towards. Towards. With something that now you're like, okay, okay, this is what is going on, or this is what is happening. So, yeah, so that makes a lot of sense."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":1505.54,"end":1578.32,"speaker":"Marvin","text":"Yeah, it's very, very interesting. Also very helpful, the whole notion of the different levels. When you start to recognize, oh, this is actually that, and that's also this and this and this. This is kind of what made it impossible for me to push away the Christian story, Christian pattern anymore. Because, you know, at first you're like, oh, yeah, yeah, that makes sense. Okay, cool. But all these other things also make sense. But when you see how closed, let's say it is, it's all encompassing. Wherever I look, when I think about it hard enough or when I read the right things, then I get the connection between the things. And I never had that with any of my adopted worldviews. Let's say I was engaged in all this New Agey stuff and maybe a little Buddhism here, a little hidden Hinduism there, and. Oh, yeah, that sounds nice. Yeah, yeah. And it all stops making sense when you stop. When you. When you start thinking about it really hard and try to compare and all of that, but that's not the case."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":1578.32,"end":1684.94,"speaker":"Jonathan Pageau","text":"Yeah. And mostly the layering is the issue is one of the problems of the kind of New Age movement or the New Age direction is how it is so individualistic. It ends up being very individualistic. And there isn't the natural kind of hierarchy of patterns that lay themselves on top of each other and then create this web that you can live in. And so it either ends up being completely idiosyncratic. Like, you know, everybody who takes, like you said, a little bit of this, a little bit of that, they put it in a pot and then they. They have this breathing technique and this yoga practice and, you know, this and that, and they have a singing bowl or whatever, and they burn this, this, this. You know, they. They'll burn a certain amount of incense or whatever, but it's all kind of this convoluted thing. So it ends up being idiosyncratic, or it's like a guru and a bunch of devotees, and then it's like this weird little tyranny that usually doesn't last. Like, it ends up breaking down because it doesn't participate in these bigger, bigger stories. And it's also, it's even sometimes the way that we understand even Christianity. People want to represent it as a revolutionary thing, but we need to remember that. If you read in Scripture, it says that the disciples went to the synagogue every day, right until they were chased out of the synagogue. The disciples didn't think they were starting something new. They really thought, like they were just revealing or kind of manifesting something which was already there, but they were participating in its revelation. And so that's important to understand. And that's why, like you said, that's why Christianity ends up. Once you take it seriously and you realize that it connects different levels of reality together, you understand why it white held the west together for millennia. Yeah."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":1684.94,"end":1716.63,"speaker":"Marvin","text":"It's the only thing, especially this aspect is something that, after Jordan talked about it, obviously, but something that I so much love about Nietzsche and his writing. He understood that. He understood that that's like if you take God out of the equation, then everything else falls apart too. It's impossible to remain this. What's it like, this humanist idea that you can just be a good human being without having any basis for it. Yeah, that works. As long as it's not tested."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":1716.87,"end":1753.13,"speaker":"Jonathan Pageau","text":"Yeah. And as long as you take for granted that being good basically comes from Christianity. Because I love it when people say that you can be good and be an atheist. I'm like, no, you don't understand. It's not even whether you can be good and be an atheist. It's that what is the ground from which you gather the good? Like, even the good itself. Usually they're saying something like, I can be an atheist and still basically follow Christian values with a few modifications. It's like, doesn't work. It works for a while, like you said, and then it. Then it peters out and it kind of runs out of steam and becomes idiosyncratic or tyrannical."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":1753.37,"end":1762.57,"speaker":"Marvin","text":"Yeah. I mean, what's the use? Why not do the things that, you know you shouldn't do, but there's no moral basis for why you shouldn't do it. It's just."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":1762.89,"end":1763.21,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":1763.53,"end":1764.89,"speaker":"Marvin","text":"Convenience, let's say."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":1765.13,"end":1771.21,"speaker":"Jonathan Pageau","text":"Yeah, convenience or power, like some kind of state enforcement that, you know, those two sides end up getting stronger."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":1771.45,"end":1776.25,"speaker":"Marvin","text":"Right. Yeah. So that's very interesting. For sure."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":1777.05,"end":1777.53,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":1777.69,"end":1779.13,"speaker":"Marvin","text":"I would play the next clip."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":1779.29,"end":1780.01,"speaker":"Jonathan Pageau","text":"Go for it."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":1780.17,"end":1780.81,"speaker":"Marvin","text":"Awesome."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":1781.13,"end":1861.47,"speaker":"Jonathan Pageau","text":"The garments of skin is seen by the church fathers as all that is added to our nature in the world of the fall. The layers of society, of technology, those are the flip side. And In a way, they're of the same nature as our weakness and the passions which come from the world of death. Saint Gregory of Nyssa tells us that the hairs on our body are a symbol of death. They're without feeling dead and appear as our spatial extremities, the very limit, our garments of skin. Just as death appears as our temporal extremity of this earthly life. Of this earthly life. The giants in the Bible, those that appeared before the flood, were the sign of confusion and mixture. Wrapped in inappropriate sexual desire. Wrapped in inappropriate sexual. In the tradition of Enoch, they're seen as the origin of technology and magic and they were known to create hybrids. They're full of excess, reveling in conflict until absolute chaos could no longer be held at bay and the world was undone in the waters."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":1863.79,"end":1893.21,"speaker":"Jonathan Pageau","text":"What interested me in that is that there are so many. There's like. Like three or four melodies in that little part. Like you keep switching from different, even not just melod the actual tone or the feeling that's in the music. So it's like the first is this kind of almost like heavy metal, heavy guitar. And then it moves into something which is almost like it's almost lighter. It's lighter, you know, and then you. So I don't know, I'm curious to know like what, how. What's your decision making process when you're kind of bringing this together?"}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":1896.09,"end":1984.1,"speaker":"Marvin","text":"I don't know how common that is, but when I. In general, but especially in music, when I work on music, I experience it as an almost visible landscape that maps. That kind of maps on the landscape that I see with my eyes. And it's like when I go through different melodies, it's like going through, let's say an alley where it's like all a little. It's dark there and maybe a little wet on the floor or something. And then I get into more open space, spaces and I kind of even I see, let's say the buildings or the plants or whatever and the colors. And that's how I try to navigate through that is when I play a note or melody or something and then I see. Yeah, yeah, that fits. But it needs a window there or something like that. Let's say for example, when you talk about the giants and their inappropriate sexual desire. I had the sentence wrapped in inappropriate sexual desire that caused me to feel something specific. And then I got my guitar and I tried to try to translate that. Let's say I feel like the riff that I play, not the heavy metal stuff but the palm muted stuff that's in the lighter verse. It sounds kind of sticky to me, let's say."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":1984.1,"end":2003.02,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah. Interesting. Yeah, kind of. Yeah, that's a good. That's a good way of understanding it. Now it makes sense. Interesting. So you listen to the music, you listen to the words, and then depending on where the music. Where the words seem to kind of bring you into a different space, then you'll apply like a different melody to that. To that. That's what I'm getting."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2003.26,"end":2030.92,"speaker":"Marvin","text":"Yeah. Yeah, definitely. I mean, it's not that I always listen to the bit first and then make. Start making music for it. I have a rough beat where I feel like, yeah, yeah, yeah. That's kind of where Jonathan's moving here, is that this is the same space. So I bring it together and then I adjust it and I adjust your speech and I adjust the music again. But yeah, that's kind of my way of navigating through that."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2031.32,"end":2037.72,"speaker":"Jonathan Pageau","text":"And just out of, like. I'm just curious to know how long does it take to put together a song like this?"}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2038.37,"end":2069.36,"speaker":"Marvin","text":"It depends. I mean, there are songs that I had to work on for like a year even to get to where I wanted to, but there are others where it takes a few weeks to. And maybe there are even ones that I have almost done in two days. Then it's mix and mastering is coming. And then maybe I'm adjusting it to sound more. A little bit more like the other songs. So it fits together. Yeah, that really depends. It's from two."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2069.6,"end":2092.4,"speaker":"Jonathan Pageau","text":"Interesting. Definitely. And so what is it that fascinated you with this? Because you said you were kind of the idea of the garments of skin. Because it's definitely one of the most important. I mean, for me, it's one of the most important images I use to help people understand the modern world, let's say, and understand technology and understand this kind of world, of this world of layers. So I'm just curious about what is it about that idea that kind of."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2092.4,"end":2146.98,"speaker":"Marvin","text":"Resonated with you on one hand? Again, it's showing the symbolism that it's everywhere. Like man is a microcosm. And it showed me that. So that made it even more apparent how all encompassing these patterns are. And also, how do I say this? I would say that it's all a. Even musical instruments that we use and also the skin that we have and all that we do, all the technologies that we have are consequence of the fall. I was never aware of how that's because we're where we are. I thought, yeah, yeah, we fell. That's also A thing that happened, but that's the reason for history at all. And so that's. Yeah, that was so strange to realize."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2147.67,"end":2194.53,"speaker":"Jonathan Pageau","text":"Yeah. And it's interesting to see how in Scripture, once you understand that, you can notice how God is constantly recapturing, let's say, the space of the Fall and kind of transforming the Fall into something else. And so making technology, making singing into something which is directed towards him, making architecture into something which is also a temple and directed towards him. So this kind of movement from all these things that are developed by the lineage of Cain in the Fall, then end up being kind of turned back towards God, of course. And then the ultimate image is the new Jerusalem in the end of this kind of filling up of the world with a city, but that a city that is shining, this glorious city, which."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2194.53,"end":2197.69,"speaker":"Marvin","text":"Is this double inversion that you will also talk about later."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2198.25,"end":2199.85,"speaker":"Jonathan Pageau","text":"Right, Right. Which."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2199.85,"end":2215.67,"speaker":"Marvin","text":"Yeah, I always have to laugh when I think about that because it's so. I don't even know a word to describe it. It's so funny because I would have thought that there's no double inversion. There's just things are wrong and then they are set."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2215.67,"end":2215.95,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2215.95,"end":2231.07,"speaker":"Marvin","text":"And that seems so authoritative. But it's more like. I mean, like St. Christopher tricking the devil into revealing Christ to him. This is funny. I cannot not laugh at that."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2231.78,"end":2306.74,"speaker":"Jonathan Pageau","text":"Yeah. Especially that story. And then ultimately, the ultimate irony of the story of St. Christopher is that he wants. Because you have to always remember that he wants to serve the strongest person. That's what he wants. And so he goes out and he serves these different characters that finally kind of reveal Christ to him, but he still doesn't get it right. So he's there on the side of the river, and then he ends up serving the weakest person. So this child, this little baby, comes up to him, and so he serves the weakest person. But then it's actually Christ tricking St. Christopher into serving him. Right. That's what's going on. It's like he's like, just carry me across the water. And then as he's carrying him across the water, he's realizing what's going on. And it's like, okay, this is not what I thought it was going to be. This is not what I thought. And then finally, once he reaches to the other side, then he realizes that the thing that he wanted from the beginning, which was to serve the strongest man or the highest king, he ended up doing it without even realizing that he was doing it. It's part of. Also, he was kind of Saved despite himself, you could say. So it's really an amazing. It's such an amazing. Every time you look at it, you end up seeing how there's a lot of other stuff going on in that story that maybe you didn't notice at the outset."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2306.74,"end":2323.2,"speaker":"Marvin","text":"Yeah. It's very often this idea that you have to let go of something when you're clinging too much to it, let's say. But then you, like. Not always, but sometimes God just gives it to you anyway. After you let go of it, after you stop your detachment to it, let's say."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2323.2,"end":2336.32,"speaker":"Jonathan Pageau","text":"Exactly. Like when you're too attached to something, it makes you lose it. And then if you're willing to be detached from it, you find it again in very surprising ways. Sometimes not in the way you expected, but it definitely comes back to you."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2336.57,"end":2371.89,"speaker":"Marvin","text":"Yeah, I mean, that's even something that you can observe in human relationships when you're clinging to a person, let's say friend or girlfriend or something like that. And then it's very, very, very interesting. Yeah, I can play the next clip. Oh, no, before that. I don't know if that worked. Maybe. Tell me. When I made the music for Desire, that was the last song that I made for the album. And I wanted to do, like, I wanted to have a sexy song, you know, where it's like, did that work out?"}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2372.21,"end":2375.73,"speaker":"Jonathan Pageau","text":"Well, I don't. The problem is that I don't remember the names of the."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2376.85,"end":2383.25,"speaker":"Marvin","text":"It's not the last one we heard, but that one before where you say, like, the things the edge and the end represent the same structure and all that."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2383.33,"end":2393.38,"speaker":"Jonathan Pageau","text":"I don't know if I would have. So I don't know if I would have recognized it that way. Maybe it's also because I don't expect it to be that. And so I'm not sure I would recognize it that way. Sorry."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2393.62,"end":2396.78,"speaker":"Marvin","text":"Yeah, no problem. No problem. Yeah, I'll play the. I'll play."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2396.78,"end":2399.46,"speaker":"Jonathan Pageau","text":"Oh, I think because of the funky bass."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2399.86,"end":2406.74,"speaker":"Jonathan Pageau","text":"As the narrative fabric of our world begins to fill in quantities that are barely possible to believe."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2407.7,"end":2408.1,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2408.1,"end":2408.82,"speaker":"Jonathan Pageau","text":"With images."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2408.82,"end":2435.61,"speaker":"Jonathan Pageau","text":"Yeah, you're right. You're right. I did. It's funny because when you played it this time, I did notice the bass. And I'm like, hey, he's got this, like, funky bass that. Going in there. And so. But I didn't connect it, which is obviously. Which makes sense because that's also. The funk was always about kind of like that, you know, what's his name? Barry White or whatever, with like, this kind of low bass. And so now you're right. Now that you say it. And I remember that it's kind of low bass coming in. I'm like, yeah, okay, I get it. I get it."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2436.09,"end":2448.49,"speaker":"Marvin","text":"Nice. Yeah. Thank you. Awesome. The next one is the seventh song, the Ultimate Unexpected. It's very short, and I made it so short because I want people to want to listen to it twice."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2451.19,"end":2455.75,"speaker":"Jonathan Pageau","text":"The monster is both the encounter with the surprise of the future as we."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2455.75,"end":2457.59,"speaker":"Jonathan Pageau","text":"Move forward in time."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2459.11,"end":2510.55,"speaker":"Jonathan Pageau","text":"So to encounter the unexpected, the monster is also the encounter with the surprise of the edge as the church expands to the dark corners of the world. But also the dark corners of our own lives as the spirit of God transforms us. For most of us, there will always be foreign elements, monsters hiding in our garments of skin. So here in Pentecost, this monster is represented as not yet in the church, in the church, but as part of the potential into which the church can grow. As part of that which can hear the gospel in its language. As part of the potential into which the church can grow. As part of that which can hear the gospel in its language."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2513.11,"end":2541.43,"speaker":"Jonathan Pageau","text":"I really like that one. I think it's probably one of the most musical ones that has more melody. And the idea of kind of singing over my voice as I'm saying things, I think it really is effective. It really does something. And it almost makes you hear the melody in my own voice as I'm talking. And you can hear the melody being sung behind it. It kind of fuses together with my voice. I really think it's probably one of the best ones in terms of the terms of the song element of it."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2541.43,"end":2541.83,"speaker":"Marvin","text":"Yeah."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2541.83,"end":2542.11,"speaker":"Jonathan Pageau","text":"Thank."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2542.11,"end":2565.08,"speaker":"Marvin","text":"It was also, I gotta say, maybe the most fun to record. At least the singing stuff. Yeah, it moves very nicely. And also you mentioned it yourself, like you have an inherent. Maybe everyone, but you especially have an inherent melody in the way that you talk. And. Thank you. It makes it rather easy to do this kind of stuff."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2565.96,"end":2580.51,"speaker":"Jonathan Pageau","text":"Yeah. That's funny. I don't realize. I wonder if I have the same melody in French as I do in English. I'd be curious to know if the language you speak will affect the way, the tonalities that you use. I don't know. I have no idea."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2582.26,"end":2590.54,"speaker":"Marvin","text":"I mean, I don't really speak French. Like, only a few sentences. Even though I had it four years in school, I just wasn't very good at it."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2590.54,"end":2596.74,"speaker":"Jonathan Pageau","text":"Well, what about you? Between English and German, do you feel like it's a different melody in terms of the sounds that it's bringing about?"}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2596.98,"end":2634.96,"speaker":"Marvin","text":"It's more melodious in English than in German. I would say that's something that I notice in general is that German is very technical language. It's not ugly to me, but it's very technical. And English is more. I want to call it an emotional language or a fluid language more than German. But I think that the reason why you have so much inherent melody in the way that you talk is because you're French Canadian, maybe. Yeah, I think it comes from that."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2635.44,"end":2655.92,"speaker":"Jonathan Pageau","text":"So, yeah, French Canadians are definitely like. Our French is very sing songy. It's, you know, like there's some. It's like old, like this old pre revolutionary French. And so it has a lot of. We have a way more. Yeah, we have way more tonality than the Parisians do. We have more sounds even than the Parisians have in their. In their. In their French."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2656.32,"end":2661.44,"speaker":"Marvin","text":"So I might look at one of your. You started doing French content as well, right?"}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2661.98,"end":2667.18,"speaker":"Jonathan Pageau","text":"Yes, yes. Yeah. Like every two weeks with JP Marceau, we're doing some French podcasts."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2667.18,"end":2688.54,"speaker":"Marvin","text":"Yeah, nice. Yeah, I won't be. Most likely, won't be able to segment that myself, but if you. At one point, or maybe Lisa, I don't know how well she speaks French or whoever is cutting out of that, like a three minute piece that has coherence to it. I would try to make a song out of that just to."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2688.54,"end":2721.19,"speaker":"Jonathan Pageau","text":"Yeah, that'd be interesting. Yeah, that'd be interesting. The more you say it, the more that I realize how right you are in terms terms of tonality. Because the French, like we have up and down in our sound. So like the French will go up and stop and then we'll go up and down in our tone. So it's like a French from France for a house will say maison and then we'll say maison. Like I'm exaggerating, but it's like it goes. I'm exaggerating a lot for French Canadians might hear this, but it will go like up and down and like that. So it's more. It has more. Yeah, I never thought about that. Interesting."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2721.75,"end":2757.49,"speaker":"Marvin","text":"Yeah. Because you say for most of us there'll always be foreign elements, monsters hiding in our garments of skin. That kind of ties into the idea of theosis. Right. Because we're being transformed by the Holy Spirit in our lives and trying to become more holy and grow closer to God. Is there like, do people finish that in their lives or is it always something that Christ finishes when you enter or before you enter paradise?"}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2757.65,"end":2819.3,"speaker":"Jonathan Pageau","text":"I mean, some saints definitely reach theosis in their earthly lives. There are different Examples of that. So it's possible. But I would say not for, I would say for most people it's not that it's kind of something that continues after your body, like after the resurrection, let's say something like that. And it's also described in Saint. Like Saint Gregor of Nyssa. Theosis is not described as something that you kind of arrive to in a static way. You know, it's rather this kind of ongoing, this kind of glory to glory notion where there's an indefinite. There's like an infinite glory that you are attaining. And so it's nonstop. It's as if the pattern is going up, it's constantly moving up. So it's not just like this image of the angel sitting on the cloud where it's like you've reached and you're there and you're just kind of there. It's more of this continuous synergy of ascent that is constantly going on."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2819.78,"end":2831.28,"speaker":"Marvin","text":"That's very interesting. So you say it's continuing even after the resurrection and after. Well after the apocalypse and after we're technically saints in heaven."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2831.52,"end":2845.8,"speaker":"Jonathan Pageau","text":"Well, that's what. At least that's my take on it. Like, I'm sure you'll find people who disagree with me, but at least that's my take on what I get from St. Gregory. At least that it's just this kind of. This infinite ascent into the life of."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2845.8,"end":2863.63,"speaker":"Marvin","text":"God, which also seems more logical, let's say, because it's not like God is finite. So if we learn to be in God and learn more about God, even after all of this stuff is done, it would make sense that it goes on forever."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2864.11,"end":2872.19,"speaker":"Jonathan Pageau","text":"Yeah, yeah, that's. At least that's the way that I see it in terms of. It's in terms of St. Gregory especially because he's my guide for most of this."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2872.35,"end":2874.59,"speaker":"Marvin","text":"Is he your patron saint too?"}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2874.67,"end":2913.2,"speaker":"Jonathan Pageau","text":"No, my patron saint is Maximus. Saint Maximus the Confessor. That's nice. That's actually my, that's actually my, my name, like that's my orthodox name is Maximus. And so. But I don't use it. I stopped using it very soon after my baptism just because, like even my bishop kind of just stopped using it. And then I just kind of happened. But recently my bishop, when he gave me communion, he came to with the spoon and he said, he said, don't you have another name? And I looked at him and I was like, yeah, it's Maximus. So he said, so Maximus received the blood and body of. So I was like, that's awesome. So I need to reappropriate that maybe and start using it again. I'll change my name on the channel. It'll be like Maximus Pedro or something."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2914.88,"end":2920.04,"speaker":"Marvin","text":"I'll incorporate that when we make new music. That's kind of cool."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2920.04,"end":2939.6,"speaker":"Jonathan Pageau","text":"But it's definitely like, I would say my patron is Saint Maximus, but Saint Gregory, Saint Ephrem and Saint Christopher are obviously the saints that I'm the closest to and that I feel the most drawn to and most taught by. You could say in different ways, Saint Ephrem the Syrian. Yeah, definitely."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2940.24,"end":2941.76,"speaker":"Marvin","text":"He wrote hymns on Paradise."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2941.76,"end":2985.3,"speaker":"Jonathan Pageau","text":"That's right. Yeah. But just in general, his theology and The Syrian fathers, St. Isaac the Syrian as well, their theology is very powerful because it's more non dual in the way that I present it. Like St. Isaac the Syrian is the one who said things like that the fire in hell is the love of God and those types of statements. So St. Ephrem talks about the womb of God, like the idea that the sacred womb out of which God kind of comes out of. And so they are more non dual in the way they describe things. And so it's closer to. I feel like they get the pattern more, not more, but they just get it. They just present it more succinctly, let's say."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2986.26,"end":2992.87,"speaker":"Marvin","text":"I understand what you mean. When you focus too much on the duality, let's say, then you become a gnostic in the end."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2993.83,"end":2994.07,"speaker":"Jonathan Pageau","text":"So."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":2994.07,"end":3018.98,"speaker":"Marvin","text":"Yeah, no, no, I think that's very helpful to bring it together again because it also. It is together. It's not like the way I understand it. It's not like there's a real. It sounds dumb, but I don't think that there's a real duality. I think that's more how we perceive it than, you know, God is not different. It's not cut up."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":3019.3,"end":3070.53,"speaker":"Jonathan Pageau","text":"Yeah, I mean, the best way to understand it is that duality is contained in unity, but it doesn't have an autonomous existence. And so it's. That duality is fine as long as it's always moving towards unity and contained in unity. And so that would be the sin. The fall would be something like completely inhabiting duality, you know, and that's what. That's why it's the knowledge of good and evil. But it brings you into a world of duality in which you see that as the highest, as the highest thing, you know, Because God creates with duality. It starts right away at the beginning. God created heaven and earth. There's that first duality right there in the beginning of Scripture. And so duality Is definitely. It's mostly the whether or not you move into unity or whether or not you see duality as the final step. Like the final step in the world. Yeah, I see."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":3070.53,"end":3085.49,"speaker":"Marvin","text":"Thank you for clearing that up. I'll play the next song. I might have three favorite songs from the album, but this is definitely one of them. Cynocephalous, Waiting for Crumbs. It's the most punky, let's say rocky song."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":3085.81,"end":3117.42,"speaker":"Jonathan Pageau","text":"Maybe on the edge of the Church, maybe on the edge of the world. This one is not a Canaanite, but a Canaanite. That might seem like a really bad pun, but I assure you that it will cause modern interpreters to cry foul in reading these ancient accounts and will say that all of this question is just a matter of bad transcription."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":3119.5,"end":3134.31,"speaker":"Jonathan Pageau","text":"I don't think so. I don't think so."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":3148.32,"end":3165.84,"speaker":"Jonathan Pageau","text":"All these foreigners in the icon of Pentecost culminating to the Impossible Monster are the surprise cover on the edge of the church, anticipating, maybe waiting for the crumbs, maybe waiting for the antidoron, which we can imagine flowing out of the."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":3165.84,"end":3166.24,"speaker":"Jonathan Pageau","text":"Church."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":3168.08,"end":3176.33,"speaker":"Jonathan Pageau","text":"So that even those we can barely recognize as our brothers can have. Have a foretaste of the kingdom of Heaven. The kingdom of Heaven."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":3178.25,"end":3203.82,"speaker":"Jonathan Pageau","text":"Yeah. Yeah. That was the. That was when it was also in the talk, when it was like. I felt like I was moving into tricky territory where I was going to start to say things which. Which would make people feel uneasy one way or the other. But in the end, I don't think it did that, but I could. I knew that I was starting to talk, that it was getting into weird in a weird place, let's say. So the punk music makes sense. The kind of. This kind of punk vibe makes sense in that moment, for sure."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":3204.22,"end":3206.06,"speaker":"Marvin","text":"Yeah, I can imagine that."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":3208.3,"end":3208.74,"speaker":"Jonathan Pageau","text":"When I."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":3208.74,"end":3267.22,"speaker":"Marvin","text":"Go through this bit of the talk or when I went through this bit of the talk when I was checking if there was anything I wanted to change. And I also. When I adjust the rhythm of your speech, I speak it myself to the music and then see where I should put the words. So it's like I'm rapping with you. And that's like. When I then later on thought about this bit and went a little further and started exploring, let's say, these sentences or these notions. It's very easy to get into a form of anger or something like that, because some people are so unwilling to have that be part of the tradition. Like the modern historians, for example, as you said, say. Yeah, no, no, that's just a misunderstanding of ancient texts. No, it's not."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":3268.26,"end":3310.05,"speaker":"Jonathan Pageau","text":"Yeah, because it's like the analogies play themselves out so perfectly that to say that this is just a misunderstanding is completely insane. Like, it's completely insane. And it also. That's one of the, like, one of the main strategies that I've been trying to give to people to help counter the scholarly way of interpreting has to do with attention and memory. And it's a very sound argument, which is that mistakes happen all the time. And it's almost like it's weird because it's almost close to, like an evolutionary argument. Right. It's like there's a mutation, and then that mutation, it continues. And because the mutation continues, you can't discount it. You can't say, well, that's not what it originally was like."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":3310.05,"end":3310.21,"speaker":"Jonathan Pageau","text":"No."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":3310.21,"end":3386.46,"speaker":"Jonathan Pageau","text":"What are you talking about? So even if you say it's a mistake, it's not a mistake because it was remembered and it was transmitted and it grew and the analogies accumulated around it. And so it was actually inciting. It had the insight into something which was true. Even if it is just a mistake in transcription, it ended up being a better insight into what was going on in that story. And you can understand that all the time. These types of. These types of. Let's say. One of the things I talk about is that as stories last longer in time, they tend to snap to the pattern. Like even memory. The older the memories you have, the more they tend to kind of snap to the pattern, because it's a golden thread that you can follow that kind of joins you together, join things together. And so when that happens, that's always when the scholars want to tell us that, no, this isn't what the Christians originally thought or whatever that is. And yeah, so it's. It's just. To me, it's. That type of argumentation has become completely irrelevant and useless. And hopefully people can use that argument sometimes, too. Like, people can take that type of thinking to. To resist the temptation that we have to give into this kind of iconoclastic modern scholarship."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":3386.7,"end":3392.18,"speaker":"Marvin","text":"Yeah, that's this idea of there is no literal interpretation of the biblical stories."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":3392.18,"end":3392.54,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":3394.1,"end":3409.46,"speaker":"Marvin","text":"Because it doesn't matter if St. Christopher was a man with a dog face or if he was a giant, or if he was just someone who looked normal but had this monstrous way of acting. It doesn't."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":3410.02,"end":3504.74,"speaker":"Jonathan Pageau","text":"First of all, we don't have access to that. And ultimately it doesn't matter because those just aren't the categories. The category that was used was the appropriate category. It's the best category for explaining what he is so that we can understand, understand it later in time. And so that was the category used. And it's the same with the cynocephaly in general, which is that it was the best category to describe the experience of something so strange, you know, that it looks animalistic to us. And so that's a universal experience. Any, any tribe, any group can have that experience of something that is so other from themselves that it looks, it's, it's, it connects to animality, let's say. And so in that sense it's still the best category. And just like I argue even in my text about the idea of hippopotamus, it's probably one of the best way of describing. It's like a hippopotamus means a water horse. And so does it mean that there's a genetic relationship between a horse, the way we understand it, and hippopotamus? That's stupid. That's a stupid way of thinking. And so why do we want to now impose the same thing back on the idea of a cynocephalous and think they were idiots for thinking that they were dog human hybrids? And so it's like, but who knows, maybe there were, I don't know because there seems like there's some on the horizon for us now. Like it seems like we're going to have human dog hybrids at some point. So that you shouldn't completely discount it either. But you also shouldn't get hung up on that because that's not the point of the story. So."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":3505.05,"end":3520.49,"speaker":"Marvin","text":"Yeah, I totally agree. I mean it's interesting when one can think and talk about, yeah, maybe there even were real dog headed men and all that. Yeah, but it's not important really. It's interesting, but not important."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":3522.49,"end":3584.99,"speaker":"Jonathan Pageau","text":"I mean it's not useful to you to kind of go down that route almost. It's the same Even with the whole. Everything that's related to UFOs and to aliens and all this stuff, it's the same problem, which is that people, they, they miss the forest for the trees. They don't, they don't understand what it means as a, as a manifestation in a story and kind of this social moment and are hung up on, you know, like how did they get here and what are their spaceships and you know, are they interdimensional beings or are they interplanetary beings or are they just projections of our psyche or are they this under that and like. Yeah, okay, whatever, that's fine. I mean, whatever. But, but let's try to first of all Understand how this fits into a bigger story and what it actually means, that whatever those beings are that are poking their noses into the world, they're aliens. They're aliens in the strict sense. They're the ultimate strange that is coming into reality. And so it actually tells us a little bit about where we are in the story. When that starts to happen."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":3586.51,"end":3616.56,"speaker":"Marvin","text":"There again is this unwillingness to recognize the Christian story. It's like this whole postmodern notion of there is no overarching narrative, there's no right or wrong, there's no strange or familiar really. And aliens are just the same as human beings, the animals that we know anything. It seems to me that, and I've been talking about that with people from my parish a few days ago, is that."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":3618.69,"end":3704.55,"speaker":"Jonathan Pageau","text":"We. But it's hard to talk about this stuff. It's definitely difficult. It's not difficult also, because there's right now a social stigma of even addressing this question. Right? It's like to even acknowledge the experience of the strange is dangerous. It's like dangerous because people attribute it to racism or to some kind of social pressure. But it's a universal experience, right? It's not one which you can limit to one people. It's just a universal experience of strange. And if you deny it, you're denying a very important aspect of what it means to even recognize any identity of anything. I think to me it's better to talk about how we can integrate the strange properly and how we integrate the strange improperly. That's much better, a much better way to talk about this than just try to deny the category itself. Because you're denying what it means to be human for universally denying it. And it's not useful because it ends up coming back secretly. It ends up coming back strangely, unconsciously, and pops up in hypocritical ways that people don't even notice. They end up doing it, but without noticing they're doing it. And then it just becomes very, very odd."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":3705.11,"end":3712.07,"speaker":"Marvin","text":"That's funny because yesterday I saw a sticker that said Space Invaders against Species or something like that."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":3712.31,"end":3759.91,"speaker":"Jonathan Pageau","text":"My goodness, that's amazing. You know that people are there. You know that people are there. But it's nuts that even the trope that somehow, let's say being suspicious of aliens, like of actual, like, let's say science fiction level aliens, right? Like Mars Attack, like being suspicious. Mars Attack is a great example of like, of a play out joke on that where it's like they want to be so accepting to the aliens that the aliens just walk all over Them and they basically destroy the world. And they're like, oh, no, we don't want to. We don't want to. We don't want to intrude. Or maybe we misunderstood them. Like, maybe it's like, no, man, that's nuts. I'm not surprised, but I find it hilarious that we're there."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":3761.43,"end":3789.98,"speaker":"Marvin","text":"I did remember the thing that I wanted to say earlier is that what I was talking about with the people in my parish is that this is, and I mentioned it earlier, this unwillingness to notice the Christian pattern. And so what science did is it took everything that Christianity says and all the explanations that Christianity gives, and they just put it aside and then say, okay, it can't be that, so it has to be something else. And then they come up with all these weird theories and ideas."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":3790.86,"end":3791.34,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":3791.5,"end":3796.46,"speaker":"Marvin","text":"Is that. I mean, am I being unfair to them? Is that really unwillingness or is that."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":3799.42,"end":3922.29,"speaker":"Jonathan Pageau","text":"It's mostly a question of levels, is what it is. It's a confusion of levels of reality. It's one of the biggest problems between a traditional worldview and a scientific worldview, which is that the scientific worldview moved towards analysis of phenomena rather than the meaning of phenomena. And seeing the world through meaning as the first lens, let's say, and wanted to analyze phenomena. Then what they did is they mistook stories that were talking about meaning for stories that were talking about analysis. And then they decided this has no value because it's not properly talking about, let's say, analysis of phenomena in a way, like to analyze it and quantify it in a way that you can reproduce it. Right. That's what science is. And so when they see descriptions that aren't like that, they want to discount them. And the worst part of that is that they're across. They were in the 19th century, especially across from Christians who wanted that too, who wanted to take the traditional stories and make them into these. These silly, analytical, quantifiable descriptions. And so it's like. So they lost, right? Because that's not what they are. And so they lost that fight. And so now we're still dealing with the consequence of that. But, I mean, it's kind of petering out. And you can see, like, people like John Vervaeke and Jordan Peterson and these kind of people, these people that are looking at consciousness and the science of consciousness, it's petering out because they. Now that they've reached kind of the end of the rope of what materialism can offer, they have to reconsider the problem of meaning and the problem of Description without meaning is actually impossible. And that scientists all along were functioning with implicit categories of meaning that were given to them. But as you kind of push that and you keep pushing and you push the meaning stories to the side, then things start to fragment and to crumble and you realize, okay, wait, wait a minute, I'm in trouble, like if I don't recapture these dismeaning manner of describing the world."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":3922.77,"end":3942.33,"speaker":"Marvin","text":"So it's not really the case that science is, let's say, in the wrong place. It's more that it doesn't acknowledge that it also, let's say, has to work with meaning. And if we were to incorporate that again, then science also wouldn't, let's say, cause the problems that it does now."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":3942.33,"end":4035.71,"speaker":"Jonathan Pageau","text":"Exactly. Science wouldn't necessarily be problematic if they. But it's almost like this is the trade. It's like a secret, like a secret of reality, which is often to increase power, you actually have to sacrifice meaning to increase power. And so for Cain to become stronger in physicality, he had to move further away from the garden. And this is kind of the, this is the reality of it, you know, you have to give up meaning to increase power. And you can see it like you could see it in all kinds of ways. Like you could see that you would get an army. And the bigger the army is, the more difficult it will be for you to maintain the centralized meaning of what you're doing. And then your army, the bigger it gets, the more powerful it is, but the more dangerous it is that it's going to start to break apart and fragment as it gets bigger. Like example, Alexander. That's what happened to Alexander's legacy, is that it got so big that once the meaning, let's say the person holding it together died, then it just broke apart because it was too powerful and too big. So that's a trade off, that's real. But it's a mystery in the way the world cycles. And the idea is that as you move away and you move towards the end, then something happens and it kind of gets restored or returned towards the glory. And the New Jerusalem is the last example of that, where all of this movement to the end of the world gets changed into these glorious walls of jewels and of gold to kind of manifest how they're participating in the glory."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":4035.87,"end":4036.83,"speaker":"Marvin","text":"That's fascinating."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":4036.91,"end":4060.45,"speaker":"Jonathan Pageau","text":"So, Marvin, thank you so much for doing this and for all the work you do. I'm constantly amazed at what you come up with. And not only that, but I feel very humbled that you're out there Spending the time to make what I'm saying beautiful and to kind of make it in a way that people can enjoy and can celebrate and participate in. And so I feel very humbled and very fortunate that you're doing that. So thank you for all the work you do."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":4060.45,"end":4086.55,"speaker":"Marvin","text":"Yeah, my pleasure. Really, thank you for allowing me to do that and giving me the material because it's helped me so, so, so much to move towards this. I would have never thought that it would be possible for me at all. And it made my life better in so many ways. Thank you so much. Glory to God. Yeah. Thank you."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":4086.55,"end":4102.79,"speaker":"Jonathan Pageau","text":"So everybody go look into the description. We'll have all the links to his different channels to YouTube channel, but also to the different places where you can get his music. We can stream it, where you can buy it. And so I wish you the best in the future and we're looking forward to seeing what are the next things you come up with."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":4102.87,"end":4106.79,"speaker":"Marvin","text":"Yeah, thank you. Also, all the best to you and I'm looking forward to talking to you again."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":4107.13,"end":4110.89,"speaker":"Jonathan Pageau","text":"Thanks. I hope you enjoyed this episode of the Symbolic World."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":4111.13,"end":4136.46,"speaker":"Jonathan Pageau","text":"The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that it's quite interesting. I'd like to drop in there and."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":4136.46,"end":4138.34,"speaker":"Jonathan Pageau","text":"Also leave some of my comments as well."}
{"episode_id":"SW - #181 - 2021-10-23 - 2mørVs - Encountering the Unexpected","start":4138.5,"end":4170.34,"speaker":"Jonathan Pageau","text":"You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially. Going to www.thesymbolicworld.com support or else on Patreon the Pajo videos as well and on SubscribeStar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
