{"episode_id":"SW - #189 - 2021-10-28 - What Makes an Inverted Pentagram Satanic","start":0.48,"end":1149,"speaker":"Jonathan Pageau","text":"As you know, I published an article on the American Conservative, on the symbolism of Lil NAS X and WandaVision, and also just basically understanding the satanic trope and the witchcraft trope that we find in our culture. In the original video that I'd recorded that was deleted, I had also talked about the upside down pentagram. But in writing up the article, in doing the article form, I just couldn't find room for the upside down pentagram stuff. And so I thought that maybe I could use this. I will just give you a slight, a basic idea of why the upside down pentagram is used as a satanic symbol. And this might also be kind of a counterbalance to the other video I did where I tried to debunk the notion that geometric shapes have inherent meaning in the sense of inherent moral meaning. And this maybe will be a way for people to understand that, yes, I do believe that certain images are used in terms of satanic imagery or occult imagery, and that these are done coherently, that it's not arbitrary why certain images are used. So get ready. So we're going to talk about the upside down pentagram. This is Jonathan Peugeot. Welcome to the symbolic world. So in order to understand the upside down pentagram, we must at first understand the pentagram. A pentagram is, we call it a star. I mean, the fact that we think that this is a star is, let's say, is a very abstract vision of what you actually see in the heavens. The fact that we have these points, instead of a pentagon, for example, that also has five points, has to do with the idea of a, let's say, coming into very precise manifestation. So something that goes into a point, right? It's like all this potential, kind of like a mountain, you could say. So you can imagine kind of like a mountain. This point that goes into a condensation or a concentration of something. That is what these shapes that have points can help, can mean. And so when you have many of them, they mean many points. Obviously that sounds obvious, but. And so in terms of a, a pentagram, the idea is because of the way the pentagram appears when you see it, you know, the right side up version, it's a. Looks like a triangle, a mountain, let's say. And it then it has four points on the side going sideways and then down. And so you can understand it as the idea of a top point which is on top, or let's say above the 4.0, you can understand it as the top, let's say, wielding authority over the bottom. So the origin of the upside down pentagram obviously comes from magic. It comes from, let's say, this magical tradition that was installed in the west starting in the late Middle Ages and in the early Renaissance. And so both the right side up pentagram and the upside down pentagram will be seen based in kind of occult practices. So, you know, you have this image, of course, of the pentagram with the person standing in the middle and doing some kind of weird ritual. It doesn't mean that obviously both sides can be used for strange purposes, but it, the. The pentagon and the cross itself too. Like you, you know, in magical theory, they'll also use crosses and different images that are actually Christian. And so it doesn't mean that the geometric figure doesn't have a certain amount of meaning in it, especially if you understand it in terms of how it presents itself to you. And so you have to understand the pentagram as this point, this mountain with four points on the side going sideways and going down. That's why it is often represented as a man with the head above and then the arms going out to the sides and the legs coming down. So you could imagine it as the source of action and then the embodiment of action. You can understand it as a building like a pyramid itself that has four corners on the. On the side and then moves up into a point. And you can understand it in many ways in which the four, which is really an image of multiplicity itself, is united into the one. So it could be the four elements that are united into the spiritual element and ether, or, you know, this idea of spirit that unites the four elements together. There are different ways in which this very pattern, which is how four is united into one, can manifest itself. And there is, of course, a Christian version of this, which is there are many, because the five or the how four moves into one can be represented as the pentagram, but it can also be represented in another way, which is the way that we often represent it in on a die, for example. And so where you have the four corners and you have a point in the center which is uniting the four corners together. So if you imagine the four corners and the one in the middle like this, you know, you can think that you could flip it this way and then you would have the four corners with the. The middle corner above, and then you have a pyramid, you know, whether you imagine in the middle or above, it has the kind of the same. The same meaning. Let's say another example of this is in the notion of the chariot. And so the manner in which four moves into one is represented in Scripture in the story of the divine chariot, in the story of the Merkabah, where the prophet has a vision of these four beasts, these four cherubs that are on the corners. And they are. They have. They're on wheels, and you have this sense that they are moving. And then the rider descends upon the chariot, the Son of Man descends, and this becomes the vehicle for the glory of God to manifest itself. And so, I mean, think about the Ark of the Covenant, for example, which has the same pattern. You have the four corners of the ark, you have a box, and then on top of the box, then you have the glory of God, which descends and is the manner in which the box or the stability of manifestation unites itself into ahead. Okay, so that's basically the notion of the pentagram, or the four that moves into one. Like I said, it's not just limited to a pentagram. And you have Christian versions of that. The two Christian versions that you can see of that are related to each other. One is the. The image of Christ in glory with the four glories on the side. And so you have Christ and his head, and you have the halo in the middle of Christ, which is the. The head, the way in which the four unite. And then you have the four beasts on the corners. And those four beasts are also the four evangelists. So you can imagine a structure where you have the four gospels, the four evangelists, the four beasts, and then Christ, which unites this multiplicity together into one. And it really is an image about how reality works and how multiplicity. Four creates a stable, a stability, because you have two sets of opposites. You have this. This vehicle that is actually stable, whereas duality doesn't have that capacity. And neither does, does three, because three is dynamic. It has a dynamic quality, which is that the three are always related to each other in a more dynamic quality, which is why the Trinity is a. Is 3. But 4 has this kind of stable, incarnate manner. And so obviously, like I said, you can imagine your arms and your legs, these two feet below, and then these two arms acting in the world. Or you can imagine an animal with four legs, and then above, a house, all of this four and one. Another version of how the pentagram or the four moving into one appears is in the very structure of an Orthodox church, which has a dome in the center. And you have Christ up in the dome at the top of the pattern. And then you have, on the side, you have what's called pendentives. These pendentives are four corners that move into columns that hold up the dome. And the four corners are like, are really like four points there. These are four points in the corners and in the top. And so you can imagine it of course, straight like in a die where you see the four dots and the one in the middle. But because it's a dome, it's obviously flipped like I told you, like this before, the four corners and then the rider at the top or the summit of the pyramid or the summit of the, of this four at the top. Okay? And so that is really, let's say, this understanding of the pentagram. But it can also have dark implications. Just like any type of symbolism, it can also represent the idea of will as supreme over the world, let's say. And so the idea of man who rules over the four elements, there are different ways of understanding it. And that's why in magical rituals, a pentagram might be used in order to subject reality to your will, in order to create a space in which you are capable of influencing the, the way the world lays itself out through ritual and through magical pronunciations. Okay? So that's the basic idea of a pentagram. Now the reason why the pentagram, upside down pentagram, ended up being used in Satanism has to do with the idea of black magic, right? So you can imagine you have white magic with the, the pentagram going up and the four moving into 1 above. And then you have black magic, which was the opposite, which is upside down. That's why we say an upside down pentagram, which, I mean, it's, it's kind of funny because obviously the idea that this geometric shape has a right side up and a and a, you know, upside down is obviously might seem arbitrary at first, but it's not arbitrary once you can see that we intuitively find meaning in this type of symbolism. So you can imagine that the upside down pen pentagram is the opposite. It's something like the source of unity comes from multiplicity. It's something like giving in to multiplicity in order to find some kind of power that'll concentrate in you. And so you can imagine that's why it's something like invoking demons. It's, you know, giving up your soul to receive some kind of particular power that is going to land down down there. So you can understand why that would be satanic in the sense that that's what Satanism is, right? Satanism is an upside down reality. It's a giving in to your ends up being a giving in to your different passions, giving into the, and it is in a certain way, it's kind of atheistic and it believes that multiplicity can give unity. And so that's why it appears upside down. And that's also why it's the image of the goat. The goat that you see in kind of black magic symbolism has to do with the goat in scripture, the goat that is cast out, the goat that is given to Azazel. And so there is a sense in kind of upside down black magic that this residue, like the stuff that you throw away, has a kind of power. If you're able to tap into it, if you tap into the, into the residue, then there's something hidden in that power that you can use to give yourself authority. And so if I had said that to you 100 years ago or 200 years ago, you might have thought that I'm just making it up or that it's arbitrary. But you just have to look around you and notice that all of the social narrative right now, all of the power is going to those who are able to tap into the power of the residue, tap into the power of that which doesn't fit in, tap into the power of the exception, of the leftover of all this idea of the margin, this is how the current social narrative is being run, is in a black magic manner. By tapping into this exception and giving place and giving room to the exception. All of this can help you understand the kind of black magic symbolism. The idea of using residues of other people's bodies like hair or menstrual blood and all of these things that are, that are dead and that are, that are cast away from the body, that all of this imagery is related to black magic. Also the idea of having some kind of sexual intercourse with strangers, with prostitutes, with ugly people, like Alistair Crowley did all these kinds of horrible rituals where he would have relationships with, with, with kind of disgusting people. All of this is to tap into this, this, this power of the residue and the power of the margin and the power of the exception. All of this, all of this is a, is a tool, let's say, in order to gain power in yourself. But the inverted pentagram has way more implications than that. Because you could say that inverted pentagram is pretty much the basic pattern of a lot of what people believe. And so when someone says that there is such a thing as democracy, whereas the, the will of the, of all the, the multiplicity somehow really does coalesce into one. When people believe, for example, that you can derive value from facts, when scientists believe that you can arrive at value from facts, then they are in an inverted pentagram. You know, every time that people believe also that the world just emerges out of chaos without any form of spirit, without any form of unity at the top, and that everything comes from below, let's say in all of these, in all of its multiplicity. Right. The idea that out of different chemical elements could just happen to come together and to form consciousness, this is all an upside down vision of reality. And it is all, let's say, standing inside the upside down pentagram. So you can see why in my video where I talk about these kind of satanic tropes, I'm alluding to the fact that really modernism and modern culture is a form of. It's a form of satanic manifestation. And I say it like, almost like in a technical way. I, I want to be careful because everybody, all of us in the west have made the mistake of believing this and of participating this to a certain extent. And so it's every time that you don't want to submit to something above you. Right? That's the inverted pentagram. Right. It's just another manifestation of that. Okay. And so once again, we need to be careful. I mean, obviously the inverted pentagram, I would never use that image because it's so now tied to the satanic that, you know, and it makes sense, it's coherent. The symbolism of it is completely coherent. It's not arbitrary at all. But there could, there are versions of that that appear strangely and that are not necessarily tied to evil itself. So, for example, there is a church in Europe where there is, in the northern transept in the window, there is a, an inverted pentagram in the northern window. And so you can wonder like, what is it that they're trying to. Why would they have an inverted pentagram in the window? And, and you can, it doesn't take very long to kind of understand why they would put that there, especially if you understand the architecture of a church as being the totality of all things. Especially if you understand the reason why there are gargoyles or there are, there are griffins on the outside of churches. A lot of orthodox think they get out of it because they don't have gargoyles on the outside of their churches. Well, a lot of Greek churches had griffins on the outside of churches, which are just a form of gargoyle, really. And so the reason why you, why they would have put, let's say an upside down pentagram at the northern transept is because the northern transept is the dark transept. It is the left side. When you walk into a church and you're looking east, the northern transept is left. It's recognized as the place where the sun never is never there. And usually in the northern transept there are often strange imagery, especially in kind of French Gothic cathedrals. There are weird imageries from the Old Testament. For example, a lot of images of foreigner, the Queen of Sheba. I went, I think it was in Chartres or maybe not, or maybe it was in Notre Dame in Paris. They have images of the story of the golden hemods, you know, on the beasts, where the ark goes out into the foreigner, into the foreign land to the wilderness, like I said, the Queen of Sheba. And the. The images of these strangers that are in the Old Testament. And so it's the place of the unknown, the place of darkness, the place of, you know, this residue, like in the story of the golden hemorrhoids, for example. And ultimately all of this plays a part in the story, like all of this is part of reality sometimes. Sometimes even. Even despite the people who are embodying this symbolism. One of the things I hinted at in my article on the American Conservative is how these Satanists, you know, they, they think they're being really clever and they think they're being really smart, but ultimately they're actually, without even knowing what they're doing, they're going to participate in the return of Christianity. Just like by killing Christ, the Satan didn't understand that he was participating in the salvation of the world. This symbolism, this kind of dark, upside down symbolism will ultimately and inevitably call back to. To the other side will inevitably be like this strange dark mirror that at some point will inevitably call back the normal order of things and a return of the Logos. And so maybe that can give you a little bit of hope in these dark times. And so make sure you understand what I said. I'm not saying that you should be sporting upside down pentagrams and you should be sporting all that. Like I said, it is, especially the way it's used today, a very dark and coherent imagery, but rather just understand that Christ is stronger than all of this, that God is above and beyond these considerations and that, you know, the story is going to play out how it's going to play out and truth will always win in the end. And so I hope this was useful in kind of understanding a little bit the symbolism of the upside down pentagram. And thank you everybody for your support and I will talk to you very soon. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Padreau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description and so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to to get the podcast out there to get it heard. And if you want to get involved you can also support the podcast financially going to www.thesymbolicworld.com support or else on Patreon the Pageau videos as well and on SubscribeStar all those links you can find on my website or in the show description. So thank you and I will see you soon."}
