{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":0.16,"end":10.32,"speaker":"Richard Rohlin","text":"All right. So I thought that it would be fun to just start out with, like, a spicy hot take, because I've realized lately I'm just not a controversial enough person."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":10.88,"end":13.44,"speaker":"Jonathan Pageau","text":"You need to be more controversial to get more controversial."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":13.6,"end":20.48,"speaker":"Richard Rohlin","text":"Yeah. To get all the attention. Yeah. Yeah. So what I want to start out by saying is that Girard is wrong."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":22.56,"end":24.6,"speaker":"Jonathan Pageau","text":"It's a great way to start to start the podcast."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":24.6,"end":26.08,"speaker":"Richard Rohlin","text":"So that's it. That's the whole thing."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":41.98,"end":98.18,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. So, hello, everybody. We are back here with Richard Rowland for one more episode of. Of our universal history series. And we are getting very close to Holy Week as the Orthodox. And so Richard had a great idea of looking at the different services during Holy Week leading up to the entombment of Christ and how it also relates to the ritual that we talked about in terms of the marriage between the king and the city and how this all comes together in the symbolism of Holy Week. So I don't even know what he's going to say, so I'm as curious as anybody to find out. So, Richard, thanks for coming along again."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":98.26,"end":103.06,"speaker":"Richard Rohlin","text":"I'm glad to be here, and I plan to say a lot of weird things that will get you comments on YouTube."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":103.14,"end":103.78,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":103.94,"end":116.42,"speaker":"Richard Rohlin","text":"That's my plan. That's great. Yeah. All right. So I thought that it would be fun to just start out with, like, a spicy hot take, because I realized. I've realized lately I'm just not a controversial enough person."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":116.9,"end":118.26,"speaker":"Jonathan Pageau","text":"You need to be more controversial than."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":118.26,"end":126.49,"speaker":"Richard Rohlin","text":"You need to be more controversial. Yeah. To get all the attention. Yeah. Yeah. So what I want to. What I start out by saying is that Girard is wrong."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":128.65,"end":130.69,"speaker":"Jonathan Pageau","text":"It's a great way to start to start the podcast."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":130.69,"end":132.09,"speaker":"Richard Rohlin","text":"So that's it. That's the whole thing."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":132.25,"end":199.44,"speaker":"Jonathan Pageau","text":"All right. So for people who don't know what he's referring to. So Richard is referring to Rene Girard, who is an anthropologist who explored the theme of sacrifice and how sacrifice is all based ultimately on human sacrifice, and that human sacrifice is the basis of unity in terms of civilization. That. That at least was at the outset, the need to find a scapegoat, to put all your. To put all the evils of a group into the scapegoat, to kill the scapegoat. And in a kind of moment of ecstasy and violence, to refine, to find the unity that. That had been kind of falling apart as all our different idiosyncrasies started to manifest. And it's all related to the notion of mimetic. Desire, which is the problem of everybody desiring the same things, but there also being a lack of resources or a lack of possibility for everyone to have the things they desire. And so by creating the scapegoat mechanism was a way to restart the process and to avoid it going out of control and moving into, like, carnage and massive breakdown of society. So why is he wrong, Richard?"}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":199.92,"end":238.26,"speaker":"Richard Rohlin","text":"So the reason he's wrong is very simply murder is not the basis of culture. Marriage is. All right, so, and I, you know, again, that's a little bit of a spicy hot take. But for me, Girard is very much like somebody like Joseph Campbell, who famously wrote the Hero's Journey, which is like a certain way of understanding mythology. But of course, for Campbell, it's the only way to understand mythology. And a lot of times what I find is when somebody really gets plugged into Girard or really plugged into Campbell for the very first time, then it's like they suddenly, they have a hammer and everything looks like a nail, and they try to explain all the stories that they encounter by means of that thing. Right. So I don't know. That's."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":238.26,"end":261.5,"speaker":"Jonathan Pageau","text":"I have to say, I'm curious to see what you're going to say, because to me, the theory that Gerard brings about works very well with the idea that Cain is the founder of civilization and so that his, like, his founding of the city is based on murder. And you see that also in the Roman founding as well and in other cultures. But I would like. I would think that it would be something like murder moving towards marriage or something like that."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":261.5,"end":267.92,"speaker":"Richard Rohlin","text":"Oh, no, I would agree. I would be okay with. Agree with that. Yeah. So actually, I was going to start out by talking about the founding of Rome."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":268.08,"end":268.56,"speaker":"Jonathan Pageau","text":"All right."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":268.56,"end":352.38,"speaker":"Richard Rohlin","text":"Which. Which would be a great way to help us understand Holy Week, you know. Yeah. So let's get into it. So the way to. To understand Holy Week, you have to basically. And. And I'll preface this by saying this isn't just my arbitrary saying. Oh, well, Holy Week has something to do with marriage, the founding of a city, because that's literally just the services. That's the text of the. The liturgy. That's what the church puts before us. So in the Orthodox Church in the east, we begin the first four days of Holy Week. In the evenings. We celebrate a matins service, which, of course, matins is a morning service. But typically speaking, in the Orthodox Church, we have this, let's say, like a sense of urgency that kind of kicks in once a big feast starts approaching and everything gets bumped up a little. So in parish practice, in the evenings we celebrate something called, something called the bridegroom matins, which is all about the tomb of Christ as his bridal chamber. Right. So this is not just like an arbitrary association that I'm making. So to kind of understand what's going on here, you have to know a little bit about how cities in the ancient world were founded. And that is that cities were founded by mythical founders. And I don't actually care if you do or do not believe that these mythical founders were actually people who existed. For the purposes of the things I'm saying today, that's not hugely important. What's important is that people in the ancient world believed this and they embodied it in a ritual way."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":352.46,"end":374.1,"speaker":"Jonathan Pageau","text":"And it is a universal pattern that is, this is really a universal pattern that you see in most cultures. They always trace back the lineage of the king all the way back, all the way back. And at some point, the first person in the lineage is a demigod or is some kind of mythological creature. And this is something you see as in tribal cultures as much as you see in Mesopotamia or in Rome or whatever culture."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":374.1,"end":481.14,"speaker":"Richard Rohlin","text":"You're thinking, yeah, you have a mythical founder, this is a guy who founded your city, this guy has some connection to the gods. And basically you could say the goal of every king after him is to embody that founder. Right? To make that founder present to the city again. So there's a historian who wrote a ton of stuff about this and he said he was looking at Greece and Italy in this sort of the city state period. I know that typically speaking, we think of like Greece and we think of democracy, we think of Italy, we think of the Roman Republic or the Roman Empire. But this is period before all of that when there weren't empires, there were just these city states, and each city state was ruled over by a king. And he says that a well known fact in the history of Greece proves in a striking manner that in the beginning the kingly office belonged to the man who set up the hearth or the altar of the city. So this is really important. The basis for kingship in the ancient world is priesthood. And if you kind of, for a lot of people, especially if you're from an evangelical background, maybe you don't know a ton about kingship in the ancient world. And so most of your experience of what kingship in the ancient world means comes from reading the Old Testament, which is the series of ancient texts which the most people have read. Right. The thing about that though is that the kingship of ancient Israel and Judah was atypical in a lot of ways, or at least the kingship of Judah was atypical in a lot of ways. The kingship of Israel after the kingdoms were divided was actually super typical in a bunch of ways. But the original basis of kingship was that the king was the priest. He was the high priest of the people. He was the one who was supposed to mediate between the people and the gods."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":483.54,"end":504.58,"speaker":"Jonathan Pageau","text":"We actually see one version of this in Scripture, which is Melchizedek. And Melchizedek is both a priest and a king. And you see that, of course, those powers get separated, and for good reason in history. But there is a sense in which those that kind of stand above the highest versions of these have the two positions united in one figure, and that's."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":504.58,"end":583.96,"speaker":"Richard Rohlin","text":"Why Christ is the priest. After the order of Melchizedek, right. He rejoins these things. Actually, we're going to talk about a whole lot about things that sort of get split or divided, right? And then the thing to know is Christ unites these things in himself, Right. Even these different mythographical patterns or patterns that we're talking about. Even things like the hero's journey and Girard's scapegoat theory and these things like this. Those theories are incomplete in and of themselves because they don't explain everything and they don't fit, you could say, all the information that we have. But then you can also see how if you go to the story of Christ, you should find those in the story of Christ, every pattern that's a real pattern is in the story of Christ. So the king is the guy who sets up the hearth. He's the one who sets up the fire. And here's a nice little bit of etymology, which I think you'll enjoy, Jonathan. He's the one who sets up the focus for the city. Where the Latin word focus comes from a really ancient Indo European root that has to do with a lot of our words for light, like photon or photo or, you know, come from that same ancient Indo European root. But the word focus in Latin means the hearth, means like the family hearth or the temple hearth. In other words, the focus is an altar."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":583.96,"end":603.65,"speaker":"Jonathan Pageau","text":"Yeah. And you can understand that, at least in that circumstance, it makes sense because the hearth was actually a fire. So you can imagine, like, in your house or in the space that is where most of the light would come from, would be from the center. So light would actually move out from the center into the periphery of the. Of the space. And so You. It's really like a cosmic image to kind of. To understand it that way."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":603.65,"end":730.12,"speaker":"Richard Rohlin","text":"Right. And hearth. Hearths are also always alters in the ancient world. This is the other thing people have to remember, like your family hearth, like the fireplace in your family, that from which warmth comes, and therefore life. Right. In the cold European winter, that's also where your food is cooked, all these different things. That hearth is also an altar and you have your family gods there. So if you read the Aeneid, which we talked about before, I think, in our very first universal history video together, if you read the Aeneid, what's the whole thing that Aeneas is trying to do? He's trying to take the household gods from Troy, his household gods from Troy. He's trying to bring them to this new place that the gods have established for him, which is going to be Italy. And of course, Aeneas founds the city of Alba Longa. And it's from Alba Longa that eventually the founders of Rome will come, which we'll talk about here in just a second. So the ritual crowning of a new king is basically, you could say it's supposed to be a repeat of this first founding. It's supposed to be a ritual marriage between the king and his city. And this ritual marriage is handled differently in different cultures. If you want some good examples of this, you can just go study the life of Alexander the Great, who we've also talked about. He's one of these really liminal figures. A lot of connective tissue in the symbolic world or the universal history goes back to Alexander. And one of the things that Alexander would do whenever he came to a new city is he would do whatever you needed to do in that city to become the new founder of the city, to become the son of the most high God of that particular city. So when he goes to Thebes, he does this ritual sacrifice to the APIs bull. In a lot of places in ancient Mesopotamia, where there's a lot of fertility cults, to become the king of the city, you actually ritually spend a night with the city. They take the marriage to the city to a really kind of a literal level. And of course, this is consummated usually with a temple prostitute."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":731.88,"end":734.44,"speaker":"Jonathan Pageau","text":"In Alexander's story. Do they talk about that?"}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":735.88,"end":793.14,"speaker":"Richard Rohlin","text":"I don't think that comes up in Alexander's story specifically, but a lot of Canaanite cities. And if you look at rituals for crowning, like kings of Babylon and things like that, that is very much there. So, yeah, yeah. So what I'm Just trying to say is like, there are a lot of different examples in Alexander's story of how do you go somewhere and become. To become the king of a city. You also become the son of the gods. And you also become kind of. You ritually re. Embody the founder of the city. And this is something, by the way, Caesar Augustus, who probably we should do just a video on him at some point if we're gonna do. Yeah. Cause he's so important to universal history. Right. But this is something he's really conscious of. And so this is part of why he commissions the idiot. Right. This is part of why he's. But also some other ways that we'll talk about in a moment. He really tries to consciously create this effect of being married to the city of Rome."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":793.22,"end":814.04,"speaker":"Jonathan Pageau","text":"Yeah, we also. People don't realize that the emperor was pontifex. Like the emperor was also high priest in Rome. And you have images of Augustus, you know, wearing more military guard, but you have images of Augustus where he's actually wearing a priestly garment, like his cloth over his head. And we don't, we don't, we don't recognize. But he's actually dressed as a priest."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":814.04,"end":946.5,"speaker":"Richard Rohlin","text":"Yeah. So in, in a city like Rome, which is significantly less ancient than Babylon, for one thing, it's probably founded, you know, right around the time of maybe the prophet Isaiah, something like that. So, you know, pretty, pretty recent as cities go. But it'. Ritual prostitution was never so much a thing in Rome itself. There are places in, like, classical, the Greco Roman world that did practice ritual prostitution, but it wasn't so much a thing in the city of Rome itself, however, you could say that's like a feature of like the ancient fertility cult. And Rome is like a little more man. I don't want to say modern, but it's like, it's. Because that's not even like, correct in any way, but it's like, it's a little more recent, it's a little more up to date. Right. So what Rome does have, they don't have ritual prostitutes, but what they do have is the Vestal virgins. Right. So the Vestal virgins are dedicated to the service of Vesta. Vesta is one of the hearth gods. In fact, her temple or her altar was sometimes called the Trojan hearth. Right. So she's one of the hearth gods that sort of the hearth God that Aeneas was trying to rescue from the ruins of Troy and re. Establish his civilization. So think back to this idea in the ancient world that the founder of the city is the one, the king, is the one who establishes the city's hearth. Right. And of course, you could say if the. If the hearth, like the literal fireplace in your home, if that's your hearth and that's your altar, the city's hearth is the altar where everybody comes to worship. So the vestal virgins are basically. They're the priestesses. They're usually. At one point there were two, and then I think later there were like six. But they're the ones who are given the specific task of tending the fires, the hearth fires at the temple of Vesta, which are never supposed to be allowed to go out. Right. And actually the cult of Esta is pretty much the last religion in pagan religion in Rome to be abolished. People held onto it, I think, a lot longer than they did basically any of the other gods after the conversion of Christianity."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":946.5,"end":949.17,"speaker":"Jonathan Pageau","text":"I think it sounds it was linked to the very existence of. Of the city."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":949.33,"end":1069.04,"speaker":"Richard Rohlin","text":"Right, yeah. Some people said, well, if the hearthfires ever go out, then Rome will fall. Right. So you have these vestal virgins. And the important thing to sort of know is that Rhea, she was a vestal virgin of Alba Longa. She's the mother of Romulus and Remus. So the story is that she was obviously, as a vestal virgin, the two important words there are vestal and virgin. And so if you're a vestal virgin and you suddenly become pregnant, they have all kinds of creative ways of killing you, actually, in genuinely creative ways, because in ancient Rome, even if a vestal virgin defiled herself, you were still not allowed to harm her in any way. So they had to come up with these special rules for how would you bury a vestal virgin alive? Because then you're not harming her. She's just Dobbs, he's going to die underground. Yeah. But side note, I once wrote for school, I once. This is why you should homeschool is because I once wrote a whole paper on methods of execution in the ancient world. So I just. This stuff is always jangling around in my head somewhere. But. So they had these two laws. One is they couldn't. Normally, they would execute somebody by strangling in ancient Rome. So they couldn't do that because she was a vessel virgin, but they couldn't bury her alive because there were laws against burying someone alive within the precincts of the city of Rome. And this is tied to a lot of other things that we probably don't have time to talk about today. But. But typically speaking, when you were building a new building, there's an extremely ancient practice of, like, you bury a slave for its foundations. And the Romans didn't like that. And so they said, well, we can't bury somebody alive. So what they did is they built an underground little house, and they put like two or three days worth of food and water in there, and then they put the vessel in there. And they just sealed it. Yeah, they sealed it. And so that. So they were burying her alive. And they didn't kill her. She just died of starvation, which is not a great way to go. It's great. Yeah."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":1069.04,"end":1069.44,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":1069.68,"end":1071.72,"speaker":"Richard Rohlin","text":"So Romans, everybody."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":1071.72,"end":1072.88,"speaker":"Jonathan Pageau","text":"All right, so Rhea."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":1073.12,"end":1118.07,"speaker":"Richard Rohlin","text":"Yeah. So Rhea. Rhea is the vessel virgin of Alba Longa. She's raped by Mars, and so she has to run away. She's raped by the God Mars, and she becomes pregnant. People find out she's pregnant, she has to run away or they'll kill her. They'll kill her. And then, of course, she goes out into the wilderness and has her children, Romulus and Remus. And so the founder. I just want to kind of point this out, and I don't want to point this out in. Well, there's no way for me to point this out with giving some people heebie jeebies. But the founder of Rome is both the son of a virgin, sort of, and also the son of a God. Yeah. Right. Although obviously he's not virginally born. And there is also to give the Girard folks their due here. There's also a murder of the son of a virgin and the son of a God that is a part of the founding myth of Rome. Right."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":1118.39,"end":1122.83,"speaker":"Jonathan Pageau","text":"For those who don't know, I'm sure everybody knows who's watching this, but Romulus kills Remus."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":1122.83,"end":1123.27,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":1123.27,"end":1124.71,"speaker":"Jonathan Pageau","text":"In order to found the city."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":1124.87,"end":1127.03,"speaker":"Richard Rohlin","text":"Yeah. If you don't like, what have you been."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":1127.03,"end":1129.63,"speaker":"Jonathan Pageau","text":"Why are you watching even our podcast if you don't know that?"}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":1129.63,"end":1250.43,"speaker":"Richard Rohlin","text":"Yeah. Like what rock or vessel, virgin and tomb have you been living under? Yeah. If you don't know that. So. So new Roman kings. When a new Roman king was made and Romans did have kings for a long time, when a new Roman king was made, he'll be brought through gate of the city up to the city's high place, the Capitoline Hill. And of course, the highest point of ancient cities is always where they would put the temple, Right? Yeah. And the marriage would be consummated between the king and the city of Rome. The marriage would be consummated on the Capitoline Hill. And different, again, different cultures have different ways of doing this the way they would do it is. They would. They would seat the king in a chair, and then they would basically stand there and wait. And there would be an auger there, and they would wait for the gods to show by flashes of lightning or certain bird flight patterns, various things like this. I'm not an auger, so I just, you know, can't read. Yeah. And the marriage would be consummated when the gods gave their ascent. In other words, the gods are presiding over the marriage and they. And they give their assent and then the marriage takes place. And this. This caused a kind of a relationship where even though it was like a totally platonic or, like, totally celibate thing, where the king was sort of, you could say, ritually married to the Vestal virgins, right? So the Vestal virgins, they embody. And the Vestal virgins are really important to understanding how Rome thinks of herself, which is sort of as the. Well, gosh darn it. As sort of the unwedded bride. Right. Because. Because the Vestal. The whole thing going on with Vesta is that she's. She's this virginal goddess, but also somehow she's a mother, Right. She's the mother who's never been violated. That's how Rome thought of herself. Right. So she thought of herself as like a mother to the other cities and the lands that she conquers, but also one who had never been wedded. None. No. One who had never sort of been taken as a bride."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":1250.81,"end":1251.77,"speaker":"Jonathan Pageau","text":"Never been conquered by."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":1251.93,"end":1383.01,"speaker":"Richard Rohlin","text":"Never been conquered. Yeah, exactly. And. And so when the. When the kings are driven out and abolished, when the Tarkins are driven out of Rome, what they do is they take all of these things that in every single ancient culture, sort of naturally manifested in the king, and they split those up and they break those things apart. Right? And so one of those roles is of the high priest, the Pontifex Maximus. But they still did a very similar ritual to this, for instance, whenever they would make a new console. And a lot of Roman historians talk about this. When Caesar Augustus, when he becomes what he becomes, right, what he basically does is to take all these little titles, all these little manifestations of the city's authority, and actually to bring them back together and kind of reunite them into a single person. So one of the ways that he does this is that there was this law that the Pontifex Maximus has to reside in a publicly owned house. In other words, if you're the high priest, you have to live in a house that the city owns, not your own. The point is, you're not supposed to be accumulating wealth and power to yourself. Right. You're supposed to be just operating on behalf of the city. And so what he does to kind of do an end run around this is that he keeps his. His private house, but he gives part of away to the Vestal Virgins and creates a new shrine of Vesta there in his house. So some of the Vestal virgins come to live in Caesar's house. Symbolically, they're his wives. So what is he doing? He's sort of symbolically marrying himself to the city of Rome. And this massively strengthened the connection between Augustus and not just the Roman state, not just like the instruments of political power, but it hugely strengthens his relationship to. Between Rome and everything about Rome, like symbolism, religion, all these different things. Right. And so, so you could sort of see Augustus is now sort of the husband of Rome. And that's basically how Augustus becomes king without becoming. Without ever calling himself king. Right. In fact, he never really calls himself emperor, for that matter. Yeah, he calls himself, you know, the first citizen, the prince."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":1383.01,"end":1386.33,"speaker":"Jonathan Pageau","text":"The first citizen. Yeah. It's amazing. Augustus is an astounding character."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":1386.73,"end":1449.61,"speaker":"Richard Rohlin","text":"Brilliant guy. Yeah, yeah. Okay. So that's a little bit about city founding rituals, and there's a whole lot more. If you want to go down rabbit trails on this and kingship in general. There's a book, I think you can find the PDF on the Internet for free because it's a very old book, but it's just called the Ancient A Study on the Religion, Laws and Institutions of Greece and Rome. And it's a really, really old book that I think was recently translated to English in, like 2001, I want to say. But you can find a PDF of this out there if you want to read a lot more about this. So I'm going to kind of pivot from there. Not so much pivot, but transition from there into talking about Holy Week. So Holy Week again. We start out with this idea. So we started with this idea of the bridal chamber with the service of bridegroom matins. Right. And so we have Christ the bridegroom as kind of the central figure. And there are several. There's several parables about. I was just looking around. I have a Christ the bridegroom image around here."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":1449.61,"end":1450.73,"speaker":"Jonathan Pageau","text":"Icon. We'll show it."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":1451.13,"end":1490.7,"speaker":"Richard Rohlin","text":"Yeah, we'll put one up. This is a really important icon. This will be the icon that'll actually be in the church for these four days. This is a really important icon because it shows Christ as a king, but as Like a suffering king, because it shows him as a king, but he's got the scarlet robes that the soldiers put on him, and he has the crown of thorns, and he has the reed that they put in his hand. It's, of course, this is one of those things where they're, you know, symbolism literally happens. Jonathan. Yeah. Where. Where, like, they're doing these things to him to mock him, but actually what they're doing is revealing him for who he is. Right? And so. But if you think about that narrative, the basic narrative of the city founding myth, the king comes to the city. He."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":1491.74,"end":1497.1,"speaker":"Jonathan Pageau","text":"And it's important to understand that it starts with the. With the Palm Sunday. Yeah. Triumphal entry."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":1497.18,"end":1648.22,"speaker":"Richard Rohlin","text":"Yeah. So the king comes to the city and he enters in this triumphant way, right? People acclaim him, people. And you could say it exactly corresponds, if you've ever been to an Eastern Orthodox wedding, it exactly corresponds to that. The entry into the narthex when the bride and the groom meet. And they're still on the narthex, still at the gate, but they meet and they're sort of joined and they're betrothed. That's what Palm Sunday is. It's sort of like the betrothal, right? And then Christ ascends to the high place of the city of Rome, or not of Rome, of Jerusalem, he sent to the high place of his city. This is. I mean, he's. Christ is both, you know, divinely. You know, he's. He's Yahweh, the God of Israel. So this is his city. This is Zion is the city where God put his name, right? So this is his city, but also this is his city because it's the city of David, who is Christ's ancestor according to the flesh, right? So Christ is the king, Right? He's the king. He's the king. Both, you know, originally, you know, why does the kingship and the. Why is the kingship and the priesthood split out originally? Well, in the Mosaic law, it's because God is supposed to be their king, right? And so by that standard, Christ is king. He's king of the Jews, right? He's king of Israel. But then by the kind of the new Davidic, you know, the relatively speaking, new institution of kingship in Israel, right? The Davidic kingship. Christ is king, so this is his city. He comes as king, and people know it. People acknowledge him, you know, hosanna to the Son of David, right? So he comes up, and he comes up to the high place in the Synoptic gospels, Matthew, Mark and Luke, what we see is that after his triumphal entry, as he comes up to the high place, the holy place, the mountain of, you know, of God, the temple in the midst of the city, which he comes up there. But what does he find? He finds it's become corrupt. He finds that it has become. Supposed to be a house of prayer, but you've turned it into a den of thieves, right? And this is when he drives the money changers out of the temple. In the Synoptic Gospels, it's right after his triumphal entry. So the thing that's supposed to happen if you're kind of following this ancient blueprint, is that Christ would ascend and he would consummate his relationship with the city in the temple. Right? You could say this would be something like going into the temple and offering a sacrifice, or as God going to the temple and accepting worship, accepting sacrifice. And what he does instead is to drive the money changers out."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":1648.3,"end":1658.66,"speaker":"Jonathan Pageau","text":"But in a way, he also restores the heart, like restoring the center. He's cleaning it out. Like, he's removing the ash, and he's making it, like, pristine again, you could."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":1658.66,"end":1775.22,"speaker":"Richard Rohlin","text":"Say, yes, but this is also like the basis of. Now the Jews are like, okay, we really do have to kill him this time. Right? So this is like the basis. You could say it's always when you hit somebody's pocketbook, right? This is the basis of. This is the basis of the final rejection of the Jewish people, the Jewish religious leaders, the priestly class. This is the. This is the basis of their final rejection of Christ. So much so that they are willing to do what has to be done to kill him. So Christ goes out of the city immediately after approaching the temple, he leaves the city of Jerusalem. And as it just says, kind of a very interesting note, there's not a single time in the Gospels that I've ever, ever been able to find, and Petitza talks about this in his book as well, that Christ spends the night in the city of Jerusalem as an adult. Never happens. So he doesn't consummate his relationship. He cleanses it. So you could say he restores it to his virginal state. Yeah, right. But then he doesn't consummate the relationship. He goes outside of the city and he stays the night, usually spends the night in Bethany. In fact, most of the time when Jesus is in Jerusalem, he's like, teaching or preaching in Jerusalem during the day. But then he's going back to Bethany to Lazarus's house, and that's where he stays. So what you see is this city founding ritual that is sort of like aborted. It sort of goes wrong. And the thing that it culminates in is you could say a murder leading to a marriage. Okay. The thing that culminates in is what? His bridal chamber outside the city, outside the walls of Jerusalem. And his bridal chamber is the tomb. Right. And so this is the, this is the way that the Church presents it to us, encourages us to think about it, is, is of Christ burial in the tomb, among other things. Right. Is his entry into his bridal chamber where he consummates his relationship not with the physical city of Jerusalem, but with his new city, which is the city of God, the heavenly Jerusalem, which is the church. And that's the. You could say that's like the core idea of Holy Week."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":1775.3,"end":1837.95,"speaker":"Jonathan Pageau","text":"Yeah. And it's. If you start to think about it, it's so, it's just, it's always like every story that is related to Christ, it always just smashes so many things. You start to think about the relationship, you know, between this murder, this sacrifice that happened and how it's outside the city. And then also when Christ dies, it says that, you know, the veil of the temple is ripped. And so he goes, his, his bride chamber is the tomb. And it's at the same time, the, the Holy of holies at the same time. So he actually goes, it's like he fills up, goes all the way up and all the way down at the same time. Because, you know, when he's on the cross, he says, right, tomorrow you will be with me in paradise. Which is like, which is a weird thing to say because he's going to spend it, you know, he's going to spend some time in the tomb there. But there's a mystery happening where he both, like you said, consummates his actual kingship and priesthood in going into the Holy of Holies and into the Garden of Eden, but then also reaches the bottom of the world and kind of makes the whole world his kingdom, you could say."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":1838.27,"end":1882.6,"speaker":"Richard Rohlin","text":"So here's the. And when you mentioned the tearing of the veil, this made me think about this. Here's one that I've been kind of pondering over the last couple of weeks as we're coming up on. And I think as we're recording this, Western Christians are already in their Holy Week, but as we're coming up on Holy Week. So something I've been thinking about is on Holy Monday, the scripture readings and the liturgical service focuses our attention on Joseph the Patriarch, you know, Technicolor Joseph, Right. My brother was in a production a couple of years ago of Joseph and the Amazing Technicolor Dreamcoat, which was awesome. It was a lot of fun. But, yeah. So Joseph has all of this."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":1883.24,"end":1883.56,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":1883.56,"end":1902.72,"speaker":"Richard Rohlin","text":"Of course, the story of Joseph is the story of Christ. Yeah. Betrayed by his brethren. Right. But something I've never really noticed before, right, is this. Joseph goes into the. He goes into the house of Potiphar, right? And he's there in the house of Potiphar. And then he. Who does seem to have, like, some kind of a priestly role, right?"}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":1902.72,"end":1905.37,"speaker":"Jonathan Pageau","text":"And so he's a eunuch, which is weird."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":1905.61,"end":1908.69,"speaker":"Richard Rohlin","text":"Yeah. So he goes into the house of. Is Potiphar a eunuch?"}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":1908.69,"end":1909.45,"speaker":"Jonathan Pageau","text":"I think so."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":1909.45,"end":1910.49,"speaker":"Richard Rohlin","text":"I don't. I don't think."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":1910.65,"end":1911.45,"speaker":"Jonathan Pageau","text":"No, he's not."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":1911.45,"end":1913.69,"speaker":"Richard Rohlin","text":"Okay, well, I don't think so. I don't think so."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":1913.77,"end":1914.37,"speaker":"Jonathan Pageau","text":"Fact check."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":1914.37,"end":2005.25,"speaker":"Richard Rohlin","text":"That. Yeah. That could explain why his wife was trying to get with Joseph, I guess. But anyway, I'm sorry. All right, so. So you got Joseph. He goes in the house of Potiphar, who is this priestly individual. And while he's in the house of Potiphar, right. The wife of Potiphar tries to seduce him. Right. And so there's a consummation that is supposed to happen, or not supposed to happen, but there's a consummate. Well, the consummation that should happen, right, is between Potiphar and his wife. But there's something impure in the relationship, right? There's something missing. There's something off. Yeah. So what does Joseph do? Joseph flees. And when he flees, his veil, his garment is torn, Right. You know, torn from him in this case. But just kind of thinking about the. The symbolic resonance between that and Christ coming to. The. Coming to the high place, coming to the temple. But it's impure because the people of God have. Have become whores. They've prostituted themselves out. Right. They're. They're. They're. They're serving mammon, right? And so they. And so Christ leaves. And when he. He leaves, you know what happens? His garments are torn, but also, like the veil of the temple is torn, you know, kind of. Kind of showing, you know, among other things, God's not there. He's over here. But yeah, so there's a lot of. There's a lot of really interesting resonance, I think, more than. More than I think I initially realized. You know, even growing up as a little kid, you can read the story of Joseph and be like, oh, this is obviously, you know, a type of Christ, but I think there's also a."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":2005.25,"end":2060.53,"speaker":"Jonathan Pageau","text":"Way in which there's a surprising idea that I see in the story of Joseph, obviously the story of Christ is that there's a manner in which this transaction which happens is a way to save this Egyptians first. And so it's like you change those people that are in even like if you read San Gregory of Nietzsche are images of, of this world of death, of this world of animality, this world of the stranger. You know, he, you know, St. Gregory talks about the relationship between the Egyptian and circumcision. And like killing the Egyptian has to do with circumcision, like all of this imagery, very strong. And so there's a sense in which Christ goes, there's a transaction which happens because the Jewish representatives sell him to Rome so that they can kill him and then they kill him. Because obviously the Jews don't kill Jesus directly, the Romans physically do and then he goes into death. And there's something about that which is related to him becoming the king of the Romans."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":2060.53,"end":2101.76,"speaker":"Richard Rohlin","text":"Yeah, well, and that's the thing. I kind of wanted to point it out. Point out. I mean the whole basic idea of universal history is the way that is the stories that we tell about ourselves as cultures, as cities, things like this, the ways that they are sort of caught up into the kingdom of God and even all the stuff we're talking about with Romulus and Remus and the Vestal virgins and Augustus and all this stuff. There's a cringy Internet fedora wearing atheist read on all of this which is like, oh, see, Christianity is just a bad collage of all this other stuff. But if you really understand what's going on, what you can see is again, if there's a true pattern, you'll find it in the story of Christ. Right? There's no pattern that's true, that's not there in his story."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":2102.32,"end":2126.09,"speaker":"Jonathan Pageau","text":"There's also a working out of this pattern which is bringing it to a universal level. It's taking local realities and things that are somewhat off. Like a good example would be, let's say the relationship between Mars and Vesta and the virgin and Rhea. There's something which is pointing towards Christ but which is off. And we know it's off because."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":2126.09,"end":2126.49,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":2126.49,"end":2167.38,"speaker":"Jonathan Pageau","text":"Like it's because obviously she's still, if she's raped by God, she's not a virgin. And so there's something that, and she has to, you know, there's something that doesn't make any sense. And so in the story of Christ, the best of that Story gets taken in there and then gets solved. Like, the problem gets solved in terms of the relationship between God and virginity and how that brings about the true Son of God ultimately. And that's something like you said, which it's. I think that for us, for a lot of orthodox and for you and I, not only is that not a problem, but it is like a beautiful. It's like a beautiful, grand narrative poem that is. That is happening all over the world, that is coming into its. Its powerful resolution."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":2167.38,"end":2169.62,"speaker":"Richard Rohlin","text":"Yeah, it's a feature, not a bug."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":2169.7,"end":2171.26,"speaker":"Jonathan Pageau","text":"Exactly. It's a feature, not a bug."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":2171.26,"end":2182.09,"speaker":"Richard Rohlin","text":"Feature, not a bug. Yeah, that. That whole idea that. That you could say, like, to manifest the true king, you would need someone who is both a virgin and a mother."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":2183.29,"end":2248.69,"speaker":"Jonathan Pageau","text":"And to manifest the true king, you need someone that is divine and human. And the way it's presented in all the ancient stories, it's like a weird hybrid. He ends up being a strange hybrid. And so there's something off about the character always. And it's always like. It's always like someone's married and then the God comes and takes them, or there's. It's always like a rape of some kind. It's like an imposition of the God on reality, which brings about. And so that's why civilization itself has violence at its core. I mean, you know, Remus and Romulus are the sons of Mars, and there's a reason why Rome has such blood on its hands, like. And that blood is not only there, but it's glorified. It's part of its story. There's a sense in which its conquering nature is so prevalent, and so that gets transformed with Christ into something which is far more powerful. And then, like I said, way more universal because it brings the story to its resolution and avoids the trappings of the other versions."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":2248.93,"end":2278.94,"speaker":"Richard Rohlin","text":"Yeah. So Tuesday, the focus. And maybe this ties into that. I don't know. I'm still kind of mulling over this one, so maybe you can help me understand it. The focus for Tuesday, the Gospel reading, is about the barren fig tree, right? Christ goes to the fig tree. And the thing is, he comes to the fig tree, and it even tells us in the text that this is not the right time for figs. Right. But he comes to the fig tree and he finds it fruitless, and so he curses it, and then the fig tree withers."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":2279.18,"end":2310.67,"speaker":"Jonathan Pageau","text":"To me, this has to do with. This has mostly to do with the removing of garments. Yeah. This is what's going on. It's like Christ is going Back into one of the things Christ is doing. He's doing many things. One of the things he's doing is he's going back into the temple, going back into paradise. So as he goes back into paradise, he removes the fig garment. You know, he removes the garments of fig leaves, and that's the cursing of the fig tree. St. Ephraim the Syrian says it's that way. Like he sees the cursing on the fig tree as the removal of the. Of the fig garments."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":2310.83,"end":2311.67,"speaker":"Richard Rohlin","text":"I've forgotten that."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":2311.67,"end":2312.11,"speaker":"Jonathan Pageau","text":"So that."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":2312.11,"end":2355.68,"speaker":"Richard Rohlin","text":"That goes really well then, with a couple of things. One is. Is obviously the focus on the previous day is Joseph losing his garment to Potiphar's wife. Right. Which is another way that garment of skin is being removed. And then also the focus of bridegroom matins is this idea that I'm not ready for the wedding. Right. I'm not ready for the bridal chamber. Why? Because I have no wedding garment. Right. And so there's also. There's also a. You could say an acknowledgement, the whole purpose of the Holy Week services for the first four days starting Sunday evening. The whole focus of Holy Week, the Holy Week services, is to. To sort of reveal our nakedness. Right. To acknowledge our own nakedness before God. Right."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":2355.68,"end":2378.59,"speaker":"Jonathan Pageau","text":"And also remember that in the entry into Jerusalem, there's also removal of garments. People take. Remove their garments, their outer garments, and put them right as he walks into the city. So all this idea of removing garments and finding glorious garments is something which is preparing itself. If you understand what baptism looks like in the Orthodox tradition and how it works, you can understand that all of this is coming together."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":2378.75,"end":2502.08,"speaker":"Richard Rohlin","text":"Right. And of course, this is all. That angle is all headed towards Holy Saturday, which is the traditional day for the baptism of catechumens in the Orthodox Church. Obviously, nowadays we do it on different days, but originally, Holy Saturday, that's. That's kind of the day. Yeah. So the next day, the focus on. The focus on a Holy Tuesday evening is the. Or the. I guess that. Yeah, the focus on. The focus on Tuesday. Holy Tuesday. The focus is on the entry into the temple and the cleansing of the temple, which we've talked about. Yeah. And of course, you could say, like, trade itself is a garment of skin for a culture. Right. That's why we're always talking about the economy. The economy, the economy. This is kind of money trade, things like this, things that aren't really generative. Trade doesn't actually create things, it just moves them around. And this is why, among other things, this is why lending out money at interest is associated with sodomy, for instance, Dante's Divine Comedy, because neither. Neither are they're punished in the circle of hell because neither one of them are generative. Right. And then this brings the focus. This focus sort of culminates on Holy Tuesday evening when we read the parable of the Ten Virgins. And of course, this is the whole idea of getting ready for the wedding. Getting ready for the wedding. Yeah. And then Holy Wednesday evening, we focus on the betrayal of Christ by Judas, which I'd be interested to. There's a lot going on with Judas, Right. Like, it's one of the main. One of the main images in Christianity, right. Is Christ's betrayal by Judas. Of course, it's one of the main things. There are multiple psalms that prophesy this, prefigure this. Right. And you've got Judas. There's a. There's a, you know, an image that's just sort of fixed in my mind of at the mystical supper, Judas getting up and he puts on his cloak and he goes out. Right. You know, and. And then, of course, he's using. What is he betraying Christ for? He's trading Christ for money. Exactly. Right."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":2502.16,"end":2506.48,"speaker":"Jonathan Pageau","text":"So the idea of exchange, the same idea that was in the temple, Right."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":2506.48,"end":2522.69,"speaker":"Richard Rohlin","text":"It's the idea of like, exchange for a sacrifice. Right. So, yeah. So all of this stuff is. Is coming and it's kind of. Obviously this is going to culminate in the. The service of Good Friday, which in both the east and the west, it's been historically celebrated slightly differently, by the way."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":2522.69,"end":2540.81,"speaker":"Jonathan Pageau","text":"I just want to say one thing, but I'm not going to explain it, but it's okay. I've talked about this in other videos. I. I think I talked about it before, but. But there's a removal of clothing at the time of Judas's betrayal as well. Because. Because who is supposedly Saint Mark, which is not named as he was running away from Mount of Olives."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":2540.81,"end":2541.21,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":2541.21,"end":2545.17,"speaker":"Jonathan Pageau","text":"His garment gets removed and he runs down the Downs, the hill, naked, basically."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":2545.25,"end":2550.36,"speaker":"Richard Rohlin","text":"What a weird little detail to what a very strange Saint Mark. Yeah, that's right. Yeah."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":2550.36,"end":2598.46,"speaker":"Jonathan Pageau","text":"But it's important. I think it has to do with it. There's something about. There's something about a weird. This removing of garments and shame. It's not clear, but there's, There's. There's definitely a pattern because. Because you understand, the Mount of Olives, as I've talked about this, how in the. When Christ goes up and the disciples stay down at the bottom and they fall Asleep. That this is really a very powerful cosmic image of going up towards the holy place and then people forgetting. It's. It's almost Moses going up and people worshiping the golden calf at the bottom of the mountain. It's a version of that story. And so the idea that as they run away and someone, as they run, is scattering, you know, as Christ is being betrayed, then there's this strange moment where it's almost there, the garment is removed. It's so like. It's. The categories. Don't they just smash."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":2598.46,"end":2606.22,"speaker":"Richard Rohlin","text":"It's hard. Yeah. Everything jumbles up right at the Passion, you know, just, like, symbolically. It's very difficult to. You could say, like, disentangle it, because it's."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":2606.22,"end":2628.06,"speaker":"Jonathan Pageau","text":"Because there's so much going on, and there's things that seem to signify two opposites at the same time. Constantly two opposites at the same time. So it's like, you know, is it the nakedness of shame of Noah right in his tent that is being happening? Or is it the same with Christ on the cross himself? Is. Is his nakedness on the cross the nakedness of shame, or is it the nakedness in the garden? And the answer is. It's both at the same time."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":2628.06,"end":2629.18,"speaker":"Richard Rohlin","text":"Both. Yeah. Yeah."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":2629.18,"end":2634.22,"speaker":"Jonathan Pageau","text":"But it's just hard. You can't really hold it in your mind when you're not. When you're thinking about it."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":2634.22,"end":2660.04,"speaker":"Richard Rohlin","text":"Well, even. Even things like. So, you know, Judas goes to. Who does he go to to make the exchange? He goes to the. He goes to the temple. Right. He goes to the temple to make that exchange. Right. And then later on, when they're. It's. It's when they're at the. You know, if not at the temple itself, they're in the precincts of the temple because they're the. The house of the high priest. That's when Peter betrays Christ. Right. And so you have. Yeah. This. This whole. It's one of the things."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":2660.04,"end":2663.88,"speaker":"Jonathan Pageau","text":"We're not going to disentangle. The whole thing. We're supposed to stay on the line of the bridegroom."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":2663.88,"end":2664.68,"speaker":"Richard Rohlin","text":"I'm sorry. I'm sorry."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":2664.68,"end":2665.96,"speaker":"Jonathan Pageau","text":"Because there's so much going on."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":2665.96,"end":2670.72,"speaker":"Richard Rohlin","text":"There's so many. So many things just converge all at once. I mean, this is the master pattern. This is the."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":2670.72,"end":2671.2,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":2671.2,"end":2703.05,"speaker":"Richard Rohlin","text":"It's the basis of the universe existing. Right. Is this moment. So on Thursday night, to talk a little bit about what we do in our liturgical practice, you know, on Thursday evening, what we do is we do this beautiful service called the 12 Gospels in the Orthodox Church. And I think that they do the foot washing in the Maundy Thursday in some Western practice. Depends on some. Yeah, yeah, but that's the night that."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":2703.13,"end":2707.29,"speaker":"Jonathan Pageau","text":"I think that's the night that it happens, I think. Or no, isn't it the same night as the Betrayal?"}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":2709.7,"end":3059.39,"speaker":"Richard Rohlin","text":"I think it's on Thursday, but, you know. Yeah, yeah. We didn't actually do any of that stuff when I was a Protestant at the churches church that I was in, you know, we had an Easter service, but that was it. And so the only liturgical tradition I've spent a lot of really enough time to really form me in any way is obviously been in the Eastern Orthodox Church, though I've studied a lot and I'm about various different ways that this is done. So in. In the Eastern Orthodox Church, on Holy Thursday night, we're actually having. It's a Friday morning service, right. And what we do is we read the entire Passion Gospel account from all four Gospels. This is a pretty long service. It takes quite a while. And it's inner. It's interspersed with some really beautiful hypnography. That is a lot of it is from the perspective of the Virgin, which is not incidental to what we're talking about today, Right. Much of that hypnography and the hypnography of Holy Week in general is sort of walking along with her as she's watching her son, right, where he's the bridegroom whose bride rejected him and then she's the unwedded bride, Right. And so there's just a lot of really beautiful interplay between them in those hymns. And I always find those hymns to be the most moving and beautiful part of Holy Week for me. So at the end of this, we do this thing, and it's a Holy Friday thing in both the east and the west in, you know, medieval times, we do this thing. Keeping in mind that first Thursday night is at that point, Friday morning, we do something called creeping to the Cross. That's what it was called in England. This is one of the main things that the Reformers were trying to do away with. It's a whole different conversation to talk about the ways that, for instance, the English Reformation changed the way that Holy Day was. The Holy Week was celebrated in England. But one of the main things that the Protestant reformers in England were really keen to get rid of was this practice of creeping to the cross, which is basically in the West. They would veil all of the icons in the church, which is, you know, talking about this. This imagery of veiling and unveiling. Right. The garments of skins. So what they would actually do at the beginning of Lent is they would. They would veil all of the images in the church. And some Anglican. I think there are. I know for a fact that there are still some Anglican churches that do this today. I don't think that this is typically done in, like, Roman Catholic parishes like Novus Ordo, but I could be wrong. Some of them might do it. I'm not sure, but they do. They have this practice of veiling everything. And then what happens on Holy Friday is that they unveil the cross. They unveil a cross and there's like a ceremony. In medieval England, there was a ceremony. They would do this and that. The priest would sing. I had the words here somewhere. He was saying, behold the wood of the cross on which hung the Savior of the world, Come, let us worship. So he was singing this three times. And then while lifting the veil, and then once the veil was lifted, it's not just a cross, obviously, it's a crucifix. The whole parish, the whole church would come forward and they would kiss the feet of Christ, which is also something at the end of that 12 gospel services, at least in my parish, that's something we do, is we come forward at the end, we prostrate before the crucifix, and we kiss Christ's feet as sort of as we go out. And so this is. This is, you could say, the moment of the wedding. And in fact, in medieval England, this would be the first time that you actually got to kiss anything in church all Holy Week, because they would. Normally, in medieval Mass in England, they had something called the paxbrid. The paxbrid, the peace. It's like the sign of peace. And it was like a little metal icon. And they would pass this around at the time of the passing of the piece in. In the Mass, it was literally like something that you passed and you would kiss it. And it was a way of. If you were. People in medieval England, for instance, didn't take communion except usually once or twice a year at Easter and maybe Christmas. Right. So this was your thing that you got to do with the liturgy. And actually, if you passed it around in the wrong order, it's supposed to be sort of be passed around in the order of the social hierarchy of the parish. So if you pass around the wrong order, fights could break out in the middle of Mass. It's pretty. Pretty fun times. Great. Rowdy. Yeah, good, Good stuff. But. But they wouldn't pass this during the Holy Week, because Christ was betrayed with a kiss. Right. Which is another kind of weird aspect of the wedding imagery, I think. Right. And so. And so this would be the first time in the medieval west, like, that you would actually kiss something in church all week during Holy Week and the next day, the Holy Friday. In both the east and the west, what we basically do is we have a funeral for Christ. And so what we do in the Orthodox Church today, as probably many people are watching this will know, is that we've got a couple of services, one where we're actually sort of performing a funeral for Christ. And so we have an icon called the Burial Shroud that we carry around the building. We actually carry it around the church. There are psalms, laments and things like this that we sing. And then we lay it in this ritual tomb which we've actually built in the middle of the church. And the ritual tomb has a cool name in Greek, which I don't remember, but they actually had this in the west as well. So in medieval England, they would either build a temporary sepulcher in the middle of the church, just like we usually do in our parish practice, or if you had a well appointed parish in. If you had a well appointed parish in England, then there might actually be a permanent sepulcher kind of up by the altar, but kind of off to one side, and that's what was used. And an interesting difference in our practice versus the practice in medieval England is that, typically speaking, we lay two things to signify Christ being in the tomb. One is this icon, this burial shroud that we talked about, which is like a icon."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":3059.39,"end":3064.92,"speaker":"Jonathan Pageau","text":"People understand that it's a shroud. It's a shroud. But on the Shroud is an image of Christ laid in the tomb, right?"}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":3064.92,"end":3065.68,"speaker":"Richard Rohlin","text":"Yes, Right."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":3065.68,"end":3070.64,"speaker":"Jonathan Pageau","text":"It can be painted sometimes it's stitched. Yeah, it can be a stitched image. It depends on kind of like a."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":3070.64,"end":3134.42,"speaker":"Richard Rohlin","text":"Meta Shroud, sort of, because it's like a shroud of a shroud. But then. And then we take. And then we also take the Gospel book. We lay it on top of that. And then in our parish, we also. What we do then is we take the veils. I know there's probably a better name for these, but we take the veils that we would normally use to veil the Eucharist. Right. And we actually use those. So if you read the Scriptures again, it's interesting to see, like, think about this, this idea of garments being removed. Right. Because when Christ is laid in the tomb, he's wrapped and Then there's like another veil, a napkin that's kind of folded over his face. Right. And a nice detail is that when Jesus leaves the tomb, the wrappings are empty, but the napkin has been nicely folded. Christ is apparently very tidy. I don't know what else to do with that, you know? But when we lay. When we lay Christ in the tomb, liturgically, like, ritually, we take these two veils, right. And we place them. One over his face and then I think one. Yeah. So it's. It's a really beautiful kind of. Maybe that's just like a Slavic thing or a. I don't know."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":3134.42,"end":3135.98,"speaker":"Jonathan Pageau","text":"We don't. Yeah, I've never seen that in our."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":3135.98,"end":3138.14,"speaker":"Richard Rohlin","text":"I've never done posca at any other parish."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":3138.14,"end":3138.86,"speaker":"Jonathan Pageau","text":"Yeah, exactly."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":3139.02,"end":3205.18,"speaker":"Richard Rohlin","text":"Yeah. So somebody out there watching this knows a lot more than I do. So maybe you could let us know. All right. So in the west, in medieval England, just as an example, again, they had a few different ways they would do this. The first thing that they would do is instead of making it an icon of the Gospel book, they would have the crucifix, which they would take and they would lay in the tomb. And then they would also have. They would have had a pre. Consecrated host, a Eucharistic host, and they actually lay that. They would put that in like a small. Picks is what it was called, like a small little container, and they'd actually place that in the tomb as well. Some churches. There was one church in late medieval England, just a couple hundred years before the Reformation, that actually had a very beautiful, elaborate carved crucifix with a removable compartment in the chest with a pyx in it. And so what they would do for Holy Friday is that they would actually remove this compartment. They would put the consecrated host in that and then place it back in and lock it up and then put that in the tomb. Right. Which is pretty. That's pretty. It's kind of cool."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":3205.5,"end":3207.18,"speaker":"Jonathan Pageau","text":"It's interesting also to think about."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":3210.38,"end":3210.66,"speaker":"Richard Rohlin","text":"The."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":3210.66,"end":3222.78,"speaker":"Jonathan Pageau","text":"Ark of the Covenant and the manna inside the ark and the law inside the ark, because I've seen the Bible, when we use the Bible, but the idea of putting an actual consecrated piece of bread there."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":3222.94,"end":3341.01,"speaker":"Richard Rohlin","text":"Yeah. And what Duffy says last video, I think we talked about, I mentioned the stripping of the altars, which is really important book, I think. But he says that this sepulcher is the. The interpretive crux for understanding popular religion in late medieval England. Right. The purpose of this sepulcher was to focus, obviously, the symbolic focus of Holy Week, Christ's Cross and passion and all this, but also to reinforce the doctrine of the Eucharist, which is really, who was already, even before the Reformation in England, coming under fire dramatically by people like the Lollards, who, I mean, would. These are people who would go into churches, they would steal pyxes, and then they would take the host and they would trample on it or defile it in some other way. Right. In a public way to show I don't believe that there's anything here. Right. And so this, this corresponded with the watch that would be kept over the tomb, which is something we do in the Orthodox Church today, something they did in the medieval west as well. And in this watch that they keep over the tomb, you know, there are a couple of things going on. One is, there's that there's the nice symbolism of, like, keeping the watch over the tomb, but there's also the fact that there were people who actually wanted to steal and defile the consecrated host. Right. And then also the fact that the pyx was usually made from, you know, precious metal, as it should be. And so for all these kind of reasons, you would want to keep watch. So they would. They would usually hire, you know, like the church warden or other men in the parish and to keep watch all night. And this was in the Middle Ages. This was an armed watch that you actually keep. And what it sort of means is like, you kind of go, there are two kinds of people who keep watch of the tomb of Christ, right? There's the Mother of God who keeps watch over the tomb. This is in the Father St. Gregory. Palomas talks about this. But then there's also the soldiers, right? The soldiers who keep watch over the tomb. Right. And so it's like, which one am I sometimes?"}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":3341.01,"end":3343.13,"speaker":"Jonathan Pageau","text":"Yeah. So the body won't be stolen. Interesting."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":3343.21,"end":3421.5,"speaker":"Richard Rohlin","text":"Yeah, yeah. So. So it's just interesting to see how this. These patterns kind of just like manifest themselves in these ways that Christians celebrate Holy Week. And then, of course, all of this culminates with Holy Saturday, which is the day of baptism. It's the day that new Christians are received into the church. And it's also the day of, you know, the harrowing of hell, the defeat of hell in both the east and the West. For instance, in Anglo Saxon England, before the Norman Conquest, there was a really beautiful. Basically, it's basically a poetic rewriting of the Gospel of Nicodemus that they would actually read in Old English, they would actually read this liturgically in the church on Holy Saturday. So pretty cool stuff. Pretty cool stuff. And Then Holy Saturday, obviously that culminates in the Easter vigil. But it seems like if you just study the way that Holy Week has been celebrated by Christians in both the east and the west, everything sort of converges on the sepulcher. And I think the two symbolic patterns that seem to manifest the most are one, this pattern of the removing of the garments that you talked about and then this idea which is related to that of Christ as bridegroom. Like what happens on a wedding night while the bride removes her veil. Right."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":3421.98,"end":3470.44,"speaker":"Jonathan Pageau","text":"And what's interesting is that you really see like the difference between. You can see the difference. So in. So we do have the notion of the glorious king as Christ ascends to heaven, as Christ resurrects. There's this sense in which, you know, we see Christ up in the dome, that you have this glorious king, but you also understand that there is this glory, like this position that he holds goes through the cross and goes through the tomb and that it actually transforms the hierarchy. Like I always, I talk about the notion that at the top of the Christian hierarchy is something like self sacrifice and that it's actually not. And it's not arbitrary. Once you see it and you understand it, you realize that that's actually how reality works. Reality actually holds together through, through self sacrifice. I won't go into it too much into it here. You can find talks on my channel about this."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":3470.44,"end":3477.92,"speaker":"Richard Rohlin","text":"But self sacrifice, yeah, self sacrifice is the kind of sacrifice that is the basis of marriage. Right, exactly."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":3478,"end":3480.08,"speaker":"Jonathan Pageau","text":"Of a true marriage, of a whole."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":3480.08,"end":3516.22,"speaker":"Richard Rohlin","text":"Idea of like a sacrifice leading to a marriage. That's the, because I mean that's the thing like, like putting, you know, that idea of like the meta. Desire. Right. And the idea of like putting your. Put. Let's, let's take all that tension and that disagreement between us because we're competing for the same resources or whatever. Let's take that stuff and let's put it on the scapegoat. Well, that's a temporary solution historically. What's the long term solution that basically every human culture has come up with for saying how do we share resources in a way that's going to be sustainable not just for us, but for the people who come after us is through marriage."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":3517.98,"end":3533.02,"speaker":"Jonathan Pageau","text":"And then you see this whole image of the parents or the parents that give their attention, their love to their children and then don't see their children as competition. They see there's a different relationship of."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":3533.5,"end":3534.06,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":3534.46,"end":3558.78,"speaker":"Jonathan Pageau","text":"Of giving and love. It's very different. So you can understand how it's a Different image of how reality holds together. One which is still based on sacrifice rather than. Because you can see, like, even in terms of a family, you can understand how. And you've seen it because sadly, you seem to be. Families like that where a black sheep in the family is useful, you know, in order to cohere the family. It's like, oh, around that."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":3558.94,"end":3562.38,"speaker":"Richard Rohlin","text":"Around that one point, everything is that person's fault."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":3562.38,"end":3580.45,"speaker":"Jonathan Pageau","text":"And so then you're able to cohere. But that this is, like you said, it's temporary and it's always leading to some kind of. Some kind of revenge at some, you know, in some future. At some future time. But that the true nature of. Of a bond of love which brings about self sacrifice is the one that is the only one that really holds reality together."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":3580.61,"end":3604.87,"speaker":"Richard Rohlin","text":"And what happens if you have that black sheep in like a family or even like a friend group? Right. The more you commit to that, the less possible it becomes actually reconcile to that person. Because there's actually a danger. And I've seen this in families and friend groups and things like this, where there's a danger of if we all decide we're going to forgive this person, then the thing that was actually allowing us to cohere is gone. And then the group just dissolves. Exactly. Yeah."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":3605.83,"end":3607.99,"speaker":"Jonathan Pageau","text":"Then it's mayhem all around."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":3608.39,"end":3654.04,"speaker":"Richard Rohlin","text":"Yeah. And so I think marriage is a. The famous Monty Python quote, strange women lying in ponds distributing swords is not a basis for a system of government. Well, I also don't believe that murder is a basis for a system of government or like a basis for a culture. Not because there's not some truth to Girard's ideas, but because they're incomplete. Right. And I think that what we see in Holy Week is the completion. Right. There is something of a scapegoat there. Obviously, Christ is both goats, as they say, on Lord's spirits. Right. But the focus, the focal point of all of that does seem to be, for me, in the tomb. And you could say the tomb that is a bridal chamber. That's the place where these things can actually join and cohere."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":3654.04,"end":3654.48,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":3654.48,"end":3654.88,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #230 - 2022-04-30 - Richard Rohlin - Universal History - The Bridegroom and the Scapegoat","start":3654.88,"end":3748.43,"speaker":"Jonathan Pageau","text":"All right, everybody. I think that's a great way to end. And so I wish everybody. I don't know when we're going to try to put that as soon. So for all of you that are on the Western calendar, I wish you a productive and a good Holy Week. And the same for all the Orthodox watching next week. You know, there's still just. Yeah, it's almost. There's just a little time left. And I know Lent has been hard for a lot of people, including me and including Richard this year. And so we pray for the grace to struggle through and and to all find ourselves in the glory of the of the Resurrection. So thanks everybody for your attention and we'll see you very soon. This episode is part of a series of discussions I've had with Richard Rowland on Universal History. You can find a list of all these episodes on my YouTube channel, or you can find them also in my podcast Stream from the Symbolic World on your different podcast platforms. Make sure to check out Richard's second podcast, which he hosts in collaboration with Father Andrew Damick, called Amunsoul, which looks at the relationship between Tolkien and orthodoxy. This podcast has also inspired in me some ideas for creating some images, whether it be the King under the Mountain, whether it be the Grail or beautiful Ethiopian traditions. I've created some products which you can find on my store, the SymbolicWorld store, and there will probably be more of those to come very soon, so stay tuned. This conversation is ongoing and there is still very much to explore in the Universal History."}
