{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":0.24,"end":15.76,"speaker":"Jonathan Pageau","text":"But I think at some point when we talk about reinsoulment and re understanding, we're going to have to flip the enlightenment adage. You know, when people say that, that magic is just misunderstood technology, I would flip that and say technology misunderstood magic."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":16.16,"end":24,"speaker":"Mary Harrington","text":"My governing theme for pretty much everything which is happening at the moment is that we're running the 17th century in reverse. So just hang onto your ha."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":37.5,"end":72.52,"speaker":"Jonathan Pageau","text":"This is Jonathan Petro. Welcome to the symbolic world. Hello, everyone. I am here with Mary Harrington. Mary is a writer. She was also with me on the at arc speaking about identity and AI and we had such a great conversation that we thought that we definitely need to dive deeper. And many people in the comments of the video have asked us to dive deeper into the question. So, Mary, thanks for talking to me."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":72.92,"end":73.96,"speaker":"Mary Harrington","text":"Thanks for having me."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":74.68,"end":89.72,"speaker":"Jonathan Pageau","text":"And so a lot of people really stuck on your vision of what this idea of identity that we have now, how it's kind of downstream from the notion of the soul and how in some ways it's a degraded idea of the soul. And so I thought it would be a good idea to maybe start with that."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":91.9,"end":600.35,"speaker":"Mary Harrington","text":"Yeah. So I can maybe I can tell the story backwards in terms of how I tried to make sense of it in those terms. So Ark commissioned me to write a paper on identity in the digital age. And I went round in circles for weeks trying to figure out what it was I was even talking about, because every time I tried to get my head around it, it felt like I was just nailing some jelly to the wall and it would just go and kind of slip away from me again. And there's this. The substance of it just felt nebulous. And eventually I did what I always do when that happens, which is to try and try and get a grip on it historically. Go and rummage around in the history and see if what people assume now is different to what people assumed at some other point and then try and understand it is through time. So I was like, okay, so have we always talked about identity? You know, is this a word? Is this a concept which is familiar and is durable historically? And it turns out that, no, not in the very least. It's actually very new in the. In the sense in which we use it now, which I guess we can dig into. This is this very nebulous sense of, you know, in a sense, it's the sort of meanness of me. That's what people mean when they say identity now. You know, my identity is. I identify as. And there are these. There are these ways in which it's sort of bound up in the idea, this idea that. Where identity is both a thing that we do in creating ourselves, but it's also the thing that we are in some fundamental way. And somehow those two things are not meant to be in contradiction with one another. I guess we'll probably find our way into that in due course. But this is actually a pretty new formulation. And the term identity in that modern sense doesn't really come into common usage, or at least if you trust Google's Ngram search for anybody who hasn't used Google Ngram, it's a tool that Google makes available with which you can do a keyword search on all the millions of digitized texts that they've scanned from libraries around the world, millions of them, over a span of centuries. I mean, they haven't done the scanning over centuries, but the texts themselves span a long period of time. And you can keyword search for the frequency of terms, which is a. I mean, it's a snapshot. It's a crude snapshot, but it's an interesting way of watching an idea come into. Appear or disappear over time. And identity, as in, comes into common usage in the 1960s. And I thought, whoa, that's actually pretty new. That's. That's less than 100 years old. So what were we talking about before? We were talking about identity. And then as I thought about it, I realized that identity is a. It mutates from the self, which is, in a sense, if identity is something that feels very nebulous and it's like. It's something that we do as much as something that we are. The self is itself kind of. Do you see what I mean about nailing jelly to a wall? You get very quickly tangled in kn. But the. I came to. And once you're onto. Once you're onto the ground of the self, actually I thought, oh, good, now, now I can find some serious academics, proper academics to help me with this. So. Brilliant. I've got Charles Taylor, who can help me with this. So, so I went, you know, this, this guy, this guy knows his onions. So, so I, I went. I went rummaging in Sources of the Self, which is, you know, the, the masterwork on this, this theme. And yeah, it's a, it's a substantial book. And in it Taylor looks at the emergence of the self, really in conjunction with modernity. And he traces it through the ideas of the early modern era philosophers such as Hobbes and Locke, and then the scientific theories of Descartes and through its evolution in the 18th century. And really the trajectory, what's clear in the sort of overall arc that Taylor is describing is that the transition, you know, the, the emergence of the self is concurrent with and very closely bound up in secularization. Just to say the withdrawal of the idea of, you know, that the, the usness of us is in any way bound up in spiritual matters, in our relationship with the divine, our relationship with the transcendent. And then I thought, okay, so actually there's a, what preceded the self. Then at that point, at that point you've got the thread right? So, so you go backwards again and you realize that actually what, what precedes the self is the soul. You know, the, the self is the secularized soul. This is a point that, that Taylor makes, you know, both implicitly and I believe explicitly. So you have this, you have this sort of three stage, three stage evolution from the soul, which is an ancient concept, to, to the self and, and from the self to identity. And at, at. Evolution is bound up in a shift in how we understand what people are and also in what we understand reality to be. This is, this is, and I realize this is why it's so disorienting because it really is a, it's a paradigm shift every time. And every time you go through the looking glass, it's very difficult to remember what, how things felt or even what things meant in the, in the previous, in the previous iteration. And the other thing that really, that struck me and that I found so interesting and so potent and so thought provoking that I'm still thinking, still processing. What it means is that in each of these iterations is bound up in an information revolution. So it's bound up in our, in our information technologies. So the, the emerge within, in the west, at least within the Western tradition, the, the idea of the soul really emerges in conjunction with literacy in the axial age. And then it goes through various classical and Christian evolutions and is elaborated by the early, early Christian theologians and becomes, you know, there's a whole for 1500 years of incredibly rich philosophy and the, on the, on the Christian concept of the soul. I'm not, I'm not so familiar with global, global religious, spiritual traditions, so perhaps you'll be able to help me out on that front. And then, and then with the, with the, with the printing press, the is the second stage of the information revolution, which initially prompts the Reformation and then in due course, if you like, the Reformation on the Reformation, which is the, the, the advent of secularism and the scientific mindset which is really, which is concurrent, roughly speaking, with the self as a formulation. And it's my contention, what I argued in the paper for ARC on identity in the digital age is that really the digital age is the age of identity because it's bound up in a further stage of information revolution in which we've set about technologizing ourselves. And the emergence of identity as a way of thinking about, as a way of framing what people are is inextricable from this turn towards, if you like, trying to perfect ourselves through the medium of our technologies, whether those are sort of transhuman interventions in our physiology, in our physical bodies, or sort of emotional technologies, such as, such as the therapeutic state, such as therapeutic practices, such as the various programs for self improvement, or indeed such as the various ways in which people use social media and self creation through online presence to construct. To construct an idealized version of themselves. And you can really see, I mean having. Having been extremely online for the best part of a quarter of a century now, you can really see how the idea of identifying as something escapes containment in the academy where it's sort of. It was a highly theoretical idea and the sort of post postmodern, post structuralist critical theory and become something that people genuinely believe they can do absolutely concurrently with the explosion of social media and this experience which then becomes really normalized for much. For people much younger than me. That your yourself is in a. Is in a sense it's the same thing as your online self. And I mean, and it stands to reason, it seems like perfectly just and legitimate thing from that perspective that if you can reskin your digital avatar, you should be able to reskin your meat avatar. Clearly that's the thing."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":600.59,"end":601.07,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":601.95,"end":646.97,"speaker":"Mary Harrington","text":"And so, so, so we have this, we have this very sort of rich and complex trajectory of evolution over. Over centuries, millennia really from the soul to the self to the, to identity and the, the just. Just to. Just to complete that. My argument has been that particularly in the face of the AI revolution, we are now, we're now at the point where we need to, we need to retrieve the concept of the soul because if we don't we to weather the, the AI revolution with, in any, with any sense of our own humanness and with any, with any capacity to, to get a grip on what it is that this, what. What it is these technologies are for and how. How we can use them well or, or foolishly."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":647.37,"end":650.13,"speaker":"Jonathan Pageau","text":"Yeah yeah, this is it folks."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":650.13,"end":790.93,"speaker":"Jonathan Pageau","text":"This might just be the culmination of my life's work. Join me for the symbolism masterclass this April 2025. During this course, I'll take you by the hand into the essentials and depths of symbolic thinking. Over six weeks and over 18 hours of lectures and Q&As in a concise and comprehensive way, I'll teach you everything about how I think, so that by the end, you might see the world anew. This class will not only be an introduction, but also a deep dive into a way of seeing that cuts right through our secular dead end. It reconnects the ancient religious ideas with some of the most cutting edge notions of complexity developed today. As the world is shaking and changing at an increasingly rapid pace. Being able to read the patterns of reality will give you an anchor and a solid sense of what is up and what is down. In this class we will talk about so many things. About heaven and earth, the sacred and the secular, the Bible, dragons, demons, fairies. We'll explore the surprising value of conspiracy theories, how symbolic patterns are found in movies and science, philosophy, art. We'll look at the relationship of symbolism to natural selection. We'll look at the basic patterns of the world of sacrifice, of the center, the margin, the masculine, the feminine, the mountain, time and space, left and right. It will be a synthesis of everything I've covered in the 500 YouTube videos that put out over the years and much more as well now, all in a structure that has one purpose, which is to make you a master of symbolic thinking. This is your opportunity to get to the core of what symbolism is, to ask questions, to test out your ideas, and to make sure you have a strong foundation of the fundamentals. Plus getting some hidden gems that I've never shared before. So don't miss out on the live experience and register today, of course, as usual, patrons at the involved level or plus get 10% off indefinitely. But also if you sign up before April 6th, you can get 15% off with the code MASTERCLASS1. And so I will see all of you in class."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":791.49,"end":1076.13,"speaker":"Jonathan Pageau","text":"I think what you're saying definitely tracks that. There's an interesting, there's a documentary, it's called Century of the Self. It's like, it's pretty long, it's like four hour documentary. And it talks about in some ways in the 60s, how this self care and this, this, this therapeutic self started to become very popular. And then people really embrace this idea of the, the therapeutic self. And I think that it makes sense to think of that also as the, the kind of, the beginning of, of identity, you know, in that sense, you know, but there's something about, there's something about the moment that I think in terms of recovering the soul, which actually could be useful because the idea of identifying with something is, is not completely ridiculous in the sense that, you know, there is, there are these external participations that I, that I participate in, right? So it's like I'm, I participate in my nation, I participate in my family, I participate in my group of friends or in a club or whatever. And those are things that I identify with, that I identify with a kind of higher participation. But that is not, that cannot be the reducible aspect of who I am. And I think that that's one of the issues that we're struggling with is that there's this weird Gnostic thing that's going on which people notice that they can identify and they're trying to. And there's a competition. There shouldn't necessarily be competition, there's competition with where it is that we should identify. And you can see it happening, you know, you can see it happening because the globalist types, they're pushing towards this kind of very, very, the kind of sexual and desire identification and also victim identification. And then the other side is saying, now we need to go back to nation. We need to go back to either ethnic identification or tribal identification. And those are fighting with each other, right? It's like, no, you can't identify as white, you can't identify as American. You can't, These are, these, and those types of identification are dangerous. Here are the ones that you need to identify with. And all of these are competing in a completely chaotic way. There's no sense of hierarchy, there's no sense of how it is that we participate at different levels in these, in these different identities. And there's also the Gnostic aspect which you mentioned, which is in some ways these are free floating, you know, because in an ancient world you would have all these things that you participate in, but they would be kind of structured coherently. And there is a kind of, you know, there's something to post modernity which isn't completely wrong, you know, which is this, this possibility of a kind of intertextual discussion where these different things are discussing with each other, but they're, they're in a hierarchy. What happened in postmodernism is everything becomes free floating. And so you have all this multiplicity, but they're not connected in any way. So the idea of gender, the idea that gender is important and that gender identification is important is not stupid. Like it is important, like for a person as they grow to realize what gender they are and then to participate in that, like to take on certain roles, to take on certain, certain, certain ways of being that, that function with their gender. But the idea that that's free floating from your body and that your body floats here and you have gender here and that these are completely unrelated and they can be either way, that is also the, that is also the, that I think is what the issue is. And so it seems like there's an opportunity though now to be able to help people see again this, I mean, we talked about the vertical in our, in our arc discussion and I think that's the idea of ensoulment or the idea of a soul is that is a kind of vertical thing that runs through everything. Because the soul is not just, it's not just like a. This is also an issue that happened in the modern age. People understand the soul is something that's in you. You know, it's like there's this spiritual thing that's inside you. But that's not actually how the ancients understood Cartesian fallacy. Absolutely, exactly. Completely. The way that they understood it is that it's the. That things are in soul. That is your being is in soul. That is it. It is, it has a vertical alignment which brings it together into unity and makes you able to, to kind of exist in that unity. And that's a far different, a far different way of understanding it. And so that return to hierarchy and kind of understanding that this vertical. It seems like it's possible now, but I don't know if it's possible to do it without God in the, in this time. Like, is it, you know, is it possible to do that without actually returning to a Christian vision? Or is there a way to, to talk about soul in another way at this point in the West, I mean."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":1076.13,"end":1262.92,"speaker":"Mary Harrington","text":"People who are not Christians manage to talk about the soul. I'm not one of those people, but I gather that it can be done. Just a couple of points. I mean, there are different ways of approaching this. I mean, I think ultimately the leap of faith is not something you can make on anybody else's behalf. That's just how it works. But there are different ways. There are different ways of coming at the question. And one that I found very fruitful just recently. Rather than, rather than sort of go going around the circle on whether or not people should go to church or believe in God or any of that stuff, which, you know, at the end of the day people are going to do what they do. Right? But one, one way of thinking about all of this that I found fruitful and that, that I found people will respond to in quite an open way, even, even if they're, they're ambivalent on some of the more sort of formally theological questions. Is, is think. Well, is thinking about. Actually this goes to a point on postmodern, that thinking about formal and final cause. I mean, you can take people through the way in which the arrival into modernity was inseparable from excluding formal and final cause from the reality paradigm. I mean, first it was excluded from the scientific method. The idea that something has a form which is ordered from the top down was just excluded. And okay, now we just look at how it works and we look at it empirically. And also the idea that something has a purpose, has a telos which is intelligible to us was also excluded from the scientific method in favour of just looking at what's the stuff that this is made of and what are the chains of events in which it participates in a much more, a much less richly meaning filled, meaningful way. I think in more colloquial language, what we're talking about here is meaning and purpose. I think those people are, people are perfectly, you know, these are perfectly intelligible terms to most people. You know, the idea, the idea that things have meaning and purpose is just not really part of the scientific paradigm. Right. You know, a chicken doesn't mean something, it's just a chicken. It's a biological system within the scientific paradigm. What's the purpose of a chicken? The purpose of a chicken is to chicken. You know, if you explain it to people in those terms, they're like, oh yes, it's going to chick, chicken's going to chicken. Right, that's fine. That's like perfectly sort of self contained. Yeah. And it will do so in, you know, in a, in a setting of, in a set of complex relationships with various other organisms and ecosystems and so on. And people are, people are very happy to think, are quite willing to think ecologically in that way. And then once you explain to people that there's an entire metaphysics that encompasses thinking in terms of formal and final cause and that actually if you refactor post modernism through that lens, it falls into place. And postmodernism isn't wrong, it's just mistaken to try and do semiotics in the absence of formal and final cause. You know, if you're only doing efficient cause and material cause, the whole thing becomes incredibly nihilistic incredibly quickly. I mean, it should be."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":1263.32,"end":1264.36,"speaker":"Jonathan Pageau","text":"It just becomes power."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":1264.84,"end":1323.72,"speaker":"Mary Harrington","text":"Exactly, exactly. There's no meaning there's only power. But the moment. The moment you reintroduce formal and final cause into a postmodern. Into the postmodern paradigm, it's like, oh, okay, so. So things can still be true. Like, so some things are more true than other things. This is clear. And some forms are more. Are more real than other forms. This is also clear because it's not just arbitrary and contingent and emergent from the. From the bottom. From the bottom up, whether you're talking about social systems or organisms or whatever, things are also formed, as it were, from the top down. And optionally, should you be that way inclined, you can also take that a couple of steps further and you can reframe a discussion of the soul in those terms as really, you know, in very much the classical sense, as the form of a person. Person. You know, this is. This is not. This. This isn't crazily controversial, and it's not the homunculus piloting the meat suit. It's just, you know, my soul is the form of me as understood from the top down in that sense."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":1323.8,"end":1324.16,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":1324.16,"end":1345.38,"speaker":"Mary Harrington","text":"And it's the purpose of me as well, you know, in the same way the chicken is. Chicken's gonna chicken. Mary's gonna marry. Because I'm. I'm ensouled as Mary, if you see what I mean. And I don't know, I. I feel. I feel pretty comfortable talking. You know, people aren't going to look at me like I'm a sort of insane preacher on the street if I. If I make this, you. The steps. And people are like, oh, yeah, no, yeah, I can go with that."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":1345.54,"end":1346.02,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":1346.02,"end":1347.98,"speaker":"Mary Harrington","text":"Or maybe not, but I know."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":1347.98,"end":1388.84,"speaker":"Jonathan Pageau","text":"I think. I think you're right, that what it leads to is in some ways that this idea of the hierarchy of goods that was, you know, that in the Middle Ages was, you see, in Dante, that you see in Middle Age thinkers. And I think that that is definitely. I mean, that's the way that I've been trying to talk about it, like, to help people see that that is something that is inevitable and that these. These purposes, they stack too. Right? They stack into each other. And so you can kind of see, you know, you can kind of see at certain levels what the purposes are, and then you can notice that they fit into these higher purposes. And especially if you bring them through the human perspective, which is. We can't avoid it. That is, as humans, we."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":1389,"end":1389.4,"speaker":"Mary Harrington","text":"We."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":1389.4,"end":1524.16,"speaker":"Jonathan Pageau","text":"We stand here and we. We. We live in the world. You can't. You can't have a way of seeing the world that is abstracted from human consciousness, that, that helps too in order, in establishing causes, like establishing formal and final causes. Because in some ways you realize that there's no reason to fully abstract yourself from the system. You have to see it through this perspective. What I mean is that when you say a chicken's gonna chicken, there's also the idea that the chicken is also the, the bird that makes eggs and that I eat especially a chicken of all animals because it actually now at this point has co evolved with humans, that it couldn't be, it couldn't exist outside of the human ecosystem. Therefore they're part of our purposes. Like we kind of see them through part of our purposes. And the same with even like, you know, the way the ancients would have understood it. It's like there are certain animals that are dangerous to us and that has to be part of their purpose. Like understanding that as part of their purpose. It's, you know, there are animals that can eat you and there are bacteria that can kill you. And that's part of at least how we kind of put the hierarchy of their purposes in, in, into, into the world. And what's funny about that, and I don't know if you've thought about this, but in some ways there's a sense in which, if you ride the kind of Darwinian argument to its end, you almost get a return of Aristotle. You get a return of purposes because if you say something like, say something very simple, which is the, the highest purpose of life is the persistence of being like something like that, you know, like at every level, right? So like the, the, the beings try to persist at every level and that's what it is. And then you end up again with a, you end up with a hierarchy of purposes. You can't avoid it. You end up with a hierarchy of forms. It just almost kind of gives it. And it's, you know, and you could say, well, those forms don't exist in a material sense, but who cares? Like they. And, and also you could say you can't find the telos from the, from the, you know, from the emanation of all these possibilities. But it doesn't matter because as conscious beings, we participate in those, in that purpose. Like we, we actually see them. Like we can see that eyes are foreseeing. The evolutionary biologist can tell us, well, there's no purpose in evolution. It's like, yeah, but also, yes, there is, because I know that eyes are foreseeing."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":1525.28,"end":1871.62,"speaker":"Mary Harrington","text":"And this is actually a point which I, which I brought into my, my reflections on identity and the digital age, which is, which is my, the second contention arising out of the digital age, which is that as well as bringing us to this sort of point of metaphysical crisis in terms of really asking us what in fact is a person. The other fascinating phenomenon which I've noticed really very strongly in recent years, and I imagine you will have done as well, is the way in which people who are habituated to reading online and to the way information comes at you online, are primed for the kind of pattern recognition which makes perceiving formal cause directly vastly easier than it is for people who are habituated to print. I'm sure you can understand what I'm talking about. I mean, I think it's not a coincidence that your line of work, your artistic line of work has really exploded back into the public consciousness and you know, the form of iconography, people are once again able to read iconography for what it is in a way which just wasn't possible at peak modernity because the people didn't think, people didn't understand that what that kind of art was for and what really it was communicating and thought. You know, if you're looking at a medieval painting, that the golden background was just because people didn't know how to do perspective, for example, not realizing that. No, no, no, no, that's not, that's not what they're saying at all. That communicates something entirely different. You know, you're just, you're completely misunderstanding the register here. But there's, but yet just returning to digital reading. I mean, I think the, if you read a book, you know, the, the argument is linear. It builds up over a long period of time. You need to hold a lot of ideas in your mind concurrently and sort of, as it were, you know, dwell with the mind of a single thinker. In order to engage with a long form, a long form non fiction book or a long form fiction book as well, you need to sort of dwell, dwell in the unified consciousness of a single individual over a linear argument that can span some considerable period of time. And then that long form argument will exist in your mind and it will dialogue in your mind with, you know, other long form arguments of a similar kind. And that forms a particular type of consciousness. I mean, this is, these are not original observations here. Other people have made the points much more eloquently than I could, but deep reading is absolutely foundational to the modern consciousness and all of the culture and political forms that flow from that. But digital reading is completely different. You know, and I say this as somebody who's been a bookworm since I was 4 and who's been extremely online for the last 25 years, you know, I have this kind of double strange, double consciousness now. But if you, if you consume content on the Internet, there's so much of it, it's just like a fire hose. And you stand there in this kind of fire hose of stuff that comes at you and some of it's just complete nonsense and gibberish or hate or craziness or whatever. And some of it, some of it's real gems and all you can really do is just stand there and trust in your, trust in your, your sort of whimsical ability to filter and to catch, to catch gems as the torrent comes at you and to make, and to make sense of it as it comes at you. And people, people attain, in the same way as people attain prominence as authors in the print age, people attain prominence as sense makers in the digital age just, just by virtue of being, being able or willing or foolish enough to stand in the fire hose and then, you know, catch things as they go by and assemble them into some kind of a coherent narrative for people who just don't have time or inclination to do that. And it's a, it's a, it's an evolution, if you like, of the author role, but it's a, it's a, it's a cognate of, of what, what an author does. But even people who don't do that are primed just by being extremely online and having, I'm sort of gesturing just to convey the fire hose thing at you. Even, you know, even people who don't want to be sense makers just get used to seeing ideas evolve in real time online. And I think the, the most vivid illustration of this is memes. You think of Pepe the Frog, who's a very famous one who evolves, who evolves at great speed and interacts with other memes and new, new forms evolve. And you know, there have been, recently there was the whole J.D. vance thing, which I thought was very funny. And then, you know, J.D. vance has cross pollinated with various other types of meme and you know, the Vansening has, has crossed, has crossed genres in so many different ways. And you, and you can watch something, you can watch something like that follow, follow a sort of, of a kind of conceptual arc over a period of two or three weeks during which a huge amount happens. I mean, you know, I guess some people are like, what on earth was that? But, but, but for other people really, it's, it's not, it's not a huge step from being able to watch an idea come to life and move and develop and sometimes have tangible effects in the real world. And then being able to perceive that, to be able to perceive formal, Formal cause in, for example, the, the being of a particular animal species or in. Or within ecosystems in the natural world, it's just. It's just not a very big conceptual leap. Right. Yeah. And similarly, it's not a great. It's not a very big conceptual leap to, from. From that. To understanding how, how ancient, how iconography of the type that you create works. Because, I mean, it's, it's. It's a. It's hopelessly reductive to describe what you do as, as creating spiritual memes, but in a sense, you're engaging in. In a kind of memeplex, which is vastly old, older than the Internet, and that, you know, requires, you know, huge amount of skill and devotion to work with, but it's an implex. And I think that's. And people, People just understand that instinctively in a way, which wasn't the case for a long time."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":1871.94,"end":1888.4,"speaker":"Jonathan Pageau","text":"Yeah, I think you're right. There's definitely something happening, and I've mentioned that often in terms of the Internet, that there's. It's. It's a dual thing that's going on. On the one hand, we're going towards this weird moment when people don't know who they are and don't know what."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":1888.4,"end":1888.68,"speaker":"Mary Harrington","text":"It's."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":1888.68,"end":1968.42,"speaker":"Jonathan Pageau","text":"What a person is, have no idea what intelligence is or agency, like they're just losing all of that. But it's also forcing certain people, at least a certain class of people, to actually realize exactly that. And so when you notice, for example, you can imagine that in a hundred. Few hundred years ago, a very wise person that meditated or prayed for very long times would be able to perceive these patterns that run through culture, and we'd be able to see them as being coherent and have formal causes, be able to see kind of the intelligence that runs through them, you know, even agency that runs through them. But now, because everything's accelerated so much, like you said something that an ancient person might have seen over a century by just meditating over certain patterns that they see happening over a century that would have been captured in things like astrology and different types of other ways of capturing that, now it's like a few weeks now. A few weeks. You see an agency runs through and it's like you can just see it. It flames and Then it vanishes. And so you, you. The idea that. That these have no, for example, the idea that these are just trying to reduce them and to try to understand them in a reductionist way is not useful because you're not understanding anything. You almost. You forced it to think of these as having a type of reality. That brings us back exactly to what you were saying, which is something like."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":1970.34,"end":1971.46,"speaker":"Mary Harrington","text":"I think that's absolutely right."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":1971.53,"end":1971.77,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":1971.77,"end":1989.57,"speaker":"Mary Harrington","text":"I think that's absolutely right. In a sense, it doesn't matter whether what we're looking at is an emergent property of multiple consciousnesses or thinking about similar things, or whether in fact it has an independent agency in its own right. It, in a sense, it doesn't matter because it, you know, it looks more or less the same either way."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":1989.57,"end":2005.19,"speaker":"Jonathan Pageau","text":"Yeah, but it's better to treat it as agency because that's the way you can understand it. Because trying to treat it as emergent properties of multiple intelligences doesn't help you deal with it. It's better to deal with it as a singular thing that's. That's running through. Yeah, right."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2005.19,"end":2006.47,"speaker":"Mary Harrington","text":"Right. Yeah, absolutely."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2008.07,"end":2049.38,"speaker":"Jonathan Pageau","text":"Thing that you said is perfect. Like, if you can say there is purpose in understanding this as a unitary intelligence that's running through bodies and that's kind of cohering them towards purposes, and there's a purpose in doing that, too. You don't. You can help people understand that the soul is not some magical thing that drops down. And like, you know, that, that you could. It's not, it's not, you know, ectoplasm or whatever nonsense that happened in the times of the spiritism. This, it is exactly what we're talking about. Seeing the purpose. It's seeing it come together. And that's even how the. That's how the church fathers, many of them, talked about it. You know, it's not like this is something that we're coming up with now. It's just that we lost the capacity to understand that for a while."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2050.1,"end":2066.08,"speaker":"Mary Harrington","text":"Yeah, yeah, I think that's. That's exactly right. And apart from anything else, it's. It's very much more succinct to be able to. To be able to describe something as an entity than it is to describe it. You know, otherwise, you, you know, I mean, you can do three paragraphs of throat clearing if you want to, or you can just say do. Sort of. Doesn't matter."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2068.16,"end":2094.01,"speaker":"Jonathan Pageau","text":"Hello, everyone. I am here to invite you to the Orthodox Arts Festival. Richard and I are going to come down to Dallas. It is on the first weekend of May. It is going to be an absolute blast. I will be giving a keynote. I'll be also participating in a Q and A. Richard will be speaking. I've heard that Justin Marler of Death to the World fame will be there talking about Death to the World things. And who else? Richard."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2094.49,"end":2096.89,"speaker":"Richard","text":"He'll be talking with Bishop Gerazim."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2097.77,"end":2098.57,"speaker":"Jonathan Pageau","text":"That's amazing."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2098.89,"end":2131.83,"speaker":"Richard","text":"Yeah, yeah. So that'll be super cool. Yeah. It's a festival. There's going to be a lot of. I'm going to be there speaking about writing fiction as an Orthodox Christian. We're going to have a concert from the St. Cassiani Chorale, which is sort of our local DFW area North Texas Pan Orthodox Choir. There's going to be food, there's going to be dance. It's going to be just a really incredible three days. So it is. It's the first weekend in May, so the second through the fourth. And you should come."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2131.91,"end":2132.63,"speaker":"Jonathan Pageau","text":"Where is it?"}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2133.27,"end":2143.83,"speaker":"Richard","text":"Yeah, that's a good question to ask. It's at Saints Constantine and Helen Orthodox Church, Antioch and Orthodox Church in Carrollton, Texas. So North Dallas area."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2144.56,"end":2173.89,"speaker":"Jonathan Pageau","text":"And so, I mean, so all the artists, if you are interested in Orthodoxy and culture, interested in either liturgical art or how Orthodox thinking, how the Orthodox symbolism can also be applied to other aspects of culture, this is the place to come. You know, we're hoping for a lot of wonderful, intelligent people to be there. So it won't just be us giving conferences, but we'll be around. We'll be involved in the conversation. You know, we'll be hanging out with everybody. And we hope that a lot of fruitful things will come out of this."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2174.44,"end":2186.12,"speaker":"Richard","text":"And there will be also children's activities on some of the days. So you can look at the website for that. It's orthodoxartsfestivaldfw.com all right."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2186.12,"end":2191.08,"speaker":"Jonathan Pageau","text":"Orthodoxartsfestivaldfw.com everyone, we cannot wait to see you there."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2191.4,"end":2192.12,"speaker":"Richard","text":"See you there."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2192.76,"end":2234.82,"speaker":"Jonathan Pageau","text":"In terms of the AI now, because this is the thing that's kind of pushing down on us. I mean, this is something that I didn't really have a chance to ask you, but I do want to know what you think, which is, you know, when I talk to the people that are making the AIs, or when we hear them speak, we. We hear, in the way that they talk about it, a great trepidation and fear that this is the most dangerous thing in the universe. We've heard Elon Musk say that, but other people involved in AI have said that. And the question I have for you Is why do you think we're doing this? Like what it is that's going on in us, why are we doing this? If even the people that are making the things understand how maybe the positive."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2234.82,"end":2265.66,"speaker":"Mary Harrington","text":"Maybe the positive intended outcome is that we really want to understand what the difference is between, between comprehension and calculation. You know, I think that would be, that, that would be a sincere, you know, that we want there to be a difference and we're just going to push the argument all the way until it forces the metaphysical issue that, that, that I think would be, would be a positive intended outcome of AI research. You know, can we, can we finally conclusively establish whether there's a difference between machine calculation and human comprehension?"}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2266.14,"end":2340.79,"speaker":"Jonathan Pageau","text":"Because one of the things that I'm thinking about, it's related to what you said, which is in terms of the problem of these floating identifications. Because in the AI, what you basically see is the extreme version of that, which is that the AI can capture or can run through intelligent structures, can run through patterns, but it doesn't have, have a connection to it at all. Like you can tell you about cats, but it cannot know what a cat is. It can because it doesn't, doesn't have, it doesn't care. It does, has nothing. You know, all. It's all a simulation. It really. A simulation in the sense that the language relationships have real structures. They're not, they're not fake. They, they have real relationships. But ultimately there's a, there's a complete disconnect with what it is we're talking about. And so it's like we're running the kind of structure list or even post structuralist element all the way to the core. Like we're bringing it all the way to the edge where we are looking at something that is representing meaning to us but has no connection to body. Like there's no connection to the thing that gave rise to these structures in the first place."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2341.19,"end":2409.73,"speaker":"Mary Harrington","text":"Yeah, I think that's right. I mean, in a sense where I find it, in a sense it's not, in a sense, it's not intelligent, it's not understanding because it's always retrospective. The pattern recognition is always retrospective. You know, it can make inferences about what the pattern might be, but not on the basis of any actual understanding, not on the basis of any comprehension. All it can really do is make predictions based on the existing model that it has. It's not actually seeing or understanding or making inferences based on them. Yeah, it's not, it's not based on comprehension. I think A few things sprang to mind while you were talking about the sort of terror of AI and the various different ways that people talk about or express that fear. And there's a couple of reflections on that. One of them is one of the conversations that sort of sloshes around these quarters is whether or not is machine super intelligence. I should just say I just don't believe that's ever going to be a thing. I just don't, I don't believe, I don't believe AGI is possible because I think it's just a category error."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2410.37,"end":2411.45,"speaker":"Jonathan Pageau","text":"Yeah, I think that's right."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2411.45,"end":2621.7,"speaker":"Mary Harrington","text":"But, but another of the, another of the possibilities that sloshes around in these, in these discourses is that, you know, machine super intelligence maybe not, but demonic superintelligence manifesting via machines, maybe. Now I don't know about that. I don't really have a firm view either way, but I know that that's one of the, that's one of the discourses that, and it's certainly true and actually some tracks in terms of the other sort of aspects of digital re. Enchantment we've been discussing that as Rodrigo has pointed out in his recent book, there is a very strong occult streak in the cutting edge of Silicon Valley. There are people who are, as they understand it, in contact with extraterrestrial intelligences in order to, to download, as they say, new scientific information. I mean, who knows what's going on there? You know, whether they're just accessing subconscious intuitions or whether they are actually communicating with some kind of other worldly intelligence, I have no idea. But, but really just to make the point that the, the boundary between the kind of re. Enchantment that we're discussing and the hyper rationalist aspects of that, of that technological world really are very porous and I think with good reason because what we're talking about here is a convergence of technology and theology and a much more open way. And the, and the, the final point, just to kind of stick a pin in that a little bit that, so, so, so that, that for the esotericism of, of the, the AI conversation. But also I, I wonder often when I hear these, you know, it's very, it's fun and interesting and sort of exciting and a bit, ooh. To go down these, these kind of, you know, the, the kind of, the, the sort of Gnostic horror story rabbit holes and there are, there are very, there are a great many of them. But, but I often wonder whether, you know, that's a little bit of a distraction from where actually the real threat of artificial intelligence lies, which is in very much more concrete, substantial applications. And just to draw an analogy there, which maybe helps to explain what I'm talking about, in the 18th century, the various inventors created for the time incredibly lifelike automata. There was the mechanical turk hoax and there was a duck which supposedly actually defecated, but was actually made of clockwork. And there are few beautifully engineered, incredibly intricate automata which, which sort of thrilled people at court and everyone was very excited about them. And the Vanson who was one of the inventors who created these things is he's famous for having created these automata. But actually the, in the, the inventions of his which were more influential in terms of changing the world were. Were very much more mundane innovations which powered the industrial revolution. And I think that's really how we should be thinking about artificial intelligence as well. Not in terms of some sort of super intelligent thing or a channel for demons or whatever. Although, yeah, I mean, who knows? But, you know, but, but actually, well, concretely we should be thinking about, you know, what, what happens. What, what happens when autonomous robots are normal in war? You know, I think those are what happens, you know, how, how is this going to change everyday work for normal people for, for the little guy? And there are concrete policy and human questions which, which we could be thinking about in a much more granular way in a. And in a much more practical way. And in a sense, I think, I think the sort of the AI, you know, the, the AI God apocalypse is a way, is a way of avoiding having to think too concretely about that."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2622.18,"end":2738.63,"speaker":"Jonathan Pageau","text":"No, but there, there are connections between the two way of seeing them. One, one of them is captured mythologically. When you think of the idea of, of the AI being like a big Ouija board, you know, like a, that's kind of, that's kind of taking our collective intelligence together in order to catch something. To catch some, something that we had. Not that we can't think of individually, you know. And that is not a completely ridiculous. You know, that's probably how our Ouija board functions, right? It's like there are some aspects of us, if we come together the same way, that you can have teamwork. Like when you, when you have teamwork, you have something more that appears when people are working together. And so Ouija board does that in terms of meaning and is trying to kind of catch something that, that, that is more than the sum of the parts. And the AI can definitely do that. Now the, the story of the genie and the Lamp is the best way of kind of understanding it. Because what the AI does is it adds power. That's the best way of understanding it. It's adding intelligent power to something. And because the AI is not agentic itself, it doesn't. Like you said, there's no such thing as there won't be AGI, because it doesn't care. It doesn't have a wish. It is. It. It takes our wishes, right? That's the idea. It's like it actually amplifies the desires of, of people. And that is, by the way, related to the demons. So that's how we understand demons in the Christian tradition. We understand demons as cosmic versions or like cosmic, cosmic kings or princes of things that make us go awry. Right. So we have, in us, we have an aspect like, let's say, anger in you. And there's a cosmic aspect of that. And that cosmic aspect is the one that is beyond my individual manifestation of it. It's a. It's a cosmic version. I don't know what to say. It's like it's anger itself. It's the. It's anger in the way that it. That it parasitizes on humans. And, and the idea that that's not happening in A.I. it's like, well, that is what A.I. is doing."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2738.7,"end":2738.9,"speaker":"Mary Harrington","text":"Doing."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2738.9,"end":2740.62,"speaker":"Jonathan Pageau","text":"Like it is exactly doing that."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2740.86,"end":2743.18,"speaker":"Jonathan Pageau","text":"And, and the, the genie and the."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2743.18,"end":2744.7,"speaker":"Jonathan Pageau","text":"Lamp is a great example because one."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2744.7,"end":2772.03,"speaker":"Jonathan Pageau","text":"Of the things that happens with demons is that they give you what you want, but they don't let you see the side effects or they don't let you see that. If I add power to this desire you have, then all these other things are going to come with it. But that you don't know what they are yet. And, and it's a kind of blind. It's kind of. It's. You're blinded by desire. You're blinded by your. And that's also the thing that AI is doing all the time, is that it's actually adding infinite power, like the genie's lamp, to our desires."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2772.03,"end":2775.11,"speaker":"Jonathan Pageau","text":"But we don't know what those desires."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2775.11,"end":2813.84,"speaker":"Jonathan Pageau","text":"Lead to because we are only focused on what it's giving us now. We're only focused on the mammon. We're only focused on the money or on the increase in power, but we don't see the side effects. And as we increase it, the side effects just get. Just keep getting bigger and bigger. And that, I mean, that is. Is so, I think the idea. There's a connection between the demonic aspect of the idea that AI could be something that's catching demons and trace mythologically and just technically understanding what AI is doing to our desires and to our wishes and how it's, how it's capturing them and increasing in their power. I think it's, it's a, it's a coherent, it's a coherent connection."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2814.32,"end":2819.36,"speaker":"Mary Harrington","text":"I found myself coming back again and again to Goethe's story about the sorcerer and his apprentice."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2819.91,"end":2820.23,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2820.71,"end":2914.16,"speaker":"Mary Harrington","text":"In a sense catching the two sides of the digital revolution. You know, on the one hand it does the sorcerer who seems to have this kind of magical capacity to control, you know, and just, you know, things happen by magic. You know, I can, I can go for a run around a city I've never been to before and, and my, my headphones will tell me which direction to take next because transmitted from my phone via satnav and it's. And you know, it might as well be mad magic. And there's this incredible sense of frictionless. You know, I can travel from, I can travel thousands of miles through the air without ever taking my purse out because I just do everything via my phone. Beep, beep, beep. You know, there's a, there's a very sort of magical and very really intoxicating sense of, of frictionless control. And then the other side of it is this sort of infinitely ramifying chaos as the apprentice has a go at casting the spells and then he doesn't quite know how to stop them and then they multiply and they concatenate on themselves and then, I don't know, you have planes falling out of the sky because some, some, something has gone wrong with the system somewhere or you know, and that's had a knock on effect with some other system somewhere else. And nobody really knows quite how to, quite quite how to unscramble whatever it is that's got scrambled or you know, you set a meme in motion that causes a revolution halfway around the world three years later because, because complicated things have changed or whatever. But somehow, somehow there's a sense that this frictionless control also produces a dividend of very uncanny chaos. And the two, the two I think really together in a, in a way which is just the new normal and we're just going to have to get used to it."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2914.24,"end":2933.28,"speaker":"Jonathan Pageau","text":"Yeah, but I think at some point when we talk about reinstallment and re. Understanding we're, we're going to have to flip the enlightenment adage. You know, when people say that, that magic is just misunderstood technology, I would flip that and say technology misunderstood magic. You know, it's like the magic shows you the purpose."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2934.16,"end":2942.15,"speaker":"Mary Harrington","text":"My governing theme for pretty much everything which is happening at the moment is that we're running the 17th century in reverse. So just hang on to your hat."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2945.83,"end":2947.79,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah. That makes a lot of sense."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2947.79,"end":2951.43,"speaker":"Mary Harrington","text":"Well, this is why the Puritans are all turning Catholic."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2951.83,"end":2952.43,"speaker":"Jonathan Pageau","text":"Yeah. Yeah."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2952.43,"end":2954.47,"speaker":"Mary Harrington","text":"Because they're running the 17th century in reverse."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2954.71,"end":2961.19,"speaker":"Jonathan Pageau","text":"That is an interesting. Yeah, the JD Vance is. Is a kind of a little image of that, of going back to. Going back to traditional Christianity."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2961.35,"end":2969.57,"speaker":"Mary Harrington","text":"So the republics are turning into monarchies, the Puritans are turning into Catholic Catholics, and all of the nation states are dissolving back into empires. It's going to be. It's going to be a bumpy ride."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2972.93,"end":2978.57,"speaker":"Jonathan Pageau","text":"Yeah, we might. All right, Mary, this is wonderful. Thank you so much for your time. I really appreciate it."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2978.57,"end":2980.21,"speaker":"Mary Harrington","text":"Thank you. This has been such a pleasure."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2980.53,"end":2982.45,"speaker":"Jonathan Pageau","text":"All right, we'll talk again. Bye, bye."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2982.69,"end":2983.33,"speaker":"Mary Harrington","text":"Bye, bye."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2984.69,"end":2989.77,"speaker":"Jonathan Pageau","text":"If you enjoy these videos and podcasts, please go to the symbolicworld.com website and."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2989.77,"end":2994.22,"speaker":"Jonathan Pageau","text":"See how you can support what we're doing. There are multiple subscriber tiers with perks."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2994.3,"end":2996.22,"speaker":"Jonathan Pageau","text":"There are apparel and books to purchase."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2996.38,"end":2998.58,"speaker":"Jonathan Pageau","text":"So go to the symbolicworld.com and thank."}
{"episode_id":"SW - #388 - 2025-04-23 - Mary Harrington - Identity After Postmodernism","start":2998.58,"end":2999.82,"speaker":"Jonathan Pageau","text":"You for your support."}
