{"episode_id":"SW - #332 - 2024-03-19 - The Garments of Skin","start":0.24,"end":2084.92,"speaker":"Jonathan Pageau","text":"Esau steals the garments of skin and then is chased for so long that he is completely exhausted and completely famished. And so he bursts into Jacob's tent and he trades his birthright. But now, in the context of our story, what is Esau's birthright? And this is, of course, where we could kind of push these things further, because Esau's birthright in this context is the garments of skin. Why? Because Esau is in some ways something of Cain in his approach in the what? He is as being the older brother, as being the older brother that wanted to kill Jacob, but he's also the descendant of Seth. And so by stealing the skins back from Nimrod, he is taking back his birthright. But immediately he, because of his weakness and because of his excess and because he's a passionate person, then he immediately gives up his treasure for something as immediate as his belly. This is Jonathan Peugeot. Welcome to the symbolic world. So, hello, everybody. Today I want to tell you a story. It's usually not the approach that I take, although I talk about stories all the time, but telling my own story and telling aspects of my story is not something that I delve into too often. But I thought it would be interesting to look at. You know, sometimes I know some people have written me or have talked to me and told me about their own experiences and their own kind of discovery of the symbolic world. And so I thought I could take you on a little bit of a trip to see how the idea, the ideas that I deal with enter the symbolic world, as well as that which led me to orthodoxy, but also that which also led me to write with my brother, God's dog. And some of the ideas that are behind it all kind of come together in a specific image that I've talked about so many times on this channel, which is the garments of skin. The garments of skin are surprisingly. Or understanding the garments of skin are surprisingly one of the big things that actually led me into orthodoxy. And I would say it started when I. With postmodernism, that is, that in the work of the postmodernists, I especially Jacques Derrida, talked about the idea of the supplement and mentioned this notion of the problem of the supplement, and how he reads that in Plato's Phaedra, where Socrates talks about the problem of writing and of writing as a supplement to meaning, a supplement to intelligence. And then Derrida goes into this question of supplement as the notion of pharmakon, that is the supplement, but pharmakea, that is the medicine or the Drug that which is a supplement in the sense of eating. And all of these questions and how he deconstructs this problem of the limit between the inside and the outside using the question of the supplement. And so I was really troubled by that, or let's say affected by that question, because it seemed to have to do with this question, the problem of what was happening in the world already when I was in my 20s, about, you know, what was going on in terms of postmodernism and this obsession with the margin and this. This kind of obsession with transformation and change and strangeness, all of that, because I was also fascinated by that stuff as someone who is studying art. And so one of the things that happened, of course, as I was kind of approaching orthodoxy, is I read this book, which is the Life of Moses, which I've mentioned many, many times on the Channel, which is an astounding book about the ascent of Moses up the holy mountain, this entering into the divine darkness and discovering the pattern of the tabernacle. But there's a process, as here moves, where St. Gregor of Nyssa talks about the removing of the garments of skin. And he makes these amazing analogies between the garments of skin and foreskin and the stranger, you know, all of these added elements or these elements about that which is outside. He does all these wonderful things with the analogies and talks about how you have to remove the garments of skin, you have to remove this outer aspect, right, the foreskin, how Moses kills the stranger, the Egyptian. You have to remove this outer part in order to attain the divine darkness. But even in reading that, there was something about that that I thought rang very much true, but there was also something more. And I had the intuition there was something more. And it's interesting, when you have these questions, these deep questions in your heart, all of a sudden things pop up in your life, right? Things kind of just manifest themselves. And this is something that I've experienced many times where, you know, it's as if you almost have to just reach your hand out, and whatever it is that you grab is going to be the thing that will answer your question or the thing that will bring you further on that line. And so, you know, this was. Now we're in 2002, so quite a long time ago. And I was reading and I was struggling, and I started to take some classes in orthodox theology. Although I wasn't orthodox yet myself, I was still a catechumen. And in my search and in my questioning, I came upon this book called the Deification in Christ by Panayotis Nellis. And in this book, there is a chapter called the Garments of Skin. And so very interesting. I fell right into it. You know, it's interesting because I. I picked up the book at a bookstore, and I didn't notice, you know, what. What the person there just told me, that it was a great book for orthodox theology. And I fell right into the second chapter. And at that moment, I didn't read the first chapter, and I didn't read the third chapter right away. I just read the. This chapter on the garments of skin. And what he does in this book, which is astounding, is that Panaiotis shows us how, in fact, there is also a positive aspect to the garments of skin. That is that there is a sense in which that which is added, you know, that which is added is not just negative because it's also the law. It's also the notion of marriage and of all social institutions, the city. All of these things are this supplement, this addition of death that fights death. And so, you know, in kind of a counterpoint to St. Gregor of Nyssa, who tends to present the garments of skin as something quite negative, although there is a secret suggestion that they're not. Because in the pattern of the tabernacle, St. Gregory, Moses discovers that the garments of skin that are added to the tabernacle. And St. Gregory of Nyssa talks about the crucifixion there, but, you know, nonetheless, he mostly described them as negative. But in Panionis Natalis, he talks about how they are also this positive thing in some ways, like the power of civilization or the power of externality. And so I was really fascinated by this question. And, you know, once again, it's one of those very strange things that happens where, you know, for some reason, I was reading all kinds of things at the time, and I had this strange intuition, and I don't know completely where it came from, but I had a strange intuition that I had to look in the Book of Jasher, and I had the Book of Jasher, and I had a lot of these apocryphal books, like the Book of Jubilees and all of these books. I was able to get some copies of them. And so I had this intuition to look in the Book of Jasher about this question. And so I'm kind of going through the Book of Jasher, and I'm reading the Book of Jasher, and I come on to Jasher, chapter seven. And so for those who don't know, the Book of Jasher kind of goes through the. Goes through Genesis and fills in the blanks. And the reason why I've been talking to you right now is because Richard Rowland sent me a message that the other day where he saw this text again. And it reminded me of how in 2002, I had fell upon this text as I was asking myself this question. And so in the Book of Jasher, chapter seven, it says, and the garments of skin which God made for Adam and his wife, they went out of the garden. When they went out of the garden, were given to Cush. For after the death of Abraham and his wife, the garments were given to Enoch, the. The son of Jared. And when Enoch was taken up to God, he gave them to Methuselah, his son. And at the death of Methuselah, Noah took them and brought them to the ark. And they were with him until he went out of the ark. And in their going out, Ham stole these garments from Noah, his father, and he took them and he hid them from his brothers. And so when I read that, I was astounded, because here was a mythological version about what it is that the garments of skin meant. It's like, I'm not sure if St. Gregor Venissa might have had access to these traditions. Maybe not. Who knows? But St. Gregory really has the right intuition and understanding this idea of this power that is related to the garments of skin and this externality which is related to the garments of skin, because in the tradition, they. There is this sense in which the garments of skin are like this relic that are passed down from generation to generation and brought all the way into the Ark and are related to the sons of Cush. Now, the sons of Cush are those that built the Tower of Babel and are ultimately the ones that would lead to Canaan and the idea of the Canaanites in the land that Israel is going to take. And so it's like, I was really amazed by this idea. And so at the time, in 2002, I wrote a text called the Garments of Skin that I wrote for a class that I was taking, theology class that I was taking at the time with a teacher named Professor Simeon Roger, who was teaching dogmatics. And I wrote a text on the garments of skin. And I remember that it completely surprised him. He gave me a very high grade. And he. He wrote in the comments, where did you get the idea of writing about such a thing? And so just for the heck of it, what I'm gonna do is I'm gonna put a link in the description for those who want to read that old text from 2002 all the way back then. And see what I was thinking back then and how so many of the things that I talk about right now were already being developed in 2002. Because in that text, I talk about St. Christopher already in 2002, and about the idea that the Dogman Christopher, you know, is related to this question of the garments of skin. So this, of course, brings us to God's Dog. You know, for those who have read the first book of God's Dog, you've already seen a glimmer about what it is that all this question of the garments of skin, how it comes together. But for those who haven't, we're going to go. I want to go through the first pages with you to see what it is that's going on. And it'll help us understand also how we can integrate some of these traditions into storytelling in a manner that also helps people see what the meaning of these traditions are. And so, you know, in our version of God's Dog, we start in Genesis, in book one of God's Dog, where we, you know, there's this legendary part of the story that isn't. That isn't part of the main story, but it's like the backstory that appears to help people understand what's going on. It says on the sixth day, God created man. Authority was given to him to rule over the beasts of the world. But one of the beasts tricked him and he fell, and man was made subject to death. So then we see a virgin already. You know, I had been developing this very long time ago of the image of everything, where you see this image of the Garden of Eden, you know, with Adam and Eve that are being chased from the garden. So he was banished from the center of the world and forced to wander in the wilderness. And so they go down the hill wearing the garments of fig leaves and run into the thorns. So because they run into the thorns, they encounter the cherub. But then it says that God took pity on man. He showed him a way to stop the fall, to survive in the world of death. He offered him a gift with mysterious powers, the garments of skin. But this gift was both a blessing and a curse. And then it says the skins of Adam were handed down from generation to generation. With their power, man has kept death at bay, pushing back the limits of darkness, postponing the end. The skins of Adam were handed down from generation to generation. They have to be handed down until the end of the world, when the serpent is defeated and the world begins anew and so you get the idea that basically the skins of Adam had to be handed down generation to generation. And a lot of people, you know, when they read book one, they thought that we were, of course, making this up. But we are not making this up. These are taken from these traditions. But the way in which my kind of insight and our insight into this idea of the periphery and the. The role of the periphery that both Matiri and I had at the time, you know, got kind of crunched together. So by the time that we wrote the story of God's dog, it all got brought into this mythological form in a way that hopefully will help people understand what are these garments of skin? What is this power of the margin and the power of the periphery that is being brought about? Now, there's another part of the story in the book of Jasher, it says that, so Ham steals the garments of skin from his father, Noah. And it says that. And when Ham begat his firstborn Cush, he gave him the garments in secret. And they were with Cush many days. And Cush also concealed them from his sons and brothers. And when Cush had begotten Nimrod, he gave him those garments through his love for him. And Nimrod grew up, and when he was 20 years old, he put on those garments. And Nimrod became strong when he put on the garments. And God gave him might and strength. And he was a mighty hunter in the earth. Yea, he was a mighty hunter in the field. And he hunted the animals, and he built the altars, and he offered up upon them the animals before the Lord. And Nimrod strengthened himself, and he rose up from amongst his brethren, and he fought the battles of his brethren against all their enemies. Roundabout. And so this idea that, you know, that the garments of skin are passed down to Nimrod, who built the Tower of Babel, really shows you this. This powerful image of how the garments of skin. And he's a mighty hunter before God, that he's powerful because he puts on these garments. And you can see that these garments are kind of becoming this image of a strength kind of like Samson's long hair, right? The idea of this hair, this thing that is on the outside, is really this power that is being added. And that on the one hand, Nimrod is a hunter, and so he is able to defeat the animals. But he's also a builder of a great city and a builder of a great civilization and ultimately a tyrant, you know, in the end, because he, you know, he overdoes the civilizational aspect in a manner that becomes excessive. And. And so I'm going to show you a little peek of book two of God's Dove, because I'm so excited about how we kind of brought all this together. Here you can see, of course, Adam giving the garments of skin to his son. But I'm not going to show you what happens, because there is a part that we. That we took away. You'll see it in the book, but I'm not going to show it to you right now. But obviously, his son Cain, who received the garments of skin, when he kills Abel, he loses them and they are given to his brother. So when Cain kills Abel, of course he loses the garments of skin, and so they are given to the third son, Seth, who represents a kind of restoration of the line. And so you can see here how Seth, you know, gives the skins all the way down to the different people and down to Methuselah. And so you see Methuselah, the old man who's sitting in a wrecked world where everything has been destroyed. And so he brings Methuselah, brings the skin, the skins, to Noah, who is building the ark. And you see, of course, the daughters of men and the sons of God bringing about the problem of the giants. And then, of course, the flood, skipping a few pages because I don't want to show you all the mysteries. These beautiful, amazing pages are all drawn by Jesse White and colored by Matt Kratz. And so we see the end of the flood, and after the flood, we see our friend Ham here, who is coming down into the settlement. You can see the ark up on the little mountain up here. You know, in the second page, which is kind of shining, he goes, of course, into the tent and he steals the garments of skin. And so we obviously wanted to have the idea that he steals the garments of skin when he sees his father naked, and then he is able to leave with those garments of skin as he is being exiled. And so all of a sudden, the image of the exile and the image that Ham is exiled from the world becomes also an image of why it is just like why Cain built the city, why it is that Ham is also going to build the. His descendants are going to build the great city because they are exiled. And just like Cain's descendants, they have to now cover the world with power in order to protect themselves in their state of exile. And so Ham repeats that in his story with his descendants and who become the. Who ultimately lead to Nimrod. So we also obviously show the descendants of Ham moving forward until we get our friend Nimrod, who. Who now wears the mark of Cain here on his vestment. If you remember seeing the book, one of God's dog, they wear this dark mark, which is the mark of Cain. And here it is that he is identifying with Cain as a great city builder and as the one that is owed and should have the garments of skin. So here we see our friend Nimrod holding up the garments of skin in his power for the building of the Tower of Babel. Now, of course, that doesn't last. The tower gets destroyed. That's because there is another part of the story which appears in the Book of Jasher. And this is where it gets really interesting. And so this is also will help you understand how tradition works and how sometimes you don't say things or you hint at things, and that leaves up an interesting space that opens up for other people to also step in to that space. And so, you know, for example, we brought about the idea that Ham steals the garments of skin from Noah when he sees him, and naked, he takes his garment away. And so that's not said in the text. It doesn't say that in the text in Jasher, but it makes complete sense in terms of understanding how stories come together, that he would have taken the skins from his father when he went into the tent and took his clothing away. Just took the clothing away in order to discover his nakedness, you could say. And so in the book, in Jasher 27, the story continues, and it says, and when Esau saw the mighty men of Nimrod. So now we're talking about Esau, the son of Isaac and the brother of Jacob, right? The. The firstborn of Isaac. And it says, and when Esau saw the mighty men of Nimrod coming at a distance, he fled and thereby escaped. Sorry, I forgot a part of the verse. It starts and says that Esau kills Nimrod. And so Esau sees Nimrod and he kills him. And then all of a sudden, his men, mighty men. Who doesn't say that they're giants? But the mighty men of Nimrod are coming at a distance. And so Esau flees and escapes. And Esau takes the valuable garments of Nimrod, which Nimrod's father had bequeathed to Nimrod, and with which Nimrod prevailed over the whole land. And he ran and concealed them in his house. And Esau took those garments and ran into the city on account of Nimrod's men. And he came unto his father's House wearied and exhausted from fight. And he was ready to die through grief when he approached his brother Jacob and sat before him. And he said to his brother Jacob, behold, I shall die this day. Wherefore then do I want the birthright? And Jacob acted wisely with Esau into this matter. And Esau sold his birthright to Jacob, for it was so brought about by the Lord. So, super interesting. So basically, Esau sees Nimrod out in the wilderness and then kills Nimrod so that he cuts his head off in the text. Forgot to put it in there. But he kills Nimrod, and then he encounters the mighty men of Nimrod. What do we mean by these mighty men? Super interesting. He has to fight them. He has to run away from them. And he takes Nimrod's garments. Now, in the text, it doesn't say that it's the garments of skin doesn't say that. But it also doesn't have to because it says the mighty garments by which he ruled the kingdom. And back in Jasher 7, it says that, you know, it is by putting on these garments that he became very powerful. And so there's this, like, suggestion, hint that isn't quite made explicit in the text, but that it is in some ways our possibility to then take this and kind of take it that one step further in order to help people understand why what it is that's going on in the story. And so what is it that we do in the. In God's Dog? So here we see our friend Nimrod, who is moving away from the destroyed Tower of Babel because of his excess. And so now he is hunting, and he's hunting this lion. And Jesse does, like, this amazing job at drawing Nimrod, killing this lion, you know, wearing the garments of skin as a kind of cape around, you know, on his back. So he kills the lion very dramatically. But there in the shadows, you know, behind is this strange character in the darkness. Who is it? Obviously, it is our friend Esau. And Esau kills Nimrod. Now, we had him shoot Nimrod with an arrow. It's different from the cutting of the head off, but it's has to do with the spearing of the serpent and something which will also have to do with other images that will appear later in the story. And so he shoots Nimrod through the heart. And then he takes the garments of skin. And when he takes the garments of skin, he flees away from the mighty men. And now we know who those mighty men are, because Nimrod is a giant, and so are the mighty men. And this is, of course, a tradition we've talked about, how, you know, the idea that Nimrod, although he's after the flood, is a giant is one which is attested to in many, many traditions. And so in the Book of Jasher, it doesn't say that explicitly, although by calling them mighty men, it's hinting at that. And so now we can bring it all together. In the story, Esau steals the garments of skin and then is chased for so long that he is completely exhausted and completely famished. And so he bursts into Jacob's tent and he trades his birthright. But now, in the context of our story, what is Esau's birthright? And this is, of course, where we, you know, where we could kind of push these things further to. Because Esau's birthright in this context is the garments of skin. Why? Because Esau is, in some ways something of Cain in his approach in the what he is as being the older brother, as being the older brother that wanted to kill Jacob, but he's also the descendant of Seth. And so by stealing the skins back from Nimrod, he is taking back his birthright. But immediately, because of his weakness and because of his excess and because he's a passionate person, then he immediately gives up his treasure for something as immediate as his belly. And so he sells his birthright to Jacob. And so, you know, what I wanted to show you is just how it is that we can take these legends and these stories and how it is, once you understand that when you enter into the language that they propose, how you can find ways to even add little steps to them, like even kind of hint or push or nudge a little further so that the story becomes more understandable. And that is, of course, what it is that we're doing in God's Dog, because we're going to take a lot of these. This is the garments of skin. But there are other traditions that will be part of it. And by connecting them together through this story, which is fictional, ultimately, we will nonetheless be diving deeper into these traditions than many people have in the past and helping bring about these images together in a way that will help you understand them. And so in the tradition, the garments of skin pretty much end there. It's like, if there are other traces of the garments of skin in the tradition, the apocryphal tradition, I don't know where. I have never seen them. But in the Bible, there are still garments of skin that are there. And so it's interesting to then go back into the story and then bring those out once again. And so here we have our friend Elijah, who is sitting in the cave wearing now the garments of skin, because in the story of Elijah, it says that he wore a hairy garment. And, you know, when now Elijah is taken up into heaven and drops his garment down to Elisha, then it appears as, again, a kind of transmission of the garments of skin. And so it's like going into this story and teasing out the elements that are connected to the meaning of what it is we're doing. And so. And it's not arbitrary, because that which he gives down to Elisha is his power, you know. And so, you know, Elisha asked for a double version of his blessing, like a double version of this kind of glory or power that Elijah had. And then you can take that all the way up to where, right? You can take it all the way up to maybe John the Baptist, maybe further. And that's what we're doing. And so by the time we get to our story, we have, of course, St. George, who is the guardian of the skins and has them as a continuation of all these traditions that are found both in Scripture and in the book of Jasher, and represent, just like St. George, by the way, St. George is the. The word George means the agriculture, the agriculturalist. That's what the notion of St. George comes from. And so St. George, with his red hair, as an agriculturalist and as a representation of Rome itself, becomes, of course, another version of Cain. Now in this case, a positive version, but nonetheless related to the very same symbolism that we find in the early images of the question of the garments of skin and also the question of spearing or of killing, you know, the other. And so in. In, of course, in our story, we have him spearing his brother just like George is spearing the dragon. Of course, it's. It's not the same meaning, but it's structurally the same. So this can help you understand a little bit how it is that symbolism can function, why it is that the garments of skin are. Are so important to me. They're right there at the very beginning of my introduction to Orthodoxy, and they've been with me all along to help me kind of understand the world in which we live. This kind of world of the fringe, the world of chaos, the world of the edge. And so, you know, don't forget to read that early text if you're interested in seeing to what extent St. Gregor of Nyssa and the garments of skin were there right at the beginning of my journey towards the Orthodox church. And please, if you can, do not forget to back God's dog. There's, you know, like a just a few days left and we really want to tell the story. You'll notice that it's already becoming more epic and as the books get go further, it's going to become more and more epic. And the art is absolutely ravishing. Both the art by Jesse White and by Matt Sheehan. So please, if you can go and back God's Dog Kickstarter today. Thanks everybody and I'll talk to you very soon. In 2021, my brother Mathieu and I, with the help of Corne Nielsen of Philip Kartin, introduced all of you to a new vision of storytelling. We launched the God's Dog Monster graphic novel through crowdfunding, introducing the dog headed St. Christopher the dragon slaying St. George to full view as a new epic story began. The response was astounding, reaching over $250,000 and ultimately selling out our first print of the book. Now book two of five in this series, God's Dog worry moves into the meat of this epic story where our dog headed stranger must be integrated, must be trained and must fight. The cosmic stakes behind the story become clear, the characters shine and heart wrenching choices must be made. Book two will surprise you with more monsters, more giants, and a deeper exploration of the mythology underlying it all. Since book one of God's Dawn, I've also started a publishing company called Symbolic World Press with some amazing partners to deal with the timely production, printing and shipping of all future books. We've already successfully published Snow White and the Widow Queen and we'll expand our activities rapidly. The money we raised is to build this whole project and even move towards other media. We now have three full time people working with us, plus nine artists, six writers collaborating towards at least 14 upcoming books. And all of this without any outside funding, no outside control. It's all of you making this possible. This is why crowdfunding is so powerful. So in this crowdfunding, we've partnered with professional comic artists Matt Sheehan, Jesse White, Philip Kartin and Martin Krotz to bring together God's Dog Warrior. But on top of that, I'm also introducing an entirely new comic book series called the Garments of Skin, which will explore the lore, the mythology around God's dog, bring the story into the contemporary world where new heroes tried to resist a global system of control. We are at a turning point in culture, a turning point in storytelling. And I know I can count on all of you to make it possible. We have to take back the reins of storytelling, move past the gatekeepers. And I thank all of you for trusting us to play a part in that. Thank you for backing Godzog Warrior on Kickstarter today."}
