{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":0.16,"end":63.93,"speaker":"Laura Diaz","text":"Tucson, the Weight is Over Mediweight Loss they're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks at mediweight loss. I got the same medication but with a customized plan, weekly check ins and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight Loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com pack up the because Chevy."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":63.93,"end":115.61,"speaker":"Rod Dreher","text":"SUVs have the capability to take you to some incredible places. Like an adventure in the middle of in the Equinox Active, an SUV that will help you get away with confidence. Or head off for a night in the in Chevy Traverse with all the tech you need to stay connected. While the undeniable value of Chevy Trax will keep you moving from here to over here to way over here. Get to all the places you want to be with Chevy SUV's. See Watson or O'Reilly Chevrolet. I feel that we may live, you and I to see some sort of great religious deception where the UFOs apparently the aliens come down and say that God is not real. We made it all up. We're the real deal. Follow us and we'll will take you to enlightenment. And here's a weird thing I found out that I'm sorry, I'm just going on and on, but it gets weirder."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":116.01,"end":117.01,"speaker":"Jonathan Pageau","text":"This is great Russia."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":117.01,"end":135.49,"speaker":"Rod Dreher","text":"It gets weirder. I found out that a lot of people in the US government, in intelligence, military and certainly in Silicon Valley, they believe the UFO phenomenon is a real thing. But almost none of them believe these are creatures from other planets. They believe these are trans dimensional beings of some sort of."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":135.56,"end":139.16,"speaker":"Jonathan Pageau","text":"Well, Alex Jones been saying it for like 20, like 30 years."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":139.4,"end":140.6,"speaker":"Rod Dreher","text":"Isn't it crazy though?"}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":140.76,"end":237.98,"speaker":"Jonathan Pageau","text":"He's been saying look these they believe in this. He's like, I don't even know if it's real. But I'm just telling you the agencies believe that they are trans dimensional beings and that they have ways to communicate with them through psychedelics and through different meditation methods and that, you know, and so it's like now, you know, 30 years down the line with Alex Jones, basically, you know, being run out of business. Now regular journalists are going to start to talk about it. This is Jonathan Peugeot. Welcome to the symbolic world. Hello everyone. I am very happy to be here with Rod Rare, most of you, I think everybody watching this knows who Rodger is. He is a New York Times best selling author and he has a new book called Living in Wonder. I am very happy to call him my friend. He seems to be on the same journey we are. You know, all of you watching Symbolic World have the same types of insights and being prescient before the big pot. Like the whole culture is catching up. Rod, I saw that everybody now and their brother is writing a book about re Enchantment. And then like, you know, was it like four years ago you could barely, you couldn't even sell the book because you're like, who cares about this? Nobody cares about this. Now all of a sudden everybody's writing about it. So welcome on, welcome on the symbolic world, Rod."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":237.98,"end":263.22,"speaker":"Rod Dreher","text":"Well, it's great to be here, Jonathan. And you know, you and I were talking about these ideas personally a few years ago, as you said, and now all of a sudden, enchantments having a moment. And it's really interesting. What do you, what did you see coming? Because people ask me the same question too. And I don't know, I just picked it up. This is what interested me. And all the most interesting people I knew cared about the same sort of thing."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":263.7,"end":315.15,"speaker":"Jonathan Pageau","text":"Well, I saw it, hap saw it happening in 2016 was like to me, the crushing moment where I could feel that I could feel the earth shifting beneath my feet. It was actually quite painful. It was existentially painful. I remember having trouble sleeping at night and it was very intuitive. I just had a sense that the shifts that were happening in culture were tectonic and not all of them were positive. But I already saw back in 2016 that the new atheist, materialist, reductionist world was, it was over, it was finished, and that people hadn't seen the consequences of that yet, but that we would quickly start to see them unfurl in our society. And that's one of the reasons why I started making videos in the first place. And I've just seen it accelerate. And I think now the fruits of that moment are visible enough that people can now notice."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":315.47,"end":381.67,"speaker":"Rod Dreher","text":"Yeah, yeah. You know, one of the things, one of the real landmark moments in working on this book, Living in Wonder, came for me, and it's in the book that I'm telling. The story came for me in 2022 when I was at Oxford University at a conference with Ian McGilchrist in a young Anglican ordinarian. What do they call him? Ordinand seminarian. Approached me, 27 years old, Daniel Kim, and he said, listen, you need to know something that most people in your generation don't know. What's that? That the new atheism is not the threat. Now. Many people in your generation can't see it, so what's the threat? The occult. And then he went on to talk about how when he was working in advertising in London, he was the only Christian in his office at Snow Surprise, but everybody else there was involved with the occult to some degree or the other. And there were even two open Satanists who defined Satanism as learning how to be your most fully human self. And he told me, I'm going to be dealing with this the rest of my life as a priest, and the Church is not ready for this right now."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":382.95,"end":423.82,"speaker":"Jonathan Pageau","text":"Yeah, that is for sure. But we're starting to see it. You know, I just talked to Father Josiah Trenum yesterday and he said it. He said, people in my church now, he talked about it in terms of tattoos. He said, you come to my church, you'll see people with all these wild tattoos of like Norse gods and pentagrams and all of this stuff in the Church, because there are large numbers of those people. Obviously there are people going into the occult, but there are also people dealing with the consequences of that and looking for solutions to the consequences of letting themselves go and calling upon things that they don't understand in order to accomplish their will. It doesn't end well. Let's just say."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":423.9,"end":504.27,"speaker":"Rod Dreher","text":"No, no, it's true. And look, I mean, what's astonishing to me when I talk to younger people, I'm Talking about people 40 and younger, is how they live in such a different world than people my age. I'm gen X, I'm 57. Certainly the boomers. When I went to Paris in 2018 for the release in French of the Benedict option, I found it really interesting how Catholics, everybody I talked to was Catholic. The Catholics my age, in their 50s and older, they had. They were really edgy about it and didn't really like the book. And I couldn't figure that out. Those who were Significantly younger, like 40 and younger, they had no problem at all with it. They were like, tell us more. Tell us more. And I couldn't figure out what the deal was. Finally it hit me. Those Catholics who were my age and older, they still were desperately clinging to. To the possibility that the church still had something important to say to French society could still be a part of the mix that they just adjusted here, did a little there. Those who were younger had no such illusions and didn't care. They just wanted to know, how can we be fully Christian? How can we be fully Catholic in this post Christian world? And those here in Europe. That's my audience. I'm talking to you from Budapest. That's my audience. Millennials and younger."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":504.43,"end":541.98,"speaker":"Jonathan Pageau","text":"Yeah. And the book is. It's funny because I saw that. I saw. I think it was. I forget who it was. I read a review of it, and they were saying, this is not what I expected. Like, they expected, you know, something like, you know, colorful meadows and sparkling world, you know, things shining and this kind of enchantment in that sense. But you go right into. You go right into UFOs and demons and all that stuff. And so, you know, just for people watching, like, why do you think those things are related? Why do you think that These stories about UFOs and the occult and this kind of new enchantment, how do you see them as being related?"}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":542.54,"end":602.95,"speaker":"Rod Dreher","text":"Yeah, because people today are both seeking out and are aware of the numinous, the. The transcendent, the, you know, the woo, to use a slang term. And you can't. But you can't have the good woo without the bad, too. And this is actually why the book. My initial publisher was Sentinel imprinted Penguin Random House. They published Live, not by Lies, in the Benedict option, but they canceled the book because they didn't want to deal with the dark side, the occult. I think they wanted something that was just mostly about, you know, going into nature, seeing the beauty and connecting that to God. And that's in the book. But you can't have one without the other. And. And I feel that if I led people to think you could, that they would miss something and maybe even be falsely enchanted, be drawn into something that looked good but was actually a deception. An angel of light."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":603.43,"end":666.17,"speaker":"Jonathan Pageau","text":"Yeah. I think that that's what's hardest, I think, for materialists to start to understand is that the truth is that materialists actually can protect themselves from curses, let's say, like you could as a Materialist be less in danger of someone, you know, cursing you or some magic against you or something, someone acting against you. But you at the same time are also less open to the positive aspect of that world, which is to be positive aspect of a positive influence that would also transform you, you know, an angel or a saint or something that would transform you. And you see it in the lives of the saints that, you know, the more they enter into the spiritual world, you know, in terms of their transformation to be like Christ, the more they see the demons as well, you know, and they're constantly dealing, fighting with these. They can see the dark forces working on them and then working on the others as well. So I think you're right that you can't, you actually, in some ways you can't have one without the other. That's why we need to have discernment. That's why we need the wisdom of the church."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":666.33,"end":796.42,"speaker":"Rod Dreher","text":"Sure. Well, you know, Charles Taylor said that the modern self is the buffered self. And it's the self that has learned over the centuries, the past five centuries, to put up all these barriers to experiencing the numinous. And the buffer self doesn't exist outside the west, outside the modern world. Well, people in the west now, they realize they need to be more porous, to let in the world of spirit. But again, you can't have one without the other. Just today, Jonathan, here in Budapest, I had a long lunch with a friend, a fallen away Catholic who started reading my book. And then really strange things began to happen to her. And she began to feel that there was a presence in her room. And the presence started pressing down on her chest. To make a long story short, it turns out she and her brother had gone into a cemetery a couple of years ago just to see family graves or whatever. Her dog started barking like crazy at nothing. And they both, she and her brother both felt that there was some malign entity around and they left quickly. Now the brother's a practicing Catholic, she's fallen away, but she believes, she's not sure now, but she believes that something may have attached itself to her then. And she got really, really scared. Recently when reading my book and starting to think about the spiritual world, these things began to show themselves in her. Now she said to me when this first came out, she goes, I'm really scared. I'm really scared. I don't want to deal with this. And I said, well, if this is a real thing, you're going to have to deal with it. It's not going to go away. Because you don't want it there. I suggest you call your priest. Well, tonight, as you and I are speaking, she's having her apartment blessed by her priest. She started to go back to mass, and I was giving her encouragement at lunch today. I said, I know you're frightened. These things are frightening, but they take their strength from our fear. You are a child of God. You belong to Christ. Go back to mass, make a good confession, do these things, and they'll go away. But you can't avoid the fight by just choosing not to think about it."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":796.58,"end":916.89,"speaker":"Jonathan Pageau","text":"Yeah. Yeah. And, you know, it's really difficult still for some secular types to understand how this is possible. And I try to help people understand with lower, smaller cases, like, smaller cases that you deal with all the time, which is that, you know, if, let's say, you're a child and your mother is angry with you, she doesn't touch you. Right? She doesn't beat you. She's just really angry with you. Now, that influence, it's a spiritual influence, for all intents and purposes, will affect you. Like, you can get sick. You can. You can have trouble sleeping. All of these things can happen to you, and she's not going to touch you at all. It's a. It's a. It's an influence. It's a spiritual influence. Now, it's easier to understand, of course, when it's a person, but you can understand it as a general mood. For example, like in a. A state where there's a police state, like during COVID You know, maybe you never see the police, maybe you never see the authorities, but there's something in the air that is oppressing you, and you can feel it. And so there are all kinds of cases of this, and some of them go beyond the way that secular people tend to think, but you can understand it through analogy with things that happen to us every day. It's just that people who are sensitive to these experience will tell you that it's not just. How can I say this? That it can be something like what you could call like a psychic residue, like something of a. Something that happened in a space that has imprinted it in a subtle way. And that's. Again, it's hard people to understand, but that. That can actually affect you. And you. You. You know that because you actually know that. Because if you walk into a room where something really bad has happened, sometimes you don't know what you can kind of see if it just happened not very long ago, you can get it. You can feel odd. You can't tell like your mind can't tell what it is that happened, but you still have this odd feeling and that that type of psychic imprint can continue on for a long time. But a lot of people I know, even people that watch me will listen to you be like, what is this? This is crazy."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":917.21,"end":961.83,"speaker":"Rod Dreher","text":"Oh, it's so interesting though, how, you know, I've been living in this world as a Christian for a while because, I mean, Ross Douthen at the New York Times, a friend of mine, a faithful Catholic, he told me a few years ago, you've got to write your woo book. Because he said, of all the friends of mine, you're the one to whom these things happen. And it really is true. I seem to be a weirdo magnet or a woo magnet, not only personally and the things that happen to me in life, but the kind of people who talk to me. And maybe I have a feeling that these things are much more common than we know. But people talk to me about it because they know I'm not going to tell them you're crazy. That didn't happen. I just want to hear it. Maybe they have imagined a particular thing, but in general, I'm like, no, no, no, that's real. That's happened to other people."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":962.95,"end":993.65,"speaker":"Jonathan Pageau","text":"Hello there. This is Martin Shaw inviting you to come and join me for Christian Wonder Tales, my first online course with symbolic world. It is a secret history of things that we're going to be exploring from the early Celtic saints and heroes of antiquity all the way up to the chivalric tradition of Arthur, table, Merlin, the whole thing. What do stories like that have to tell us about the mosh pit of."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":993.65,"end":995.41,"speaker":"Rod Dreher","text":"Our own modern lives?"}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":996.05,"end":1002.77,"speaker":"Jonathan Pageau","text":"Well, over four gatherings, we're going to find out. I promise you this, it will not be boring."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":1003.09,"end":1067.1,"speaker":"Laura Diaz","text":"Tucson, the weight is over Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iHeartRadio. And you can trust me. This isn't just another weight loss clinic. I know that because it's where where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication, but with a customized plan, weekly check ins and a licensed Physician guiding me every step of the way and the cost the same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweightloss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com pack up though, because Chevy."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":1067.1,"end":1094.13,"speaker":"Rod Dreher","text":"SUVs have the capability to take you to some incredible places like an adventure in the middle of the in the equinox Active, an SUV that will help you get away with confidence or head off for a night in the in Chevy Traverse with all the tech you need to stay connected. While the undeniable value of Chevy Trax will keep you moving from here to over here to way over here. Get to all the places you want to be with Chevy SUVs. See Watson or O'Reilly Chevrolet."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":1095.65,"end":1170.54,"speaker":"Jonathan Pageau","text":"Yeah, and it's also, this is the difficulty about these types of events is that the line between imagine and, and happened is not as clear as people might think. You know, because if, if you imagine that something happened to you like you have and, and you could say it's all in your mind, like it's still happening to you, it that this is something that's, that's difficult again, it's difficult because the problem with influence and the problem with the way in which things influence on us are not like a, not like hitting a piece of wood with a bat. There's a kind of interpersonal relationship that sets itself up and it's the same, for example, like if you, let's say again, you take the story of your mother who's angry, angry at the kids, let's say and she keeps that like she's angry for several days and some of one of the child will engage with it and receive it and answer it and will become sick because of it. And the other will just be like, yeah, whatever, because it's not a one directional thing. And so you have something that happens just in your mind. The idea that you could just say what's not happening. Well, try to pretend that it's not happening for long enough and you will be in danger. And even if it is, can I say, even if it is psychological in just your mind, it's still happening to you."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":1170.7,"end":1246.61,"speaker":"Rod Dreher","text":"Yeah, yeah, that's what I was telling my friend here in Hungary. I said, you know, you could try to put it out of your mind but that doesn't make the thing Go away. I mean, if there were criminals prowling the street at night, you may never go out of your house at night, but they're still there. And if you can deal with them, if you can make them go away effectively, then you should do that. I was having this conversation earlier this week. I was in Bratislava in Slovakia, sitting around the table having breakfast with some Catholic friends. And they wanted to know more about living in wonder and all that. And we got on the topic of psychedelic drugs. And one of the Catholics is like, I don't understand what you mean when you say that these drugs can open up a port portal. Isn't it just happening in your mind? She couldn't make the connection between the mind and reality. She still had this implicit Cartesian dualism there. And I said, look, you're a sacramental Christian. The matter and spirit interpenetrate in mysterious ways. And so, of course, it could be the case that a chemical can affect your brain to make your brain perceive dimensions of reality that actually exist, but that you can't normally, you know, access."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":1247.65,"end":1311.48,"speaker":"Jonathan Pageau","text":"Yeah, and it's the same, you know, I had someone tell me one day, she said, when I was a child, I saw a demon in my room. And she said, I don't know if it was in my mind or if it was really there. I don't know if it was just my imagination. And my answer to her was, well, did you see a bird, a cat, or did you see a demon? And she's like, I saw a demon. Well, you saw a demon. I mean, you know what a demon looks like and you saw a demon. I don't know to what extent. Like, you know, the relationship between your inner experience and what is happening outside. You know, if you see a demon, that means you are in a dangerous situation and you have to deal with it no matter what. No matter what. Like, you know, no matter how you try to explain it mechanically, it doesn't. You don't. You don't have to think about that too much, you know, I don't see demons, you know, because I don't know. But if I did, then I would definitely go see a priest. And I wouldn't ask myself, was it just my imagination? Is it, like, really there? Where is it? Like, is it another dimension? Like some kind of physical explanation? I mean, these things are important."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":1311.72,"end":1368.43,"speaker":"Rod Dreher","text":"Well, people are. People are having these experiences and trying to figure out what they are, when in fact, the church has so many resources to help them. But like the story I lead living in wonder with the story about the young man, Nino, a Catholic lawyer who had these entities visiting him. Now, he had seen a UFO when he was 17 years old back in 2009, out in the countryside where he lived, and just looked at it hovering over a field and just said, I don't know what that is. I'm just not going to tell anybody. They'll think I'm crazy. Seven years later, he's sitting in his apartment in the city where he was living for law school, studying for law school, and these two entities. Shimmered. That's the word he used, sort of shimmered into being through a portal that opened in his wall. And they began communicating with him telepathically. Nothing significant. Things like a car is about to backfire on the street. Then that happened."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":1368.43,"end":1368.57,"speaker":"Jonathan Pageau","text":"The."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":1368.64,"end":1464.07,"speaker":"Rod Dreher","text":"They were just sort of establishing their bona fides with him. And then they went away. He thought he was losing his mind. Went to the hospital, demanded tests. He was fine. Then they kept coming back. And the reason he reached out to me about this was this had been happening for years, and he had been too afraid to tell even his priest because he thought that the priest would think he was crazy. And when he got married, his wife saw them too, so he knew it wasn't in his head. And I said to him, well, did you think that these might be demons? You're a Catholic. Well, no. I said, well, why not? Did you ever pray when they were around you? Yeah. What happened? They would go away. Demons, right? He said, well, I thought demons would want to fight me. I said, no, no, no. There are stories exorcists tell about the people who've had UFO experiences. These things are almost certainly demons. So he went to his. On my advice, he went to the archdiocese. An exorcist. He said, yeah, we've had these cases, prayed over him. Things have not come back. I saw him not long ago when I was in the US Last time. It was a year after our initial conversation. He said, they haven't bothered me at all. Now, what I find interesting about that, Jonathan, is this man was not a skeptic. He was not unchurched. He was a practicing conservative Catholic. And yet, because he didn't have any background in demonology, and because he. These things chose to present themselves as somehow connected to the ufo, he didn't know what to do, and he was too afraid to go to the priest. I have to believe that this is gonna. This is happening a lot now, and it's gonna happen more and more."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":1465.27,"end":1474.63,"speaker":"Jonathan Pageau","text":"And so what is your. Like, how can I Say it's like, what do you see as the positive aspect of this? Like, what is it that you see that is happening that is also something that we should celebrate?"}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":1475.2,"end":1581.84,"speaker":"Rod Dreher","text":"Well, that people are becoming much more aware of the need for transcendence, of the need for enchantment. Now, I don't like that word, enchantment, because it does sound like sprinkling fairy dust and turning everything to Disneyland. And that's not it at all. I use it in the sense that Max Weber meant when he said that the modern world has become disenchanted. What he meant by that was that we just don't feel the spiritual around us anymore and God is ever more remote and has even disappeared. For many people, that's a disenchanted world. I think what that means is not that the spirit has withdrawn or that God has withdrawn, but rather we have lost our capacity to perceive. And I think people now are realizing that we can't live that way, that it's a really unhealthy way to live. And it's not living in truth, it's living within a very particular lie. One thing I talk about in the book is how we got to this point historically, all the different cultural developments. And I quote the great Ian McGilchrist. I don't know if you've had him on yet, but you know, British psychiatrist who talks about how we in the west and the modern world have become completely miserable because we've cut ourselves off from noetic ways of knowing. That is not to say ways of knowing truth that are not abstract and logical and scientific, but that come to us through participation via poetry, religion, music, art and so forth. I think that the fact that people are moving, realizing that materialism is false and it's killing us and we need something else is a great thing. But the problem is the churches aren't ready for it or the people aren't ready to listen to what the churches have to do."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":1582.15,"end":1582.39,"speaker":"Jonathan Pageau","text":"Say."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":1582.63,"end":1598.31,"speaker":"Rod Dreher","text":"Because to be re enchanted as a Christian implies and requires, in fact, taking on certain moral realities and moral disciplines that many people don't want. They want the enchantment without being told that they can't do what they want to do."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":1598.63,"end":1679.88,"speaker":"Jonathan Pageau","text":"Yeah, you see that in what I call the California Buddhist, you know, which is people who want the spirituality but don't want any pressure on their life. They don't want to have to change anything. They just want to be able to meditate and, you know, do things. But Christianity is rough because it asks you for, ask you for a lot, ask you for you know, to be, to be practice celibacy, you know, in your marriage as non married, it asks you to abstain from certain things, to, to discipline yourself with food. Like there's all these really practical things that it asks, especially orthodox Christianity, that it asks of you, you know, but that's the reality. That's the difference between in some ways the psychedelic road to spiritual experience and the true Christianity. Because in the end it's possible. I don't know, I've never taken psychedelics, but it is possible that the experience objectively is similar. But the difference is that the person who has gone to it through asceticism is being trained in discernment as they are coming closer to the capacity, like the opening up of their spiritual faculties to be able to encounter this, this different world. And so they're not as much in danger, to be completely, you know, seduced by and confused by the things that they encounter on the other side, let's say."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":1680.04,"end":2003.68,"speaker":"Rod Dreher","text":"Yeah, yeah, that's exactly right. I mean, I compare it to someone who becomes a multimillionaire by working hard, saving and investing carefully and so on, to someone who became a multimillionaire by winning the lottery. It's the same amount of money, but it destroys the person who won it in the lottery. Often you read these stories about people, they win $100 million, then five years later they've got no money, they've divorced, and on and on with these experiences comes a great deal of responsibility. And yeah, you're right, that's why psychedelics are so popular. They give people an experience of the numinous. And some of these are real, but they don't know how to handle it. I have done psychedelics and I finally talk about it in this book. I did them when I was in college, before I became a Christian, and I had a positive experience. But I haven't been willing to talk about it over the years because I didn't want to encourage people. But I felt that I needed to be straightforward in this book because if I'm going to condemn psychedelic use or warn people away from them as I do, I need to be able to have some credibility. And in my case, I first became enchanted, or at least was first enchanted by going into the cathedral at Chartres when I was 17 years old. I'd been raised in sort of Eastern Christmas Protestantism in South Louisiana. You know, God was there, but we didn't want him too close. You know, he was, he was there to sort of be our psychological help. And by the time I got to be 15. I'm like, this can't be right. It's just the white middle class at prayer and, you know, at social conformity, blah, blah, blah. Then my mom won a trip to Europe in a church raffle. She knew I wanted to go, and she didn't go, so she sent me. I couldn't wait to get to Paris. That Hemingway, where he. See where he lived, where the lost generation was. But the coach in which I was riding, I was the only young person on a bus full of elderly American tourists stopped at an old church about an hour outside of Paris. I'm like another old church. I go in, and this is the Chartres Cathedral. Jonathan, you've been there, I'm sure. And it's nothing in my experience, growing up as a kid in late 20th century America prepared me for the glory of God there. And I remember standing there in the labyrinth and just knowing beyond a shadow of a doubt that God was real and that he wanted me. And I walked out of there, not a Christian. But I was on a search. And the next big stop on that search was in college when I dropped acid. You know, I was very, very depressed over a girl my freshman year, and got this new roommate, this sort of happy, go lucky Jewish hippie from New Orleans. And he's like, hey, man, I've got these two hits of acid. I've never done it. You want to try it? And by then I was like, why not? I was just so down. And it really utterly changed me. It turned me inside out. I can remember lying there on a bench on campus at lsu, Louisiana State, and looking at the sun filtering through the green leaves and thinking, why am I so sad? Look, God is everywhere. I could feel him and felt the ultimate unity of all things. Now, the thing is, Jonathan, I believe that I saw something that was real. The veil was lifted. Rupert Sheldrake talks about how almost everybody who has these experiences believes that they saw something real under the influence of drugs, not a hallucination. What I did on Monday morning, though, because we tripped on that weekend, I went straight to the campus bookstore to get books about Christianity because I felt. Felt like I had, in some sense, perceived God. And I started my serious walk into Christianity. It took some years, precisely, Jonathan, because I didn't want to give up my sex life. Not that I had much of one, but it was a principle of the thing. I'm a young man. I'm late 20th century. It's my right. And finally, years later, it came to the point where I had Another experience of intention, enchantment, where I met this elderly Catholic monsignor, who I'd been sent to him. I was a journalist then, my first job in journalism. I've been sent to interview Monsignor Sanchez, who was in his 90s. He had been born in the 1890s. That's how old he was, who had been an artist and an art professor at Dartmouth before he entered the priesthood in midlife and just went there to get his story. And that old man was just luminous. He was like Yoda, you know, he was just glowing. This sweet old monsignor from Guatemala. And I asked him, how did you become a priest? He told me two miracle stories that happened to him at Guatemala, that the first one brought him back to his faith, and the second one brought him into the priesthood. Now, the key thing was, as that old man sat there telling me this, tears were pouring down his cheeks. These events had happened 50, 60 years ago, but it might as well have happened the previous week. And I sat there realizing I'm in the presence of a witness, and I can't turn away from Christ now. I've seen too much. And I wanted Christ in that moment. I wanted Christ more than I wanted myself. It was when I was willing to make the sacrifice of everything, including my sexual freedom, that enchantment finally became real for me, and I became a Christian."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":2004.8,"end":2038.21,"speaker":"Jonathan Pageau","text":"That's an amazing story. And so what do you see? What do you see on the horizon? Like, what do you see coming? You know, because this is just the beginning, in some ways, of something that is. That has started and now, like you said, I saw that Ross Douthat had, you know, put out a review of your book, and he also said he's also writing a book about enchantments. I'm like, by the time New York Times, people are writing about enchantment, it means that it seems like people are noticing. And so what do you see coming, let's say, in the next 10 years?"}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":2039.41,"end":2142.96,"speaker":"Rod Dreher","text":"Well, there's a reason I have a chapter in Living and Wondering which I identify Paul Kingsnorth, Martin Shaw, and Jonathan Pageau as prophets. Because I'm not flattering you. It really is true. You all are seeing into the future. And not because you're psychic, but because you're intuitive. And you know what? You can see patterns in the culture. I think things are going to get a lot darker and more vivid very fast. Paul Kingsnorth, as you know, writes a lot about what he calls the machine. What I've been seeing. One of the most Disturbing chapters in my book is about the false enchantment of artificial intelligence. The craziest thing, Jonathan, when I was working on this, I found that a lot of people, people who are involved with AI believe that it's a sort of high tech Ouija board that is allowing us to communicate with discarnate higher intelligences that are going to lead us to great things. Enlightenment. When have you heard that before? Well, you know what that's about. Paul knows what that's about. Martin Shaw with his mythological background definitely knows what that's about. But we, in this modern scientific materialist culture, we don't know what to do with that. And so people are walking naively into something really dark, something straight out of CS Lewis is that hideous strength. I found an interview online on YouTube with a guy from Louisiana, as a matter of fact, who was the AI guy at Google who got fired, you might remember that a few years ago. Got fired because he went public and said this thing is becoming sentient. Google let him go. Well, in this interview he talked about it and he said he's an occultist of some sort."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":2142.96,"end":2146.52,"speaker":"Jonathan Pageau","text":"Yeah, he's a kind of magician. He's a sorcerer of some kind."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":2146.6,"end":2162.2,"speaker":"Rod Dreher","text":"Right, right, right. And he said that he, a kabbalist and some other guy got together and did a ritual with Lambda, the artificial intelligence, to consecrate it to the Egyptian God Thoth. Now what the hell is that about?"}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":2162.28,"end":2166.6,"speaker":"Jonathan Pageau","text":"You know, why would you extends to. I mean, it's the right God to consecrate it to."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":2166.86,"end":2323.2,"speaker":"Rod Dreher","text":"Right, right. But I guess that people in Silicon Valley are way more aware of this than the normies and certainly the Christians. And this intersects with the whole UFO thing in really bizarre ways. Jacques Vallee, who's like the grand old man of UFO studies, he's in his 80s now, not a Christian at all, lives in San Francisco. He came out with a book in the 60s, late 60s, called Passport to Magonia. Have you ever read that? Boy, you really should. You can find it online. In it, Vallee theorized that what UFOs might be are the contemporary manifestation of very, very old entities that manifested as different mythological creatures in ages past in past cultures. But today, in a scientific, materialist world, they are manifesting as UFOs, as aliens, because that's how we can receive them in a way they want to be received now. Vale. Gosh, it's such a scary story. Diana Pasulka is somebody a lot of your listeners might know. She's a religious studies professor in North Carolina who makes a specialty of studying UFO culture as an emerging religion. She writes about how she went to visit Jacques a couple of years ago in his apartment in San Francisco and was shocked to walk into this apartment of this man, who was not a Christian, to find a big shelf full of books about angels and demons. And he showed her a book and said, look, I can't let you have this copy, but you need to go find it because it's important to understand what we're dealing with here. Well, the title of the book was Satan and it was a collection of theological essays written mostly by Catholic priests, Catholic scholars, about aspects of Lucifer. Now what I took from that is that Jacques may not believe, may not have the Christian framework, but he does seem to believe that there is an all powerful malignant entity that is trying to communicate with us here in a deceptive way. I feel, I mean, I didn't write this necessarily in the book, but I feel that we may live, you and I, to see some sort of great religious deception where the UFOs, apparently the aliens come down and say that God is not real. We made it all up. We're the real deal. Follow us and we'll take you to enlightenment. And here's a weird thing I found out that. I'm sorry, I'm just going on and on, but it gets weirder."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":2323.9,"end":2324.58,"speaker":"Jonathan Pageau","text":"This is great, Ryan."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":2324.58,"end":2380.92,"speaker":"Rod Dreher","text":"It gets weirder. I found out that a lot of people in the US government, in intelligence, military, and certainly in Silicon Valley, they believe the UFO phenomenon is a real thing. But almost none of them believe these are creatures from other planets. They believe these are trans dimensional beings of some sort, Believe it or not. I got an email about a month ago from a well known journalist who's working on a big piece about UFO cults. And he told me, he goes, I just want to check with you on this. I keep finding out when I go to talk to people in the US government, whether it's in the military, bureaucracy, intelligence or in Congress, and they all say that they believe these are not aliens, but trans dimensional beings. He said, and I'll ask them, why don't you say something to people about it? He said, well, we've been telling. He said, they all say, we've been telling journalists, but they won't write about, about it. Well, this guy's gonna write about it. Piece will probably be out early next year."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":2380.92,"end":2384.44,"speaker":"Jonathan Pageau","text":"Alex Jones been saying it for like 20, like 30 years."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":2384.68,"end":2385.88,"speaker":"Rod Dreher","text":"Isn't it crazy though?"}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":2386.04,"end":2411.48,"speaker":"Jonathan Pageau","text":"He's been saying, look, these, they believe in this. He's like, I don't even know if it's real. But I'm just telling you the, the agencies believe that they are transformation trans dimensional beings and that they have ways to communicate with them through psychedelics and through different meditation methods and that, you know, and so it's like now, you know, 30 years down the line with Alex Jones, basically, you know, being run out of business. Now regular journalists are going to start to talk about it, which I guess it's good."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":2411.8,"end":2502.66,"speaker":"Rod Dreher","text":"Yeah, yeah. But you know, it's so interesting because I was sharing some of this with a bunch of conservative friends. I was at a conservative conference in the US right after the election and I was telling them a little bit about this. Nothing but skepticism around the table. And I don't blame them. This is crazy stuff, but, you know, it's going to take the normies a while to get caught up with the stuff that are in the world that you and I and a lot of your listeners have been in. And I don't think we're crazy. But I will tell you that until just over a year ago, I wouldn't have touched the UFO stuff. I kind of laughed at it, but a friend of mine who's a journalist in Rome, he said, look, I know you laugh at this, but you need to pay attention because there's some very deep and troubling spiritual stuff going on in the whole ufo, AI technology world. Said, okay, fine, what should I read? Took me about a month and I was completely, you know, I was down the rabbit hole. And there's, there's a lot of deception there. No doubt about it. You can't believe everything, but there's something there. And it was that once I started going down that rabbit hole and connecting it to the occult, that's when the book got cancelled by my original publisher. Thank God Zondervan picked it up. Never imagined that an evangelical publishing house. We want to publish a book about woo from an Eastern Orthodox Christian. But the guy who bought the book there said he's an evangelical. He said, you'd really be surprised at how much things are shifting even among evangelicals on this. They're a lot more open to it than they once were."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":2503.14,"end":2621.72,"speaker":"Jonathan Pageau","text":"Yeah, I read Pasulka's book on your recommendation, by the way. I was actually supposed to meet with her at Notre Dame a few weeks ago, but she didn't show up. I think she was sick or something. I really would like to meet her. One of the things that I really like about her thesis is how she doesn't try to disentangle the Social narrative from the event. She says you can't disentangle it. So, you know, like you said, there's a lot of stuff that's like fake. People are making it up, people are. Some people may be lying about their experience, but what's happening is that those lies and even the made up experiences, all of these things and the real experiences, they're fusing together to create a kind of worldview and a kind of perspective that is part of the phenomena. You can't distinguishing it. And so all the science fiction, all the movies, all of this stuff is actually part of the UFO phenomena because it is creating a narrative around which these beings have presence and you know, and have certain types of influence on us. And so I thought that approach was really wonderful because that is also how we understand spiritual beings, of having influence. Like spiritual beings don't only have influence through mechanic, through mechanical means. They mostly have influence through subtle means, that is through perception, through storytelling, through. It's a worldview and like making certain things more visible and certain things less visible, you know, that's what, that's how spiritual influences function first and foremost. Foremost. And so I find that whole idea very interesting. Which means that you can actually pay attention to the phenomena without falling into like trying to defend this or that story. Because that's, that's what people fall into. They're like, well, this guy, you know, he's, they're trying to figure out whether or not he really has access to information. And this other person, and this other person, there's a, there's a place where you can stand from far away and look at the whole thing as a story that's running through our, our culture and evaluate it for that, you know."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":2621.72,"end":2733.77,"speaker":"Rod Dreher","text":"Well, one of the things I point out in the book, Away from the Occult Weirdness is the way what you attend to calls certain realities into being. I mean, this is psychology. I guess you could say Ian McGilchrist is big about this and so is Matthew B. Crawford. And they talk about the importance of, of cultivating your ability to pay sustained attention because it produces reality. It's not to say like a psychotic would say, that whatever I imagine must be real, but it does make certain things visible to us or invisible to us based on what we pay attention to, and not only what we pay attention to, but how we pay attention. It turns out that the ability to pay sustained attention is key to being enchanted. If you cannot sustain attention, if you become easily distracted, then chances are you're not going to be able to perceive the things that are really there that you need to perceive. And as I was reading this and learning this from reading anthropology and psychology, I realized that the Internet is one great big disenchantment machine because it has done this to all of us. I mean, everybody who's on the Internet has noticed over time, if you're old enough, that your ability to sit down and concentrate on one piece of text for a while has been greatly damaged. And this, I think, is turning us into slaves in a way. Because, I mean, you look at young people who've only ever known the digital world, their ability to pay attention, say teachers, I know, is almost nothing. And so they become, you know this as an orthodox Christian, they become slaves to their passions. And not even their passions, their impulses, which are like sub passions."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":2734.73,"end":2805.69,"speaker":"Jonathan Pageau","text":"Yeah, you see that like my, my kids, some of their friends, they can't even watch an entire movie, which is like the movie is made to get your attention. You know, it doesn't actually require a lot of effort like reading or, or going to church or participating in a kind of ceremony. They just get distracted. They can't stand, they can't pay attention for an hour and a half to anything. It doesn't matter what it is. Even if it's Pixar animated, colorful thing moving in front of their eyes, that's wild. And you see that in the hesychastic Father. As you see, they talk about this all the time, which is that, for example, one of the things that Jesus prayer is for is to cultivate attention because you basically empty the distractions because we have all these thoughts, right? The logis. More these, these thoughts that go through your mind that aren't really you, but that are all kinds of distractions. And we, most people don't even notice them because they're so used to just drowning in them, basically like thoughts running through their mind. But once you actually start to try to deal with those, or to at least silence your mind in prayer, you realize, man, I don't know how to pay attention. You know, this is almost impossible to me."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":2805.77,"end":2947.77,"speaker":"Rod Dreher","text":"Oh yeah. I mean, I tell the story of the book about how some years back when I was really sick, I was dealing with chronic mononucleosis that the rheumatologist said was caused by overwhelming anxiety. My priest, my orthodox priest assigned me to say the Jesus prayer for an hour a day. And he meant say it in the way it's supposed to be said, ideally, you know, getting quiet, breathing in, breathing out. And if that guy had said to me, walk 10 miles a day, as sick as I was, that would have been easier than just sitting quietly praying the Jesus prayer for an hour. But I did it out of obedience and it was one of the hardest things I've ever done. Jonathan but after about a month, it started to get easier and finally it was really easy and I was healed in the end. And I went to my priest later and said, how did you know that's what I needed? He said, oh, that was simple. I had to get you out of your head. And he was exactly right. Because I was the sort of person, have always been the sort of person who thinks that there's nothing wrong with me, that finding the right formula in the right book can help me think my way out of this problem, but it's just not true. And enchantment is the same way. Broadly speaking, you can't just read about enchantment. There's no five point formula. Do this, 1, 2, 3, 4, 5, presto, you're enchanted. It's more like learning how to play the violin or learning how to say the Jesus prayer. You have to practice it and then all the practice does is simply open up your perception. There's a line I use in the beginning of the book. I adapted it from a Harvard professor who was talking about education. Education. She said, true education is not imparting information from the teacher to the student. True education is the teacher helping the students to be staring at the right corner of the sky when a comet goes blazing past. Well, that's also enchantment. I want people to read this book. I'm not going to tell you here's the five step plan to being enchanted. But what I do in the book is talk about what enchantment means. Give example examples. I tell stories about people who've had miraculous stories, people who've had demonic encounters. But I want people to step out of this book realizing that I can live a deeper life, a more enchanted life. But I'm going to have to make some big changes in my life, most of which are about learning how to pay sustained attention."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":2948.97,"end":2952.17,"speaker":"Jonathan Pageau","text":"So the book has been out for about a month now, is that."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":2952.25,"end":2953.93,"speaker":"Rod Dreher","text":"Yeah, yeah, about a month."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":2954.45,"end":2977.89,"speaker":"Jonathan Pageau","text":"So what has been how people been reacting? Because in some ways, like you said, this is different from your other books. Like you really lean in to things that, that you haven't talked about. At least you talk about it in your, in your newsletter. We've been kind of following the story for, for a long time, but like, as a published work, you haven't talked about it. So I'm curious. How are people reacting? How Christians reacting? How are non Christians reacting? And, you know, what's the. What have you been hearing?"}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":2978.13,"end":3154.86,"speaker":"Rod Dreher","text":"Well, I've been getting amazing reviews. And one thing that one through line that goes to a lot of these reviews is, well, Rodrier has done it again. You know, he always sees what's coming next. And that's gratifying to hear, but it really seems to have struck a chord with reviewers, again, who are 40 and younger, because they sense that we're in the middle of a very deep meaning crisis in our civilization and our culture. And it's one that's not going to be met by going back to the usual sources and remoralizing ourselves, that sort of thing. I remember back in, gosh, 2014, I think it was, I spoke to Christian Smith. He's that Notre Dame sociologist of religion who's responsible for the concept of moralistic therapeutic deism, which he said is the de facto religion of most people, people in North America, most young people. And it's just God is up there as sort of a cosmic butler. All he wants of us is to be nice and kind and to be happy in life, but that's about it. And that's not sustainable, right? It's A, it's not Christianity. B, it's not sustainable Now. I remember asking him back then, okay, so how can we get people back to the church because people are falling away left and right? He said, well, I don't know, but you're not going to do it by moralizing. And what I took him to mean by that is not just moralizing, but typical apologetics. You know, finding the reasonable Here are the reasons why you should be a Christian, or if you are a Christian, why you should be a better Christian. You know, it might have worked in ages past, when we were still part of the Age of Reason, however attenuated it may have become over time. But it doesn't work anymore. I have found that Pope Benedict, Benedict XVI was really onto something when he said the best apologetics the Church has for itself is the art it produces and the saints. What he meant by that was when you have an overwhelming encounter with holy beauty, as in art or architecture, as in Shatra, and also an overwhelming encounter with incarnate goodness, as in the saints. Those reach into your heart and into your mind. They go below and above reason, and they open the door of your mind to the propositions, the propositional truth. And I think that's going to have to be it. We're going to have to reach People with beauty and with the saints, with the lives of the saints and saints who live among us now. And that will open up people's minds to the gospel truth and the stories I tell of enchantment. That's it. That's what I'm talking about here. Pay attention to beauty. Pay close attention to beauty, because God is reaching to us through beauty, through participation in the life of God by loving something, by directing your arrows to beauty or to goodness, and then the rest will follow."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":3155.34,"end":3264.86,"speaker":"Jonathan Pageau","text":"Yeah, I think that that's. That's right. And you see it, you know, it's have this perception or like this way of talking about the world is happening at all these different levels and at the same time, right? You see, like you said with Ian McGilchrist, who I don't think is at least not officially a Christian, you see it with John Vervecki as well, who's just saying that the deepest forms of knowing and the deepest forms of human experience are not propositional knowledge. Like, there's nothing wrong with propositional knowledge. But, you know, our propositional knowledge is based on. Gripping, right? It's based on this encounter with the world and this encounter with people as well. And, you know, that's another place where the Internet is such a disenchantment machine is because, like, even now, like, we're having this experience, it's not bad. It's not fully disconnected, but we are kind of staring at each other through screens and there's this weird, you know, disconnect that is. That is part of our accepted reality. But when you, you know, when you stand with someone, you know, you stand next to someone, even in silence, you just have this. You can have a type of experience of. Of being together. That is. That is already the glimmer of enchantment. You know, if you. If you remember that, like we see it in America, we're also. So we want to fill everything with propositional, you know, with the propositional. And so when we're with someone, we. If there's Aquarius, silence is. We can't handle it. But, you know, once you start to realize that being with someone actually has an effect on you biologically in terms of perception, in terms of just presence and that. That has a great value, then, you know, we need to re. Encourage people to be with others. Like to go out there, to go to church, to, you know, to meet people, to have a family, to do all those things."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":3264.86,"end":3364.77,"speaker":"Rod Dreher","text":"There's so much there. Your fellow community Canadian Marshall McLuhan talked about the difference between concept and Percept Percept is a direct participation of something, the perceiving of a phenomenon, concept is what happens when the percept is turned into some abstraction, words or something symbolic. And we have to have concepts to have an intellectual life to get along. But McLuhan said that we can't forget that at its deepest level, religion is percept, the percept of God, the perception of God, and we would say in his energies. Our problem, said McLuhan, is we get stuck on concept, and without realizing it all the time, we turn religion into concept. And it's at that level when it gets stuck in concept, or to use Ian McGilchrist language, when religion gets stuck in the left brain, that it begins to die. McLuhan said that everyone he knew, whoever lost their faith, did so by first ceasing to pray, because prayer is the way that most people, and it's the ordinary way of maintaining the percept with God. And, you know, I think this has a lot to do with why Orthodoxy, Orthodox Christianity is having a moment right now. When I was in a trip, I press trip to Turkey to the church, seven Churches of Revelation with some other Christian journalist a couple years ago, and there was one guy there, Pentecostal, I think he was, and he brought his virtual reality headset so he could go to church and what they call it, the mega sphere, the mega world that, you know, virtual reality, whatever that thing."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":3364.77,"end":3367.97,"speaker":"Jonathan Pageau","text":"Was, that Facebook, like in. In virtual reality."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":3367.97,"end":3463.86,"speaker":"Rod Dreher","text":"Yeah, yeah, yeah. And what he was doing was they would meet all the people there, would meet virtually, and they would have their little worship service. And he thought this was awesome. And he said, this is the future of Christianity. Said, no, it's not. No, it's not. And I said, it would never work for us Orthodox and Catholics and other sacramentally oriented Christians. He got really offended by it because the idea that someone would say, wait, you mean technology is not the future is bad? But I kept trying to tell him that, no, no, no, I didn't have the language for it, that he could understand that, no, no, that's not how we are to worship. That doesn't put you in touch with God. I realized finally, after we had an argument about it, that for him, all worship is Christian worship is. Is receiving information and experiencing emotion. You know, and so you can do that online just fine. If it's all about inducing an individual emotion and exchanging information, why not online? But what that does is it disembodies you. And one of the things I learned working on this book is how the way we perceive the world formats us. And to get right to the point, if you spend most of your time online, it begins to train your mind and your sense of reality and your sense of ontology into thinking that everything is manipulable. I think that it is not a coincidence that we've seen the explosion of transgenderism and gender dysphoria in the first generation raised online because they're so."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":3465.86,"end":3466.18,"speaker":"Laura Diaz","text":"Far."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":3466.18,"end":3494.65,"speaker":"Rod Dreher","text":"Apart, so alienated from the physical, that they come to believe that, of course, they can manipulate things into reality. All things should be digital. The body is digital. We can impose our will on it. And I think if you get out and touch grass and see people and live in the real world, the physical world, it changes you in positive ways. The less you do of that, the more distorted your perception of reality is. Yeah, yeah, yeah."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":3494.65,"end":3543.29,"speaker":"Jonathan Pageau","text":"Wow. This is great stuff, Rod, I have to say, say that I can't wait to see what you're going to talk about next, because now we're going to know what the future is just by knowing what Rodger is going to write about. But I also want. I want to thank you. You know, I mean, you said it's not a compliment that you mentioned me in the book, but I definitely take it as a very deep. As not just a compliment, but also a kind of responsibility in the sense that, you know, a call to be the best version of myself that I can. You know, these two people that you. That you put me with are astounding people, people I admire, and I also admire you very much, and so I deeply appreciate it. But I also see it as a call to keep. To be the best version of myself. So thanks for that as well."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":3543.29,"end":3600.46,"speaker":"Rod Dreher","text":"Well, keep on keeping on, because you've taught me so much over the years. So has Paul, so has Martin. And I would be very satisfied if Living in Wonder served primarily to be a gateway to Peugeot KingsNorth Shaw, Ian McGilchrist, and all these other wonderful thinkers whom I highlight in the book. Because, look, this is a practical book. It's not just a book of theory. It's a book to help people find their way to God. And look, Jonathan, it's not about re Enchantment in general. It's about Christian re Enchantment. Because as we said at the top of the show, there are all kinds of false and dark ways to be enchanted, and they're out there now. The publisher of this book, Zondervan Executive, sent me a photograph from a bookstore in Mississippi. Mississippi, of all places. He was there a couple weekends ago in A Barnes and Noble big book aimed at young teenage girls about how to be a witch. A witch's handbook."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":3602.06,"end":3622.22,"speaker":"Jonathan Pageau","text":"Yeah, that's right. I mean, that is, that is the. That is definitely part of our society. I see it in my kids all the time, like so many, even when I was a teenager. I remember in my 20s, Wicca was starting to become popular and I had friends because I was in the art world. I had quite a few friends over weekends. But now there's a sorcery school that opened up like two streets from my house."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":3622.38,"end":3623.34,"speaker":"Rod Dreher","text":"Wow. Wow."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":3623.34,"end":3626.18,"speaker":"Jonathan Pageau","text":"It's like, it's crazy stuff, so. Yeah, exactly."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":3626.18,"end":3700.12,"speaker":"Rod Dreher","text":"But, you know, the, the first Orthodox book I read, even before I came into The Orthodox Church 18 years ago was that book called the Mountain of Silence by Kyriakos Marquidis. And it's just basically a book length series of interviews with a monk from Mount Athens who's now a bishop, an archbishop, a metropolitan, and he talks about Orthodox spirituality. You go back and read it now after 18 years, it seems very basic, but back then it blew my mind. All the woo in there, all the real spirit, spiritual intensity. And Marquis says at the beginning of that book that a lot of people in the west think they have to go to Hinduism or Buddhism or some eastern religion looking for that visceral sense of enchantment. In fact, it's right there. In Christianity, it's been preserved most purely on Mount Athos. But in Orthodox Christianity and everyday Orthodoxy down at your local parish, you can encounter it on a very direct level that most people don't even know is there. They just think about the Orthodox Church, if they think about it at all. It's, oh, that's the nice place where you go for the Greek festival. Go inside the church sometime, go pray with the Orthodox, and you will have an experience that you didn't even think was possible."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":3700.6,"end":3717.81,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah. All right, Rod, thanks for your time, everybody. Living in wonder. You can get it and we'll be looking forward to seeing, you know, what you do next. Once again, thanks, and I hope we'll see each other in real life as well. That's always. That's always good for that to happen."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":3717.97,"end":3719.01,"speaker":"Rod Dreher","text":"Thank you. Jonathan."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":3719.09,"end":3808,"speaker":"Laura Diaz","text":"Tucson the weight is over mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iHeartRadio. And you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project. Ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way and and the cost the same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweightloss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com you just realized your business needed to hire someone yesterday. How can you find amazing candidates fast? Easy. Just use Indeed. Stop struggling to get your job posts seen on other job sites with Indeed sponsored jobs. Your post jumps to the top of the page for your relevant candidates so you can reach the people you want faster. According to Indeed data, sponsored jobs posted directly on indeed have 45% more applications."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":3808,"end":3809.6,"speaker":"Rod Dreher","text":"Than non sponsored jobs."}
{"episode_id":"SW - #367 - 2024-12-07 - Rod Dreher - Living in Wonder","start":3809.84,"end":3837.58,"speaker":"Laura Diaz","text":"Don't wait any longer. Speed up your hiring right now with Indeed and listeners of this show will get a $75 sponsored job credit. To get your jobs more visibility@ Indeed.com podkatz12 just go to Indeed.com podkatz12 right now and support our show by saying you heard about Indeed on this podcast. Terms and conditions apply. Hiring Indeed is all you need."}
