{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":0.16,"end":25.12,"speaker":"Jonathan Pageau","text":"And so my. I guess my goal is to continue the conversation from where we kind of stop the last one, which is looking at, I guess, in a certain manner, what. What the notion of agency is, and, you know, how that relates to a person, but then how agency relates to other forms of beings, especially kind of higher beings, the way that we talked about it, let's say, or transpersonal beings."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":25.12,"end":25.52,"speaker":"John Vervaeke","text":"Sure."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":25.92,"end":41.11,"speaker":"Jonathan Pageau","text":"That's really what. I guess that's what we left on a kind of cliffhanger on the last talk. And I saw a lot of people in the comments saying, oh, no, it was the interesting part. So I'm hoping to explore that with you. And so, yeah, if you're fine with that, we'll go."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":41.11,"end":70.45,"speaker":"John Vervaeke","text":"That'd be great. I mean, so the talk I gave at Cambridge was based on the work that I'd done with Chan Chiappi and the three papers I published last year on the NASA scientists maneuvering the rovers on Mars and all that. And then I just did my course on the nature and function of the self. And, of course, relationships between consciousness, self and agency are now fresh on my mind. So I'm really geared to go. I'm really good to go."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":83.09,"end":128.34,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. All right, so maybe I can. I can give you layout. The way that I see it, let's say the first thing that I see is that from a purely physicalist point of view, there's a sense in which either we remove the notion of agency altogether, which I think some people are trying to do, but to me, that just seems ridiculous in the sense that we have a concept call agency, which we. Something. Something like agency, which. Which we've used to talk about the way in which humans interact with the world. So we should at least address what."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":128.34,"end":128.58,"speaker":"John Vervaeke","text":"That."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":128.58,"end":220.08,"speaker":"Jonathan Pageau","text":"Even if it's an illusion, we should see what that is like, what it is that we're talking about. And so it seems like from a physicalist point of view, if we can attribute agency to a person, then it seems like it's odd not to attribute agency to other beings, because then human beings become completely, let's say, a freak thing in the entire cosmos. And so in that sense, that's how, when I look at the manner in which multiple people come together in order to form units, then what I see is a form of agency which comes back down on those people, and that can use people as something like heads. So you have, let's say, a chief or a president or a captain or something, but that captain is not acting only out of his own kind of personal agency, but is manifesting the, let's say, manifesting the rules and the frame of that being in which they're participating. And so to me that looks like in a similar manner in which we do to our parts. Like the manner in which we interact with our own parts, whether it's our different thoughts, our different body parts. And so we have a captain somewhere. Like it's not clear exactly how to frame that, but there's a manner which we conceive ourselves as one. And that manner then creates a form of coherence in the way we act and we interact with the world. So that's kind of the theory that I'm working with."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":220.08,"end":223.28,"speaker":"John Vervaeke","text":"Okay, so did you want me to say something here or did you want."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":223.28,"end":228.25,"speaker":"Jonathan Pageau","text":"To go for it? If you have something that is worth saying after what I said."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":228.65,"end":434.46,"speaker":"John Vervaeke","text":"So on the first point, Yeah, I mean, so I think physicalism trying to do away with agency is, I think is an is. Is a non starter because physicalism is premised on the existence of physics and science. In order to determine its ontology, therefore science must really exist for physics. Science is predicated on rational revision of belief. It presupposes rationality. Rationality presupposes agency in that we correct our thoughts as we attempt to get at the truth. And if that's all an illusion, then rationality becomes an illusion and then science and then the whole thing just unravels. This is why I think reductive physicalism, I think is. And if people want to reserve physicalism for the name the reductive version, that's fine. That's why I prefer naturalism. Right. And one more point, and it's directly relevant to what we're talking about in this argument I just made. Naturalism includes not only what is derived from the sciences, but what is presupposed by the sciences. So rationality has to be part of our naturalistic worldview or we get into all these kinds of contradictions. So on the first point I'm in complete agreement. And what that means is we have to acknowledge the reality of levels other than whatever it. Like the inverted Platonism of physicalism, which is the very, very bottom level, which is some sort of abstract probability math somehow instantiated independent of human beings, is the only really real. We give that up and we have to say no. We have to talk about reality being something that's present on multiple levels. So that's the first point. And so that means right away, and this is something that has been taken up seriously by four Ecognitive science that, as you said, organisms have a reality to them that is more than just the sum of all their chemical components or the configuration. And there's a lot of work going on about that. Then the idea of distributed cognition, which is what Dan and I published on this, goes back to Ed Hutchins. There's no one person that navigates an ocean liner. It's a bunch of people and a bunch of tools, and they form a system and they navigate the ship. The same thing with who's moving the rovers around on Mars. Well, it's no one person. It's a bunch of people. And the rover, because it has some AI and they're all coordinated together in order to do the science on Mars. And so there's a lot of people, Dan and I included, who take seriously the idea of we agency. And then on the participatory side, I've been engaging in a lot of participant observation, experiment and design of people getting into these collective flow states and experiencing something like we level intelligibility, we level intelligence, we level agency. So not only theoretically, but also phenomenologically, I think there's converging evidence towards the reality of what you're talking about. Now, I want to say one thing which is we have to be very careful about this because people too easily skip between agency, personhood, selfhood, consciousness, self consciousness, and those are not equivalent terms. And we can't just sort of slide between them in an uncareful way. So other than that, I think there is a very scientifically legitimate framework for talking about everything you've just been talking about."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":434.62,"end":440.3,"speaker":"Jonathan Pageau","text":"Okay. I mean, and so. But I think that my. Let's say I'm not going to hide what my intention is in trying to."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":440.46,"end":441.58,"speaker":"John Vervaeke","text":"No, no, I know."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":442.46,"end":515.64,"speaker":"Jonathan Pageau","text":"Obviously my intention is to try to bridge something which until recently had been very difficult for people to bridge, which is the notion of higher beings, whether they're conceived of as gods or angels, as being patrons of aspects of reality and kind of, let's say, having a form of agency. And I can concede that that form of agency is not exactly the same as the way that we experience agency. But there's a manner. What I'm trying to basically get to is the idea that the transpersonal beings have an existence. They have an existence that we somewhat participate in by, let's say, circumambulating and by celebrating and by sacrificing to, you know, if you think about the Mars Rover, for example, you will have. You'll have exactly that. You'll find all those elements where the team that you're working with, they kind of have to be proud of what they're doing and celebrate what they're doing. They also have to sacrifice their individual whims and individual thoughts in order to be able to participate in this. This common goal, let's say. And so that's really what. That's what I'm. So do you see that it is possible to bridge those two aspects?"}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":515.8,"end":619.29,"speaker":"John Vervaeke","text":"Well, we'll see. I mean, I think there's definitely. I would definitely want to acknowledge, first of all, Vertesi, one of the ethnographers about the Mars rovers. And she talks about how identified the scientists get with. They feel like almost a magical identity with the rovers. I think I told you about this. They'll be doing things like. They'll say things like, you know, I was in my garden and my right wrist kept getting stuck. And then when I got to the lab, you know, spirit, pun intended. The spirit's wheel was right. Wheel was stuck. I don't know. We're connect like they. So there's clear deep identification. So I think the language of participation is completely appropriate. And other thing. Another thing is Fratesi says, and I don't want to read too much into her because she's not here to speak on her own, but. But she clearly means something by this and she unpacks it. She says that the rover becomes a totem, became a totem for the group. They all saw their identities as somehow collected into it, and they participate in it and it somehow transcends them in very much the way indigenous people had totems in the Durkheimian sense. Third thing, I know when people are in these participant practices that I've been talking about, they start to talk about something like a spirit or a we presence or a logos that's there that seems to be directing the word. The language is kind of fuzzy. Directing, regulating, governing, shaping. Like it's not the same thing as, you know, you pushing a table. Right. It's not like that. But there's some sort of sense of it shaping what everybody else is participating in. So that's a first step in that direction, perhaps."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":620.36,"end":628.48,"speaker":"Jonathan Pageau","text":"Yeah, because it's the same with, let's say, in terms of pushing a table, which is that there's a sense in which my hand is that which pushes the table. Right?"}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":628.48,"end":628.72,"speaker":"John Vervaeke","text":"Yes."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":628.72,"end":654.45,"speaker":"Jonathan Pageau","text":"I'm not the one who pushes the table in terms of actual physical causes. But let's say my will participates in, let's say, directs or shapes the manner in which my hand will push the table. So there's an aspect in which multiplicity in my body, I can perceive that multiplicity in my body exists in an analogical way to the manner in which multiple players in a team or multiple aspects of a city will come together and manifest their unity."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":654.69,"end":743.4,"speaker":"John Vervaeke","text":"And that's the original argument made for sort of extended mind by Chalmers and Clark in a very famous article that has generated endless controversy. Although more and more people in 4E. Well it's one of the four E's of 4E cognitive science. But their basic argument was like any argument you for saying well that's not an agent or a mind. You could turn it inward and say well that's not an agent or a mind either. And so you're making, and this is not to discredit you, this is to give you convergence. You're making the core argument that started the whole idea of extended cognition are not the principles of organization and action relevantly similar. And many people, you know, and Chalmers and Clark are big names and many people like Gallagher and myself and Dan, you know, I think the Hutchins, that's why it's one of the four E's. It's a very, it's considered a very plausible thing. Now where, where we might have a difference and I don't know is that most people who talk about we agency and collective intelligence do not think there is a consciousness there or any kind of self awareness. And so they talk about, and I think I mentioned this at the end of the last one, they talk about zombie agency, which is a funny allusion to both of our previous work. Yeah, so that's one. So that's one of the differences. Now I don't know if that's."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":743.4,"end":759.58,"speaker":"Jonathan Pageau","text":"Maybe I could. The reason why I would push back maybe is because then if we do the same, like if we, if we have the same experiment with us, you know, like do we have real, like those people that talk about zombie agency, what beings do they consider having true agency?"}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":760.22,"end":800.44,"speaker":"John Vervaeke","text":"No, no, no, no. So sorry. Zombie agency means they're real agents, but they don't have consciousness or self consciousness. That's what's meant by it. So the idea is that many things can have real agency. Like for example, a mitochondria is a real agent. But attributing consciousness to it seems for many people a very questionable thing to do. And so similarly the idea is attributing consciousness to these super individual entities is like does science have a consciousness even though there's a scientific Community and we're all working together and it's constantly deeply interpretive. Many people say no, that doesn't seem to. We don't have any evidence for that kind of thing."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":800.92,"end":806.6,"speaker":"Jonathan Pageau","text":"And so would they limit consciousness just to the human person? Is that where they're consciousness."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":807.24,"end":887.07,"speaker":"John Vervaeke","text":"So I mean, so the, the idea is that you attribute consciousness to beings for which you have clear evidence for a kind of internal organization that's analogous to something like our brain, for example. Let's use us. You and I can both move between conscious and unconscious states. I can give you propofol, general anesthetic and you will fall out of consciousness. And then I can bring you out, I can reduce the propofol, bring you into consciousness and then I can note the differences between when your brain's unconscious and conscious and say, look, you need this, it's kind of this fractal small world network organization in order to sustain consciousness. And when you don't have that, you fall into unconscious. And the idea is that you need a certain kind of density of connectivity, appropriate structuring of the communication system. So most people, just to finish the point, most people deny consciousness, for example, to the crew steering the ship because the bandwidth and the speed of the connectivity is too low. Because if that was in your brain, you would not be conscious. That's that. So they, they, they, they take the analogy in both directions basically."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":887.39,"end":894,"speaker":"Jonathan Pageau","text":"And so the, that's it. But the accumulation of connectivity in the brain to other brains is not enough to."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":894.8,"end":925.12,"speaker":"John Vervaeke","text":"So not in, so it's not an objection in principle. Nobody says in principle that we couldn't get the connectivity and the bandwidth and the speed. It's also a speed, right? Because like it's, it's almost like the five phenomena. If the speed gets too low, the things separate, they separate out as separate entities. Like for example, if, if I disrupt your communication between you and your arm and make it too slow, you will start, you'll, you will. Right. You'll lose this, you'll lose the sense of your arm being part of you. Kind of."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":925.12,"end":987.64,"speaker":"Jonathan Pageau","text":"Yeah. But there would be a way in which, like let's say if you. A city for me is the best way to think about it because it's the most, it's the closest in my, my estimation to a human being in terms of analogies is that the speed in which the communication needs to happen at that level is the speed like you said, which is necessary for the beings to continue to cope. The, let's say the lower beings that constitute the higher one are Able to. Coherent, to continue to function in. In their purpose. And so you're right. So if there's a breakdown, let's say, in the email communication between the person managing the roads and the people doing it, then at some point it's going to break apart and then these people are going to start to do whatever they think is right or whatever they want, and then it's not going to. It's not going to. It's not going to connect. But if. If the, let's say the efficiency and the speed of the communication is fine, then they'll continue to fix the roads and continue to do the things they need to do. So it is a reduced speed, but because the being is a different level, the speed doesn't have to be the same, let's say."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":987.8,"end":1068.95,"speaker":"John Vervaeke","text":"Well, but there's a difference, right? Your brain can be highly functional because most of your processing is unconscious, for example. So your brain can be highly functional without rising to the level of consciousness. So it's something more is needed than just functional coordination because there seems to be this other kind of specific kind of organization that needs to be in place. Now, I didn't quite get to finish the point. You didn't interrupt me. It's fine. But like, nobody says in principle that this is kind of a weird horror story. And I don't believe that the neural link that. I'm very suspicious of Elon Musk's claim because most of the science that it was based on has just failed to replicate massively. And so it's like, I caught that. But let's say he was telling the absolute truth, and then we started getting all these neural links and we could really speed up. Then many people say it's possible we could get an emerging consciousness that could be conscious of itself, independent of us. I want to make clear that the argument is not an argument in principle, it's just an argument in practice. It says we don't think, for example, ant colonies achieve consciousness even though they collectively solve problems, because they don't seem to get the tight and dynamically interconnected. And like the massively recursive functionality of our brain, it seems to be missing."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":1069.35,"end":1082.87,"speaker":"Jonathan Pageau","text":"Yeah, because, I mean, an ant colony also doesn't. Let's say maybe it does. I was going to say, it doesn't change with time. It doesn't seem to have an identity. But a city has an identity. You can recognize Chicago from New York."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":1083.73,"end":1108.05,"speaker":"John Vervaeke","text":"Yeah, but see, here's the thing about identity. Like, there's a difference between us attributing an Identity. And you're right, we don't attribute it to the ant colony and we attribute it to New York. But the key thing is whether they are the ant colony or New York attributes the identity to itself. Right. So that requires self consciousness. And I expressed the doubts for why I don't think these entities have self consciousness."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":1108.37,"end":1134.27,"speaker":"Jonathan Pageau","text":"Yeah, I mean it's hard to perceive because we're not at that level. Also we're at the level that we are. You can't, it's like it's hard enough to verify. It's already impossible to verify consciousness of another human person directly. You only verify your own consciousness. So it would definitely be very difficult to verify the consciousness of a higher being because you're not there. Like you're just not at that level."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":1135.07,"end":1152.89,"speaker":"John Vervaeke","text":"But it would be, I mean we would take seriously and this is perhaps where we differ whether or not these events have occurred. Right. If, if that agency started to communicate with us in a self conscious, self identified fashion."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":1153.21,"end":1246.33,"speaker":"Jonathan Pageau","text":"Right. But you wouldn't, let's say if the agency of the city would start to communicate with us, we would receive it at our level. So we would get it as a letter from the city saying that they're making taxes higher. That's how we would get, would come down that way. At the level, let's say, of the level of agency, it would be at a certain level. But at our level it would be like a new law or a new rule or a new boundary or we're going to invade this other country or we're going to defend ourselves from this other thing. And so it activates the lower beings towards a new purpose that the city has contrived. I would think about the unconsciousness and the consciousness. I think that I can see that in a city as well because there's a level of functioning in a city, for example, that doesn't require high level interaction that just kind of runs, right? It just runs. But then something happens like some event that is unforeseen or a change that needs to happen and then all of a sudden everything aligns towards. Yeah like I said, a new tax rate or whatever it is a new law or there's a problem, there's a problem. And it requires all of a sudden the higher levels of the city to activate and communicate down, you know, that that would happen no matter who is there, no matter who the top levels in the city are there. That would happen nonetheless. So it is in a way independent from the agents that are constituting it."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":1246.89,"end":1352.39,"speaker":"John Vervaeke","text":"Right. And that's good. See the difficulty that's facing me in this is. Yeah, and it's not your difficulty. It's not difficulty with you is what I'm saying, is that I think you. All of this makes very good sense for collective intelligence. And I actually argue that there's an overlap between the functionality of intelligence and consciousness, that they're not like this, they're more like this. And so your arguments, like they have force for me, first of all, wanting to acknowledge that I guess what I have trouble understanding. So let me give you the reverse case where most people's intuitions go the other way. So this is a famous argument by Ned Block. Okay? So unbeknownst to you, while you're sleeping, the Chinese government, for whatever reason, for totalitarian reasons, comes in in the middle of the night and puts you into a state of pain and then completely maps out your cortex, right? And then they go to China and they choose China because there's enough people. Presumably it's not quite right, but let's say. And that what we do is we train everybody to hold up ones or zeros at a particular rate to completely simulate the neurons firing. And then what we do is the population of China is simulating right, by holding up the ones and zeros. And it doesn't have to be that they can touch one person or not touch. It doesn't have to be just holding up cards and then they completely map out the same thing. And then does that mean that you've now achieved this sort of state of pain spread over the Chinese countryside? When you ask most people that, they say, no, there's no pain there. There's just cards going up and down. Right. Because it doesn't have the right kind of connectivity and bandwidth and speed in order to give it the phenomena of consciousness. Do you see what I."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":1352.71,"end":1369.33,"speaker":"Jonathan Pageau","text":"Right, yeah, I see what you're doing. But I think it's because you're trying to take the way in which being exists in us and trying to bring it up to the. To the higher level. But in a higher level, I could tell you how to do it to bring a country into a state of pain."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":1369.49,"end":1391.82,"speaker":"John Vervaeke","text":"But I picked pain for reason. Pain goes through all the organisms we attribute consciousness to, from very, very minor worms to us, Right? It seems to be. So there's good evidence to believe it would be part of a hyper consciousness as well. It's hard to find. In fact, I challenge you to find an instance of consciousness where you can't find a creature capable of pain."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":1392.38,"end":1435.82,"speaker":"Jonathan Pageau","text":"So think of. Now think of. I mean, Wartime is a place where you can see your country experiencing pain. Because what happens is that even sometimes the agents that constitute the country, even the agents that constitute the country will sometimes not even be directly affected. That is, they're not starving if they're in a part of the country where nothing's going on. There's no bond going off where I live. But nonetheless, the state of pain will kind of infiltrate the entire identity of that country. And so people will feel pain and anxiety because they're in that country, even though no bombs are falling on them at the time. Do you think that's true, that that would happen?"}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":1436.22,"end":1480.17,"speaker":"John Vervaeke","text":"I think that people feel empathy. But see, the problem I'm having is like the individual neurons aren't feeling pain. It's only at the level of the organization. But in the country, example, there are individual people that are suffering, and then we express the. We ourselves feel empathy towards them. Like, for example, if. Let's go back to the China example. If every time somebody held up the one they were in pain, then we'd go, oh, yeah, there's pain spread across the Chinese countryside. But that's not the example. The example is they themselves aren't feeling painful, just like your individual neurons don't feel pain, but they're simulating the connection while they're enacting the connection. And yet the connection isn't producing to most people's intuition a sense of pain."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":1480.17,"end":1522.68,"speaker":"Jonathan Pageau","text":"Yeah, I think it's. Again, I think the same issue comes about, which is that let's think again about a country that's a war. So let's say your capital is being attacked. It's kind of horrible to use that now because we're actually in the war right now. But nonetheless, I think it's still the best way to understand it. Like your capital is being attacked and you live in the countryside. And so you know that that's you that's being attacked. And even though you don't, Even though you don't, you're not having bombs rain on you, your anxiety and your care will connect you and will maybe even make you like, I don't know, like take up arms and go to the capital to start fighting all of a sudden, because the country is in pain."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":1522.84,"end":1526.54,"speaker":"John Vervaeke","text":"Right. So again, but the pain of the."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":1526.54,"end":1545.42,"speaker":"Jonathan Pageau","text":"Country is not the same as, of course, as the individual pain is. It's an. It's an. Obviously it's an analogy. It's analogical. There's an analogy between how, let's say a higher being experiences pain and how like the beings that constitute it, experience it. It's. But there's nonetheless a sense that this is, let's say, going on. I don't know."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":1545.74,"end":1577.63,"speaker":"John Vervaeke","text":"Okay, so let me try again. And this is good. I think we're, we're, we're really honing in. So we've got clear evidence, some of it almost frightening, that collective intelligence can solve problems that individual intelligence can't. So there's more to that than just the sum of the intelligence of the participating parts. That's one of the main arguments for we Agency collective intelligence. And there was a really gruesome experiment about a guy actually wired mice brains together."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":1577.95,"end":1578.83,"speaker":"Jonathan Pageau","text":"I heard about that."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":1580.11,"end":1621.45,"speaker":"John Vervaeke","text":"But anyways, and hope we never have to do that again and just all accept that that was done, that worked. Yeah, yeah. Right. Okay. So right now do we have anything equivalent to that for saying there's a consciousness above and beyond just the sum, aggregate of consciousnesses of the people that are in pain in, like in the war? That's the missing difference to my mind, I acknowledge, like. So we want to acknowledge at least the distinction between an aggregation and a real unity. Just piling a bunch of stones together as an aggregate. Yeah, right, right. And I see that there's an aggregation of pain in the war example, but I don't see the gestalt that transcends the aggregation."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":1621.77,"end":1635.66,"speaker":"Jonathan Pageau","text":"And so let's say there's no. So there's no. Let's say if there's no aggregation, then what would make the person in the countryside take a weapon and go fight in the capital? What is it that would drive them there? Like what, what, what?"}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":1635.9,"end":1668.53,"speaker":"John Vervaeke","text":"No, no, I think, I think it wasn't clear. I think there is aggregation. What I'm saying is what we want for like an agent. So we have evidence for something beyond aggregation in intelligence, because when you add them together, you get more than the adding of them together. Right. And that's why we. Right. And so I'm saying what evidence do we have that we have anything beyond just aggregating all the individual pains and motives of the people in that particular situation?"}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":1668.77,"end":1716.13,"speaker":"Jonathan Pageau","text":"Well, which is that let's say the person is going to fight for their motherland. Sure, that's what they're going to fight for. They're actually not going to fight for the empathy necessary they have for an individual in the city, because maybe they don't even know a person in the city, but it doesn't matter because they get a sense that my motherland or my fatherland or my country is being attacked. And so I need to defend that. I am. I'm activating towards a higher being. And now I want to go defend it because I am part of it. Like I am a. It is bigger than me. And I. And I know that I'm willing to sacrifice myself for it. You maybe sacrifice my life for it. Because I understand that it's what gives me direction and purpose and, and gives me cohesion with my neighbors and all of that stuff."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":1716.46,"end":1773.07,"speaker":"John Vervaeke","text":"I agree with all of that. I think people can. Again, I think the entity. I'm willing to agree. There's a motherland, right? That England really exists or Canada really exists and that we can feel love for that. But that's the wrong way of the arrow. I was asking. I need to see how the motherland is in pain itself, above and beyond me caring for it. You caring for it. Like, what would be the evidence for that? Like the way you can get evidence and this is a difficult question. I know, Jonathan, because getting evidence for consciousness to across the board is hard. And we both agree on that. I'm not challenging, I'm not trying to make. But like I can point to something is what I'm saying. I can point to here's problems that no individual can solve and only collective intelligence can solve. I can point to them. And in those problems being solved, I have to. I say that's my evidence for why there has to be an agent there, because only that agent can solve those problems."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":1773.31,"end":1789.07,"speaker":"Jonathan Pageau","text":"Okay, so I have an answer to that. And the answer is, it's a very bottom up answer, I guess, is that when we act as if that being exists, then we get better results from when we act as if it doesn't exist."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":1789.39,"end":1789.79,"speaker":"John Vervaeke","text":"Right?"}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":1790.35,"end":1816.95,"speaker":"Jonathan Pageau","text":"If we act as if there is, let's say, France, and that France is that which binds us, that which directs us, that which, you know, that connects us, that connects us to the past, to the future, you know, that, that, that creates a sense of, of unity and a purpose. If I act as if that is real and is a, an agent that acts upon me, then I. Then it will survive."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":1817.27,"end":1858.68,"speaker":"John Vervaeke","text":"No, I think you've got a stronger argument and I'm in agreement with you on this. I think the stronger argument is right, it's not just that problems get solved, that only something like France could solve that, no smaller set of. Just like you can't run the Internet on a computer. You have to have a network of computers to establish an entity like the Internet. There's only certain things that I think the evidence. Now be careful. I'll have to be I don't want to misrepresent, say everybody would agree with me, but the evidence for there being, you know, top down agency and collective intelligence. I think that for me I'm not in, I don't think I'm in any disagreement."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":1858.68,"end":1859.76,"speaker":"Jonathan Pageau","text":"It's the consciousness part."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":1859.92,"end":1896.28,"speaker":"John Vervaeke","text":"It's a consciousness, well, consciousness, self consciousness and something like personhood. It takes a long time, for example, even for a human being to become self conscious and person. And that seems to me. And only certain animals seem to be capable of it. Highly intelligent organisms like cats don't seem to rise to the level of self consciousness because we have no behavioral evidence for it. Right. And so I think you have to have pretty. There's a pretty limited set of conditions that have to apply in order for there to be self consciousness, consciousness, etc."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":1896.28,"end":1955.97,"speaker":"Jonathan Pageau","text":"So there's a manner in which you would be willing to, let's say, understand them as intelligences that exist, let's say, but not necessarily as conscious, which, which I, I'm kind of pushing too because I don't even in the, even in the sense of, let's say, the way that traditionally angels are understood, it's not clear that they're, that they're conscious. They're certainly intelligences. And so if you hear about the way, for example that the fathers talk about the fall of the angels, they'll say something like they fell as soon as they were created. Like they, it was one time they fell and then that's their state for forever because there's a sense in which they're not capable of change, they're not capable of the type of procedure that we're capable of. So I'm also, it's like, I'm also not totally convinced about the consciousness element of it. Like I'm trying to figure out how far I can push it to see if I can perceive it or understand it. But at least even the intelligent part is already to me a lot because."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":1956.29,"end":1984.67,"speaker":"John Vervaeke","text":"I think that's undeniable. But the thing you have with the intelligence is, is that is you have like you can have a location problem that you traditionally don't have for persons. Like for example, where's the agent that's doing the rover? Well, it's on the Earth and Mars and also relativistically time delayed by eight minutes between and like, like, like and like you could sort of zoom out and say, well, it's sort of between Earth and Mars. But they're like, right. And so it gets very problematic."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":1985.63,"end":1989.07,"speaker":"Jonathan Pageau","text":"But maybe agency is not physically located."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":1990.03,"end":1992.99,"speaker":"John Vervaeke","text":"Well, I think agency, because you couldn't."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":1992.99,"end":1994.11,"speaker":"Jonathan Pageau","text":"Where is it in the person?"}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":1994.59,"end":2033.04,"speaker":"John Vervaeke","text":"Well, that's the thing. Right. And so, but, and, but what I'm. I'm not disagreeing with you on this. What I'm saying is we seem to pull because personhood has moral responsibility attached to it, and moral responsibility binds us into causation, like, where are you in the room when Agnes died? Then you could have killed her kind of thing. Right. Because personhood is bound into morality. We seem to put. We seem to need it to be limited, like locatable in a way that we don't have to have the same kind of tight location for agency. That's what I was pointing to."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":2033.52,"end":2086.38,"speaker":"Jonathan Pageau","text":"Yeah. And I was going to say, one of the reasons why I'm kind of pushing this is just. It's actually because of a statement that Christ makes where Christ talks about. He talks about the city in which he is. And he said, woe to you. It'll be harder for you on Judgment Day than the people of Nineveh that will judge you. The city of Nineveh will judge you in the end. So there's a sense in which the notion that the cities are judged, let's say. And so you can kind of understand that even when Christ is saying that, you can understand that he's not saying that there's a judgment upon the city. That judgment doesn't actually necessarily boiled down to every single individual in the city. There's a sense in which there can be a judgment on the city which is real, but that is not. It's not exactly the same as the judgment that would be on each person. Let's say it's like another level of judgment that coexists with individual judgment."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":2086.38,"end":2146.87,"speaker":"John Vervaeke","text":"That's good. Let's play that. When you said that, I thought of Sodom and Gomorrah, the opposite, where Abraham's bargaining and if they're like, you know, 40 righteous people, God for the city. So, yeah, it separates out. Yeah. So that. That's a very interesting thing. And we'd actually wrestle with that in real. Like. So, for example, Post World War II, there was a lot. There was a lot of trying to figure out, who do we punish for the Holocaust. Right. Who do we punish? And we did some sort of. We did some. We created some myths, by the way. We. The Wehrmacht was clean and it was only the SS that was evil. And. Yeah. But attributing that responsibility, it's a project that's still ongoing. Like, as far as I can tell, we haven't come to a final decision about that. Like, are the German people. Were the German people complicit? They were to some degree. How much does that matter? Right. That's really. I don't know. How do you do that? I mean, but it's easy."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":2146.87,"end":2206.08,"speaker":"Jonathan Pageau","text":"It's also easier to. It's harder to like, now let's think of. I mean, I said I wouldn't talk about politics. I told myself that. But, you know, it's hard not to. And so. And so now let's say we put sanctions on Russia, right? So we're judging Russia and we're applying pressure on the country itself as a means to change its course, as a means to affect the direction in which it's heading. And so there's a sense in which when you apply, let's say, a punishment to the country, you're not thinking at an individual level, you're not thinking, who in the country is going to get affected. Some people will. And there's even going to be a kind of unfairness about the manner in which it falls down onto the people of the country. But there's a sense in which we have to act against the country itself in order to affect the direction that it's going. And so there's a sense where you're judging a country or you could do that for other levels. But."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":2206.08,"end":2258.72,"speaker":"John Vervaeke","text":"Yeah, so. So then let's take it. That's a very good point. Then let's take it that our moral judgments can apply to the level of collective intelligence and we agency that did not immediately translate like in an identity relation to a judgment on all of the individuals. I think that is well said. Now, the issue is, do we require, and this gets really thorny, then this is fun. So do we require only agency and intelligence to attribute responsibility, moral responsibility, or do we, it seems that's all we require. But then we have the problem that we tend to think that individuals are only morally responsible if they have an act of conscious intention. Right, Right."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":2258.72,"end":2286.76,"speaker":"Jonathan Pageau","text":"That's true. That's an interesting point. Yeah. If there's no moral intention, we tend to not attribute blame, let's say. Or we. That's our. Usually that's at least. That's the kind of more modern, modern system we tend to attribute less blame at least, you know, if you kill someone deliberately or if you kill someone, you know, in a fit of rage, it's already not the same. And if you kill someone accidentally, then it's not the same."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":2287.64,"end":2322.84,"speaker":"John Vervaeke","text":"So classic examples of where this has come up and whether or not let's not argue about whether or not the case was true. But you know, there have been cases where people have been found innocent because they were sleepwalking when they killed somebody. Right. So part of them is like, is like a zombie. Part of them is an intelligent agent getting out the knife, you know, directing it in the right way. Like all that intelligent agency. It's a difficult problem to kill another person. Right. It's not, it's. Right. And yet they're, they're dreaming about like they're not, they're, they're not forming any conscious awareness or intent. So."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":2322.84,"end":2332.52,"speaker":"Jonathan Pageau","text":"Yeah, and so, but that's, it's an interesting to think about that. So I was thinking about it recently where let's say, I could say, I could say something like, I don't know, Chicago is corrupt."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":2332.84,"end":2333.04,"speaker":"John Vervaeke","text":"Right."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":2333.04,"end":2340.52,"speaker":"Jonathan Pageau","text":"I could say something like that and that would be true. But it wouldn't be true at every level. Like it wouldn't mean that everybody in Chicago is corrupt. And I don't think that."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":2340.68,"end":2341.36,"speaker":"John Vervaeke","text":"Right, right."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":2341.36,"end":2356.2,"speaker":"Jonathan Pageau","text":"I don't think that everybody in Chicago is corrupt. Obviously not. But I can say something like that, you know, and it nonetheless has a truth to it that when I looked at it, when I zoom out, I look at the identity and I see that there's something, that there's something there."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":2356.6,"end":2426.86,"speaker":"John Vervaeke","text":"Yeah, I agree with you and I'm doing the philosophical thing of agreeing with you and then noting how problematic it becomes once we agree because like I said, we seem to do we seem to break a principle when we're talking about human persons. I'll try and. Because I'm going to use the word person to mean a moral agent, not just an agent or intelligent. When we. Right. When we do it, we seem to require the ability to form a conscious self reflective intent in order to attribute at least the most moral blame. But we don't do that for collective intelligence. And that's really, that's really why like. Sorry, I really mean that. Like why, like why, like why do we hold that there? Like if we're trying to modify the intelligent agency. Right. That should seem to be the only. Like why do we care about whether or not, I mean, we do punish people that don't form of conscious intent when we find them criminally negligent, for example. Right. Is that, is it like that? You're really making me wonder here. I don't have any clear or easy answers about. This is very messy ontology actually."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":2427.1,"end":2482.73,"speaker":"Jonathan Pageau","text":"So maybe we can keep, I mean obviously we could keep thinking about it because I'm still I'm in the. I'm in the same position you are. I'm still thinking about it and still trying to figure out how it fits. But let's say at the. At the least, I think that there's a manner in which understanding this, or at least a notion of intelligence and agency can help us understand that the way of representing the world that is more traditional is in line with this. That is that the ancient way of representing the world with gods and patron saints and patron angels. There's a manner in which this is closer to that reality than the one that we have now, which is this kind of the sense in which we don't even have a theory. Like, we do it right. We still celebrate teams, we still have mascots, we still have all these things we rely on, but we don't understand. It's as if it's not part of our worldview, but we still do it at the same time."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":2482.89,"end":2542.27,"speaker":"John Vervaeke","text":"Yes, I want to acknowledge that right up. There's a performative contradiction in thinking that agency is atomic and individualistic and then relying on airlines and electric grids and the Internet and blah, blah, blah, blah, that are clearly cases of distributed cognition and collective intelligence. What's interesting, of course, with something like the Internet is it's this weird blend of humans and computers that is making it and creating it and running it. And it obviously transcends any computer, it transcends any individual brain. And it just keeps growing and developing and taking on properties and a kind of complexity. There's a. I think Sawyer wrote a science fiction novel that, you know, that it's plausible that the Internet will actually achieve the kind of complexity and density and bandwidth we see in a brain. And then it would start to have a kind of consciousness on its own, which is a frightening thought."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":2543.23,"end":2545.47,"speaker":"Jonathan Pageau","text":"I think it definitely already has agency."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":2546.74,"end":2582.47,"speaker":"John Vervaeke","text":"I think that's clear. I think that's clear. And like I said when we were talking last time, in very many ways, people have a sacred religious relationship to the agency of the Internet. They treat it like an oracle, they treat it like a spirit, they treat it like a God in a lot. I find it funny, but in a sort of Kafka esque way that people who claim to not be religious then interact with the Internet through their phones. They devote hours a day and they're paying attention and they're getting advice. It's very, very religious behavior."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":2585.19,"end":2684.25,"speaker":"Jonathan Pageau","text":"One of the aspects of the agency, for example, I think is a good way to understand it. Maybe you can tell me what you think is really even now, using a kind of Darwinian lens, which is that let's say the main aspect of agency is something like self preservation at the level of the being. And so we can say that the Internet has intelligence even to the extent an agency, even to the extent that it just tries to self perpetuate. And the people that are playing roles at the lower level, the companies, the tech people, they want to cap, they know that the Internet exists through attention. And so the entire, the Internet itself becomes, let's say, run by attention. And that attention is what makes it continue to exist. Like the more attention that more people give to the Internet in general, the more that it will, especially in its user interface. Obviously there's a whole aspect of the Internet which is not user. Yeah, not user interface, like wires and stuff like that. But to the extent where it interacts with our consciousness, that's what makes it continue. And so it's as if there's a. The reason why I'm saying that is that there's a sense in which we're kind of doomed if that's the case, because the monster or the creature, the being, it really is asking for worship. Like it appears very low, at a low level, but as it scales up, it becomes more and more evident that it's asking for something like worship, something like primal attention. Like, this is where you get your worldview. This is where you get your information. This is where you get truth. This is where you learn what it means to be human, even almost."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":2684.41,"end":2784.91,"speaker":"John Vervaeke","text":"Yes, yes, I agree with you. I think that the Internet is at least something like a Greek God in the way it encompasses. It's not. Again, it's not in one place. It's ubiquitous. I'm not saying it's omnipresent, but it's ubiquitous. Right? It's ubiquitous and it's coordinating people's lives, lives. It's training people's attention, it's asking for devotion, it's asking for identification. You identify with your avatars and your. Right, there's. Yes, there's a lot of behavior that as soon as you step outside of familiarity and try to look at it through a more anthropological lens, you'll say, well, they clearly have a religion and their religion is the Internet. But I guess the difference for me is, and that's why I use the Greek God purposely. You know, the Greek gods, they had no moral direction. The Greek gods just represent sort of primordial powers and they're important. Later on, under the pressure of Platonism and others, they started to become moral agents. But Initially they're not. And so I guess that's what I was trying to convey when I think the Internet is like a Bronze Age deity. Right? It's. Right. It's like Seth of ancient Egypt or something. It's this power that people identify in and with and does all the things we're talking about. But it doesn't have a moral directedness to it. It's not an agent that is self organized towards helping us become wiser, which I think is. That's an important difference."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":2785.31,"end":2845.39,"speaker":"Jonathan Pageau","text":"Yeah, I mean it is like you said, it's looking for propitiation and it's looking to be satisfied. He's looking for. To capture, to capture us so that we could, because we can sit, constitute its body in a certain way. Like in the same way that, if you understand the way a Greek God would function is that the Greek God would have temples with people sacrificing animals to the God in order to provide body for that God in the world. Like places where they step, let's say, and they have anchorage. And so that's what we are for the Internet. We're basically the anchorage. Because without us, the Internet obviously doesn't. The Internet needs us as a body. But I think also the Greek gods and the ancient gods needed humans as a kind of body, you know, in order to celebrate them and to make them, let's say that there will be done in the world. You needed humans and casts of priests and all these things that would enact the, the. Enact the identity of the God in reality."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":2846.44,"end":2909.12,"speaker":"John Vervaeke","text":"Yeah, and I think that, I mean, speaking as a naturalist, I think that was the reality of. It still is. I'm not saying I believe in Zeus, but there's a sense in which Aries is taking shape in Ukraine right now and war is this thing. Pathetically, maybe it's the most collective thing we do. And so thinking that war can't take on a life of its own. Look, we are terrified, not unjustified, that if we do anything wrong, this will spin off. Well, no one person is going to make that happen. And that ability for things to spin off and consume us. That's Ares. That's the Greek God Ares or Eros. Eros, if you don't believe that Eros is real. Wow. I don't know what that means. So yeah, and I think the Internet is like that. So I guess. Can I ask you. And I mean this is a. Like, why is this important? Like what?"}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":2909.28,"end":2910.56,"speaker":"Jonathan Pageau","text":"Why, why is it important?"}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":2910.64,"end":2913.68,"speaker":"John Vervaeke","text":"No, no, no, no, no. That's not an insult."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":2913.92,"end":2915.52,"speaker":"Jonathan Pageau","text":"No, no, not at all, not at all."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":2915.52,"end":2925.21,"speaker":"John Vervaeke","text":"As a cognitive scientist, I'm very interested in this. We're really trying to understand intelligence and agency and that. And so I want to know what your interest is in it."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":2926,"end":3120.56,"speaker":"Jonathan Pageau","text":"Well, I think that my interest is really to be able to help people understand, and not only understand, but participate in a proper manner in the way in which the world exists. And so if we understand that the world actually exists this way, and if I can convince people who at least until recently were materialists or physicalists that this is actually how the world works, then how do we do it properly? What's the best way to. To engage with the reality of higher beings and their agency and their intelligence? What's the most appropriate way? And like you said, there's a manner in which you can see the world of tribal gods that existed in the ancient world and what that led to and what that brought about, even human sacrifice and a very dark reality often that involved sex and involved all kinds of stuff that was going on in order to give body to these gods. And so the question is, once we realize that this is so, I would go as far as to hope that people can understand, for example, something like if you sacrifice to a God, it works. It's not just a thing people do just for fun or for whatever. It actually will engage the agency of the God back into the world. If you sacrifice to a higher entity, it's harder for people to understand the idea of sacrificing an animal. Fine, let's just keep it to attention for now, at least for people could understand. If you sacrifice something precious that you have your attention or your money, if you give your money to a cause, or if you give something to a higher being that will engage it back down into reality, both by your dedication, by your tension, but also by the fact that you're willing to sacrifice something precious for it to actually exist. So that's really why it's important to me, because I feel like this is a bridge that a lot of people can see in front of them they're not totally willing to cross yet, but that if they can cross it, then we can reconnect, I think as much as possible the religious world with the scientific world that we can help people, even scientific minded people, understand that they are already religious, that they do these things, but they do it unconsciously, in a little, in a messy manner, but that there are ways to engage in a more proper and a more. You know, like you said, the ancient gods, they didn't care about you like, they just wanted their. They wanted to be fed, and then maybe you would get something from them. But there's a manner in which that transformed with time. Then you get to religions like. Like Christianity and within other religions as well, that understand that at the top of all of this, there's love, and that that is what has to kind of come down into these different agents. And that we do conceive that there are agents that are different, that are demons, that are wild and have their own will and will suck you into themselves and will kind of devour you. And we understand that, but we also want people to reorganize their attention and their will towards that which leads towards infinite love, you could say. So that's. That's really the purpose of. That's why I care about this so much."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":3120.8,"end":3238.75,"speaker":"John Vervaeke","text":"That's. That's very helpful. Thank you. I might want to recommend. I recommend that you might want to read Luhrmann's book, How God Becomes Real. Don't be put off by the title, because she's talking about, you know, the different kind of reality that these agents have. And she's a great anthropologist, and she's basically arguing that we have different senses of real, and we can't use the real we, when we talk about a rock being real for how these things are real. And we're already getting that. I mean, I think evolution is real. That doesn't mean I can point to it. There it is. There's its location. Right? And like, it's a hyper object, to use Morton's term. So I guess that's one thing I want. I want to bring up now that that's why Luhrmann came to mind, first of all, to recommend the book to you. But there's also a notion of aspects of reality there that are hyper objects, let's say, like. Like, say evolution or global warming. Like, you can't. There it is or there it is, or like. Right, But. But you can't say, well, it's not real, so it's not an object. This is why called hyper object. Now, Dan and I have been making the argument that it takes something like distributed cognition to be able to come into a realization of these hyper objects. Like, for example, global. Like no one person can perceive global warming. You need people all over the globe and all these equipment and all these computers before you can say, oh, there's the real pattern. Do you understand what I'm trying to point at? And so I also wonder if there's a sense in which I'll try this And I'll probably mungle it. But this idea that these collective agents also give us access to real patterns that we couldn't have access on our own, did that make sense?"}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":3240.59,"end":3275.25,"speaker":"Jonathan Pageau","text":"Okay, okay, it makes sense. Like if you think of. Even at a smaller scale, like if you think, for example, of even of a famine, for example, or of a war is the same thing where you need these, these higher beings to understand that it's not just me that's dying of hunger. Right. I need to be able to perceive at what scale this is happening. And then in order to engage it properly, then like you said, there has to be a scale, a scale at which it makes sense to act, a level at which it makes sense to act in order for these, these hyper. Whatever you call hyper objects to be dealt with."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":3275.62,"end":3294.98,"speaker":"John Vervaeke","text":"Yeah. Like there's phenomena that are real that affect us but don't affect us the way physically, like spatial, temporally limited objects affect us. Like tables and chairs and rocks and things like that. Evolution and global warming and, you know, economies. Economies are hyper objects."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":3296.1,"end":3353.23,"speaker":"Jonathan Pageau","text":"I think the fact that you separate those to me is what maybe surprises me because to me, like, all beings are constituted by that they an identity, a pattern and a body. And that that body doesn't. Could be subtle. It doesn't have to be physical. Like. Right. So a story has a pattern and a body, but its body is not. Is also. It's not. It's a subtle body. It's not a. It's not a physical body, let's say. And I think that that's true of just all being. So the idea that they're like a table is also that, like a table has a pattern and a purpose. And that's how you can recognize that it's a table and engage with it as if it's a table. So, so does global warming. Let's say it's just bigger or it's just. Just not. It's not. It's not at a level that I can perceive at a glance with my eyes. But like, I'd say there are other types of beings that I don't necessarily perceive with my eyes but that have. That have being."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":3353.87,"end":3441.47,"speaker":"John Vervaeke","text":"Right. The point I was making was not an ontological point. I think that they're all real. That's the point. So I wasn't making any kind of ontological distinction. I was making. I was. I was making an epistemic distinction to try and explain a kind of confusion I thought might be helpful to your project. Because I think what I'm saying is and this is, you know, you can see this in Marleau, Ponty and others, and obviously in Plato. Right. Is that, you know, and Sandy makes this argument about Plato's Parmenides is that we use the familiarity of how we realize perceptually limited, specifiable, temporal, spatial. We use that as the universal standard of being real. And that actually blinds us to the idea that. To realizing that there are many of these realities that can't be grasped in that manner. That's what I would. That's what I would. So I guess I'm sort of suggesting to you that part of the problem that your project is facing is that you're not just. I mean, one part of it is a truly philosophical, metaphysical thing, and we're talking about it here, but another might be a confusion in your audience in that they are bound to the attribution of like kind of a very simplistic nominalism. Only raw spatial, temporal objects exist and everything else is an illusion. I mean, that seems to me to be possibly also what is perhaps thwarting you. Is that a possibility?"}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":3442.27,"end":3518.28,"speaker":"Jonathan Pageau","text":"Maybe. I mean, I'm hoping that most people that listen to me by now, like they're past that. I hope so. It's possible that there's still people that are there, because I see it. Some people are confused when I say things. Sometimes when I say certain things exist and they're like, what? How can you say that that exists, that there are different manners in which things exist? I think that, like, for me, the. For me, the biggest obstacle, I think, is finding a language that would make it understandable and appropriate to talk about how being stacks up and scales towards higher beings and higher agencies to find a way in which people can. Because it's difficult. The difficulty is this. If I talk about angels, then people think of. People have such fantastical ideas of what angels are. It's all science, it's all fantasy, and it's all weird ideas of people with angels that exist in other dimensions or whatever it is that they think. So it becomes almost impossible to use those terms anymore because all of a sudden people think of angels as physical beings that are invisible. Basically, is what they think. Yes. And so how. What language can I use to help people bridge back into a more traditional vision of what higher beings are? Higher intelligence."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":3519.63,"end":3576.79,"speaker":"John Vervaeke","text":"I'm going to push back on you a little bit. Not in the content. I totally agree with that project and I hope we can continue to be partners on it. Because, I mean, that's what I mean about the Neoplatonic. Courtyard, as opposed to the courtroom of debate. Like getting this kind of ontological framework that allows us to do this. However, the pushback is this. And this is something that again has been deeply impressed upon me by Plato and Marlowe Ponty, how difficult it acts. We can know this sort of propositionally, but I think it takes transformative practices to let go of the reifying mind. Right. You know, and I'm reading Maximus and I see that in him. I see that obviously in Dionysus. Right. It's all through Plato. Right. It's like in the Parmenides, Socrates knows the theory of the form and. But Parmenides comes in and crushes him because although he can make all these arguments, he's clearly still working within that. That reifying grammar."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":3576.79,"end":3578.11,"speaker":"Jonathan Pageau","text":"Yeah, I see what you mean."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":3578.11,"end":3578.47,"speaker":"John Vervaeke","text":"Right."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":3579.27,"end":3589.43,"speaker":"Jonathan Pageau","text":"In fact, in order to perceive this, it's not about thinking and arguing. It's about participating through like mystical prayerful practice. That would actually make you."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":3589.67,"end":3602.63,"speaker":"John Vervaeke","text":"And dialogical practices too, because that's where I see people getting. I don't want to put them exclusive. I think you need to be doing both and they need to be sort of helping each other along the way. That's what I'm proposing."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":3602.87,"end":3647.95,"speaker":"Jonathan Pageau","text":"Yeah, that makes, that makes a lot of sense. But I think you've already, you've already kind of helped me to, to understand what the issues are and to kind of. To kind of push in a way. But even like the, the consciousness aspect is one, which I was. I'm trying to push against and trying to, to see if there are ways to perceive consciousnesses at, at those levels. But it's. I realize that even in the fathers, there seems to be some ambiguity about. About that, you know, and you see it in even. I've read some, some rabbis, let's say, the way they talk about angels as well. And there seems to be some ambiguity about whether or not we could say they're conscious in the way that we are conscious. Let's say there's more. But they're definitely intelligences that are agentic. But they don't have. They don't have this. They might not have the kind of self consciousness that we experience. Not sure."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":3648.03,"end":3656.7,"speaker":"John Vervaeke","text":"Yeah. You know, and then we have to also be worried along with that ambiguity. We have to be worried about anthropomorphic bias. Right. And."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":3656.86,"end":3698.02,"speaker":"Jonathan Pageau","text":"But that doesn't. The anthropomorphic bias doesn't bother me so much in the sense that I think that it seems as if there's probably a reason for that. Like there's a reason why we view reality through the mirror of our own, of our being. Right. Where we tend to project the human level of reality into different levels of reality, because that's the level where we are like, there is no other. We don't know of another point of consciousness by which we can interpret the world. This is the only point of consciousness that we know. And so we tend to use that as the measure, we could say of other beings. And I think that. That somewhat inevitable and maybe not that big of a deal."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":3698.42,"end":3770.93,"speaker":"John Vervaeke","text":"Well, I mean, let me. I mean, the anthropomorphism can be a little bit more specific. Let me try and give you an example of where I think it can be problematic. We sort of figured out, at least in our culture. I don't want to presume on other cultures that children are actually not just little adults. Right. Only sort of, you know, in the last couple of centuries. I mean, if you go back to earlier periods, John Locke, for example, thought the only difference was just how much information they had in their brains and things like that. And so, I mean, that's an example also of a version of the anthropomorphic. That every human, exactly, is an adult and they're not. And it's been, I think, very. I think. Not that there hasn't been negative consequences, but I think on the whole, realizing that children aren't little adults has been a very positive thing for children in terms of how we treat them and educate them and things like the fact that they used to try children and convict them of crimes, like things that we would find, like, horrendous nowadays. Right. Things like that. That's what I mean about. We can overestimate how much things are like us, too."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":3771.57,"end":3792.58,"speaker":"Jonathan Pageau","text":"Yeah, that makes sense. Definitely. Definitely. Listen, I think I will now need to think about all our conversations, but I think it's great. I think it's great. I really feel like I'm kind of moving. I'm moving forward and trying to. You're the best person to kind of put my arguments against. And so I. I think that's. That's good."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":3792.82,"end":3815.77,"speaker":"John Vervaeke","text":"Likewise. I mean, like, there's enough of. I hope you don't take this as any kind of insult. There's enough of a sort of shared Neoplatonic outlook that allow us to get into some very good discussion. But there's enough differences between us that we both also, you know, generate insight in each other. And I think that's really good. I think that's really good."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":3815.77,"end":3823.17,"speaker":"Jonathan Pageau","text":"Definitely. Definitely. All right, so we'll have to. I have to keep thinking about it. And we'll have to organize another. Another discussion at some point."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":3823.25,"end":3828.29,"speaker":"John Vervaeke","text":"Yeah. Yeah. Because there's one thread I'd like to come back to at some point."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":3828.37,"end":3828.85,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":3829.17,"end":3878.05,"speaker":"John Vervaeke","text":"Which you made and you made a point. I didn't challenge it and I didn't mean to challenge it. I don't want to challenge it. I want to explicate it. The idea of meaning in life as this sense of being connected. And one of the problems that if you go to Susan Wolf's. Right. Being connected to something bigger than yourself. Right. And Right. And then she says, but there's things that. She doesn't think there's any objective reality to that. And that's the problem facing us. But you said, you know, people get a meaning in life because they're connected to this and what it does have at least a semi autonomous kind of existence. Then that relationship is a real relationship. It's not just a. It's not just an as if relationship. And that might say something about the project of meaning in life, about this kind of connectedness to these kinds. These kinds of transpersonal agents."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":3878.29,"end":3913.2,"speaker":"Jonathan Pageau","text":"Yeah, that makes sense. But also you could understand that even. Let's say that that would come even as your, your, Your experience as a child and having a relationship with your parents. And you. I think that probably as a child you would almost experience your parents as transpersonal in the sense as higher beings than you. Like you said, you see them as these higher things. And so it would make sense that also, then that would be an image. Like the idea that God is our father would make sense in that way. It would make sense even in terms of our actual experience, of how we experience authority and how we experience our fathers as children."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":3913.6,"end":3927.19,"speaker":"John Vervaeke","text":"Exactly. And theoretically that might mean there's deep connections between attachment and meaning in life. The kinds of connections might be more similar than we usually think they are. I think that's a very interesting idea to consider."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":3927.51,"end":3940.55,"speaker":"Jonathan Pageau","text":"Yeah. But then you can see also how someone who. I mean, you can also see how it goes awfully wrong. Like he kept. Right away, I'm seeing all these examples of how it can go completely, completely off the rails, which is of course the danger of attachment to."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":3940.79,"end":3954.83,"speaker":"John Vervaeke","text":"Oh, totally. Right. Just like I think you can't reduce meaning in life to morality. I don't think you can reduce morality to meaning in life. Like you either. Reduction is a, A serious missing and a serious mistake. Yes, I totally agree with that."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":3954.83,"end":3984.99,"speaker":"Jonathan Pageau","text":"Yeah. And. And it's interesting because attachment to higher purposes is not the same as morality. Right. There is a morality to it. Like you, ultimately you would want those higher purposes to be right, you know, to be true, let's say in the moral sense. But then you can all. Obviously you can, you can, you know people, everybody knows people, or it's happened to you where you get involved in a higher purpose that is just pointless or either pointless or even dangerous or not good for you or for others."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":3985.31,"end":4020.18,"speaker":"John Vervaeke","text":"Yeah. Chris, Master Pietro and I are working on a new series of Socrates and Kierkegaard and now we're bumping up against the teleological suspension of the ethical Right. And so. Yeah, well, anyways, I'd like to talk to you about that at some point. To what degree does meaning in life depend on people coming into resonant living relationships with these higher order agents? Does that make life more meaningful? If it does, how and why? What are the dangers?"}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":4021.06,"end":4082.89,"speaker":"Jonathan Pageau","text":"There's a way in which, at least the way it's expressed in Christianity is really, is interesting. In Saint Maximus, for example, like there's a sense in which the bond of love you have towards God is expressed in the bond of love you have towards each other. Right. That's what Christ says. And so there's a sense in which the, you know, let's say the love you have for your neighbor is the manner in which now you're attaching yourself to these higher, to these higher beings. And so it's like there's a. That's how the scalability happens. Like you bind together and then that if you bind together towards something which is above you, then it all kind of works because you, you know, and everybody knows of that they have a higher purpose that actually like a vampire that sucks the energy from all the things inside and then just discards them as it moves forward. You know, it's like a kind of pathological organization that just sucks the energy and doesn't create the bond inside in order to make a real kind of fruitful body, you could say."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":4083.17,"end":4100.93,"speaker":"John Vervaeke","text":"That's very cool. Yeah, I guess. So I want to talk about that and also like the other thing, because most of the discussion, and quite rightly so, has been sort of bottom up. But there's a sense in which, right, there's, there has to be some discussion of what's, what's the top down aspect of these things."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":4101.09,"end":4122.01,"speaker":"Jonathan Pageau","text":"I mean, the top down aspect is mostly identity. And that sounds like it's a weird, it's a weird thing for people. They think like, why does that matter? But it's mostly it gives you, it makes, it's that what makes you participate. And so there's that and purpose, like purpose, like higher purpose and higher identity is what. Is what comes from above."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":4122.25,"end":4176.54,"speaker":"John Vervaeke","text":"But there's also. I agree. I guess my question was a little askew. What I meant is we sort of got like there's all these causal interactions, right. All the soldiers are fighting and that makes Aries. But there's also all kinds of constraint, like factors that also make that take the shape it does. Right. So the analogy I'm giving, like, you've got, like, you have to have all these environmental constraints for a tornado to take shape. The tornado is actually driven by heat and all that stuff and the motion. But you also have to have all these differences and constraints in place. That's what I'm trying to get at. And you can think about, like something really interesting with your city example. You've got all the people and they literally make laws, but then the laws constrain the people. And then like, you get bottom up, top down stuff happening. That's what I. And I want to press that analogy to other things."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":4176.78,"end":4197.93,"speaker":"Jonathan Pageau","text":"Yeah, definitely. That's definitely something I'm interested in, for sure. I mean, I tend to think top down more naturally. The last five years of my life has been like an experience in trying to express this bottom up as much as possible to kind of get people to understand what we're talking about. But definitely the top down part is important to explore, for sure."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":4197.93,"end":4204.69,"speaker":"John Vervaeke","text":"And I think the bottom up and the top down are equally scientifically valid. Like they're equally scientifically legitimate and important."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":4205.09,"end":4217.41,"speaker":"Jonathan Pageau","text":"Yeah. But I'm happy to see you're reading Maximus, because I feel like at least my experience is that in Maximus you really have one of the best expressions of how those two kind of come together, how they're."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":4217.87,"end":4218.11,"speaker":"John Vervaeke","text":"They."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":4218.27,"end":4238.11,"speaker":"Jonathan Pageau","text":"They depend on each other. Right. They. There's a sense in which the bottom up, you know, expresses. I mean, my brother talks about it in his book, by the way, very, very well. Right. It's like there's information, the top informed and the bottom embodies or supports, you know, and that these two things must happen at the same time for reality to manifest, let's say."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":4238.19,"end":4255.25,"speaker":"John Vervaeke","text":"Yeah, I'm trying to read all the great synthesizers Maximus. I'm reading Balthazar's biography on him as well. And obviously Aquinas, especially the new Neoplatonic interpretation of Aquinas. And of course, Erigina."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":4255.97,"end":4259.09,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah, I know you. You talked about him quite a bit."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":4259.49,"end":4285.74,"speaker":"John Vervaeke","text":"Yeah. And so it's amazing to me how, how all of These. These great synthesizers seem to be converging. They obviously have important differences. And for Christians, I know those differences are doctrinal and kinds of things, but there's also a deep convergence on this shared ontology. And I think that's really something that's really catching my attention. I'm really trying to let myself follow that as deeply as I can right now."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":4285.74,"end":4291.42,"speaker":"Jonathan Pageau","text":"That's great. Yeah, I mean, I'd love to hear more about that too. So we'll have to. Yeah, we'll have to set it up quite soon."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":4293.82,"end":4303.97,"speaker":"John Vervaeke","text":"Well, I think we're sort of drawing to a close now, but this has been really, really, really good. I always look forward to talking to you. I think it always goes in wonderful places."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":4304.93,"end":4316.37,"speaker":"Jonathan Pageau","text":"So definitely I do. I hope we get a chance to be in the same place again, you know, soon. Feels like as things are kind of falling down, all the mandates and stuff like that seems like it could be more possible."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":4317.01,"end":4323.81,"speaker":"John Vervaeke","text":"Yeah, I hope so. I mean, I hope someday still that you and I and Paul get to be physically co. Present and do some."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":4326.31,"end":4330.07,"speaker":"Jonathan Pageau","text":"That would be wonderful. I would really love that. So. Yeah. All right, John, it was good to talk to you."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":4330.15,"end":4331.83,"speaker":"John Vervaeke","text":"Excellent talking to you. Thank you, my friend."}
{"episode_id":"SW - #225 - 2022-03-31 - John Vervaeke - Angels in Scientific Terms - Part 2","start":4332.39,"end":4394.48,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon, the Pageau videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
