{"episode_id":"SW - #042 - 2019-07-13 - Understanding the Last Judgement","start":1.28,"end":2.92,"speaker":"Jonathan Pageau","text":"On this episode of the Symbolic World."}
{"episode_id":"SW - #042 - 2019-07-13 - Understanding the Last Judgement","start":2.92,"end":6.84,"speaker":"Jonathan Pageau","text":"Podcast, I am playing for you a discussion that I gave, a talk that."}
{"episode_id":"SW - #042 - 2019-07-13 - Understanding the Last Judgement","start":6.84,"end":9.52,"speaker":"Jonathan Pageau","text":"I gave at St. John Chrysostom Byzantine."}
{"episode_id":"SW - #042 - 2019-07-13 - Understanding the Last Judgement","start":9.52,"end":11.44,"speaker":"Jonathan Pageau","text":"Catholic Church in Seattle last year."}
{"episode_id":"SW - #042 - 2019-07-13 - Understanding the Last Judgement","start":11.6,"end":90.2,"speaker":"Jonathan Pageau","text":"And it's an explanation of the icon of the Last Judgment. That icon is one of the most complex icons in the tradition of the church. It is also a culmination of iconography, just as the story of the Last Judgment is a culmination of all the history and all the prophetic lines that come before in the Bible. As you know, like most of these talks, this is taken from my YouTube channel. And if you want a visual representation of the icon of the Last Judgment, I encourage you to go check out the YouTube video to get that image. You will find the link in the description. And always remember to check out the symbolicworld.com our website, where I post the links to all the videos, where I have my reading list, where I also have some benefits for all those that support me financially. If you want advance previews to videos, Q&As and all special goodies, please consider supporting me atthe symbolic world.com or on Patreon and Subscribestar. Once again, all those links are in the description. So thanks, and I hope you enjoy the talk. This is Jonathan Peugeot. Welcome to the Symbolic World."}
{"episode_id":"SW - #042 - 2019-07-13 - Understanding the Last Judgement","start":100.74,"end":3171.73,"speaker":"Jonathan Pageau","text":"Thank you for inviting me to your parish and to your city. I've been with my family, and I have been staying with Julia for the last few days, and she's just taking us on this amazing ride. And, you know, we're visiting Seattle. We're doing all these crazy things, and it's just been. It's just been really amazing. So I'm really happy to be here with you. I'm gonna talk. I'm gonna talk about the Last Judgment. Hopefully I can make it cheerful. The reason why I wanted to talk about the Last Judgment is because, first of all, it's one of my favorite icons. And it's one of my favorite icons because just like the Last Judgment or just like the end, just like that moment where everything comes together at the end, the icon of the Last Judgment is actually an amazing synthesis of all of iconography. And in the Icon of the Last Judgment, we find all elements. You'll see, as we kind of move through it, we find elements and structures which are in all our icons, but brought together into this one kind of gigantic icon moment. And so it's a. It's a good way to kind of understand also what iconography is working towards. One of the things that's important to Understand is that the early church, and even today the church, even the building of the church, the way that it was conceived, is based on the Last Judgment. So the early churches, even if you go to Rome and you see some of the early churches, you'll see that what's represented is. Is this eschatological moment, right? So for those who don't know eschatology, is this coming, this coming of the last thing, this coming return of Christ, but also that moment where everything is going to become clear and everything will be revealed in its totality. And so the church was made that way. The early Christians, things were. It was a bit complicated the way they were set up. It's a bit different from now, but. But they would. The Christ that we see here in the dome of the church is the returning Christ. It is Christ who is returning. And so to understand the icon of the Last Judgment is also to understand kind of the total visual tradition that the Church has given us, as much the sacred space as the way that the images have been laid out in the sacred space. Because it's not. Nothing is arbitrary. Okay. And so we're going to look at the icon of Light Judgment. I'm going to just kind of work through it, and I'm going to try to help you see how it's connected to the other icons and hopefully how it ultimately connects to our own life and to that. It is actually not just an image of this cosmic moment of finality, but it also shows us the very process by which we attain to that moment, the very process by which we can enter into the Resurrection. All right, so the way that the icon is built, you have to see it kind of in two ways. You see it from the top to the bottom. So there's a vertical reading of the icon, and then there's left to right. Okay. So if you look at it, you can see that I chose this one particularly because it's very clear. There's, like a line that goes straight down the middle of the icon which separates it from with. With the left hand and the right hand of Christ. Okay. And then there's also different tiers of the icon which represent that, this vertical reading. Okay. So the first element we need to look at, of course, is the central element, the one that pulls our eye in. That kind of brings us the first thing that we notice as we look at it is, of course, Christ, who's there at the top of the icon and who is represented as this returning Christ, the Christ in glory. And like I said, this image of Christ is also the image of Christ in the dome of the church. It's Christ in glory who is returning in that final moment. But it's not just, how can I say this? It's also Christ in every icon. That is the way that Christ is represented in our iconography. The fact that he's. If you look at Christ, he's not 100%, but in so many icons he's represented wearing this vestment, which is a Roman vestment of a senator, so a vestment of a high ranking person. Ultimately, it becomes this notion that Christ is like the king, Christ is like the emperor. Christ is this high figure. And so that's how we represent Christ in the icon. Because Christ obviously in the first century did not go around Galilee wearing a clavis, which is this sign of Roman nobility, you know, with a very fancy Roman dress. That's not how Christ physically dressed. Obviously not. But the reason why we represent Christ that way is because we're always looking towards that eschatological moment. We're always trying to show what all of this is leading us to. And what it's leading us to is this moment where everything will become clear and Christ will return in glory. And so if you look at the images that you have even in your parish, you know, if you see Christ raising Lazarus, or if you see him at the resurrection, you'll notice that he's always dressed as. He's always presented as this glorious Christ. Okay? And so Christ is sitting on a rainbow and he is returning. You can see the same image right there. You look at it over here, it's the same way that he's represented at the Ascension. And the reason for that is technically it's because that's what they said the angel said. Just like he went up that the same way he's going to return. But it also helps us to understand that in the icon of the Last Judgment, this image of the Ascension is also brought into this image. It's brought into it. And the way that the Ascension is represented shows us these two tiers. And so we have Christ who's ascending as the head of the church. And then under, we have the Church itself, which is represented first of all as the Mother of God in the center, and then the apostles that are on the side. And so you have these two tiers, you have the head and you have the body. And so the Ascension, that image, it could almost be the return of Christ because that's also how Christ returns. He's going to come back and manifest the unity of the head and the body. The total unity of the head and the body. All right? And so next to Christ is the Theotokos, the Mother of God on his right, and then St. John the Baptist on his left. Then continuing on that side, you have St. Peter, who's on the right of the Mother of God. You have St. Paul, who's on the left of St. John the Baptist. That's what we called diocese. Okay? So the diocese is the basic pattern of all, once again, of all of iconography. Christ in the center, flanked by different saints in a sort of hierarchy, usually the Mother of God to his right, St. John the Baptist to his left. You see that often. You'll see it in an iconostasis, for example. Okay, so in the iconostasis, it's not. It's not a hundred. It doesn't have to be 100% this way. But often in your iconostasis, you have that as well. To the right of Christ is his mother. But then often in the iconostasis, we'll have. To his left, there will be. There will be St. John the Baptist. Okay, and why do we. Why do we. Why do we have those two? Right? Why do we have those two? Because those two are the ones who pointed to Christ. They're the ones who said this one, right? His mother by burying him, and St. John the Baptist as also. As also coming before him. But there's more than that. There's more than that. Okay? And already we're going to start to see this other separation of the icon between the right hand and the left hand. Okay? And so of course, we know when we. When we have the right hand and the left hand, we think immediately of the parable of Christ and the sheep and the goat. So this is actually one of the earliest images of the Last Judgment. This is a 6th century image from, from Ravenna. And here it's very simple, right? There's Christ in the center, and then there are the sheep to his right and the goats to his left. And there's St. Michael on his right and Gabriel to his left. Okay, go back here. And this is going to. It's going to be the first sign to help us understand that this is really a cosmic image, because we tend to think of the right hand of Christ as good and the left hand of Christ as bad, but it's not necessarily so. Right? There is. There are. There are positive aspects to the left hand of Christ as well. And we see those in St. John the Baptist, in St. John the Forerunner, we see what I would Call the positive aspect of the left hand. And so what does Christ say to the sheep and the goats? He says to the sheep, and the goats says to the sheep, come, right, come in, Come, come into the kingdom. And he says to the goats, move away, move away. Now, that is what we see. The Mother of God is everything. That is the right hand. In the positive aspect of the right hand, she is covered, right? She is brought, she's hidden, right? She's inside. She is an image of this bringing in. And that's what she did to Christ. She gathered humanity in her womb so that it could receive God, you know, in her womb. And so that is this gathering. And the Mother of God is almost always has this all this whole notion of gathering. And we even in our own interaction with her, that is how we see her, as this mother that gathers in, okay? And then the St. John, the forerunner, he is the wild man. And so he is that. He's the very opposite. She is closed, hidden. She is completely covered. And he's wild and his hair is crazy and he's wearing sheepskins, and, you know, he's living out into the desert and he's screaming to everybody, repent, Repent, repent. And the Mother of God, she's in secret, she's in silence. And we encounter her in that silence and in that secret, okay? And so we already have this right hand and left hand, but like I said, it doesn't. It's not necessarily negative. And then if we move just a little bit further, we see St. Peter on the right of Christ. Okay? St. Peter. Who's that foundation? Who's that rock? The imagery of St. Peter is that. That image of the. Of the foundation, Right? He's the apostle to the Jews. So he's this. This rock and the apostle to those that are the inside, those teach those that are on the inside. And who's on the other side? Right? It's the Apostle Paul. Who's the Apostle Paul? First of all, he was a strangely, a Roman citizen, and he was the apostle to the Gentiles. He's the kind of somewhat legitimate, you know, apostle, the 13th apostle. He, you know, he comes on the fly and then he goes out to the world and he preaches to everybody, okay? So you have this image of this moving out, but this image of the moving out is a positive image at the beginning, right? It's not all. It's not just positive and negative in terms of morality. It's really a cosmic structure. It's the structure of reality. This is what we're looking at. It's the way that the world works. Hopefully I haven't lost anybody by now because I know sometimes it's hard to kind of wrap your head around this stuff. All right? And so I'm actually, like, seriously open to questions. By the way, if you feel like I've lost you, raise your hand, because it's possible that I lost someone else as well. All right? And so now let's follow the central. One of the reasons. Okay? So the reason why Christ is sitting on a rainbow is because he is sitting on the heavens. There is a text in the Psalms where it says that God is sitting on that the heavens are his throne and the earth is his footstool. And so here is Christ showing us that he is divine and then sitting on the heavens. And the rainbow is obviously a symbol of heaven because it is that dome, right? It's that arch that we can see. But it's also a bridge, right? It's also this bridge which connects heaven and earth. And so we get all of that in this image of Christ sitting on the rainbow. It's a very ancient, ancient image. All right, so as we move now down the line, we have an image which is called the hetimasia. Okay? Can you see it? It's that. That weird square right here. So that weird square with the cross and the two angels. It's called the hetimasia. And what it is, it's the prepared throne. It's the throne that is prepared for the return of Christ. Now you could. You have it, like I said, you could take that image of the Ascension. And it's the same thing, right? So we don't show. In this. This. We don't show the Mother of God there, but we show a throne. And the Mother of God is. Is Christ's throne. It's another vision of the Church which is preparing itself, which is laying itself out, preparing itself to receive its king. And so the church is. That's what the notion of the empty seat represents. It's a very ancient image. And it's very interesting because it actually can help us understand a little bit of how the Church, some of the difficulties that were present at the beginning of the Church, because the idea of the hitimasia was present, started at the Nicene Council. At the Nicene Council, when Constantine couldn't be there, they left this throne, which was empty. And this empty throne represented the power of the emperor in his absence. And a lot of the fathers were not so keen on that. They kind of, you know, they weren't so keen on having that type of imagery. And so right away at Constantinople, at the next council, right away they did the same thing, but instead they put a book of the Gospel on the throne. And so it became, rather than being an image of an empty seat prepared for the emperor in his absence, it became an empty seat prepared for Christ in his absence. And there are many, many scholars until now, who believe that the bishop's throne that used to be in the apse of the church, at the end of the apse of the church, was at first a throne that was left empty because it was the throne that was prepared for the return of Christ. The whole liturgy was based on this idea that we are waiting for the returning Christ and the throne is here prepared so that Christ can sit in his throne, right? But it's most importantly for us, it's really to understand what the Church, what the role of the Church is, right? What it is that we have to do even in our own lives. The idea of preparing the throne, I mean, that's what we need to do in ourselves. We need to prepare ourselves. We need to work on laying things out properly preparing the body into which Christ is joined to. Okay? And so that's our work. And it follows down in the middle of the. And then of course, there's the cross that is there on the throne. And the cross acts as this balance. There's. I don't know if you have this troparian, but there's a troparian in the Russian tradition which says, your cross, O Christ, is like a balance, right? For the thief on. The thief who looked at you was raised up and the thief that didn't was cast down. So the cross already is an image of the Last Judgment. In the cross itself is already this. Everything is accomplished in the cross. So we have this balance, this central axis which goes down, which separates the left and the right hand side. And that's what the cross acts as, that, as that image. Then we have the two angels and the two angels. It's very fascinating. This part, I don't totally understand this part. And I'll explain why. Look at the two angels, the red and the blue angel. So this is really. This is. This is a 6th century image, okay? And the red angel is on the right hand of Christ. You think it's St. Michael. And then the blue angel is on the left hand of Christ. I don't totally understand it. And here they flipped it, okay. If you look at an iconostasis, often you will have an image of St. Michael, on the right side you have one, but often on the other side, you'll have an image of St. Gabriel. Doesn't have to be an image of Gabriel, but it. Often it will be an image of Gabriel. But so that structure, like I told you, that basic, basic structure, has been there from the beginning. It just seems that sometimes the two angels seem to flip on each side. But this kind of cosmic structure is there in the way the iconostasis is laid out. It's there the way with the. With the dome. Everything is totally coherent in the way that it's set up. And so now, moving down from the hatimasia, then we have the angel which is holding the scales. And so the scale itself, like the cross, right? It's this straight line which goes down and depending on what side, which way things are going to go. And it's represented as this angel on the right side and the demon on the left side in this image. Everybody has seen this image before. This image, you see it in, you know, when you were young, you saw these cartoons, and there was an angel on the right shoulder and the devil on the left shoulder, right? That's that right there. It's the same thing, the same image, okay? It is this possibility that we have, right, that we have in ourselves. St. Gregory of Nyssa goes as far as saying that God has appointed for each person an angel which encourages us towards. Towards heaven and a corrupter which. Which tempts us and brings us down, okay? And so this. This is a very ancient tradition, this idea of that. That there are these two sides. Homer Simpson didn't make it up. Like, it really is this very, very ancient idea of these two possibilities within us, these two possibilities of either giving in to our passions, to that which divides us. That's what pulls us apart and it brings us down. Or else giving in to. Not giving in. Sadly, we wish it would be that simple, but submitting ourselves to the higher virtues, to love, to charity, to compassion, and then being able to move up. And so in this image, this is the judgment itself. And so the soul is being judged of the person. It's being judged whether it has been pulled down or whether it has gone up. And you see this. I think I have an image of it. All right? So here's a good image of it. So here you see the soul. Sometimes in the image of the lad judgment, you'll actually see the soul which is standing in the middle, right? As this person who could go either way. Like we can go either way. And then the angel that is putting in the scroll the good things that the person has done. And then the demons that are trying to pull the scales down so that you go that way. And in this image it's the hand of God who is holding the scale. And in his hand are the souls that are to be judged. Let me just show you this, okay? And so. And it's not just an image of the Last Judgment, this notion. This is the image of our life, the image of our daily life. This is an image of the divine ladder. And what it represents, it represents the struggles of the person in their life to ascend the ladder, to go up and encounter God, to reach the state of illumination and unity with God. And in that image, it is at the same time this image of a judgment or the same image that you saw with the angel. On one side, you can see right here, here's the angel. And in this version, the angel is holding a crown. Sometimes you have the angel just encouraging the person to go up. And then on the other side you have this demons that have these hooks trying to pull the people down into the mouth of death. That's down there into the mouth of hell. So that's really, you know, if you can leave with just one thing today is to understand how the limit the image of the Last Judgment and the Last Judgment itself is something which is already happening now. It is not just something to wait for. It is. It is the very process of our. Of our existence which will in the end be full, will be fulfilled in the Last Judgment, but is already part of our. Of our existence today. Climbing the ladder now. Yes, definitely, definitely. I mean, the. Saint John Climachus wrote a book called. This is based on the book by, by St. John Climicus, which is the ladder of divine ascent. And a lot of people during Lent, they read this book. It's very hard to read. Don't, don't, don't. Probably don't read it. At least don't read it without the guide of a spiritual father because is really written for aesthetics. But the principle of the book or the principle of this notion that we are called to ascend, that we are called to encounter God and be united with God fully, totally, you know, as much as it's possible. As Saint Maximus says that that's, that's what we're called to do, right? And so the process of resurrection is one that's happening now. You read it in the Saints, you read it in, in the Fathers, that, that we can already participate in the resurrection now. And, and when we when we take the sacrament, when we take the Holy Sacrament, we are already in that eschatological moment. That is probably one of the hardest things to understand. When we take the sacraments, when we. When we sing and we. We talk about that, we are united with the cherubim, united with the angels gathered together, right? And then we thank God for all. We thank God for all that he's done, for all that Christ has done. And then we name them, right? We heard it today, I don't know it in English, but the Incarnation, the death, the Resurrection, the Ascension, and then the last coming. We even say, we thank you for that which has already been accomplished. We are living. We have access to that eschatological moment already. Now, one of the aspects that we see in terms of the right and the left hand, which isn't in the first image that I showed you, but is often in the image of the Last Judgment, is we often have Adam and Eve, which are there next to the throne of prepared judgment. Some, not necessarily always in the exact same place. So you have here Adam on the right of Christ, and then you have Eve on the left of Christ, right? And so that also brings in to the Last Judgment the image of the anastasis, the image of the Resurrection. So in the image of the Resurrection, we have Christ that goes down and brings up Adam and Eve, you know, to their resurrection. It's very mysterious. To their resurrection. And here they are, right? Christ has brought them there. Here they are right now, you know, participating in the Last Judgment, participating in that moment, standing in for all of us, standing in for man and woman, as being the father and mother of all of us. So it's. And here in this image, it's very. It's very interesting because you see Christ on his left hand. He's holding a sword. Sometimes you'll have Christ with a sword coming out of his mouth on his left side. Depending in our image, we have this scale, this balance, where Christ is raising up his right hand and lowering his left hand. And if you want to understand what this means right here, a lot of people wonder why the third bar of the Russian cross, why is it tilted? Why is it slanted, right? And that's. That's why. Because your cross, O Christ, is a balance. And there's that same gesture in the cross that you have Christ doing with his hands. And it's very. You find it all over the place. This is a. This is an image. This is the Florence Baptistry, right? This is a Western. This is a Western image based On Eastern prototypes. But here, here you have Christ raising up his. His right hand and then pushing away with his left hand. And the same. He's sitting on a rainbow. He has his mother. On his right side, he has St. John, the foreigner. On his left side, there's St. Peter. It's hard to see now. I don't know if that's St. Paul, though. Maybe it's St. Paul. This is really. I mean, this is not just a. This is a very. This is an image that has been built up in the church from the very beginning, right from the very first structure of how the church is. Is built. All right, so now on the right side of Christ, we have the saints, right, that are, like he said, in the image of the sheep and the goats, the saints that are on his right side getting ready to be gathered in to enter into the kingdom, to enter into his mercy. Below that we have paradise. So paradise is down here. And can you tell what's going on here? Can someone guess what's going on here? No. So that is St. Peter. What is he doing? What does St. Peter have in his hands? He has got the keys. He's opening the door. He's opening the door to paradise. And it. And it's. And paradise is the Garden of Eden. People, a lot of people struggle. They always think that when we die, we go to heaven. That is not a Christian understanding at all. We don't die and go to heaven. The return to paradise really is that image of the new Jerusalem at the end of time. This joining, it's a joining of heaven and earth. It's a resurrection of the body. It's not this disincarnated floating spirits, right? We will have a. It's mysterious. I don't know exactly what it means, but there is a resurrection of the body. And so on the door of paradise is the cherub that God put on at the gate of paradise to stop Adam and Eve from entering into Paradise. But is that the only place where God put a cherub at the gate of Paradise? Where else is there a cherub at the limit of something? Do you know? So on the veil of the temple, before entering into the holy of holies, there were cherubs which were stitched into the veil. And so the cherub that's at the gate of the garden is also the cherub that is at the entering of the holy of holies. So to enter into paradise is to enter into the holy of holies is to enter into that sacred place. It's to, To. To. To. To Ascend the mountain with Moses to go up to the holy place, okay? And so the entering into paradise is also entering into the holy place. In the church. It is this. This encounter with the sacred, okay? And so we have St. Peter. I don't know why St. Paul is there, but I think it's because St. Peter and St. Paul kind of always have to be together. It's like the apostles to the Jews, apostles to the Gentiles. We need the right and the left hand. And this idea of the right and the left hand is there. It's there everywhere. I want to show you an image of. Oh, here, I forgot to show you this image. This is an image of the Council of Constantinople. And now you can see the hetimazia in the back, the prepared throne with the book on it. And then all around are the fathers of the council. And now the king or the emperor is sitting to the side. He's not sitting in the middle, you know. And this prepared throne for Christ is the central. The central image. But in the image of Pentecost, we have the same structure. We have the same structure. We have St Peter on the right, St Paul on the left. And in the image of Pentecost also, we have the prepared throne, right? See, that's empty space between St. Peter and St. Paul. That space is prepared for Christ. And so it's the same. It's the same idea. It's the same concept. The image, the image of this empty space between the two is the same image as the hitchimasiah. It's the. It's the prepared throne for Christ as he returns to join himself with his church, ultimately. All right, okay. Now in paradise. Who's in paradise? Can you guess who the first person we encounter in paradise is? No. What has he got? You gotta see. He's here. He's right here. What is he carrying? No, what are you carrying? Carrying a cross. Who is who? It's the good thief, Right? It's the good thief. And it's important to understand why we have the good thief there. Because I told you, the cross is where all was finished, where all was accomplished on the cross. And so the good thief becomes the image, becomes the image of all those who look to Christ. And Christ says, today you will be with me in paradise, Right? And it's true for everybody. Like today you can be with me in paradise if you look to Christ. And so the good thief becomes this first image of. This first image of what is happening on the cross and what is happening in the whole story of salvation. Okay, so that's why we have the good thief there. Someone said what the next one is. What's the next one? That's a weird one if you look at it. Can everybody see what's going on there? No. Show you. I'll show you an easier one to recognize. Wait. Oh, yeah. So this one I'll tell you. So here's an easier one to recognize of this. Of what? What's happening there on the right. Obviously I'm not on the left side. It's someone else. It is. Yeah. It's Abraham. And he has on his lap Lazarus. Who said Lazarus? Someone said Lazarus. All right. Because. Because of the story that Christ told about him, about those two places, about the right hand place and the left hand place. One of them was represented as Lazarus sitting in the bosom of Abraham. Right? And one of them was represented as someone who was in the. In the place of suffering. Now, in this version, and in many versions, it's not just Lazarus, but you see all these heads, these little heads in the. This cloth, right? And it's this gathering in of Israel into the bosom of Abraham. Now, what's important to understand is that these images that you see, all those images that are there, they're there for a reason. They're there to help you understand what paradise is. What is that? Okay, and so the bosom of Abraham, that's an image of what paradise is. It is this returning to your origin, going back into the place out of where you came from, right? Going back to the garden, going back to Abraham. Those are two images of the same thing. They're just at different levels. But this idea of going back into paradise, into the garden from which we came, from which we were dispersed, and going back into Abraham is the same thing, right? It's just. It's just. It's just slightly a different. A different version. And that's also why next to Abraham. Who's next to Abraham? Am I hiding people? That's right. So it's the Mother of God. So the Theotokos is next to Abraham. Why? For the same reason. Right. She is Paradise. Okay, so the Mother of God is Paradise. She is the place where creation met its Creator. She is the place where heaven and earth touched. Just like paradise was this mountain where heaven and earth touched and Adam and Eve were at the top. So too, the Mother of God is that place where heaven and earth touch. She is Paradise. She's also the throne. She's all those images. She's the church. She's all those images of how we can come and encounter God and we can receive God to the extent that it's possible. And that's why she is. So those images that you see, they're not just arbitrary things you put in there, but they are all images to help you understand what are we talking about when we talk about paradise? What are we talking about? So what is it? It's the church. I told you. It's an entry into the holy place. That's why we have those cherubim. Paradise and the church are the same. The Mother of God and the church, this returning to our origins, this returning to the garden. All these images, when you start to lay them out and you start to see them next to each other, it can start to awaken. Father talked to us about the noose. And because we can't access the noose with our. With our rational thinking, we can't access it. But these, these types of images are there to awaken in us, you know, to connect things together and to awaken in us this, this intuition, okay? Because obviously paradise is not going to say this, but I mean, all these images are there to help us understand what. What paradise is, you know, and we. We have to take them together. We can't just. We can't just separate them. And I hope that. I hope this is. This is important. All right, now how we go to the. To the bad side, we go to the nasty side. All right, let's go to the left side. All right, now on the left side, first thing you notice is this crazy red river that flows out. That flows out of the foot of Christ. And that is that. That comes from a vision in Daniel, in the book of Daniel, when the. When Daniel sees the Son of man coming, he describes this river of fire which flows from. From. From his throne, you know, and comes out. Let's not talk about that for now. Let's talk about the top part first. So I'm sure that this image right here, that is probably some of the weirdest images you've ever seen. What's going on up here? Right here. Okay? So it's hard to see because the image is small. But what's happening is you have all these beasts that are spitting up people, okay? So you have all these different monsters, right? See that guy coming out of that sea monster's mouth? There's a guy coming out of the lion's mouth, right? So all these monsters are spitting up people. And the same for the fish, all these things. So, like, what is that? What is that? And then you have an angel who's blowing a trumpet? So the angel is blowing the trumpet. You know, it's the angel of Revelation blowing the trumpet to call the dead to rise. And so the way that we show this is by showing these beasts that are giving up their prey. Why do we. Why do we show it that way? Because this is also. I've been trying to show you that this is not just. This is an image of what's going on in you right now. It's not just an image. It is an image of the total final image of the cosmos, but it's also an image of what's happening in you right now. And so these beasts are the passions. They are these monsters. There are all these things that rip us apart, that, that tear us apart, that. That bring us down into death. And here are these beasts that are giving up. So you see, it's not just beasts. You see people coming out of their tombs as well. So some people coming out of their tombs, and then some people are coming out of these. Of these different beasts. And so it's all. That's the image in the Church Fathers of the animals, of this, this kind of animality is always this image of the. The. The passions, right? The. The. When. When Adam and Eve fell, God gave them these garments of skins. Thanks. And it was this joining. It was this joining to our animal nature. And so the. The animals that are giving up their dead is really an image, first of all, of how this image of death, that's what it is. It's an image of us being devoured. We all experience it. Everybody has that experience of being pulled down by your passions. Whether, you know, it could be your, you know, whether it's hunger, whether it's. It's your sexual passions, whether it's pride, whether it's, you know, avarice, all these passions, they pull us into death. Okay? And then. But it is also possible. I mean, it. Not only is it possible, but it is in the. It is possible for those to give up their dead at the calling. Right of Christ. And we can enter into, come back from that experience. Okay? So it's very interesting. It's very important to understand that those two are kind of laid up against each other right here and right here. So here we have people being eaten by this beast, and then above it, we have people being given out, like being regurgitated. Like, this is not arbitrary. I know some people might think it's arbitrary, but we have a very old image of this very, very old one. It's this one. It's not this is. There's reasons why these images are chosen, right? Because we know that the resurrection has already been represented as Jonah being spit out by the fish. That we're coming out of dead. Death is coming out of this, this animal existence. It's kind of raising ourselves up, you know? And so that's why. Not only that's why the beasts are spitting up the people, but that's also why the head of the fish becomes an image of. Right? Becomes an image of hell itself. Can you see that? It's the same. So Jonah's. The image of Jonah's fish becomes this ultimate image of the mouth of Hades, the mouth of the mouth of death. In the west, the image of the anastasis of the resurrection. Let me find it. This is a Western image of the resurrection, okay? And so in the east, we have this image here that you all see of Christ raising Adam and Eve out of this pit and out of the tombs. But in the west, it was always Christ raising people out of this mouth of death, this mouth of Hades. Okay? And it's. And this image is there in the east too. I showed it to you before. See, down there? So there it is also in the image of the ascent, right? Also to remind you that this is happening now, right? This is not just. I mean, it is the ultimate image, but it's also one which engages us today. All right, I'm almost done. I'm almost done. Yeah. So on the left hand side, there a possibility? Yeah, well, it has to do. I mean, I think it has to do with this notion of the left hand as being related to the wild, to the animal. It's also the desert. So you can see in the image it's the wildness. So the wildness in the Bible is represented as the desert, right? When the Israelites are lost in the desert. So you see this desert, but it's also the flood, right? It's also the waters. So you have these two images together. You have the image of the desert, the image of the flood. So it really is this image of the limits, right? Different images of chaos, different images of the limits of what is ordered. And so that's why it's on the left hand side. But like I told you, the left hand side is not just bad, it just is just an aspect of reality. Okay? But there is obviously the ultimate, the final image of the final judgment of those who are eaten by the beast. And we know that it's possible, right? I mean, we know that people can let themselves or fall so, so deep that they are devoured. And fire is really the best image image for that. Okay. But it's important to understand that fire is not. Fire is not just bad thing. It's not just a negative thing. It's. It. And there's. We have another fire, right? We have that fire right there. Okay. See, they have fire. And so fire is this multiplication. It's this division, this moving out. And so the. The fire of the Holy Spirit that made people speak in languages that everybody could understand. Right. That's like St. Paul that moves out. So it's that left hand that moves out. But that also can be fragmentation. It could also be something that you lose all cohesion and it's ash. The only thing left is ash. Okay. And so it's an image of this breakdown. Yeah. Is there a way in which the left side is chaos and the right side is order? Well, it is slightly. I wouldn't limit it to that. I would say that the right side is really this bringing in and then the left side is this kind of this breaking apart. But you could use those terms. I mean, it wouldn't be totally. It wouldn't be totally. But there is a negative right side too. I'm not talking about it here. But there is also a negative aspect of the right side. It has to do with St. Peter. St. Peter is the right hand of Christ, but he's the one who also is full of. So pride is the sin of the right hand. Saint Maximus the Confessor said it explicitly that pride is the pride and self sufficiency is a right hand sin. And then the passions, drunkenness and prostitution, all those types of things, they are sins of the left hand. They're sins that dissipate, but in the image of judgment, really. Then finally, this is the final image. And often in the good images of the lie, judgment, you'll see kind of different categories of people that are kind of in the fire. And so usually they'll be like, here we see there's a king. Often there'll be kings. Usually we put the kings and the bishops and the priests and we put those down there. But yeah, anyways, especially in the west, that's what happened. In the west you really had this tradition of showing only, you know, kings and bishops and priests and monks in hell and normal people. Yeah, they don't go to hell, know. I don't know. I was trying to figure it out. I couldn't find what was written, but I think it probably has to. I would think that it would be the words of Christ saying, enter into my kingdom on one side, and then, you know. Yeah, depart from me. I think that's what it is. But I couldn't read the. I tried to read that. I couldn't. That gives you an idea of this icon. Yeah. Why are you asking me questions? Yeah, maybe I didn't totally understand your question about what was on the left hand. Do you want to repeat it for me? Did I answer your question or did I kind of miss your question? Yeah, go ahead. Go ahead. Again. My wife is there to put me back on track. You have the Last Judgment? Yeah, no, I think there definitely is. I mean, there definitely is. Like, for us, there definitely is a seed of hope that. That which pulls us on the left side or that which pulls us into fragmentation, into death, we can be saved from that, obviously. But we have to be careful about."}
{"episode_id":"SW - #042 - 2019-07-13 - Understanding the Last Judgement","start":3172.54,"end":3173.22,"speaker":"Jonathan Pageau","text":"We have to be careful."}
{"episode_id":"SW - #042 - 2019-07-13 - Understanding the Last Judgement","start":3173.22,"end":3278.61,"speaker":"Jonathan Pageau","text":"Like down there. Like down there. I would say that all abandon, all hope. Dante put that quote up there. And I think that what exactly that entails. We don't know what exactly that entails, but I think that part of the Christian tradition, there is really this idea that there really is this possibility of. Of losing yourself. And I think that that's important, you know, and. Yeah, I think it's important that it is possible to totally lose yourself. And to. That there is no way back. But it, you know. Yeah, I think so. That's definitely how I see it. But I also see. Also. I also see that Last Judgment as the finality of, like. Of all of us. But we can. Like I said, it's still now, right? It's also now. Yeah. And I think that there's nothing. This is absolutely orthodox to say that, because that's why our liturgy is the way it is. That's why in our liturgy, we are already in the Kingdom. That's why we are already in the Resurrection. We are participating in the Resurrection when we take the sacraments. And so it's really there. It's part of our. But obviously it's mysterious because there really is this also this notion that there is a cosmic finality into which everything will be transparent. Yes, Father, maybe. Let me show you. I'll show you a different. I wasn't necessarily going to show you this, but I'll show it to you."}
{"episode_id":"SW - #042 - 2019-07-13 - Understanding the Last Judgement","start":3280.54,"end":3281.1,"speaker":"Jonathan Pageau","text":"Here we go."}
{"episode_id":"SW - #042 - 2019-07-13 - Understanding the Last Judgement","start":3281.1,"end":4988.62,"speaker":"Jonathan Pageau","text":"And I might get in trouble for this. I'm telling you. So in some images of the Last Judgment, you will see a big snake. So you'll see this giant snake which is swerving down. Depends. Not always exactly the same. In this one, he's biting the heel of Adam, and the snake is swerving down, down into the fire. And along the snake, there are these nodes. Okay? That's right. That's exactly what it is. It's exactly chutes and ladders. And on the snake, just like we saw on the ladder of Divine Ascent, there are angels, right? And the angels are helping people up the snake. And then there are demons that are pulling people down the snake. So it's exactly chutes and ladders and that. Let me see if I have another image of this. Here's another one, right? So here we see it more clearly because you can see the angel, the angel, then the demons at each node, okay? And those. Those nodes are what people call the toll houses. And the. It's very controversial in the Orthodox Church. I'm telling you right now. I'm not. I'm not. Not taking one side or the other, but I can explain to you what it is. And the toll houses are this process, are the process of judgment of the person. You could say they're just like the ladder. There are these different nodes, and each node represents a sin and a virtue. And then the story is that the soul ascends these nodes, and at each step is there's an angel and a demon, just like all the others. And if you pass, you go up, and if you don't, you stay there, right? And so it is the very process of sanctification. And so I think also in the toll houses, it's important to understand also that although we see it as happening after death, it's the same as the latter. It's the same thing. It's happening now, right? It's also happening now. And so that's this image of this snake. But when you said chutes and ladders, it's like you couldn't have had a better image. It's a chute and a ladder at the same time, the same thing, right? And we become. And I think that's really important to understand is that as we ascend, as we ascend the ladder, then we become what sat that ladder. It's not just a question of arbitrary judgment or arbitrary. Or like, you did this and you didn't do this, it's to become something, to acquire a virtue. And as you acquire virtue, then you become that which is at that level, and you become more and more in the image of God. So it's a process of transformation of the person. It's not just a bunch of rules you have to follow in order to go to heaven or to Go to hell. That's not it. It's to become something. And what you become, that's paradise itself. Right? To acquire the virtue is paradise. There's nothing else. Right. That's what it is to become something. And to enter into paradise is to become that which is in paradise is to be in the holy place. To have to be in a place in yourself and in your. In your life where you can. Are transparent to God that you. That God flows through you and you have nothing holding it back. Okay. And I think that's really important to, To. To understand. One, One last thing I want to show you about this one. Sorry. These ones is here. You really get. When I told you about this right hand and left hand and some of these icons, you get it like, you know, like, it's almost like going up and going like an elevator and a sh. You know, so on one side you have these saints that are ascending. On the right side, they're going up on the right side of Christ. Then on the left side you have all these demons that are falling down into the fire. So you have this ladder, right, and all these nodes and then the Ascension and the descent on the other side. Right. And so it's really. It's an image of, like I told you, it's an image of reality. It's an image of the, The. The hierarchy of the world. It's an image of the ontological hierarchy of reality. These are Russian. Yeah, these are. I mean. No, no, these are. These are like. These would probably be 16th century, maybe in Ukraine or in Russia, of which where the images come from. Yeah, that would, that probably would be a good idea. I'm telling you, the icons are. Yeah, I think I'm. Yeah, you're probably right. Yeah, I think, I think I'm also. I think one of my problems is also because I'm spoiled with Google. So I always think, yeah, you could just go on Google and say, write Last Judgment and you'll see all these images like that. I will. I have taken your criticism very seriously and I will do that. She said you should give references to these images so that people can look them up. Yeah. Where are they? Like, where are they from? Yes. Yeah, go ahead. I even got it right for the 16th century. So he has the book and he has the image. This image he has. Did you bring a book on the Last Judgment or. Okay, all right, all right. So I think, I mean, I think I've kind of gone through the icon. There are variations, and I'm not going to go through all the variations. Because really, there are all kinds of variations on this image. I kind of gave you a basic structure of what this icon looks like, and then you can then explore what. Like in this image, for example, you don't have the dead people getting thrown up by animals, but you have the same images here. You have this gray mass and you have all these people inside, and you have the angels that are calling with trumpets. And so it also is this raised. Being raised up out of death that's happening. And here it's been put into contrast directly with the Mother of God as an image of paradise. So you have these two sides opposing each other. They're falling. They're not running away. Yeah. And you feel that every day. I mean, every day when. I would use the same example, because it's a good example. You feel it every day when you see that second piece of cake. You feel that fall. You feel it. Right. It's like it's pulling you, and it's like, no, I don't need it. I don't have to. And then, like. Right. And so it's. That's it. That's what's going on in these images. It's just. This is a cosmic vision, a version of that process. You know, so maybe I'll last. One last question. Maybe you can guess. In the images, sometimes, often there's an. There's this opposition that happens. And so in the fire, in. In. Have Abraham, who has Lazarus on. On him or has the souls inside him. And often they will show someone in the darkest place on the figure of the. Of the devil. You don't see it very well there, but there's someone sitting on his lap right here. You can see him here. Who wants to guess who that is, who said it? Yeah, it's Judas. Yeah, it's Judas. That's right. Right. So, yeah, a little. Well, I don't know if it's that. The idea that he's opposite of Lazarus, but that he's at the. He's in the. The bowels. Right. A little hint from Dante here that it's. That. That betrayal is the. Is the high, is the worst sin. Yeah, yeah. And Dante in the bowel in, like, being devoured by Satan himself is Judas. He's like at the core of the. Of the. I mean, it's more than just rejecting. I mean, betrayal is more than just rejecting. It's really. Yeah. Selling. Selling or. Yeah. I don't know. It's a. Yeah. Betrayal is. Because betrayal is the opposite of trust. It's the Opposite of faith. It's the opposite of. No, but I mean, I think the story is ambiguous that he realized, but he didn't. He killed himself. He hung himself instead of repenting. Right. He did. She said she was like, yeah, Judas. You know, he regretted what he did. And I'm like, well, he did. He hung himself. Yeah, yeah, yes. Sorry. Yeah. Let me put it up. Well, covenant is a. Covenant is a bridge, right? A covenant is a connection. And so in that sense, that's what the. That's what a rainbow is, right? A rainbow is this connection between heaven and earth. Just like that's what a covenant. If I was. If I make a covenant with you means I am making a transaction, a bridge between you and I. And so, and so that's. Yeah, that's definitely related. It definitely does hint to that. Definitely. You have so many. Paradise is definitely a feminine element. I mean, it's a space, right? Definitely. But then there's also. There's also, there's an image of like. I can show it to you here. It's not just paradise, there's an image of paradise as paradise is down, right? So there's this image of paradise as the church, as this place, all of that. But then there's also this ascent. So there's both at the same time. Those two images have to be seen as together. So if you see it here. So let me find this. This is a perfect image of this. So this is an image of the ladder of ascent. But that the base of the ladder is the church. So this is the church, and this is the beginning of the ladder is planted into the church, you could say, right? And so connection, the place of connection. When. What did Jacob say? Right? Jacob, when he raised his pillar, when he saw that ladder and the angel going up and down, he. He stood up and he said, this is the house of God, right? That's the Theotokis. It's the same. So you have this, this space. Sorry. Right. But it's all. Yeah. Which is definitely the new earth, at least. I mean, in that image. Yeah. What's the difference between heaven and paradise? Okay, so heaven is. Why am I talking about this? I probably shouldn't be talking about this. So paradise is that place which touches. Like the place which touches. And so the way that paradise is represented in scripture and in tradition is that paradise is a mountain. Right? At the top of the mountain is the tree of life, okay. And then that mountain touches like, it's like touches heaven. So you can imagine it's the earth going up and then heaven touching that place. So sometimes there are these weird traditions that talk about how it was the highest place in the world and that when the flood came, the flood flooded the entire world except for paradise, which remained and still was there. So there's this idea of paradise as this place where heaven and earth meet. And then heaven is the hierarchy of angels, right? It's this. It's not embodied. So we're not. How can I say this? We're not meant to live in heaven because the ultimate reality is the meeting of the two. That's the ultimate reality. Christ is the ultimate reality. Right. Christ is the ultimate reality. It's that to which we are called to. That's why we even have this idea that in a certain manner, that although the angels are above us, we have an advantage over the angels because we can be that place where all of that meets in the middle. And so that's the difference. I don't think souls go, go, go somewhere. I mean, it's Are calling. They don't have bodies, you mean? Yeah, I think that you have to be careful to put time in there too much. You have to watch out how much time you want to put into that equation. I don't know if that makes sense. For example, the Church Fathers, like I said, I think you have to be careful not to put too much time into there. Right. And so, for example, the Church Fathers, they say, in many of the Fathers, they talk about how certain events in the life of Christ happened in eternity. So the crucifixion happened in eternity. So, like, what does that mean? Okay, so this idea that. That eternity is not sequential time. Right. And so if you try to imagine, like, where the souls are when they're not embodied in time. I don't know. I don't see it. I don't really don't see it that way. There's like a. Yeah, I think I. Yeah, so that's it. So that's a great example. So we say on Easter, we say every time, we say, death is vanquished, death is empty. The tombs are empty. How can we say that? Are we crazy? Let's go to the cemetery right now. Obviously, the tombs are not empty, Right? But they are. That is. There is this entrance, this possibility of entering into eternity. And then time doesn't. It's not about time anymore. Right. I don't have. I don't have a. Yeah, I don't have a problem with that at all. Like, that's fine with me. That doesn't bother me at all. Yeah, we probably shouldn't be talking about these things is what I'm trying, what I'm realizing. Seriously, let's stick to the iconography. That's right. Yeah. Yeah. What do you mean? Yeah, I agree. I think so. It's always now. There's nothing else besides now. I mean. Yeah, I mean, I, I think, I think eschatology is. I mean, everything's always now. There is no other. There's nothing else besides that. Yeah. Okay. So it's really important also to understand that this particular. Not all icons of light judgment have this exact thing, this image. This is how this artist decided to show it. He had the desert, he had the water and he had the fire. And I think it makes sense to do that because in the Bible all those images represent this kind of, this desolation or death. Water is death very often in the Bible. And then the desert is this kind of wandering without purpose. Fire also as well. So, yeah, this is an icon also. This is really important to understand. These are images. They're not. Don't try to find. How can I say this? Yes, exactly. That's right, they are. Well then. Yeah. Yeah. Which ones should we be careful about? There's quite a few. I mean, we definitely live in a world of logaria of like, excess of everything. Like, you know, too much of everything. And that has to do with. It has to do with the fact that our world has kind of given themselves to the passions in general. And so this binge watching. There's no difference between binge watching Netflix or binge eating cake. It's just we have capacity for excess inside us when we let ourselves get pulled by something, by some desire to excess. And I think that that's most of the imageries, most of the imagery that we see. It's funny because they can help me address some of the things that, like I'm doing on my videos. I make these videos where I interpret movies and I hesitated for years to do that. Like, I hesitated for years to do that. I knew that I could. I. I knew that I could do it, but I hesitated because it's a double edged sword, because I thought, okay, I can show people how powerful these patterns are and try to tell them, you see them in this movie, they're cool, but they're 10 million times more in the scripture and in tradition. That was my hope. But at the same time, it's like Hollywood is the decadent place of whatever. It's chaos. There's nothing good there. There's nothing. This is not much good in Coming from there. But it's not that you can't look in and try to show how despite the chaos and despite all that, that you can find sometimes some little nuggets that can help people to see the first bar of that ladder and kind of to step up. I always say you have to plant your ladder in the mud. You have to plant it in the mud. So that means that you have to start down there and kind of show little nuggets and then people start to see. But the danger is that people think that, oh, that I've opened. Okay, let's go and spend our evenings watching movies every day and just spend hours and hours watching TV every day. It's like, no, I don't think that's a good idea. Not at all. Oh, yeah. There's so many of them. Well, the image that I've used is Shrek. Like I've used the image. The story of Shrek. I think it's one of the clearest upside down movies because it follows a traditional kind of fairy tale story, follows this, you know, story of St. Christopher or the story of Beauty and the Beast. All these stories of this kind of monstrous being who encounters something pure, something beautiful, and finally through that encounter is transformed and becomes more. Becomes better. Right, so Beauty and the Beast, that's what it is. Right? So this beast, he meets Belle, meets the beauty, and the beauty is able to transform this beast into man. Sorry, in the movie Shrek, it's the opposite. It's just the opposite. So you have this beast who's everything a beast is. They show him as being extremely passionate and disordered and chaotic and disgusting and rude and all that. And then you have this beautiful princess and the story leads us towards a moment where she becomes an ogre. And that's how it ends. You saw that the shape of water was exactly that. Same story. Same story, Right. Just a grown up version of Shrek. You know that everything bad is under the sign of the cross. Yeah, yeah, yeah. But it also killed millions and millions and millions of people. So that there's that. Yeah, but the point is that the symbols don't have any power without the truth. Right, but they. They have truth that they echo to. They don't have any power on their own. Yeah, well, right, but they have. Right, but you could say, you could ask this question, like, does a passion have power? Right, There's. It's a certain way it does. Like, I mean, it pulls us. So these upside down symbols, they pull people. They pull people away, you know, and you could say. I mean, that's what all evil is, like that. I mean, all things that are upside, that are evil have a certain weird capacity to pull us because they shine with a temporary light, this kind of temporary light that makes you think that everything is there. It's like, you see that second piece of cake and you think, this is what I need right now. If I give that, I'll be fulfilled. And so the upside down symbols do the same. They pull you. They. Well, of course they're not, but. But everything. Everything is. Everything is symbolic in the sense. Yeah, the Teletubbies. Teletubbies. Oh, my goodness. Seriously? Yeah, go for it. So this is about the image there. Yeah, yeah, I don't. Okay, so I know. I don't know what this one is. I don't know what this one is. This one. This one, I'm pretty sure it's a representation of a river God, of, like an ancient river God. You see that image in the image, you see similar structures in the image of the baptism of Christ. You'll see these. These little kind of old Roman river gods. And they. One of them represents the. One of them represents the sea and the other one represents the Jordan, I think. Yeah, I think that's what it is. And you see them fleeing away from Christ. And so it. Because there's a verse which says, the. The Jordan and the sea recede. Yeah. Go back before. Before God. And so on the one hand, it's an image of those waters that are the chaos that is kind of opening up and letting the Israelites cross. Like, that's this image of order that appears in this absolute chaos. But at the same time, it's also the old gods that are fleeing. But that image is related. So the image of the old gods fleeing is also an image of the chaos which is going away. So I think that's what it is. But I don't know the other one. I don't know. I don't know what that is. I don't know. I don't know what that image is. Yeah, I think so. The one thing too, that's to say about the fire, this is really orthodox theology. I'm not Catholic, so you can take it as you wish. But one of the. One of the things about the fire that has been more and more present in orthodox theology for a while is to say that the fire is the same fire as Pentecost, that the fire that's in Hades, that's in Gehenna, is the same fire that is at Pentecost. What does that mean? It means that the. What is in Gehenna is the presence. God is there. It's the fullness of God. And so how do you explain that? You explain it by your own experience. The idea is that to those. To that aspect of you, or to those who let God go through, like, be transparent to God and not hold on to your little passions and your little idiosyncrasies, then that fire of Pentecost is a deifying fire. It's a fire which brings you into God. But for all that you hold in yourself and that you don't let God transform, then that burns you. Right? And you can experience. It's not weird. I always tell people you can get it right away. Like if I. If I did. Let's say that I did something to you that's really horrible, really mischievous, just cruel, without. Just with bad intention. And then you answer me with absolute love and forgiveness, Total, absolute forgiveness. And I really acted in absolute forgiveness. So I have a choice right there. Because that love that you give me, it can either transform me or it can burn me. Because that's two possibilities. Your love can burn me if I don't accept it. Because I don't want you to forgive me. I want a fight. I want to have animosity. I want there to be animosity between you. But if you don't answer that and you answer as Christ told us to, then it can burn you. It's like St. Paul says, it's shove hot coals. That's right. So that image is. It can help us. It gets so difficult to think about that. Of course, that down part, it's hard to fathom. It's hard to understand it. And that can be sometimes a little way to help us understand it. Yeah, I think. Yeah, go ahead. Are you going to answer that? No, I'm not. Okay. Yeah. Question. One more question regarding the icon. Let's stay the icon. It's not talk about. Yeah, it does. No, it does. It does. The scale. I'm speaking of the imagery of the scale. I'm not going to answer that question. Please. I am not going to answer that question. There's no way. Does that have a role. I'm not. I'm serious. I'm serious when I say I'm not going to answer that. Was that the last question? I think. All right, well, everybody, thank you so much for coming here. Thank you."}
{"episode_id":"SW - #042 - 2019-07-13 - Understanding the Last Judgement","start":4993.1,"end":5048.02,"speaker":"Jonathan Pageau","text":"Thank you for listening to the Symbolic World podcast. As you know, this podcast is, for now based mostly on my YouTube videos, which I am transferring into audio format. Please go ahead and visit my YouTube channel. There are more videos there on different subjects that I'm not going to put into audio. And please share this to your friends. I know a lot of people know about the YouTube content, but not so many people know that this is also a podcast. So share it to your friends. Share it on social media. And if you can, feel free to support this financially as well by going to my Patreon page, which is Pajo videos. Strangely, you can go there and you can support it at any amount that you want. A month for all the patrons. I do a monthly Q and A live Q and A in which people can ask questions in the chat and try to have a more personal connection with people. The YouTube comments have become difficult to follow and to answer."}
{"episode_id":"SW - #042 - 2019-07-13 - Understanding the Last Judgement","start":5048.18,"end":5049.06,"speaker":"Jonathan Pageau","text":"I'll see you soon."}
