{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":0.4,"end":14.88,"speaker":"Richard Rohlin","text":"One of the great things that modern scholars are perplexed by is why does everyone have a dragon? Like, there's not a single human culture anywhere in the world that doesn't have a dragon, including people who live in places that don't have snakes."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":27.04,"end":56.78,"speaker":"Jonathan Pageau","text":"This is Jonathan Pedro. Welcome to the symbolic world. So, hello everyone. We are back with Richard Roland for another universal history episode. And this week we are going to talk about dragons, which I'm sure is going to be of interest to everybody that I know around the symbolic world. So, Richard, go ahead."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":56.78,"end":58.94,"speaker":"Richard Rohlin","text":"So many people have been asking for this for so long."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":59.21,"end":68.69,"speaker":"Jonathan Pageau","text":"That's right. And so we already had a little bit of the dragon discussion in the Beowulf course that we've talked about quite a bit. And so you can check that out for sure. But we'll see."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":68.69,"end":102.84,"speaker":"Richard Rohlin","text":"When Jonathan says a little bit, what he means is that we actually talked about dragons for about seven hours. So. So I just really want to, like, make sure that, that we. We. I want to, I want to properly sell you on the Beowulf class, if you haven't already signed up for that. Bought that. I know it's a little pricey, but it's literally like 20 something hours of Jonathan and I talking about Beowulf, like total, you know, and along with handouts and everything else. And. And we literally spent at least seven hours talking about the dragon between the last two classes."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":102.84,"end":103.36,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":103.68,"end":170.65,"speaker":"Richard Rohlin","text":"And if you want to know the secret connection between the dragon and the Grendelkin, for instance, it's not what Neil Gaiman thinks it is. Um, but if you want to know what it is and there is a secret connection, then sign up for that class. And a lot of the things that we're going to say about dragons today, we cover in significantly more depth in the class. So what I really want to happen over the course of the next few years is, is to do some more of these kinds of classes where I get to go really deep on things that I'm trying to summarize in 45 minutes. And, you know, the really frustrating thing about making these videos, Jonathan, is that will record something and then later on I'll think, oh, I said that wrong, I need to go back. And you know, so like, when we do the coursework, not only do we get to go deeper and, you know, we got 18 to 20 hours instead of one hour. Right. For a subject, but also I get to like, do a lot more in the, in terms of like, research, footnotes, editing, and also you get all of My, like presentation, like slides and notes and stuff like that for those classes. So the veil class was the first one. I hope we have some more to introduce next year."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":170.65,"end":184.97,"speaker":"Jonathan Pageau","text":"Oh yeah, for sure. Dante the Comedy is going to probably be the next one we're going to do because I'm excited about doing that as well. So I think that that will be the next one and then we'll see from there on. So Richard, how are you going to start us off with dragons? Like, we don't even know where to start."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":185.45,"end":295.05,"speaker":"Richard Rohlin","text":"So I should have expected this, given that they're dragons, you know, but they, they, they turn out to be very difficult to pin down, as it were. One of my, there's, there's this a scholar that I was reading on the, the subject of dragons in like ancient, the ancient near east and ancient Indo European legends, which is probably where we'll start. And she says that you're expecting it to be like, oh, it's a, it's a thread and I'll start pulling the thread and I'll just be able to chase it from beginning to the end. But it's not like that. It's like a spider web and you're looking at all of the threads and you're like, well, did this come from this? Or did this come from this? And did this come from this? And, and, and it's very difficult to sort of trace like even nail down what a dragon is because there are certain general things and that's where we're going to start in a second. There are certain general things you could say are true about dragons, but then there are always exceptions to that. So like, you could say, you know, if there's 10 things that make a dragon, like all dragons have seven out of 10 of these things, right? Different seven out of 10. But, but then, but then there are various dragons that are like little weird exceptions to these rules. And I think that this is going to go a lot towards the way that we think about the dragon as, as a monster, right? As a monster, as very often something of a shape shifter, right? Something that's got the ability, capacity to kind of change its shape and actually takes on different roles in different societies. And then maybe what that means for us, again, you know, as, as always, I'm coming at this from the perspective of a Christian who, you know, and, and as, as Christians, the idea of a serpent or a dragon means something in particular, although it also means other things that maybe most people haven't thought about. So we'll get into that."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":295.45,"end":319.54,"speaker":"Jonathan Pageau","text":"No, for sure. That's been the way that I would approach it mostly. You know, for those who have read, I've read a few articles about this. I wrote an article called the Dragons that Almost Exist where I discussed the, the, the relationship between the dragon and the monster and that it seemed to be the key in, in, in, you know, the idea of something which is not fully identified is exactly what a dragon is. And so because of that it has that shape shifting quality."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":319.54,"end":467.18,"speaker":"Richard Rohlin","text":"Yeah, yeah. So the. Let me just go over some things that all dragons or let's, most dragons seem to have in common. Right. The first is that a dragon is a serpent. Now when I say a dragon is a serpent, I mean the, the word dragon itself probably comes from a very old like early Latin word which means just a serpent, right? Or from, sorry from a Greek word that means just a serpent. And it's got, it's from a proto Indo European root word which has to do with the glance, right? Like the, like the idea of like a piercing glance or a deadly glance. Right. That's the, that's the root of that word. And, and of course there are, there even to this day there are plenty of dragon like creatures, right. Dragons are dragon like creatures whose gaze is one of the most deadly things about them. Right. The basilisk for instance, and so on. Now something to say here is that we have to be really careful about when we're going back and looking at dragons for our purposes. We're not going to really, we're not. You have to be really careful about not treating them as like different species. Right. There's a kind of like a modern tendency that has its, you know, as its apogee like the, the, the D and D monster manual, right. Where it's like you've got all these different kinds of dragons and then these other kinds of like dragon like creatures and they're all sort of different, a different species with a different stat block and a different, you know, and so that sometimes if you, if you come at this stuff from that modern perspective, you end up getting a little tripped up on things that, that really would just not have been a difficult thing for somebody in the ancient world. So for instance, if you look at, and I'll, we'll have some images to put up on the screen here. If you look at a, a Persian dragon, right. If you look at artwork of a Persian dragon, it looks exactly like a Chinese dragon. Yeah. Now if you're coming at this from a modern perspective, you'd say, well the Persians had one word for dragons. And the Chinese have this other word that we translate as dragon. And so are they really the same creature? But you can just look at the artwork, like contemporary Persian Chinese artwork, and say, yeah, it's definitely the same. Same creature. Like, no Chinese person traveling in Persia, which is a thing that happened, by the way. No Chinese person traveling in Persia in the Iron Age would have looked at a picture of a, of a Persian dragon and said, oh, I don't know what that is."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":467.18,"end":468.1,"speaker":"Jonathan Pageau","text":"And then like, it just."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":468.1,"end":484.91,"speaker":"Richard Rohlin","text":"It's not, it's not how it goes. So most dragons seem to be composite creatures. Now I said that all dragons are serpents, right? Or at least most dragons are serpent. Actually, most dragons seem to be composite creatures, but one, the main ingredient is always serpent, to put it that way."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":484.91,"end":490.79,"speaker":"Jonathan Pageau","text":"Yeah, well, that's because, by the way, that's important to, to state, because first of all, that's what makes it a monster."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":490.79,"end":490.95,"speaker":"Richard Rohlin","text":"Right?"}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":490.95,"end":521.63,"speaker":"Jonathan Pageau","text":"A monster is a hybrid because it doesn't have a category attributed only to itself. So when you look at a hybrid or when you look at a monster, what you're seeing is things that in your estimation don't have, are taken from other places and are stuck together into one thing. That's actually an experience of hybridity in general. It's not just related to monsters. It can help us understand what monsters are. But that is also what a snake is. A snake is a being that can be in two places at once. It's one of the only ones because it, it does this."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":521.63,"end":522.31,"speaker":"Richard Rohlin","text":"Yeah, yeah."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":522.31,"end":572.31,"speaker":"Jonathan Pageau","text":"And it's a. And it's a. It's a being that also transforms itself by shedding its outer appearance and kind of re. Constituting its, its outer appearance. So the idea of the, of the snake that sheds its skin means that there's a relationship between hybridity, monstrosity, and change. Because change is exactly when something loses its identity, especially transformational change loses its identity and then is in the process of becoming something else. And in that middle space between the. What it used to be and what it's becoming now, there's a kind of fluidity that, that, that appears and that is what accounts for monsters. That's why we used to say that the word monster means a sign, right? It's a. It's a sign that something. Yeah, something's happening like that, that things are not going to be the same anymore. And that's what the sign of hybridity reveals to us."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":572.63,"end":577.67,"speaker":"Richard Rohlin","text":"And this is precisely why it's so difficult to talk about a dragon or even to trace. Like."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":587.68,"end":740,"speaker":"Jonathan Pageau","text":"In 2021. My brother Mathieu and I, with the help of Cort Nielsen a Philip Cartin, introduced all of you to a new vision of storytelling. We launched the God's Dog Monster graphic novel through crowdfunding, introducing the dog headed St. Christopher the dragon slaying St. George to full view as a new epic story began. The response was a slight Download, reaching over $250,000 and ultimately selling out our first print of the book. Now book two of five in this series, God's Dog Warrior moves into the meat of this epic story where our dog headed stranger must be integrated, must be trained and must fight. The cosmic stakes behind the story become clear, the characters shine and heart wrenching choices must be made. Book two will surprise you with more monsters, more giants, and a deeper exploration of the mythology underlying it all. Since book one of God's Dawn, I've also started a publishing company called Symbolic World Press with some amazing partners to deal with the timely production, printing and shipping of all future books. We've already successfully published Snow White and the Widow Queen and we'll expand our activities rapidly. The money we raised is to build this whole project and even move towards other media. We now have three full time people working with us, plus nine artists, six writers collaborating towards at least 14 upcoming books. And all of this without any outside funding, no outside control. It's all of you making this possible. This is why crowdfunding is so powerful. So on this crowdfunding, we've partnered with professional comic artists Matt Sheehan, Jesse White, Philip Cartin and Martin Krotz to bring together God's Dog Warrior. But on top of that, I'm also introducing an entirely new comic book series called the Garments of Skin, which will explore the lore, the mythology around God's dog, bring the story into the contemporary world where new heroes try to resist a global system control. We are at a turning point in culture, a turning point in storytelling. And I know I can count on all of you to make it possible. We have to take back the reins of storytelling, move past the gatekeepers, and I thank all of you for trusting us to play a part in that. Thank you for backing God's Dog Warrior on Kickstarter today."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":748.01,"end":807.05,"speaker":"Richard Rohlin","text":"One of the great things that modern scholars are perplexed by is why does everyone have a dragon? Like, there's not a single human culture anywhere in the world that has a, that doesn't have a dragon, including people who live in places that don't have snakes. Right. And, and so it's one of these things where, you know, you people are always trying to sort of answer the question, like, why does everybody have a dragon? And yeah, the dragons, they're all a little bit different depending on where you live. If you live near the water, maybe it's a sea serpent or like a sea dragon kind of a thing. Right? But. But, you know, if you live, you know, so, so what's going on there? And so modern scholars have these a bunch of fun, different theories for this, say, oh, well, it's dinosaur boats. Now, to be completely fair, every time before the 19th century, anybody ever dug up dinosaur bones, which happened all the time. For instance, lots of dinosaur bones in China. When people dug up dinosaur bones in China, what did they call them?"}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":807.13,"end":807.69,"speaker":"Jonathan Pageau","text":"Dragon."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":807.69,"end":831.46,"speaker":"Richard Rohlin","text":"They said these are dragon bones. And in fact, that dragon bone, like powdered dragon bone, is an important element ingredient in traditional Chinese medicine. You know, it's just like fossilized dinosaur bones, right? Dragon bones. And same thing. Same thing in the British Isles. Same thing in anywhere that somebody's dug up dragon dinosaur bones. They've said, oh, these obviously belong, you know."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":831.46,"end":831.86,"speaker":"Jonathan Pageau","text":"That's true."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":831.86,"end":835.26,"speaker":"Richard Rohlin","text":"I know, I know. I'm trying to. I'm trying to bring people along with us, Jonathan."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":835.26,"end":837.94,"speaker":"Jonathan Pageau","text":"Trying to accommodate for the modern world. I understand."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":838.34,"end":866.08,"speaker":"Richard Rohlin","text":"Yeah, I'm trying to bring people along with us. It's actually, it's much easier just to say the dragon bones. Right. So. And actually what's really fun is that all of these, like, some of the more recent reconstructions of what these various different dinosaurs might have actually looked like, they're like, well, maybe they had feathers and maybe they had this, maybe they had this. And they start, they keep looking more and more like dragons. And I'm like, just waiting. I'm just waiting for somebody to notice, you know. That's right."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":866.08,"end":884.41,"speaker":"Jonathan Pageau","text":"It's. That is. Actually, I noticed that too. I thought, you know, they used to make fun of the medievals for their dragon category. And now you look at a medieval manuscript and you look at modern reconstructions and like, ah, they got it better than a lot of the, you know, early 20th century gray, like those gray lizards that they. That they did."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":884.57,"end":887.89,"speaker":"Richard Rohlin","text":"Yeah. Okay. So anyway, all this to say, I."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":887.89,"end":920.76,"speaker":"Jonathan Pageau","text":"Just want to say one thing about the dragon balls, actually. So this is important. This is important to understand in a meta way, is that the fact that the dragon manifests itself as a residue of something which is forgotten is also part of what a dragon is manifesting like an ancient world that we no longer have access to. And that is and is kind of manifesting itself as a kind of chaos, broken residue, remainder of an ancient world. These are all the types of symbolism that we need to gather together when we think of what a dragon is."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":921.4,"end":932.93,"speaker":"Richard Rohlin","text":"There's a. One of my other favorite theories from modern scholars about this, you know, people who like to think of things in predominantly, like, evolutionary terms."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":932.93,"end":935.49,"speaker":"Jonathan Pageau","text":"This is the Jordan Peterson strategy is the."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":935.49,"end":944.81,"speaker":"Richard Rohlin","text":"The idea that. The idea that. Well, maybe it's because we're descended from monkeys and the monkeys were afraid of snakes, and so now we're afraid of, like, I don't know, just like, goofy, goofy stuff."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":944.81,"end":964.99,"speaker":"Jonathan Pageau","text":"You know, this is really Jordan's. Jordan's theory, like, is that. That, that, that ex. That it's a. In some ways, our fear of snakes is a predetermined thing. Like, it's not something learned. It's actually biologically inscribed in us. And so. And so that's why we have a mythological image of a snake that keeps manifesting itself."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":964.99,"end":989.88,"speaker":"Richard Rohlin","text":"So the, the big challenge to this is, is that of course, many people are not afraid of snakes. A lot of people like them, but also, like, not every. Like, not everybody is afraid of dragons either. Like, we'll. We'll get to that, right? Different cultures have different kind of. Different ways of encountering or dealing with dragons. So, like, I. I don't know. Yeah, I. I'm. I'm not totally. I'm not totally satisfied by that theory for lots of reasons, I guess, but Let me."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":989.88,"end":992.44,"speaker":"Jonathan Pageau","text":"Let me give the devil it's due, as Jordan himself would say."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":992.44,"end":992.8,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":992.8,"end":1030.2,"speaker":"Jonathan Pageau","text":"Is that. He said that the. The relationship between the snake is not just a fear. It's fear and fascination. It has to be both, because when the ape sees the snake, it will be afraid of it, but it will stare at it. Like. It'll stare at it for, like, hours because it's trying to figure out what's going on. And so this relationship between fear and fascination is one that, that he talks about. But the thing is that, let's say. How can I say this? The best description of a dragon, like, the best discussion about dragon has to do with our experience of. Of the category rather than the mechanical description."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":1030.2,"end":1030.6,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":1030.68,"end":1066.76,"speaker":"Jonathan Pageau","text":"Of how it mechanically came about, whatever that is. Like, we're not apes and we don't have to deal with. We don't live in trees and we don't have to deal with snakes. And so the idea that you would tell me that that's the origin of this. It's like, that doesn't mean anything. It doesn't. It doesn't. It doesn't enter into my Categories of meaning. It doesn't enter into the fact that, that, you know, a child will, Will, Will draw a snake like that. That something. There's something primordial about and that it happens in every culture. Like that's a. There's are better ways to approach that and I think the universal history approach is a better one that. To make sense of it."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":1066.76,"end":1086.32,"speaker":"Richard Rohlin","text":"So. Yeah, there you go. Yeah, that, that was good. And I appreciate you explaining that side of things to me a little more because actually, I don't know if you've ever seen like a weasel or a ferret hunt a rabbit or, or some kind of a rodent, but they actually do like sort of like a little dance that hypnotizes the, the, the rabbit where the rabbit's like fascinated, can't look away."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":1086.68,"end":1086.92,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":1086.92,"end":1088,"speaker":"Richard Rohlin","text":"And then the weasel kills it."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":1088,"end":1097.36,"speaker":"Jonathan Pageau","text":"So anyway, so it's like Mowgli the snake in Mowgli. That was a great Disney. That was a, that was a wonderful insight because it's not in the book, but it's like a wonderful."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":1097.36,"end":1131.58,"speaker":"Richard Rohlin","text":"It is. Well, it is in the book, except Kai. Kai, the rock python in the, in the book is, is Mowgli's friend. Yeah. And so actually in the, in the book, he's in the, like the city of the Bandalog. The monkeys. Right. Yeah. And the snake is the one that saves him from the monkeys, but he saves him from the monkeys by basically hypnotizing the monkeys until they basically walk into his jaws. But he's Mowgli's friend in the books, so that's the, that's the big difference. But anyway, love Rudyard Kipling. Okay, so let's get back to dragons."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":1131.74,"end":1132.22,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":1132.86,"end":1197.33,"speaker":"Richard Rohlin","text":"So dragons are serpents. This is the first thing we can say about them, but that they have this element of hybridity. So dragons are very rarely. I won't say never, but they're very rarely just a serpent. And in fact, if you go and look at mythological carvings, we'll talk about some of these. These dragons that are killed by thunder gods in Indo European and then later in Semitic mythologies, ancient near east mythologies. But if you go look at iconographic depictions of the serpent, the serpent is almost never actually shown. Almost. The serpent in the, in the Rig Veda, Right. Who is killed by Indra, the sort of the great hero of the epic. He's almost never depicted as just a serpent. He's usually like a. Some kind of a serpent human hybrid. And that's pretty normal. Like the, the farther back you go, the oldest dragon myths are Usually actually depicting some kind of a serpent human hybrid. There's a Persian variant of this where he has, it's a man, but he has three heads and two of the heads are serpent heads. And you know, and, and then of course, your various, like, you know, human upper body, serpentine lower half or vice versa."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":1197.33,"end":1197.49,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":1197.49,"end":1199.29,"speaker":"Richard Rohlin","text":"You, you have that as, you have that as well. So."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":1199.29,"end":1220.33,"speaker":"Jonathan Pageau","text":"Yeah, you see that everywhere. But it's important to understand, though that this manifestation has to be extended, for example, into the serpent in the garden. Because a serpent that speaks is already a serpent that's not quite a serpent is already something that is human, like you could say. Right. Even if, though it doesn't necessarily physically appear that way."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":1220.45,"end":1314.32,"speaker":"Richard Rohlin","text":"Yeah. And, and so a lot of times you'll have various dragons or dragon like creatures, which we're just going to call dragons for purposes of what we're doing today, that will have serpentine features, but then they'll also have features from a lion or very commonly in Chinese dragons, which I'm going to blow everybody's mind about in a moment. So just stay tuned for that, people. But Chinese dragons often have the, almost always have antlers like a deer as a, and, you know, feet like a lion and all these other parts. So, and actually there's a lot of traditional accounts and depictions of Chinese and other Asian dragons, Far Eastern dragons. There's a lot of symbolism that's, you know, that they, they read a lot of symbolism into the, the numbers of the scales or the numbers of the dots on the back of, you know, and so on. So, like all of these features are actually very important for understanding those creatures and that the dragons in those cultures. But so the second thing we could say about dragons is that dragons are almost always a guardian of some kind. And the things that dragons traditionally guard or you could say hoard, because hoarding is like the, the dark side of guarding something. But the things that dragons almost are always guarding or hoarding is water in almost every culture and then everything else that you have a dragon hoarding later on. I mean, famously in Western Europe, dragons sit on treasure. Right. But that's, that's because of certain developments a little bit later on, which we'll talk about."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":1314.64,"end":1316.08,"speaker":"Jonathan Pageau","text":"Yeah, they also kidnap women."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":1316.24,"end":1316.96,"speaker":"Richard Rohlin","text":"Yes. Yeah."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":1316.96,"end":1324.72,"speaker":"Jonathan Pageau","text":"You know, St. George story. So you have to think of it as a kind of hoarding where she takes the virgin and keeps her and then she has to be freed."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":1324.8,"end":1555.08,"speaker":"Richard Rohlin","text":"Well, and, but also the, the keeping of the woman is associated with. So this is the thing they guard water. But if you really Think about the significance of guarding water. It actually goes back to this idea of the serpent as the guardian of paradise. So if people want to get more into this side of things, you can go listen to the Lord of Spirits episode on the Serpent and the devil and all that stuff. One of the things they talk about is the, the relationship of the serpent in Genesis to the idea of the seraphim, the seraph, which is, you know, a winged, fiery serpent. Also a category of angel. Right? But the fiery, the fiery. It's a really old word. I think it. Well, it's a really old word. And the fiery originally has to do with like the, the, the sting, like the, the poison or the venom. The venom of the, of the serpent. But this idea that, this idea that the serpent, you know, was, was supposed to be sort of the guardian of paradise, and then that becomes obviously corrupted. But some other places that this manifest just for instance, is. Well, okay, so the thing to say about paradise is that paradise is a place where water comes from, right? Actually, first and foremost, this is the first thing that we know about Eden is that it has four rivers coming out of it, right? And so if you think about, well, how do you have four rivers coming out of it in four different cardinal directions? Well, the only way you can do that is if you're at elevation and there's a spring and then the water's flowing in each direction from the spring, right? So that's, that's what, that's what paradise is, right? It's a place where water flows from. Right? And so the, the idea of, of kind of like guarding paradise or is related to this idea of, of guarding the water or hoarding the water. And so this, this shows up in most, most famously, for instance, all the Greek dragons are, are water guardians. So the, the, the, the python that Apollo kills, the, the, the Nyean hydra. I mean, I mean, hydra itself, like, it's just means water means water, right? So a hydra, if you're looking at things through like a modern. Again, hate to rag on D and D here, but like through that modern D and D lens, you're like, oh, a hydra, that's a different creature than a drag. No, it's, it's just a dragon, right? But this particular dragon has multiple heads and. But it guards this particular body of water, right? And. But yes, all the, all the, all the biggest Greek culture heroes, starting with Apollo and Orpheus, are famous for killing monsters. But, but the, like the original monster, you know, starting with Apollo and Orpheus is this dragon or the Serpent that guards a body of water. Right. And we can think about the importance of water in the ancient world. And actually it's still its importance in our world today. I, it's easy to take for granted because I turn on the tap and the water comes out. Although actually they had the water shut off to, for us to our street earlier this week because they were doing some, some repairs to a pipe down the road. And that, that sense of like turning on the tap and the water doesn't come out and that just like moment of, of like really primordial panic that sets in. It's like, wait, why don't we have water? Why don't we have water? You know, and it was all fine, it was good. And, but it's one of those things where water is so essential. It's so completely essential to life. Right. And that, you know, again, that's the most important feature. We always think of like the garden of the fruit and the trees and everything, for obvious reasons. But the most important, you know, feature of paradise is, is the fact that this is a source of water. This is where the water comes from. And this is why the whole idea of the water coming from the throne of God in the apocalypse. Right, that's, that's what that's about."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":1555.16,"end":1568.48,"speaker":"Jonathan Pageau","text":"And in Saint Ephreim and in a lot of the medieval cosmology, the idea was in some ways that all the water came from Eden. You know, like that the, the four rivers basically watered the entire world until they ran into the ocean."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":1568.48,"end":1766.55,"speaker":"Richard Rohlin","text":"So, yeah, for people who don't know St. Ephraim, who is a 4th century church father, Syrian poet, definitely one of my favorite church fathers, but he, he's very clear in his hymns on paradise and his commentary in Genesis. He's very, very clear that he doesn't believe that Eden is like a terrestrial site. It's not on earth, it's sort of above the Earth and you have all the waters of the world. I mean, those four rivers mentioned in Genesis, as most people probably know, are the four great rivers of ancient civilization. That's what's significant about them is like those four rivers in the understanding of the ancient near east, like Mesopotamia and the Levant, those four rivers are the source of life and civilization in the ancient world. So you've got those four rivers kind of flowing down from paradise into the terrestrial world. Yeah. So, yeah. So dragons usually guard, watch over, protect bodies of water and they can either do this in a friendly, helpful way. So there are such things as, I'm not going to say Safe dragons, but, but sometimes helpful or friendly dragons. Right. Sometimes you can actually get what you want from a dragon under certain circumstances. But, and, and then other cases, they hoard all of the waters so that nobody gets them. So then the, the third thing that we could say about dragons is that they. And there are. This is where we start getting into some more exceptions. But typically speaking, the dragon has an enemy and the original enemy, the sort of primordial enemy of the dragon is the bull. The bull or really the thunder God. Right. Who's usually associated with a bull. And I'll give some examples of this at this point is probably a good chance to go into them in the, in the oldest stories. And one of the things that we talked about in the Beowulf class is that there are, there are scholars who believe. So for instance, there is a. There's a book by Calvert Watkins called How to Kill a Dragon, which is a really deep study in Indo European poetics. We read from some of it in the Beowulf class. And I would just say if anybody out there wants to understand what philology is and how it works and what you would use it for and the way that you kind of follow formulas and words as they develop and get reused again over and over again in. In stories over a really long period of time, that book is a. Is a really good. It's a really good introduction to the subject. But basically what he argues in there is that the, is that the original story, at least for Indo European languages, the original story is hero slay serpent. Right? The hero slays a serpent. And the hero in these really old stories is almost always a. Either a thunder God or the son of a thunder God. Now, as, as dragon slaying stories kind of reproduce themselves. I don't know how else to say it. You know, then eventually, eventually, you know, the thunder God part will kind of. Will kind of drop out. But even then, the idea of like a father and son pair or an uncle nephew pair sometimes being involved in the slaying of. Of the dragon is still kind of the, the typical. Yeah, the typical pattern of the story. So."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":1766.55,"end":1783.31,"speaker":"Jonathan Pageau","text":"Yeah. Which gets carried by the way, all. Which gets carried all the way into the story of St. Michael killing the dragon in a kind of transformed way. But this idea that, you know, some. A principality from heaven, like a kind of war principality from heaven, will. It will be the one to finally slay the big dragon."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":1783.47,"end":1900.71,"speaker":"Richard Rohlin","text":"Yeah, yeah. So let me give some examples real quick from some really old Indo European stories. So for people who don't Know, Indo European languages are the languages of, with some exceptions, some, some, some things like that we could asterisk that are not Indo European languages, but almost every language that you find in India and in what is now Iran, like the sort of the Iranian step. And then in Europe are Indo European languages. That is, they are descended from the same group, the same family of languages that go kind of go all the way back. And there are certain elements of Indo European society which in places as far apart as Ireland and India develop in the same way because they have the same roots. Right. And that, and that's why. So there is kind of a common language group and then because of that, a common culture. So one of the earliest Indo European dragons or serpents that we have is, I mentioned a moment ago, Vritra. Vritra is a dragon or a demon in the form of a dragon who in the Rig Veda takes all of the waters of all the rivers in the world and hoards them under a mountain. Right. So this is of course disastrous for the world. There's no fresh water, no fertile river valleys. And this means that the ancient hero Indra, who, Sorry, this means that ancient agrarian societies of the Indian subcontinent would be, would have completely collapsed. Right. Without water, you don't have anything. So he's slain by the hero Indra, who slays him with a thunderbolt crafted for him by the craft God Tvashtri, I think. And that that name Tvashtri is, has a lot of permutations. It shows up in like Hittite stuff, for instance, also an Indo European language. And, but in every kind of permutation that, that, that he's the guy usually that makes the thunderbolt. Not always, but in, in most cases."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":1900.71,"end":1905.95,"speaker":"Jonathan Pageau","text":"Let'S say, is that the weapon you see in Indian culture, like the double trident kind of weapon."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":1905.95,"end":1910.91,"speaker":"Richard Rohlin","text":"Yeah. So I should explain that A, a, a trident is a thunderbolt."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":1910.91,"end":1911.31,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":1911.31,"end":2257.78,"speaker":"Richard Rohlin","text":"I don't know how people, how, how many people know this or have thought about this. And I think that it's because thanks to Disney and other things, we like, we associate, associate a trident with Poseidon, you know, and the sea. But a trident is a, it's, it's lightning. Right. That force branches. Right. That, so a trident is a thunderbolt. And, and the, the typical weapon of the storm God is a trident slash, thunderbolt. Yeah. So that's what Zeus used. The, the Greek version of this is when Zeus kills Typhon, who's the Greek Titan, who is a serpent monster, father of monsters, et cetera, uses the thunderbolt. But the thunderbolt is really a trident. Like if you're imagining, you know, Poseidon has a trident and then Zeus has like this jagged thing, you know, that looks like a piece of cartoon lightning. That's not actually, that's not actually how they depicted it. So anyway, so, so he kills, he kills Ritra. And this, you know, and this is the, this is the basic pattern of the myth. And it shows up in the myth, the Hittite story. Actually, it's probably the oldest recorded version that we have of this particular myth is the myth of the Hittite God Ilyanka. And it's a little tenuous. Like I said, when you try to trace dragon stories and how they develop over time, you think it's going to be like, I'll just start pulling this thread and see where it goes. But it, it's the spider web. But, but we just say that the oldest dragon slang stories that we have are found in cuneiform, but they're, they're written in Hittite or in Luian, which would have been like the language probably spoken by the Trojans. Right? The Trojans were essentially Hittites and who had a very, who had a, who had a vast empire. And some of these, these stories go back to, I think, the earliest ones that we have we can reliably date to something like a 16th century B.C. something like that, like really old or maybe a little bit older than that. And they seem to have made their way via era, via kind of contact with the north of the Levant. They seem to have made their way eventually into Mesopotamia. So in Mesopotamia legend, you have the Enema Enuma Elish, which is the, the Mesopotamian creation myth. And it famously, of course, you've got, you know, Sumerian and Akkadian versions of it, but more recent research has those as being maybe slightly younger by a couple of hundred years than the, the Hittite version. So some people will say that it's originally a Semitic myth that travels west and north, like northwest. And then other people say it's actually an Indo European mythology that originally traveled into the, the near east somehow. It's probably impossible to say definitively. That doesn't really matter. But what a lot of these stories have in common, not all of them, but what a lot of these stories have in common is this idea of, that is, is tying it somehow into the idea of creation, right? So that the Storm God, when he kills the Chaos Serpent, right, he's able to separate the land from the sea, right? Separate the land from the sea. So this, this has this manifests a lot later on in basically every other dragon slaying myth that you find that you'll encounter in either the ancient near east or. Or Europe. And so, for instance, the. The most famous Norse dragon is Fafnir. Fafnir is actually a dwarf. He's a son of a powerful sorcerer. And after, essentially, after his family comes into the possession of a hoard of cursed gold, Fafnir drives his brother off, turns himself into a dragon and guards the horde himself. Right. And eventually along comes a guy named Sigurd the Volsung, or in the earlier versions of the story, he has father Sigemund. So there's that father, son, pair that's. Or sometimes uncle nephew pair that's really important in these kinds of stories. He slays the dragon with some help, usually from a son or from a nephew or from somebody who's both a son and a nephew in the case of. In the case of incest. And he kills the dragon the way that the dragon is almost always killed in the Western European version, which is instead of being struck by a thunderbolt from above, he is stabbed from below. Right. So that's how Fafnir is killed. That's how Beowulf's bane. Although if you want to know the. The name of Beowulf's bane, like the name of the dragon of Beowulf, you can, you can go. But listen to the glasses. But, but yeah, that dragon, it's. So this seems to be kind of like a theme in, in the, sort of like the western northwestern European version of the story is that the way that you kill a dragon is you stab it from below. Yeah. And the, the significance of Fafnir hoarding gold instead of water is. Is actually pretty simple to understand. It's that. It's that the, the, the culture of the Iron Age Germanic north was not agrarian. It was essentially what. What I've described elsewhere in the Beowulf class as a pirate economy. Right. So it works on. It works by going and raiding somebody, taking their gold and then using that gold. It's a pirate gift economy, using that gold to give gifts to your retainers, which is not the same thing as paying them. It's a, It's a. There's a difference. But you use it to give gifts to your retainers who then give you service. Right. So there's this reciprocity, reciprocal generosity. But you're. You. You have to have gold to be generous with. And there are no gold mines in, In. In Norway. Right. So you've got to go get the gold some other way, right? So you go raid, you know, you go do your Christmas shopping at Lindisfarne and then you. That's. That's a joke. Yeah, you, you, you the horrible joke. I know. I'm really sorry. I'm really sorry."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":2258.1,"end":2260.26,"speaker":"Jonathan Pageau","text":"You're Christmas shopping at Lindisfarne."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":2260.34,"end":2261.34,"speaker":"Richard Rohlin","text":"I'm. I'm really sorry."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":2261.34,"end":2261.94,"speaker":"Jonathan Pageau","text":"Oh, man."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":2262.1,"end":2262.9,"speaker":"Richard Rohlin","text":"Yeah, I see."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":2262.9,"end":2264.5,"speaker":"Jonathan Pageau","text":"I see your northern roots are coming."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":2264.5,"end":2418.4,"speaker":"Richard Rohlin","text":"Out and trying really hard to hide all of that. But, yeah, so you go, you go raid England or you go raid like northern France before the Normans, who were essentially Vikings, right? Before they settled there. Right? You go raid somebody civilized and then you get their gold and then use that gold to keep your economy going. So this is why in Beowulf we talk about this in the class. But there's this huge focus in Beowulf on generosity, the king's role as. As ring giver and Heramod, who's the worst king, right? He's the archetypical evil man. Evil king, right? The example that gets brought up over and over again in the poem, his whole deal is that he's. He's stingy because he's like, afraid of what's going to happen in the future. Like, if I give this away, then I won't have it for later kind of a thing, right? And so because of that, his kingdom collapses, right? And so if you're not generous, then, then society collapses. So a way to think about what a dragon is, is that it, at least in some permutations, it hoards whatever is necessary for you to exist as a society. Now this is where we get to this. The kind of like the. The but what abouts. Right? And so one of the things that you can say definitively is that all the oldest versions of dragon stories, in all the oldest versions of dragon stories, drag, the dragon has an enemy. The enemy is usually a thunder God or somebody that's associated with, in some way with a thunder God. Obviously, all of this eventually shows up much later from the perspective of, like, the Hittite stories, shows up much later in, like, the BAAL cycle and so on. And I will just. I will here inveigh against modern scholars of the ancient Near East. So I hope you're listening, folks. Sometimes when you read accounts of this and you're reading about all these thunder gods and the dragons they killed and everything, you'll get something like, so these six lines of cuneiform allow us to say all of these things with great certainty about the ancient Luwian storm God. But then there's this guy in the, this, this God in the southern Levant, Yahweh, and we just don't know anything about him. He's so perplexing, but he seems to have been some kind of a bold deity, you know, but unfortunately nothing helpful has ever been written about Yahweh. You know, like nothing that we can rely on. It's just very aggravating. It's like you get six lines of cuneiform, you say all these things with absolute certainty, but when it comes to the God of the Bible, well, obviously we can't trust the Bible, so we gotta go to non biblical sources."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":2418.4,"end":2425.16,"speaker":"Jonathan Pageau","text":"For, for, yeah, yeah, we need to find some line of cuneiform on a broken tablet somewhere that we don't know what the context is."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":2425.24,"end":2432.76,"speaker":"Richard Rohlin","text":"Right. Yeah. So anyway, that's my, that's my deep frustration which I was feeling as I was putting together the notes for our conversation."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":2432.76,"end":2448.1,"speaker":"Jonathan Pageau","text":"But yeah, but it's, by the way, it's important for Christians at some point we've understood, understood that it's like that for everything Christian. It's like, you know, every, everything Christian has this. Well, the, the people who told Jesus the story must be lying because they knew him."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":2448.26,"end":2451.26,"speaker":"Richard Rohlin","text":"Yeah, okay. How the hell, like, how the hell."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":2451.26,"end":2460.22,"speaker":"Jonathan Pageau","text":"Didn'T we get the story? It's like, so the people who wrote it because they're close to it, they must be lying because they're trying to make it look good. And so anyways, yeah, so, but this."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":2460.22,"end":2532.1,"speaker":"Richard Rohlin","text":"Brings up an important point because the main thing that we've been doing in universal history from the very start is actually trying to look at these things like through the eyes of the people who wrote them, like, take those people seriously. Right. And I mean, to go back to our last video about the, about Christmas, one of the things we, we, I, we kind of mentioned a little bit and then probably didn't elaborate on enough for some people is talking about the date of Christmas. Right. So this, you know, so if you look at, if you look at a lot of early like 3rd century on Christian authors, right, who are Putting Together chronologies, December 25 is the date that they assigned to the, to, to the birth of Christ. Right. And this is even before we have reliable dates for like some of those pagan Saturn winter celebrations. Yeah. Like, like Sol Invictus and things like that. So, so if we just look at it from the perspective of the early church, this is when everybody believed Christ, Christ was born. Right. And so the only reason to reject that, as we said, is this idea that it just makes too much sense. Right. Or. Or this idea, and this is really what it comes down to is this idea that if you find something in Christianity that is similar to something in some other religion, it must come from other religions. Has to always have been the source."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":2532.18,"end":2532.74,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":2533.06,"end":2535.7,"speaker":"Richard Rohlin","text":"Right. It can never. It could never have happened the other way."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":2535.78,"end":2554.01,"speaker":"Jonathan Pageau","text":"Yeah. Because you see, the same with the Northern, you know, with the. With the Scandinavian stories, which is that, you know, if there's a resemblance between Christianity, even though Christians wrote this down, if there's a resemblance between Christianity and these stories, it must be that they influence Christianity, which is just so hilarious."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":2554.09,"end":2581.76,"speaker":"Richard Rohlin","text":"I once had somebody really argue very sincerely with me that that the story of Christ's crucifixion had never happened. It was just based on the myth of. Myth of Odin hanging himself on the world tree. I know, okay. But that myth, nobody even came up with that story. Like, no one had even heard of odin in the first century A.D. like, he's a late God, you know, like, he's a very late God in the Norse pantheon. Like. Like, there's no way that could be the case."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":2581.76,"end":2584.84,"speaker":"Jonathan Pageau","text":"Yeah. And his story was literally written a thousand years later."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":2585.88,"end":2587.76,"speaker":"Richard Rohlin","text":"But. But by Christians. Right?"}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":2587.76,"end":2588.68,"speaker":"Jonathan Pageau","text":"By Christians."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":2589,"end":2594.12,"speaker":"Richard Rohlin","text":"But. But this. This person just could not accept the idea that if there was a similarity."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":2594.45,"end":2594.69,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":2594.69,"end":2603.77,"speaker":"Richard Rohlin","text":"That Christianity might have been, like, the original. The origin of it. So anyway, all of this to say. All of this to say. What were we talking about?"}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":2603.77,"end":2604.93,"speaker":"Jonathan Pageau","text":"We need to get back to dragging."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":2605.01,"end":2606.33,"speaker":"Richard Rohlin","text":"I'm so sorry. I'm so sorry."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":2606.33,"end":2606.61,"speaker":"Jonathan Pageau","text":"But."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":2608.61,"end":2622.83,"speaker":"Richard Rohlin","text":"So all of this to say. It is. It is really important to actually point out that if you read the Bible, you will find that there's a lot of Yahweh killing the dragon kind of stuff going on in the Old Testament. And by the way, also in the New Testament."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":2622.98,"end":2623.38,"speaker":"Jonathan Pageau","text":"Hmm."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":2623.38,"end":2656.12,"speaker":"Richard Rohlin","text":"Right. And. And this is really deliberate. This is really, really deliberate. Right. Because so many of those passages in the Psalms or for instance, in the book of Isaiah, which talks about Christ, talks about Yahweh killing Lotan or Leviathan. Right. All of those passages, they. They're a. They have a sort of polemical point they're trying to make, which is that all these things that you think about BAAL Right. Or the BAAL Hadad in particular."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":2656.36,"end":2656.64,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":2656.64,"end":2821.3,"speaker":"Richard Rohlin","text":"Who's. Who's like sort of the storm God in that. In that cycle, all these things that you think are true about him or his sister or whoever is supposed to have killed Leviathan in the different versions of that story or that you think are true about Marduk, if it's the Babylonian version or whatever. Like all those things are actually true about the God of Israel, but they're more true about the God of Israel, right, Because Bael is swallowed by death. But, you know, but, but our God will swallow up death, that kind, that kind of a thing, right? And so when you come across this, this, you could say, like really cosmological, I don't know the right word for it, imagery of, of Yahweh sort of, you know, riding the clouds and scattering the lightning, like his arrows and all this different stuff in the Psalms, which is incredibly cool. There's no need to be alarmed at that as a Christian, right? There's no need to be alarmed at. Because of course, this is his world. This is the world that he made. These things belong to him. And those particular passages, they do have a certain purpose. They had a purpose then. They also have a purpose now in sort of showing his dominance, his supremacy over creation, over the waters. And many of Christ's miracles are actually aimed at, in his own lifetime. I think that we talked, you and I talked recently about this, not in a, in a recorded conversation or anything, but you're talking about some new miracles and talking about something like walking on water, right? And we think of that as like, kind of in English when, when you say so and so could walk on water, what you're saying is that person is so holy, they're just like, usually it's a way of, like, it's a little pejorative. It's like saying they're kind of a goody goody two shoes kind of a thing. But the whole idea of walking on waters is that, is that chaos itself is under his feet, right? You know that the Lord who established the earth upon the waters, as it says in the psalms, right? Has total dominance over the waves, his total dominance over the elements, right? These things that are the abode of death and chaos and the serpent, all these different things, all those things are under Christ's feet. And this is the idea in the icon of Theophany where we show him crushing the head of the serpent in the waters. And this is in the liturgy in the Orthodox church. I mean, if you want dragons in church, like go, go to a baptism, baptism and, or, or like the great blessing of the waters, right? On theophany, right? And here just listen to the prayers, talking about asking, asking God, right, the God of Israel, Jesus Christ, to come down and crush the heads of the serpents in the waters. Right. And, and any dragon, any unclean spirit, any of those things that are lurking in water as the, the sort of like primordial source of chaos and instead reveal the, the, the creative potential, like the, the good, the. The good side. The good potential of water to create and give life and cleanse."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":2821.54,"end":2853.28,"speaker":"Jonathan Pageau","text":"Yeah, yeah. There's so many images of Christ where, if you understand the relationship between the dragon and water and you know, you can see it obviously as orthodox, it's easier to see because it's all there in the prayers, it's there in the icon, it can kind of get it. But once you understand that, then you'll understand some of the images. For example, that Christ always has these two aspects to him. On the one hand, he is dominating over chaos and on, on. That's on one hand. On the other hand, he is also, let's say, giving himself to the chaos to dominate it in the surprise."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":2853.28,"end":2853.6,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":2853.6,"end":2894.25,"speaker":"Jonathan Pageau","text":"So when in the story where Christ goes and sleeps in the boat and then comes out to master the waters, like all of that is relating to Jonah, it's relating to all these imagery and it's, it's obviously, you know, showing what's going to happen in terms of the death and resurrection, that he can descend into the. He can go into the dragon's mouth, basically enter into the dragon. You know, that image that we have of the, the warrior that sacrifices himself and goes into the beast and then cuts it up from the inside. You see that in the, the, the. The iconography of Saint. Saint Margaret, you know, that's, that's it, like that's the image of Christianity, but it is related to the waters and the dragon all comes together in death. All these images come together."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":2894.65,"end":2896.81,"speaker":"Richard Rohlin","text":"That's also the ending of Sharknado, by the way."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":2897.13,"end":2899.09,"speaker":"Jonathan Pageau","text":"Oh, I haven't seen Sharknado, so I'm."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":2899.09,"end":2991.69,"speaker":"Richard Rohlin","text":"Really sorry to even bring this up, but there was this movie that came out many years ago. I think it was like two houses ago or something for us. So a long time ago I had way fewer children, but this movie came out and it was like the idea was like just mash up two 90s, you know, like mash up Jaws with Night of the Twisters or something like that kind of a thing. And so like there's this big tornado and it starts dumping sharks everywhere and the sharks are eating everybody. It's a terrible movie. It's really dumb, really bad. But it was funny how like in the end, so I sat down with my brother in law to watch it as like, kind of like A Mystery Science Theater 3000, like, mock it kind of thing. And it was really interesting. Like at the end of the movie, the main character gets swallowed by a shark and then he chainsaws his way out. And I even remember at the time thinking like, man, you know, even making a, a goofy movie, that's. That. That was, that was not made with any intention of it being good. They just made this to make a dumb movie just for the memes. But you know, even, even at the end, like, they couldn't get away from the Christian symbolism, right, of like cutting your way out of the monster. So. Yeah, yeah, really. Sorry everybody. I didn't know I was going to talk about that today. But I mean, actually, I mean, the movie Jaws, right, is a great example of, of really what is a dragon story. Yeah, right. The idea of like the dragon lurking in the depths. Now you could say that, well, a shark isn't a dragon. It's not even a reptile. You know, what are you going on about? Et cetera, et cetera. Right? But. But it's function. It's functioning in that story. It's functioning as a dragon. Yeah."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":2991.69,"end":3010.25,"speaker":"Jonathan Pageau","text":"Well, we can see like the, the representation of the monster that swallowed up Jonah in, in tradition, even from like the 2nd century image we have, one of the earliest images in Christianity we have is of Jonah being swallowed by that, that, that fish. But it's a. It's basically a sea monster. It's a dragon, really. It's a sea dragon, man."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3010.25,"end":3040.68,"speaker":"Richard Rohlin","text":"There's some crazy stuff about the, about Jonah in the services of the Orthodox church as well. Like if you go to matins, one of the canons at matins, like always has the theme of Jonah. Yeah, the Jonah metcan, like every morning if you're at a, you know, place where they're doing matins every day, right? Or, you know, at least every Sunday at your church, right. There will be at least one verse or set of verses that on the theme of the feast. But, but it will work. Jonah in there some somehow. And you know, this idea of, of, you know, the sea monster spewing out Jonah like a babe from the womb. Right? Yeah."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3040.68,"end":3044.84,"speaker":"Jonathan Pageau","text":"And Christ like raising up as a, as a bride chamber from."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3044.84,"end":3046.24,"speaker":"Richard Rohlin","text":"As. As from a bridal chamber."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3046.24,"end":3048.56,"speaker":"Jonathan Pageau","text":"Like, stuff like that is, Is wild stuff."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3048.56,"end":3239.25,"speaker":"Richard Rohlin","text":"So crazy. Yeah, so, so yeah, the, the other thing that I want to say though is that there is a, there is a positive aspect to dragons or at least this idea that you can take some of the aspects of the dragon. It's, it's so, so like to go back to the hybrid, right? Hybrids are dangerous, right, because of. For various different reasons, right? But they're also. Hybrids have a certain like, resilience to them, right? And in fact, in, in animal husbandry and things like that or, or the whole horticulture, the whole idea of like hybrid resilience is like if you get a strain like a species or a breed that's like too pure bred. This happened with fruit trees. It also happens with like modern like dog breeds. You know, if you look at what a German shepherd looks like now, as opposed to what one looked like even 100 years ago, you know, it's really dramatic difference where, where you, you selectively breed too long for these very specific features, right? And then what you lose as a result is everything that made the breed strong and actually capable of doing work, right? And so then the question of, well, how do I get. Take one of these? You know, you probably can't take your cocker spaniel hunting, for instance, right? Even though he's a bird dog, right? Probably not gonna, probably not going to work out because he's too fragile. My, My parents owned many cocker spaniels when I was a kid. And I could just tell you they're very fragile, very neurotic animals, right? But it wasn't always so and so, you know, so there is a kind of like a strength and a resilience to the idea of the hybrid. Also the dragon's capacity as a guardian, right? If you're guarding something, you're only a threat to what's on the outside. But if you're on the inside, then you, you actually want that, right? And so lots and lots of cultures, and I mean lots and lots of cultures, pretty much every drag culture that has a dragon story, which is all of them will use dragons in this kind of aperture way. Welsh culture is a great example. It's my favorite example because of course, you know, it's right on the flag, it's right on the coat of arms. It goes back to like the oldest art stuff. I mean, Arthur himself, right? Pen dragon, right? Head of a dragon, right? Like, like he's. Arthur himself is associated with dragon imagery. Over and against, right? The Saxons, right? And that, that's that, that early story, like generation or two before Arthur, right, Of, you know, the White Dragon and the Red Dragon fighting, right, you know, beneath the castle. And eventually the Red dragon, which is the Welsh or the Brythonic dragon, is going to win the fight, right? And so, but also lots and lots of dragon stuff going On. In Germanic Iron Age culture, Old English, Old Norse, et cetera, very common to, to put dragons on things like the crest of a helmet or the face of a shield or the prow of a ship. Right. Um, and this was stuff that just sort of like, came naturally to people. Like, if I want this to be scary to my enemies, what would I put on it? The scariest thing that anybody could imagine. Yeah, right. Which, which is a dragon. Right."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3239.33,"end":3254.49,"speaker":"Jonathan Pageau","text":"And it's playing with very, this is playing a very, very deep symbolism that ends up in the medical symbolism as well. You know, the idea of, you know, I've, I think I might have mentioned this before. The, in the, the symbol of the serpent on the, on the rod."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3254.49,"end":3254.85,"speaker":"Richard Rohlin","text":"The."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3255.01,"end":3257.41,"speaker":"Jonathan Pageau","text":"What's his name? What's the name of the God?"}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3258.37,"end":3259.97,"speaker":"Richard Rohlin","text":"Caduceus. Caduceus."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3260.05,"end":3283.58,"speaker":"Jonathan Pageau","text":"No, it's not the Caduceus. It's, I'm going to think about it later. It's going to come to me. Anyways, so the, the Roman God of, the, basically the Roman God of healing. He, the story is that he, he kills the gorgon, which is this dragon kind of sea serpent monster, and, and he takes the blood from the right side of the serpent and makes."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3284.06,"end":3289.01,"speaker":"Richard Rohlin","text":"Yeah, it's, it's, it's Hermes, but it's, it's called the, the, the caduceus is the."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3289.01,"end":3292.65,"speaker":"Jonathan Pageau","text":"But it's not. No, this is, it's not the same. This is, this is a different, this."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3292.65,"end":3295.45,"speaker":"Richard Rohlin","text":"Is different healing God with a, with a snake."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3295.45,"end":3297.05,"speaker":"Jonathan Pageau","text":"Yes, it is. I'm sorry, I'm so."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3297.05,"end":3297.57,"speaker":"Richard Rohlin","text":"Darn it."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3297.73,"end":3334.34,"speaker":"Jonathan Pageau","text":"I don't know why I, I, I don't know why. I don't know why his name isn't coming to me. I usually, I've written about this anyway, it doesn't matter. And so he takes the blood from the right side of the serpent to make healing. But then the idea is that the blood from the left side of the serpent basically is the poison. And so this idea of this apotropaic function of poison, right, as both. That which kills you, that which saves you is the, is the very symbolism of, of medicine itself. Right. It's a, it's a, it's using the poison to create a cure out of the poison. Right. This idea of, of, of trampling death by death, basically abusing death against itself."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3335.38,"end":3351.02,"speaker":"Richard Rohlin","text":"It's always been weird to me, as an aside, how if you look at a lot of ancient abstract imagery of the, the Caduceus or, you know, anyway, the rod you're talking about, that it has it a Lot of times, Asclepius."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3351.02,"end":3352.46,"speaker":"Jonathan Pageau","text":"It's the rod of Asclepius."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3352.46,"end":3353.9,"speaker":"Richard Rohlin","text":"Asclepius. Okay, all right."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3353.9,"end":3357.3,"speaker":"Jonathan Pageau","text":"Such an idiot. Like, I'm like, it's gonna come. Just sent the Google search on my."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3358.5,"end":3361.78,"speaker":"Richard Rohlin","text":"It's all right. So yeah, buffering, please."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3361.78,"end":3362.18,"speaker":"Jonathan Pageau","text":"Wait."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3362.34,"end":3376.11,"speaker":"Richard Rohlin","text":"But, but when you look at, when you look at abstract versions of it, you. You find in like Sumerian imagery because it's there and it's in India as well. Right. That a lot of times abstract, it looks like a. It looks like a DNA helix."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3376.35,"end":3376.83,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3376.99,"end":3378.55,"speaker":"Richard Rohlin","text":"Which I've always thought is a very interesting."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3378.55,"end":3403.23,"speaker":"Jonathan Pageau","text":"Well that's a good way to represent it. Like the, the Sclepion. The rod of the Caducean rod is a good way to represent it. Instead of just one, you have two snakes. Basically, let's say a right snake and a left snake. One that two are facing each other like in. In conflict. And in the, in the case of Hermes, it really has to do with the bridge. It has to do with this in between space. That is a double sided space. Right."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3403.23,"end":3403.55,"speaker":"Richard Rohlin","text":"It."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3403.55,"end":3405.31,"speaker":"Jonathan Pageau","text":"This is the problem."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3405.71,"end":3411.15,"speaker":"Richard Rohlin","text":"Asclepius has the one snake, the Caduceus has the two. Yeah, guys, you're watching us just like figure this out."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3411.15,"end":3415.35,"speaker":"Jonathan Pageau","text":"Figuring it out. But Asclepius is directly related to healing medicine."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3415.35,"end":3415.87,"speaker":"Richard Rohlin","text":"Yeah, yeah."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3415.95,"end":3416.99,"speaker":"Jonathan Pageau","text":"In Roman mythology."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3416.99,"end":3417.39,"speaker":"Richard Rohlin","text":"That's right."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3417.39,"end":3427.41,"speaker":"Jonathan Pageau","text":"Whereas Hermes is. Is in some ways seen as this messenger figure. Yeah, it's related because the messenger, the in between or the, the. The bridge or the. This is the problem of the hybrid."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3427.41,"end":3427.57,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3427.57,"end":3439.49,"speaker":"Jonathan Pageau","text":"It's like this between space that goes both ways. It's like it can either. It could either be a guardian or. You're right, it could either be something which is defining or something which is going to bring. Bring chaos."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3439.49,"end":3439.73,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3439.73,"end":3439.93,"speaker":"Jonathan Pageau","text":"That's."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3439.93,"end":3455.67,"speaker":"Richard Rohlin","text":"The Caduceus is also associated with rhetoric. Was also associated with like rhetoric. It was the same symbol of. Of rhetoric in the ancient world. I think for the same. For the same reason. Right. You know, the capacity of rhetoric to sort of heal or hurt, you know. Yeah, yeah. So."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3457.99,"end":3459.19,"speaker":"Jonathan Pageau","text":"We'Re dealing with this."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3459.19,"end":3462.43,"speaker":"Richard Rohlin","text":"Yes, integrating. I'm sorry guys, it's hard because dragons."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3462.43,"end":3467.19,"speaker":"Jonathan Pageau","text":"Will bring you all over the place. That's exactly what they do. Because they're very. The symbol is quite. Is quite big."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3467.59,"end":3778.56,"speaker":"Richard Rohlin","text":"So. So when we're talking about like integrating the aspects of the serpent or integrating the aspects of the dragon. Right. This is where. This is why basically everybody that I've ever talked to about doing this video that we're doing right now will say something like, oh, I'M really looking forward to your symbolic world video on. And I've had like 10 people say this to me. Really looking forward to the symbolic world video on dragons because I don't understand what's going on with Asian dragons and why they're different. You know, because they're obviously, they're very different because they're like good luck and all these different things. Well folks, here it is. They're the same. That's it. They're the same thing. If you go back and look at really early like Bronze Age Chinese dragons, they're usually sometimes called pig dragons or pig headed dragons because basically it's like a serpent usually kind of curled up in a sort of a fetal position, but it's a serpent with the head of a pig. And then it seems like contact with the, with the, like the Persian world via the Silk Road. Right. So anytime we're talking about anything actually from this period, you have to understand there was a, there was a very, very heavily used trade route between China and Baghdad, you know, and, and you know, even before Baghdad was Baghdad, like the very heavily used trade route between the ancient near east and, and therefore eventually the Roman world when that comes to develop. But anyway, very, very well used trade route between the ancient near east and the Far East. Yeah, and what this means is that if, if, if you think of these things to be like totally different worlds, it's not totally accurate. They, they are in some ways, but, but, but they, they actually share a lot more than you would think. So it seems like because of, by the Iron Age, because of, with dragon imagery in Persia and elsewhere, that eventually the, the, the, the Chinese version of the dragon comes into much greater alignment with, with. That's why I was saying earlier, if you look at a picture of a, of a Persian dragon which we'll put up here on the screen, it looks just like a Chinese dragon, essentially. Right. And so then what eventually happens in China is that you get two forms, they have two different names, but basically the main difference is one has wings and the other one doesn't. And then eventually the wingless version and it becomes predominant. But if you go back and you look at the very earliest Chinese dragon stories which we have recorded, and we have some very old ones because they were an incredibly literate society even from, you know, very early time. Their water, their, their guardian, they're, they are, they are serpentine spirits or deities or beings who guard bodies of water. And, and then sometimes this is what's interesting to me, also control the rainfall so norm like in the, what you do have in the west and like the Indo European version of the story is that the, the main enemy of the dragon is often the thunder God who controls the rainfall. And in China it's the sort of like the dragon is the thunder God sometimes. Yeah, but yeah, is a, is a serpentine deity or spirit or being or monster that's a hybrid of all these different kinds of animals and controls these various bodies of water. And a lot of the early stories have to do with not trying to slay the dragon. Although there is one that I've one, one or two that I found. Although a lot of the dragon slaying stories actually seem to have come from Buddhism, who probably, probably got them from, from India or maybe from the Christian near east, something like that. And then so in some, like later Buddhist mythology, dragons do become representative of these demons that represent the passions and et cetera. But, but in the earliest stuff, for the most part, instead of trying to slay the dragon to get the water, you're trying to appease the dragon in some way with a gift of some kind, try to appease the dragon to get the water. What eventually happens, and this is really important for Chinese cultural identity all the way up to the, to the revolution really, is that the dragon becomes associated specifically with the emperor to the point that it becomes illegal to, for anybody that's not part of the imperial family to even use a dragon as a symbol on anything. And there are, there's whole different kinds of things about, I mentioned earlier, there's a lot of symbolism for different, different kinds of dragon, like certain numbers of features and scales and plots and things like this. So there is like one dragon that you would use if you were the emperor and, but then if you were some member of the imperial family, but not the emperor yourself, there was another dragon that you would get to use, but it wouldn't be like, it wouldn't have quite all the same features. And so, but basically the dragon became synonymous with imperial power. Right. And so in that same way that you can take the aspect of the dragon and then kind of harness it. Right. But then also there's also with that there's always this, this, there's always an aspect to a dragon of, of its potential to hoard or oppress."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3778.88,"end":3802.43,"speaker":"Jonathan Pageau","text":"Yeah. So, so you could imagine that the connection is that if you see the, the dragon as a guardian of water, you could understand that as a guardian of blessings, like you could, you could, that could easily go into that direction. And so once you see that, then you can understand why the guardian, the, the guardian of the blessing, the guardian of waters could be like a sign of good luck in that sense."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3802.43,"end":3802.67,"speaker":"Richard Rohlin","text":"Right?"}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3802.67,"end":3820.03,"speaker":"Jonathan Pageau","text":"It's right then said, if I make the dragon happy, then I. Then it opens up the door so that this stuff will come down on me. And you can understand why that would then end up being. That could be related to the emperor or to some person of authority because they are the guardians of blessing. The guardian of blessings."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3820.35,"end":3869.21,"speaker":"Richard Rohlin","text":"The other really interesting thing is, um, if you read a lot of old stuff about dragons in Chinese, and this is still the case, by the way, in modern, like Asian organized crime is this idea that if you put the image of the dragon on something, but you're not worthy of it, actually you find the same kind of thing in Scandinavian mythology and stuff. But if you, if you put the, if you put the image of the dragon on something but you are not sufficiently dragon like yourself, then it's not good luck. It's actually quite the opposite. Like the dragon will consume you. Like if you, if you take the symbol of the dragon for yourself, but you're not strong and, and, and lucky and you know all these things that a dragon is. Right. If you're not those things enough, then actually you'll get the, the wrong kind of attention from the dragon. Which is, which I, I think is the case of like apotrophe imagery in general. Right?"}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3869.21,"end":3869.57,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3869.57,"end":3882.2,"speaker":"Richard Rohlin","text":"The idea that, that you want to make sure it's outward facing and if, but if you're not like yourself strong, then try to put yourself behind this thing and sort of hide yourself behind it. It'll end up turning in on you and kind of consuming you and eating."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3882.2,"end":3936.27,"speaker":"Jonathan Pageau","text":"Right. And you can understand that as the, you know, if you think of Cerberus or these kind of marginal figures that are in between spaces that guard the, the guard the world of death, for example. And they kind of act, they kind of act both ways. They'll stop. They stop things from the outside to come in, but they can also prevent you from going out if you're not, if you're not careful. And the similarity between medieval iconography, Western medieval iconography of demons and Western medieval iconography of gargoyles is exactly that. In some ways they very similar in nature and one is facing out and the other is coming towards you. But it can always. That's why there's even an ambiguous. In modern kind of popular culture, there's an ambiguous relationship to things like gargoyles, let's say, you know, where they're seen Almost as ominous and evil because they're on that. They're on that edge, you know."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3936.59,"end":3989.88,"speaker":"Richard Rohlin","text":"And so something to say as maybe just like kind of a final note to this is that there are plenty of examples in Christian iconography of, of. You would, you would think we would just always be anti dragon all the time, but there are plenty of examples of dragons. Again, cherubim and Seraphim being a really easy example. Right. But there are sort of like monsters that are on our side or like the, the idea of the monster guarding paradise. I've been to lots of Orthodox churches in more than one country where on the, on the holy doors, right? The. The holy doors in front of the altar there would be like sort of, you know, border patterns of dragons, right? Oh, yeah. And same thing in the Middle Ages, doors of churches later on when pews come in, even like carvings of the outside of pews and things like that. Right, so. So this is, this is actually. And of course, lots of Christian countries, Lots of Christian countries use dragons as part of their."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":3989.88,"end":4018.65,"speaker":"Jonathan Pageau","text":"Yeah, they're massive dragons on Marathos, you know, on the iconostasis. And usually they're akin to the symbolism of the bishop's staff, which is that you'll usually have two dragons under the cross kind of facing the cross on the iconostasis, if you have a cross at the top of it, you know, and it, I think it is related to this. But the, the deepest and most mysterious aspect of the symbolism is the fact that Christ takes the shape of a serpent on the cross. That is, that's."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":4018.81,"end":4043.36,"speaker":"Richard Rohlin","text":"And that's where I wanted to end was, was. And it starts with Moses lifting up the serpent in the wilderness. So he takes the pole and puts the serpent on it. And of course, going back to the rod of Asclepius or the Caduceus, right. You've got this idea of like a serpent on a pole as a source of healing, as a source of life. Right. But that's in. That's an exodus. Yeah. Or numbers, anyway."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":4044.8,"end":4045.8,"speaker":"Jonathan Pageau","text":"Yeah, it's in numbers."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":4045.8,"end":4086.75,"speaker":"Richard Rohlin","text":"Yeah, it's in numbers. And Christ says, my crucifixion is like this. He says that it's one of the times that the Bible interprets the Bible for you, which is always handy. Sometimes you can sit around and really think about these things and overthink them a little bit. But there are a precious few number of times where Jesus will just tell you, this is what this thing means. Right. And so he says, even as Moses lifted up the serpent in the wilderness, even so the Must. Must the Son of Man be lifted up? Right. And if I am lifted up, when I am lifted up, I will draw all men to me. I said we were going to stop here, but."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":4087.07,"end":4122.46,"speaker":"Jonathan Pageau","text":"But I just want to say, like, to understand the mystery of Christ, you know, you have to understand it, or the mystery of the God of Israel and how he manifests himself in the world. You have to be able to see the three parts of this story, which is, on the one hand, Christ is swallowed by the snake, on the one hand, he becomes the snake, and on the. On the one hand he kills the snake, and he does all three kind of simultaneously on the cross, which is very. It's a. I mean, it's. It's one of those instances where, you know, there's no story to tell after that. It's pretty much reached the limit of what the symbolism of the snake is."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":4123.58,"end":4147.9,"speaker":"Richard Rohlin","text":"There is this. There is this kind of a strange thing with the image of the dragon, especially the winged dragon. So just talk about this variant for a moment. Not every dragon has wings. That's. It's. It's not like a universal. But lots of dragons have wings or can fly. Right. Going back to, like the Asian dragon, you know, they always. They're always able to fly. Right. And this is why they can be associated with the terrestrial water and also the water that's from above."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":4148.26,"end":4148.58,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":4149.86,"end":4203.01,"speaker":"Richard Rohlin","text":"There is this kind of weird thing with serpents and birds. So this is something that came up in the Beowulf class that I've just thought about a lot since, talking about this idea that you have in some old stories. For instance, the story of Fafnir, who, again, is the sort of the archetypical old Norse dragon. This idea that if you eat the heart of a dragon, you can understand the speech of birds. Right? To understand the speech of birds. And the idea of the speech of birds is always associated with, let's say, like, heavenly wisdom. So then, like, what's. What's going on there? What's the connection there? And. And as we were talking about it, I. It occurred to me, you know, Christ's command, right? Be wise as serpents and harmless as doves. Right? That this is. Connect this. That this has to be. That this is connected in some way, right?"}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":4203.01,"end":4206.41,"speaker":"Jonathan Pageau","text":"Yeah. That in some ways those two actually, if you. You do them simultaneously."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":4206.65,"end":4220.57,"speaker":"Richard Rohlin","text":"Yeah, yeah. And. And again, that's like one of those things that I still have not, like, fully. You know, I don't know. It's hard to talk about because it's one of those things Like, I have an intuition there, but it's not fully formed."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":4220.57,"end":4239.25,"speaker":"Jonathan Pageau","text":"Yeah. And it's difficult because one of the things that makes it difficult is that in some ways, this symbolism of the winged serpent, for example, is one of the most. Is one of the oldest and kind of the most universal symbolism. Like, you find these. The symbolism in North America, in, like, South America, when the."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":4239.25,"end":4242.21,"speaker":"Richard Rohlin","text":"The Spanish and North America and Egypt."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":4242.21,"end":4294.44,"speaker":"Jonathan Pageau","text":"Yes, it's really everywhere. And so it is in some ways a. You know, it is this union of heaven and earth. Maybe it is this. It's kind of poking at certain imagery that's very difficult to fully grasp. And in. And because of what the dragon represents, can kind of understand how it can become parasitical. You know, if it. If you understand it as a guardian, it can always be both affording and preventing, and it can always, at the same time become. How can I say this? Just like the principalities in general. Let's say you imagine principalities above you. How they can afford grace from above, or they can actually make the grace stop at where they are. That seems to be one of the. Some of the symbolism that. That is being shaken up here."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":4294.6,"end":4360.1,"speaker":"Richard Rohlin","text":"Okay. So in your recent conversation with Father Joseph Lucas, which was tremendous, by the way, people should go back and listen to it if they didn't listen, because it was really, really good. But one of the curious things in there, St. Cyril of Alexandria, when he's talking about the scapegoat, right? And he says Christ being the scapegoat, being sent out into the wilderness is like Christ ascending to heaven. And I remember how weird that seemed, Right. And this is one of the frustrating things about listening to your friends, you know, and Father Joseph is a good friend of mine, and you're a good friend of mine. The really difficult thing about listening to your friends have a conversation, but you're not actually there for them, keep wanting to jump in. I know, and what I wanted to say about that, actually, so this is me jumping in, but I wanted to say about that, actually, is that that's a very. That's actually a relatively common patristic interpretation. You find the same thing in St. Gregory of Palamas, who lived a lot longer, you know, much later than Cyril. And the reason. The reason for this. It goes back to this idea. Like, we. We're used to, like, thinking of the wilderness as the abode of the demons, but also the air is the abode of the demons."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":4360.5,"end":4361.7,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah, right."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":4361.7,"end":4379.82,"speaker":"Richard Rohlin","text":"The. The air is. The air is the abode of the demons. Right. And so you have this idea St. Gregory talks about, of Christ sort of like clearing a path for us as he's ascending. Right. Clearing a path for us so that we can pass, sort of pass up unharmed even. I know it's like people freak out if you mention this, but even the idea of. You know what I'm gonna say."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":4379.82,"end":4394.35,"speaker":"Jonathan Pageau","text":"Yeah, we know what you're talking about. Yeah, that's what. It's dealing with. The spirits of the air in the toll houses that you have to kind of encounter. Well, in St. Paul, we were in the. On Sunday's reading, you know, that's what it said. Yeah, it talks about that. Exactly."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":4394.35,"end":4413.79,"speaker":"Richard Rohlin","text":"So I just. I just, like. So. So. But this is related to the idea of the. The fiery. The. The fiery flying serpent, right? Yeah, this. This idea that. That there are these kind of. That there. There could be these, like, monstrous principalities that guard not just, you know, that guard access to paradise. Like, I don't know how to say it, you know?"}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":4413.79,"end":4414.19,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":4414.27,"end":4463.69,"speaker":"Richard Rohlin","text":"And. And there's an association with their capacity to fly. Right. And the sort of access to. I mean, one of the. One of the tropes, it doesn't always come up, but it often comes up with dragons. And going back to the idea of eating the heart so you can understand the language of birds is related to. This is. Is a lot of times dragons are considered to be very wise or. Or have access to wisdom or knowledge about things that humans don't have. Right. You find this in some of, like, the Zoroastrian dragon stories as well, for instance. So this idea that. This idea that the dragon has access to. To this knowledge. Right. But then, of course, sometimes. Sometimes. Sometimes knowledge is not good for you. Right. Sometimes that wisdom is not good for you. So. So it's got that kind of ambiguity to it."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":4463.69,"end":4504.04,"speaker":"Jonathan Pageau","text":"Yeah, no, for sure. I mean, we're not going to get out of the ambiguity in the symbolism of the dragons, because I'm thinking again now at, like, the way that the dragons represent in Revelation, you know, as the great, great dragon that pulls the stars, that pulls the principalities and captures them basically under his rule. You know, it's like, okay, there's another image of how he's hoarding. He's hoarding these angels in his grasp, and now he's, you know, kind of mastering them for his own. For his own will. You know, there's another image that's very similar, but now the dragon is definitely represented in. In all of Revelation, the dragon is definitely the devil. Like, he's not."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":4504.04,"end":4505.88,"speaker":"Richard Rohlin","text":"Yes, there's no question at all."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":4505.96,"end":4519.32,"speaker":"Jonathan Pageau","text":"That's right. So, so I think that it's, it's really, I think we're, we're still, we're back at the beginning in the sense that, you know, if someone thought they would come here and get a dictionary definition of what a dragon is, not going to happen."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":4519.48,"end":4551.51,"speaker":"Richard Rohlin","text":"But here's, here's the thing about dragons, though. If you see one, you know it, you know, it's one of those things, like, very hard to nail down a definition across the board. But I can look at a dragon in a Chinese image, and I can look at the carving of the Midgard serpent of the door of a church in Norway, and I can look at a Persian illumination of a dragon, and I can look at something from South America, and I can look at all of those things and say, that's a dragon."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":4551.51,"end":4552.07,"speaker":"Jonathan Pageau","text":"That's a dragon."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":4552.07,"end":4552.67,"speaker":"Richard Rohlin","text":"Yeah, that's right."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":4554.03,"end":4574.97,"speaker":"Jonathan Pageau","text":"All right, everyone. Well, that's our discussion about dragon. Thanks, everybody for your attention. And I think that both of us, both Richard and I, were still processing and still processing the discussion, and so get involved in the commentaries. This is the time, you know, tell us your, your, your insights about dragon. So thanks, everybody, and we'll talk to you soon."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":4575.37,"end":4576.09,"speaker":"Richard Rohlin","text":"Thanks, everyone."}
{"episode_id":"SW - #327 - 2024-02-16 - Richard Rohlin - Universal History - Dragons!","start":4577.61,"end":4592.59,"speaker":"Jonathan Pageau","text":"If you enjoyed these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase, so go to thesymbolicworld.com and thank you for your support."}
