{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":0.24,"end":168.13,"speaker":"Jonathan Pageau","text":"I'd like to welcome you to the Symbolic World podcast. On this episode, I'll be playing for you the second conversation that I had with Paul Vanderkly. Paul Vanderkly is a pastor in California who also runs Jordan Peterson discussion groups, in which he has monthly meetings with atheists and agnostics and different people who are searching. So we always have a great time discussing. In this particular discussion, we look at what is quickly getting to be known as the meaning crisis, how we see the discussion going further in terms of all these people discussing Paul with Paul, John Vervecki, people from Rebel Wisdom, all these discussions that are swirling around. And so I hope you enjoy it. I have a great time talking to him, every discussion that I have, and I'm sure we'll have many. This is Jonathan Pageau. Welcome to the Symbolic World. I feel like it's weird because it happened on. On Easter Saturday for Orthodox Easter Saturday. And I really feel like I didn't get pascha. Like, there's no Easter this year. That's kind of how it feels. And I'm still kind of in the cave. You know, I'm still down. We're still kind of down in that. In that cave. And so that's kind of how it feels. But, yeah, at the same time, it's been amazing, you know, it's been amazing. It's been amazing to see all these people that have supported us financially. So many messages, prayers, people, you know, it's just been. That's been just astounding for me. Very touching and encouraging. Just wants you to not crumble and just keep going. And so. And I'm not a very practical person, which is one of my. Because I'm a carver, they think that I'm a very. That I'm a practical guy. But no, I can carve the most precise little miniature. But if I cut the board for my carving, I'll make half an inch mistake. That's how it is for me. So, yeah. So it's. So now, like going back. I was just there yesterday and then a few days ago, stripping more stuff from my workshop, you know, putting up fans and then decontaminating with all these chemicals and stuff. I'm just. It's just so counter nature to me. It's good for me, but it's. It's. I really have to kick myself to get to something like that."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":169.09,"end":174.17,"speaker":"Paul Vander Klay","text":"Now is it settled that you can move back into that area and we."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":174.17,"end":237.92,"speaker":"Jonathan Pageau","text":"Have a catch 22 situation? It's. It's that we actually probably have to go back because what happens is the government, usually the law that was passed a few years ago was that if you're, you're flooded and it's a, it's a floodable area, like it's a lake that floods your house. And if you have, the government will not let you rebuild. Or if you accept, like if you accept a certain amount to rebuild, then if it floods again, they won't give you anything. So they'll give you an amount. It's like a set amount. It ends up being maximum 250,000 Canadian and you leave. That's it. You demolish your house, you're gone. But because there are so many people flooded and because it was a dike, they made us into an exception. So they've said, although it will be considered floodable area, although all of this is true, we're giving you the right to still go back and rebuild. And you have to do it fast because in six months then you won't be allowed to rebuild the way that you've rebuilt."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":238.24,"end":238.72,"speaker":"Paul Vander Klay","text":"Wow."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":238.88,"end":274.3,"speaker":"Jonathan Pageau","text":"And so which means that now we had, we had our kids in the basement and so they'll be in a floodable area. Like it'll be considered floodable from now on. It's like we were living in an imaginary world. So. So we don't want to put our kids back in the basement, but now we can't leave. We have to go back. And we had, we are, we have a very small house and two of the rooms were in the basement and we have three kids. So anyway, so now the only option we have is to put a second floor on our house because we can't. We, we have to go back and we can't sell. No one's gonna want to buy that house for at least five, six years."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":274.54,"end":274.9,"speaker":"Paul Vander Klay","text":"Right."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":274.9,"end":302.64,"speaker":"Jonathan Pageau","text":"And so it's like. So now we're, so now we. So that's what we, that's what we're looking at. And I mean, thankfully people, we've had some help. We had. The GoFundMe was, was pretty successful. So that'll be like a nice, like a nice starting point to be able to do that. But I probably. And also I've always been debt averse my whole life. So I have a very, very small mortgage. It's ridiculous how little my mortgage is. So I can probably borrow on my, on my mortgage and then rebuild. So."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":304.41,"end":304.73,"speaker":"Paul Vander Klay","text":"Wow."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":304.97,"end":305.45,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":305.93,"end":316.41,"speaker":"Paul Vander Klay","text":"It's even the dislocation. You know, these things work in us in weird ways. And so."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":316.81,"end":317.29,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":317.69,"end":319.53,"speaker":"Paul Vander Klay","text":"I continue to pray for you and your family."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":319.85,"end":362.54,"speaker":"Jonathan Pageau","text":"Thank you. I keep telling people, though, this is not the first time we were evacuated. We've been evacuated several times, but not with. Not the same. This is more like our kids are older and we're. We also have to deal with their emotional thing. You know, before that, it was like us. We had to deal with it, and we had very, very small kids. They didn't know what's going on. It's like they were just on this trip, traveling or whatever. We can see our youngest daughter who just breaks out crying because he misses her house. And I realized, oh, she's actually never lived anywhere else. Yeah, I've lived many places. I've lived all over. All over the map, but she's never lived anywhere else. So her attachment to that house is way deeper than mine."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":362.89,"end":363.77,"speaker":"Paul Vander Klay","text":"Yeah. Yeah."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":363.77,"end":395.62,"speaker":"Jonathan Pageau","text":"So that's. That's been something that I've discovered, which has been touching, but also kind of okay. So I need to take this seriously. Like, I can't just be. Also, I can't just treat this house like it's just an object. I realize. So there's history here. I need to. I need to also consider that with my kids, you know, at least deal with it, talk to them, and no matter what happens, you know, but we're telling them that that house that we lived in, it's gone. I mean, although we're gonna. We're probably gonna go back there. It's not going to be that house. It's going to be something else. It's going to have to."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":396.5,"end":400.3,"speaker":"Paul Vander Klay","text":"For a child, that is a whole different thing than it is for you and your wife."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":400.3,"end":401.94,"speaker":"Jonathan Pageau","text":"Yeah, for sure, for sure, for sure."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":402.74,"end":404.74,"speaker":"Paul Vander Klay","text":"But that's life in this world."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":404.98,"end":405.86,"speaker":"Jonathan Pageau","text":"Yeah, exactly."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":406.82,"end":408.5,"speaker":"Paul Vander Klay","text":"That will be something for your kids."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":408.5,"end":408.9,"speaker":"Jonathan Pageau","text":"That."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":411.14,"end":423.93,"speaker":"Paul Vander Klay","text":"This will be a major event for your children in their lives. It'll be something that they'll always think about, and it will reshape them as they grow up. This will be something that. For good and for ill, both, usually."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":425.53,"end":484.3,"speaker":"Jonathan Pageau","text":"And luckily we have, you know, we take the time to sit together and talk about it and explore, you know, and so I think the kids feel like they're part of the discussion, at least, so. But, you know, it's so weird. It's like when you're going through that and then you look around and you see, you know, I mean, I look at Jordan, what Jordan's going through, and it's crazy, you know, and so. And so you think, okay, life, you know, you always have to remember that, like Jordan always said, no matter how bad it is, it could always get Worse. So you really have to. Really have to approach things in a different way. So. And Jordan has been. It's crazy. I mean, right in the midst of, you know, him being at the hospital every day and everything, he'd write me little notes and say, how are you doing? How's your family doing? And I'm like, jordan, don't. You don't have to pray me. You've got your own thing to deal with. You know, it's okay. Anyways, yeah."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":486.14,"end":495.66,"speaker":"Paul Vander Klay","text":"I had sent him a note and just, you know, expressing my concern and telling him that I was praying for him. And he wrote back, and you don't have to write me back."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":497.34,"end":498.06,"speaker":"Jonathan Pageau","text":"It's okay."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":498.7,"end":568.9,"speaker":"Paul Vander Klay","text":"He's. He's a very caring individual, and that comes through. And how many of the times when he breaks down, when he talks about people coming up to him, expressing what, you know, what he's done for them? But it's a number of years ago when I got sick as a pastor of doing little series, which is sort of a Protestant way. And so I started just preaching through the Bible serially, which allows deep dives into books of the Bible. And one of the things that I came out with was this little phrase that I plagued my congregation with, which is the age of decay. Because that is the biblical sense of what we live in. We live in the age of decay. That isn't reality, but it's the age we live in. It's the governing paradigm we live within. And that's a deeply troubling thing for us that. That houses go, relationships go, things we build go. And so it's. And it comes to all of us. None of us. None of us get out of this world alive."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":572.5,"end":576.42,"speaker":"Jonathan Pageau","text":"Exactly. Exactly. So how about you? How. How are things? How's the."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":576.98,"end":577.78,"speaker":"Paul Vander Klay","text":"Your. Your."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":578.58,"end":612.23,"speaker":"Jonathan Pageau","text":"I keep. I keep being astounded at how many videos you're able to put up. And I, you know, and now what's great is I can actually watch the videos of the people that I know, which is intense. So I saw you talk to Sevilla, and then you talked to Jean Philippe, who's been part of my little inner group that we meet every month, and we talk for about an hour, just a small group of us, like the top patrons, and we have this little seminar going. And I was really happy that you talked to him because I really feel like he's very perceptive and very sharp. So that was good."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":613.35,"end":636.97,"speaker":"Paul Vander Klay","text":"He was so much fun to talk to. No, it's been. I mean, the last year and a half since I started the videos it's been crazy, but it's been terrific ministry. We just had a meetup last night. My throat's. I've been. I've had a whole bunch of meetups and stuff lately, so my throat's a little worn out, I guess. But we had. So Benjamin Boyce was in town, I think."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":636.97,"end":639.93,"speaker":"Jonathan Pageau","text":"Yeah, you told me that Benjamin came. How did that go?"}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":640.09,"end":711.18,"speaker":"Paul Vander Klay","text":"That went great. We had fun. We recorded some video yesterday afternoon, took him out for dinner with my wife. And so we got to meet my wife and then we had a meetup at church. Two meetups, two days in a row, just because of scheduling. And just, you know, it's so funny because we have these meetups and most of the people who come are atheists, but they. They're as surprised as I am that here they are sitting in church and, you know, God, they're not as dismissive of the whole thing anymore. They don't believe, but they're just kind of curious about the whole thing. And one atheist last night, it was after the meeting. So we have the regular meeting and then the after meeting and people kind of break ups and threes and fours and conversations continue. And he looked around, he says, you know, you. You're starting a new church here. I said, well, it's not really a church right now, but yeah, you got all these young men. And so it's been phenomenal. And the conversations, the individual conversations I've had with people, I kind of paused them for a few weeks because I've got vacation coming and I have to kind of catch up with some things."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":711.18,"end":712.7,"speaker":"Jonathan Pageau","text":"My goodness, I imagine."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":713.18,"end":778.4,"speaker":"Paul Vander Klay","text":"But it's. I don't want to stop them and I don't want to. I don't really want to regulate them in terms of me picking who I talk to because the individuals that find me and share their story with me, that's been transformative for me. This whole journey has been just phenomenal. So we've been starting new meetup groups, and when Jordan kind of hit his peak, a lot of meetup groups started. A lot of those have kind of fizzled. But mine, my group continues to grow, and it's growing now mostly with people inviting their friends to the meetup. And so now I've got some of my pastors in the Bay Area kind of pushing them to, you know, you should do this. And so we had another church that started a new one, and, you know, they had 20 people in their first night. And the pastor, you know, the pastor has some good skills. He's the right guy. For it. And I think this will go. So it's been great."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":779.2,"end":858.84,"speaker":"Jonathan Pageau","text":"Yeah. And. But at some point maybe that then the name of the meetups will have to evolve. It could be find some other. Because like you said, Jordan kind of. He kind of exploded now. He reached his peak then obviously for a while, at least until something else happens, it's going to. It's going to fade. I mean, maybe not. Who knows? Like, you keep thinking that he's reached the top of what he can, but he can keep going. But at some point, you know, it's got. Like you said, it's going to fade like a normal wave, like any wave. And so to keep the momentum going, I'm sure there are ways to rename and to rebrand the meetings because now this whole discussion that's going on, it's pretty. It's pretty interesting to see John Vervecki come in and you and myself. And then there's people like Sevilla, who's extremely intelligent and very perceptive. And so I'm seeing these people kind of pop up. And I'm thinking, you know, Benjamin Boyce is part of that as well. And there's other peripheral people that are probably worth kind of bringing in and getting into the discussion. But I think that fostering this type of discussion at this level. Yeah, that could be a good path for the future in terms of people continuing the discussion even as Jordan kind of, you know, moves on to something else or whatever it is that he decides to do. Yeah, it would be great for the discussion to continue."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":859.64,"end":878.21,"speaker":"Paul Vander Klay","text":"I've thought a lot about that. You know, what are we going to name these groups? And at this point, at least, still Jordan's name. Yeah. It brings people. It's weird. It brings people together with the right disposition to have a conversation."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":878.29,"end":878.85,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":879.33,"end":913.58,"speaker":"Paul Vander Klay","text":"And that's. And then like I said now in terms of my meet up here, most of the growth is from people inviting other people. And they come and they. And they're just. It was funny. We had a guy named Tim who's actually orthodox, and he's one of the guys who really wants to bring you to Sacramento one of these years with his church. And he says to me, after the last meeting up Sunday night, we had a little group that we decided that group was going to talk because it's split up into little groups and we're going to talk about Jordan Peterson. And he's like, I've been here four times and this is the first time we've talked about Jordan Peterson."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":915.98,"end":916.86,"speaker":"Jonathan Pageau","text":"That's hilarious."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":917.1,"end":988.1,"speaker":"Paul Vander Klay","text":"But people bring up Sort of whatever's on their mind. But it always has had the nexus of religion, meaning just a lot of people just coming to sort things out. It's a place that they feel welcome and free to pretty much ask anything and have it be. You know, worked on both. Seriously. But also, you know, respectfully. So it's. For me, I've always. You know, there's this place in the New Testament, and I think it was in Corinthians when the apostle Paul runs out this hall of tyrannus. And just a few verses, and basically you have the sense of the apostle Paul renting out this hall. And people come in from miles around to talk with him and discuss with him. And, you know, you have a sense of kind of a Mars Hill thing where people are debating the philosophies of the day. Not debating, but discussing in terms of their own personal lives. I've always dreamed to have that the church would be a place like that where people could come in and talk through their stuff."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":988.34,"end":990.86,"speaker":"Jonathan Pageau","text":"Yeah. Wow. There's your dream come true right there."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":990.86,"end":1007.62,"speaker":"Paul Vander Klay","text":"It is. It really is. And, you know, it's just crazy to me that, well, here's this, you know, Canadian psychologist who would make a. Have a fit about pronouns, and somewhere along the line that would start something like that. It's incredible."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":1008.26,"end":1132.78,"speaker":"Jonathan Pageau","text":"I'm probably One of the. Some of the heat that I'm getting is that I'm not doing anything in French because French is my first language. I do live in a French place. I live in Quebec. French is the language I live in, actually. And so I will probably. I'm thinking of this fall starting some kind of meetup of some kind. I've talked to some people around me that I've seen on social media that I know are from the area, and it seems like people are interested to do that. And so I've also been thinking, like, should I frame it during Peterson or frame it meaning crisis? I don't. I'm not sure. Like, I'm. So. I'm trying to think of it, but I probably start doing something in French, at least in the fall, because it is a bit. It's a bit. I have so many prejudices about Quebec, about where I live. It's horrible. Like, you know, I really have this idea. Like, it's horrible. What I'm gonna say is really horrible. But I really have this sense, like, it's totally lost, it's finished. You know, it's all over here. And, you know, so what's the point? You know, what's the point in even talking to people around me, which is so stupid. It really is an emotional, like a very emotional irrational thing that I've. That I developed. So I have to. I have to kind of reconcile myself. And it's interesting because this village where I'm staying, I mean, we stayed here because we had friends who were selling people we knew were selling their house. And we ended up being able to get the house for a while. And now I'm discovering that this village has this massive historical cultural importance and it's almost been forgotten by the French Canadians. There's right next door to my house, there's one of the most famous singers in Quebec who's like a very elderly man, but he was really important part of the developing kind of Quebec culture. And down the street there's a house of another poet, Felix Leclair, who is extremely known. And so now I'm learning that all these poets and artists lived around this village. And so I don't know, it's connecting me. I don't know how it's irrational, but it's kind of connecting me little bit to my roots and giving me more desire to do some things in French and to talk to French Francophone people."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":1135.02,"end":1179.21,"speaker":"Paul Vander Klay","text":"It's the providence of God. You know, I tell people, you know, people, Americans like to imagine that God is somehow this, you know, as CS Lewis said, this benevolent grandfather. It's like, oh no. God, when he wants to do something, he can play rough and he can flood your house. He can. I'm curious how much of this crisis that Jordan sort of, I mean, the man in the moment kind of found each other. How much of this is really tied to the English speaking world. And so for then, the French speaking world, how will this be different? I'm really curious."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":1179.61,"end":1246.1,"speaker":"Jonathan Pageau","text":"I'm really curious too because for sure there's something very English speaking about Jordan. This whole intellectual dark web thing, this whole Enlightenment, David Hume thinking it's just very English, this idea of the individual, the way that Jordan frames the individual. It's very, very English. And so I am also curious to see how it's going to. At least I don't know how this question is going to be asked in French circles. For sure. The people that have been coming to me now, just recently, I've had people kind of coming to me and now maybe I might even be going to France and doing some things in Europe. It's been mostly the symbolism part that they've been interested in and kind of recovering a coherent worldview and recovering a kind of Symbolic approach to life. So that's been. But the Jordan Peterson stuff, I don't, I didn't. I haven't met a lot of French speaking people who have been interested in it. So I don't know if it doesn't totally connect. There's something about it, I don't know, strange."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":1246.82,"end":1265.44,"speaker":"Paul Vander Klay","text":"There have been a fair number of Dutchmen. You know, when Jordan went to the Netherlands, he had a fairly good sized audience. But the Netherlands, I mean, they're such a small country and their English is so good that they, they seem to tend to follow the, you know, the English culture quite a bit."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":1265.6,"end":1303.29,"speaker":"Jonathan Pageau","text":"Yeah, I've had a lot of Swede, Swedes write me, a lot of people from Sweden. And so it seems like, yeah, in the northern parts for sure, Jordan is having an impact. So I don't know. Yeah, I mean, it's funny because in his 12 Rules for Life, he just didn't, he didn't come to Montreal. And I think, I think CAA did their homework. Like CA probably did their homework and they realized that it just wasn't the place. Like he wouldn't be able to draw the type of crowd that he can draw in Toronto and in other Canadian cities. That's what I think. Maybe not. I hope it's not secret French hostility."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":1305.53,"end":1311.21,"speaker":"Paul Vander Klay","text":"I know Montreal and I know Quebec and the rest of Canada have a very special."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":1311.21,"end":1312.25,"speaker":"Jonathan Pageau","text":"You have some disagreements."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":1312.25,"end":1316.12,"speaker":"Paul Vander Klay","text":"Yeah, but he lived for a while in Montreal."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":1316.52,"end":1328.36,"speaker":"Jonathan Pageau","text":"McGill is his. That's where. It's his alma mater. That's where he did his first degree. So he's attached to Montreal. So I was surprised why he didn't come to do the 12 rules for life, but I'll have to ask him one day."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":1329.72,"end":1334.04,"speaker":"Paul Vander Klay","text":"So where do you think this meaning crisis conversation is going, Jonathan?"}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":1334.76,"end":1491.74,"speaker":"Jonathan Pageau","text":"I really, I'm excited to see. I'm definitely excited to see. And it's really pushing me also to talk about things, frame them differently. And I'm realizing that's really interesting. And I think it's the same for you where certain questions that are perennial that you've been asking or that you've been talking about, but all of a sudden, because there's this discussion, you get the people of rebel wisdom and you have John Vervaeke and then you have other people talking about the more spiritual part of it, you could say, or the deeper questions, you have people like Ben Shapiro and Jordan who are having these discussions as well. So I think that it's forcing us to reframe the way we're talking about it. So that we can come to actually discuss. And so, you know, I always tell people, even the word consciousness, that's not. The church fathers don't use the word consciousness, but I think it's a perfectly appropriate word to use because we all know what it means when you use the word soul. No one knows what that word means anymore. It's ruined, you know, So I think that to me, the consciousness question is going to be the one think that's going to be the most interesting to kind of get to. And the problem of consciousness, the problem of how the relationship between consciousness and existing within a narrative, I think that's the key. That's the key that's going to unlock a lot of problems. And I hope that that's what. And that's the thing that John Vervaeke and I kind of. That's our little disagreement. I mean, it's not a disagreement, just we know that we're on two sides of that question and hopefully we'll have some chances to talk about it. There's a group in Ontario that want to invite both of us to do like a public thing. And so I think that'll be interesting and also to talk about, to present. To me, it's also been about rediscovering some aspects of the Christian faith that have been forgotten or lost. That's why I have chosen certain writers or certain saints to talk about in order to bring out the more cosmic aspect, the more the aspect which is related to transformation, to mystical experience, something akin to consciousness. Although, like I said, they don't use that word. I think that that's the key too. Saint Ephrem, St. Maximus, St. Gregory of Nyssa. There's some writers that have really. That really give us a perspective on these questions that we're having today. And they've been a little bit sidelined because people had other issues to other issues that were concerning them. But now it seems like it's right in there, you know, it's right in the frame."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":1493.18,"end":1568.64,"speaker":"Paul Vander Klay","text":"You know, I had a so much. I find so much fruitful. So many fruitful questions come from interactions with, quote, unquote, regular people. I had a woman in my Sunday school class ask me Sunday. She said, I just heard a preacher that said, forgiving yourself is not in the Bible. Because that's a big mantra right now in a lot of evangelical. Oh, you got to forgive yourself. You got to forgive yourself. And I thought about it, I thought, no, he's right. You don't find that in the Bible. And then I thought, part of the reason you don't find it in the Bible is that these subtle relationships we have with consciousness, with how we imagine the self. I mean, some of these things have continued to change and we don't notice the changes until something comes up and it's like, well, look at this. Oh, and I think you're right. The focus on consciousness might be a substitute for the meetup title for a Jordan Peterson thing, although that will bring fascinating other interested parties into the conversation."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":1568.64,"end":1584.47,"speaker":"Jonathan Pageau","text":"As you well know, a lot more psychedelic conversations. Like, who thought we would be having conversations about psychedelics? I mean, would you imagine like three years ago that you would be talking to people and that's what you would be talking about? To me, that was not part of it was not on my radar at all."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":1584.47,"end":1594.47,"speaker":"Paul Vander Klay","text":"No, that totally took me and it was. So many of the people I was talking to had been in that realm and it's like, how did I get here?"}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":1597.03,"end":1609.67,"speaker":"Jonathan Pageau","text":"And then when we started talking about it, the biggest surprise that I've had was meeting people in my church who said, oh, yeah, I converted after a psychedelic experience. I'm like, what? I didn't know. I had no idea that I had never heard that before."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":1610.32,"end":1611.64,"speaker":"Paul Vander Klay","text":"Well, they're not going to cough that up."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":1611.64,"end":1615.2,"speaker":"Jonathan Pageau","text":"And no, they're not going to say just like, just straight up. So."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":1617.28,"end":1660.14,"speaker":"Paul Vander Klay","text":"Oh, it's true. So I, you know, I agree. I've been. So, yeah, this, this whole thing has taken such interesting turns, and I think it will continue to take interesting turns. I think a piece of it is that what a lot of people knew towards the end of the 19th and beginning of the 20th century, that, that materialism is pretty much played out. These things take a long time to kind of filter through a culture. And I think we're getting to that point now that more and more people will look at someone like Sam Harris and the kinds of ideas he's promoting and just say."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":1664.14,"end":1755.99,"speaker":"Jonathan Pageau","text":"And it's interesting because we had a last, the new atheist wave was like this last caricature resurgence of that movement. You know, it was a lot shallower than, you know, someone like Nietzsche or the hardcore, you know, these kind of philosophical atheists that you find in the end of 19th century. So you have this kind of caricatural moment where everybody is somewhat seduced by it. You know, all these people, they went all the way, you know, all the way into that. At least Harris talks about consciousness and it's talking about a little bit about first person experience. But people like Dawkins, for example, completely oblivious to any of that ignores completely the fact that he's a person in space who has an experience that's not even. It's not. It's like. No, it's like he's abstracted himself from the world and thinks that he's looking at it through this objective scientific lens. And so I think that as that caricature comes to its reached, now its end, then it's an opportunity. Like, it ends up being a great opportunity because suddenly. And you see it, I'm sure you've seen it too. You see people, you see it in their eyes, that they've understood that secret. It's. It's almost like a magic thing that was just veiled in front of them. They couldn't see it. They just couldn't understand what was significant about that. And then all of a sudden it's like, oh, yeah, wait a minute, what do I do with consciousness? Like, if I. Even if I, Even if I try to encompass it back into the scientific system, then it."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":1755.99,"end":1756.35,"speaker":"Paul Vander Klay","text":"Whoa."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":1756.35,"end":1833.13,"speaker":"Jonathan Pageau","text":"Then it creates very strange things because it's like, okay, so I'm, you know, how does it. It can't just be this thing atop that we ignore, pretend that it's just. We take it for granted. All of a sudden it has to be dealt with. And so it's. That's been the most. That's been, to me, the most fascinating thing is to watch people understand that. And so then it's like, okay, now you have that. You've had that glimpse, you've had that awakening moment. Okay, now let's take you what step by step. I'm going to take you step by step and show you what that means. You know, what it means in terms of what a story is, what it means in terms of what a frame for reality is, what it means in terms of necessity, of hierarchy. All these things are going to. Going to come back in. And then I'm going to show you in the Christian story why things are the way they are. Like, why is it that we talk about things the way we do? Because that's the normal world. The normal world is the world in which the first thing that you encounter is this conscious experience of being. And then on top of that, you can add, you know, the rationalization, you can add this, this analytic mode. It's fine, but that's not the first. It's never the first thing."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":1834.57,"end":1886.53,"speaker":"Paul Vander Klay","text":"I think it will be interesting to see. I think there's a crisis in Protestantism that. And you see this in. In some ways in the renewed interest to the More sacramental liturgical traditions. You know, one of the things that I obviously can't miss is how many people coming out of the Jordan Peterson conversation are very interested in Orthodoxy. And I think Orthodoxy partly in America, because it's unlike their vast experience with Protestants, unlike some of the corruption and chaos that has been in the news in the Roman Catholic Church. Orthodoxy is sort of the new kid on the block, at least in this continent. They don't have their hands dirty. They haven't had any big scandals."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":1887.65,"end":1889.65,"speaker":"Jonathan Pageau","text":"We've had scandals, though. We've had scandals for sure."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":1889.65,"end":1890.61,"speaker":"Paul Vander Klay","text":"Yeah, but they're not known."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":1892.29,"end":1961.19,"speaker":"Jonathan Pageau","text":"That's true. But I think there's a little bit of the. I always kind of joke around and think that there is in Orthodoxy enough of the foreignness, because the foreignness is dangerous, but it's also an opportunity, right? It's dangerous because it can kind of. It can. It. You can project into it and know. And you see people do it. I see it. A lot of people do it with Buddhism, you know, it's like they just project whatever they want into Buddhism, and it's like it's everything that I want it to be. Just because you don't know about it, you don't really know what it is. You know, it's like actually look at Tantric Tibetan Buddhism and you might be surprised at what you find. But anyways, and so I think that Orthodoxy has enough of the foreign to. To attract the attention, to kind of titillate and, you know, kind of surprised, because we're. Other things are banal, you know, but it's Christian, you know, it's not. It's not. It can connect you back to your origin also through that fascination and through that kind of surprise. It hopefully can connect you back to the Western story, too. You know, so that's what. I get that sense a little bit. So I don't know. Tell me a bit more about how you've seen it."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":1962.04,"end":2205.92,"speaker":"Paul Vander Klay","text":"Well, I see this as a crisis. So I've been reading more about the Reformation lately and paying particular attention to these turns of consciousness. And so, you know, what happened a lot with Luther is this sacramental system that medieval Roman Catholicism had, you know, continued to work. There was so much corruption that on one hand, you know, that was. That was clearly a complaint against the Church, all the corruption that was happening, which the Church, which Protestantism forced the Church to have to address. But then also with Luther, there was this change in terms of the relationship between faith and consciousness. That faith became very much of a psychological reality, much More than an embedded reality in terms of materiality. And I mean, you see this with all of the different changes that happens with Protestantism. You know, really an individualism comes into play in Protestantism. And these things happen slowly because people don't just, you know, change overnight with this. And Luther, who's at the center of it, I mean, the chaos he unleashes surprises him because Karlstadt, who was right there with him, you know, goes off into the radical and it basically spawns the radical Reformation. And so chaos ensues. But you know, one of the things that I see now, I was having a conversation with other people in the Christian Reformed Church because obviously the same sex marriage debates are just running through Protestant denominations and they're having to wrestle with it. But one of the things I noted to actually a Canadian scholar in the Christian Reformed Church is that in some ways when Protestants basically say, using the Bible, the Bible as such is supposed to resolve any question that comes to the church. And what has happened with the questions about women's ordination, the questions about same sex marriage is that Protestants are basically, they've given up looking to the Bible to resolve these questions. Now however people feel about these questions in the Bible, I'm going to push that aside. What's interesting to note is that the Protestant vision was that here with the Bible we can answer any question and Protestants are giving up on that. And so then you have to ask, well, what of Protestantism? And they're kind of in this point where it doesn't seem they can go back to Catholicism. And so, okay, if the Bible can't resolve this with respect to the community, where do we go? And so I think we see a continued crisis within Protestantism. And I think the, I mean, if in the Reformation we saw a turning from an embedded sacramental vision of a universe made whole that the sacramental system was supposed to embody into a much more psychological phase. Just like we're seeing the end of materialism, we're seeing the end of that merely psychological for Protestantism. And so in this new phase, which I think is going to attempt to re embed consciousness and materiality in one coherent picture that's, you know, Protestantism has been an effect of this division. And so then what do Protestants do? And I think that's, that's a completely unanswerable question at this point."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":2206.08,"end":2403.52,"speaker":"Jonathan Pageau","text":"Right? Yeah. What's the, what's the solution? And I think that the, I mean, it's interesting because in terms of the Bible, I've been thinking about this for quite a while. Because when I was young, I. I was in a very conservative, you know, Protestant denomination. I was a kind of conservative Baptist. And. And it was all the Bible, like you said, it was like the Bible, the Bible. And I. And I had no notion of liberal Protestants. Like, I had no idea. Like, I never. But then when I finally discovered this whole Episcopalian kind of direction, I realized. So Protestants both, let's say, affirm the Bible as the word of God, that kind of language. And then they're also the ones who destroyed the Bible. They did both. And there's something about doing one which leads to the other. I think I was having this discussion with a. Even with a Protestant Reformed pastor a while ago, where he kept saying, the Word of God, the Word of God. And I was like, the Word of God is Christ. And I was like, I tried to get rid of. To get back to that. And it's like. Because if the Word of God is. Or at least if you. If you have this idea that when you say Word of God in terms of the Bible, it's somehow equivalent to when you're saying the divine Logos, like in that sense, then that's going to break apart. Because the Bible itself is a. It's a garment. It's a garment of skin. It's an outer covering. And so because of it, it's a material thing. Like, it's a series of words and letters and phrases. And because of it, it can be broken apart. It has to be held by something above it. It has to be held by the Holy Spirit. You know, it has to be held by the unity of the Church, it has to be held by the unity of the faithful in the spirit of God, or else it's going to start to fragment, it's going to start to be poked at. And even in the very desire to prove its validity in a kind of materialist way, you're going to destroy it. It seems like that's what happened where all these scholars and scientists who wanted to prove that the Bible was this and that and this started to scratch at it, the details of it, finding these little loopholes and holes. And, oh, this text isn't like this old manuscript isn't like this one. And, oh, there's differences between the manuscripts and, oh, wait a minute, you know, this whole section we don't have in this manuscript. All of a sudden it's like, oh, and finally you end up with a Bible that has all these little different color, you know, like little paraphrases and little notes, like this text is not in so many manuscripts and stuff. It's like, that's not a Bible. That's a. You can't at least don't use those Bibles in your church, because that'll destroy your church to have a Bible that has all these notes in them anyways. So it's an interesting. And I think that ultimately it's not like it's not the sacramental system. Right? It's not the sacramental system. It's more seeing the unity of the Church and the Holy Spirit as being the first. The first place where God encounters the person. Right. Pentecost is. Pentecost comes before the Bible."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":2403.52,"end":2403.76,"speaker":"Paul Vander Klay","text":"Right."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":2403.76,"end":2484.43,"speaker":"Jonathan Pageau","text":"Pentecost precedes the Bible. And we tend to see it in terms of systems, like in terms of bishops and whatever, and like you said, like different sacraments. But at least in the Orthodox tradition, we tend to talk about sacramentality in general, not so much. Not that the sacraments are important. Of course they're important, but. But there's a kind of a joke that people talk about where when the Eastern fathers encountered the Latins for the Council of Florence, I think it's in the 1400s, the Catholics asked the Orthodox how many sacraments there are, and the Orthodox were like, what do you mean, how many sacraments there are? And they're like, there's seven sacraments. They're like, what do you mean there's seven? They didn't understand the question. It was like sacramentality is just a whole process of. Of how we exist in the world and how our existence in the Holy Spirit transforms reality and how it transforms things. And so it's as much the prayers, it's as much the, you know, like, it's the object in terms of the icons and the prayer and the Church and all that. But then it's also the manner in which we live together, like that we exist together as a communion of saints. So it's a bigger thing, you know, it's like, it's a bigger thing than the system of sacramentality. I don't know if that makes sense."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":2484.51,"end":2485.67,"speaker":"Paul Vander Klay","text":"Oh, that makes perfect sense."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":2485.67,"end":2485.99,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":2485.99,"end":2646.26,"speaker":"Paul Vander Klay","text":"Well, and Protestants have always had this propensity to divinize the Scriptures and kind of, you know, so you have the Father, Son and Holy Scriptures as your Trinity instead of. Well, this is what. I mean, this is what's happened in Protestantism again and again. And I think part of it was in the west, in a sense. So quite clearly, in the Reformation, Scripture replaces the seven sacraments, and the Bible itself becomes the only sacrament. And you see that in both what happens to baptism, which right away you have a big fight over baptism, because the understanding of what baptism is and how it functions divides in the Protestant Church. And then with the Eucharist, in a similar way, it splits. And so you have Calvin with his real presence, who's trying to maintain some sense of sacrament. And you have the Zwinglian tradition that says, well, it's sort of a symbol, it's a sign, but nothing really happens. And so, again, you see that it's just bound up with these deep assumptions that theological language attempts to express and philosophical language attempts to explain. But then the way the Bible then gets handled. One of the things that I noted when I was in seminary, even in the 80s, was that for a long time in the west, the church wanted to make theology a science. Okay? A science in the new sense of the term science, not science. Yeah, yeah, right, A science. And then the Bible then was just like, for a chemist, chemicals would be the thing that the chemist works on. For a theologian, the Bible is the thing that we take apart. And all of this had its, you know, a lot of it had its beginnings in Erasmus. When Erasmus of Rotterdam comes and looks at the Vulgate, looks at Jerome's Vulgate and begins to some, you know, more and more Greek texts are around. And so he begins to look at. So, well, why is this. And there's this whole movement that's saying, no, the Holy Spirit inspired Jerome to write the Vulgate as such. And see, right there you have the beginning of this thing."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":2646.74,"end":2651.94,"speaker":"Jonathan Pageau","text":"I remember people telling me that the King James Version is inspired, like it's inspired by God."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":2652.02,"end":2766.72,"speaker":"Paul Vander Klay","text":"Well, that's exactly right. And so you see this happen again and again in the West. They're approaching the Bible now. I think what's going to be interesting is, you know, so when John Vervaeke and I spoke, we had a conversation last week, you know what? So when I listened. So it was very interesting listening to Syvilla because she's talking about Vervaeke and you. And I'm kind of watching this and saying, wow, she's seen some things and she's seen some things between the two of you and I, this question of return. And I, you know, when I think about what's next, I don't see. I don't know where Protestants have, in some ways, ever since the Reformation, been to work off your current situation. They've, in a sense, been homeless in some ways. And so they've been kept trying to establish homes and they're going to build their own homes. In typical Protestant fashion. Nobody else got this right except us in our little group. So I don't know what this new turning that we're seeing now will mean for Protestants. If, you know, clearly many are going back to. You know. But in some senses, I had one colleague say to me, you know, if the east and Rome ever make up, I'm in. And so, in a sense, the Great Schism then comes into play in that I don't know if I can go back to Rome or the east because they can't get their act together."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":2767.04,"end":2984.71,"speaker":"Jonathan Pageau","text":"Yeah, for sure. That is definitely. I don't see it, to be honest, in the eschaton. But I want to come back to the sacramentality question. My question to you is, let's say now with this kind of new perspective on consciousness and on patterns, let's say on patterning and how it's inevitable that there's patterning in our human engagement, patterning in the way we frame the world, frame our narratives, all of that. If I would say something like that, there's a hint of sacramentality in a handshake, could you see that that could then be in a hierarchy of sacramentality, which would lead to communion, which would lead to the Eucharist as, let's say, the anchor of the world, something like that, or the anchor of the Church. But then that also. Then filters down, and it helps us also then to understand how we are constantly engaging in symbolic. In the sense of condensing in symbolic actions amongst each other. But then also when we frame our own story, our own narrative, we're acting in this kind of symbolic way. And all of that has a ultimately sacramental process. You know, we were talking about. This is something that someone asked me in a Q and A once at an event, actually, and I. It really struck me when I. When they said it, because it just. I knew it. It's one of those things where it was formatted in the right way. When they said, if you do like Christ says, which is if you see the good in the other and you. You always looking for the good in the other, and you're always looking for Christ in the person in front of you, won't that then transform reality for you, won't that actually make. If you participate in that and you let yourself go and you actually don't look at people's faults, those faults in a certain manner will be diminished. They'll be lower in the hierarchy of attention, you could say. And in the hierarchy of attention, as you're engaging with others, the world will actually become more. More glorious. It will fill up with light. And you see that because you see people who, everything they look at, they always look at the negative. They always see the negative thing, no matter what it is, because it's always there. It's inevitably there. It just depends on how you structure it in that kind of hierarchy of attention. So to me, explaining it that way to me is a way to say this is what sacramentality is about. It's about that. But then it also does include baptism, marriage, all these gestures that we pose, because they're the most condensed version. If you take baptism, for example, it's like, that's the story. This is it. This is the go down into the water, go down and get the spark. You go down to the water, you leave your dead garments and you come out vested in Christ. And so it's like, that's it. Doing that actually is a transformative thing. It's not just a, it's not some woo woo magic. It's like it actually, that's how the world works, you know, through those types of gestures. It's just this one is so condensed and symbolic. But every time you, like I said, like every time you shake someone's hand or you say hello or you do that, you're participating in the same process."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":2984.95,"end":2993.36,"speaker":"Paul Vander Klay","text":"Right, right. Actually, the conversation I had with, with Ben. Benjamin Boyce yesterday very much touched on. He has the recording, so I don't know what will come out."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":2993.36,"end":2993.8,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":2993.8,"end":3205.19,"speaker":"Paul Vander Klay","text":"But we, this is exactly where we went. Because he, you know, he's, he's, he's working on his own journey. And so he picks at you and me and Vervaeke at that end of it, as opposed to the two other themes that he works on in his channel. And you know, he asked, well, you know, where, where can we. So when I listen to people like Benjamin and many, many other people I talk to, it's. They always focus on, well, where can I find this experience? And what they're sort of saying is that they're imagining that this experience is going to be something akin to, again, a psychedelic trip. And that somehow in this special, in this special experience, that's somehow where I will meet God. And so I gave him the Isaiah passage where Isaiah is in the temple and the seraphim are there. And they cry out, holy, holy, holy is the Lord God Almighty. The whole earth is full of his glory. And I said, you will encounter God. You walk into Yosemite Valley and everyone's like, well, there's his glory. And I said, you know, even after a meetup, we finish our two hours and then we take our little picture and I do that to kind of break the group out of the table and then they all break down. And I stand in the church and I watch clusters of two, three or four people having clearly meaningful conversation. I say, well, I see His Glory there. And in fact this, I think I love the way you phrased it because it is sacramentality. We see him all over the place. And it's in a hand shaped, it's in the child, it's in my encounters with the homeless. It's not a separate. Here I'm going to go into a trance or take a psychedelic drug and oh, in this special little place, that's where I see God. Because he's not everywhere else. No, he is. And this is where I get you mentioned we should talk about God 1 and God 2. God 1 is the whole earth is full of his glory. There's you, you, you keep bumping into him. Not just when you're, you know, when chemicals are rushing, illuminating your brain and you're in some ecstatic state, you bump into him with the embrace of your wife with, you know, and even that I'm elevating it too far with sitting down for a, for a meal and you know, all throughout. And so this is part of what I think is, I think this is a function of the question of consciousness and materiality and that we have taken, we have said, well, spirituality is this unique set of things over here. And no, not just when you're on a psychedelic or not just when you're in a service and sort of flushed with the majesty and the beauty or if you're Pentecostal, when the Holy Spirit descends on you, not just those places, but that then triggers people in terms of the pantheist conversation because when they hear that, then they say, well, God is everything. And no, that's not it either. And well, why can't you just tell me?"}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":3205.19,"end":3314.7,"speaker":"Jonathan Pageau","text":"Well, I don't know, like you said, the idea that the earth is full of his glory, I think that that's it, like that's the way to see it. That the glory of God fills, upholds, is the secret behind everything. You know, it's the thing that's hidden in the world. And if you, with the right eye, you can encounter it, you know, And I think that there are, you know, if you read the, there is the possibility of a deeper transformation. You see it. I mean, if you read the lives of the Saints, you do have this idea of a kind of illumination, that they are transformed, that their life is transformed, that they participate in God's nature, that it is a kind of ecstasy, a kind of, you know, a kind of rapture. But that doesn't just come to you like. It's not an experience that you go somewhere to get. It's something that you encounter through a life of prayer, of contrition, of confession, of all these loving your neighbor and living in the life of God. Then you approach those moments. If something like that is just given to you, I think that it, you know, there's something counterfeit about it. There's something dangerously counterfeit about it. And, you know, the church fathers and modern fathers, they warn us about kind of pseudo spirituality, you know, this simplistic experiential spirituality that you can. That you just have these experiences. And, you know, if an experience doesn't transform you, doesn't make you love your neighbor more, it's pretty useless. I mean, it might be fun, you know, but that's not the point, right? There's something. It's supposed to transform you."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":3316.78,"end":3457.37,"speaker":"Paul Vander Klay","text":"Well, and I think what happens with a saint is, if a Protestant may use that word, the point of Protestantism. Right, but the point of Protestantism is that we all. Sainthood is not for a special class of people over there. Sainthood is God's desire for all of us. And I'm sure you've had this experience too. When you meet someone who has, at least in your estimation and in your experience, achieved a degree of sainthood, you begin to notice that for them the world is much more. The world is very alive, and the world is very alive with God. And it isn't just with these separate experiences. I think actually the. The drive to locate God only with certain kinds of elevated experiences or flow states or however we might want to say. It is part of this instrumentality that I think is at the heart of the meaning crisis. Owen Barfield, who's a very interesting guy, wrote about this quite a bit in the middle of the 20th century. And one of the points that he made was the degree to which we explain is exactly the degree to which we lose meaning. And I think what's the key thing in that is in a sense, our instrumentality. Because the desire that we have for mastery of nature is directly related to our ego, if that's the right term, or our consciousness desire to, I think, live idolatrously, which means that we are going to turn the entire world into our slave so that we can Secure for ourselves, the outcomes, the experiences, the, the patterns we wish instead of actually receiving the patterns, God's patterns. It's the heart of the rebellion in the garden."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":3457.37,"end":3574.09,"speaker":"Jonathan Pageau","text":"Yeah, for sure. Yeah. And I think that that's, you know, the whole self help culture, all of that stuff is exactly what you're saying. And a lot of modern, this kind of California Buddhism is that as well. There's this like, I'm going to meditate, I'm going to do these, these different things. It's like, it's just like a technique. I'm going to do it so that, you know, so that I have, I have more energy, I have, you know, I feel better, I'm happier, whatever. And so there is this kind of instrumentality, like you said. And I think that that's maybe, you know, that's interesting because that is something that I think when we talk about the problem with the meaning crisis. And it was interesting because I kept seeing that that's what Bishop Barron was trying to talked to Jordan Peterson about. But Jordan just wasn't, it just wasn't on his horizon. He kept trying to bring it back to worship. He was saying it's worship. That's the key. Key is it's what do you celebrate? That's how it starts. It's like, what are the things that we celebrate? And that comes way before all the other questions of like you said, this, this idea of I'm going to use this technique or this technique to achieve this goal in my life or whatever. The first question is what we celebrate. And that's something that I thought that the fact that he kept wanting to bring it back is like, it's about worship. It's about worship. It's so hard for people to understand that the attitude of gratitude and the attitude of celebration, of worship, that's the first ground to reality. And that's the only way that you don't make God instrument, you don't make God into something that you're going to use to get what you want is true worship and true, you know, like recognize your place, like know where you are and elevate. Celebrate that which is beyond you."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":3574.89,"end":3655.61,"speaker":"Paul Vander Klay","text":"I think the difficulty that Jordan and almost everyone I talk to has when we, when we try to lay this out as we usually do, what people hear is, okay, well this means that if your orientation is instrumental, all you see are tools. And this is deep in what Jordan, I think articulates very well in that, that which is in us. We are looking out at the world with a perspective and that Perspective shapes the world that we see. And so if we see ourselves as consumers, if we see ourselves as masters of the world, everything we see is a tool. And then when you come to someone and say, well, right, worship, what they hear is the church as a tool by which I can find meaning in my life, find happiness in my life. And so they go to church as a tool and thinking about the church as a tool now, the church is going to provide these kinds of things for me. And then they go into church with that attitude and, well, it doesn't work."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":3655.61,"end":3657.85,"speaker":"Jonathan Pageau","text":"Because it doesn't work. Exactly."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":3658.17,"end":3667.66,"speaker":"Paul Vander Klay","text":"And that's. Exactly. So if you talk to people who have, you know, given up on the whole thing, well, they will tell you again and again it didn't work."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":3667.82,"end":3668.22,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":3668.86,"end":3718.56,"speaker":"Paul Vander Klay","text":"Whereas when I listened to you and Bishop Barron and how I know you to be, you don't go to church because, well, I've, you know, gosh, you know, my house just got flooded. Maybe, you know, maybe I wasn't praying hard enough to keep the flood waters apart. And so now I'm going to go to church to. To give, you know, to get my blessing. And in a sense, because of this consumer, and it's way even before the consumer, this instrumental approach, because it's the heart of idolatry, that they can't help but turn church into an idol. Whereas in a sense, you don't go. You certainly go to worship, to have yourself reoriented by God."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":3718.72,"end":3720.56,"speaker":"Jonathan Pageau","text":"Yeah, that's a good way to say it."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":3720.64,"end":3730.88,"speaker":"Paul Vander Klay","text":"Right. You don't go to church in order to, well, shoot, I better go to church because my wife needs straightening out and my kids need this and I need more money. I mean, you don't do that."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":3731.28,"end":3732.2,"speaker":"Jonathan Pageau","text":"I'm sure I do."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":3732.2,"end":3734.56,"speaker":"Paul Vander Klay","text":"Sometimes there's a part of us in there."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":3736.16,"end":3815.92,"speaker":"Jonathan Pageau","text":"There's sometimes where it's like, yeah, because the thing is, the thing that happens is that the lower aspects that you mentioned, this idea of finding some kind of stability, finding some kind of relief, even in terms of. In terms of confession or finding legitimacy or finding. There's all these things that actually you do end up getting. But like you said, it's that. But you'll only get them if you don't look for them. If you don't look for that. And that's true about so many things in life, right? It's true about so many things. Like, it's like if you go into a friendship only thinking about what it's going to give you, then you're going to get a lot less out of that friendship than if you go into a friendship with a kind of open desire to connect with someone and to have a communion with a human person, then the gratitude, say, the lower aspects, you're actually going to get way more. And Christ always says that all the time. He's like, don't worry about the things of this world. If you don't. If you, if you focus on God, if you celebrate the. Celebrate God, if you live in the kingdom of God, then you'll get those things. Don't worry, they'll be there. Like, that's not the point. That's not the point of life."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":3816.8,"end":3851.78,"speaker":"Paul Vander Klay","text":"Well, and I think what happens in the enlightenment is we're so impressed with our success at being intentional scientific consumers that we have been able to achieve electricity levies, flood insurance, air conditioning. We have been so impressed by this. But Jesus says, if you gain the whole world but lose your psyche. I mean, I think what Jesus is saying right there is basically, he's saying, here's the meaning crisis for you. You've made an exchange."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":3852.02,"end":3853.86,"speaker":"Jonathan Pageau","text":"Yeah, exactly. You are living."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":3854.28,"end":3863.96,"speaker":"Paul Vander Klay","text":"You are living comfortable consumer lives with air conditioning and all of these things, but you've lost your soul."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":3864.04,"end":3894.53,"speaker":"Jonathan Pageau","text":"Yeah. And it's fascinating to hear people wonder. And you hear people, it's like, how is it, why is it that we have all these great material things, but our society, you know, the social fabric is eroding. I don't understand. It's like, wait a minute, didn't Jesus tell you? I mean, hasn't it just been one of the presuppositions about the basis of Western civilization, that if we focus ourselves on those, you know, those smaller things, then. Then we'll lose the higher one. You know, it's like you, you have to orient yourself properly."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":3895.01,"end":3958.27,"speaker":"Paul Vander Klay","text":"Well, and I think for, for both of us, we had experiences earlier in our life of going and living with very poor, in very poor communities. And one of the things that would happen is North Americans would come to the Dominican Republic and they would meet the Haitians and the Dominicans sort of like, you know, touring, going on safari with, you know, we're going to experience some Haitians. And one of the things that the Americans come through and say, they're so happy now, first of all, they, you know, they're polite and they're hospitable. So they're not gonna, oh, here's a stranger. Let me tell you about all the troubles I have in life. No, they're people with social skills, so they don't do that. But I think that Experience that North America, wealthy North Americans have of oh, they're so happy is how can a person be happy living in desperate poverty with none of the material success, comfort or security that we prioritize so highly? How can they live without that and actually live normal human lives?"}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":3958.43,"end":4133.37,"speaker":"Jonathan Pageau","text":"Yeah, no, I agree. I agree. I wanted to look because we wanted to talk about God 1 and God 2. So I want to try to get to that before we kind of run out of. Run out of breath. So maybe. Because I think that maybe I'm over interpreting your God one and God two. Because to me, like the way that I see it is that they're the same. Like to me they're. And I think you think they're the same too. But I think that maybe to me, I don't see them as being opposed or as being. Being distinct. To me, one flows out of the other in the sense that when you talk about God number two flows out of God number one. Right. And you could say it's something like the manner in which the infinite encounters the particular. Right. Is going to necessarily look like will. It will be will. There is no other way for the infinite to encounter the particular. And so that's going to. And it's going to be adjusted. It's going to be an answer to a specific. It's not going to just be the infinite. Right. It's going to be an encounter. And therefore it's going to be an answer to a prayer. It's going to be a. It's going to be something which seems to shift things in a way that, that you might not understand. It's going to be something that's going to open up things, provide opportunities. All of that is going to happen. It's going to be. It's going to look like Will because that's the. Like I said, it's only because we think. We don't consider the idea of being or consciousness. We don't consider it. We think that it's not that it's not part of somehow not part of the universe, that we. That it's. Or it's some. It's some epiphenomena, despite the fact that it's by that that we actually understand everything. But as soon as consciousness comes back in, you could say it's the same about even you, right? That you have, you have a. Your person is somehow your soul or your spirit or whatever. You don't totally have access to it. It's actually something which is, which is higher than your usual consciousness self. That is something that is. That is kind of above there. And then that will come down and express itself in specific wills, specific, specific desires. And sometimes those can be. Can be not in communion with each other. Right. They can actually be in conflict with each other because you're not united. But if you can imagine an infinite and the infinite God, then those wouldn't be in. In conflict. They would actually be united, and that would be God's will, and it would be God answering prayer."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":4133.69,"end":4134.25,"speaker":"Paul Vander Klay","text":"All of that."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":4134.25,"end":4151.93,"speaker":"Jonathan Pageau","text":"All of that, to me just. It just makes sense. It could be. It could even be miracles. It can be all this stuff that we talk about, God number two, God acting in history, to me, flows out of the God number one that you talk about. So I don't know. I don't know if that's something. It's the way you think about it or that makes sense to you."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":4152.09,"end":4153.77,"speaker":"Paul Vander Klay","text":"I agree with everything you just said."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":4154.18,"end":4154.58,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":4156.34,"end":4192.09,"speaker":"Paul Vander Klay","text":"I came up with this because I was watching. I probably watched that thing 20 times. The exchange between Peterson and Sam Harris in the first Vancouver debate. Because the night is wearing on and they haven't really gotten to the God question in Sam's mind. Jordan's been talking about it the whole time. Jordan knows what he's doing in that conversation. He. He's putting together an argument and he keeps trying to build something, and Sam is sort of keeps kicking it over with all of the usual tropes that Sam brings to these debates."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":4192.09,"end":4192.57,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":4192.65,"end":4336.57,"speaker":"Paul Vander Klay","text":"And so they get to the end of it and they're like, well, we haven't talked about God. And I'm thinking, you've been talking about God the whole time. And so Sam says to Jordan, tell me what you mean by God. And Jordan sits down and begins to talk, to lay out all the ways in which this impersonal filter and the assumptions that we have which are necessary to function psychologically, to break down a world which is far too large for our little brains to hold together and the ramifications of that for daily life. So Peterson has this. He sits down with his computer, he opens it up, says, I'm going to read these because they're so complicated. And he starts reading through them. And Sam then interrupts him and says, no, no, no, no, no, that's not God, and that's not what God means. And I'm thinking, well, Sam doesn't know any history and he doesn't know any theology, and he doesn't have any understanding of holy, holy, holy, and the whole world is full of his glory. And so what? And that I think is helpful because so in the west, and Bishop Barron and Peterson talked about this too, that God sort of gets fragmented, especially in the Protestant Reformation, and kind of blows apart. And part of this blowing apart, I was trying to articulate with God number one and God number two in Christianity. They're obviously together now. You actually see towards the end of that conversation that Peterson goes to God number two when he has his sitting at the edge of his bed and going, you know, asking this moment of repentance that he lays out for Sam Harris. But this is, in a sense what happens in the west is when God number one and God number two kind of get pulled apart. And this happens in providential deism where we say, well, nature is. And even when we use this word nature, nature is this thing that's separated from God. And there are. This gets so complicated, but especially because."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":4336.57,"end":4347.01,"speaker":"Jonathan Pageau","text":"The word nature completely flipped around. Like the way we use the word nature today is the opposite of the way that it was used traditionally. It's hilarious."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":4347.97,"end":4355.82,"speaker":"Paul Vander Klay","text":"And so nature. So that's another thing I began paying attention to. Every time someone says nature, I think, what do they mean by that word?"}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":4356.06,"end":4356.46,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":4356.46,"end":4365.18,"speaker":"Paul Vander Klay","text":"And what they mean by that word is something without consciousness or intentionality. Something mechanistic."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":4365.18,"end":4366.3,"speaker":"Jonathan Pageau","text":"Yeah, yeah, there you go."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":4366.54,"end":4437.07,"speaker":"Paul Vander Klay","text":"That has. That is what nature. Someone dies of natural causes as opposed to a murder. No conscious agent willfully interfered with what we imagined to be a mechanistic playing out of the world where there is. And only when you have that kind of view, then suddenly you can split God up and send him away. But what Jordan in a sense does with his God number one is he says, okay, let's give Darwin his due and say we don't need a God to make the world. But in a sense, what Jordan is saying, and I think in a deep way is you can't have psychology without God. Well, what kind of God? Well, this. This God number one. But you're exactly right in that once you. And I think this is why we see people who. And it's not conscious for them, but people are listening to Jordan and Jordan is smuggling God into the conversation. And that is leading people to God number two."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":4437.99,"end":4500.66,"speaker":"Jonathan Pageau","text":"Because yeah, I remember that moment in one of the Sam errors talks where Jordan mentions this idea. He said, if you ask, you know, if you ask something, you'll get an answer. And Sam says, yeah, I've done that. It works. And it's like. But that's not God. It's like, what? Where am I? Like what world? Where am I like? You Ask and there's an answer and therefore there's a will, there's a, there's a. Something presents itself to you as a, as a formed response. You participate in that just like you participate in your relationship, you know, with the infinite. Obviously it's going to manifest itself in a way that is appropriate to your, to your frame. That's the whole idea. And so I was like, I just thought that was the strangest moment when he said, basically it's like Samir is saying that he prays, he gets answers, but he doesn't like God. It's like, okay, let's just find another word if that's all that's bothering you. It's just the word that's bothering you. Let's just get rid of the word. Maybe."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":4500.98,"end":4597.5,"speaker":"Paul Vander Klay","text":"But that is the heart of our rebellion. That is in a sense Adam and Eve saying Satan suggests, well, God doesn't have your best interest at heart. What that's saying is God isn't love and doesn't love you. And therefore when I listen to people and I think what really is at heart of the motivation to banish God from the world, even the psalmist, no ancient person would say there is no God, because that was just silly. What they say is God is absent, doesn't see, doesn't care, won't hold me accountable. That's what the fool says. The fool, the psalmist says, says in his heart. And so what I find when I listen to it, and this even comes to the complaint about Calvinism, which I hear often because I say I'm a Calvinist, which is what gives God the right to make decisions about me. And I hear that and I think that's just nuts because tell me how you are. The house, most of you is the product of your choices. It's so naive. You didn't choose when you were born, to whom you were born, you didn't choose the genetic makeup you have. You didn't most of your life you don't choose but to say, well, God somehow thinks he has the right to make decisions about my life. It's like, well, you know, that's kind."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":4597.5,"end":4699.57,"speaker":"Jonathan Pageau","text":"Of because you think that God is a guy that's like you, you know, what is that horrible song like that God's coming back home on the bus or something like these horrible ideas about, about God as just as a. And it really comes with this whole, this, this whole weird multidimensional idea, you know, this whole idea of this horrible idea, Alex Jones types idea where this idea that the spiritual world is like another world. Like, it's like another dimension. And God is like, in another dimension. It's like as if God is a being and people have lost the whole idea of principality, the whole idea of hierarchies, of beings. It's all gone. It's all level, you know, and so they don't imagine angels as principalities. They imagine angels as just beings that are there in space, but you can't see them. And, you know, maybe you could see them and then they could. They could chat with you. It's like that drives me. That drives me insane. And so I think that when I hear people talk about God that way, I keep thinking. I keep getting angry because it's exactly. It's like you're taking the lowest version of God that, like, you know, the most uneducated person believed in. And you're. You're arguing against that. It's like, I don't know. I don't know who you're arguing against. I mean, at least it's not me. At least it's not any of the church fathers or any of the. Of the classical theists. It's Jerry Falwell or. I mean, that's horrible. I shouldn't say that. Let's bleep that out. Anyway. Some, you know, some is just like, kind of. Anyways."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":4699.89,"end":4915.29,"speaker":"Paul Vander Klay","text":"Well, but. But so. So when I was talking to Benjamin Boyce yesterday, I was saying, if you look at the Ten Commandments and you look at the commandment God gives, which when you. This commandment alone should make people stop and say, there is something special about the Bible and this whole thing, you know, Judaism, that leads to Christianity. Because when God commands, you may not make an image of me from anything that I have created. What that commandment says is, you cannot reduce me to anything that you can represent with your mind. Now, this puts us in a problem because in order to relate to God, we need representations. And Jesus comes along and says, Father. And I thought when Nathan Jacobs had a conversation with Hank Hanegraaff, I thought Nathan Jacobs laid that out well in terms of how the fathers talked about Father, Son and that relationality. In other words, we need representations in order to relate. And so Jesus gives us one. Here's Father. But every such representation comes with its. Comes with its vulnerabilities and liabilities. But right at the beginning, God says, do not represent me with a calf, with a big statue of a man, with any graven image. Because once you do that, you set up exactly what you just described and exactly what we've done. And so what happens when, in a sense, God number one gets banished by Darwin, what Christians begin to do? Because, oh gosh, there was way too much sunk cost in Christianity. God number two, this relational. What if God were one of us? This relational imagination, this relational representation gets expanded to fill the void. And you see this in a book, let's say, like Chuck Colson's Born Again, where here's a guy all his life going to the Episcopal Church, comes home after meeting with a Born again Evangelical and says, I'm a Christian. And his wife says, why have we been going to this Episcopal Church forever? I mean, what was that about? No, I know Jesus. I have a personal relationship with Jesus. And so it's, in a sense, God number two expands to make up for the God number one that Nietzsche declares has been killed. And so, you know, obviously I don't believe that there is this division in God, but in terms of our representations of God, this, I think, is something that has happened in the West. And this helps us understand why Jordan Peterson lays this stuff out. Sam Harris says, oh no, that's not God. Who would complain about masturbation or what you do with your body. And then they go into this interesting conversation where Jordan basically says, and I'm thinking about doing a video on this. Jordan acts as if God number two is real. And, and the reason, I think you laid out exactly why that can't be helped. It is the only way we can actually give God right praise. So that's for me, why the language of God number one and God number two, I think was helpful for explaining some of what has been happening in."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":4917.29,"end":4999.34,"speaker":"Jonathan Pageau","text":"Where these discussions aren't connecting. Like, right where they're not. And I think you're right and I totally agree. And I think that, you know, because of the, because of people like Sam Harris and the preponderance of, let's say, evangelical discourse in North America, I think that in a way that's probably why also that I've talked more about your, like, the transcendent, you know, the infinite aspect of God and this kind of, you know, this idea that, like, the earth is full of his glory, that type of representation. But I also think it's absolutely inevitable that that will then become will. Like it will become will and will become all these things that you kind of associate with God number two. This idea that God can reveal something to you that you can have, you know, that God can help you, can redirect you, that God can. All this stuff is, to me is just, is an inevitable consequence of God number one, but also inevitable consequence of re. Understanding the world through consciousness. Re Understanding the world through the supremacy of consciousness. Like the fact that the filter, all of that is. Is inevitable."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":5000.22,"end":5039.89,"speaker":"Paul Vander Klay","text":"And this is exactly what we've seen happening. And this is exactly why the celebrity atheists are just completely wrong about what happens when people give up their organized religion. And I always use this commercial that was on a few years ago from. I call her Verizon Lisa, because it's this Verizon commercial where this woman walks in front of a Verizon store and the universe told me, lisa, you need a new smartphone. And by the way, your hair looks good today. And this is exactly what happens with people. They say, I can't believe in God. And so now they're not going to use God, but they're going to use Universe."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":5039.89,"end":5069.77,"speaker":"Jonathan Pageau","text":"Universe. I know. That is the most hilarious thing. It's like the universe spoke to me. It's like, dude, the universe doesn't speak. Things that speak, we call them beings, we give them names. We don't use object description for things that speak. That just doesn't make any sense. It's like my hat spoke to me. Like, your hat doesn't speak. The universe doesn't speak. But people. People. I mean, and that's hilarious."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":5069.85,"end":5113.08,"speaker":"Paul Vander Klay","text":"Yeah. But it's. That is exactly who we are. And that's exactly why the vision of. And Peterson gets at this with Matt Dillahunty when they start talking about his lawnmower. You know, and Peterson knows this. The difficult thing is. And here's the problem. And C.S. lewis nails this when he talks about pantheism. Because C.S. lewis says, what happens when you play, you know, basically when you start, when you pray into the void and the void speaks back and you realize, well, what if. What if this isn't, you know, a figment of my imagination? Well, we know we have active imaginations and we project as much as."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":5113.32,"end":5113.88,"speaker":"Jonathan Pageau","text":"For sure."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":5114.28,"end":5125.32,"speaker":"Paul Vander Klay","text":"But. And this is. This is Lewis's point. What if you deserve. What if you decide that, well, maybe universe has designs on you that you haven't been."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":5126.76,"end":5127.12,"speaker":"Jonathan Pageau","text":"That."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":5127.12,"end":5156.67,"speaker":"Paul Vander Klay","text":"That you haven't been asked to consent to, but this is the story of humanity, and it's right there in Genesis, and it goes all the way through. And this doesn't end, because the heart of our rebellion is that God is God and we are not. And this really. We really hate that. That's how we want to be. We want to control the world. We are all Sauron, you know, looking for a way."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":5156.99,"end":5214.25,"speaker":"Jonathan Pageau","text":"Yeah. Yeah. And it's interesting. Like, my. My wife is. It is amazing. I admire. Because she's able. When someone says the universe, and they'll say the universe, you know, I asked the universe, whatever. She doesn't flinch at all. She just. She just. It's like in her mind, she just replaces universe with God, and she totally engages the person. I have this, like, little glitch. I'm like, oh, don't. Like, that doesn't mean anything. It's not. It's not. It's not a. How can you say. I think I had this discussion with David Fuller when he asked me about the universe and I said the universe. The fact that you can say that the universe is one, that you can use the word universe, that you can say all just that. That is pointing to you to something, my friend. It's pointing you to the. To the notion that you can unify. That you can unify all of manifestation. And so there's something that pops up above it. Like, it just happens, you know, Universe. How can you say that it's a. There's something above it inevitably."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":5214.57,"end":5286.23,"speaker":"Paul Vander Klay","text":"Well, and I think. I mean, for me, you. Both. You and Jordan have been extremely helpful for helping me recognize the indispensability of hierarchies, because we all. I mean, again, once Benjamin releases the conversation we had and he talked about the social justice thing and how certain people are saying they're creating kind of a little island of privilege in that what I am oppressed. Instead of, I think, think, therefore I am. I am oppressed, therefore I am, or am black, therefore I am. And what they have to do is establish a little. One little space that they won't deconstruct. And it's like, well, there you go. There's your idol right there. And the way, you know, gosh, you guys have, you know, I always keep this dollar bill on my thing to, you know, look at the little pyramid with the separation of. Because here's the thing. Once you violate that third commandment and make the. The thing that cannot be deconstructed into the top of your hierarchy, you have now created a hierarchy that cannot stand."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":5286.63,"end":5290.87,"speaker":"Jonathan Pageau","text":"Yeah. And that's the. Yeah, you're right. And it will fragment and it will splinter inevitably."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":5290.87,"end":5356.93,"speaker":"Paul Vander Klay","text":"Yeah, yeah. And you cannot actually have a community around it because, well, I am black. Well, that means everyone who is not black can't be part of your hierarchy, and you're going to have a supremacist structure. And I think just recognizing hierarchy is fundamental in this. But then you get into the fact that what happens with Christ, and I realized this a number of years ago when I was going carefully through the Gospel of Luke is Christianity is this amazingly subtle working through of equal and hierarchical. It's just back and forth and you see Jesus. So when rebelism actually came to living stones, which was a hierarchically a mind blowing experience that a British film crew would come to this church and the one thing that Ali noted in my sermon that kind of caught his attention was you see this with Christ because he's at the top of the hierarchy and he says I'm at the bottom. I'm the servant of all."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":5356.93,"end":5547.3,"speaker":"Jonathan Pageau","text":"Yeah, that's why I say Christ is not at the top of the hierarchy. It's not the right way. It is the right way to see it. But you also have to say that Christ fills the hierarchy. That's what he does. He's actually the entire hierarchy. So it is right to say that he's at the center, he's at the top. All of that is fine. But you need to really understand that he fills it up. He goes to the bottom too. I mean the descendant to Hades, the crucifixion, all of that is jamming the entire world into one. Crucifixion is insane. You know, it's like jamming the entire world into one event. You know, where the top and the bottom completely meet. You know, where the mockery of Christ declaring him the King is an actual declaration of kingship. You know, where it's like all of it smashed together. The story of the crucifixion drives you insane if you think about it too much. But I wanted to get to this idea that you said because I think that that's one of the things that like for example, Jonathan Haidt gets wrong is that he's understood circumambulation, he's understood this basic pattern. But he thinks that you can just put anything there and you can circumambulate. That's not how it works. It's not true. You can't put anything there that the thing that you put in the middle has to have the quality of the middle. You can't just put it. You can't just put any random thing in the center because if you do, then that's going to break apart. It's going to break apart either in, let's say in itself or it's going to break apart in the fact that it's going to cause war between the different parties. Like it's going to create the pagan problem where it's like the fight between the gods where the gods are warring amongst themselves. And so that's the supremacy of the. Of, let's say the monotheistic tradition is that we've come to a point where what we've put at the highest is the highest. Right? It's like we've said, okay, okay, so this, that, you know, it's like, okay, so these gods, these God, these gods. And then, wait, no, the God is the highest, is the. Is the origin of all. The God is the infinite, is the thing by which all things exist. And so it's not the God of war or the God of this or the God of that. No, we've brought it all into the thing by which everything exists. So it's like we're circumambulating the highest thing by its very definition. And that's why I always get annoyed when people like Sam Harris and them say, you're an atheist. You just. You just not. You're. All the believers are atheists. They're just atheists towards other gods. You're being dishonest in comparing Mars with the absolute, with the absolute transcendent God. Those two things are not the same. We're not talking about the same thing. And so I think that that's maybe one of the problems with. But I mean, it's great that that secular atheists have understood at least that circumambulation is the manner in which the world exists. They've kind of seen it, but they still have this flat. They still have this flat way of looking at it."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":5548.02,"end":5619.04,"speaker":"Paul Vander Klay","text":"One of the best illustrations of that I've come across recently is. You know who Scott Alexander is? Starslate Codex. He has a blog. He's a psychiatrist on the East Coast. He writes pseudonymous. Pseudonymously. And he wrote a piece recently. Rod Dreier picked it up as well. It was called Gay Rights R I T E S R Civil Rights R I T E S He was in Guatemala and noticed their Easter pageantry. And he compared that with kind of traditional American civil religious Fourth of July parades to the Pride Parade in San Francisco. And he was making the point, exactly as Jonathan Haidt does, that what these parades are doing is functionally equivalent to Jonathan Haidt's circumambulation. But what he can't see is exactly the point that you just made, that that which you elevate and celebrate in your parade is not just, well, we need a glue to hold society together. The glue matters."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":5621.36,"end":5658.79,"speaker":"Jonathan Pageau","text":"There's a difference between a paschal procession and a pride carnival. And they appear in the very manifestation of the two. Like, one looks like a carnival, one looks like a orderly procession of, you know, and so it's like you can just look at what they look like and you can see that one is on the edge and. And one is actually turning around. The middle one is a clown kind of. There's a difference between Mardi Gras and Easter. And we're not able to tell the difference anymore. We think they're the same."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":5659.03,"end":5746.9,"speaker":"Paul Vander Klay","text":"Right. And I just want to say, Jonathan, I have learned so much from you, and your work, I think is astoundingly valuable. When I first, I mean, I stumbled into this whole Jordan Peterson thing. Gosh, how did that happen? Well, Scott, of course, but, you know, but. And then, you know, there's this. There's this Eastern Orthodox icon carver, just random guy. And I. Some of the first videos I listened to you, I'm just thinking, what is he talking about? And. But after a while I began to say, oh, wow. Oh, wow. I have learned. I have learned so much from you. And I'm really, I'm deeply grateful and indebted to your work because it. I mean, and so many of these things that you have, that you have illustrated, I think so well, have helped me see a lot. And so if there are moments that you say, why am I making these darn videos? Moments like that, talking to these random strangers and asking me. I look at the kinds of questions you're asked in your question and answer videos sometimes, and it's like, oh, gosh, I'm glad. Part of the reason I haven't started a question and answer thing is like, I hope they don't ask me the kinds of questions they ask Jonathan. I don't know if I could answer them, but I'm deeply grateful for your work."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":5746.9,"end":5747.3,"speaker":"Jonathan Pageau","text":"Thank you."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":5747.3,"end":5748.62,"speaker":"Paul Vander Klay","text":"Thanks so much."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":5749.9,"end":5767.89,"speaker":"Jonathan Pageau","text":"It's not only very touching, but it does, you know, to hear that from you, you know, it's very helpful. Like, it's helpful, like you said, in those moments where I'm like, okay, what is going on? What am I doing? I'm a YouTuber. You know, I hear my kids. I hear my kids tell their friends that their father's a YouTuber. And I'm like, oh, man."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":5769.41,"end":5785.9,"speaker":"Paul Vander Klay","text":"My wife and oldest son actually have a phrase to try to make sure people don't watch my videos. They're like, well, so I hear your father's on YouTube. It's like, yeah, he does, like two hour videos about religion and philosophy. And once people hear that, they're like, I'm never gonna listen to that."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":5785.9,"end":5840.03,"speaker":"Jonathan Pageau","text":"I don't want you to listen to my dad. That's hilarious. Anyways. But I've also. I'm also really impressed, I think, like, I'm also impressed at the fact that you've been able to kind of reach out to just the everyday list. I don't know how you do it. Like, the fact that you're able to have all these conversations with all these people that are watching your videos. It's like you're taking people on this, like, therapeutic reconnection, you know, Taking them, taking their hand and kind of guiding them slowly towards God, towards the church, but in such a. Just a real therapeutic way, you know, It's. Yeah, it's pretty. It's pretty amazing. It's like hopefully. Yeah, hopefully all of this. Like, this whatever it is that we're doing. Like, you know."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":5841.95,"end":5844.35,"speaker":"Paul Vander Klay","text":"Whatever it is that we're doing is exulting. Right."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":5844.43,"end":5878.85,"speaker":"Jonathan Pageau","text":"Discussion. This weird thing, you know, it's like. Yeah. Anyways, let's just say that I think that. I think both of you. I'm very grateful as well. Like, I'm grateful to see that. To see people come to you. And I hear people all the time. Like, they. Like, I listen to Paul every day. I tend to Paul every day. And it's like kind of like, yeah, they don't go to church yet, but it's like, Paul's my pastor. They'll say things like that, you know, but they don't go to church yet. But it's like they know. They kind of know that it's in their future. They kind of know it, but it's like, yeah, you know, I'll get there. But for now, you know, So I think that that's awesome. I think that's great."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":5878.85,"end":5890.64,"speaker":"Paul Vander Klay","text":"Yeah. Thank you. Well, one of the talking. It takes a lot out of me because it's intensive listening that you have to do for people. I don't know."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":5890.64,"end":5894.64,"speaker":"Jonathan Pageau","text":"I wouldn't believe that. It takes a lot out of you because it's like, if you keep going."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":5894.64,"end":6026.39,"speaker":"Paul Vander Klay","text":"Like this, though, I don't. And this is. I mean, the crazy. So one of the guys in our meetup, you know, he was. Before Jordan came to Sacramento, he was ready to kind of kiss Jordan goodbye because he was. He was kind of done with the whole thing. But they went to the VIP thing, and I. He and I had the same experience because he's a psychologist and I'm a pastor. We watched Jordan work that 160 line of VIPs who had paid to shake his hand and get their picture, and how he was able to maintain listening intensity with each person that came through that line. I know what it's like to work a line. And I can't imagine how he's able to do that, how he was able to do that on his book tour night after night. That's. That. That. That was phenomenal. I couldn't imagine it because I love the conversation with randos, as they call themselves, because every. And here's the crazy thing about human beings, you know, they are. They're image bearers of God. And every single person that comes to me, especially if they can just tell their story. And, you know, many of the stories I can't publish because they're too personal and it would involve parents or children or something like that. But it's a. Like we said earlier, it's a holy thing that becomes holy ground where, you know, where they share the pain and the tragedies and the victories of common life. And it's. I mean, God is. God has been all over their lives and they haven't recognized him sometimes or seen him. And the great privilege of being a pastor is to steward those stories and hopefully allow others to see God through the stories of ordinary people. That's one of the things I learned from my father and his ministry, and I think he learned from his father and his ministry."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":6026.79,"end":6027.19,"speaker":"Jonathan Pageau","text":"So."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":6029.03,"end":6033.03,"speaker":"Paul Vander Klay","text":"I have to figure out how to do that in a sustainable way."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":6033.83,"end":6052.52,"speaker":"Jonathan Pageau","text":"Wow. Anyways, it seems like you're succeeding in my perspective, because I couldn't. I think that I. Yeah, but. So I think, at least for sure, the fact. And even if you tell me also, I didn't know that a lot of videos you're not putting up, so it means that you're having even more conversations than the ones we're seeing. So that's pretty cool."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":6052.52,"end":6119.92,"speaker":"Paul Vander Klay","text":"I think that's great. People are image bearers of God. And even if they're far from God or can't see God anywhere, God's glory is. Their life is littered with God's glory. And God is working in the things that they don't see. And it is an amazing thing when they come to a place where suddenly they came around a corner and, oh, my goodness, there's God. And it's the C.S. lewis pantheism quote. And okay, well, what do I do now? Yeah, that's exactly right. What do you do now when you find the burning bush? Do you run away? That's a reasonable thing. When you hear the voice that says, take off your Shoes. You're on holy ground. Well, the best thing to do is obey. But we're messed up creatures or something."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":6122.48,"end":6128.4,"speaker":"Jonathan Pageau","text":"All right, Paul, I think this is the longest conversation we've had. I think we've gone like almost two hours."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":6129.76,"end":6144.87,"speaker":"Paul Vander Klay","text":"I didn't want to, you know, with everything going on in your life, I didn't want to bother you with a conversation. But I so enjoy you, Jonathan. I love your laugh. You have this weird giggle that you get to a point."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":6146.15,"end":6173.26,"speaker":"Jonathan Pageau","text":"Yeah, yeah, I always laugh in the words. My problem is I laugh in the worst possible places. Like the reason why I did. I did a video on laughter where I kind of. I did a video like it's like the meaning of laughter or something. And I was pretty harsh on laughter. But I think it's also just trying to understand why I laugh when things get weird or when it gets. Anyways, I'm happy if it's enjoyable."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":6175.82,"end":6182.94,"speaker":"Paul Vander Klay","text":"So anyway, thank you, Jonathan. I appreciate this. And yeah, you recorded it, so you know, whatever you want to do."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":6183.02,"end":6194.37,"speaker":"Jonathan Pageau","text":"Yes, I recorded it and I think I missed like the very beginning because we started right away and then it was like, oh wait, I need to record this. So I'll see, I'll kind of see how I edit. Do you want, do you want to put it up on your channel as well?"}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":6195.41,"end":6195.81,"speaker":"Paul Vander Klay","text":"Sure."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":6195.89,"end":6197.53,"speaker":"Jonathan Pageau","text":"Alright, so what I'll do is we."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":6197.53,"end":6203.17,"speaker":"Paul Vander Klay","text":"Have a lot of people in common. Yeah, we do have some that aren't. So we should probably both post it."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":6203.33,"end":6216.1,"speaker":"Jonathan Pageau","text":"So I will send you, I'll send you the link and. Yeah, and so I think that, yeah, that'd be great. Okay. Plan another future discussion and hopefully at some point we'll speak at the same place. You know, that'd be great."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":6216.42,"end":6231.86,"speaker":"Paul Vander Klay","text":"Well, I am talking to this one church that would really love to have you out. And so then if that happens, maybe we can do some joint things. And when I talk to John Vervaeke, maybe the three of us should do a three way video at some point too. That could be fun."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":6231.94,"end":6234.9,"speaker":"Jonathan Pageau","text":"That could be a lot of fun. Yeah, definitely. Definitely. All right, Paul."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":6234.98,"end":6236.58,"speaker":"Paul Vander Klay","text":"All right, Jonathan, have a good day. Take care."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":6236.58,"end":6237.02,"speaker":"Jonathan Pageau","text":"Bye bye."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":6237.02,"end":6237.94,"speaker":"Paul Vander Klay","text":"All right, bye bye."}
{"episode_id":"SW - #074 - 2019-11-20 - Paul VanderKlay - Discussing the Meaning Crisis","start":6239.22,"end":6304.18,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show. Description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pajo videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
