{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":0.16,"end":42.64,"speaker":"Richard Rohlin","text":"The gates of the north will be opened up, and out will come the powers of the nations which were enclosed within. And the whole earth will reel from their face, and men will cry aloud and leave and hide themselves in the mountains and in the caves among the gravestones, and they will be deadened with fear, and many will perish, for none will be to bury bodies. For the nations coming from the north eat the flesh of men and drink the blood of beasts like water, and eat unclean things, snakes and scorpions and all abominable and disgusting beasts, and the reptiles that creep upon the earth, and brutal things and dead bodies and the aborted fetuses of women, and they will slaughter infants, even producing them from their wombs, and they will boil the meat and eat it, and they will corrupt the earth and befoul it and deface it, and there will be no one able to stand before them. And basically, this is the thing that precipitates the end."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":54.24,"end":100.59,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the Symbolic world. So, hello, everybody. We are here with Richard Roland once again, and he's wearing some great symbolic world merch of the Ethiopian cross, which will be related to what we're going to talk about today. Because today we're going to talk about Gog and Magog. We're going to talk about the crazy hordes of nomads which come down from the steps and devastate the world, and how this was inscribed mythologically and in our different texts, and also how it kind of played out historically. So, Richard, thanks for coming. I'm excited about this."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":101.23,"end":123.92,"speaker":"Richard Rohlin","text":"Yeah, this is going to be. I mean, this is one of those. This is one of those topics where there's like a kind of meta symbolism at play, which is when you start trying to talk about the symbolism of the steppe hordes, there is a literal flood of information that just kind of comes overwhelming and makes it impossible to talk about in any kind of a structured way. But we're going to do our best today."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":124,"end":150.45,"speaker":"Jonathan Pageau","text":"We are going to start with going back into the apocalypse of Pseudo Methodius, because this has kind of been in some ways an example of a universal history, which was extremely influential both in the east and the west, and which has all these kind of narrative mythological images which can help us understand, you know, kind of how we can link actual historical events to this grand narrative. So. So start us off, Richard."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":150.45,"end":303.83,"speaker":"Richard Rohlin","text":"Yeah, so to dial things back even a little bit further than that, in the. In the book of Ezekiel, the Prophet Ezekiel, chapter 38, we get this reference to Son of Man set Thy face against Gog, the land of Magog, the chief prince of Meshach and Tubal and prophesy against him. So this is a prophecy against basically the barbarian hordes of northern Europe. And just as one example, the, the Jewish Roman historian Josephus identifies Gog and Magog with. Or Gog from Magog, which is what it is here in Ezekiel identifies that with Scythia. Right. So the Scythians are a, they're a group of essentially. Well, they're, they're an ancient nomadic people kind of who live in or who came from the region that today is what we call Kazakhstan. But they were, you know, basically on the Russian Steps of the, of the, of Siberia and Eastern Ukraine. And they invaded during the Classical period, they invaded the Pontic Step. And that's kind of how they came into contact with the biblical world. They're probably an Iranian people in origin. And anyway, the main thing to understand is they are a. They were an aggressive nomadic people. They rode on horseback, they shot bows, and pretty much all the people that we talk about today are going to be aggressive nomadic people who rode on horseback and shot bows. And so this is back in the time of Ezekiel, you know, and it gets carried forward to the, the. To, for instance, the Book of revelation, Revelation chapter 20, verse 8, when Gog and Magog. So there's. It sort of changes the Hebrew Gog from Magog to Gog and Magog, but it. Where they're seen as these barbarian hordes of the north. Right. And so we talked a little bit last time about if you draw a map facing east, then the north is on your left hand. Right. And if you're a lord of spirits listener, for instance, you know that north is the liturgical direction from which evil comes, from which darkness comes, from which the enemy comes. And there are still some Christian traditions today that actually for this reason at certain services they read the Gospel facing north because it's a proclamation of the victory of Christ to the enemies of God, at the enemies of the people of God who have sort of historically come down out of the north. If you lived in the Levant. Right. So we talked about this is a Jerusalem centered view of the world. If you go to other cultures, you'll find that other cultures have their traditional direction of evil is going to be maybe situated differently depending on where they're from."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":304.36,"end":343.74,"speaker":"Jonathan Pageau","text":"Yeah, but there's a general notion that the west and the north are somewhat sinister because the west is the place where the sun goes down and the north is the place where the sun never goes. So the north is naturally dark, the way that we actually experience it. And not only that, but the way we experience the north is also related to the cold and to desolate areas in terms of the North Pole, but also in terms of mountains. We always have to understand the way that even, even in Israel, like looking north, they would have had those mountains that would have been white caps."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":343.74,"end":448.52,"speaker":"Richard Rohlin","text":"And so, yeah, sort of that whole. That psalm that says, I lift up mine eyes unto the hills towards the north, from where does my help come? Those are two separate phrases. Sometimes English translations make it sound like it is the hills from whence my help is coming, but it's the other way around. It's like I'm looking at the hills, I'm looking at the mountains, I'm looking towards the north. Who's going to help me? Who's going to save me? Right. Is what that psalm is asking. So the basic idea here is that you have hordes of barbarian nomads, barbarians being, you know, anyone who doesn't speak Greek or just, you know, and then much later on, the usage just means people who are situated outside of that sort of Roman household, the Roman world. So you've got hordes of barbarian nomads, and typically speaking, the nomads are. Are horse archers. Right. I don't know how nerdy you want to get here, because I was super. I'm still super into this stuff. When I was a kid, I would go to the library and just check out every single book they had on horse nomads because I've always found them, like, one of the most fascinating phenomena of history. This, you know, this basic, you know, basically you have one piece of technology, which is the composite recurve bow. Right. And that one piece of technology makes possible the largest land empire that has ever existed in human history. Yeah. And obviously everyone knows I heart the Romans. You know, you got to love your parents, right? So, like, for all the things that are messed up about Rome and. And for all the good things too, like, I love Roman history, but I got to give it to the Mongols here. You know, if you're just going, going like, sheer size of empire, you know, maybe not so much lasting cultural artifacts, but sheer size of empire, like, the Mongols have it for sure. Yeah. And it's also interesting to read about."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":448.52,"end":467.24,"speaker":"Jonathan Pageau","text":"The horse archers because of the madness of the accounts. Like, some of the accounts make them sound like these superheroes, even their own accounts, the way that they describe the amount of arrows they're able to shoot, like the idea of catching an arrow midair and putting it in your bow and shooting it back. That kind of crazy stuff. I mean, that is just amazing."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":467.56,"end":498.03,"speaker":"Richard Rohlin","text":"Yeah, that stuff is awesome. Yeah, that stuff is just awesome. Like. Yeah, so I'm super into this stuff. Several years ago, there was this amazing Genghis Khan exhibit that was touring the country, and it came to Dallas. And so I took my wife and some of my family members, and that was amazing. And they had a bunch of, like, his stuff, like his armor, some of his arrows, things like this all there. And then there were, like, three people that showed up to do, like, the throat singing, you know."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":498.03,"end":498.91,"speaker":"Jonathan Pageau","text":"Oh, yeah, yeah, yeah."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":498.91,"end":527.16,"speaker":"Richard Rohlin","text":"Monk singing. Yeah. Which is super cool. So anyway, all that to say, this has been something I've been really interested in for a long period of time. And so when I talk about this stuff, it's definitely from a place of love, and as much as is appropriate, a place of admiration. Obviously, there's a lot about the Mongols that would not be admirable from, like, any kind of a civilized point of view. All the genocide, for instance, you know, like, the little problem."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":527.32,"end":528.32,"speaker":"Jonathan Pageau","text":"Yeah, it's a little problem."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":528.32,"end":574.54,"speaker":"Richard Rohlin","text":"Yeah. But for all that, you know, it's a really fascinating historical area of study, I guess you could say so. And actually, if somebody wants to just, like, really take a deep dive into just Mongol history from a kind of a Mongolian point of view. Yeah. Dan Carlin's hardcore history podcast. He's got a series on the Mongols, and I don't know if it's still free. You might have to pay for it. But even if you do pay for it, it's totally worth it. It's pretty long, so you get a lot of hours of listening, a lot of days of listening out of it. And he goes into really deep detail on a whole bunch of facets of Mongolian history. There are a few things in there that, when I was listening to it, I was like, I don't think that's quite right. And so I went and checked, like, primary sources that I have access to and know about, and it's like, oh, no, he got this. This little detail wrong or something. But on the whole, it's quite good. So, yeah, people might want to check that out. All right, so you got this."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":574.78,"end":581.58,"speaker":"Jonathan Pageau","text":"So we now. We got Gog and Magog inscribed in Revelation. Now moving into the Alexander legend or corpus."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":581.77,"end":671.34,"speaker":"Richard Rohlin","text":"Yeah. So we talked about the Alexander Romance quite a bit, and it's really like some people have said, Alexander Romance is not so much a text as it is like a genre, because there are actually a whole lot of different Alexander legends. There's a Syriac one that is quite important, although I don't think there's a really a good English translation of it right now. But there is a. There's a. There are some pretty good Greek editions that will also have the interpolations where the Syriac is different. They'll include that in there. A pretty decent one from. From Pangolin Classics, I think. So in the Alexander romance and in other works that refer to it. I mean, obviously the apocalypse of Pseudo Methodius is one we've been talking about. This is right here. Towards the beginning, we have Alexander the Great do something that is actually going to. I don't know if it's the very first precedent for this, but it's definitely. It sets a certain pattern which then we'll see play out historically in a lot of different ways and places. And so what, what he does, there's this story of the gates of Alexander. And I think in our very first Ethiopia video we actually talked about this. But the gates of Alexander, the idea is that he goes up and there are a few different geographical formations that were later named the gates of Alexander. And there are actual walls and gates that were named the gates of Alexander. For instance, the Persians built one in, I want to say, the 6th century and they called it the wall of Alexander. Like they were very, very conscious, remember, like Alexander, everybody gets to claim Alexander. He was the king of everything, you know, back then. And people. Yeah."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":671.42,"end":674.82,"speaker":"Jonathan Pageau","text":"Indian legends, they're Jewish legends. And then."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":674.82,"end":680.54,"speaker":"Richard Rohlin","text":"And, and obviously. Yeah. Islamic legends much later. And, and all these, Everybody kind of Quran."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":680.54,"end":681.06,"speaker":"Jonathan Pageau","text":"Like there's."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":681.06,"end":682.22,"speaker":"Richard Rohlin","text":"Yeah. In the, in the Quran."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":682.78,"end":684.02,"speaker":"Jonathan Pageau","text":"That's in the Quran. I mean."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":684.02,"end":703.79,"speaker":"Richard Rohlin","text":"And this, this story of Alexander Gates is. Is in the Quran as well, I believe. Yeah. Although he's got a different name. He's not called Alexander. Yeah, yeah. So anyway, so the idea is Alexander goes and he builds these unbreakable gates. And for instance, in the. You know, the gates are usually made out of orichalcum or some other kind of magical metal."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":703.79,"end":705.71,"speaker":"Jonathan Pageau","text":"Yeah, like an alloy. Like a weird."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":706.35,"end":756.3,"speaker":"Richard Rohlin","text":"Yeah, some kind of a weird alloy. Because the idea is it's got to be magic proof because the people that he's sort of banishing beyond the furthest reaches of human civilization, they're monsters. And we can go into all kinds of ways in which they are monsters. You know, the different texts describe them differently. The thing that they all tend to have in common is that they're cannibals. Sometimes they have the heads of dogs that eat bugs, they eat, you know, aborted babies and like, all this different stuff. Like, they're really monstrous, you know, and they're banished beyond the. They're banished beyond. You can just understand the gates of Alexander as being like the furthest point of human civilization. Right. So there's like, human civilization, including, like the. The edge. And then beyond the edge, there's the Wall, and beyond the wall, there's monsters. Yeah."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":756.3,"end":773.9,"speaker":"Jonathan Pageau","text":"And we can. We need to understand it as really a mythological representation of something which has many historical iterations, some which precede the apocalypse and some which come later, whether it be the Chinese Wall, whether it be in. In. In the uk."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":774.94,"end":806.42,"speaker":"Richard Rohlin","text":"Yeah. So this is virgin Wall. Like, there's the thing. Yeah, this is the thing that I want to point. Wanted to point out is that historically in the east, there were several different walls which were built. Obviously, there's the Great Wall of China, Alexander's Wall, which is the second, I think the second largest wall ever built and actually bigger than some of the early sections of the Great Wall of China. But that was built in. Built by the Persians to keep out a group called the White Huns. And. But then, yeah, you've got the same thing going on in the uk."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":807.22,"end":809.62,"speaker":"Jonathan Pageau","text":"Yeah, the Antonine Wall and the Hadrian's Wall."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":809.62,"end":853.59,"speaker":"Richard Rohlin","text":"Yeah, yeah, they built two different walls to keep out the Picts and the other, you know, the really crazy, really out there barbarian civilizations that were like, you know, England, you know, the island of Britain, that's the edge of the Roman world. Already literal, the edge of the Roman world. But there's crazier stuff beyond that, like monsters beyond that. And they built walls to try to try to keep that stuff out. Of course, the, the. The story of all of these walls is that eventually they fail. You know, eventually they fail, and they usually fail because people, people stopped keeping the watch or people were bought off and people were bribed or, you know, they didn't have money to maintain the wall anymore or something like that. Like, it's always, you know, not a failure of, you could say, like, the physical structure itself, but a failure of the vigilance."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":854.46,"end":856.1,"speaker":"Jonathan Pageau","text":"Yeah, failure of attention. Failure of vigilance."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":856.1,"end":904.86,"speaker":"Richard Rohlin","text":"Yeah, failure of attention. And so something happens, they stop keeping the watch on the wall, and that's when the monsters start coming in. And so this is like kind of the basic pattern of Gog and Magog. And it, it basically informs the way that the Levantine world. And when I say the Levantine world, I mean both the Christian, the Jewish, and also the, The Islamic world of the Middle east during the Middle Ages. This colors and affects the way that they think about and experience these steppe hordes, which, from their perspective, are coming kind of out of the east and out of the north. And we talked a little bit last time about for Scandinavian peoples who at a slightly earlier juncture in history, were Gog and Magog. Right. That's the thing to say about this idea of Gog and Magog is a little flexible."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":906.14,"end":933.52,"speaker":"Jonathan Pageau","text":"The way I like to talk about it, that it's a category like friend and stranger. So the category of stranger, when I say that's a stranger, it's a. It's a category which is true and which exists but finds body in whatever embodies it. And so it's almost like the word barbarian itself. The word barbarian doesn't actually. It's not a. It's not like an ethnic word. It's a word talks about that which is outside. And so I think Gog and Magog seems to play that role as well."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":933.76,"end":1141.32,"speaker":"Richard Rohlin","text":"Yeah. A kind of a weird or goofy or maybe even at this point in history sensitive example of this, just so that we say nothing at all controversial on Jonathan's channel is when I was growing up, you know, growing up in this evangelical setting, you know, in the south of North America, in the American South. So I live in the Dallas area, and Dallas is actually the home of the origin point of a kind of theology called dispensationalism, which all that left behind stuff, the rapture stuff, all that stuff. We. We invented that. You're all welcome to that. Yeah, you're all welcome, everyone. Like, where would you guys be without, like, a Nicolas Cage remake of a Kirk Cameron movie? I mean, that is the thing. That is the thing that happened. Like, people. I don't know. It's. Yeah. But. And so in this. In this kind of dispensationalist point of view, I mean, I can remember when I was a kid, I would just check out. I read every book in our church library. We had a. I don't know if that's a thing that a lot of the churches that I grew up in had, like a church library. Yeah. And my parish now we have a church bookstore, which is not quite the same thing, but we had a church library. And you could. And actually, I volunteered at the church library. Surprising to everyone. I volunteered at the church library. So I would go and I would. I would work there on Sunday afternoons after church to help people check books out and check books back in and contact people who are late on their books and so on. But this church library was mostly books about, about end times prophecy. I mean that was, it was a very small room. There were probably two, 300 books. And they were mostly about end times prophecy. And at some point in the process of my childhood, I read all of these books. I was just really fascinated by this stuff. You know, I read this one book and the thing is, like, I didn't know how old some of these books were. Like a lot of these books were written in like the 70s and 80s. Yeah. And so this is, this is where this long and rambly story is going to, is that I would read this story and you know, I'm reading a book that's written during the Cuban Missile crisis, right? And so Gog and Magog are Cuba and Russia. And then I'd go home and I'd be like really freaked out and like dad, you know about these missiles in Cuba and all this stuff. And he'd be like, actually that, that happened like a long time ago. And it's not, you know, when, you know, that happened before you were born, it's not a problem now. It's, you know. But yeah, so this is the thing is that, that Gog and Magog were, you know, Russia and China or Russia and Cuba or you know, they're basically like whatever, whoever the other is, whoever the enemy is, whatever the sort of unknown. And it's kind of like, I mean in, in currently like political correct, critical race theory, discourse and things like that. There's a lot of talk about not othering people. Right, but there's, there's something to that. Right, and what I mean by that is, is basically as soon as like something becomes really familiar to you, you could say as soon as it becomes sort of domesticated. I mean, for instance, you know, Russia is the bad guy, you know, right now in America. So like, if you don't know a whole lot about Russian politics or culture or things like this, then it's really easy. And obviously this Russia is Gog and Magog stuff has been making the rounds again, right. Because of that. If you do know a lot about the political situation over there, then you might not, you know, you could say, oh, this war is terrible. We need to pray for these people, all this stuff. But, but in your mind, they're the sort of. They're other human beings. Nations have wars all the time. We need to pray for the situation. But, but there's not that same sense that, you know, they're the barbarian horde on the edge of the world. Right. So it's. So this is an identity that is always kind of looking for a home, you could say."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":1141.32,"end":1220.13,"speaker":"Jonathan Pageau","text":"Yeah, that's why. One of the reasons why I emphasize St. Christopher so much is because I think that the icon of St Christopher and the story of St Christopher is a way to both acknowledge the strangeness, but then give you a method by which to. To domesticate it and then engage it. So I think that that's. It's important to understand that. And I. What you see in the old Pentecost icons is something like that too, which is like we acknowledge the strangeness of the. Of the foreigner, but then we don't. We don't see that as an absolute limit. Like it is possible to slowly enter into contact with them and then. Yeah, to kind of bring them into our. Bring them into a relationship. But that's not a. When people say don't other others, like don't other them, that's like, you can't do that. We're made that way. Like this is something that we do automatically. If you don't realize that you do it, then you'll do it unconsciously and you won't even realize. Just as you're criticizing people for othering, you'll be doing it at the same time. Right, exactly right. Better to recognize it as a normal mechanism of perception that we see strange things as kind of monstrous, kind of hybrid, you know, off key. And then how is it then that now we can domesticate that to the extent that it's possible? Sometimes you also don't, because there are some strange things that are dangerous for you."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":1220.13,"end":1221.01,"speaker":"Richard Rohlin","text":"You know, it's like that."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":1221.01,"end":1233.72,"speaker":"Jonathan Pageau","text":"That really could. So if you. If you see a dark stranger in an alleyway, you know, you don't know who it is. But you might not want to domesticate that dark stranger in an alleyway. It might be better to walk away because. Because that dark stranger in the alleyway might just kill you."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":1234.04,"end":1354.73,"speaker":"Richard Rohlin","text":"Yeah. I mean, weird food is another great example. I mean, I grew up eating in kind of like an Asian American household. So kind of living in these two worlds. We ate a lot of Chinese food, like really traditional Chinese food and a lot of traditional Chinese food and let's say like traditional poor people food in general. Right. The way that something like I'll pick on you because you're French ish. The way that a snail becomes a delicacy. Right. You're not supposed to eat snails. Snails are bugs. They crawl around on the ground, they're slimy. You shouldn't Eat snails. But if you're poor enough, you will figure out a way to cook a snail so that it kind of tastes good. And that's when there a flip happens and you have all these things that used to be basically poor people food. I mean, a great example is shrimp or octopus or any other invertebrate that comes out of the ocean. That's all trash food. Right. That's Mediterranean trash food. That's why you're allowed to eat it during a fast, because it's a bug. Right. So that's trash food. It's crawling around in the filth at the bottom of the ocean. Right. Literally the bottom of the abyss. Right at the bottom of hell, there's a bug crawling around eating garbage, and you're allowed to eat that. But eventually people figured out a way to cook that so it's really tasty. And that's why in the United States, shrimp, lobster, et cetera are delicacies. So, I mean, that's a good way to understand the process of domesticating a certain thing. But then there's stuff that's like, even beyond that a little bit. I took the kids to the Dallas World Aquarium yesterday, and they had, like, a bunch of puffer fish in the tank. And I was looking, showing them the puffer fish, and. And unfortunately, none of them got angry at us. I was hoping we'd see one of them kind of, you know, pop up. But. But we were talking about puffer fish, and I was explaining to them how pufferfish work and what they do and how they protect themselves, but then also explaining that, you know, puffer fish are extremely toxic and potentially lethal to eat. But that hasn't stopped them from being a delicacy in certain Asian countries. Yeah. Japan in particular. Right. So then that's like taking that to the very edge of what you can do in terms of domesticating something. Right. But then there's stuff that nobody can integrate."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":1354.81,"end":1375.06,"speaker":"Jonathan Pageau","text":"Yeah, but I think. And the images that we see in the way they represent Gog and Magog, that they say that they're cannibals, the fact that they say that they. That they eat human fetuses, you know, like that other images that could be used would be incest or all these kind of taboos that cannot be integrated, that they just can't. Like, if we integrate them, they could destroy society."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":1375.3,"end":1427.34,"speaker":"Richard Rohlin","text":"Yeah, yeah. And, you know, drinking the blood of animals, which is actually a thing that a lot of these nomadic tribes certainly did. You know, drinking. Drinking mare's blood, you know, eating. Eating horse Flesh, things like this horse flesh is a, let's say, a gray area when it comes to food taboos. A lot of societies don't eat horses for the same reason that they don't eat dogs. It's a little. It's an animal that's a little too close to the human experience in some way, but also, also unclean for, you know, other reasons as well. So, yeah, so you've got the symbolism of Gog and Magog out on the edge. You've got the Gates of Alexander. And then that, that idea of the gates of Alexander actually manifests itself literally a bunch of times throughout history. Right. So you can, I mean, this is the way to read this apocalyptic literature is to look for the pattern and then see the way the pattern is."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":1427.34,"end":1448.1,"speaker":"Jonathan Pageau","text":"Manifesting in the Apocalypse and in the Alexander romance and in the Islamic legends. The idea is that at the end of the world, one of the things that will bring about the end of the world, or while the end of the world is playing out, the gates of Alexander will be breached and Gog and Magog will be unleashed on the world to kind of devour it, judge it, all that stuff."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":1448.1,"end":1703.6,"speaker":"Richard Rohlin","text":"Yeah, yeah. So this is this idea that we find in the apocalypse of Pseudo Methodius, but we actually find it way before this in the Old Testament and in the Book of Revelation for that matter. Right. In all of this apocalyptic literature. Even in things like the prophecy of Habakkuk. Right. What the prophecy of Habakkuk is all about. Why would God use these heathen barbarian nations? In this case, what are called the Neo Assyrians by historians today in the Bible, they're called the Babylonians. Why would God use them to punish his own people? Right. And this is a big question. I mean, there's a bunch of the Ezra literature. So like, there's a whole genre of, of literature in the, in the Second Temple Jewish period around the prophet Ezra and his apocalyptic visions. And so this starts out with a book called 4th Esdras, which is actually in the Russian Orthodox Bible. So if you're in the Russian tradition, it's in your Bible. You should go read it. It's actually pretty rad. It's super cool. And it's all about this idea like, why would God use unjust people to punish his own people? Which is this question that comes up over and over again in the Holy Scriptures. And then kind of more generally like, why would God use barbarians to punish Roman civilization? Why would God use demons to chastise humankind? Things like this. Right. It's that same question kind of over and over again, we see that question kind of expressed here. Like, that's one of the main things the apocalypse of Pseudo Methodius is dealing with. The time of this. Of the writing here is probably during the Muslim conquest of much of the Levant and much of the Byzantine world. And so that's one of the things that the author is trying to really come to terms with, is to say, why are we. What's going on here? What happened to the, you know, the kingdom of God? What's going on? Which is also a question that a lot earlier, for instance, Augustine is trying to answer St. Augustine's right answer when he writes the City of God, right to the same. Same kind of a question. When we're confronted with history, that doesn't seem to be going the way we think it should. We have to sort of. We have to step back and get this apocalyptic perspective. And that's what an apocalypse is for. It's to show you here are the patterns of the ends of things, but also the. The larger pattern of how God is working in the world. And so this is what it says. It says that after the. The conquest of Bezos, or in other words, the Byzantines, by Ishmael and Ishmael's children, that he's going to. He'll eventually be defeated. Ishmael will eventually be defeated. And he'll be defeated by two things. One will be the resurgence of the king of the Romans coming out of Ethiopia, which you've already talked about. And then the other thing that's going to happen is going to be that the gates of the north will be opened up and out will come the powers of the nations which were enclosed within, and the whole earth will reel from their face and men will cry aloud and flee and hide themselves in the mountains and in the caves among the gravestones, and they will be deadened with fear and many will perish, for none will be to bury its bodies. For the nations coming from the north eat the flesh of men and drink the blood of beasts like water, and eat unclean things, snakes and scorpions, and all abominable and disgusting beasts, and the reptiles that creep upon the earth and brutal things and dead bodies and the aborted fetuses of women, and they will slaughter infants, even producing them from their wombs, and they will boil the meat and eat it, and they will corrupt the earth and befoul it and deface it, and there will be no one able to stand before them. And basically, this is the thing that precipitates the end. The king of the Romans, after this, shortly, he gives up the kingdom. We talked about this already. He gives up the kingdom to God. And when he gives up the kingdom to God, the Antichrist appears and then the end comes. Right? So there's this idea that as part of the end of. You could say, like the end of a cycle or the end of a period or the end of the world. Part of what happens at the end is that the barrier is broken down and all the things that you were keeping out, they show up. And they show up. They show up as this powerful destructive force, but also as sort of a, you know, what St. Gregory of Nisa would refer to as the left hand of God. Right. Is they show up and. And their destruction is not without a purpose. Right. That it becomes sort of like. Like a wildfire, right. Where it kind of burns down all the stuff that shouldn't, you know, all the corruption, all the decadence that's building up."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":1703.68,"end":1776.12,"speaker":"Jonathan Pageau","text":"Yeah, and also a flood. It's really related to the flood. Yeah, yeah, definitely related to the idea of the flood that comes. But people like. And I think just maybe to kind of point to the symbolic aspect, help people understand that this is really the description of death in general. It's a description of how something ends. That's what death is. When the outside things finally break in, that's what death is. So you are there, your body, you're fighting the outside, your body is holding together and kind of, let's say, integrating some outside things, ejecting some things, but then at some point your body stops to do that. And then the worms, the things, everything breaks apart and everything from the outside comes in. And then there's no difference between the inside and the outside. You basically decompose. And so this image of the barbarians coming in, finally breaking the barrier, that's what it is. It's the same thing, like an apple falling to the ground. And then ultimately it starts to get mushy and finally it breaks down. And then the inside and the outside coalesce, but it also is a breaking down, which can produce fertile ground for a new beginning. At the same time, that's just a natural pattern of things."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":1776.36,"end":1780.46,"speaker":"Richard Rohlin","text":"Did you ever read the Last Battle, like the final Narnia book?"}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":1780.46,"end":1781.9,"speaker":"Jonathan Pageau","text":"I read it when I was like, 11."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":1782.62,"end":1883.93,"speaker":"Richard Rohlin","text":"That book is like one of the most insightful books to read if you just want to see the pattern of the end of the thing. And this is one of the things that happens at the very end as the, you know, it starts with the ape, which is like a false man, and the donkey which is like a false lion and all this stuff. Really beautiful symbolism. We should, we should like read that and talk about it one day because I think people would really get a kick out of it. But as the world is ending, as Narnia is kind of ending, you know, the stars fall out of the sky. Of course, in Narnia, just like in our world, stars are people. And maybe not just like in our world, but similarly. But so one of the things that happens as the world is ending is that there are all these monsters that live in the northern waste. Okay. So it's again in the North. And this is the nice thing about Narnia, if you're trying to get, get a sense of things. And like a biblical, you know, a biblical cosmology or framework, Narnia is also east facing, which means all your bad stuff comes out of the north because it's to the left. Whereas for reasons we talked about in the previous video, Tolkien's legendary in, for instance, is west facing. Although bad guys also live in the north in Tolkien's legendary. But, but the really scary stuff comes out of the east. Yeah. So. But all these monsters and they're just, they're described as being like dragons, giant lizards, giant snakes, all these, they're at the very end of things. They are released out of the north and they come down and they just eat everything until there's nothing but barren rock and then they die. And the idea is it's just like a cleaning or like a scouring that takes place. And this is one of these things. Lewis's symbolic intuition was really strong in certain places."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":1884.57,"end":1885.13,"speaker":"Jonathan Pageau","text":"Definitely."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":1885.13,"end":1898.09,"speaker":"Richard Rohlin","text":"Yeah, that'd be a fun book to look at sometime. I keep coming across things that I'm like, if we did a symbolic world, like a read through, kind of like a universal history reading club or something like that, there's some stuff that would be kind of fun to go over. That'd be great. Yeah."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":1898.09,"end":1919.2,"speaker":"Jonathan Pageau","text":"So, all right, we have the description of these monsters, barbarians that are up in the. And then, then we have examples, like let's say fractal examples of that happening when these, these groups pour in from the steps and basically ravage society, you know, try to turn society into grazing pasture, basically."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":1919.2,"end":1973.13,"speaker":"Richard Rohlin","text":"Yeah. So the earliest, earliest examples of this were basically the, the Germanic peoples in Western European history. This is what is referred to as the barbarian invasion, starts in fifth and sixth centuries. And it is what basically precipitates the breakdown of the western half of the Roman Empire. But there are a bunch of different people groups that are involved in this. And basically you get successive waves because basically you have one really big group in the back, which was the Huns, and they're pushing all the other groups forward. And so it's like you have a most monstrous group, and then they're pushing the second most monstrous group, who are pushing the third, who are pushing the fourth. So you start out by having, oh, you think these people are really uncivilized, but actually they're kind of civilized because they've lived in contact with Roman civilization for a long time. And those guys invade and they invade and they settle. And then what the Romans end up doing is hiring those guys to fight the next wave of invaders. Yeah, and those."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":1973.13,"end":1977.77,"speaker":"Jonathan Pageau","text":"That's a great. I mean, that if you want to understand an image of reality, that's a really. That's a good."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":1979.45,"end":2044.72,"speaker":"Richard Rohlin","text":"And it's a way that you could say it's how civilization puts on garments of skins, you could say is like taking the. Taking the. You know, like a literal garment of skin would be something like, I kill an animal and I wear it. Skin. Yeah, Right. So you have this, you know, basically, I integrate a new civilization and I wear that civilization skin. I mean, this happened in the United States when the Quakers came and settled Pennsylvania. Big shout out to the. The Forest of William Penn. I'll be there next week with Father Andrew. When the Quakers settled Pennsylvania, they had all these problems with. With the Native Americans that were living around them because Quakers are pacifists, and turns out the Native Americans were not. And so what they did is they invited all of these Scotch Irish to come and settle on either side of them. Right? The Scotch Irish being famously bellicose people, you know, because they didn't want to fight. So they took somebody that was like a little more barbaric than they were and settled them on either side of them so that they would have somebody to do their fighting for them. So, I mean, this is a thing that. It's a thing that happens."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":2046.4,"end":2078.88,"speaker":"Jonathan Pageau","text":"It can help you understand then that when you're dealing with this problem of identity, there are two things you want to do. One is you want to. You always have to understand the function of the fringe on the edge, because the fringe on the edge can sometimes be a little annoying. But if you get rid of it, there's a bigger fringe waiting for you behind it. So that's why you always have to be careful when you remove, say, the things that don't fit from your society. Because behind that are things that really don't fit. And not only don't fit, but actually want to devour you."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":2079.26,"end":2120.79,"speaker":"Richard Rohlin","text":"Yeah, yeah. So in the Roman Empire, the way this worked is they would, as these barbarian tribes invaded, they would fight them for a little bit and then eventually they would buy them off. They would buy them off and pay them to fight the next wave. And obviously there are a lot of historians. Gibbon is the most famous one who wrote the Decline and Fall of the Roman Empire. And he basically sees the, the decline and fall of the Roman Empire, which he really sees as being the Western Empire. He did not have any kind of a love for the east, but he, he basically sees the decline and fall of the Roman Empire as being a result of two things. One is Christianity coming and emasculating good Rome, you know, hard Roman virtue. Not a big fan of Christianity. Was, was, was given."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":2120.79,"end":2121.59,"speaker":"Jonathan Pageau","text":"Yes, we know that."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":2121.59,"end":2269,"speaker":"Richard Rohlin","text":"Yeah. And then, but then the other thing that he saw as being a major cause of the downfall of the empire was the way that they were hiring, the way that they weren't, you know, producing their own soldiers anymore. They kept hiring new barbarian mercenaries. But I mean, the sort of, the problem with that is that the thing I think Gibbon didn't understand super well is that this is just, this is the normal pattern. Like in America today, for instance, our military is an entirely volunteer force. Right. And of course, living in the United States and especially in the south, there is certainly a tendency to kind of glorify our military. Where I live, for instance, yesterday here from when we're recording this in the States was Memorial Day, which is a day to remember. And if you're an orthodox Christian, it's also a day to pray for fallen American soldiers. Nothing wrong with that. However, we sort of forget that historically the reality has been your army is not made up of your best people. Armies tend to be made up of the people who cannot fit in society otherwise. Right. Let's say the dog headed men in your society, those are the guys that you send out to fight the bigger monsters on the edge. Right. And so this is the same pattern, the same pattern that was happening in Rome during the late Republic period, but now it's just being extended further, right. As, as the Empire reaches its end. And so the big, the two biggest groups that come in, the first one is the Goths, who cause all kinds of trouble for Rome. They cause all kinds of trouble for Christianity in that the Goths are, when they were evangelized, they were primarily evangelized by Aryans you know, they were invading and coming into contact with Rome, really. Right. During that period of the Aryan controversy. So a lot of them were evangelized by Aryans, although also they. In an ironic twist, they also killed the last Aryan emperor in battle. So there you go. So they sort of solved that problem, but also caused another problem. And the Goths in Spain, particularly the Visigoths, remained. Remained Aryan for a really long time. And there's some people who believe or say that the filioque originated in Spain and the Iberian Peninsula as a way to kind of combat. This is a reaction to Arianism among the Visigoths. Yeah. Which is probably. Probably true. So all that to say you've got the Goths, and then behind the Goths come the last big, scary group of this long procession of barbarians, and that is the Huns. Right. So I think most people, like, even if you don't know the details of the Hun invasion of the Roman Empire, like, you probably have heard of Attila the Hun."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":2269,"end":2272.15,"speaker":"Jonathan Pageau","text":"You have images of Attila the Hun somewhere in your mind. Come on."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":2273.1,"end":2331.71,"speaker":"Richard Rohlin","text":"Yeah, right. Like, it's a. It's a. I mean, that is a cultural memory which has left such a deep scar in all peoples of Western European or Northern European descent, or Eastern European, for that matter. And I mean, the thing about the Huns is, like, we don't even totally know who they were. They were certainly a big confederation of tribes. But, for instance, a lot of the Hunnic names that we have, Attila being a good example, are actually Gothic. So basically, there were Goths fighting the Huns, but there were probably also a bunch of Goths among the Huns. Right. So at the very end, it was just this big conglomeration that had sort of picked up, had probably started in what is now Mongolia, but as it made its way across Eurasia and ended up in Western Europe, it had just picked up all of these other people groups as they went. So Attila's name. This is fun, actually is a Gothic word for little daddy. So it was like, probably like a term of endearment from his Gothic soldiers. Yeah, yeah."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":2331.71,"end":2333.79,"speaker":"Jonathan Pageau","text":"But he's also known as the Scourge of God."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":2333.95,"end":2351.15,"speaker":"Richard Rohlin","text":"Yeah, he's also known as the Scourge of God. Yeah. And I mean, it's one of the great moments in history is when he's invading, he's marching towards Rome, and the Pope goes out. Yeah, he goes out to meet him, and they have some kind of a conversation, and Attila turns around, turns around."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":2351.23,"end":2357.97,"speaker":"Jonathan Pageau","text":"It's so that's like, one of the most mysterious moments in history. You can't. Trying to understand what happened there. It's very difficult."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":2357.97,"end":2564.47,"speaker":"Richard Rohlin","text":"Yeah, yeah. I mean, really quite amazing. But something to say about Attila, and this will be also true for Genghis Khan much later in history, is that Attila was very conscious of the role that he was playing in terms of being this sort of left hand of God, right? So he. Let's say he leaned into this scourge of God identity, right? And of course, Attila had. Had grown up, let's say he was no stranger to Roman culture. He's no stranger to Christianity. There had been, like, some fostering and hostage swapping and things like that that had gone on during his childhood. So he'd spent a lot of time around Romans, and he had basically, like, foster brothers who were the sons of. Of Roman consuls and emperors and things like this. So he was no. No stranger to Roman culture, no stranger to Christianity. And he. And he was very familiar with, like, he understood the role that he was playing, and he really kind of leaned into it. And of course, he's eventually defeated and driven back at a very famous battle. But his invasion, I mean, that sets, you know, the earliest bit of Germanic poetry that we have, the earliest bit of Norse poetry that we have is this poem called the Battle of the Goths and the Huns. Like, it's the very. That's the very oldest bit of written poetry that we have, you know, from that society. So it left, like, a deep, deep memory in all of these different cultures. So much later on, you have the Mongols, and before we talk about the Mongols, this is a good place to introduce. So we have this idea of. We have this idea of Gog and Magog, right, coming out of the north, we also have this idea of Prester John. And we talked a little bit about Prester John at the end of the last video. The idea of Presser John is basically this idea of that there's this king who is in the extreme east or maybe the extreme south. Sometimes he's in Ethiopia, other times he's in India. And we talked about how, for the reasons for which those are kind of the same location in the Roman world and the title Prester in English, this is an adaptation of the Greek word for priest. It's a cognate with our own word priest. And the basic idea of Prester John is that he's this king of the east, but he's a priest king. Now, the whole priest king thing is a. This is One thing that tells you that he is legendary or mythical, but also that tells you that he sort of belongs to another world or like another more extreme world, because, like the, you know, there are lots of priest kings in the ancient world. And then in the. In the kingdom of Israel, the priesthood and the kingship, those get more or less permanently separated, and they are only actually unified in Christ. Right. And so the idea is that there's this Melchizedek priesthood. Is this really ancient priesthood. One of these days we should talk about Melchizedek, because there's all kinds of. Yeah, a lot of freaky legends, which maybe they can't. Maybe they cannot or should not talk about on Lord of Spirits, but we can definitely talk about in this context. There's some weird stuff around Melchizedek, man. But. So there's this idea that there's this king out there, this king in the east, and. And these legends are predicated on these ideas. The reason we laid all the groundwork we did last time. Right. Is because there's this idea. There was this fourth son of Noah who was enlightened, he went to the Far East. There is this king of India that was evangelized by the Apostle Thomas. Right. So there's all these different legends, especially in Syrian Christianity, of a king in the East. Yeah."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":2564.47,"end":2571.55,"speaker":"Jonathan Pageau","text":"So, but you can also understand that there were. That the Presser John figure is a. Is really a function, it's not an individual."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":2571.63,"end":2572.11,"speaker":"Richard Rohlin","text":"Yeah, yeah."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":2572.11,"end":2591.16,"speaker":"Jonathan Pageau","text":"This is because people are looking for him a thousand years later, like people. Christopher Columbus is still looking for Presser John or whatever. It really is something like this function that exists in the east of a Christian kingdom that we could be connected to."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":2591.32,"end":2775.93,"speaker":"Richard Rohlin","text":"Yeah. So like you just said, it's really important to understand that this is a role. Right. And so the fact that. So the actual legend of Prester John first materializes in probably starts to trickle in via oral accounts, especially during the Crusades, as people from Western Europe are going east a lot, but also just across the trade routes. These rumors have been trickling in for hundreds of years, but they're first written down in the 12th century in a chronicle, actually a work of universal history, a deliberate work of universal history by Artof of Freising in his Chronicon, which he wrote in about 1145. And just as a side note, I would love to actually, like, there's not a good translation of the chronicle into English, and maybe if I have just excessive amounts of free time, one of these days I'll try to do one, because I Think people might get a huge kick out of reading an actual work of medieval universal history and just see that we're not making any of this stuff up. But, yeah, so in his Chronicon, he recounts that he had met this guy named Hugh, and Hugh was the bishop of. Of basically the Crusader kingdom of Edessa. And so he was like a Western, like a Latin bishop in Syria at that time because of the Crusades. And he ran into Hugh at the court of Pope Eugene iii. And basically Hugh was on a. On an embassy that eventually results in Pope Eugene calling for the Second Crusade. But Hugh tells Otto, who is writing this all down in the Chronicle. He tells him that Prester John, who is this King of the east, who serves in the dual position of priest and king, had basically conquered the kingdom of, or the city of Ecbatana, which is a very, very important ancient Persian kingdom city, from that he'd conquered it from the Islamic caliphate in a great battle. So there's this rumor that there was this Christian king out there who's sort of eating away at the caliphate from. From the Eastern side. And. But what's. What's interesting is that Otto mentions in this account that he was supposed to then be marching out to rescue Jerusalem and conquer the Holy Land, but that the swollen waters of the Tigris river had forced him to return back to his own country. And there's a. An idea here that comes up again in some of the later Prester John accounts, which is there is this Christian King of the East. He's conquering. He's conquering the Caliphate, but he probably won't show up at Jerusalem anytime soon. So you can't count on his help. And I think that it was very important. Like they're trying to get Crusades going. You know, it's very important to say, listen, you can't just count on these guys to do it yourself. We got to do our bit, too. And there may have been some. For instance, there are several historians who have connected this with real historical events of when one of the khanates, one of the khanates, one of the Mongolian khanates, actually did defeat the Seljuk Turks in Persia in a pretty large battle about four years before this account. So there probably is like a historical event, you could say, that kind of ties into this."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":2776.17,"end":2785.06,"speaker":"Jonathan Pageau","text":"Yeah. So already people are going to hear that ends up being a connection between Professor John and the Mongols or the."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":2785.14,"end":2923.82,"speaker":"Richard Rohlin","text":"Step, and specifically between Prester John and what we could call the Nestorian Christians or the Church of the East. Under pressure, John So at this point, we should just say a little bit about this. Most people who follow the symbolic world are probably at least a little bit familiar with the fact that there was a major church council called the Council of Ephesus, which is also sometimes referred to as the Third Ecumenical Council. And it was at this ecumenical council that the theology of Nestorius, right, who said that Mary was not the mother of God, that she's only the mother of Christ, right. And so that she only, let's say, gave birth to his human nature, not his divine nature. And this churching was repudiated by the Church at the Council of Ephesus, specifically through the Theology of St. Cyril of Alexandria, who said, listen, mothers don't give birth to natures that give birth to persons. Right? Very simple. And so because of this, it is meet and right, one could say to call Mary the Theotokos, the. The mother of God, the one who gave birth to God. So the churches that rejected this, which were, you know, the majority of the churches that rejected this sort of fell outside of what was really the Roman Empire, the Roman world, the Roman sphere of influence at the time. The churches that rejected this became known as the. Either as the Nestorian Church, Nestorian Christians. And some people say that that's like a pejorative term. We shouldn't use that to talk about them. I mean, I don't know. I've talked to folks from the Church of the east who, you know, definitely consider Nestorius to be a saint, is one of their saints, and identify themselves as Nestorians. But some people prefer the term Church of the East. So whatever floats your boat, people. And so the Church of the Eastern Historian Church, this is basically the majority of Christians in Persia, what is modern day like Iraq, Iran, and going all the way to China. And so we talked last time, we talked last time about this, for instance, Raban Bar Salma, who's this Chinese monk who makes a pilgrimage all the way from Beijing to basically makes it as far as Paris, one of the longest overland journeys ever recorded, actually, and makes it to Paris. And while he's there in Paris, he actually communes King Edward the First at Mass. So, I mean, that's a pretty, pretty wild story."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":2923.9,"end":2929.98,"speaker":"Jonathan Pageau","text":"He was what we consider an historian. And the Christian missions in China were Nestorian."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":2930.22,"end":2978.89,"speaker":"Richard Rohlin","text":"Yes. Yeah. And there's a lot of really good documentation now about the. Basically, there was a relatively successful Nestorian mission where, you know, under a certain dynasty, under the Tang Dynasty, where Christianity was highly tolerated in ancient China. And so it grew and flourished. And you can like, look at early documents where it seems like they're really struggling to speak to the Chinese people in their own language. And then there are later documents where you can see they've done the. Basically the same thing that Christianity did with the language of Greek philosophy. They do that with like the language of Taoist philosophy and are able to. Are able to more successfully talk about Christ in a way that the Chinese people can kind of comprehend. And then there is a big wave of persecution and it almost gets completely wiped out. And then it has another resurgence under the Mongols."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":2979.05,"end":2987.45,"speaker":"Jonathan Pageau","text":"Part of the people associated with the Mongols that were part of the Mongol tribes would have been Nestorian. Certain sections, certain tribes, certain groups and they're the big kind of."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":2987.93,"end":3152.56,"speaker":"Richard Rohlin","text":"Yeah, the Nestorians were never a, they were never a majority in the Mongols, but there were, there were whole tribes of Mongols who were Nestorian Christians. You have the same kind of thing going on in early Roman history where it's like the majority of Romans aren't Christians, but there are like a suspicious number of wives and mothers of powerful Roman men who, who are. I don't know, it's like it's kind of a, kind of a thing about Christianity and mothers. I don't know. You know, it's. And so you have the same kind of thing happening in the Khanates. So there were, there were whole tribes of the Mongols who were Christians and actually marched to battle behind the sign of the cross. And this is actually, this is an important detail because this is one of the things there is in the 1160s, there's this letter that circulates called the letter of Prester John that circulates all throughout Western Europe. And it describes the glories of the kingdom of Prester John and his armies and things like this. And part of the reason that I spent so much time talking about the Alexander romance and the letter of Alexander to Aristotle in our previous video is because a lot of this letter is sort of, you could say cribbed from the Alexander stuff and some of his crib from other sources like the Acts of Thomas. Right. And so there's this, basically we, you know, you could say the Western world and I'm including like Constantinople in the Western world in this particular frame, had a vocabulary for talking about the great king of the East. And so they took that vocabulary and they used it to describe this, this sort of legendary figure of Prester John. But one of the things that's described in there is, you know, his, his armies marching to battle behind the sign of the cross. Which you can, you can see being like a kind of a comforting thing for crusaders and for other people who are fighting in the Middle east themselves, marching to battle behind the sign of the cross. And then they hear, hey, there's somebody else way over there who's doing that too. But, but there, there is a historical reality, like from a modern historical perspective, there's a reality behind that, which is there really were Mongols who were marching to battle behind the signs of the cross and lots and lots of famous descendants of Genghis Khan, for instance, several of his grandsons, sons in law, daughter in law, who is a Nestorian Christian. So there were lots of Nestorian Christians and actually one or two of these Nestorian Christian bishops who actually converted to Chalcedonian Christianity and did not go super well for them when they did that. But it is the thing that happened. So there's a lot more that could be said about this, but for our purpose purposes, it's just important to understand. Most people maybe don't know very much about the Mongols at all other than that, you know, they were scary and they invaded and Genghis Khan and like they've seen Mulan, you know, or whatever. Although I think in the Mulan cartoon they're actually fighting the Huns because that was like a less politically dangerous thing."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":3152.56,"end":3153.36,"speaker":"Jonathan Pageau","text":"Image to use."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":3153.52,"end":3177.1,"speaker":"Richard Rohlin","text":"Image to use. Yeah. But all this to say the, There was a significant Nestorian or Church of the East Christian minority among the Mongols during this entire period. And this led to lots of alliances between the land crusader kingdoms, or the, let's call them the Franks, because that's fun. But I mean, those alliances are called the Franco Mongolian alliance. Right."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":3177.66,"end":3190.94,"speaker":"Jonathan Pageau","text":"There's an embassy, there was an ambassador all the way to France, one of the Mongolian ambassadors. And there are texts, there are letters that you can read. And the king asks the ambassador, like, how's John doing? He's like, oh, he's doing fine."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":3191.5,"end":3191.82,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":3193.02,"end":3193.9,"speaker":"Jonathan Pageau","text":"That he exists."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":3193.98,"end":3231.04,"speaker":"Richard Rohlin","text":"It's not just that. Like, for instance, Doku's Khatun, who's the wife of Hulaga Khan and the mother of Abaca Khan, right. With Huluga Khan, Hulago, Hulagu Khan. There we go, being the guy that sacks Baghdad. Right. So this is his wife, she and her, her mom. I think I might have that wrong. It might have been her, one of her daughters. But they're referred to. No, it's, it's she and like a cousin or something that's another female relative of hers. They're referred to in letters to the French. And in letters to the Emperor of Constantinople, they are referred to as being the daughters of Prester John. And actually, do we know their parents?"}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":3231.04,"end":3232.08,"speaker":"Jonathan Pageau","text":"Who they're. Who they're."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":3232.08,"end":3255.13,"speaker":"Richard Rohlin","text":"I, I have no idea. But, but, but Doku's Khatun, who's Hulagu Khan's wife. Her son Abaku Khan marries Maria Paolo, the daughter of the Byzantine Emperor Michael viii. So literally at one point, there was a marriage alliance between the Mongolian Khanate and the. This."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":3255.29,"end":3258.53,"speaker":"Jonathan Pageau","text":"Yeah, Nestorian, basically a Nestorian and then."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":3258.53,"end":3266.69,"speaker":"Richard Rohlin","text":"A Byzantine princess, like. So at one point, the Khan was the son in law of the Byzantine emperor. Yeah, that's the thing that happened. Which is crazy. It's wild, right?"}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":3266.69,"end":3306.9,"speaker":"Jonathan Pageau","text":"Well, it can make you on, it can help you understand a little more what, what, what's going on or why it is that these types of legends, because they're difficult because they're so vague and they move around. That's why they appear also in this kind of mythological form, because there's something real that's happening. But it's also hard to point down because it's so slippery that it ends up boiling into this character. It's like, oh, we can't talk about all this. These weird Mongolian tribes and these Christians among them. It's like, okay, Presser John, this is the way we talk about it. And so it can help people understand also why things appear in mythological forms, because it's a way to talk about, talk about phenomena that it's sometimes hard to encapsulate."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":3306.9,"end":3330.2,"speaker":"Richard Rohlin","text":"Yeah. Because there's too much detail like, like even me trying to describe something like the Frankish Mongolian alliance or the Byzantine Mongolian alliances or the ways that they coordinated together to defeat the caliphate, and, you know, all this different stuff. Like, there's just too much detail. But I can basically just say Prester John, you know, like, like it kind of, it kind of actually encapsulates all of these different scenarios."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":3330.6,"end":3342.28,"speaker":"Jonathan Pageau","text":"And so one of the crazy things that, that we mentioned together before we started is that we have to remember that the apocalypse of Pseudo Methodius is also a Nestorian Assyrian type."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":3342.68,"end":3385.23,"speaker":"Richard Rohlin","text":"Not, Not Nestorian, but. Oh, it's not probably non Chalcedonian. Yeah, yeah. So you have the Third Ecumenical Council, which is rejected by the Nestorian churches. And then you had the Fourth Ecumenical Council, which is rejected by the groups we now call, like the Oriental Orthodox. That's a really recent label. Right. This would be like the Copts and the Ethiopians and the Armenians and, And also some of the other St. Thomas Christians are like the the Syrian versus Assyrian is how that's usually. Yeah, so you have like Syrians who are non Chalcedonian and then Assyrians who were. Who rejected the Council of Ephesus but did actually formally accept the Council of Chalcedon. So it's kind of an interesting kind of a thing."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":3385.47,"end":3389.95,"speaker":"Jonathan Pageau","text":"So then the apocalypse of Pseudo Methodes would have been the non Chalcedonian."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":3390.11,"end":3492.74,"speaker":"Richard Rohlin","text":"Yeah, yeah. Which, which again, we talked about this because in the apocalypse of Pseudo Methodius, the place where Byzantium and Ethiopia come back together happens at Chalcedon. Yeah, so. So all of this is to kind of say we should probably at this point talk about the really big place where this prophecy kind of comes to pass. Right. So this idea is you have these barbarian kingdoms out of the north, these monsters on the edge of the world. And if you just read the way that, for instance, the Muslim caliphates, the Umayyad Caliphate and the other ones, the way that they experienced the Mongols when the Mongols invaded, they understood the Mongols as being the wrath of God. And in fact, again, Genghis Khan, much like Attila the Hun, Genghis Khan leaned into this. So when he would show up to invade somewhere, there's this great quote, it's my favorite Genghis Khan quote. And it goes something like, your sins must have been really terrible for the God of Heaven to have set me loose upon you. Like just. Yeah, Even the really pro Christian, or at least Christian friendly cons, when they would send embassies to talk to the Pope or to the, you know, the King of France or something, they actually started out interacting mainly with the Pope. And then at some point they realized, I think it's actually the King of France that is running Europe. And so they switched to just talking to him. But they would send these embassies and they would be like, yeah, the God of Heaven has ordained that you're going to bow the knee before us. So you should probably get on with that. And we'd be more than happy to help you with your problem in the Middle east, but you should probably get on with, you know, sending tribute. Please address your tribute payments too. Here's the address. You know, kind of a thing really. I mean, even the, really, the friendliest Mongolian embassies were like this."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":3492.82,"end":3493.26,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":3493.26,"end":3555.67,"speaker":"Richard Rohlin","text":"You know, so they saw themselves, they saw themselves functioning in this kind of way as the left hand of God and they leaned into it. They saw themselves as the judgment of God or the gods. Mongolian society is pretty pluralistic sometimes. Sometimes. But they saw themselves basically as the Judgment of God on these different countries. And so this kind of culminates, for instance, in the destruction of Baghdad. And the destruction of Baghdad under Hulagu Khan is probably one of the most scarring and most complete military victories, genocides, in the history of humanity. Yeah. Unless you've read a lot of literature from this period, you cannot understand. I mean, the city of Baghdad was incredibly developed city, extremely wealthy, extremely advanced, extremely decadent, all these things and very powerful. And when it was destroyed, it was cataclysmic. You know, it was. It was analogous to the fall of Constantinople for the Muslim world. Yeah."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":3555.67,"end":3559.47,"speaker":"Jonathan Pageau","text":"But even much worse because it actually was raised to the ground."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":3559.88,"end":3560.16,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":3560.16,"end":3564.68,"speaker":"Jonathan Pageau","text":"Libraries were burned. They were like, you know, mounds of skulls. Like, it was just insane."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":3564.92,"end":3653.87,"speaker":"Richard Rohlin","text":"Yeah. I'm not even going to describe the atrocities because they were really bad, but you can go and look this stuff up. Yeah. I mean, just like, somebody did the math one time on how many. I mean, this. Here's the thing about the Mongols. Like, people don't understand. The Romans were also good at this, is. Is that the Mongols and the Romans both worked out because you'll read they massacred this many people, this many tens of thousands of people over this many hours. So then, like, you'd have to start, like, you can do the math on that and figure how many people per hour would you have to kill to massacre that number of people? And you realize that at some point, these people, I mean, the Mongols were not. At some point, they figured out the most efficient ways of quickly killing large numbers of people. I don't know how to say it. Like. Like we're talking genocides. Yeah. Unprecedented in human history up to that point. Yeah. So somebody's done the math on the siege of Baghdad and, like, how many people they had to be slaughtering per hour. But one of the things that happens in the siege of Baghdad is that Doku's Khatun, you know, this Christian wife of the Khan, she intercedes on the behalf of the Nestorian Christians living in the city of Baghdad at the time, and they are largely spared the destruction. I don't think they're totally spared. I mean, you know, sacking a city is real messy, Jonathan. But they are largely spared the destruction of the city. So this is a way that this, this, this. You say this legend of Prester John manifested itself in this kind of ultimate or final way."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":3653.95,"end":3656.07,"speaker":"Jonathan Pageau","text":"Yeah, it's really kind of dark way, but."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":3656.07,"end":3678.18,"speaker":"Richard Rohlin","text":"Yeah, in a dark way. Yeah. And I will say after this, the Mongols and the Byzantines and the Franks, like, did continue to work together. And there are differing, you know, over the next two or three generations, and there are kind of differing perspectives from modern day scholars and historians as to how effective their efforts were or were not. But if people want to read about that stuff, they can, they can go out and look it up."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":3678.18,"end":3688.06,"speaker":"Jonathan Pageau","text":"So it's important for people to understand that there are images of Hulagu and his wife, or Hulagu and his mother, I think, that are represented as Constantine."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":3688.06,"end":3689.74,"speaker":"Richard Rohlin","text":"And Helen holding a cross."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":3689.74,"end":3691.14,"speaker":"Jonathan Pageau","text":"Holding a cross in the center."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":3691.53,"end":3741.98,"speaker":"Richard Rohlin","text":"Yeah, yeah. I mean, again, this is wild stuff. And people should not for a moment take away that, you know, like we're endorsing something like genocide in the name of Christ. Right. Or something like that. Because it's not at all. A, that's not at all what we're talking about, and B, like, you would just have to understand this is the symbolism of the edge, like the gates of Alexander being open. This is what happens. And it's something that happened historically. And, you know, obviously in this dark and terrible way, it was an awful, awful time for probably everyone involved, but it did happen. And the way that from the perspective this Jerusalem centric perspective of history that we've been talking about, of understanding the world, the way that they described that was through these legends of Prester John, this King of the east, this Christian king of the east, which, by the way, Hulagu Khan himself was not a Christian."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":3741.98,"end":3742.38,"speaker":"Jonathan Pageau","text":"No."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":3742.62,"end":3760.83,"speaker":"Richard Rohlin","text":"In fact, he was a shamanist and converted probably to Buddhism at the end of his life, despite the wishes of his wife. So he wasn't a Christian. Nobody's really saying he was, but he was participating in this pattern of Prester John that was so important to the sort of, you could say, Franco Byzantine world at the time."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":3761.55,"end":3902.06,"speaker":"Jonathan Pageau","text":"So the last thing I want to mention, maybe before we finish, is that there is also an interesting and important understanding of this kind of wind or fire that comes from the north. And when we talk about how it is both a force of destruction but also a force of renewal, is a way that we can also see if we look at the historical precedent of how that works. So you can see that what happens when the people come down from the north usually is that they bring something like strength, but they don't bring identity. Their identity is mixed, their identity is confused. It's a mixture of tribes, it's a mixture of religions. It's all this kind of wild chaos. And then they come in from the north, they destroy, and then they usually become fertile ground for something new. And what ends up happening is that the strength of these northern invaders gets taken up by the identity of the people they invaded. And that's like the weirdest thing, but it's important to understand that. So when the Germanic Goths and all these Germanic people come down and try to destroy Rome, they end up becoming the defenders of Rome and end up becoming the continuation of the Roman Empire. When Charlemagne becomes Roman Empire and all these northern people kind of take up the Roman identity, we see the same when the Vikings are coming down, they're given Normandy, they convert to Christianity, and then they become the place of strength for Western Europe becomes in Normandy, and the Normans become the strength. We see the same with the Russians. Scandinavians come down to Russia, they convert to Orthodox Christianity. The same with the Mongols. The Mongols come down, they become the emperors of China, they become the emperors of India, they become all these powerful figures, but that don't actually preserve their Mongolian identity, end up taking up the identity of Islam or of Buddhism or of the different groups that they encounter. This is a type of interaction that we often struggle to understand. We don't think in these terms, but it's important to see that this is a type of interaction which is possible and which exists. And also understanding that strength and identity are not the same thing, power and identity are not the same things. And that sometimes even a minority that has identity can take over a very, very powerful group. It's not just about strength and about military might."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":3902.38,"end":3958.91,"speaker":"Richard Rohlin","text":"Yeah, I mean, there's a plethora of historical examples of this where you have a, a small but powerful minority who brings in strength and then adopts the, adopts the identity of the larger group, such as they become like the new guardians of what it really means to, to, to fully embody that identity. There's a whole string. All the best emperors of a certain period of the Roman Empire were Illyrians, who are all barbarians, but they were skilled generals, they were effective leaders. And so what they were able to do is actually embody Roman identity in a way that the Romans themselves had lost the ability to, to do. There are lots of other examples of this as well that you can find throughout history. And yeah, I mean, it's important to say that the Khanate, the Ilkhanate, destroyed Baghdad, but the Golden Horde, which is the longest lasting remnant or the longest lasting part of the Mongolian empire, and of course obviously ruled over, you know, Russia and lots of other Orthodox territories for a long time. And then there's the Turks."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":3958.99,"end":3960.27,"speaker":"Jonathan Pageau","text":"The Turks are the same."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":3960.83,"end":4014.05,"speaker":"Richard Rohlin","text":"Yeah. But the Golden Horde was Muslim. Right. They. They adopted. They eventually adopted the identity of the people that they conquered. And, I mean, this is. This is powerful even within Christianity right now. Right. Not just in Orthodoxy, but in pretty much every kind of Christianity that is sees itself in a traditional way. Let's say we have lots of people who are coming in from really difficult backgrounds, really rough backgrounds, who were not Christians before, who were not. Who were maybe even the enemies of Christianity before. And then as they're converting, they're becoming really vocal defenders of their faith. And maybe not always in the. You know, people who have been Christians a long time are like, oh, man, I don't. You shouldn't talk to people that way, or something like that, you know, but we need to understand what's going on here, that this is actually something that's really vital and important in terms of how we are sort of, you could say, like this new strength, this new potential that's coming into Christianity right at this moment. Yeah."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":4015.18,"end":4025.26,"speaker":"Jonathan Pageau","text":"All right, folks, I think we've done enough talking about the crazy history of Gog and Magog, so everything. Is there a last thing you want to say, Richard, before we go?"}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":4025.66,"end":4165.53,"speaker":"Richard Rohlin","text":"Yeah, it's just. I think something I'd like to circle back on a little bit is in our previous video, one of the things that you mentioned that I think is worth really thinking about is, and it relates to what you just said about strength encountering identity is that the most honest and sincere way to encounter the edge is to fully embody the identity of the thing that you belong to as we. You know, many of your viewers are Christians. And so I'll just speak to Christians for a moment. As we are encountering, you know, the monsters on the edge of the world, this strange place of hybridity that we're moving into, this influx of new converts to Christianity, which I am all for. This influx of new converts to Christianity, this influx of. Of new ways of. I mean, the Internet itself, the fact that you're listening to this video on YouTube, guys, that's. That's a weird thing, right? That's a thing that's happening kind of, you know, the ways that the Internet sort of functions as the. As the end of the world, right? As we're doing all of this, the best thing that we can do, the most powerful thing we can do as we encounter all of these things at the edge, is not to, like, freak out or panic. It's not to try to, you know, exclude other people from the gospel who really desire it, really need it, because, you know, they're going to lower the property value, so to speak, of our neighborhood, things like this. The most important thing that we can do is to fully embody Christ, right? And the way, the way that we do this, I mean, this is the big paradox of Christianity is that, you know, Christ says that, you know, at the last judgment, we're going to stand before him and he's going to say, hey, why didn't you visit me when I was in prison? Right? Why didn't you feed me when I was hungry? Why didn't you clothe me when I was naked? And we're going to say, lord, we never encountered you in any of those situations because we weren't looking for you out there. And so this is the thing, as we encounter this stuff, we need to fully embody our identity as Christians. Go to liturgy, read the lives of the saints, be a Christian as thoroughly and as authentically as you can be. Because it's the only way that as we encounter the destructive forces of the culture around us, that's the only way that we're going to kind of survive that. And we might not survive it in terms of keeping the empires we've been trying to build for ourselves, but Christianity always wins through martyrdom."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":4166.41,"end":4171.65,"speaker":"Jonathan Pageau","text":"All right, everybody, on that note, thanks for your attention. And we'll be back with more, with."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":4171.65,"end":4173.82,"speaker":"Richard Rohlin","text":"More universal history very soon. Bye. Bye."}
{"episode_id":"SW - #241 - 2022-07-08 - Richard Rohlin - Universal History - The Hordes of Gog and Magog","start":4174.06,"end":4236.1,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is, it's quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon, the Pageau videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
