{"episode_id":"SW - #378 - 2025-02-26 - Richard Rohlin - Tolkien and Universal History","start":0.16,"end":2903.22,"speaker":"Richard Rohlin","text":"In that way, we can kind of see what Tolkien is doing as this great project to create a body of stories for the English that has room for someone like him. So Tolkien begins this project. And what I want to argue and lay out to you is that Tolkien's project is a perfect test case, a proof case, a demonstration, a practical demonstration of how we as modern people can use the themes that we've been talking about in Universal history to tell stories and kind of reclaim a mythical cosmic vision of Christian storytelling. This is Jonathan Peugeot. Welcome to the Symbolic World. Hello, my name is Richard Roland with Symbolic World Press, and you may be wondering a couple of things, like, for instance, where is Jonathan Peugeot? Well, the answer to that question is that he's on the road and can't come to the camera right now. You may also be wondering exactly where I am. I don't have my normal background here that you're probably used to seeing if you watch the Universal History videos that Jonathan and I do together. So some people refer to it as my Greek diner background, but actually, no, I'm in the new recording studio and it's not finished yet, as you can see. I still have. Well, you know, it's got walls and that's about it. But I'm really excited about what this studio is going to allow me to do for Symbolic World. We're going to be taping, embedding walls and painting them and installing studio lighting, and there's going to be awesome bookshelf back there. And that's the only way that you'll know I'm actually an intellectual, is if you can see the bookshelf behind me when I talk. So, in all seriousness, I am here today solo, not at all nervous about it, thank you for asking. But I'm here today solo, to talk about a subject that's near and dear to my heart. And then also a new course. It'll actually be our next course for Symbolic World courses, and I'm going to be teaching it and it's going to be awesome. So, without beating around the bush, the course is called Tolkien and Universal History. And the tagline is a little. It's a little cheeky, actually, in ways that most people won't catch, because the tagline is the Symbolic World goes to Middle Earth. But of course, if you know anything about Anglo Saxon culture, Old Norse culture, if you know anything about Jonathan's whole ideas of the Symbolic world. Right. You'll know, of course, that Middle Earth is our earth, the Earth on which we live. This. This realm between heaven and the world below. And you'll know that that is, of course, the symbolic world, the kind of cosmological project that Jonathan has been undertaking on this channel for the last several years. So the symbolic world goes to Middle Earth. Think of it as a return to yourself, a return to your roots. And in some ways, I want to kind of pick up the. Well, I can't pick up the mantle that Dr. Martin sh. Because I'm not going to be able to do it the way that he did it. But I'm going to do it the way that I can do it. And hopefully some of you will be on board for that. So let me talk about this course and introduce this idea, this Venn diagram overlap of Tolkien and his legendarium and universal history. I think that we all know that Tolkien accomplished something in his lifetime and in his storytelling endeavors that basically is unique. Nobody really, since Tolkien's time, has been able to do the things that he did. And I'm not saying there aren't some good ones out there. As a little, kind of a sneak preview, sometime later this year, I intend to do a course on modern fantasy with Father Deacon Nicholas Cotar. In fact, this course is sort of the dipping the toe in the water to see what the interest level is for this kind of thing on the symbolic world. And when we do that, we're going to look at fantasy after Tolkien and what's the good stuff, what's the bad stuff? But I think one of the questions that you'd have to ask is why have we really struggled to put out anything with the same enduring quality as the Lord of the Rings? Let me explain what I mean by that. Obviously, there's other fantasy. I'm a huge fan, for instance, of Jonathan Strange and Mr. Norrell by Susanna Clarke. That's a really delightful book that you should all read if you haven't read, and definitely one that we'll be covering in our course on modern fantasy. Obviously, I'm a huge fan of the Narnia books and I'm a huge fan of some other things that have come out in the fantasy genre since Tolkien's time. There's also, obviously, you could say, books like Harry Potter series like Harry Potter, which. Which I don't hate, so don't come at me. Potter heads. What do you call yourselves? Anyway, I don't hate Harry Potter, but it's not my favorite thing. And obviously there are some fantasy series, like the Wheel of Time, so on, have been successful just in terms of selling books and making money for their authors. Right. Obviously, J.K. rowling is fabulously wealthy, but the success of a book is really measured by how long will it endure? What is its enduring quality? Will people continue to read it in 100 years, in 200 years, in 500 years? Well, I can't really predict what people will be reading in 500 years, or if people even still know how to read in 500 years for that matter. But I feel pretty confident saying that Tolkien's Lord of the Rings will be read 100 years after its publication and probably 200 years after its publication. Narnia, I think, will continue to be read for 100 years after its publication. Will it make it to the 2, 300 year mark? I'm not sure. And a lot of other things published in the last century, things that you could say published since the Hobbit came out, let's say that's the kind of the beginning. It's not the first work of Christian fantasy literature, but it's a helpful kind of mark. For the first time, somebody realized this was going to be really commercially successful. Not that the Hobbit sold a lot of copies by modern standards, but it was basically a bestseller by the standards of its time. All this to say when I say that people have struggled to imitate Tolkien. What I mean is that when people write books, tell stories, and they try to do it in the same vein that Tolkien did it, everybody sort of feels like, oh, there's some kind of a formula that Tolkien laid out. It's got to have the elves, it's got to have the dwarves, it's got to have the halflings, it's got to have the, you know, things like that, things of that nature. And. But what ends up happening is that his imitators, and I'm very sorry to say sometimes it feels like especially his more overtly Christian imitators fall apart. And here is a serious challenge to things that I've said and things that other people have said. I mean, for instance, on the Aman Sul podcast, which I was the co host of for several years, which is that the key to understanding Tolkien's Middle Earth is his deep Catholicism. Now, I still believe that's true, but if that were the only thing going on, obviously the idea would be that, well, you could have a lot more of this sort of thing going on. So I think that one of the missing keys here is the connection between Tolkien and what he's doing and universal history. So I want to read a little excerpt to you from something Tolkien fans are already aware of. It's called the Letter to Milton Waldman, or, if you're a nerd, letter 131. So Tolkien's letters were collected. They were numbered. So letter 131 is the famous Milton Waldman letter, which something in its original, something like 10,000 words. I mean, it's basically a short novel, and it's kind of a pitch or a sketch for the mythology. The thing that Tolkien is doing, the thing that we now refer to as his legendarium, by the way, the other day I had a conversation with John Huers over on his channel, which is now called Heavy Things Lightly. I kind of like the why Are We Talking about Rabbits? Title. But in any case, that's what he's renamed the show to. And if you were there at the Symbolic World Summit, oh, my goodness, almost a year ago now, if you were there at the Symbolic World Summit, you'll know that he roasted basically everybody who was presenting there at the summit, including Jonathan Pageau and Father Steven DeYoung and so on. And then he had a roast for me, and he forgot it. But apparently his roast, which I've been trying to get out of him ever since, was something about people who use words like legendarium and just assume that everybody knows what you're talking about. So the term legendarium is a term that we use kind of in Tolkien circles, people who are fans, people who are scholars of Tolkien's writings to refer to Tolkien's works around Arda, around Middle Earth as a whole. So he kind of gives a sketch for the legendarium in this letter, and this is what he says. I had a mind to make a body of more or less connected legend, ranging from the large and cosmogonic to the level of romantic fairy story, the larger, founded on the Lesser in contact with the Earth, the Lesser drawing splendor from the vast backcloths, which I could dedicate simply to England, to my country. I would draw some of the great tales in fullness and leave many only placed in the scheme and sketched. The cycles should be linked to a majestic whole, and yet leave scope for other minds and hands, wielding paintings and music and drama. So this is Tolkien's kind of original conception when he starts working on a legendarium, or at least this is how he is remembering it when he's writing this letter in 1951. Tolkien's recollections, if you study him closely, you'll see are not always 100% accurate, as most of ours aren't. Or at least he may get the spirit of something. But doesn't quite nail all the facts because it's been several years and he's going off of memory now. He goes right after this to say, my crest has long since fallen. In other words, he feels like he was probably biting off more than he could chew in those days, and now he's really just hoping to get the Silmarillion published. That's the context for this letter. So this idea, though, right, does not focus on where Tolkien feels like he succeeded or failed, but rather on what the initial. What the initial play was, what the initial goal was. To build a body of connected legend. You've got cosmic stories, and then also what he calls romantic fairy stories. So a romance story is like an adventure story. And a fairy story has. Well, technically, for our purposes today, it has fairies in it, or elves, as Tolkien later calls them. The larger founded on the Lesser in contact with the Earth, and the Lesser drawing splendor from the vast backclaws. And by the way, usually we'd think it would be the other way around. You would start with the larger stories, like the big cosmic stuff. Usually the first time anybody sits down to imitate Tolkien, the first thing they do is try to rewrite their own version of Tolkien's creation story, the Ainu Lindale. And actually what Tolkien is saying is that the larger stuff, the larger cosmic stuff, is actually founded on the Lesser in contact with the Earth. But then that the Lesser draws splendor from the vast backcloths. Exactly what he meant by this. The Lesser in contact with the Earth is something that we will be exploring in this new course. He says, I would draw some from the great tales in fullness and leave many only placed in the scheme and sketched. And, of course, the whole thing is supposed to be dedicated, quite simply, as he says, to my country, to England. Now, why would he say this in this particular way? People who are aware or have read, you know, the rest of this letter will know that one of the things that Tolkien does in this letter and in some of the other places that he writes is that he is critical of the Arthurian legends, what's very commonly called the matter of Britain, which we've spoken about here on the Symbolic World and in fact, over on the Grey Tales podcast, which is a new podcast I'm doing here on YouTube with Father Andrew Stephen Damick. We're actually right in the middle of a series on the Grail. If you're a longtime Universal history listener, you'll be familiar with most of the content, although there is some new stuff so why is Tolkien critical? In fact, Tolkien says something that's a little shocking and scandalous. And certainly later readers of Tolkien, especially readers who are of kind of like a neo pagan or, you know, an atheist or, you know, just want to make the story into a secular story. People of that kind of bent will take things that Tolkien said about the Arthurian legends and how they are sort of fatally Christian, right? And they'll say, oh, look, see, Tolkien didn't want religion, he didn't want Christianity. He wasn't. I've seen people go so far as to say, and this is absolutely not true, and it is easily falsifiable, but I've seen people go so far as to say that Tolkien wasn't really a Christian, he was just kind of culturally Catholic, but he was actually really kind of like a secret pagan or a crypto pagan. Well, as I said, this is easily falsifiable. Nothing could be further from the truth. And in fact, I think that it needs to be remembered that to have been a Roman Catholic in England when Tolkien lived, especially when he was young, was. Was not a culturally easy or simple thing. And here, I think, is where we can kind of understand what he means when he talks about his sort of problems with the Arthurian legends, although he will actually try to rewrite them and incorporate them into Middle Earth. That's also something we'll talk about in the course. But the Arthurian legends and especially the legend concerning Joseph of Arimathea, which is a late addition to the matter of Britain, but is a very important part of later retellings. This, this legend that Joseph of Arimathea came to, that he came to the island of Britain with the infant Christ, right? And, you know, left the Round Table there, among other things, maybe brought the Holy Grail there later on. And anyway, this, this set of legends was a very important part of the English Reformation because essentially what, what Elizabeth's court theologians did is they used it as basically proof when they were talking to the ambassadors from Rome, they used it, cited it as an example, to say that actually there have been Christians in Britain longer than there's been Christians in Rome, and therefore that the British Church or the English Church was something that was kind of separate from and had its own claims to apostolic succession that didn't have anything to do with Rome or the authority of the Pope. So the Arthurian material in Britain when Tolkien was growing up, and of course, notice by the way that Tolkien says England, not Britain, I don't want to get into this right now. It's a whole thing. But it's funny because Tolkien certainly wasn't anti Celtic. He really feels this deep affinity with Welsh culture and language. And in fact, one of his invented languages, which we're going to spend quite a bit of time talking about in the course, one of his invented languages is based heavily upon the phenomenon, chronology of medieval Welsh. But in any case, he says England, not Britain. In Tolkien's life lifetime, the, the, the Arthurian material had become very, very closely associated with the Church of England and Tolkien as a Roman Catholic. And, and it should be said he was the. The son of a woman who had converted to Roman Catholicism and then been essentially abandoned by her family after doing so. And so when his father died, she died very quickly after. And Tolkien, through the rest of his life, always considered his mother to have been a martyr for the faith. This is how he thought about her. And so there seems to have been kind of maybe some difficulty there, some distance that Tolkien felt between himself and the Arthurian stories that I think has something to do with also the distance that he felt from the distance that he felt from the Church of England and the ways that English legends have been kind of used to sort of bolster the claims of the Church of England in the early modern period against the Roman Catholic Church. This is something I haven't really actually talked about a lot, but Tolkien does write about it some in his letters, and we'll get into a little bit of this in the course, but you can also kind of read between the lines in some of his interactions with Lewis. So there's always this gulf between them because that Lewis couldn't cross and that Tolkien always felt, and this is what he said, he always felt like there was something that was really keeping Louis from entering wholeheartedly into the Middle Ages and wholeheartedly into the kind of storytelling that Tolkien liked. Now, I want to just hasten to say that Lewis was an extremely generous friend, but this does seem to have been kind of a gulf that existed between them. So in that way, we can kind of see what Tolkien is doing as this great project to create a body of stories for the English that has room for someone like him. I mean, the situation when Tolkien was at Oxford was that the Catholics had to sit down at the bottom of the. You know, if you're in the dining hall, like, they would put the Catholics and the Jews at the far table at the end of the hall. Right. And so Tolkien definitely experienced discrimination, and he definitely experienced, you know, quite a bit of difficulty during his life. Just owing to the kind of the latent prejudice against Roman Catholics that was still going on in England at the time. So Tolkien begins this project. And what I want to kind of argue and lay out to you is that Tolkien's project is a perfect test case, a proof case, a demonstration, a practical demonstration of how we as modern people can use the themes that we've been talking about in universal history to tell stories and kind of reclaim a mythical cosmic vision of Christian storytelling. There have been a lot of really great Christian. There was a lot of great Christian literature written in the 19th and the 20th century, a lot of great Catholic literature, a lot of great orthodox literature, a lot of great Protestant literature. But most of it was what we would now consider to be literary fiction, which is kind of a snot term, and I don't really care for it personally, but basically these are realistic stories about realistic people and kind of realistic situations, or at least ostensibly realistic situations. But what Tolkien did is he took the fairy tale. He took the fairy tale and sort of the genre of Christian fairy tale and what we would maybe now call Christian fantasy. Although it really begins with a guy named George MacDonald, who. We have a book, Symbolic World Press has a book about him and other Christian fantasy authors coming out later this year. It's called Finding the Golden Key. Essays Towards Recovering the Sacramental Imagination. Nice long, catchy title, and it's going to be really beautiful. We've got the art done for it by Hugh Rose, and the essays are all in. And we're just in the final stage of editing and layout, so I hope to have a good announcement on that book soon. But in any case, George MacDonald kind of begins that genre of storytelling, you know, as a. As a Christian mode, you could say of storytelling. He's the grandfather. Sometimes people call him the grandfather of the inklings. MacDonald's works probably don't quite rise to the level of fantasy. The way that we think about it today, where it's like this totally, you know, it's like. Like it's an otherworld with distinct races and cultures. And, you know, the level of world building that Tolkien does, which basically becomes the gold standard for fantasy from that point forward, is really does begin with Tolkien. And what I want to kind of argue is that he does this as an attempt to create a work of universal history. This concept, this concept that I just read to you from the Waldman letter is sometimes called. Tolkien never called it this, by the way, but some of his biographers and Tolkien scholars have called it his idea of a mythology for England. I don't totally like that nomenclature for a couple of reasons, which we'll talk about in the course. But what I want to basically just suggest is that the idea of it being a universal history for England is maybe a better idea and takes into account the scope and the kinds of stories that Tolkien was trying to tell better than the idea of it being a mythology. So I'll explain more about that. I'll try to justify that in the course. But that's the basic idea. I think that Tolkien shows us the way that we can use universal history to recover a Christian mythic storytelling. So one of the main things that Tolkien is doing is, of course, that he's trying to. Well, one of the things he's doing is he's trying to rehabilitate the elves. He's trying to rehabilitate the fairies. He's trying to rehabilitate these. These kind of ambiguous figures that are there in the back of the English consciousness and the British consciousness, who are sometimes good, sometimes bad, sometimes helpful, always dangerous, and certainly occupy this ambiguous place in legend. And Tolkien knows this. And Tolkien tries to rehabilitate them while also retaining their sense of danger. And in some respects, he's been too successful, because, as everybody knows, elves are extremely dangerous. And Tolkien's elves are so beautiful and great and wonderful that people often forget that elves are extremely dangerous. And so in subsequent stories imitating them, the elves are much more positive figures very often. But it's one of the things that I love about Tolkien, and you get this in Lewis as well, is the idea that something could be beautiful and dangerous. Right. But we talked about this, I think, a little bit in the Beowulf course. But there is, at the beginning of the Beowulf poem, or towards the beginning of the Beowulf poem, there's a list of the evil creatures, the monsters descended from the line of Cain. Some of them are orcs and elves. And so what Tolkien does is he tries to actually draw a distinction between those two things and says, hey, all these guys got lumped together. And you're not wrong to think they're related in some way. But there is a sort of good. A good fairy or a good elf, or at least one that has goals and desires that are not totally or should not be totally abhorrent to human beings. So this is one of the things that he does, and the way that he basically does it is to take these elements from the pagan mythologies and the sort of the pre Christian mythologies, and then also the kind of like the surviving folk, you could say, like surviving folk religion or surviving folk beliefs about fairies, dwarves, elves, ogres, et cetera, and tries to take those things and kind of synthesize them into a philological framework. Now, I'll come back to the idea of the framework in a moment, but I think that this is a particularly sort of universal history move, right? One of the things that universal history is always trying to do is to say, how can I take my pre Christian past? How can I take my pagan ancestors? How can I take the things that came before me which are not totally compatible with the holy scriptures, and weave them into the Christian story in a way that's still faithful? And people who don't like this sort of thing will accuse it of being syncretism, for instance. That's not totally wrong. But also the thing that I want to sort of say to you is that that's a natural Christian impulse, actually, is to take the good things. Take the good things. As St. Basil in his address to young men on the proper use of Greek poetry, right? This idea of being the bee, right, Looking for the honey, taking the good things that are there in the stories of our ancestors and bringing them into the Christian world. So Tolkien does that and he tries to weave them into a framework that is still compatible with his sense of what Christianity is, and he will try to accomplish this. Oh, and I should also mention that one of the other things that Tolkien does that is really vital actually for modern Christians is that he doesn't just rehabilitate the elves, he rehabilitates the gods. Right? Tolkien's valar are a way, probably one of the easiest ways for modern Christians, if you like these sort of stories, for modern Christians to understand the whole idea of principalities and powers and how it could be that God would use something like an angel or a saint to rule over the world. So Tolkien takes the elves, he takes the gods, he takes these. These sort of old world ideas that. That really are part of Christianity but have been kind of forgotten by the modern world. And he uses his stories to kind of weave them back into the framework. And he accomplishes this through several kinds of, let's call them, medieval media or genres. And so the first is the genre of the chronicle. So there are some famous chronicles in the Middle Ages. Chronicles are one of the main genres that literary people are interested in during the Middle Ages. Some famous examples that you probably heard of are things like the Anglo Saxon Chronicle or the Russian Primary chronicle, both of which I have talked about in various places, including on this channel. And Tolkien actually takes this and he makes a series of chronicles, some of them actually written in Anglo Saxon, not just in Anglo Saxon, but in the Mercian dialect of Anglo Saxon, and actually writes these chronicles in Anglo Saxon. For his invented history. I won't say he's invented world, because one of the really surprising things is that Tolkien obviously intends. This is what he says right up front, obviously intends that his entire story is set in our world and that it is a sort of pre Christian history of Northern Europe. And the startling thing, and I still remember how upsetting and discombobulating it was when I learned this and realized this for the first time, the startling thing is that, that Tolkien never abandoned that idea. And in fact, there are references, very small, hidden, veiled references. When Tolkien says that the Lord of the Rings is a fundamentally catholic work, he means down at the foundations, right? You've got to dig to get there. But there are references even to the incarnation in the Lord of the Rings. And there's at least one, maybe more. You can look for it. Tell me if you find it. Otherwise, come to the course and I'll tell you. All right. So he does this through his annals or chronicles. He does this through the writing of epic poetry. Tolkien, of course, knew that real men tell long form narrative poems, that that's the best kind of storytelling. And anything less than that is a compromise. And Tolkien spent most of his early years of the legendarium trying to write these long form epic poems. Alas, he never finished any of them. We're probably better off that he didn't because if he had, he probably wouldn't have written the Lord of the Rings and then most of us just would not have heard of him. Long form narrative poetry doesn't sell super well. It's not, you know, it's just not. You know, maybe it's making a comeback. You know, we're getting like two Odyssey movies now, and so maybe it's making a comeback. Maybe we will get to. We'll get to see and celebrate the revival of long form epic poetry, long form narrative poetry. And if we do, I am here for it. All of my training has prepared me for this moment. So in any case, epic poems, in fact, there is some indication that the Silmarillion. So if, by the way, if you're like a normal person and you don't know a lot about Tolkien and you've just joined us and you're like, what the heck is this guy talking about? Welcome, welcome. See my published works, I guess. Seriously, come to the course, this course will be approachable, by the way, if you're not a super Tolkien nerd, this course will be approachable for you. I'm going to lay everything out and actually it'll be in some ways easier if you're not a super Tolkien nerd, because then you won't have as many preconceptions that we'll need to work through. Okay, so there is some indication though that the Silmarillion. So the Silmarillion tells the story of basically the history of Tolkien world about, you know, 7,000 ish years before the events of the Lord of the Rings. It is, as some people have said, certainly as I have often said, is basically the Lord of the Rings equivalent of the Old Testament. And it's basically it's a series of long chapters and each chapter is kind of a self contained story that's then part of a larger whole. But there is some indication that those chapters that are in the modern Silmarillion, the published Silmarillion, which by the way was published after Tolkien's death, there's some indication that those chapters were actually intended just to be the prose summaries and that each chapter would cover a different long form narrative, like a long form epic poem. Well, Tolkien never finished all of those. He didn't even finish half of them. But the ones that we do have that are in various states of incompletion are quite fascinating and we will be looking at them. And the thing that I want to look at is what makes a chronicle, what makes an epic poem? And then how does Tolkien try to use that as actually a way of doing what now we call world building? We have this idea that when Tolkien was sitting down, or let's say when most of us sit down to do world building or I mean, I'm guessing of the thousands of people watching this video, at least 80% of you have the secret unfinished fantasy novel or the D and D world or something like that. And most of the time when people I sit down to do world building, they start out with basically just sort of saying, okay, I'm going to basically write a series of Wikipedia articles on my world, or I'm going to just write out the history of the world from the beginning, or I'm going to design this race and then I'm going to design that race. Or I'm going to design. The thing that's really in vogue right now are magic systems that basically work like science and have scientific levels of accuracy and precision to them. So anyway, that's not how Tolkien worked at all. The way that Tolkien worked was by sort of mimetic storytelling. He would read stories that he liked, medieval stories that he liked, ancient stories that he liked, things like the tale of Kullervo, the Brittonic Lays, the obviously the sagas of the Icelanders, Beowulf, things like that. He would read stories that he liked and then he would do. The way that he would work and the way that he would sort of build his world is he would sit down and he would try to write a story like that story, but in his own world. And along the way, he would sometimes tweak or fix or completely reverse or flip things about the story that maybe he didn't like or he thought he could tell them better. One of the things you need to be a successful author is a fair amount of hubris. So the other thing that Tolkien does that's really key to understanding, and I would say it's probably the linchpin to understanding the connection between his legendarium and the whole concept of universal history, is his retelling of culture founding epics or culture founding narratives. And these have to do with culture founding heroes, people like shield shaving, if you were in our Beowulf class, people like you can go to ancient mythology and find figures like Orpheus, figures like Apollo, figures like Horus, who are sort of culture heroes, people who sort of bring the wisdom of the gods or bring the knowledge of agriculture or bring these things to humanity so that humanity can survive and thrive and grow into a culture. Sometimes these are the first kings of your dynasty, the people who found your laws, the people who taught you, you know, agriculture, the people who gave you writing, the people who gave you, you know, like King Numa, one of the. One of the sort of the good Roman kings before the Romans got rid of all their kings. Right? The thing that he gives the Roman people, according to the legend, is piety, coinage and laws. That's why, by the way, things that have to do with coins are called. Referred to as. The whole field is referred to as numismatics. So these attempts, I will say, were only partially successful. So the lay of Laethean, which is Tolkien's longest unfinished epic poem, the Silmarillion, things like this were never published in Tolkien's lifetime. But what they did do is build a foundation on which the Lord of the Rings was later written. And I think that it's fair to say the Lord of the Rings will prove to have been the most successful work of the 20th century. So when people read the Lord of the Rings. And nowadays, I mean, you can look things up on Wikipedia or you just have that one friend that you text whenever you have a Tolkien question, right? If you have those kinds of relationships in your life or just like you watched the movies with your dad growing up and he kind of explained things to you, you just take it for granted that there's a lot of background information that you know. But actually, most of Tolkien's. Most of the Lord of the Rings, like, the background references are built on things that are not really explained, or you have to go look, look at an appendix in the back of the book to get the whole story, but the story works. I mean, honestly, the Lord of the Rings would be, you know, if. Honestly, I don't know how it got published. I mean, if somebody brought that manuscript to me, I mean, of course I would probably dig it. But if I was an editor at a publisher and I was looking at the manuscript and be like, nobody is going to follow any of this. Nobody has any idea what's going on. There are all these names. How are people going to keep up with this? How are people going to remember the difference between Sauron and Saruman, for instance, and all this different stuff? And yet the Lord of the Rings is successful. And the reason that it is successful is that it feels as though it belongs to us. And it feels as though it's a real place. It feels. It has all these different things, down to the naming. We're going to spend a whole week of this course looking at Tolkien's linguistics and not just that, his linguistics, because Tolkien wasn't just a. Sometimes what's called a con linger like somebody who makes up languages for fun or for profit. There are. There are conlangs, constructed languages made for a lot of major film and movie franchises now. It's kind of like the it thing. It's very basically, people don't even notice it anymore because you take it for granted. But nobody's languages work as well as Tolkien's. I have a friend who likes to say, maybe he's watching this. He likes to say that Tolkien's New Yorks sound like New York. What he means by that is if you say, I'm going to New York, you don't hear, I'm going to the new place that's named after the old place that used to be called York. You just hear, oh, he's going to New York. Right? The name now means something. It holds something together. And in fact, even if people are new to the English language, they'll know where that is. All of Tolkien's place names hold together in this beautiful, convincing way, and as do his personal names. And that's a big part of why Lord of the Rings, I think, works. So these are some of the things that we are going to talk about. And that's where the course is going to. Well, it's almost where the course is going to end. Because what we're going to do is look at how Tolkien uses the novel. And I mean, you can argue about whether or not you think the Lord of the Rings is really a novel. It's probably. It just depends on how specific you want to be with that definition. There are certain people get really persnickety about exactly what a novel is. But let's say he uses the modern storytelling genre of the novel. This is as opposed to a chronicle or an epic poem or even like a sort of a fairy tale style of writing. But he uses a sort of more modern novel approach to the Lord of the Rings, and it is ultimately massively successful. And I think this is a really important. It's a really important lesson for us, if we want to do this kind of Christian mythic storytelling, is we need to figure out how we're going to use modern genres to tell ancient stories. I think that Jonathan's. I can talk about Jonathan because he's not here. I think that Jonathan's God's Dog series is actually an amazing example of another great way to do this. And in fact, I would say that something like God's Dog has more in common with Tolkien's approach than something like the Wheel of Time. And if you don't know what I mean by that, come to the course, because this is one of the things we'll be talking about. So that is where the course is going to end. We're going to look at how Tolkien used his universal history approach to then write the great novel of the 20th century. We're also going to look at how some other modern Christian writers. One of the series that we're going to look at will be God's Dog by Jonathan Pageau. In fact, I'm going to just do my own analysis of it, which is going to be really, really fun. But we're going to look at. We're going to look at how that approach is actually similar to Tolkien's approach. And the thing that I'm going to kind of posit is that if we're going to build these stories and tell these stories and try to do what Tolkien did, which maybe you don't care about. Maybe you're just along for the ride and that's fine too. But I once heard Malcolm Guyt say he's a poet, inkling scholar. I once heard Malcolm Gite say that the only honest response to a work of art is another work of art. And he was quoting somebody else who I can't remember. So I'm just going to attribute the quote to him. I think that it's really important that we start telling stories and we start making media novels, comic books, graphic novels, films, et cetera. Right. Audio dramas. Boy, was there ever a better time for some awesome audio dramas. And they don't even take that much overhead to make. So somebody get on that. That's why I work with Jonathan. That's why I'm working with Symbolic World Press, because I really believe that telling these stories right now is the thing that we need to be doing. And I think that Tolkien shows us the approach. And I think that God's Dog is a good example of how you can do that same thing without it making it look like you're aping Tolkien. And we're going to have two other modern examples. I will not say who they are right now, but arrangements are being made. So we're going to have two other modern examples from modern Christian fantasy authors who I think are taking Tolkien's approach without just sort of aping him. And sometimes they're not deliberately trying to imitate Tolkien. They're just also kind of old world people with a philological mindset. So that's the pitch, that's the idea. And it's difficult to say why this is so important to me. Obviously anybody who knows me, knows about me, knows that Tolkien is something that's really near and dear to my heart. It's funny, because this is an idea that's been simmering in the back of my mind for a couple of years now. And we never really covered it on the Amen Sewell podcast because the Aman's Soul podcast was about other things and we were doing the Silmarillion read through and so on. So this will be new material. And I guess that's the last thing to kind of address is if you've just listened to me talk about Tolkien for hundreds of hours on the Amensul podcast, and you can't possibly imagine doing it anymore. I get it. Go with God, don't worry about it. But this will be new material. This will be some stuff that we never got into. In some ways it'll be going deeper. And in other ways my goal is going to be to actually kind of approach Tolkien's writings from a completely different angle of attack. And actually in a way that I think will help us even refine in our discussions. It'll help us refine our understanding of what universal history itself is by looking at this very potent recent example, which also somehow is the work of a single person, which is the only non universal history thing about what Tolkien does, by the way. And that's why it's not universal history. Right? Tolkien himself knew that other people would have to sort of get involved in the telling. And if. Although arguably, Christopher Tolkien is definitely involved in the telling and the presentation of the materials, but he knew that other people would have to get involved in the telling. The thing about universal history is that it doesn't have any single author, right? It is the voice, it is the expression of a people who have come to know God and look for their place in the story of his people and his redemptive work on our behalf. So all that to say, the course will be starting next month. So our first class will be on the 24th of February, and then we'll be going for five weeks after that. And I should say at the end, this is a horrible, horrible idea, because there's no way I have the time for this. But I want to do something kind of special at the end, which is I want to give you all a writing assignment. Now, I can't promise I'm going to read. It depends on how many people we have signed up for the course. I can't promise I'm going to read. And you will get a grade, because this is not a. Well, let me put it this way. I'm going to read everybody's stuff. I'm not going to grade it, but I will try to give some feedback. But it's going to be a short writing assignment. We'll have to keep it short so I can read them all. But I'm going to give you all a sort of memetic writing assignment in the. Probably about the middle of the course, and then you'll have a couple of weeks to complete it. And I'm doing this for two reasons. One is that some people have really said they would like Symbolic World courses to be a little more interactive. I totally get that. It's. We're kind of much like my recording studio. This is an ongoing project. Right? We're kind of learning and growing, and hopefully someday we'll have the time and the budget to go back and even redo some of Our stuff, like the Dante courses with some assignments built into it. So if you wanted to use it for your home school or you wanted to use it for your own education, you could do something like that. So I'm thinking on those things. I have actually insane, crazy ideas that I'm not even allowed to talk about in public about this. But the Symbolic World course is something that I really, really love, and it's really important to me. So bear with us. We're going to keep making it better. But the other reason, again, is this idea that, well, okay, let me tell you something that's a little personal. We were at the Symbolic World Summit last year, right? And there's a little trailer out back where the presenters could kind of get some coffee and like, you know, take a nap between things. It was just a whirlwind couple of days. So I'm sitting back there on, like, the second or third day of the conference with Dr. Martin Shah, who, of course, has been on this channel quite a bit and just finished an incredible course for us on Christian Wonder Tales over on Symbolic World courses. And he turned to me and he said, I won't try to do his Devon accent, but he turned to me and he said, you know, Richard, you're a good preacher, but you're not a storyteller yet. And of course, you know, it's like, oh, dagger in my chest. Well, now that I know actually what Martin means by being a storyteller, I'm not really offended by that. And certainly his presence in the symbolic world community has really encouraged a lot of us, myself and included, to tell more stories since that course finished. I've taken some of the stories in that course, and I've tried to tell them with my kids, and you can even draw them on the table a little bit. So we're working on all of this. And so I think that if we're going to do a course like this, there's got to be some kind of a storytelling assignment. So it'll be short. It'll have to be something short, but maybe it'll be a launching platform for the rest of you to kind of go into your life and go into your community and start telling stories. It's got to be remembered that people like Tolkien, Tolkien told all of his stories for his kids, for his family, for his wife, for his best friends. And it was only because something beautiful came out of that, that there was something that was good enough to be published. So that's my hope, is that you'll go into your communities and do that. And I really hope that I will see you there. You can sign up for the course. Just go to the symbolicworld.com courses and we'll also put a link in the doobly doo down below until I see you next. And I hope to see you in the course until I see you next time. God be with you. And Happy Groundhog Day."}
