{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":0.16,"end":62.53,"speaker":"Laura Diaz","text":"Tucson, the weight is over Mediweight loss. They're officially open on North Oracle road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications, you can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks at mediweight loss. I got the same medication but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost the same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com and I think that's what's happened, right?"}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":62.53,"end":99.91,"speaker":"Christopher Mastropietro","text":"People who are maybe, to use your word, scientistically inclined or you know, skeptically inclined in the pejorative sense of the term, who never would have considered any argument for the necessity or elegance or depth of a religious tradition, passed through the gate of a series of scientific terms and found on the far side of that gate something beautiful they had never thought to consider real. And it was actually the scientific bridge that made that possible for them rather than the science alienating them. It actually became an invitation."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":111.65,"end":160.01,"speaker":"Jonathan Pageau","text":"This is Jonathan Pedro. Welcome to the symbolic world. Hello everyone. Everybody watching this will know who these people are. With me today, of course, John Rivecki and Christopher Mastropietro. They have been working together for several years, have already written a book together and now they've taken the awakening from the meaning crisis content and put it into a book. So we're really excited to see that. It's been such a huge help for so many people to be able to frame what's going on and to frame the concepts, to find words to talk about the things that we all have insight about. And so first of all, congratulations to both of you on the publishing of this."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":160.81,"end":161.77,"speaker":"John Vervaeke","text":"Thank you so much."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":162.49,"end":183.91,"speaker":"Jonathan Pageau","text":"And so I guess I do have a question about to start off is I would like to know a little bit about how it is that you work Together, you know, because you guys have been working together for years, you have a great partnership, and I'd like to know a little bit how that comes together. How do you work through the ideas and put them on paper as a team?"}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":185.59,"end":271.23,"speaker":"John Vervaeke","text":"I guess I'll go first. So we have two ways, Chris and I, of working. One is I'll create, I guess, what you'd call the core theoretical argument. And it usually is either philosophical or cognitive, scientific or some combination thereof. And I'll either create that in an oral form or a written form, and then Chris will take it. And he does a lot. He adds a voice to it. He makes the material more accessible. He often brings in insightful connections. He fleshes out the argument in powerful ways. That's one way we work. And that was what we basically did for Awakening from the Mean Crisis, because the series existed first, the YouTube series. In other contexts, like with the zombie book, Chris and I will get together, like, literally in the same location and write together and then get a rough manuscript and pass it back and forth. So we have two different methods, and it depends on how the project is originally birthed. Was it originally something that was not textual and then we're going to process it in text, or is it something we're writing de novo and then usually we write it as collaborative co authors from the beginning."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":273.23,"end":273.59,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":273.59,"end":287.62,"speaker":"Christopher Mastropietro","text":"And the second method, there's a lot of pacing, lots of pacing. The first one's much more straightforward. The second one might be more fun, though. I don't know. It depends. Like you said, it depends on what the project actually needs. They're very, very different experiences, though."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":288.58,"end":334.07,"speaker":"Jonathan Pageau","text":"And so you know what's amazing that I've seen happen in the last few years is much of the language that you're using in Awakening from the Meaning Crisis, even the term meaning crisis has become pretty ubiquitous. We see it, we hear it everywhere. You see it in places that surprise me. I'm like, oh, why? They're using John's terms. And I don't know if they even know that they got it from him or if it's just already kind of fused into culture. I think that's a pretty astounding feat to have created a way of speaking about what's happening that has already kind of taken over people's thinking and has filled up those spaces. So, first of all, I'd say congratulations on that. And I don't know if you've seen that. Have you been surprised at places where you've seen people. People use the language?"}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":334.79,"end":458.18,"speaker":"John Vervaeke","text":"Yeah, I have. It's interesting. I get the same feedback from my students at the university that one of the primary things they get from me is a new vocabulary, a new conceptual vocabulary, a new theoretical grammar. And they say that's the most valuable to them. And I take that very happily. Providing people with a way to enhance their own philosophical and psychological agency is what I'm ultimately after. Of course, I am a scientist. I want my ideas taken up and examined and put into the arena. But the fact that that happens is very, very meaningful to me now, of course. And it was funny. I had my last lecture, my last office hours on Monday, and the students from my cognitive science and religion course came in and they were actually saying the same thing. And then they said, however. And this is also frequent. You know, the terminology gets to be burdensome, it gets to be overwhelming. And so one of the things that my dear friend Christopher does is help me try to find the Aristotelian mean between those two things. And I'm not. I mean, I listen and learn. I tried to put a lot of it into practice. When I went to LA recently promoting the book, I got some good feedback from the people that were interviewing me. But this has been something that I have been reliant upon. Chris and Sara, too, relying upon Chris for a lot and learning a lot that way. But how do you get. How do you. I mean, no matter what you do, you're going to piss people off on the tail ends of the curve. But, you know, how can we get that golden mean where we're enabling people, but making it, you know, accessible enough that they're willing to take up the challenge of taking on the vocabulary and the grammar."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":458.5,"end":531.34,"speaker":"Jonathan Pageau","text":"Yeah, that. It's funny that you mentioned that, because that was actually. I was already preparing that. That was going to be my next question. Exactly. That's what it was. Because, you know, I have to be totally honest with you, like the Awakening from the Meeting Crisis series, kind of. Watch it, watch it, watch it. And then if I watch the later episodes, like, towards the end, it's too much. Like, there's just so much. There are all these technical terms that you have to master. And in some ways, I think it's also because of the YouTube, the casual. There's a. Because of the casual way that we listen to YouTube videos or podcasts, it makes that harder. Because if I was in your class, for example, you know, I would have. You would probably give assignments and say, you know, like, give me your definition of these, or you would have me playing in my own work. On the. On the term, so that they kind of integrate. But if I'm just, you know, doing the dishes and listening to John Revaeke on YouTube by. By the time that I get to, like, you know, episode 30, I'm like, I don't know. I'm not even sure what's being said. And so for a book, Christopher, tell us, what is the key? Like, how do you find a way to. To mitigate the. These extremes? You know, how do you get people into the vocabulary? Because it's. It's extremely useful. But don't get them lost in the kind of technical jargon you could say."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":532.3,"end":656.61,"speaker":"Christopher Mastropietro","text":"Yeah, I'm still with the fact that I think John just called me an Aristotelian before. I haven't gotten over that yet. We'll have to talk about that later. I wish I knew, Jonathan. Like, I don't know how consciously I do it. I think I've just been sitting with it for so long. And that's not to say John doesn't make new, obviously. He's always pushing and contriving to overwrite himself and to create new theoretical. To push the horizon of the theory. So it's not as though he stays in one place. He doesn't. But I've been sitting with it and with him and with his way of thinking and with his vocabulary for so long that I've just metabolized it. And I think. I don't know, I just feel intimate with it. And when you feel intimate with something, as with someone, it becomes easy to represent or recreate it in your own native tongue. I also have an ambivalent relationship to a lot of the technical vocabulary because, like a lot of other people, I think what people find about the vocabulary becomes like this powerful tool that opens something. It opens into a conceptual space that maybe they didn't have access to before. And that can be a really helpful and powerful thing. I had the same experience myself years ago. The thing is, though, that sometimes that becomes John was. I think you were alluding to this before John. It becomes like, if you start to rely on it as your way of accessing the concept or the idea, then it actually, I think, begins to have the opposite effect. It then begins to close or rescind your access to this conceptual space if it becomes always your way of moving through it. And so I think the ideal way is to somehow give the vocabulary, have them hold it, have them use it, open up whatever needs to be open, and then take it away again. Ultimately, the most natural way of relating to the concept or the idea is going to be through their own native tongue, their own native language and way of thinking. So I think it's a double edged sword."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":656.93,"end":715.24,"speaker":"Jonathan Pageau","text":"What you're saying is so fascinating because in some ways it's actually what John, with the things that you talk about, which is the idea of something like optimal grip or some, or an idea that if you, if you like a technical term would be exactly the right thing. What it does is it opens up. But if you hold on to it for too long, you could say, or for too tight, then it does the opposite of what, of what it's supposed to do. And so you have to have this kind of, this play between the two tendencies in order to make it the most optimal tool possible. And so I just find it fascinating that like, even in the way that you treat the own terms that you're actually, you know, implicating the concept that John is working with. One of the things that I found the most, the most interesting but also the most difficult is because of some of the terms like let's take a terms like transjective, for example. You know, it forces people to think in ways that they do not think. You really need to create an almost change in worldview in the person."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":717.16,"end":717.52,"speaker":"John Vervaeke","text":"Before."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":717.52,"end":766.08,"speaker":"Jonathan Pageau","text":"They'Re able to be, to enter into those types of thoughts. And that's exactly the problem that you said, Christopher, is that if you have a, a term that's technical and just becomes a definition that you apply because a word like transjective forces you to break your categories, to like open them up, then, then it might, it might become, it might go against, against its own purpose, you know. And so, you know, the thing with you, John, and this is what I'm curious how you do it in the book, is that with you, one of the things you, you do is that you do that you have an aspect of you is a bit of like a Zen Cohen master where you, you try to shatter people's thinking, right? You try to open it up. And so it's easier to do that with someone in front of you or when you're playing with the language. So I'm curious about what you think, how you can do that in a book, for example."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":766.96,"end":927.46,"speaker":"John Vervaeke","text":"Yeah, that Socratic task of drawing people in, but also opening them up, getting them to that pivot point that Plato kept going on and on about. How do you get people to make that turn reliably? And you're both right. The language can become idolatrous and actually be something that they possess rather than going through the actual maturation of their cognition. Totally. I get that it is easier to do in person because you can interrogate the person, and you can also get a sense of their lived perspective because they're there present to you. So with the book, you have to rely on. This goes back, in fact, to what I had to do in the lecture series because there was nobody there in the room but the camera crew, and they were professionals, and they would not give me any feedback whatsoever. And so I had to engage. It was one of the first places where I really started thinking more concretely about the imaginal, because I had to imagine students there in a way that facilitated me getting into that Socratic mode. And I'm relying to a large degree on Chris to carry that imaginal. And that's why having this book done dialogically is tremendously helpful, because Chris can, in some stance, he can stand for the other while also standing with me. He has this tremendous capacity to be liminal in that way. And so we have to, in the imaginal sense, try to imagine the author and how we're going to get the place where they recognize. I mean, this is what Vygotsky called the zone of proximal development. You have to take people beyond their comfort zone, but you don't want to take them to the horizon of horror. You got to get that where you just get them just right. And I don't have an algorithm or a method for that. All I can say is there seems to be a virtuosity around getting into the zone of proximal development by appropriately imagining who your audience is going to be. But it's tremendously helpful to do that dialogically. And Chris and I were also working with some other good people. We were working with Madeline, and we were working with an editor there named Leslie, who was tremendously helpful at giving us that kind of feedback. What was it? They had a sam."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":927.86,"end":1058.54,"speaker":"Christopher Mastropietro","text":"Yeah, they both gave us a significant leg up. Yeah. Sam. There was an acronym standing for the. I don't remember what it meant. Standing for the reader standing. And it was an acronym that was something like how to imagine the Optimal reader. Who are we speaking to? To me, the thing that makes it easier. And I don't know, I think this, to me, this is intuitive. I don't know that it was conscious, but it's just. You're telling a story. It's an argument, but it's a narrative. Like, it's a narrative. Especially this part, this first half of the argument. It's A genealogy. It's. You're telling a myth. And so. And, you know, in the sense in which I'm using that word, and that wasn't me. John already did that in the lecture series. Right. He's telling a story. And there's this sense, like, it's a story that unfolds in episodes, and each episode teases a little bit about what's to come, and then the episode recaps a little bit about what just happened before. And there's this sense of, like, momentum and hopefully a propulsion and hopefully a tempo that makes someone feel as though they're actually on a journey of some kind. And to me, it's the telling of the story in its widest frame that makes sense of all the details and the terminology. Because when the reader gets a sense of like, oh, this is the kind of story I'm being told, or listening to the lecture. This is the kind of story I'm being told, then the kind of story, the sort of. The score in the background. Right. If I can analogize it to the musical score, that when you're watching a movie or like, the quality of the lighting or the quality. All of the secondary qualities that go into the telling of the story are actually doing, and I don't mean just in the book, I mean in the series, too, are doing a lot of the legwork in helping to put the vocabulary in perspective. And I think it's. There's a lot of things going on in the background that I think are helping to do the work, not just the actual literal explanations of the terms and whatnot. Because I think when a person understands, oh, wait, this is the kind of story I'm being told, it's like the context, semantic context of a sentence. Right. You know what this word means because of the way that it falls in the entire sentence. I think that's a big part of it."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":1060.93,"end":1085.41,"speaker":"John Vervaeke","text":"That interweaving of narrative and argument, of course, was my attempt to imitate, as best I could, Plato. Plato is for me. So another aspect of answering your question is there's a standard I was measuring myself against. And the standard is what you see in the Platonic dialogues, where narrative drama, character development and argument are seamlessly interwoven together."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":1086.55,"end":1177.53,"speaker":"Jonathan Pageau","text":"Yeah, that seems, you know, it's interesting because as we talk about, in some ways, a break through the Enlightenment, as we kind of come out of the Enlightenment mode, it seems like these types of. This type of thinking will inevitably return. You know, David Bentley Hart's recent book is written in the form of a Platonic dialogue, you know, rather esoteric as he is. But, you know, the idea that this is, this is something that will be probably part of new thinking that it. I've been thinking about it too because, you know, I'm thinking about writing a book. Obviously I've had several people ask me if I, if I would do it and I'm wondering what it should look like. You know, should there be even personal aspects in the book? I kind of don't like that idea. But it seems like when I read Dante, for example, I'm thinking, no, that seems to be the best way to. The most fulfilled way to write is to have all the levels connected together. One of the reasons I think Jordan's 12 Rules book did well is because of that, is that he has personal anecdotes, he has a theoretical frame, but it's all very couched in kind of very everyday, practical, practical stuff. And to find that, find that reach where you kind of connect everything together seems also like in a meta fashion, what it is we're trying to get to in these questions of awakening out of the meaning crisis. So, yeah, definitely something to think about. I have looked through, I've read the book quickly, but I can't wait to also go back in and see how you put all that together again."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":1178.81,"end":1273.97,"speaker":"John Vervaeke","text":"Yeah, I mean, perhaps this is a good point to mention. The book is not just a transcription, it's not just a companion. This book helps me correct one of the mistakes of the video series, which is it was presented monologically, which has put me into something of a performative contradiction that became more apparent to me. Somebody advocating for the importance of the dialogical self and dialogical reason over monologue. I mean, I don't want to play it the other way. Too strong. I mean, you know, in some ways this is still my core argument, but there was genuine, there was genuine dialogue and even at times dialogos around the production of the book that wasn't in the production of the series. The series was very much in my head. The book was very much between Chris and I and the people at the publishing company. And that wasn't always a pleasant affair, but it was, it was, it was a very effective, very effective dialogical rationality has all the difficulties associated, and you get this in Plato too, all the difficulties with human beings and their foibles and their flaws. But it also has a tremendous power for self correction that monological thought, thinking just. And talking just to yourself doesn't have. So, yeah, and I've been trying to move more and more towards everything I do is being done dialogically."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":1276.2,"end":1292.64,"speaker":"Christopher Mastropietro","text":"So the clarification is that it's not as though the book is written as a dialogue. No, I want people to get that perspective. You're talking about the process. I'm talking about the process of producing the book was a dialogical process. Not that the book's presentation is dialogical, which is an important distinction."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":1292.64,"end":1313.65,"speaker":"Jonathan Pageau","text":"No, but you did, like you said, you did take into account that you're presenting an argument in the narrative form in the sense that here's a progression of, of things that have happened that have brought us to where we are. And you kind of have to understand it. It's a mix of argument and history in some ways, so that it helps people understand why we are and where we are right now."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":1313.73,"end":1365.82,"speaker":"John Vervaeke","text":"I think one of the things Chris did to my ear is he strengthened the presence of the narrative in the book. As Chris said, it's there in the series, but it becomes much more present in a very helpful way. I like the comparison to the atmospheric music in a movie and how that gets you to participate in the material of the movie in a much more profound fashion. And Chris did that. He pronounced the narrative in that way. And I think that would he. Chris has a tremendous gift for the lyrical, as anybody who's spent any time with him knows. And the lyrical doesn't just mean flowery language, the lyrics of a song. There's an added dimension of meaning that is otherwise not available with that kind of lyricism."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":1367.1,"end":1385.06,"speaker":"Jonathan Pageau","text":"Hello, friends, this is Richard Roland and I am inviting you to join me for my new symbolic world course, Tolkien and Universal History. In this course, we're going to go over the deep mythological and universal history roots of Tolkien's legendarium and see how Tolkien sort of shows us a blueprint."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":1385.46,"end":1391.54,"speaker":"Christopher Mastropietro","text":"For reclaiming a legendary, mythical Christian framework for storytelling."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":1391.62,"end":1394.74,"speaker":"Jonathan Pageau","text":"And in fact, we're going to even do some storytelling of our own."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":1394.98,"end":1396.34,"speaker":"Christopher Mastropietro","text":"This is a five week course."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":1396.98,"end":1398.58,"speaker":"Jonathan Pageau","text":"It starts on March 3rd."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":1398.58,"end":1399.9,"speaker":"John Vervaeke","text":"We had to postpone it a week."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":1399.9,"end":1401.02,"speaker":"Jonathan Pageau","text":"Which means there's a little more time."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":1401.02,"end":1403.38,"speaker":"John Vervaeke","text":"For you to sign up and I."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":1403.38,"end":1404.26,"speaker":"Christopher Mastropietro","text":"Hope to see you there."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":1405.95,"end":1411.79,"speaker":"Jonathan Pageau","text":"What are some of the things you know? Because now the, the video series has been out for a few years now and."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":1412.11,"end":1412.51,"speaker":"John Vervaeke","text":"Five."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":1412.91,"end":1429.23,"speaker":"Jonathan Pageau","text":"Five years. Isn't that. That's wild. That's wild. And so what are the, what, what are some of the surprising effects that you've seen or people that have told you stories or that have, you know, I'm curious to see the, some of the effects that you've Seen it have things that you didn't expect, maybe."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":1432.84,"end":1563.65,"speaker":"John Vervaeke","text":"So after, I mean, I guess two. One is more interior and introvert. I've become a little less. I don't wake up in the middle of the night with a sense of exposure and apprehension, anxiety. And I literally used to do that on a regular basis, so. And you know, and again, Chris has been a big help in that. Chris and Sara, very big help in me accommodating to this role and helping to properly tutor me so that I can address my concerns about the vice that is available, but also the virtuosity that could be cultivated. So I'm tremendously grateful about that. I didn't foresee that before doing this series and I am grateful for this process, but that was a surprise. More public facing. The amount of actual professional academic work that has been generated by awakening to the meaning crisis caught me totally by surprise. It is like five, you know, at least five times greater than before I did the series. The number of bonafide relevant experts in the academics who reach out to me and want to collaborate with me and work with me, that has just gone up in a way I did not foresee. Looking back retrospectively, it makes sense to me. I think the legacy academic pathway is undergoing the same kind of contraction that the legacy media is and the universities are not really getting it yet. But it took me by, it took me completely by surprise. And so that is something for which I'm just tremendously grateful. The people I've met, the people I've entered into relationship with, the work that has been done, I am even by, you know, even by sort of cold academic professional standards, this is my most productive I've ever been."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":1565.17,"end":1608.75,"speaker":"Jonathan Pageau","text":"Wow. Yeah, you would think that. Can I say this? I know that some, I've talked to some academics where I've asked them, let's say, to come on my YouTube channel or to talk about this. And they're very nervous because they, they want everything to be couched in the, in academia. And so they're, they're worried that it, will it affect their credibility. So this is to all of you watching, you know, this is, it's a new world. This is not the. This world is changing. And, and so I'm really happy to hear that, that it didn't diminish people's perception because like, oh, it's YouTube videos, you know, rather saying, okay, here is a new cogent way of seeing that we hadn't thought about and you know, people listening to it in their spare time and realizing that there's something going on. It's a. It's a great testimony to the change."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":1609.31,"end":1667.37,"speaker":"John Vervaeke","text":"Yeah. And what's happened is, I mean, we've retired it now for reasons that we made public. But when I was doing voices with Revaeke and what is continuing on in the lectern is we have academics who have come and come to see that this is a proper place for them to articulate their ideas, like Charles Stang or James Filler. So that has also been something that I've been very pleased with initially when I did for exactly the same prejudice you just said. When I did this, I thought academics would never come on publicly and talk with me. But that has also changed and opened up more and more academics want to engage in more public presentation of their idea. And I think it's reasonable to conclude that I've earned their trust that they know that they're going to be able to do something that is public facing but nevertheless, you know, has academic integrity and rigor to it."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":1669.53,"end":1670.17,"speaker":"Jonathan Pageau","text":"What do you think?"}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":1670.73,"end":1815.62,"speaker":"Christopher Mastropietro","text":"There's also something else that it was a new way. Like, I kind of remember, you know, being at the University of Toronto back in like maybe circa 2010, 11, 12. Like that period was the period that I was there and first met John and Peterson. Jordan Peterson was also there at the same time. And at the time they were really the only two people. I'm not. Not to say that there weren't other really good teachers at the university. In fact, I had some other really, really good teachers at the university. People like Lloyd Gerson come to mind. And what. But there was something. There was not only the content, but there was form. The form was. It was impassioned with vocation. And having a scholar be impassioned with vocation is not something that a lot of people are used to seeing. In fact, I was surprised when I first entered the university to find how segregated a scholar's personal life was from their academic life. I remember thinking, well, God, if you're going into philosophy, you must be going into this because you love it and couldn't possibly do anything else. Like, this is. This is the kind of thing that orients you to the horizon line. Like, why else would you go into philosophy? But of course, as we know, that's not true for a lot of people. And so, you know, I think a lot of people who probably watched that series, they had the same reaction as the generations of students who just did that first in the classroom when they saw John or they saw Jordan or they saw people like them. Which is to say they met someone who was not only presenting something novel in its content and it in its ability to integrate disciplines and revivify an intuitive love of what the philosophical project was in the first place, but they found someone who cared so deeply about this that they seemed to stake their life on it. And that does something to people when they see that. Right. It does something from within. I think it makes it bring something back to life when they see an example of someone who is marrying those things together. I think that was probably maybe the single most vital thing. Put aside all the content, the specifics of the argument and whatnot and all of its value. It's the formal presentation of imbuing it with a sense of greater purpose. I think that does a lot of the work and people caught into that intuitively without ever having to explain it."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":1816.02,"end":1843.27,"speaker":"Jonathan Pageau","text":"One of the things you're saying, I think that you mentioned that rings a bell to me, that I've noticed and I think is been wonderful too, is I remember coming out of school and being interested in medieval art and, you know, reading papers and reading different studies on medieval art and realizing that there's medieval art historians and there are Renaissance art historians. And those historians do not speak to each other."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":1843.35,"end":1843.75,"speaker":"John Vervaeke","text":"No."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":1843.75,"end":1902.39,"speaker":"Jonathan Pageau","text":"And they. And it's like they're both art historians, but they actually do not in any way. They don't go to each other's conferences, they don't read each other's papers, they just completely like, ignore each other. And I remember thinking how insane that was, you know, back when I was like in my early 20s. And one of the things that I've seen, John, in your work that to me has been astounding, is a complete, a bold cross disciplinary approach which is unapologetic about that, you know, just crashes through psychology, through philosophy, through history, and doesn't seem to care that everything has segregated into all these like little micro worlds that don't even speak to each other. And so I'm curious to see, to hear about how people are reacting to that, you know, in academia and around that. Like, are you getting pushback for that kind of approach? Because, you know, we're all postmoderns. There's no grand narrative. You can't, you can't, you know, you can't join things together. Just everything has to separate."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":1903.82,"end":2036.66,"speaker":"John Vervaeke","text":"So this is a very interesting thing. And as you rightly divined, I've sort of been in the thick of it, not by design. So, yeah, the university there is the sort of postmodern, you know, no grand narrative. But there's also this tremendous recognition that interdisciplinary study is really where the science needs to go. And the fact that those two are in dramatic tension is not, I think, registering at the level of the university organization. I think there's a performative contradiction looming within the university that it doesn't quite get. But that's part of this longer performative contradiction about. Right. We're trying to figure out how we can properly integrate together while we're trying to also say there is nothing that could possibly integrate us together, which is, I think, very problematic. My training in cognitive science, and therefore I express deep gratitude to all the people that taught me, showed me that if we don't do that integration, we're going to be, you know, our understanding of mind is going to be equivocal, fragmented, and that's not going to just be something propositional. That's going to ramify back into our understanding of ourselves, our understanding of our world. You're not doing good science, all of that. And I've made those arguments repeatedly. So what has happened is for the very long, very long time, the university looked at me as something they did not understand and therefore were kind of tolerant, but were looking for a reason to possibly get rid of me. And when 2008 struck, that opportunity was taken and they tried to get rid of me. Even though the cognitive science program was the fastest growing program at the college. I won't go into all the details because it'll start to raise my affect in a way that I don't want. Now, what happened is the faculty and the students did a lot of protest about that. They defended the value of the program. And I really honor the academics who did that."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":2037.28,"end":2039.12,"speaker":"Jonathan Pageau","text":"They're trying to get rid of the whole program."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":2039.28,"end":2040.16,"speaker":"John Vervaeke","text":"The whole program."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":2040.4,"end":2040.88,"speaker":"Jonathan Pageau","text":"Wow."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":2042.72,"end":2056.8,"speaker":"John Vervaeke","text":"It has to do with inept administrative arguments. Well, we don't have dedicated budget lines for the cognitive science program, so therefore, we can. We should remove it. Right. Which is like you're. You're. Because of one mistake, you're doing another mistake."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":2056.88,"end":2057.36,"speaker":"Christopher Mastropietro","text":"Yeah."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":2058.32,"end":2219.55,"speaker":"John Vervaeke","text":"Anyways, what happened is. And I honor people like Joe Heath and Donald Ainslie and other people and Jay Pratt and the psychology. He was chair of the psychology department. They went to bat for me, especially the psychology department. So this is why I feel a tremendous loyalty to the psychology department, unlike my famous colleague. And so. But then what happened is the university also had a sea change. They realized that they were starting to suffer because they have a bad reputation for teaching quality, great research university, but bad. And so they made this Huge move towards creating a second stream of professors who were being promoted because of their teaching, not just their research. And so I slipped into that stream, and then the program was started to become something that was properly budgeted. And then the university did the thing it always does and got behind it and said, we've always loved this, and this is a gem for something that we should always be doing. And then they were still looking at me, and they were still like, yeah, you're getting good student evaluations and your students go on to grad school, but, you know, you and Jordan and a couple other professors. And like, we had so much trouble with Jordan, and we had so much trouble with, you know, Dan. And there was all of that. You don't fit in the boxes. And literally, I had meetings when I was applying for my permanent status, my tenure, where they were basically saying that they would do it sort of politely, with smiles, while saying, you know, we've got our eye on you. And then when it became clear that the YouTube series was not going to be detrimental to them, but that I continually and reliably honored the University of Toronto, especially the psychology department and the cognitive science program, they came around and it was last. This tells you how long things take. It was just my previous. We do a thing called the ptr, which we evaluate our yearly evaluation for how we're doing. Right. And it was the first time they officially acknowledged my public presence having a value, having an academic value. And I give them credit. I mean, institutions are by nature very conservative. So now what it is, is we don't know what John is. He doesn't fit into any of your boxes. But he's our maverick. He's our weirdo, and we're going to keep him and we like him. That's what it sort of come down to. And I appreciate that."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":2221.63,"end":2266.51,"speaker":"Jonathan Pageau","text":"Christopher, what do you think about crashing through? Crashing through? Like, crashing through the discipline. But I don't think it's crashing through in some ways. Think that. I mean, to me, it's a surprise because if you had asked me when I was younger, is cognitive science going to be a place where we can kind of join ideas about religion and philosophy and history and then also more mystical ideas of attention, all of these things, I'll be like, what? No, I don't even know what that is. How would a science be able to do that? Especially my cynicism against kind of like science as, you know, scientism, you could say, you know. And so, Christopher, I'd like to hear what you think about this moment, like how all this is coming together."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":2266.75,"end":2476.16,"speaker":"Christopher Mastropietro","text":"Yeah. Well, me answering this question is ironic, too, because I'm not, like. I'm not a scientist. That's not my background either. And that's not my domain of comfort. I mean. And I understand it well enough to, I suppose, to lend it the writer's craft and to lend it a certain articulation in certain contexts. But, like, that's about as far as that goes for me, you know. So I think. Yeah, what to say about that. My relationship with it is. That is. Goes back to what we were talking about before, which is, you know, conceptual vocabulary and tools to pry open esoteric ideas. And sometimes, you know, John has a gift with his. You know, there's a way of expressing things poetically. For example. Now, that. To me, that's where my. I feel more at home. And yet there's a kind of specificity. There's a technical geometry. And there's something very, very helpful about some of the scientific conceptual apparatus because it helps to. It basically becomes like a. To me, it becomes like a transliteration device. It becomes a way of bridging into things that are very difficult to understand, that often are only in the traditions that we read and revere, expressed poetically or expressed in such a way that they. That you have to develop a deep kind of intimacy. And you have to surpass the constraints of the language that you use with the language that you use in order to access them. And there's something about bringing all of that and expressing it within a scientific domain. Aside from giving. Giving it credibility and plausibility and, you know, aside from the people that need that in order to be credulous or to even give it a fair hearing. I mean, there's all of that, but I think in addition to that, there's just a kind of. There's a tidiness to the form of presentation that makes things that are very, very difficult to understand and have. Have esoteric histories suddenly within striking distance of the average person. And I think that the great advantage that has been given. That's not. This is really more of an aesthetic point than a theoretical point. But I think it's important. And to me, it's the thing that's most important, which is to say that there's a way in which people can touch down on things that they otherwise would never touch down on. And I think that's what's happened, Right. People who are maybe, to use your word, scientistically inclined or skeptically inclined in the pejorative sense of the term who never would have considered any argument for the necessity or elegance or depth of a religious tradition, passed through the gate of a series of scientific terms and found on the far side of that gate something beautiful they had never thought to consider real. And it was actually the scientific bridge that made that possible for them rather than the science alienating them. It actually became an invitation and it became a kind. Just as they say, that John is, you know, there's a lot of talk about gateway drugs in this, in this space right now. But. But that was a kind of gateway drug for people. And I think that's an incredible advantage that cognitive science has been able to have. It's as this transliteration device. Basically, that's my sense."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":2476.8,"end":2510.54,"speaker":"John Vervaeke","text":"So I've acquired a reputation that now has become attractive to students. I get students coming to me, I guess this. I've earned a bit of trust around this as someone who goes into areas that have been considered woo and illegitimate and make them intellectually respectable and worthy of theoretical debate and empirical investigation. Investigation. And that is one of the things for which I'm most, I hope in the virtuous sense, proud that I have been able to do that."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":2511.02,"end":2662.72,"speaker":"Jonathan Pageau","text":"Yeah, I mean, to me that's been, you know, and that's one of the things that if you remember, like you and I were criticized together, you know, trying to talk about transpersonal agency and trying like at least I was pushing to connect it to the ancient world because in some ways we, you know, I think that's one of the interesting things about cognitive science is that whether something is quantifiably measurable and let's say in the way that a kind of 19th century materialist would want it to be in the question of cognitive science in some ways becomes irrelevant in the sense that. Because someone asked me, like a good example would be, someone has asked me recently, we talked to people, people I was talking about, like actually UFO and kind of people seeing aliens or seeing demons and stuff. People ask me like, how do you distinguish a real experience from a delusion? And my reaction to that is that if you have a delusion about seeing demons, you need to deal with that. Like, I don't care what, like I don't care if it's physically there or not, or if it's. When someone says it's just in your mind, it's like if something is just in your mind, does it. If it's something like that where it's actually encountering some kind of destructive force that is affecting you mentally, you can't ignore it. You have to deal with it. And some of the, you know, so you would say, well, is it a chemical thing? Like, would you need to take certain chemicals in order to help yourself? And it's like, probably maybe an aspect of it, but there's other aspects of it that can be helpful, and those are couch in the. In the tradition, like, you know, encountering a sage, encountering someone who can speak with authority to your experience. All of these types of things would definitely have an effect on these experiences. And so I think that that's what's fascinating is that, you know, like the question of, for example, like seeing a monster, for example. It's like every culture in the world knows what seeing a monster is. Like we just know what that is because it's just universally described. You just know what it is. And so if someone asks you, is the experience of seeing a monster real? And I'm like, well, it's real. It has to be real to some extent. Doesn't mean that you can. That you can give the monster, you know, like a species that you could. That you could cut it out and put on the table and like analyze its DNA. But that experience has to be something that we have to. That we can deal with, you know. And so I think that the length, like I saw you, for example, John doing, you did a conference that it was like on subtle bodies. And I thought, man, he is not afraid to like, go into this kind of stuff. And so it's been amazing to watch it happen, I have to say."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":2663.68,"end":2756.91,"speaker":"John Vervaeke","text":"We have a paper, Jinsung Kim and I, we have a paper in submission to a bona fide academic journal about all of this. Yeah, yeah. That has been really important to me. And Chris has been a tremendous help in that, I think, welcoming back into intellectual fellowship a lot of the things that we orphaned that were proper domains of human experience, especially transformative experience, places where they cultivate a sense of the sacred, a capacity for self transcendence. That has been a way in which my work has contributed to sort of the re. Enchantment of the world, making the world that turning it back from a universe, one thing we can say about it, universe to a cosmos. And I didn't realize I was doing that except in the intuitive sense that I just liked to go because of what happens in my practice into places that people typically didn't want to go and see if there's any scientific merit there. That's a Socratic impulse in me. I want to know if this thing that seems so catchy has any truth behind it. Just like I like to go and see if things that have a lot of truth have any transformative potential left in them. That's the Socratic inspiration running through me."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":2757.87,"end":2890.79,"speaker":"Christopher Mastropietro","text":"Yeah, I was going to say when you brought up that I saw that video of yours, Jonathan, when you had that discussion about the demon and the demonic and encounters with it, brought me back to experiences of sleep paralysis. But one of the really helpful things about that. And you do it too, Jonathan. You both do it, but you do it in their different domains, which is you'll take. You'll talk about something, let's say, that has overtones of the mystical or overtones of the metaphysical or, you know, whatnot. And what you'll do is you'll take the same pattern, but you'll talk about how the pattern is actually manifest on, let's say, a lower scale of experience, a more everyday quotidian scale of experience. Right. You both do this in your respective ways and with different vocabulary, but I think you both do this very well. This is one of the ways I think you guys have an. If your work has an affinity, which is that you like to detect patterns and you like to take a pattern, you like to show how it's replicated at different scales and how actually the thing that makes the higher order version of that pattern most plausible is the acknowledgement that it is already affecting us at a lower order scale of reality. And how we take the sort of in miniature the rituals that are present at that scale of reality to be intrinsically real by the way that we interact with them in the first place. And so that all we're doing when we talk about these higher orders is we're just expanding and scaling the pattern. And it might be beyond our comprehension to immediately perceive, but the pattern is no less real because we already have an intuitive relationship with it. And so I think one of the things that I think both of you guys do is it's very Platonic. This is the anamnesis. You show people that they already understand this. It's just that they don't relate their understanding to the scale of pattern that they feel alienated by because they're not understanding the correspondence. They think this has nothing to do with them when in fact it has everything to do with them. And they already know that. But what you do is you remind them that they already know that. That's the very powerful thing. That's what a teacher does."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":2890.87,"end":3016.22,"speaker":"Jonathan Pageau","text":"Yeah, yeah, that's. I mean, that's exactly what I'm trying to do. 100%. And the hardest thing to communicate, and this is the one that's sometimes more difficult, is that sometimes the higher order pattern, how can I say this? It's real. Not only, but it's real to the extent that it joins the lower versions together. And so it's like for example, like the image, a good example, a demon thing is a good example. Like let's say the image of the demon in the fresco where it's an actual like hybrid monster and everything. It's like you're probably never going to see that. You're never going to have an experience of that. Maybe not even in a dream, maybe not even in a thing. But that image, everybody recognizes it as being what it is, even if they haven't had a personal experience of it because it joins together there. It joins together the dark thing that moves in the corner of your attention and the moment that you've had where you're in utter confusion and nothing makes sense and everything falls together when you see an image of it, like a missile mythologized image of joins it. It joins your experience of seeing something move in the corner, you know, of your, your attention with everybody else's. And so we are like, oh yeah, that, but I don't even know why it's like, why is it that that is. I get attention, I, my attention is drawn to that. And I think that a lot of, a lot of these higher order versions, that's, that's what they are and that's why we, no matter how much. Because I know John, you've said things like I don't believe in this supernatural. And it's funny because it's like, I think I probably also don't believe in the supernatural in the way that a lot of people think of supernatural. But, but I, I believe in top down causality. I think that, that it emerges into these images but it also constrained from above and it's like, yeah, that image of a, let's say a winged person, that's the right image for what it's describing. Like there, there's no better. Like there, there might be alternatives, but there are very few other versions of it that are good and they're universal. Every culture has the image of a winged something to represent a spirit. Like it's so obvious when you think about it. But you know."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":3019.5,"end":3020.54,"speaker":"Christopher Mastropietro","text":"Sorry John, go ahead."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":3021.18,"end":3195.83,"speaker":"John Vervaeke","text":"That's the thing that first of all I think I've got, you know, all things are filled with God and that's David Bentley Hart basically also doing what you just Said, and I'm interested to read that. But the thing you put your finger on is the thing which is. I don't want to derail the conversation, but it's the thing that has fascinated me on both ends. The work of art that really externalized this and gave me the space so I could reflect on it was Equus, which I consider a masterpiece. I identify very strongly with Dysart. The last lines of that play always reverberate for me. And what Dysart knows, he has to interact with these transpersonal, transjective realities in his profession, but he can't account for them. He can't account for what is the magnetic force that did what you just said. Like, why that? I know logically, because I do work on relevance realization, all the possible things that could be drawn together that don't happen. Why that? Why that? And I think Jung doesn't give an explanation. Jung just points at it. The archetype is not an explanation. There's no theoretical explanation there. There's no mechanism. Right. In the scientific sense. Not in the mechanical sense. Right, right. And that's what's fascinated me. And that fascinates me from the scientific end of relevance realization to the depths of my. Which I did on, you know, the course I did on your channel, the Cognitive science of ritual, the encounter with the sacred and that. I call it the Equus Engine because just for the alliteration, that whatever it is that, you know is doing that. And what's so weird about it is it's simultaneously very bizarre when you think about it, like, with, you know, with reflective distance. And yet, like you said, it's like anamnesis. It seems so familiar and so right. When you see it, it's like of. It has that, of course, to it. But if you ask theoretically, you say, okay, theoretically. Why, of course, the person goes, I don't know. And that's the play. That's Equus. And it fascinates me. And like Dysart, I want to. Like, I've given up the project of being able to, you know, get an account that's going to satisfy me because I realize I'm going to die unsatisfied about this. But about trying to get more and more properly oriented to it and have an articulated apprehension of it so that we can do a more profound appreciation of it. I think I've made some progress on that. And that's, you know, that really. That has come to mean so much more to me. To me realize that's what I'm doing, and that's what I want to be doing. And I just. I know I'm doing a bit of a tangent here, but that, that, to."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":3195.83,"end":3196.11,"speaker":"Christopher Mastropietro","text":"Me."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":3198.59,"end":3212.83,"speaker":"John Vervaeke","text":"I felt it. I felt it when we were at the gospel seminars. I felt something like that happen between all of us. And it was profound and it was deeply meaningful to me. Sorry. I know this isn't directly about the."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":3212.83,"end":3220.62,"speaker":"Jonathan Pageau","text":"Book, but it's just people won't watch this. They watch this for the inside in the conversation. That's what they care about it. Christopher, go ahead."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":3220.62,"end":3228.86,"speaker":"Christopher Mastropietro","text":"I'm actually curious now that you brought. I've heard about what that experience was like from John's perspective, Jonathan. But I'm kind of curious now that he's brought it up, what that was like from your perspective."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":3228.86,"end":3235.86,"speaker":"Jonathan Pageau","text":"Oh, the Gospel seminar. Yeah. I mean, this is a good opportunity because it's just coming out now. You know, I think it started coming out at the beginning of the week."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":3236.02,"end":3238.1,"speaker":"John Vervaeke","text":"December 1st, my birthday. It came out."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":3238.1,"end":3416.04,"speaker":"Jonathan Pageau","text":"Oh, it's Happy birthday, by the way. I really. I was really nervous about it, you know, because talking about Exodus is something. Because Exodus, you know, I mean, it's relevant to Christians and obviously very relevant to Jews, but it's, it's. It's not something that people fight over that much. You know, they don't have all this conflict around it. But the gospel, my goodness, the gospel. The most explosive thing you can do is obviously talk about. About Christ and about his message and also about the imperial implications and everything. You know, that's why we've had actually had like, wars about this. So I was very nervous. And also because Jordan, you know, Jordan in his amazing self just was like, hey, why don't you come to the Gospel Center? He's just like inviting anybody to come. It's like anybody he meets that he finds interesting, he's like, hey, you should go. He was like, russell Brand, you should come to the Gospel seminar. He's like, Tucker Carlson. You should go to the gospel, like anybody. He's just like, just come to the gospel seminar. And I was thinking, Jordan, like, I was like, ah, we're inviting all these people. You know, we had. It was. We had. What's his name? From the. From trigonometry. Constantine Kisson was there, which I was like, constantine kissing. I like Constantine kissing. But why would he come to a gospel seminar? And so I was like, nervous. But then exactly what you said. There's something about the. Just, I think the integrity of the people. And I think that's maybe what Jordan Gets Jordan is like, I meet someone who has integrity and I sense their integrity. And that's the reason why I want to invite them. Because he's like, the integrity will go more than any of the scholarship or the knowledge. And we did have scholars there. But I would say there was mostly this real honest desire to go through the text, to discuss it openly, to not have hidden agendas. And that really came out. I was surprised because, you know, there are some things that I for some reason had massive insights about during the discussion. You know, there were some, some of the, some of Christ's parables that I didn't understand. And all of a sudden as we're talking about it, we're exchanging and we're just, you know, ruminating over this. You know, it just hit me. It was, it was really crazy. And I really enjoyed also watching you, John, you know. You know, because I was. One of the things, one of the reasons why I liked that you were there, I wanted you to be there is because it is something that I haven't been able to maybe communicate to you as much as I. As I could is that I really think that the gospel and many of the things that Jesus says and many of the things that Jesus does is exactly about the relationship between bottom up, you know, emergence and then top down emanation. The way you talk about that, he's exactly about the joining of heaven and earth. And you see it happening in the, in his miracles, in the story and everything. So I was like, I'm hoping, like I just, I'm hoping we could have John there for like days going through it. I kept looking at you and I'm like, you know, and I could see that you were seeing it right away. So to me that was, it was, it was really exciting. I really enjoyed it."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":3417.32,"end":3464.75,"speaker":"John Vervaeke","text":"Thank you, Jonathan. It was, yeah, I mean, I, for me, what I call the Logos showed up and everybody, I think that was everybody, everybody got to a place they couldn't have got to on their own. And there was, there was, there was this field, you know, vibrancy between us that was just, you know, impregnating everybody with insight and self reflection that I found much more actually communicative of the gospels than perhaps the particular propositions we were uttering. And I had that experience, you remember at the end I said, you know, I was talking about that and my sense of devotion to it. And so I would like you. I just, I was very grateful to be there."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":3465.39,"end":3466.83,"speaker":"Christopher Mastropietro","text":"Yeah, that's cool."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":3467.15,"end":3470.91,"speaker":"Jonathan Pageau","text":"Have you had a chance to see some of It, Christopher, or except for."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":3470.91,"end":3558.9,"speaker":"Christopher Mastropietro","text":"The few little clips that have been thrown up on YouTube, not much yet. I will be very interested to see it in its full length, though, when I can. I like what you. I can understand the nerves, like, I can understand the stakes or the feeling of the stakes. It strikes me actually as. And I don't say this compliment you guys for the sake of it, but I mean it. It's like. Requires a certain amount of courage to be in a. In a position like that, especially when you're talking about a source and a text that's so foundational and that we all have a relationship to. And it could not possibly be. It could not possibly have more gravity. That is personal and that is universal. And you're submitting yourselves to be thinking in real time. And there's a vulnerability to doing that that is, you know, the stakes, I imagine, could feel very high. And so it's the idea that you found yourself having insights you had never had or relating to it in a way that you'd never related to it, at least to some degree, is a really fascinating thing for me. I'm kind of hungry to hear. I don't know, I'm not to put you on the spot, Jonathan. I'm hungry to know if there's a particular instance or example that comes to mind. Let's say you mentioned one or two of the parables struck you in ways that they hadn't before. I'm just curious if there is any. If you can be more specific. Asking me or asking John, you first and then me."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":3560.5,"end":3572.82,"speaker":"Jonathan Pageau","text":"Yeah, there was. I even. It's funny because I don't. I don't remember right now. There was one particular. There was one particular parable that."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":3575.87,"end":3575.99,"speaker":"John Vervaeke","text":"I."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":3575.99,"end":3618.1,"speaker":"Jonathan Pageau","text":"Forget which parable it is. It's horrible because it's like I had massive insights about it. I'm sorry, I can't come up with it right now. What are the things. One of the things that really I would say surprised me and touched me and it's actually going to go. Part of the controversy in some ways of doing the gospel series was at some point, you know, Dennis Prager was there, which, like, really kudos to him for coming and also being so gracious and generous, you know, asking the right questions, but also, you know, not really kind of going along with the story. At some point he's like, you know, we've been here for several days, we've been talking about this. And he's like, no one yet has basically. He's basically saying no one yet has Told me, like, the usual thing that I hear, which is how to get saved."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":3618.5,"end":3618.9,"speaker":"John Vervaeke","text":"Right."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":3619.94,"end":3669.74,"speaker":"Jonathan Pageau","text":"It was so funny because we all kind of looked at each other and we're like, you know, oh, yeah, but also, that's not what this text is about. I don't know what to say. Like, Jesus rarely talks about that. He actually talks about all these things. And if you're trying to find for, like, the things supposedly that, like, will get you saved, you're real. Actually going to struggle to find that in the. In the way that modern kind of, you know, maybe more superficial Christians would think. Like, you're really going to struggle to find it. You know, he's teaching a way. He's teaching a way of being, a way of living. And I. And I thought. And the fact that we all in the room were completely fine with that, and we're like, no, we're actually talking about the text, you know, like, what's in the text. That was a moment that I found particularly touching. Like, that exemplifies the spirit in the room. You could say, yeah, something like that."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":3671.26,"end":3672.94,"speaker":"Christopher Mastropietro","text":"That's cool. How about you, John?"}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":3676.86,"end":3821.26,"speaker":"John Vervaeke","text":"There was lots of moments. The moments that meant the most to me, sort of egocentrically, were moments of unexpected recognition. When we were talking about in the beginning was the logos, and I was making the argument for the four Ls, identity claims, light, life, love, and logos, and for relationality as being primary in our understanding of ultimacy. I expected one of two reactions. Either, you know, what the heck, this is arcane and obscure, or no, no, no, that's not how we think about God. And instead, what happened was people took it up. And then there was a moment where Bishop Barron intervened and he said, I think that's the right intuition. And it set me back. And credit to him. I'm trying to give credit to him. It set me back. I totally did not expect that response. I mean, we weren't there to debate, and I wasn't prepared to debate, but I was prepared to argue, if you'll allow me to make that distinction. I was prepared to argue, and instead it was welcomed and it was taken back in. And then Jonathan picked it up and you did an amazing amplification on it. And it just sort of went in a way that I had not expected. And I said this. I don't know if it'll make it onto the camera. It might get edited out, but I said this at the time. I felt a welcoming into a deep fellowship discussion dialogos about Jesus that I had thought I would never, ever have. And it was very healing for me. It was tremendously healing for me because of my past. And so that was that. You know, Hegel talks about that. Those moments of genuine recognition and trust that are profoundly capable of addressing, you know, otherwise inaccessible parts of the human psyche. And that when Bishop and I was very grateful to him about that. I know he looked at me as like, what is, John? He did it lovingly. And I'm used to. I already said the university's done that. That's. That's been my life. My. My family even talked to me that way. What are you. So."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":3822.14,"end":3824.54,"speaker":"Christopher Mastropietro","text":"But they said that to Jesus too."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":3824.78,"end":3855.14,"speaker":"John Vervaeke","text":"Yeah, well, that's not fair comparison. But, but, yeah, but that moment. And there was nothing. There was nothing flattering. There was nothing like Proforma. There was nothing like, well, we should do this to be polite. It was genuine, it was sincere. And people were caught up in the logos of the proposal in a way that I found tremendously powerful, to which I immediately started to feel a tremendous loyalty to the group."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":3857.38,"end":4020.3,"speaker":"Christopher Mastropietro","text":"Yeah, that's interesting. These two. Yeah. The way that your experiences are different yet speak to one another is interesting to me. I'll say that as simply the audience member. The thing that I would hope that the ambition that I would have about a series like that without having seen it. So I don't know to what degree this will be fulfilled, but will be to. To help the person watching it understand that whatever they think they understand about what it is to be a Christian in the way of the Gospels, probably not exactly on Mark, which is to say that the strangeness. You kind of alluded to it already, John. But the strangeness, the uncanniness, you know, I've been going through. You brought up David Bentley Hart, Jonathan. I've been going through his New Testament translation, which I don't find all that different and novel, but it's helpful just to go through it again in any case. And one of the things that he points out in his introduction, and as a Kierkegaard guy, this speaks to me a lot, is that what is required, like the robustness of what is required for he who calls himself a follower in the way of Christ is significantly more demanding than most Christians would believe. And there is a little bit of a shock to the system, I think, when that dilute the sort of the deluded version of Christianity, the Christianity that has turned into a kind of social pablum or something soft and fuzzy and cuddly, makes contact with the strangeness of it again. The uncanniness, that feature of it that is genuinely very shocking and that we should all be shocked by. And I'm curious to know to what degree. I don't want to get you to recapitulate the whole Gospel seminar, but, like, to what degree did you feel like that was present? The appreciation for the uncanny, the appreciation for the numinosity of Christ, but also the numinosity for the whole tradition. And the novelty of the fact that, like, this is actually something, if we take it in its proper register, that places a demand on us even to contemplate it, that is more than most Christian could. Most Christians could ever appreciate and would ever be willing to entertain for fear of being scandalized by its nieces."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":4020.3,"end":4102.95,"speaker":"Jonathan Pageau","text":"Yes, I think that that was exactly what you're describing. I felt like that was exactly. The spirit that animated the group was in some ways, you know, because when's the last time that you. I don't think I know of a time in my life where I've gone through the entire Gospel story basically in a few sittings where we talk for four hours a day. We went through it four hours a day over, I think it was like, seven or eight days. And you think that's never happened. And so I think that sense of strangeness and surprise and exactly this vision of the challenge that Jesus offers to us and to our world, I think came out quite a bit. You know, it's like, how can I say this? And it was fun because in some ways you had people like Bishop Baron or people that know the text very well, but they nonetheless were able to enter into that sense of surprise as well, because we're also not coming at it theologically. We're reading the story. So there were theological comments, obviously, along the way, but it wasn't coming from the theology into the story. It was actually coming from the story into the insights that the story is bringing to us. So I did feel. Definitely feel that. And yeah, and I hope that people watching it will also feel that wonder at the story again. I hope so."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":4106.47,"end":4142.87,"speaker":"John Vervaeke","text":"I set myself and my proper allegiance throughout was to exactly what you were talking about, Chris. I mean, my approach to this was in that sense, like Socratic in the Kierkegaardian sense that you were talking about there. I wanted to always, especially when we're in the perils. I was trying to make a case that the closest analogy is a Zen Cohen, not an allegory. I felt that's what my role. I don't want to diminish what Jonathan just said. Everybody took that up. But I went in setting myself up to take that role and to be responsible to it throughout."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":4145.43,"end":4150.15,"speaker":"Jonathan Pageau","text":"I love how this discussion has changed from me interviewing both of you to Christopher interviewing us."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":4150.39,"end":4151.19,"speaker":"John Vervaeke","text":"Yeah, he does that."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":4154.07,"end":4173.96,"speaker":"Jonathan Pageau","text":"So I think we, you know, I think we said quite a bit and maybe last question I have for both of you is, what's the next step? Like, what are you hoping the book will do, what it will open, and how do you see this whole project moving forward?"}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":4175.72,"end":4465.02,"speaker":"John Vervaeke","text":"So, I mean, I'm hoping that the book, I mean, obviously part two is coming and part two is going to go through more revisions than part one because part two is more scientifically based and science has a faster turnover rate. And so it's going to be a harder task. But I can't think of anybody I would welcome more to join me in, in that than Chris. So that's obviously sort of prosaically what's coming. I would hope also that I am trying to get people to pair these two things in mind, the meaning crisis and the advent of the sacred. And so the philosophical silk road, which I've talked to you about, is what's next in the most, I don't know, comprehensive fashion I can think. But it has things along the way. One of the things I'm doing right now, and I'm working with a student of mine, and then I'm going to involve Chris and other people down the road is I become increasingly dissatisfied with the psychological construct meaning in life. I used to just adopt it and I think it is in many ways very inadequate for what a lot of us have been trying to put our fingers on when we're talking about the meaning crisis. There are many dimensions that are missing. I've done this with other constructs. I've done this with wisdom, I've done it with attention, I've done it with mindfulness. And I feel very strongly that I now need to address this just to give one taste of the problem. The standard meaning in life metric is too local and too individualistic. So, you know, if people have friends and loved ones and projects they're working on, they're going to find their lives according to this metric, meaningful. But when I talk to these people, they'll say that's all true and, but. And that's the part where the meaning crisis actually lands. They don't find. So it's almost like in addition to meaning in life, we need meaning in world. How meaningful is your world? Is it ordered? Does it afford you self transcendence? Does it Give you proper education on overcoming self deception? Does it allow you to find fellowship with others? Does it help you feel oriented towards a deeper future? And when you ask people those kinds of questions, you don't get, yeah, yeah, it's going really well. They become very critical because they feel their lives are filled with burgeoning bullshit and burnout. They feel that they're starving for flow and for fellowship. And so part of what I want to do is by having the advent of the sacred and the meaning crisis, talk to each other, I want to try and articulate much better what is actually going on when we're talking about this meaning that's at issue. I wish I could even change what we're talking about here because it's more like we're now moving to a stage where we're coming to a decision like a kairos about how are we going to, to try and achieve meaning. Are we going to cocoon and withdraw into a little private sphere that we clutch onto and that's where we find our meaning in life? And Covid showed, ah, that's very dangerous. Or are we going to try and do what religions used to do for us is to open us and to consider a much more encompassing and transformative understanding of what it is to seek meaning in one's life. And it is inseparable from helping the world to become a more meaningful place for others and in itself. And sorry, that's just a very gist and it's inadequate because there's so much more going on. But for me, that's one of the next. The two big things are the philosophical silk road and this scientific project of articulating a reformulation of what we mean when we're talking about meaning in life. And then thirdly, I'm working on a project with two good friends of mine, Hussein and Daniel, and they're both graduate students. Daniel just successfully defended his PhD and we're going to create an academic article laying out the four P's of knowing to get it like really, really crystal clear and on a scientific footing. So those are the things that are what's next for me."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":4467.02,"end":4468.22,"speaker":"Jonathan Pageau","text":"What about you, Christopher?"}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":4468.22,"end":4469.26,"speaker":"Christopher Mastropietro","text":"I'm just hanging out."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":4474.7,"end":4503.35,"speaker":"Jonathan Pageau","text":"All right then. Well, look, the book is, it is out now, like it's available. So there it is right there behind John. So get, get the book, you know, brings it together and, you know, spread it around. It's easy to lend it to people to kind of help them understand their world and the world they live in and the issues, you know, the kind of issues that face us. And so I wish both of you really good luck with the book and also good luck with all these projects."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":4503.35,"end":4503.95,"speaker":"John Vervaeke","text":"That are coming on."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":4503.95,"end":4505.91,"speaker":"Jonathan Pageau","text":"And thanks for talking to me."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":4505.99,"end":4511.65,"speaker":"Christopher Mastropietro","text":"Thank you. Thanks for just being so supportive. Jonathan. Yeah, really, really, really appreciate it. Thank you."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":4511.65,"end":4512.45,"speaker":"Jonathan Pageau","text":"It's a joy."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":4512.69,"end":4519.97,"speaker":"John Vervaeke","text":"Really appreciate your friendship. Really appreciate your support. I know we'll be involved in projects forthcoming. I look forward to it."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":4519.97,"end":4537.17,"speaker":"Jonathan Pageau","text":"For sure. For sure. Thanks everyone. If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase. So go to thesymbolicworld.com and thank you for your support."}
{"episode_id":"SW - #383 - 2025-03-22 - John Vervaeke and Chris Mastropietro - Awakening from the Meaning Crisis","start":4537.9,"end":4598.82,"speaker":"Laura Diaz","text":"Tucson the Weight is Over Mediweight Loss they're officially open on North Oracle Road. That's right, no more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better, and lose weight the right way, Mediweight Loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com."}
