{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":0.16,"end":48.68,"speaker":"Richard Rohlin","text":"Right. Universal history isn't just, here's a narrative that goes from point A to point B, and then we try to, like, write ourselves or fit ourselves into the narrative. But actually it's a means of. You could say it's like a more ancient, more old world, more medieval understanding of time in which we're actually participating in the story of salvation in the life of Christ and of his mother, but we're participating through the natural world. Right, right. And so. And so that allows this understanding of time not to just be something that we larp. Not to just be something that like, oh, today is March 24th, I guess, since we don't know when Jesus was born. I'm going to celebrate Christmas today. Like, there are technically people who will argue that you can do that, but practically speaking, nobody does. And it's because we all know things don't really work that way."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":60.74,"end":102.33,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. Hello, everybody. I am back with Richard Rowland. And a lot of people were really fascinated by our last video on Groundhog Day and how it was related to the Feast of the Presentation of the Lord. And so Richard had the great idea to maybe look actually at the four major winter feasts of the church, how they are related to light and how they are, in a way, a kind of fulfillment of the Jewish feast of Hanukkah. And so, Richard, go ahead, start us off and I'll follow."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":102.73,"end":203.69,"speaker":"Richard Rohlin","text":"Yeah. So something I was telling you before, right before we hit record, Right. Is that the Feast of the Presentation of the Lord, or the Meeting of the Lord of the Temple, or the Purification of the Blessed Virgin Mary, AKA Groundhog Day. Right. These are all names that have been used for this, this particular observance that it's really the bookend, Right. Of. Of the kind of the whole winter cycle of the church. And this is something that gets lost nowadays, I think, sometimes, because in Western liturgics, there has been kind of this division of, like, sacred time and ordinary time or like the Paschal cycle and then secular time or, you know, something that. Right. So. So it's like all the really important events are, like, bunched up between Christmas and Pascha or Christmas and Pentecost, and then there's like this big swath of the year that just doesn't have a whole lot of big stuff going on liturgically. But actually, this is not the case in the medieval church, so it's still not the case in Eastern Orthodoxy today. And Eastern Orthodoxy, of course, as you know, we have the 12 great feasts and the 12 great feasts are kind of spaced all throughout the year. And together they sort of bring us into and help us participate in the life of Christ and of his mother and the whole story of redemption. So I wanted to actually start, though, by reading a little something from the Venerable Bede and the reason Bede was a very important Anglo Saxon monk and scholar at the time that he was living in the 8th century. He was probably the most well educated person in Europe, which is funny because he's sort of like, off here on the fringe."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":203.69,"end":205.57,"speaker":"Jonathan Pageau","text":"Yeah, he's off on the side there."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":205.65,"end":282.77,"speaker":"Richard Rohlin","text":"Yeah. But he writes pretty extensively about the whole. The symbolism and the connection between, you could say the astronomical cycle of the year or the solar cycle of the year and then the Christian year, and the relationship between these two things, which Bede sees as not arbitrary. So this is what he says. He says it is fitting that just as the sun at that point in time first assumed power over the day. So he's talking about the vernal equinox, or the feast of the Annunciation, which actually is tomorrow from when we are recording this. We're recording this on the 24th of March. Right. First assume power of the day, and then the moon and stars power over the night. So now, to connote the joy of our redemption, the day should first equal night in length, and then the full moon should suffuse the night with light. So this is talking about the Paschal full moon and ecclesial equinox and all this very complicated calculus for calculating the date of Easter, the date of Pascha, be saying, so at the beginning of time, you've got the sun to rule the day and the moon to rule the night. And now, because this is the Annunciation or this is the beginning of when the light comes into the world, there's once again a perfect balance between light."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":282.77,"end":284.25,"speaker":"Jonathan Pageau","text":"And darkness, between the full moon and."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":284.25,"end":314.39,"speaker":"Richard Rohlin","text":"The vernal full moon and the sun. Yeah. So it says this is for. For the sake of a certain symbolism, because this created sun, which lights up all the stars, signifies the true and eternal light which lighteth every man that cometh into the world. While the moon and stars, which shine not with their own light, as they say, but with an adventitious light borrowed from the sun. So, by the way, even back then, people knew that the moon reflected the light mirror. Yeah, yeah. Suggest the body of the church as a whole and each individual saint."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":314.73,"end":314.89,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":314.89,"end":322.29,"speaker":"Richard Rohlin","text":"So this really beautiful symbolism of the moon and stars. And of course, we all know that stars and planets are angels. Right. So you know, he's beat is just."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":322.29,"end":326.53,"speaker":"Jonathan Pageau","text":"Like, by now we all know. It's like, you can say that without controversy anymore."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":326.53,"end":327.69,"speaker":"Richard Rohlin","text":"I know, I know. It's great."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":327.69,"end":328.33,"speaker":"Jonathan Pageau","text":"Amazing."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":328.49,"end":328.97,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":329.29,"end":329.69,"speaker":"Jonathan Pageau","text":"These."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":330.01,"end":411,"speaker":"Richard Rohlin","text":"These capable of being illumined, but not of illuminating, know how to accept the gift of heavenly grace, but not how to give it. And in the celebration of the supreme solemnity, it was necessary that Christ precede the church, which cannot shine save through him observing the paschal season. This is what he says. Observing the paschal season is not meaningless, for it is fitting that through it the world's salvation both be symbolized and come to pass. Right? So what he's literally saying is the correlation between the vernal equinox, right, the beginning of spring and pascha, Annunciation, pascha, that whole psycho church that he's saying that relationship is not arbitrary, it's fitting. This is a really important word in Latin, right? This, this idea of something is fitting. It's proper, it's seemly, it's the way that things should be. And so this is the thing you have to sort of say, you know, people kind of get hung up sometimes on. We all know people who get hung up on this, you know, oh, well, maybe, maybe Christmas is just like a thinly veiled version of some pagan winter festival, right? That was about the dying sun coming back to life and all these different and. But the thing to understand is that there's no Canadian geometry. Jonathan Peugeot, do you know this phrase, the saying."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":411,"end":412.44,"speaker":"Jonathan Pageau","text":"Oh, I've never heard that before."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":412.44,"end":415.28,"speaker":"Richard Rohlin","text":"Okay, so it's a. Oh, you mean."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":415.28,"end":417.16,"speaker":"Jonathan Pageau","text":"That it's a universal truth. Yeah."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":417.16,"end":417.72,"speaker":"Richard Rohlin","text":"Right, right."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":417.72,"end":432.39,"speaker":"Jonathan Pageau","text":"There's something that is going to happen. You're going to have a feast at the solstice because it has nothing to do with imitating a big feast or whatever. It's just naturally, it's the only way pushes itself on us that this is an important moment in. In our story, right?"}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":432.39,"end":511.26,"speaker":"Richard Rohlin","text":"And it's. It's one of those ways like you can understand it. It's just like the ripple effects throughout time of Christ's incarnation and his birth, right? I think one of the most potent arguments for Christ being actually born in December. And I'm sure somebody out there will come after me about this, but whatever is just the fact that everyone knows something important happens right around December 25th. Everyone knows that. Everyone in every culture knows that, right? So I say all that to say, why is this part of universal history? Right? Universal history isn't just. Here's a narrative that goes from point A to Point B. And then we try to, like, write ourselves or fit ourselves into the narrative. But actually it's a means of. You could say it's like a more ancient, more old world, more medieval understanding of time in which we're actually participating in the story of salvation, in the life of Christ and of his mother, but we're participating through the natural world. Right. And so. And so that allows this understanding of time not to just be something that we larp. Not to just be something that like, oh, today is March 24th, I guess, since we don't know when Jesus was born. I'm going to celebrate Christmas today. Like, there are technically people who will argue that you can do that, but practically speaking, nobody does. And it's because we all know things don't really work that way. Yeah, yeah."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":511.26,"end":544.68,"speaker":"Jonathan Pageau","text":"And I think that it really is. Once you start to understand symbolism and how the world reveals itself in meaning, that it's necessarily so. You can't avoid meaning. You can't. For example, the idea that, let's say the equinox or that the solstices don't have meaning is so completely insane. You actually have more light in the world. Like the fact that that doesn't have meaning. You can go outside at 7. Like here, let's say I can go outside at 7. I can still do some work. There's still a sense, you know, there's. You can feel it in your skin that, like, the world is coming alive. So it's."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":544.68,"end":544.88,"speaker":"Richard Rohlin","text":"So."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":544.88,"end":558.92,"speaker":"Jonathan Pageau","text":"It's so deeply intuitive. The idea that that doesn't have meaning and that the world of meaning wouldn't participate in that experience is misunderstanding how. Misunderstanding how meaning works and misunderstanding how we experience the world."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":559,"end":664.11,"speaker":"Richard Rohlin","text":"So. Yeah. So what I wanted to do in today's video is actually to shed a little light, as it were. Yeah. On the winter festivals of the church. Right. Because we typically think of Christmas. And I think part of the reason so many people. I mean, I had so many people come up and talk to me or just reach out to me randomly from all over the Internet about the Groundhog Day video because it sort of blew their mind that there was this connection between this weird little relic of, like, American culture and then. And then, you know, an actual feast of the church. But what I want to do is kind of expand on that a little bit and show how Groundhog Day is. Actually, there are these, we could say, four winter festivals of light in the ancient church. And the way that these four winter festivals of light actually sort of come together and expand on this idea or sort of show the Christological reality behind the idea of Hanukkah. And so actually putting this material together started with a question that somebody asked. Actually, two people in one week asked me this question. And then the following week, somebody else asked me that question, like, three times in two weeks. Somebody said, well, why don't Christians celebrate Hanukkah? Shouldn't we just celebrate Hanukkah? And if we've got Jewish listeners out there who do celebrate Hanukkah, great. I mean, you know, I'm not. I have no beef with Hanukkah, right? But I do believe, obviously, that Christianity is true and that Orthodoxy is true, and that all of the sort of the themes that we find in the celebration of Hanukkah, right, this theme of the restoration of light and then this theme of the restoration of the temple, we actually find all of these things being fulfilled, not just in one feast, but in four feasts. So it's like. So my answer to that is sort of like, I'll do you one better. Let's celebrate Hanukkah four times."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":664.11,"end":700.54,"speaker":"Jonathan Pageau","text":"Four times. But it's important to understand that as Christians, we understand that all of the Old Testament and all of the old feasts, all of the laws culminate into Christ. And so it's not that they stop existing, it's that they find a type of fulfillment which actually sometimes transforms them, sometimes flips them, does all these things with these. With these rules, with these stories. But they. Because they're. But they are fulfilled in Christ. And so the Christian liturgical year is actually coherent with the ancient Jewish liturgical year. It's just that it is re. Seen or recast in the story of the Incarnation."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":701.04,"end":720.56,"speaker":"Richard Rohlin","text":"And we see this in the words of Christ himself because of course, quite famously, in the Gospel According to St. John, Christ celebrates Hanukkah. In the gospel according to St. John is called the Feast of the Rededication. Right? But that's what it is. He goes to the temple and he goes to celebrate this feast. And it's in the context of that feast that he very famously says, I am the light of the world."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":720.8,"end":721.2,"speaker":"Jonathan Pageau","text":"Right?"}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":721.2,"end":742.7,"speaker":"Richard Rohlin","text":"Right. So he's going to this festival of light and he's saying, actually, I'm the light, right? And so what's he doing? He's filling that feast with himself. And the whole experience of the church since that moment that eventually develops into these winter festivals of light is, you could say it's an extended attempt to exposit that, to understand what does it mean for Christ to be the light. Of the world."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":742.7,"end":752.3,"speaker":"Jonathan Pageau","text":"And so many people will know. But I think it's probably a good idea nonetheless for you to just tell people what Hanukkah is, what the origin is, and what the basic premise of the feast is."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":752.3,"end":857.38,"speaker":"Richard Rohlin","text":"So Hanukkah is a Jewish feast. It's not one that was actually commanded by the Mosaic Law, but it was instituted later following the victory of the Maccabean heroes against the armies of Antiochus IV Epiphanes. And so the Maccabean heroes reconsecrated the second temple in Jerusalem, which had been looted and desecrated. And they did this in an eight day, very important number there, in an eight day ceremony which culminated in the resumption of the daily sacrifices, which had ceased at that point for a period of about three and a half years. And as an actual feast celebrated by the Jewish people, Hanukkah is first mentioned in the first century, right around the time of Christ. So it actually seems that when Christ went to celebrate it, it was probably maybe a somewhat new liturgical celebration. And the original story of Hanukkah, we've all kind of probably heard the story. I think they even tell it on like an episode of Friends or something back in the day. Right. It's like a major part of, you know, pop culture living in America. You probably sort of know there's the story about they didn't have enough oil, but then the oil burned for eight days. That's a. That's a fairly late medieval version of the story of Hanukkah, which is sort of the thing that people remember now, but the original. You know, if you go back and look at writings from around the time of Christ and up to about the 6th, 5th or 6th century, what you actually find is that the, the story of Hanukkah, the celebration has to do not with the restoration of the menorah light in the holy place, but actually with the. The restoration of the sacrificial fires, which they're always supposed to keep lit and then were not lit three and a half years. And then sort of this flame is miraculously revived from the ashes."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":857.62,"end":858.26,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":858.66,"end":892.45,"speaker":"Richard Rohlin","text":"Which is very important to understanding because the theme of Hanukkah is really about the. You could say the restoration of the temple, right? It's the reconsecration of this space where God can be properly worshipped. And obviously this is a very biblical idea. It is, dare I say, a very orthodox idea. The restoration of an earthly temple is an idea that no orthodox Christian, and hopefully no Christian of any sort should despise. Right. If the Turks gave us back Hagia Sophia tomorrow I would be on an."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":892.45,"end":895.05,"speaker":"Jonathan Pageau","text":"Airplane to be there, participated in its reconsecrate."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":895.05,"end":921.01,"speaker":"Richard Rohlin","text":"Yeah, right, exactly. So this is not a bad thing. However, it is more perfectly fulfilled in the restoration of what I would say is the Temple of the cosmos, which is kind of the theme. So that's what these four winter feasts do. They take this restoration of the temple and they turn it into a restoration, not just of one earthly building in Jerusalem, but actually the restoration of the temple with man at its center as the image and as the high priest."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":922.77,"end":952.56,"speaker":"Jonathan Pageau","text":"That's why we can understand the relationship both with the solstice, which is the, let's say, the relighting of the sacred fire in the sky, where the light is going down, down, down, and then it's relit. We can also understand the Incarnation as the moment where the new temple is rededicated, where in the darkness of the cave, this temple appears, almost the secret part of it that appears and is going to start to reveal itself as the story kind of continues."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":952.98,"end":1128.04,"speaker":"Richard Rohlin","text":"Yeah. So if you're familiar with the feast of the Church, you'll know that actually you can already see the theme of the temple emerging just in the names of the two of the feasts that bookend the cycle of four winter feasts. So the four winter feasts are the entrance of the Theotokos into the temple, which in the Western liturgical tradition is also called the presentation of Mary. Yeah, and then, so that's one sort of bookend. And then as you move into these four feasts, they form a sort of chiastic structure. So you have Mary presented at the temple, and then you have the Nativity, and then you have Theophany or Epiphany, and then you have the presentation of the Lord at the Temple. Right. The meaning of the Lord of the Temple, the presentation of Jesus, Candlemas, purification of the Blessed Virgin Mary, whatever you want to call it. And so these two feasts on the bookend, you know, they're very similar in their focus and even in liturgically they're way that they're observed is very similar. And of course, the Gospel reading for the meaning of the Lord at the Temple ends with Saint Simeon the God Receiver, foretelling the sufferings of the Mother of God at the foot of the cross. So you can even see how this whole set of feasts is bookended by the Mother of God. She becomes, you could say, the container for the mystery, just in this. Very much the same way she actually bookends the entire Christian year in the east, which begins with her Nativity in September and then ends with her dormition in August. So, and just as an aside, in the Western liturgical tradition, the subsequent feasts of the Nativity of Mary, the Holy Name of Mary, which is Western feast, and then the Presentation of Mary exactly parallel Christmas, the Feast of the Holy Name of Jesus, which is the Western version of the circumcision, and then the presentation of our Lord. So I'm just saying all that to say there are various angles that we could study these feasts from. For my purposes, I'm going to just talk about the tradition of the Eastern Orthodox Church, because it's what I know and have experienced. But I do want to go on record as saying, in the Western liturgical tradition, these winter feasts are also present, and they also manifest in some really beautiful and interesting structures. So to talk real quick about the entrance of the Theotokos into the temple, this feast begins. The very first hymn for the feast says, today, let us the faithful dance for joy, singing to the Lord with psalms and hymns venerating his hallowed tabernacle, the living ark that contained the Word, who cannot be contained. For she, a young child in the flesh, is offered in wondrous fashion to the Lord. And with rejoicing, Zacharias, the great high priest, receives her as the dwelling place of God. So this is the major theme of the feast, which is introduced right at the very beginning of vespers, and that is the coming of the new and living Ark into the Temple of God. Now, it should be noted, and people who have watched the Universal history series will know that the ark has been missing from the temple for quite some time. There are different culprits who might be responsible for this."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":1128.12,"end":1129.96,"speaker":"Jonathan Pageau","text":"Come on, Richard. We know where the Ark is."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":1130.2,"end":1155.97,"speaker":"Richard Rohlin","text":"We know where the Ark is. You're right. You're right. For several hundred years now, there's been no Ark in the Jerusalem Temple. And this is something to which both scriptures, so this is in the book is mentioned. The fact that the Ark is absent is mentioned in Second Maccabees, which, if you're an Orthodox Christian or a Roman Catholic, so the majority of Christian world, that's in your Bible. And then also there are also eyewitness accounts, like those of Pompey the Great, that talk about walking into the most holy place."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":1156.05,"end":1156.85,"speaker":"Jonathan Pageau","text":"And there's nothing."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":1156.85,"end":1310.18,"speaker":"Richard Rohlin","text":"There's nothing there. Right. We know from archeology and history that there were many arks in the ancient world. And I think they actually talked about this a little Bit on a recent episode of Lord of Spirits. But to understand what an ark is, it's essentially a ritual channel chest which functions both as a reliquary. So it holds items that are sacred to the cult of the God and then also a ritual seat of the God himself. Right. And these chests were usually carried on poles, they're usually overlaid with gold, and crucially, they usually have a lid that bears the image of the deity. So a good example of this, if you look up, you can just Google, like, the Anubis chest. This is from the. The tomb of King Tut in the Valley of the Kings. And if you look up a picture of this chest, it looks very similar to the Ark of the Covenant. In fact, it even has cherubim, you know, with the wings on it. But in this case, they're on the side, not the top, but it has the cherubim. Right. And then on the very top. Obviously, an important difference is it has an idol of the God Anubis on top. Right. So when God commands Moses to make an ark and shows him the pattern for doing this, you know, to great exact detail and measurements, he's not asking Moses to make something he's never seen before. What's unique about the ark are its contents, which prefigure Christ and his mother. And you can consult almost any church father writing about this subject will talk about this. And then it's lid. And of course, the important thing about its lid is that the lid bears not a depiction of the God of Israel. For at this point, Israel was not allowed or able to depict their God, but rather it bears two guarding cherubim. Right. And the cherubim are sort of the throne. They carry or guard the throne of the deity. So the message of Moses's ark was clear. This box is the throne of the God of Israel, whom the Hebrews cannot depict. And what we see in the Old Testament is that where the ark goes, so goes the presence of God. And actually, for the feast of the presentation of the Theotokos at the temple, all of the Old Testament readings are focused on the ark, and they're focused on what happens when the ark goes somewhere. And Exodus, chapter four, third kingdom seven and eight, and the third reading from Ezekiel 43 and 44, obviously, very famously solidifies this relationship between Mary and the temple, where we see the Theotokos as being the new temple, as being the eastern gate through which only the Messiah can pass. And by the way, this is a really ancient patristic understanding of this passage."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":1311.14,"end":1340.78,"speaker":"Jonathan Pageau","text":"Yeah, it's important to understand. So it's important to understand that she is. That's it. That's really. That's the most important aspect of her, is that to understand that she is the Ark in the context of the incarnation. But then she also represents not just that she physically is the ark, but that also we as the church will become the ark, that we as individuals will become something akin to the Ark. And she is the place where all that comes together into one person who became the vehicle for the incarnation."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":1341.07,"end":1432.32,"speaker":"Richard Rohlin","text":"Right. And so, of course, every time that the ark is brought into the. When it was brought into the tabernacle in Exodus, and then when it was brought into the temple in Second Kings or First Kings, in each of those cases, what happens? The Holy Spirit. Right. The glory of God fills the temple. Right. It's like nobody can even begin there because it's too much. Right. And this never happened in the second Temple. The glory of God had never filled it in the way that it filled the Tabernacle of Meeting or the Temple of Solomon. But the tradition of the church is that when Mary entered the temple as a young girl, that the Holy Spirit filled her as the new ark in a tangible way. And I'll just say here, as an aside, people will say things like, oh, well, that could never have happened because they would never have allowed a woman into the temple building. Listen, no one is saying this is an ordinary circumstance. That's such a silly argument to me. It's like, here's a miraculous thing. Well, miracles don't happen. So that, you know, it's okay, whatever. But. But the tradition of the church is that when she entered, the Holy Spirit filled her as the new Ark. And this way, for the first time, in a tangible way, the Holy Spirit actually entered the holy of Holies, the place where the Ark was supposed to be kept. And this is why it is really significant in our tradition to emphasize the fact that. That she was brought into the holy of holies. Something that was missing from the second Temple, even after it was reconsecrated, was this presence of God with the Ark. And now that's been restored. So, again, if our whole theme is the restoration of the temple as a place where God can dwell, that's the theme of this first feast."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":1432.72,"end":1459.88,"speaker":"Jonathan Pageau","text":"Yeah. And I would say to. Like to. Let's say to people like Protestants that are watching this, who struggle with the fact of this, like they struggle with the idea or whatever. I mean, fine, you'll get there in time, but in the meantime, notice the important analogies and the important typology that is being brought about, which is absolutely and completely true and is necessary for us to understand the significance of the Incarnation and what it means for us, even as a church."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":1460.28,"end":1492.86,"speaker":"Richard Rohlin","text":"Yeah. So Mary becomes a literal ark. Right. And when she does this, she fulfills the, you know, the prophecy of David in Psalm 44 or Psalm 43, you know, when it says that virgins shall be brought to the king after her, her companion shall be brought unto thee. With gladness and rejoicing, they shall be brought, and they shall be brought into the temple of the King. So this is in the Psalms, David prophesies that there's going to be this woman who's going to be a queen of Israel and she's going to be brought into the temple. This does not happen anywhere in the Old Testament."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":1492.86,"end":1493.34,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":1493.74,"end":1532.1,"speaker":"Richard Rohlin","text":"And for no one before her was this ever true. But the tradition of the church does record that Mary was accompanied by young women of her people going before her with candles. So there's like another kind of connection to Candlemas and that she's brought into the temple of the King. Right. And elsewhere we see her in the hymns of this feast, referred to as an acceptable sacrifice, that she was brought into the holy of holies because she was a sacrifice acceptable to God. So the idea is that she becomes a literal ark. Her womb carries not merely relics, but God himself. And on a very literal level, her lap becomes a throne on which Christ sits."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":1532.74,"end":1558.15,"speaker":"Jonathan Pageau","text":"And that's in terms of iconography. It's really. People need to understand the basic image. One of the basic images of Christianity is called the throne of wisdom. And you see the Mother of God sitting as she's sitting on a throne, but she herself becomes a throne. And Christ is sitting on her lap centrally, usually with his head on her heart. And so she becomes the ark that surrounds him, and then he is the glory sitting on the ark."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":1558.15,"end":1921.71,"speaker":"Richard Rohlin","text":"Yeah, yeah. So this kind of sets up this whole theme of the restoration of the temples and the Orthodox Church. We celebrate this feast in November, just a little bit into the Advent fast or the Nativity fast for us. And this is the first of the really the four great winter celebrations. Now, the next one is obviously Nativity or Christmas, which most of us think we probably know a lot about, because Christmas is one of the few surviving things. In fact, this is a great book by Eamon Duffy. It's called the Stripping of the Altars. If you want to know what was Christianity like in England before the Reformation, and why was it awesome? This is a great this is a great book. But one of the things he talks about in here is that Christmas is kind of the only survival in many cases of a lot of the old church year, even. Even Easter, especially growing up evangelical, right? We never. We sort of never really knew what to do around Easter. In fact, I remember one, one year something had come up and we didn't have the Easter, you know, the Easter thing, like the cantata or the play or whatever, ready in time. So we just decided we'll just celebrate Easter a month later. Like nobody really knows when it happens, so let's just celebrate it a month later. You know, it's not great, but. But somehow Christmas. Christmas is. Has held on a lot longer for many of us. But there are some themes that have to do with the restoration of the temple and this theme of the sort of the revival of light or the preservation of the light in the darkness and the connection of all those things which. Which are maybe not obvious to us now. So the troparia of the four feast. So like the day before Christmas, Christmas Eve, we sing Mary once with agent Joseph went to be taxed in Bethlehem, for they were of the lineage of David. And she bore in her womb the fruit that had not been sown, which is a great. That's a great line. The time of the birth was at hand and there was no room in the end. But the cave proved a fair place for the queen. Christ is born, that he may raise up the image that before was fallen. And the two things I want to focus on here are, first of all, the idea of the cave, right? And I know that you've done some great videos of this on your channel, but it's very important that it happened in a cave, which is not said anywhere in Scripture. And yet, of course, pretty much everyone today, if you ask them, they'd say, oh, well, of course, they didn't have enough wood to build a stable or something like that. The economics of the situation are the most important reason that it have. It happened in a cave, right? But usually, like, even movies and things like that will show it as being in a cave. And I think it's because we do know deep down that this is a very important symbolism of the cave, right? The cave is the womb, the cave is the grave, and the grave as a womb, right? Which is what it is for Christ and the connection of all those things. But the other thing to mention here is this idea that Christ is born, that he may raise up again the image that before was fallen. We get the extended gloss on this with another triparia that says, make ready, O Bethlehem, for Eden hath been over open to all. Prepare, O Ephrathah, for the tree of life hath blossomed forth in the cave from the virgin, for her womb did appear as a spiritual paradise, in which is planted the divine plant whereof eating we shall live and not die as Adam. Verily Christ shall be born, raising the image that fell of old. So both of these hymns take us all the way back to the beginning. They take us back to Genesis, back to Eden, and we can think about the fact that in Genesis, after our first parents are cast out of the garden, there's a cherub who's set to guard the entrance to paradise with a flaming sword. And this is way worse than just being banned from, like, a nice place, like, just being, sorry, you can't come back to Colorado Springs. In the ancient near east, this word paradise means a walled garden. If you listen to Lord of Spirits, you'll know quite well that the whole idea of is that God lives in a garden at the top of a mountain. Everyone in the ancient world near east knew this, believed this. And actually on the Orthodox Arts Journal, Andrew Gould has a great series of articles. They're from a few years back, but I really recommend people go and read them where he gets really, really specific into the relationship between ancient paradise gardens and then the layout of our Orthodox churches today, which are sort of reminded, intended to remind us that when we stand together in church, we're actually participating in heavenly worship. We're in paradise. And so in the ancient world, at the conclusion of the construction of a temple, they would place the. The God in the center of the temple. And in ancient Egypt, they did this through something called the. This ritual was performed by these group of priests who were called the SEM Priests. They wore these leopard skin robes. I don't know why that's the detail that stuck out in my mind. And they would perform a ceremony called the opening of the mouth, by the way, they also did this when they would mummify someone. So, you know, the idea of like, the dead person becoming like, you know, like an image or like an idol and this. Basically the idea is to imbue the statue of the God with the spirit of the God or the person it depicts, and therefore allowing them to act as surrogates for the person who commissioned the image. And what numerous biblical scholars. Obviously, if you're watching Symbolic World, you probably are familiar with Father Stephen DeYoung. He's got a great article on this called Man Is the image of God in reverse that you can go and read about. I'm not going to read everything from that, but the whole idea here is this idea of God creating a temple for himself in the cosmos. That's what Eden is supposed to be. That's what paradise is supposed to be. And then you have man at the center of Eden, at the center of paradise. We're told that he placed man in the midst of the garden, is supposed to be there as the image and then also as the high priest. So he performs this priestly function of naming the animals. Right. This is really essential to understanding, like, why are we here on this planet? Like, you know, it's really cosmic, essential stuff. And then, of course, what happens is that the image falls over. The image becomes sullied."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":1922.27,"end":1922.59,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":1922.59,"end":2009.16,"speaker":"Richard Rohlin","text":"And so man can no longer take that place of priest in creation. And actually, what we find is any time we attempt to do. I shouldn't say any time, but most of the time when we attempt to, like, take dominion, what it actually looks like is, you know, disaster. Like, we kill things, we. We oppress things, we destroy our environment. We do all these things because we're just, you know, the image is fallen. You know, we are supposed to take dominion, but not in that way. Right. And so you can see the process of pagan temple dedication reversed in Genesis. Right. And that's a foreshadowing of the incarnation. And so you've got Eden as a temple. The temple is, you know, Moses, tabernacle and Solomon's temple. They're supposed to be icons of Eden. And so what we find in the mystical truth of the feast of Christmas is that the cave, which is probably not a very glamorous place, becomes the container for the Mother of God, who is herself the new spiritual paradise. In other words, she's the new Eden, thereby opening Eden to all. So in this new Eden, there's a new divine plant, there's a new tree of life, which is somehow the cross, but is also Christ. And it's the exact opposite of the fruit that brings death to Adam. So in the new tabernacle of creation, we see Christ raising up the image of God, raising up human nature, and making it possible for there to be true worship and communion again. Why? Because there's a new fruit to eat and there's a new priest to give you that fruit. Yeah."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":2009.16,"end":2059.29,"speaker":"Jonathan Pageau","text":"And you can see, for people who are interested, if you look at an icon of the Last Judgment, for example, you will see that on the right side of Christ, at the bottom of the Icon, there is an image of paradise. And you see usually at the door, St. Peter sometimes, and St. Paul coming to the door of Paradise. And the cherub is there. The cherub's going to let them in. And then in paradise is usually an image of the Virgin sitting on a throne. It's not just because she's in paradise, but it's because she is paradise. You know, she is the place where the garden was restored and, you know, the Tree of Life was restored in the person of Christ and in the cross. So, you know, it's important to understand that for ancient thinking, these things really coalesce and that there's absolutely no problem in seeing all of these things coming together, like in the hymn that Richard. That Richard recited."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":2059.45,"end":2183.42,"speaker":"Richard Rohlin","text":"And something I'm really keen to try to communicate here. And it's. It's hard to think about exactly how to say this, but you could say that there are two extremes that you want to avoid. And one would be just like getting the super cosmic vision of everything that's so large, it stops being specific, right? And so I know there are some people out there who'd be like, oh, these are great ideas. And other religions have them, too. And things like, so it must all be true, right? Or just sort of that attitude of, well, this here's an idea that's so high, you know, that it has. In other words, like, it's all. It's all heaven and no Earth, it's all spirit and no body, that it doesn't actually matter when we celebrate Christmas, or it doesn't actually matter when we celebrate Easter, right? Or the worst version of that would be because I know that this happened. I don't actually need to celebrate anything at all, at all. Because I already. Because in my head, like, I already know what happened, right? The other thing that we want to avoid is being so particular in our celebration of these things that we can't see their cosmic significance in the way that they actually fill our lives. Now, this is the important thing about. We're talking about, like, a medieval view of time or history, which is kind of what this universal history thing has evolved into. As we've had these discussions and as I'm, you know, sort of mulling over this book idea in my mind, and things like this is they weren't satisfied to say, oh, well, now that I've become a Christian, I guess there was this Noah guy, right? What they're doing is they're looking at that table of nations, Genesis, and they're saying, well, where do we Fit in where. Where do our people come into the story? Right? And so here in this feast of Christmas, right, you see the theme of Hanukkah, which originally has this very specific historical context, and it's made universal that Christ, in his miraculous incarnation and birth, accomplishes the perfect union of heaven and earth. He restores human nature to its rightful place, made in the image of God or as the image of God. And in the process, he doesn't restore just a temple at Jerusalem, but he restores the temple of the cosmos, the temple of creation. Yeah."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":2183.42,"end":2210.5,"speaker":"Jonathan Pageau","text":"Which is Eden, which is Paradise. Paradise is the cosmic temple. It's important to understand that the Jerusalem temple or the Tabernacle were surrogates for Eden, for the garden. If you don't understand that, you won't understand the structure of Eden. You won't understand the structure of the garden. Why there's a cherub, why there's all these things that are basically just representations of the Garden of Eden, Right. We need to be able to understand that in Christ, these symbolisms will start."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":2210.5,"end":2210.94,"speaker":"Richard Rohlin","text":"Will be."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":2210.94,"end":2218.34,"speaker":"Jonathan Pageau","text":"You'll see in the hymns, like, they. They cross over and they join together, and there's references to all the different levels as this is happening."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":2218.58,"end":2306.14,"speaker":"Richard Rohlin","text":"So that was exactly what I wanted to mention next, is that if you look at the hymns for the feast, they just pull all of these different levels of understanding together just in such a beautiful. Here's the thing about Byzantine hymnography. I'm not going to say it's as catchy as, like, Western hymns or like, you know, praise choruses or whatever kids are doing these days. You know, your Christian raps and your whatever. You know, it might not be as catchy as all that, however. I don't understand youth culture, however. It's so beautiful, it's so precise and it's so poetically rich, which is why I think it's sort of like it transcends whatever's in vogue at the moment, right? It transcends that and will continue to endure beyond that, you know, even when all of your raps are, you know, in the dustbin of history, you know, so there's this hymn at the vespers for the feast of the Nativity, which is the middle wall of the partition, has been destroyed. Talking about the veil being opened, the flaming sword turns back, the cherubim withdraw from the tree of life, and I partake of the delight of paradise, from which I was cast out through disobedience. And then as soon as we sing that, we read Genesis 1:1 through 13. So it's the service of the church. This is not just me and Jonathan saying this. It's the service of the church that's putting this in front of you and saying, guys, we're doing Eden again, but it's going to be great this time. Right? Yeah."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":2306.14,"end":2368.42,"speaker":"Jonathan Pageau","text":"And it's. And it is a cosmic restoration and also a reawakening of the significance of man, you know, in Christ. And so it all the different. The personal level, you know, the social and the cosmic level come together. And so. And it's. What's great about already with the two feast that you can see is. You can see there's a. There's a logic of. I've mentioned this before, where before light comes darkness, you could say, or before the answer of heaven comes the tohu bohu becomes this emptiness and void, which is, in a way, a calling. It's like asking to be filled. It's a question that is looking to be answered. So you can see in the setup of the feast where, you know, the darkness comes before the dawn, right. This darkest moment appears as the space. We have to prepare the space. And then once the space is prepared, that's when the glory of God then descends on the ark, which has been prepared for it to come. And so you have the presentation of the Virgin and then you have nativity. And the logic of it makes complete sense."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":2368.58,"end":2378.82,"speaker":"Richard Rohlin","text":"Yeah. And so that's a great way to think about this because you sort of have the. Let's say the going in, which is what these first two feasts are. If it's sort of chiastic structure, you have the going in and then you have the coming out."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":2378.9,"end":2379.22,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":2379.22,"end":2387.54,"speaker":"Richard Rohlin","text":"With these next two feasts. So the going in is like the. The holy space is being prepared, and then the next two are the revelation of the light."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":2387.99,"end":2388.47,"speaker":"Jonathan Pageau","text":"Exactly."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":2388.71,"end":2443.02,"speaker":"Richard Rohlin","text":"Yeah. So you've got theophany, which is the next one we'll talk about. Obviously, there's a lot going on in theophany. The very first thing that we hear about theophany in the church year, practically speaking, is this theme of warfare. Right. Make ready, O River Jordan, for behold Christ, our God draws near to be baptized by John that he may crush with his divinity the invisible heads of the dragons in thy waters. Which is a cool. I mean, it's a best thing. And I'm really gonna talk about it. But it's. But I mean, this is the thing. And of course, this is. That's a reference Back to Psalm 73 in the Septuagint. This. You know, these dragons in the Waters, these demonic powers, the exorcism of the cosmos. Right. Also, one of the main major themes of the baptismal service. And, you know, because Yahweh, the God of Israel, is the one who breaks the heads of the dragons in the waters. Right. Which is what the. The psalmist says."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":2443.1,"end":2443.58,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":2443.98,"end":2452.98,"speaker":"Richard Rohlin","text":"And of course, we show that on the icon of the feast. You can. You can find lots of stuff out there about this now, which is a great thing. Father Stephen DeYoung has some stuff. I'm sure you've done some video."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":2452.98,"end":2453.98,"speaker":"Jonathan Pageau","text":"Yeah, I've talked about that."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":2453.98,"end":2462.22,"speaker":"Richard Rohlin","text":"Yeah. So. But the other theme that's going on there, Right. Is the theme of illumination or the revelation of light. Right?"}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":2462.54,"end":2467.26,"speaker":"Jonathan Pageau","text":"Yeah. We have to understand it as. Because we often tend to think of the baptism as the going down in the water."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":2467.26,"end":2467.62,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":2467.62,"end":2469.82,"speaker":"Jonathan Pageau","text":"Which actually corresponds to the first part."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":2470,"end":2470.96,"speaker":"Richard Rohlin","text":"Of these two feet."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":2471.28,"end":2517.93,"speaker":"Jonathan Pageau","text":"It's like this is the going down. But now what we're talking about mostly in theophany is the coming out of the water, where Christ is coming out of the cave. And you have to understand the bottom. The bottom of the waters as equivalent to the cave itself. So Christ comes out of the waters, and then the Holy Spirit comes down and it's a recreation of heaven and earth. Like, everything gets revealed. In terms of what. In terms of the new structure, you could say in terms of light, this is what is most important. That's why some of the images might confuse people sometimes with theophany, because you have all these images of baptism, but then you have all these images of light. But it makes sense if you understand it as Christ has gone down in the waters, is now coming up, and you hear the voice of God revealing the Logos to the world. And that light and the revelation of the Logos is what is going on."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":2518.09,"end":2679.36,"speaker":"Richard Rohlin","text":"Yeah. I mean, that's the whole reason that in the Christian tradition, baptism is referred to as illumination. Right. So, I mean, the baptismal service is fresh on my mind. I love going to baptisms. Like, if you get to go. I mean, we have a lot of. We're going through sort of a baby boom at my parish right now, so we go to lots of baptisms, and that's great. And of course, we just had one in our family for my daughter. But the baptismal service, I mean, it's great because, like, every time you go to a baptism, it's like a refresher course on your own baptism. Right. And, yeah, that's the whole theme throughout baptism is. Is this theme of illumination. Right. The word neophyte originally Meant and really still means somebody who's been recently illumined. Right. And so to kind of your point about needing to understand this, because it does have the going in portion and the coming out, is that every one, four of these feasts, if you were to look at them closely, you would see that they actually there, it's a fractal. It's actually true for all the great feasts of the church. Every great feast of the church. So Annunciation is coming up tomorrow. If you look closely at Annunciation, you'll see in it. Every other feast is in there. Pascha is in there. Christmas is in there. Right. The Passion is in there. Right. It's all in Annunciation. And that's true. Obviously, everything sort of gathered up into Posca. So they're all sort of like fractals of each other and. Yeah. So the big focus, right, of theophany, other than spiritual warfare, the big focus is. Is of illumination. Right? So we have Christ being himself, the bestower of light. Jesus needs not to be baptized, but in the flesh. He descends into the streams of the Jordan, wishing to give light to those in darkness. Let us go eagerly in faith to meet him. So the idea is he's bringing the light kind of down to us. Right. Stena from the Syrian has this wonderful idea of sort of Christ going down and leaving the garment of light at the bottom of the waters. Right. So that when we are baptized, we kind of go down and bring it up and get it on. Right. I love that so much. Now, the connection to the. Our master theme, right, which is the restoration of the temple. This might not seem like immediately clear, but we need remember that both the original occasion of Hanukkah, as well as its more common name in the ancient world, was the festival of lights. And the occasion of this feast, this is referred to in John chapter 10 as the feast of the dedication was to celebrate this rededication of the Jerusalem temple following this military victory. And by the time of Christ, it's already known as the festival of lights. And this is again tied to, originally to the miraculous relighting of the altar fires. That later story of the oil that last for eight days is like a later kind of accretion, but you can understand why it still symbolically participates in that."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":2680.24,"end":2683.84,"speaker":"Jonathan Pageau","text":"It's very similar image. It's just, yeah, slightly different."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":2683.84,"end":2691.32,"speaker":"Richard Rohlin","text":"But basically, when I say stupid modern, academic things, like that's a later accretion. Like, I'm not. I'm not actually saying. I'm not actually saying, like, it's A."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":2691.32,"end":2692.64,"speaker":"Jonathan Pageau","text":"It's not amazing. You're still."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":2692.64,"end":2695.96,"speaker":"Richard Rohlin","text":"You still think it's amazing? Yeah. I mean, it's gonna admit that maybe."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":2695.96,"end":2697.16,"speaker":"Jonathan Pageau","text":"It'S a later legend."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":2697.16,"end":2702.07,"speaker":"Richard Rohlin","text":"Yeah. But it perfectly participates in the overall symbolism, you know, so I'm. You know, I'm fine with it."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":2702.07,"end":2702.47,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":2702.47,"end":2776.63,"speaker":"Richard Rohlin","text":"Not that anyone cares, but I'm fine with it. But it's. It's in the context, right, of the celebration in John chapter 10 that of course, Christ declares, I am the light of the world. Right. And so what Christ is doing is he's offering himself as the exegesis of this essentially Old Testament feast and also perfectly clarifying its deep connection to theophany. So on theophany, the church commemorates and participates in Christ's conquest of the demonic powers which have enslaved mankind and infested the cosmos. And then the result of that is the light which, as St John says, enlightens every man that comes into the world. So in theophany, we see the cosmos once again becomes capable of being offered up to God in this act of thanksgiving with man as the priest of creation and the image of God which is restored. Right. So that brings us to the meeting of Lord of the Temple, which we talked about quite a bit last time. And I just want to maybe spend a little bit of time, because I don't. Actually, I should have gone back and listened to the video again because I don't remember how much we said about this last time. Did we talk about the. The eucharistic focus of the video in the video? The Eucharistic focus of that feast? Well, we're going to talk about it. I don't think so."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":2776.63,"end":2776.99,"speaker":"Jonathan Pageau","text":"I don't."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":2776.99,"end":2951.02,"speaker":"Richard Rohlin","text":"Okay. I don't think we got to it. We were trying to talk about Groundhog Day. Groundhog Day, Right. So the hypnography and the iconography of the Orthodox Church for this feast focuses particularly on the handoff of the Christ child from the Theotokos to Saint Simeon. And when he does this, we're sort of deliberately reminded of another time a prophet of God met Yahweh, the God of Israel, in the temple. So in Isaiah, chapter six, which we read at the vespers of this feast, we have the story of Isaiah. If you don't know it, this is Isaiah the prophet. He comes to the temple and he has this mystical vision of seated in glory in the temple, says, in a year that King Uzziah died, I saw the Lord sitting on a throne high and lifted up, and the train of his robe filled the temple above it. Stood the seraphim. Each one had six wings. With two he covered his face, and with two he covered his feet. And with two he flew. And one cried to another and said, holy, holy, holy is the Lord of hosts. The whole earth is full of his glory. And the post of the door was shaken by the voice of him who cried out. And the house was filled with smoke. And. And so I said, Isaiah said, woe is me, for I am undone because I am a man of unclean lips, and I dwell in the midst of a people of unclean lips, for my eyes have seen the king of the Lord of hosts. Then one of the seraphim flew to me, having in his hand a live coal which he had taken from the tongs. With tongs from the altar. And he touched my mouth with it and said, behold, this has touched your lips. Your iniquity is taken away and your sin is purged. And I read the whole thing because it's probably my favorite thing in the Bible. I mean, you get a different answer from me maybe depending on what we're talking about, on what I'm talking about. But. But I really love this passage. Even as a young boy, I loved reading this passage. And just as like a. Well, okay, so here's a personal anecdote I probably shouldn't share on the Internet. Okay. But when I would read the story as a young boy, I'd always think I would like to be one of those seraphim. That's what I want to be. I want to just always be there, right at the throne of God, always close to God. Just that's what I wanted. And then when I was received into the Orthodox Church, I was received with the name seraphim. And so that's always been. So there's something really special about this passage to me, definitely. So the Christian tradition, the entire church, has understood this passage, along with very similar passages in the Apocalypse of St. John, as being the paradigm of heavenly worship. So in the story of the feast, we see that the story of Isaiah is sort of put through the paradox machine that is the incarnation, right? And so Isaiah goes to the temple to meet with God, but now God is coming to the temple to meet with his prophet who's been waiting there for him. And the church, in our hymnography, we sort of tease out the eucharistic implications of this feast. So in iconography, we depict Simeon in the attitude of someone about to receive communion. He's got. Usually got his hands sort of covered."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":2951.02,"end":2952.42,"speaker":"Jonathan Pageau","text":"Yeah, he's covered his hands. Yeah."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":2953.86,"end":2966.34,"speaker":"Richard Rohlin","text":"And of course, when the priest or the bishop, when they take communion at the altar, they repeat basically the prayer, the words of the seraph. They say, you know, see, this is touch your lips, your iniquity is taken away, your sin is purged."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":2966.82,"end":2993.94,"speaker":"Jonathan Pageau","text":"And in some medieval Western churches in Spain, especially in the apse of the church, which means in the holy place, the holy of holies, you would often have an image of Isaiah with the angel and holding the tongs to his mouth in the space where the mysteries were celebrated. So you can see that the relationship with communion was strong all over the place."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":2993.94,"end":3166.18,"speaker":"Richard Rohlin","text":"Yeah. And so one of my favorite examples of this is in the Canon of the feast. And actually, in general, the canons of the great feast, there are so many of them. For instance, tomorrow's is the canon for the Feast of the Annunciation, which I'll actually be reading in church tonight at the cathedral, which I'm very excited about, because the Canon of the Annunciation is an extended conversation between Gabriel and Mary. That's the whole canon, you know, and she's like, well, you know, last time an archangel came to a woman and promised her something, it didn't go so well. So, like, I'm trying to be a little careful here. And. And so he's like, reassuring her, you know, and it's just so. I mean, it's so beautiful. I think that if you wanted to say, like, increase your devotion or really sort of get to know the Mother of God, like, that's. That's an important service to be there for. But in this canon, in the ninth Odep Matins, there's this extended conversation between Jesus and Simeon and Anna and the Mother of God. And Jesus says, it is not the old man who holds me, but I uphold him, for he begs me to let him depart. And then Simeon says to the Theotokos, oh, mystical tongs. So now she's the tongs. Right, Right. Wow. How does thou bear the coal? How does thou feed him who gives food to all? And then, you know, in the same canon, it says Simeon the priest. And of course, the priest is somebody who would normally serve communion, right? The Simeon the priest received the Lord of all come down from heaven, right? So there's just all these beautiful paradoxes going on here. So in Isaiah's vision, he comes to the temple and comes face to face with Lord of hosts, the King. He's overwhelmed by his own sinfulness, with his own deadness of spirit. So alive coal, something alive, something on fire is brought to him from off the altar to cleanse his lips and to make him pure. Simeon, on the other hand, waits the temple and the Lord of hosts, thy salvation, the light to be revealed to the nations and the glory of thy people. Israel comes to him. He's born like the life coals, like a life coal on the tongs that are the Theotokos. And then Simeon's response is, now I can die. Like, isn't that. Yeah. So. And of course, obviously, in our preparation for communion in the Orthodox Church, we pray not to be consumed by fire, right? That is the body and blood of Christ, but to receive Christ into ourselves to worship him. And this is the final for us as Christians, this is a final consummation. Saint Maximus the Confessor says that those who partake of communion in a worthy manner are rendered similar to the one who is good as the cause of everything that is good, and they are lacking in nothing. So that even they are able to be called gods by adoption according to grace, because the whole of God fills them with himself and leaves nothing in them empty from his presence. So this is kind of my long answer to, should Christians celebrate Hanukkah? And my answer is something like, no, we should celebrate it four times. Yeah, right."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":3166.26,"end":3254.42,"speaker":"Jonathan Pageau","text":"But it's beautiful because if you look at the structure, there are so many things going on. If you think of the first setup that we talked about, where you have the. Where you have the setup of the dark space or the Holy of Holies, the altar is set up in this darkness, and this question, then down comes the glory of God hidden at the outset on the ark of the covenant. And then you can imagine almost really, the priest comes out with the communion chalice out of the holy place, and then reveals the light everybody sees. Now, here's the Christ coming out of the water, the voice of God telling everybody, this is it. This is my son. And then it ends with the temple itself, or the big temple, acknowledging, saying, yes, we recognize this. We recognize that this is what's happened. So it's almost like the reaction of Anna and the priest is saying, amen, this is true. This is happening. So you have the revelation of the divine Logos and then the reception from the church. And so it really is a beautiful cosmic image of light. And even just how light works. You know, the light comes down, reveals something, and then you recognize it, and you see what it is. You see what it is in its form. So it's all the way down in the microcosm to our small experience of you're standing in darkness, you turn on the light, you see Something, and you recognize it. This is there in the very structure of these four feasts."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":3254.66,"end":3337.09,"speaker":"Richard Rohlin","text":"And at that moment when the chalice is brought out, what do we say? God is the Lord and has revealed himself to us. Blessed is he who comes in the name of the Lord. And actually, there's some arguments for why that could be better translated. The Lord is God. In other words, the Lord Kyrios, which is the Greek form of Yahweh. Yahweh is God, right? The God of Israel. That's God. And now he's revealed himself to us. And that's what these four feasts are really about. It's about this revelation. So you've got the entrance of the Theotokos into the temple, when the ark of God returns to the temple, and it foreshadows and sets the stage for the restoration of the worship of the one true God. Right? And then the Nativity we see the cave becomes Eden, the cosmic temple. And the image of man is raised up and renewed. And then Theophany, we've got the dragons of the water being crushed. And Christ, the light illumines the cosmos with the light of his triumph. And then this culminates in the meeting of the Lord in the temple, when it becomes possible for us to not only meet God, but to receive him. And of course, that ends with the foreshadowing of the Passion. Right. The sword will pierce your heart also. And so we see the whole purpose of the Old Testament scriptures and prophecies fulfilled, which foreshadowed his coming. So. So, yeah, that's kind of. I think the winter feast of the church are really beautiful, and it makes Christmas longer, you know, which."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":3337.09,"end":3337.45,"speaker":"Jonathan Pageau","text":"What."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":3337.45,"end":3340.21,"speaker":"Richard Rohlin","text":"What more could you ask for than that? Right? Yeah."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":3340.37,"end":3366.17,"speaker":"Jonathan Pageau","text":"So this is great. I mean, I think it's. It's also. I think a lot of these interpretations we're giving is to give people a taste of what's there, because there's so much there that you can't exhaust in these talks. And so I think it's up to all of us to go back into our traditions and see the beauty and the coherence that's there in these feasts and in the texts themselves."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":3366.97,"end":3456.59,"speaker":"Richard Rohlin","text":"And something that if people want to take the universal history connection a little bit farther, kind of with all of this in mind, something that's really good to do is to go back and look at the tradition that you're in and see how was this celebrated. I mean, for instance, again in this book, which I'll just recommend one more time, the stripping of the altars. There's a great section early on in the book. It's in the very first chapter looking at two things in specific. In England before the Reformation, Candlemas, the celebration of Candlemas, which obviously we spent a lot of time talking about. So if you want to see how was this celebrated in merry old England? And then also Holy Week, Passion Week, which was, can I just say, pretty awesome in England before the Reformation. It was also a lot more. If you've ever been to Orthodox Holy Week and then you read his description of what was English Holy Week like before the Reformation, they're so similar that if you were comfortable, like, if you were already, like, sort of used to one, you would be very comfortable in the other one. There are some interesting local differences, but they're very, very similar. So the celebration of Holy Week in the west has been, over the decades, even recently, has been extremely truncated, but it used to be a lot longer and a lot more similar to what we still do in the East. So maybe go back and look at those things and it's like sort of digging up these pearls of beauty from your own tradition that maybe you've lost touch with. Yeah."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":3456.99,"end":3468.15,"speaker":"Jonathan Pageau","text":"So everybody, this is. There's so many of these that we will do. We're going to continue on. And as Lent continues, I wish you a fruitful Lent. I don't know if we're going to see each other before Pascha."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":3468.15,"end":3469.03,"speaker":"Richard Rohlin","text":"We'll see. I don't know."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":3469.03,"end":3474.51,"speaker":"Jonathan Pageau","text":"Thanks for your attention, Richard. Thank you again for your scholarship and your passion, and we'll talk again very soon."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":3474.51,"end":3475.47,"speaker":"Richard Rohlin","text":"Thanks, Jonathan."}
{"episode_id":"SW - #226 - 2022-04-04 - Richard Rohlin - Universal History - The Christian Continuation of Hanukkah","start":3478.11,"end":3531.69,"speaker":"Jonathan Pageau","text":"This episode is part of a series of discussions I've had with Richard Rowland on Universal History. You can find a list of all these episodes on my YouTube channel, or you can find them also in my podcast stream from the Symbolic World on your different podcast platforms. Make sure to check out Richard's second podcast, which he hosts in collaboration with Father Andrew Damick, called Amunsoul, which looks at the relationship between Tolkien and Orthodoxy. This podcast has also inspired in me some ideas for creating some images, whether it be the King under the mountain, whether it be the Grail or beautiful Ethiopian traditions. I've created some products which you can find on my store, the Symbolicworld Store, and there will probably be more of those to come very soon, so stay tuned. This conversation is ongoing and there is still very much to explore in the universal history."}
