{"episode_id":"SW - #118 - 2020-10-01 - August Q&A","start":12.56,"end":6597.69,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. All right, hello, everybody. Here we go with another Q and A. And so today is my daughter's birthday. She's 10 years old, and today is the first day of school. It is very strange in our lives the way that my wife and I always end up doing things in an opposite manner as what seems to be happening. And so we've been homeschooling for 10 years, homeschooling our kids. And this year, for the first time, all our kids are going to school, which is so strange to think about, considering Covid. Considering how insane everything's getting, but nonetheless, that's what's happening. And so everything went in that direction. And it seems to be the path in front of us, just like it seems to be the path that we settle down, that we are fixing our house, that we're going. Even though the world seems to be careening out of control, we are fixing our house, and we're getting ready to move back into a stable place with kids going to school. So, yeah, so, yeah, one day at a time is what I say. All right, so there are. Every month there are more and more questions, as you know, for people who. Who support me at $10 or more, I give the possibility of asking questions in advance, and those have become more and more. So I just want to warn you that I'm going to take only one question per person, and I'm happy Brad Heisman is in the room. And so, yes, indeed, Brad, since you are here and you have your sort out, we can start. And so, yeah, so I'm going to just take one question per person. And. And usually the way it goes is I go through the questions of all the people who ask questions in advance, and if there is time and if I have brain energy left, then I'll go check into the super chats and see if I can answer some of the questions there. Sadly, I know a lot of people write questions in the chat, but I already have like 50 questions in the. In the advanced chat, plus the super chats. And so it's very difficult for me to pay attention to the chat while I'm doing it and answer questions in the chat as well. So apologies on that front, but for now, it just seems like the only way that I can really do this. And so here we go. And so I see Lisa is here as well. My. My Aunt Jacob is there, so my crew is there, which is always nice to know. And. And so here we go. All right, we're going to do this and so I'm also going to have a Sleeman draught beer while I'm doing this. And hopefully it won't affect my mind too much. I always think it won't. I always think it doesn't. But then. But then maybe, you know, if I listen to myself later, I'm like, huh, why did I say that? All right, and so here we go. So I usually start with my website. Okay. And so Adam Szilard, always faithful to the call to ask a question, he says, hi, Jonathan. Is the story of Balam and the donkey the same pattern as the conversion of St. Paul? That's a really great question and a very good intuition. I think that the story of the conversion of St. Paul is definitely referring back to the story of Balaam and the donkey. That is for certain. I think that it's clearly in relationship to that story. Now, I would say that just as Saint Paul, it's a Saint Paul story. Saint. Saint Paul. Saint Paul is always. How can I say this? Saint Paul always has. I talk about this idea that he is kind of like a rectification of the left hand or something like that, where all. So many aspects of him, the fact that he says that he's a fool for Christ, that he says that he's a shapeshifter, talks about being all things to all men. He talks, he boasts of his weaknesses, you know, and he talks about grace as well. This idea of this, a kind of grace has to do to a certain extent with a breakdown in normal causality, you could say. And so. Or, you know, the idea of mercy, you could say, has to do with the breakdown of normal causality. And so it seems like St. Paul, a lot of the stories, like even his shipwreck, seems to be in relationship to the story of Jonah, but it always changes discourse, like it changes direction. So it refers back to the story of Jonah, this refers to the story of Balaam. But instead of Balaam being a kind of this, like, evil magician that ultimately ends up prophesying in favor of God despite himself, you could say that it's something like that for Paul too, where he's against Christ and he's fighting Christ. And so as he goes, goes back, he has this experience relating to falling off the donkey and also becoming blind. But then for him, it becomes a kind of mystical vision in the sense that it. It's like it's his first. It's a transformation of this kind of silly, crazy story of Balaam into something glorious which participates in his. In his sanctification. So it makes, it turns him into, you know, the apostle that he's going to become. So yes, I totally agree that it refers to, but I don't think it's exactly the same. I think that it just like everything about St. Paul, it kind of shift because it shifts. It's like he makes the story shift in a direction that is different. All right, that's as good as gonna get. So, so bit not bothered. Asks hello, Jonathan. It seems the far left is seeing monsters. And where, where are seeing monsters? Where there are none. There are videos of rioters burning Bibles, being violent to people or groups and harassing people, neighborhoods. While these actions bring about or let in, will these actions bring about or let in real monsters? Your thoughts, please? Thank you. Oh, I think the first thing, we need to be careful. We need to be a little careful when we use the word monsters. And so I use the word monster in a very technical sense. I use, always use the word monster to talk about something which doesn't fit, something which is linked to kind of this dark potentiality that is a mixture that is too big, too small. You know, that is a kind of breakdown of normal categorization. That's kind of how I treat the word monster. And so the monster in my understanding, although ends up being in a way related to evil in the way that darkness is often related to evil. It's not evil as such. And the monster also has a function and a purpose. So it's. So I would be careful not to use the word if you mean something like dangerous or that it's bringing about, let's say violence or death or clamp down or, you know, then I think that I agree with what you're saying. I think that there is a. There's a strangeness about the way that the extreme left is acting in a kind of weird, paranoid manner. And they seem like you said to see everything as evil and fighting as if there was this war against all this evil, systemic racism, you know, not that I, not that I don't think racism exists. Obviously it exists, but you know, this idea that the whole system is corrupt and they're fighting it. And so I think that they're inviting a clampdown. And, and we've seen it before in history. You know, they all, they seem to want a revolution. They seem to be acting like revolutionaries. And, and I think that it will call about a reaction on one side and then like you said, in the sense that it might call another reaction on the other side. It's. The pendulum is getting pulled Pulled. And then when it swings, it goes further, and then it's pulled, pull. Then it swings, it goes further. And it seems like that's what's happening. And really, I don't really believe that there's a way out of it. At least I don't know. I don't see a way out of it. All right. So Josh the mover asks. Hello, Jonathan. I was told and can confirm that as I draw near to orthodoxy, the attacks of the demons would increase. I've been attending divine services for about a month and a half now, and even the last six months, I've been feeling temptations more strongly than ever. It has been difficult, but fortunately it has made me more prayerful and focused on my spiritual life. My question is, will baptism make this any easier? Also, will baptism help me to understand the services more deeply? I love the services, but I feel as though I'm only intimating a very small portion of. Of its grandeur. Thank you. Will baptism help you, let's say, participate more fully in the services? Of course, because it also means that you will now have access to full sacrament life. You will be able to take communion, you'll be able to go to confession, you'll really be able to participate in the life, and therefore you'll enter into the fullness of the mysteries of what the sacraments are bringing, bringing to you. Now, whether or not baptism will make it any easier, I have to say that it really depends. And I've heard stories on both sides. I've heard stories where baptism is really, really, let's say, kind of heals certain things or certain sins, makes them vanish like this, and, you know, and they're gone. And then I've also heard the opposite, where baptism will also make it harder for a while that you're really going to. It's going to be a gauntlet for a little while. So it really depends. And for sure, I would say that it's not going to. It's not just going to stay the same. For sure, baptism will change and your experience will be different. All right. So David Flores asked, can you explain the symbolism of an animal horn being used as an instrument? I'm stuck with breath, spirit passing through a dead object. You're right. That's exactly what it is. And you've got the symbolism quite right. You can understand music in the relationship of the garments of skin, and you can understand it as an externalizing of the inner pattern. And that's true about everything. It's true about everything. That is an. Like an external form of an inner pattern. And so, you know, even the law is that right? Even the law is, Is engraved in stone. And in terms of music, you really do have this sense. There's a. There's a verse in scripture around after the fall where it talks about how the descendants of Cain. Cain built a city, and then the descendants of Cain have these. Have these different skills. And it says that's what. The time that people started to call upon the Lord. And there's also the creation of musical instruments. So you can have to understand even the idea of prayer the way that we understand prayer in the sense of this, like, explicited singing that has sound and has something to do with covering itself. And so the musical instrument even more, that is like you said, you make this day dead thing, and then you, you. You make it vibrate so that it manifests the pattern of reality. And so it's, it, it shows you this whole idea of the garments of skin. It really is an example of the garments of skin, you know, and that's one of the reasons why, for example, the whole idea that, that, that, you know, when the end of time comes, Saint Gabriel will blow the horn. And blowing the horn is, you know, it's like, it's also a call to battle. It's also a call to, you know, to fight. And that has to do with that. Like, if you call, if you call something, it means it's far away. And so, you know, the horn is calling to the temple. The horn is calling to battle is, you know, using this garment of skin to gather in, you know, things that are. That are. That need to be gathered in for a reason. That's the best way. But the mute. The symbolism of the horn and the symbolism, especially the symbolism. The horn is really, really very difficult to pierce because it has so many facets of it, you know, and I know that, that David, I know that you guys have been exploring that, you know, with the question of the crowns and everything, and you're on a, on a good track, but it's difficult to pierce this mystery. All right, so, Benjamin Rva, how does one discern between when symbolism happens and when coincidence happen? What's the best heuristic to evaluate the truth of a symbol or pattern? My intuition is that it involves whether it reveals things that bear out or work and whether it scales. A true pattern would apply at many scales. The more scales, the more revelatory, revelatory power, the more true. Something like that. Eventually you get to a concept or image that's both par simonious. And incredibly generative, like logos or yin and yang, and represent a great deal of being as opposed to Jesus's face appearing in your toast, which does not appear to. Am I on the right track? Yes, I think you're on the right track. I think you're on the right track in the sense that that definitely is the way that things jive. When things start to coalesce into patterns, you know, to me, the way that you understand that it's. That it's more than just sometimes it happens too, that things coincide in a very personal way. But I would say to just be careful about that. And those types of, those types of, of joining together, they can happen. And they're. Sometimes they're, they're. They can be quite insane. Insightful, personally. But the best place where you see where symbolism happens is as you said, where it scales and where it manifests a pattern that, that appears in other, other phenomena. And, and that those are. And it's, it's also whether or not it's the pattern of pattern itself, you know, not just some random thing. Usually also. Usually also you can see the direction in which the interpretation is pointing. And so, you know, I'm more cautious of people who tell me something like this and this happened to me and it's, it's. It's showing to me or it's revealing to me that, you know, that I need to do this, that because I see this and this, that I need to do this, that it's showing me that I should do this or that, you know, it's when it's pointing down towards. Just towards events and it's pointing down or just towards people. And the extreme conspiracy theorists have that habit, you know, where it's like all of these things, I bring them together into pattern. And what it means is aliens. Right? We know that. We know the meme. And so, and so I'd be careful. I'm more careful about those. Those are the ones that, that. The type of pattern seeking that I find that is. Is pointless and usually, usually not helpful. All right, so Joseph733 asks. Hello. In your Mystery of Ethiopian Iconography article you wrote for the Orthodox Art Journal, you wrote, like all Mia physite churches, men and women are separated, with men on the northern side and women on the southern side, opposite to Greek and Russian tradition. And the iconography seems to reflect this. Could you please explain how the understanding of Christ's unity affects how men and women are arranged in the church? Well, it's just not in every church, but there are in several churches in which women will be on the side of the. Of the Virgin. So if you look at the church, you have the iconostasis and you have the Mother of God on your left side. And. And then you have Christ on your right side when you're looking at the. At the altar. And usually women in churches that separate the sexes, women will be on one on the side of the Virgin, and then men will be on the side of Christ. And I've seen it. I've actually been in churches where it actually was the. No, it's mostly on that. It's mostly on that side that Greek and Russian tradition has. And so. And you ask, could you explain how the understanding of Christ's unity affects how many women are arranged in the church? I don't. The thing is that this is also the diff. It's so difficult because unity doesn't negate multiplicity. Unity is not a negation of multiplicity. And so this is really a modern way of understanding where we think that the negation of. Okay, so under. This is like. This is really something that I guess I've hinted at, but I think it's really important to talk about. And so, you know, everybody quotes the verse where St. Paul says, There is no man, neither man nor woman. There's no Greek nor Jew, but we're all one in Christ. And that is, of course, absolutely true. That is that as you. As you move up the mountain, right, as you go closer and closer to Christ, then the distinction and the multiplicity starts to fall away. And then we enter into the unity of. Of Christ. And in that unity, we do not. Those distinctions no longer hold in the unity. But there is also a manner in which multiplicity, even in that unity, is preserved. And so there is a reality to the extent that we are neither man nor woman. But there's also reality in which there is men and women. And that's how children are produced. And there are Greeks and Jews because Greeks, you know, there are Greeks, Jews and Canadians and Americans because some people live in America and some people live in Canada. So multiplicity isn't annulled for all reality. And so in the church, it means that there is a breathing in and breathing out of this movement towards unity and transcendence and this expression in hierarchy and multiplicity and in the world. And so we don't eliminate the hierarchy of the different aspects of the church, right? The nave, the. The. The narthex, the nave and the. The altar. We don't remove that, nor do we remove the separation of the sexes. And so but it doesn't mean that there's only one way to do it. Like I said, not all churches and most churches in in North America, I would say, don't separate men and women in the church, but some do. And, you know, and I think that some the reason why you would separate men in the church, men and women in the church, is the reason why you want to separate men and women in general, which is that you want to avoid confusion. You want to avoid you want people to be focused on what we're actually by separating us, we're focused on what we're joining together above us, rather than thinking of how we can get joined at this level, because there's ways in which we can also join in the other manner. And so it's usually probably to avoid wandering eyes and to avoid people being, you know, their minds kind of wandering during the services, but rather being focused on on Christ. But there also is a cosmic reason to do that as well. So I hope that makes sense. All right. So Roxanne asked, good evening, and thank you for responding to our questions. I've been pondering masculine and feminine roles in the family and how they can be reinforced by symbolic models, but certainly not restricted in individual instances. Often Western charitable organizations promote the empowerment of women in Africa and elsewhere in the Third World. What did you observe about familial roles during your stay in Africa? Are the women really doing all the work while the men are uninvolved in family life, even someone inclined to be abusive? Are the charitable workers missing something essential? SUSAN Formally ROXANNE I mean, it depends the thing there are cultures that have less that have different clear, different roles, and those roles will change depending on on the situation. And the idea that women do the work in the home, let's say, is something that seems to be pretty prevalent in Africa, at least that I what I've noticed. And men have a different role, a more kind of strategic role, a more role in terms of making sure that there's revenue in a bigger scale. And the women, at least in Congo, where I was and the women tended to be more, let's say, preoccupied by the everyday and like, different at a closer scale, you could say. And also there is also it just depends on which culture you're talking about in terms of Africa, because because a lot of let's say in Congo, for example, there are a lot of matrilineal societies. And then in matrilineal societies, it's very different than are you the way that we understand familial relations because the man is actually responsible for his sister's children and his own biological children are taken care of by the brothers of his wife. And so it creates very different relationships that are. That are a little difficult for us to totally fit into our, Our, Our. Our frame. So, yeah, it just, it depends a lot on the culture too. So Pnuma asked, what do you think the symbolism is for the Shoah Holocaust Remembrance Day and the Armenian Genocide Remembrance Day happening days apart this past year? I feel like it has something to do with Jews being the first chosen people of God and the Armenians being the first nation as a whole to put on the Christ and that there is a promise from God that there is. Is not a total annihilation of his people. But I'm not sure what else that can mean. Have any thoughts? I'm afraid I don't totally know what you mean. I don't. I don't think I even know what date these different events are. And so I don't know what, what, what that's referring to. I do think maybe the only thing I can say is that I definitely do think that. That Armenians have a very particular role to play in terms of. In terms of a kind of greater story of Christianity. And like you said, because they are. They converted to Christianity before Rome. There is something about their story which I think is very important. And I haven't really thought about the. I, The. The relationship between their role as first. The kind of like this first nation to convert and the, The Armenian genocide. But it's definitely something that I will ponder on and. But I haven't thought about it, so I don't want to say anything irresponsible, especially for something as tragic as the Armenian genocide. So Luca Ascovic asks. All right, a couple of questions. I am going to answer only one question. Is there a difference between God's uncreated energies and principalities? Correct me if I'm wrong, but I heard somewhere that some uncreated energies can fade away in time. Is that true? Is that like a death of a principality? I don't think I've ever heard that before in terms of uncreated energies. And so are they the same? I don't think they're the same. I don't think they're the same. Principalities are created, but they rule. They rule aspects of reality which would be ultimately a pattern of logos. And so they're probably. They're. They're not the logos of something completely, but they're like this kind of like, the idea that even the, like, if you think of it in the terms of a hierarchy, you can imagine that there's an. There's the angel of France, you know, and then there's the king of France. And so then like above that, there are logi that hold these, These realities together, but they're, they're beyond manifestation. And so they don't necessarily. They don't necessarily. They wouldn't be necessarily related to France directly, but there would be something like the, the logos of, of communion, of, of the possible communion of a nation. I don't know what, I don't know how to name them because they're, they're beyond. They're beyond name. The, the logi are. Are beyond manifestation. And so I think that's the best way to understand it. I would say that they're not the same, but they're related in the sense one is, Is kind of. Would be the, the king of something, the. The ruler of something which is beyond it. I hope that makes sense. You guys are asking tough questions. All right. And so. Oh, not that many questions on the, the symbolic world. But don't worry, I saw there were like 30 questions in Patreon, so we'll go to subscribestar, where there are only two questions in subscribestar. So Samuel asked me, do you think analysis of symbolism precludes you from participating fully in the Christian story? Is there a point where you have to switch off analysis and just participate? Something akin to the Zen paradox of achieving enlightenment being impossible through conscious effort? Yeah, I think you're right. I think you're totally right. And I, I think that. To be honest, I do that all the time. I think that I. When I watch a movie for like, I'll use a very simple example. Like, when I watch a movie, I actually usually rarely am thinking about it while I'm watching it. I usually just experience it. And then after I've experienced it, then, then in my memory, I go back and I. I analyze it sometimes. No, sometimes if the, if the movie will be. The movie will create insights in me. I usually don't experience those as analysis. I really experience them as insights. I don't know what else to say. As these little mini revelations. And so let's say I'm. I don't know, I'm watching a movie and then there's a. There's a very powerful symbolic pattern that manifests itself. I, I won't analyze it. I'll experience it as insight, and then later, then I can put words to that Insight and I can explain it to you guys, you know, and so if you pay attention to the way that I speak, you can notice that sometimes I'm trying to put words on insight and you. Usually I've noticed myself. Like I noticed when I say something, I say I'll explain something and then I'll go, or something like that. Usually what I'm doing is, I'm. Is. It's because I'm trying to explicit an insight that I have which is not the same as an analysis. The analysis comes in the description, but the insight is behind the, is behind that. So, okay, so Dorothy K. K asks. Hi, Jonathan. August 14th is the feast day of Saint Maximilian Colby in the Catholic Church. I heard you once prophesied that 100 years after his death, which would be 2041, there would be a major shift in world philosophy and it would be concentrating around, concentrated around Mary. This might only be a legend, as I can't find the exact quote, but I guess this is a safe space for legend. My question is, do you think there's something about Mary missing in this world which could cause such a change? Let's say it this way. I mean, I do think that one of the reasons why I talk about feminine symbolism so much is that I think that despite all the feminism of the modern world, despite a kind of casting out in public, like of putting in public feminine women and female figures, I believe that the modern world's disease is a lack of the power of the feminine. I feel like a lot of people have had this insight. I remember reading people like Joseph Campbell and these kind of people who say that we need to emphasize the Goddess and we need to emphasize the, the Mother Earth and all this stuff. But it always comes off wrong. It always comes off as like Mother Earth needs to take her place, right? And she needs to, to, to, to. To take, to take the place that is owed her or something like that. And then it ends up being completely, I would say, satanic. Like it just ends up being a weird upside down vision of what the power of the feminine actually is. And so it's really tricky. It's tricky to talk about feminine symbolism. And so if you, if you pay attention to the way I try, I don't know if I succeed, but the way I try to do it is I, I'm always hinting and I'm always kind of turning around and never saying things and, and just kind of always pointing and hinting and suggesting in order to avoid, to avoid, you know, exposing the, the. The hidden fe Feminine, you know, and doing it in a way that would be scandalous. And so that's how I try to do it. I don't know if I succeed, but I do agree that there's something missing. There's a. There is a lack of feminine connection in our world that is doing that, but I don't think that that will be solved by this. The kind of weird, you know, like Dan Brown, Mary Magdalene, all this kind of weird Mother Goddess desire. I don't think that it's solved that way because it always comes off as being completely, completely, I don't know, completely upside down. Right in its. In its emphasis. So, yeah, that's as much as I can say about that. All right, so here we go into the belly of the beast. We're going into Patreon, which is. Which has a lot of questions. All right, let me just reload this, because I noticed some people, you know, you guys, some people send their question in as I'm like, actually answering the questions. Usually I'm not going to get to those questions because if you send me the questions while I'm answering them, I'm not always thinking of reloading the doc, the page to see whether or not more questions have come in. So try to get your questions in before I actually start. Before I actually start the interview. So, Sander Quitter asked, is your home renovation going well? Man, you know, I really, really, I really. If you can avoid doing. Doing what we're doing, I would say, please avoid it, because it is. Renovating a whole house is just crazy, especially for someone like me who's just not a construction guy. I'm just not. And it's, it's. And my wife, and now she's actually managing the project because I'm supposed to be trying to work at the same time, but it takes up so much energy and there's all these decisions and you're like, managing different crews and it's so much work. I have barely, if you notice, I usually post all these pictures of my carvings online. And so I can barely kind of keep up with making these videos and answering my emails and doing guests guest interviews on different podcasts and stuff. And I barely carved in the past few months. I've barely done anything. And so sorry for all of you who are waiting for commissions, but hopefully we are hoping that we're going to enter into our house in October and then all of this is going to change. You're no longer going to have to look at this horrible white background. I'm actually building A bigger space because we're putting the, we're building an extra floor on the house and we're putting the kids upstairs. We don't want kids sleeping in the basement with the, with the problem with the flood and everything. But I am going to still put my office down there. And so I've been able to make it actually bigger and soundproof it. And so it's going to be a real studio. Hopefully the quality of my videos at that time will finally go up. Even though at some point it went up. You know, you can look at my videos at some point you see the quality of my videos go up and then the flood happens and, and then it crashes down. So hopefully that will happen. And so thanks to everybody who's been very patient in all of this. It's coming one day you'll, you'll, you'll turn on a video of me and they'll actually be a nice background and nice lighting, better lighting and good sound. And we'll see. All right, here we go. All right. So the wakeful asks, dear Jonathan, could you explain the practical difference between the exclusion of, of the outside on the one hand and the differentiation between the marginal and the inside on the other? How is the marginal excluded from the center without being designated as fully outside? So you could say that ultimately there is like, let's say metaphysically there is no truly outside, right? There is no completely outside. And so even the, the desire to cut off the margin is a, is an illusion. It doesn't actually happen. It doesn't happen. So those that try to do that, those that, that are trying to fully cut off the margin, like I, I keep saying is because you can't do it, what you end up doing is you end up, you, the dragons end up building up in the forest and, and, and then they come and get you, right? There's, there's a good example of that in Shrek. Although I'm not a big fan of Shrek, I did make a, I did make a video on it and not a big trident. A fan of Shrek because it's the, it's an upside down world. But in the movie Shrek, you see this where King Farquhat wants to remove all the, all the monsters and all the, the legendary creatures and all the, the fairy tale characters from the forest. He wants to, he wants to remove them and you can't, you can't do it. And so it ends up with him being eaten by a dragon. That's how it ends. That's how it ends. If you try to fully cut off the, the margin, it just doesn't happen. And so there is a kind of, if you understand a cutting off in the sense that there is a, a normal cutting off in the right, like a door to your house where you close the door and you keep certain things, you know, outside in a relative sense, then, then that is a normal thing to do and you have to do it. Everybody does it. You know, the margin does have to, have to have a relationship to the outside in a relative manner. And, and that's a difference. It's just about understanding also this buffer between the inside and the outside and being able to engage with the outside in a healthy manner. But engaging with the outside in a healthy manner doesn't mean that sometimes you don't have to kick the margin out. Like it happens. You know, if someone, if, like you can, for example, help a homeless person and you can, you can help them, you could even have a place for them. You know, in, in Quebec, they had, they called them beggars benches. And every house would have a beggar's bench on the porch outside. And so when the beggars would come, then the, the people would let the beggars sleep in this bench would open up and there'd be like a bed inside the bench, and they could sleep in this, this beggar's bench, you know, and the person from the outside would bring them food and would, would help them. And so it's like, but then if a homeless person came and then broke your door open and walked into your house and went into your fridge and started eating your food, then you would have to eject that homeless person from your house for the safety of your children and for the safety of your house. So it's not like there isn't a moment where the margin has to be engaged with a kind of ejection. Sometimes it does, but you also have to be careful that you also need to see in the margin this mystery and this potentiality that you also have to care for to a certain extent. Hence the beggar's bench, hence the, you know, the idea of the, the stranger who is ultimately an angel. So that's the best way I can, I can, maybe I can say that. So Nina Moore says you think the 12 steps in the AA program is an encounter with Christ without calling it that. I don't know. I don't know enough about the 12 steps. I, I do know that I, I encountered several people that have been very much helped by the AA program and that it has also led them to Christianity and to Christ. But I don't know enough about it. I wouldn't even be able to tell you what the 12 steps are. All right, so Paul E. Asked two questions, but he says the first one's easy. He says, how's God's dog coming along? He. It's coming. It's coming. It's taking a long time because Cord, the artist who's making this comic book that we're creating, God's Dog is, has a job and he's doing it part time. And he also just had a baby. And I understand why he also doesn't want to put all his eggs in this basket and he has to continue his other activities. And so, you know, it's. It's coming. And very soon, we hope very soon or soon in this year, let's hope that. Cord, I hope you're watching in, in this year, we hope that we're going to have a crowdfunding out to pay for the printing and the final touches, like the coloring and stuff, and put it out. So hopefully it's going to happen. So have you seen any of The Proud Boys vs. Antifa battles in Portland? Yes, I have. I tag you on Twitter with an excellent description of the battle raging between those two sides. You see any symbolic themes emerging between these scuffles? I mean, of course I do. And you know, and he says, for instance, for instance, the pepper spray green blinding laser shields and batons, antifa BLM are hurling feces and throwing urine balloons. These battles have a distinct medieval flavor, complete with heraldry and combat formations. Yes, I think. But I think what we're seeing is the ramping up of the two sides, where the excess of one side is slowly creating the other side, you know, through almost a normal process of opposition. And, and we're going to see it escalate. And we already saw it. We saw, you know, we saw. Was it yesterday that guy who shot of several antifa people because he got jumped on. And. But at that event, no matter what you think of who's guilty is going to escalate the thing. And so if, if antifa people get shot by people on the other side, no matter who's responsible, doesn't matter, then they're going to start carrying weapons as well. And then there's more chance that it's going to happen on the other side. And it's very difficult to stop this once it started. So Leo asked, was Matthew influenced by Ian McGilchrist mastering his emissary in writing Language of Creation? So for Those who don't know Matthew is my brother who wrote a book called Language of Creation, which is excellent and that everybody should read. Of course, you can find it on Amazon. I have to tell you. No, he didn't. I don't think he even knew that name when he wrote his book. I think Ian McGilchrist seems to have looked at traditional. Traditional ideas in his conception, and that seems to have helped him, so that they probably. Whatever resemblance you see probably comes from that and also comes from a meditation on. On reality. So. But I also haven't read Ian McGilchrist, but I. It's one of the things that I really want to do, but I just haven't. Just hasn't happened. All right, so Radu Bompa asks, what do you think of the Benedict option? I mean, I have a lot of sympathy for that idea. I think that one of the danger. One of the problems with Rod's Benedict option is not in his book, is that in the proposition that he gave, it seemed inevitable that it would be caricaturized immediately and that it would become this idea that Christians need to cut off and flee from the world because people see things always in. Tend to want to see things in black and white in. In. In very strong categories. But I think that the basic idea that Christians need to retreat, let's say, to a certain extent while engaging in culture, but also finding allies and finding people that have the same values and the same vision of the world as they do and tried to physically coordinate with them, I think that's fine. I mean, I say that, but I'm not doing it in the sense that I have to be honest that I'm not upending my entire family to move to some city where I think that there could be the possibility of a Christian community. But I know people that have done that and that it has been extremely fruitful. And I also know people who have done that, and they've been extremely disappointed. And so I think that what you can maybe get from the Benedict option, especially, is the idea that Christians need to be deliberate about what they are and what they believe, and they need to be deliberate about the relationships they foster if they want to be able to continue. All right, so Andy Milligan asked, I started showing your videos to my wife. I'm trying to get her hooked, too. We watched your Moana video together, and she asked a great question. Do you think the cartoon artistry knowingly deliberately drew the shell and the cavern opening to look like, you know, like a feminine shape? And the answer in the case of Moana, the answer is yes. Yes. The. The people who. The people, the high level people at Disney who wrote Moana, who wrote Frozen, who are writing these new stories for Disney, know exactly what they're doing and they understand symbolism very well. And so I don't think that it's always deliberate. I think that sometimes there's an unconscious aspect to the kind of symbolism that arises. But in the case of Moana, everything in that movie is deliberate. There are no accidents in there. So Connor Mitchell asks. Good afternoon, Mr. Pedro. Within my profession in the military, there's an emergence of many of the pagan warrior traditions. Among the intellectual types, this is often in the form of stoicism. And among the more ignorant, you have the Till Valhalla Bros. Understanding the need to salvage what is good about these traditions. I have been designed to find a way to manifest them in appropriate context of a broader Christian story. However, in regards to resources to guide me on that matter, I have found myself in a desert. The obvious examples of such virtues are in the likes of. Of St. George. But what I'm wondering is if you know of resources, things to read that guide and teach someone how to specifically manifest such pattern in a manner that can help embody what is godly and virtuous and avoid the aforementioned minefield. Thank you for your time. It's the night, the Christian night. That's it. That's where you find it. The development of, and it has even to do with northern aesthetic, the development of the Christian warrior and the development of the Christian knight, the Western knight even is a joining of Christian ethos, Christian story, with the energy of the northern people and the warrior tendencies of the northern people. And so it's the idea of taking that power, taking that energy, that. And putting it to the service of Christ in order to serve and save those that are weaker than you. And so I think that that's it. And because it's so funny, you know, you see it in all these stories where, for example, like, you see this tendency to want to show the Vikings as being more honorable and more Christian, even almost than the Christians, as if the Christians are these horrible, horrible people that killed and slaughtered and did all this thing. But the Vikings, they have honor and they wouldn't, wouldn't do that. But it's just silly because those values, the values of, of preserving the poor and the weak and, and of that, that it is immoral to exterminate your enemy, that all of these things are Christian, this is a Christian vision. And pagan people just didn't have that vision. And so the very way we understand war today is completely infused with Christian thinking. Even if we don't do it, even if we're hypocritical about it. The idea that a stronger nation shouldn't, just because it's stronger, crush a weaker nation, that there's something that is unethical about that in its very, at the very basis, that's a Christian idea. It's definitely not a pagan idea. So it's closer than you think. It's not at all far. It's closer than you think in that you will find it even in the neopagans. Even in the neopagans, you will find not all of them, but in many of them, you will find something that is actually Christian with a pagan veneer rather than an actual or natural paganism. So Garcia says. Could you elaborate on cynicism or mind consciousness reading? To me, cynics treat people as guilty instead of presumed innocence. Like cancel culture. It could take the form of accusing others of ulterior motives or just broad generalizations. Example, all white or black, rich or poor people are this or that. I don't know if this happens at the individual level. Cynics always seem to lump the individual into a group. On the other hand, cynical people seem to be charitable towards their own groups. Is this related to multiplicity and unity? My main concern is understanding where the presumption of guilt comes from. Yes, I think that, I mean, I think that there are times where we should be cynical about the intentions of people acting. I think that we have to be careful not to take it too far. We also have to be careful not to think that we know the intentions of others. We can doubt their intentions. But I think we need to be careful. If your cynicism brings you to say that you are acting for this or that reason, you know, and you, and you say that you don't know if this happens at an individual level. It happens all the time at an individual level. If you, if you've ever been in, in a couple, have you ever been in a, in a family, you know, and you hear something like, you know, you know, you didn't do the dishes because you don't care about me and, and that you don't, you know, or you didn't do this properly because you don't care about this and you don't think it's important and you just think about yourself and blah, blah, blah, blah, right? It's like, so that's a form of kind of projecting yourself into the other person's consciousness. And so I would just say. But there is a function for cynicism, I would just say, to find a balance between the two. Okay, so Norm Grande asked, can you speak of the symbolism of the well? It seems strange nourishment as it reaches down into the deep, but pulls out life rather than chaos, is because it is intentional and created space. So it has to do with the idea of. So if you want to understand the symbolism of the well, you have to understand the story in scripture where you have the bitter waters. And so Moses comes into the desert and they counter this pool in the desert of bitter waters. And so bitter waters is. Is salt water. You could. It's not necessarily salt water, but you can understand it as salt water. You can. Can understand it as water that is not palatable for human use. Okay. And so then they put a cross, right? So you can imagine they take a. They will put a cross, they put a tree, but I immediately go to the cross, obviously. So they take a tree and they put the tree down into the bitter waters. And those bitter waters then become sweet waters, okay? And so there is a. There is a. A, let's say a. It's heaven that comes down and joins with earth. But it's all. There also is a certain sexual symbolism in that relationship. That is, there is the. You can imagine. So you can imagine a virginity, let's say, as a certain aspect of virginity, as. As wildness, as on. As not yet. Not yet a home, not yet a womb in the sense of. Of a place of life. Okay? And. And so. Or you can understand it more like in terms. Maybe not as much virginity, but like in terms of the wild or the foreign or the. Or the. Or the prostitute or the. The idea of this kind of wild possibility that isn't a home, that isn't a home for human flourishing. And then there's a manner in which it can be transformed or brought into the possibility to be useful. And so you can understand it. There's so many ways you can understand it. And so imagine the difference between a well and salt water is the difference between grass and an apple, right? The grass is. You can't eat it. It's not palatable for you. You can't eat certain flowers, you can't eat certain things. You can't eat. There's certain things which are just not palatable for human use. But you can eat an apple or you can eat a tomato or something else that grows from the ground as well. And so that's the idea of the difference between wild and bitter waters and pure water. And so that's what a well is. And a well, because it's also contained. And that also has to do with this idea of constraint on that which is wild and out of control. There is this like, containment and then that becomes palatable for human use. So sorry, that might have seemed extremely abstract, but I think that in this context, this is, this is the best that's going to happen. Well, actually, if you want to understand the symbolism of the well, you can understand it in terms of the. The. It's Proverbs 5. Is it Proverbs 5? I might be wrong, but I think it's Proverbs 5 where it talks about the, the foreign woman and it talks about the strange woman. And it says the strange woman is bitter and her feet go down to Hades. And it says, keep your fountain for the, the. The. The wife of your youth. Don't let your fountain run into the streets, but keep your fountain for the wife of your youth. And so you can imagine that there's a well and there's a fountain, right? So you don't want, you want the, you don't want the, the fountain to run into the streets and to. To be deluded and everything, but there's this relationship between living water and the well and the connection between the two. That's life. And if you read the story of the Samaritan, you'll see that that's the plague Christ is making. And so the Samaritan is a foreign, strange, lost woman. She's also a figure of a. Of a loose woman in the sense that she's had all these husbands, but she's come to the end of her cycle. She's come to the end and she's had six husbands, and she's had five husbands, and the sixth one is illegitimate. And now she has this. Her seventh husband is Christ, and that seventh husband is. Now she takes water out of a well and then Christ offers her living water. And so that's the joining of the masculine and feminine, the joining of the gathering in of the foreign and the strange into that which now becomes palatable. And that's the relationship between Christ and the Samaritan. But it's also the relationship of Christ to everybody else, all of us, all of us goys, all of us that are Greeks and coming from other cultures. That's what Christ does to all of us. He takes bitter waters and he transforms them into sweet waters, into a well. So why do I feel like all my answers today? Are extremely abstract. I'm sorry, guys. I wonder if it's the beer that's doing that. But I just feel like I'm answering in a very, very abstract way. All right. Okay. All right. So JD Says, what is the symbolism of toys, particularly models and recreations of real world ideas, objects there. That, that. That's a good way of understand. They're models of real world objects. And so there are little microcosms and usually they. They are there to. How can I say this? Okay, here's a good way to understand. Play is manifesting things which are not yet fully possible in the world. And so a child has a doll, and that doll is a microcosm of a baby. Let's say it's a small. It's a imitation of a baby. And so by being an imitation of the baby, the child will manifest the relationship between a mother and a child in a. In a playful manner, in an experimental manner, until she is ready then to move towards the real. The real thing or the higher version of the same pattern. You know, the living version of the same pattern. And so it's the same for a boy with his cars. You know, he's playing with cars and he can run into the ground, you know, he can run it into the wall, he can toss it up in the air. He can do all the things that you're not supposed to do with cars, but also understand the consequences of that until that person is ready to then have a real car and to use the real car. So that can, that can help you understand the two aspects of toys, which is, one is the aspect of the toy which is there to train you in the real world, right? Because it's potentiality that hasn't been actualized yet, that it's still in the process of becoming what it's going to be. But there's also the aspect of the toy which is the more. Even more playful, like more fantastical and more kind of Morpheus thing, right? The, the. The idea of a stick that becomes a gun, that becomes a. That becomes a, you know, a lance. The same object morphs and moves because it is also this marginal thing that is not fully realized in its potentiality. It's not, it's not. Not completely. It's participating in your moving towards something more, but it also is in the space of possibility and imagination and, and pushing the rules, bending the rules, because it's just. It's farther down on the ontological ladder of what those things represent. I don't know if that makes sense. Hopefully that Makes sense. So, Maya Ojala asked, thank you for your work. Jonathan, asking for a friend, will you do another movie analysis suggesting you do the Good, the Bad and the Ugly? I mean, I think I probably will. The thing about the movie analyses, I'll be totally honest with you guys, is that, is that I don't watch a lot of movies. I've said this many times. I just have to be honest. I just don't watch a lot of movies. At least not anymore. Not since I don't. Not since I have a family. Not since I have kids. I watch a lot of kids. I watched a lot of kids movies. Now these days we don't. I just don't watch a lot of movies. And also I just, They're a lot of work and, and I don't know if, if, if they're, if in the end a lot of those have been really worth the effort. Maybe, maybe they have. And, and, and maybe, like, please tell me that I'm wrong. It'll probably be, it'll probably happen, but maybe not right away. Right now there are too many things to talk about and there are too many things going on. But yeah, I don't know which. I, I'm not even sure, like, which movie I would do. The Good, the Bad and the Ugly is a good movie. So maybe, hey, who knows? Okay, so Nick Scott asked. Hello, Mr. Peugeot. My question is based on your patreon video from November 2019. I thought that the icon of the Last Judgment being analogous to the yin yang was very profound and true. I am wondering if it would be fair to summarize your thoughts on this as an excess of the right hand goes down into sin of the right hand which necessitates a return to or rejuvenates the left hand and vice versa. If so, your X shaped diagram could perhaps be extrapolated out to show this return and would end up looking like infinity symbol. Right, like that. Am I on the right track? There's something about that. You're on the right track. So, I mean, it's hard because some of you might not have seen my patreon video from November 2019, where I called it something like the laboratory of symbolism. And I really go, I try to show people sometimes the kind of frenetic energy that comes into trying to understand the symbolism. And I was talking about the, how the symbolism of right and left hand seems to cross. And I saw it, I've seen recent examples of that which are really strong in, in tradition from other cultures. I was looking at an Image of the Pharaoh. And the Pharaoh, you know, you see this image of the Pharaoh where he's got his hands crossed like this. And in one hand, I even forget which hand it is, I think. So in his left hand, but which is. Crosses over to his right, he's holding a shepherd's crook. And then in his right hand, but then. Which also crosses over to his left, he's holding a fly swatter. And so you can see in that symbolism, right, the shepherd's crook is there to bring in the sheep, and the fly swatter is there to chase away the. The bugs, chase away things. So one is to bring closer, one is to chase away. But then the shepherd's crook is. Is. Is. Is crooked. It turns, and the. The splice water is straight. And so. But then it crosses over. So it's like. You can see that that's what they're trying to deal with, this problem of how the right hand. And you can see it in the two snakes kind of going like this, where it's as if when you go to one extreme, it turns and becomes its opposite. And then it turns and becomes its opposite. But then when you have two. You have these two sides, right and left hand, which go to the extreme and then cross over and become their opposite. And so it seems like it's something like that. And. And yeah, your image of the. Of the infinity is good, or you can understand it also as the snake. There's an image. There's an ancient image of a snake that crosses like this, but then at the bottom has the same tail. Like the tail is tied together. I think that that's a good representation of this problem, is that maybe ultimately they're actually at the same source, but then they split and cross. So, man, I'm sorry, guys. This. All these answers are so abstract. I don't know. I don't know what's going on. So sorry about that. All right, I'm gonna try to get a few answers that are gonna be more kind of anchored and. And. And less all the way out. Okay. So, Jason Lindsay asked, what on earth is going on in the story of Jesus exercising legion from a man. Am I picking up on a pattern of the multiplicity of demons descending a hierarchy from humans to animals and finally into water? Yes, very good, Jason. You got it. For years. I feel like there is much more going on in this short story than Jesus driving a bunch of rowdy demons into pigs, though. Yes, exactly. Do you have a symbolic interpretation of the story? I think you. You were right on. You've got the symbolic interpretation of the story. It's a really good, It's a really simple vision which is, you know, I talk. So you have a person who's supposed to be one, but they are, they are possessed by multiplicity, right? And so you know the story that he throws himself in the fire, throws himself in the water, right? So he, he, he is, his multiplicity is pulling him into extremes, all right? This kind of being subject to his own multiplicity, to the multiplicity of demons, multiplicity of his passions, all of these kind of coming together is, is. It's exactly that. And it's. So, it's making him go into these extremes. And so Christ subjugates this, these demons and he pushes them down, right? Just like you can imagine this image of St. Michael, which is the lance, like pushing down the, the, the, the devil. Sometimes you have these images in the Last Judgment where you see the angel and St. Michael casting the devil down with all the demons into hell. And so that's what Christ is doing. Christ is casting the demons down. And you're right that the image of that is that they go, remember the image of the mountain, right? And so the image of the mountain with the, with man above, you know, near the tree and then down the mountain is where the garments of skin are and animals are at the bottom of the mountain. And then later down on the mountain is of course, the, the waters. And so that's exactly what's going on. Christ is manifesting that pattern where he's casting the demons down. Pigs, water. Good. Good insight, Jason. So Don Palermo asks, considering the practical application of symbolism, specifically that of 666, to pay attention for how Christians might choose to participate or not? How might you converse with someone who believes that participation with partial manifestations like modern money system as neutral in regards to meaning and that based on the way the story of God's people works, one can expect inappropriate participation to be as obvious as making libations to pagan gods under Roman rule. All right, so, so Don, what Don's asking is, if you haven't followed my videos, you might not know what we're talking about. And so in my videos, and I've talked about the symbolism of 666, the symbolism of the notion of complete naming or system of absolute control. And what's how the symbolism of 666 is referred to that especially the idea of accounting for the exception. Okay. And trying to account for the exception. And so if you want to understand the way that it's going to get tough. If you want to understand the way that you can start to know when 666 is a problem is going to be in the moment where you're going to be asked to. You're going to be asked to pay to do that. You're going to be asked to make libations to the exception, and you're going to be asked to make. To submit yourself personally to these things and in a spiritual manner, like even. Even really in a spiritual manner like there. There will come a time when churches that don't accept certain things will not be allowed to function. They just won't. They won't be allowed to function unless they accept. They accept certain social rules or these new social categories. And so I think that in the. That's when we'll know. That'll be one of the moments when we'll know that it's gone too far. But you can't totally avoid the system of control and the system of identification. It's not a bad thing. It's a normal thing. There's nothing wrong with, with, with control of, of that authority having some control and authority having some naming capacity and some accounting capacity. That's totally normal. It happens in this problem of accounting for the exception and how, like you said, at some point, some point, we will be asked to actually compromise what we believe specifically. And that's what I think it's going to be. It's going to be too much. All right, so Charlie Longoria asks. Hello, Jonathan. I had two quick questions. Let's see if I answer both or just one. Do you have any tips, advice, or books for someone looking to learn to draw or paint? I'm not very good, but always wanted to learn. I mean, there are many ways. I mean, there are so many places where you can learn how to draw and paint. Right now, it's just mostly your capacity to put in the effort to do it. You know, there are online classes. There are all kinds of ways that you can learn to draw and paint. You can draw from life. You can. You can take a community drawing class. I would suggest taking something that isn't about expressing your creativity, but is mostly about trying to. To see and to. To copy at first and to understand the patterns in something. So observational drawing, drawing from patterns, like, you know, how people learn to draw, comic books, for example, learn to draw, understand the inner proportions of a body. That type of learning, I think is useful. But there's all kinds of ways you can do it. It's mostly about putting in the time and energy. So two, have you ever considered having classroom lecture on Patreon that goes in depth, specifically about Bible symbolism? Yes, of course I've thought about these things, that maybe I could do something that's more systematic and kind of following a book of the Bible or following. And maybe, maybe for now there's just so many things to talk about. When I run out of things to talk about, then maybe I'll plan it out a little more. But for now it's like there are too many things to talk about that are just all around us. So Paul, do Paul Dumal or Dumasle asks, hi, Jonathan, what would be your advice to young men born and raised outside the church and often in recomposed families, struggling to find a sense of community in these strange times? Thank you for your work. Much love from France. And so, I mean, just because you're born and raised outside the church, I mean, doesn't mean that you can't go to church. I do believe that that's probably the best place to encounter community. It's one of the last remaining places where you can still encounter some sense of community. And so, I mean, that's what I would suggest that you do. Yeah. So Bruno's asked. I'm struggling with the symbolism of the Lamb applied to Christ and to his followers. When you say Christ is the Lamb of God, as far as I understand the Lamb represents the sinless nature of Christ and his sacrifice. But I don't know how the symbolism applies to Christ's followers. For example, in John 21, when Christ tells Peter, feed my lambs. So the way to understand it is that Christ is the shepherd and we are the lambs, we are the sheep. That's how you have to understand it. That's all the. The stories of Christ referring to this, that's how they talk about this, that, that Christ is the shepherd, we are the sheep and we are meant to hear his voice and to manifest his will. That is, that is our function. We are, we are supposed to it to let. To let's say, put aside our own will in order to discover the will of our shepherd, in order to discover and follow and manifest the will of our shepherd. Of course there's a mystery in that, which is that as we do that we. We will also discover that it is not. Ends up not being just a denial of our will, but ends up being actual filling of our will with the higher will. Okay. But nonetheless the image is still sound. The image of shepherd that calls and the sheep that answer, that follow that manifest now in terms of Christ being also the Lamb, now this is all about Christ. This is all about the insane way that Christ joins Alpha and Omega together. The insane paradox of Christ being the first and the last, being the top and the bottom, filling the entire world with his glory. And so Christ, there's an aspect of Christ's symbolism which is that he's the king, he's the shepherd, he's the sower, he's the reaper, he's, he's, you know, the groom, he's all of these images of above. But there's also a whole aspect of symbolism in which he is the servant, the suffering servant, the Lamb, the crucified one, the one who becomes sin for our sake, who becomes the snake for our sake, who goes down into death, you know, who willfully dies, who is silent, who is quiet before his accusers. Right. So he's the Logos, but he's quiet before his accusers. And so there is this spanning of symbolism that is so big that it just fills the entire, fills out the entire world. That, that's why you will also see that symbolism in Christ, that Christ is both the origin of reality, but he's also the Lamb slain before the foundation of the world. So that's it, that's the mystery of Christ. And so I can't explain it to you completely, but I can see it and I can just, just be completely blown away by the mystery of being able to contain all this symbolism into one story and into one person. Who is exactly that? Who is this containing of everything into, into his person? So, all right, so AJ Del Toro asks. Hello, good sir. With all the chaos going on in the usa, I've been thinking about how there are not religious and non religious people. We are all religious. I was watching the BLM supporters forcing patrons to raise their fist and I thought, wow, they are way more religious than I am. Yeah, they, they're basically running an inquisition that said, are there any good stories in the Bible or symbolic structures that illustrate this concept? The closest I can think of is in Exodus where the people bow down to a golden calf. Thank you. Yes. I think you've got a really good image of it, which is that we all bow down to something. And so in the denial of. The denial of God in scripture is always seen as idolatry. It's not just a denial of God, but it's a denial of God in order to worship something else. Now the, the, let's say the, the new atheists or the kind of materialist they, they're naive about that. They don't realize that they are worshiping something else. But you can see it, you know, Freud worshipped sexuality, you know, and all the different kind of, you know, Nietzsche's worship will. And you always end up worshiping something which is lower. The Enlightenment, the French revolutionaries worship reason. They had the goddess of Reason, you know, they even had statues of her put up in churches. And so you're right. You're totally right. The making of the golden calf is a great example. And especially because there is this animality to it, right? And so Moses goes up the mountain, the people stay down below with the animals, and then they worship the golden calf. They end up worshiping in an upside down way their animality. And so you can understand it as being led by your own passions. You know, you. You deny God, but you worship your own desire for money or your own desire for sex or your own desire for power and, and being more, you know, or prestige or whatever it is. Doesn't matter. It's mostly the idea that, yes, indeed we do. We do always end up worshiping human beings, are worshiping creatures. And so. Oh, I think I missed a whole bunch of question guys here. I'm gonna go back here and get the questions that I missed. Right. All right. So Jan, Peter Jager asks my question for you is how can we encounter the essence of. Of time? Because I think when we try to describe time, we always lend hidden or not terms from space. The fact we try to measure time with clocks and weeks, etc. Is seeing time through the lens of space. As Bergson already observed, in the modern world, we do this constantly. Is it therefore possible in symbolism, to encounter time as it is? We can't name it as it is. How can we draw near, or can we name it from its own vocabulary in the way, in this way encounter time? You might say time is pure movement. But movement as term is, I think, already a term lend from space to time. This is my problem. So. Oh, man, what I'm going to say is going to sound so, like, cliche now. And so the way to encounter time is it's related to the notion of. It's related to the notion of the moment. This idea of, you know, the carpe diem, it's seize the day. But seize the day doesn't mean just have fun and, you know, you only live once or whatever. That's how it. Seize the day means. Seize the day means to seize the moment, right? To. To. There's the. There's the possibility, it seems. And we sometimes have glimpses of it. But you read about it in mystical teaching, in mystical texts where you're able to. Because time is always in the moment. The past doesn't exist, right? The future doesn't exist. It all exists as memory in the moment. And so it seems like there's a possibility of capturing the moment so you can imagine it. And so I'm going to use. I'm going to use an analogy to space. I'm sorry, but it's. It's like it's going into the center, but it's the center of time. So it's not a spatial thing, even though I'm using that again, despite what you said, trying not to. That notion of seizing the moment. But there's also an idea that in the moment, there's. The moment opens up to eternity. That eternity, as the fullness of time is accessible, you can have access to it in the notion of the moment. And so I say that, and I'm telling you that I have not reached that. I've had glimpses of it, and I think most people have had glimpses of it where. When the moments can brighten, like, there are these moments that become very bright, and then you almost can pierce through the present moment. It almost feels like time is opening up or stopping or, you know, it's a mix of either lasting forever and stopping. And so you can kind of enter into these. These little moments. But it's very. And then it goes away, right? It's like, pop, it's gone. But it seems like when you read the mystic, that it's possible to. To kind of enter into that and live there. I don't know. All right. All right. So Christopher asks. I have an infant daughter that I have, and I've watched A Little Mermaid more time than I can count. I was wondering what the symbolism of talking to animals, or just a talking animal, is my first month as a patron, so excuse me if any my questions are repeats. God bless. Well, Christopher, thanks for supporting me. Just like all of you, I just. I really appreciate it. And so the symbolism of talking to animals, there are different. There are different aspects to that symbolism. One has to do with, like St. Francis, for example. Like in the case of St. Francis, what you have is you really do have someone who is encountering the. Encountering God in everything. And so everything is full of the light of God for him. And so he is able to actually encounter things almost like you encounter or maybe exactly like you encounter people. I don't know. He's able to see the face of God in all of creation. And so because of that, he's able to speak, to speak to animals. Right? So there's that aspect. There's. There's also an aspect of like, like, for example, in the story of Balam and the, and the donkey, there's a, there's a. There's a relationship between something coming back. So it's like it has to do with this turning. Right? So it's like in the story of Balaam, you have the donkey, and the donkey is the dumbest animal, is the most impure animal. But then when you reach the end, it actually comes back and then it speaks to him and it's manifest. It's like a little, it's like a resurrection. It's like a little glimpse of what the resurrection is, where the animal goes down, the animal comes back up and speaks. There's that. But then there's also a kind of aspect of totemizing reality. This is more to do with kind of fairy tale and pagan world kind of thing where the, the animal becomes a, A. The animal becomes a vehicle, like something to be. To ride upon. And it becomes a vehicle for some principle or some, some pattern. Right. And so that's, that's also an image of the animal speaking. You know, it's as good as it's going to get for me. In terms of the Little Mermaid, I think, you know, I think that it's using the trope of fairy tales, which always has kind of talking animals in it. And, and I think it's a, it's a mix of all those, those things and the talking animal, like, for example, like you can understand. So if you understand the talking animal, for example, like in the story of Pinocchio, for example, example. And in the story of the Little Mermaid, to a certain extent, it's the idea also of the animals acting as an extension of the person, and so the animal, the cricket, as the consciousness of Pinocchio. And then in a lot of Disney movies, you'll have a creature which acts as the conscience or looks like kind of an extension of that person, an aspect of that person which is then kind of exteriorized and talking to them back. And so that seems a lot of that is in the Disney movies, a lot of the animal creatures, that's their function. They're basically extensions of the actual character. So JL asks, I'm trying to understand the effects, side effects of the canonization of Scripture. What effects does the closing of canon have on a system of faith, society and consciousness versus an open canon? And I guess the oral tradition of the past. I have the feeling, this feeling for some reason that a set of closed canon would lend itself to complex problems as the time moves on. I don't want to read this too much, but I would say you're right that there is a. Definitely a relationship with that, a way to a really good article if you. I'm gonna, I'm. I rarely suggest people go directly go read something, but there's. This is actually a really an article that deals with this problem very specifically. And it's called Tradition and Traditions by Vladimir Lawski. It was published in several books. I think you can, if you look for it online, there's our PDFs floating around. And in that text he talks about the relationship between orality and scripture. And he sees it as a hierarchy of manifestation from silence to spoken to scripture in a broad sense of out outward form. And so in that sense the closing of the canon doesn't mean that there's no more Scripture. In a broader sense it doesn't. It means that, that the canon of scripture, of the Bible has a particular function, let's say a higher function and a function of making sure of certain things that they are stable. But it doesn't mean that there also then won't be all these other traditions which are kind of being written down lower on the hierarchy of tradition. And so I think that that's a better way and a more orthodox way of understanding it. And yeah, I would check out that article. It's definitely worth, definitely worth reading. All right, so Phil, Phil M. Says the Orthodox Church has been taking controversial stances on politics in the US in some instances claiming that supporting specifical, specific political organization is part of the Christian calling. Yeah, man. I believe there are bishops to be capable of error and aware of those who would make any such proclamation. Is it heretical for members of the Orthodox Church to disagree with claims by archbishops about how Christianity relates to socio political events? No, it is not heretical. If heretical, what are the limits of the archbishop's ability to associate the church with other organizations? They don't have that power. So I don't want to get into politics, guys. You know, I really don't like to do that. But your priest, your bishop does not have the authority to tell you who to associate with politically. They just don't. They have the capacity to tell you what is ethical and unethical. But that is not an organization, that is not a political party. That is a behavior or, or a specific moral stance. And that's different, right. And so it's different to say, it's different to say something like that it is immoral to not care for the poor, let's say, or someone saying it is immoral to have abortion. But it is not right for an archbishop to say, therefore you cannot support this political party or this political party. I don't think that's right. Because the thing is, is that although those, especially in a secular society, those immoral things are going to nicely separate between the different parties, you're going to find immoral things in, in both parties. And so, and I'm not saying that I think, I think that there are political parties that are obviously less, less close to the Christian ideal. I do agree, and I think that we should warn people and we should tell people how dangerous it is. But I don't think that, I don't think that clergy can tell you who to vote for, for example. I think that that is a definitely a misstep. And I, and I would hope not that I would hope clergy are not engaging in that kind of stuff, especially in the secular society. My goodness. So sometimes, so Keenan Wang says, sometimes you talk about remembering yourself as a goal. How does the goal of remembering oneself contribute to remembering God? And how does it detract from remembering God? It seems to be a point of conversation between you and Jordan Peterson. Recently. I found that some of Peterson's guidance to make change locally in a humble manner to be helpful. How does this fit with it, with a Christian viewpoint? So I think that, I think that remembering yourself in the right way, right? Not remembering yourself in the, in the sense of just attending to your desires. That's not what I mean. What I mean, of course, by remembering yourself is having a kind of attention on what you're doing so that you can notice what you're doing and that you're not a. You're not abandoning your attention to your passions, you know, and so, so you have your passions that pull you in different directions and will make you act if you're not attentive and you don't, if you don't, let's say, stand above them and attend to what, where they're pulling you. And so that's the kind of thing, what I'm talking about, that I'm talking about. And usually when the fathers talk about remembering yourself, they even go further and say, remember your death. Remember death. So it's not just about remembering yourself in a broad sense, but remembering that you're going to die and noticing those things that bring you into Death, right? Not just notice the patterns of being that you're engaging with that are leading you to death. And so if you do that, then it doesn't detract you from remembering God. It ends up being directly related because as you remember death, you call upon God, right? You. It's like it has to manifest itself as. As you see these things pulling you apart, then your next move is to go is to look up and say, lord Jesus Christ, have mercy on me. Right? And so that's the. That's the image of the, you know, the publican in the temple who beats his chest and says, you know, you know, have mercy on me, a sinner, right? Have mercy on me, a sinner. That's the image, right? That's the image of all that coming together, which is remembering your death and asking for mercy. And that is the. That's the proper balance of the two. Okay? So it seems to me that the seven ecumenical councils must point to the same things as the seven days of creation, especially as the seventh ended up getting its own day of celebration. Apart from the other six, however, I'm a little stuck figuring out exactly how they do this. In particular, how does the distinction of the themes of the first six councils with the theme of the seventh icons reflect their principles of work and rest? I'm not sure. I'd really have to think about that. I would say to be careful not to try to create easy relationships. I would really have to think about that. I've never thought about that. So. So what I have to think about it. I'm not sure it maps onto that to the same, to be honest with you. So. And it's also, it. It's interesting because it really has to do with how you frame things. Because when you say the idea that the seventh Ecumenical Council is. Is. Is about icons and their veneration, it's not just about that. It's about something else. The seventh Ecumenical Council is largely about the Church removing the yoke of being submitted to the Byzantine Emperor. There's that happening too. That's why we have the sun. We call it the Sunday of Orthodoxy. And the Sunday of Orthodoxy, which is the celebration of the seventh Ecumenical Council, has as much to do with. With the Church because. Because one of the aspects of. Of iconoclasm was that it was imposed by the emperor and the emperor was imposing this doctrine onto the Church. And so the seventh Ecumenical Council is also a freeing of the Church from the yoke of the Emperor as much as it is. So just to say that I'M not sure in maps on completely, but we'd have to think about it. All right, so Jonathan Peterson asks, how do you define individualism? And so Jonathan, he wrote like five, five paragraphs. I can't, I can't read all of this for you for your question. And so it's mostly about how I differentiate my notion of the, of individualism. And so I would say, okay, so maybe I would say something like hyper individualism is what I see as a problem or the modern notion of seeing individuals as these separate points. So the way that, let's say the modern vision or the modern state understands the individual is that you have these, all these individuals, these separate individuals. And, and then you have the state. Right. And so it's like individual state. But I don't think that that, that's how it works. I think that there is no individual without communion. There is no. It is not good for man to be alone. There is a sense in which our existence is communion. We exist as communion of beings. We don't, we don't ever exist as the. This kind of. Bro. This kind of point. Individual point completely. And so that's maybe one of the issues. And, and I think that one of the issues that I have with Jordan is that because he, and because he emphasized the individual so much, he rarely talks about how the people or the individuals, how they scale up into higher beings, into communal beings. And, and he, and, and what I, my contention from the very beginning, like if you listen to my very first speech that I gave with him in public in 2016, or maybe it was early 2017 in Toronto, I call the Resurrection of Logos. I bring up this problem, which is that if we're going to talk about logos, it means that we're going to have to deal with identities that are above the individuals. So we have to deal with it in a healthy manner and not just want to somehow discount it and want to talk about these individuals and not try to explain how, how these scale up. And so that's maybe my difference. And so, yeah, so I'm sorry, I might not be answering your question, but you wrote too long a description and I, I can't, I can't go into it in the question period. So John Valenzuela says. Hi, Jonathan. I've come to believe that forced masking within the temple is a form of iconoclasm. As we're living icons of God, it strikes me as wrong that wooden icons would not be covered, but living icons are, in the name of safety. Would love to hear Your thoughts on this. Thank you for all you do, man. That's a comp. That's a tough thing. I don't know how people are doing it. Like, you know, I really do struggle with that as well, very much. And I mostly struggle with priests wearing. Wearing masks in the altar in. I don't know if they're doing it and I don't know who's doing it and who's not. But I would say that it's a dangerous thing. It's a dangerous move that we're. That we're accepting to accept wearing masks in the. In the. Especially in the holy place, especially because St. Paul has a whole text about veiling and why certain veils are worn and why other veils aren't. So I would say. I would say we need to be cautious. It's. It's a. We're. We're compromising some things. So. All right, guys, I have gotten through all the questions. Let's see. Not bad. It seems like I've been going on two hours in the past few months just because there's so many questions. And so I'm thinking, right, not so many. So let's just look at them. So, Andre Johnson asked, do you plan on making a video about the Alexander Romance? So, yes, I've made several. I've made one that was a patron only video, and I've at least made one that was public one on the ascent of Alexander the Patron. Only video I made was on Alexander building the Wall. And. And so I do intend to kind of slowly go through many of the legends in the Alexander Romance and talk about them, but I'm going to just kind of do it slowly and move. So Mason Bradford asked, what is more important, the appearance as it does it looks beautiful of the church or being able to understand the words of the liturgy? I mean, I don't know. I don't think those have to be in. In competition. I think that we need both. So, Ray Fleming, why. Hi. What do you think about the symbolism of the rainbow flag? During the pandemic in the uk, people put up signs with a rainbow on them saying, thank you, NHS National Health Service. Yeah, we had that here in Quebec. People put up rainbows and they wrote, it's going to be okay. They wrote that in French. It'll go well on these rainbows. And I mean, the rainbow is. I'm sure I've talked about this before. So the rainbow is multiplicity. That's what a rainbow is. It's the breakdown of the one color into many colors. And so it's a neutral symbol. It doesn't. It's neither positive nor negative, and it can be either positive or negative. You can understand it as a bridge between categories. So a bridge. So you can, you know, when you see a rainbow that looks like a bridge between heaven and earth, like that, where it connects above and below, you can understand it that way. You can also understand it as a ring around the sun. So often you see a rainbow as a ring around the sun, so you have the sun in the middle and you have the rainbow on the edge. And so the, the rainbow is a symbol of this multiplicity. Now, the use in it, the use of it in the LGBT flag is, Is a perfect use. It's. They really, they really, they're. They're making an appropriate use of that symbol in their context, because that's what they want to emphasize. They want to emphasize multiplicity. They want to emphasize. What do they, what do they say? Spectrum. Because. Because a, A rainbow is a spectrum of colors. It's actually not, you know, if you, if you look at it very carefully, you'll see that it's not six colors. It's a. It's a spectrum of colors. And so it is that very breakdown of white light into many colors. That. That's what it is. And, and so why would we use it now during a pandemic? And it, I think in this case, it has mostly to do with the idea of the rainbow appearing at. As a bridge, as a bridge towards another reality. And so at the end of the flood, there's a rainbow. And so that's the rainbow I think they're trying to express, which is the rainbow at the end of the flood, which appears as a bridge and. And also as a ring, as a covenant, as something which contains, you know, shows us the end, but also contains the bad thing that happened. And so that's why I. That's why. That's why I think it's being used. So, Sidi Haroun for. Sorry, I'm not saying how many people. It's like. Yeah, so Sidi Haroun says about pirate stories, whenever I'm insecure, sad, a good pirate story always cheers me up. Is there any symbolism behind pirate stories? I mean, is there Sandy symbolism behind pirate stories? Yeah, there's the symbolism of a pirate story is the symbolism of the thug. Like, it's a symbolism of the thief, of the freedom, which comes from being outside of the law. Also the consequences that come from being outside of the law. And, you know, and so the Image of being at sea, of being not bound to land, therefore not bound to law, and, you know, not having to live by the strictures of society. You know, that's the attraction of the pirate story, you know, but it's also its dark side, which is, you know, pirates kill and rape and pillage because they're outside of the law and they're outside of. They're not bound to land. And so those two aspects of the symbolism is why. Is why they're. They can be attracted to us. And Nathan woods asks Seraphim, Rose, I don't. I don't understand the question. Do you want to know what I think about different. Rose? I think Seraphim, I think Father Seraphim was a very holy man, a holy ascetic who had some very good insights, you know, and a lot of people. It doesn't mean that I totally agree with all the conclusions he comes to, or. Or rather I think that many of his writings were also, let's say, directed towards orthodox Christians and towards certain types, certain people. And so. But I think that he was definitely a holy man. And I think that his insight in. In. In some of his texts about the religion of the future, you. You're probably referring to that. I think, think that many of his insights are quite good in terms of foreseeing, like, you know, the kind of weird new age type of religion and the resurgence of religion that we're seeing in. In these times and the cults and all this kind of weirdness. I think that his insight is quite good. So. So, yeah. All right, guys, we made it through. Made it through. So I hope that you guys have enjoyed this. I really feel like. Really feel like my answers today for some reason were very, very abstract. And so I'm sorry about that. I can blame it on John Vervake, I think, for all the. For all the affection I have for him. You know, it's like when I have. I just had a conversation with him that we put up, but when I talked to John Verbecki and he gives me the. He gives me the right, I would say, or he opens up for me the possibility of speaking in highly, highly abstract categories. And so because of that, you know, I rarely let myself do that. But then with him, it's as if I feel like I can do that and the conversation is fine, but then. But then I need to come back down the mountain. I need to come back down and. And get into more kind of nitty gritty stuff later. All right, so one last super chat for 279 D. Lars asks, is the Book of Daniel worth diving to? Yes, the Book of Daniel is an amazing book. It's definitely worth diving into. But I would say that in our case, the Book of Daniel has to always be interpreted in conjunction with other prophetic books. With Ezekiel and especially as Christians, we also have to interpret the Book of Daniel in relationship to Revelation, in relationship to the Incarnation. But with that, definitely the Book of Daniel has a lot of stuff, very powerful imagery in it. So, yeah. All right, here we go. Here we are. I mean, so guys, thank you again. Thank you so much for giving me the possibility of doing this. I'm still, I feel like I'm still as excited after, what has it been, like four years now that I've been making these videos. I feel like I'm as excited to do this as in the beginning. And I'm excited to see the blog with all these amazing articles that are coming up. Like, there's one right now that I haven't shared yet, but I will trying to look at the symbolism of Batman v Superman, which not a movie that I particularly like, but I agree that the writer was trying to fit in these kind of mythological patterns in the story. And so it's just one example. But there have been really many wonderful articles that have been coming up on the blog. And of course, a lot of it thanks to JP Marceau, who you've seen on my channel a few times, who's been managing it and who's been managing the editing team. But there's a whole team of editors and a whole team of people who are also being moderators on the Facebook group. You probably know them by now. Jacob, Brad, Lisa and people and Lisa running the Klitsch channel with Lasse. And so just, I just feel like I'm so, so surrounded by amazing people and you know, and it's just, it's just wonderful to realize that, like, here we are. Who would have thought like four years into this there'd be like a whole community of, you know, of people who really want to rediscover symbolism and thinking in terms of symbolic patterns. So thanks for your time. Thanks for your support, everybody, and I will see you once again next month. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, just Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the zombie invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well, and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
