{"episode_id":"SW - #364 - 2024-11-17 - Did the Witches Win - The Hammer of Witches through a Symbolic Lens","start":0.16,"end":2.4,"speaker":"Laura Diaz","text":"Tucson, the weight is over Mediweight loss."}
{"episode_id":"SW - #364 - 2024-11-17 - Did the Witches Win - The Hammer of Witches through a Symbolic Lens","start":2.4,"end":4.56,"speaker":"Mediweight Loss Spokesperson","text":"They're officially open on North Oracle Road."}
{"episode_id":"SW - #364 - 2024-11-17 - Did the Witches Win - The Hammer of Witches through a Symbolic Lens","start":4.56,"end":7.72,"speaker":"Laura Diaz","text":"That's right. No more counting down the days. You can walk in right now and."}
{"episode_id":"SW - #364 - 2024-11-17 - Did the Witches Win - The Hammer of Witches through a Symbolic Lens","start":7.72,"end":9.56,"speaker":"Mediweight Loss Spokesperson","text":"Start your journey to a healthier you."}
{"episode_id":"SW - #364 - 2024-11-17 - Did the Witches Win - The Hammer of Witches through a Symbolic Lens","start":9.56,"end":11.6,"speaker":"Laura Diaz","text":"Hey, it's Laura Diaz from iheartradio and."}
{"episode_id":"SW - #364 - 2024-11-17 - Did the Witches Win - The Hammer of Witches through a Symbolic Lens","start":11.6,"end":44.42,"speaker":"Mediweight Loss Spokesperson","text":"You can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks at mediweight loss. I got the same medication, but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options."}
{"episode_id":"SW - #364 - 2024-11-17 - Did the Witches Win - The Hammer of Witches through a Symbolic Lens","start":44.66,"end":48.42,"speaker":"Laura Diaz","text":"Tucson, your moment is here. If you're ready to take control, feel."}
{"episode_id":"SW - #364 - 2024-11-17 - Did the Witches Win - The Hammer of Witches through a Symbolic Lens","start":48.42,"end":50.26,"speaker":"Mediweight Loss Spokesperson","text":"Better, and lose weight the right way."}
{"episode_id":"SW - #364 - 2024-11-17 - Did the Witches Win - The Hammer of Witches through a Symbolic Lens","start":50.26,"end":52.13,"speaker":"Laura Diaz","text":"Mediweight loss is ready for you."}
{"episode_id":"SW - #364 - 2024-11-17 - Did the Witches Win - The Hammer of Witches through a Symbolic Lens","start":52.13,"end":54.53,"speaker":"Mediweight Loss Spokesperson","text":"Walk in, get started and see real results."}
{"episode_id":"SW - #364 - 2024-11-17 - Did the Witches Win - The Hammer of Witches through a Symbolic Lens","start":54.77,"end":59.17,"speaker":"Laura Diaz","text":"Call or visit mediweightloss.com to learn more and book your free consultation today."}
{"episode_id":"SW - #364 - 2024-11-17 - Did the Witches Win - The Hammer of Witches through a Symbolic Lens","start":59.25,"end":62.57,"speaker":"Mediweight Loss Spokesperson","text":"That's mediweightloss.com if you're a maintenance supervisor."}
{"episode_id":"SW - #364 - 2024-11-17 - Did the Witches Win - The Hammer of Witches through a Symbolic Lens","start":62.57,"end":89.25,"speaker":"Grainger Spokesperson","text":"At a manufacturing facility and your machinery isn't working right, Grainger knows you need to understand what's wrong as soon as possible. So when a conveyor motor falters, Grainger offers diagnostic tools like calibration kits and multimeters to help you identify and fix the problem. With Granger, you can be confident you have everything you need to keep your facility running smoothly. Call 1-800-GRAINGER click granger.com or just stop by Grainger for the ones who get it done."}
{"episode_id":"SW - #364 - 2024-11-17 - Did the Witches Win - The Hammer of Witches through a Symbolic Lens","start":91.41,"end":397.31,"speaker":"Jonathan Pageau","text":"In the very late 15th century, a book called the Malleus Maleficorum was published. Translated, it means the Hammer of Witches. And this book was written by some disgraced clergymen. It was actually condemned by the Inquisition and the Catholic church. But nonetheless, this book had. Has become the central point of all our imagination about witches. How we think of them in terms of writing broomsticks with cats and, you know, cavorting with devils, all of this comes from this book. And so I thought it would be really interesting to look at the book because although it is a very, very wild book and it actually exemplifies the uneasy transition between the medieval worldview and what. What would become the modern worldview. There's a very. There's a very strange difficulty that the people experience in trying to bridge a more symbolic worldview with a more let's say, grounded worldview. I thought it would be nonetheless interesting to look at because in it there are some things which are really relevant to the modern world and relevant to what's happening around us today. And it can help us to understand what. Whether or not the things described in the book are true or whether they were rather projections of the imagination. It doesn't matter in terms of narrative because it can still help us understand why that narrative came about and what it means for us today. Ultimately, it can help us see whether or not the witches won in the end. This is Jonathan Petro. Hello. Welcome to the symbolic world. This book, the Malleus Maleficorum, is very wild. It is usually typified as a medieval book, but being written in the late 15th century and early 16th century, I would actually contend that it is an early modern book. And in it we find the uneasiness of this transition, like I said, because between the medieval world and the modern world, the same kind of things that we see in the conflict around Copernicus and Galileo, all of these problems of trying to bridge two worlds that seemingly didn't fit together anymore. A symbolic world and a burgeoning, let's say, proto scientific world. And so we see some of that in this book. What is really interesting is to notice, first of all, it's a crazy book if you're going to spend some time reading it. First of all, it's very long. It's like 700 pages. There are some really, really crazy stuff in there, you know, in terms of trying to decide whether or not, you know, the fact that witches flying brooms is physically real, whether or not them, you know, having relationships with devils is also physically real. Real. All of this is pretty crazy. But there is one thing about the book which really caught my attention and I thought would be worthy to look at today, because in the book, at the first part of the book is a kind of Thomistic discussion trying to use Aristotelian categories, trying to argue for what are these witches? What is their purpose? You know, it also talks about the nature of women, it talks about the nature of heresy. And ultimately what it's trying to do is to argue that witches are heretics and that's why they. They should be burned. Like I said, this book was not accepted by the Inquisition, but this notion of burning witches was really an early modern phenomena that was sparked mostly in the secular courts of Renaissance Europe and even later than Renaissance Europe. And so there is even that conflation, the conflation to think that witch Burning is a medieval phenomena when there are very few witches who were burned in the actual Middle Ages. And rather that it is an early modern phenomena and shows us this ambiguity is already something that would be really interesting to look at. But that's not mostly what I want to look at today. What I want to look at is in the book, the authors talk about what the purpose of witches are. And in the first parts of the book, they don't attend too much to the actual how it is that they do it. To a certain extent, the authors don't really care how they do it. They use the term secondary causes, which is that they can describe the purpose and, you know, the reason why things happen. But how exactly these happened for them seems to a certain extent secondary. And so we'll also, while we're looking at this, we'll also talk about these secondary causes, what they could mean and how we could see how they could apply today. Hello there."}
{"episode_id":"SW - #364 - 2024-11-17 - Did the Witches Win - The Hammer of Witches through a Symbolic Lens","start":397.31,"end":436.42,"speaker":"Martin Shaw","text":"This is Martin Shaw inviting you to come and join me for Christian Wonder Tales, my first online course with Symbolic World. It is a secret history of things that we're going to be exploring from the early Celtic saints and heroes of antiquity all the way up to the chivalric tradition of Arthur, Round table, Merlin, the whole thing. What do stories like that have to tell us about the mosh pit of our own modern lives? Well, over four gatherings, we're going to find out. I promise you this, it will not be boring."}
{"episode_id":"SW - #364 - 2024-11-17 - Did the Witches Win - The Hammer of Witches through a Symbolic Lens","start":438.18,"end":810.98,"speaker":"Jonathan Pageau","text":"One of the really interesting things is that the purpose of the witches is spelled out for them and they talk about how the purpose of the witches, what these women want, it's men too. But obviously you can see in the book that it's mostly women. You know, they do say that there are men, but there's something very feminine about the thing that they're describing. The, the purpose of the witches is to, is to basically destroy life. They want, on the one hand, what the witches want is to stop the normal relationships between a husband and a wife. They want to halt them. They want to halt the normal relationship between a man and a woman. They also want to abort babies, and ultimately they also want to kill babies. And so it's, there's, there's this idea of, of somehow stopping the act, the normal act between a man and his wife on this. The second one is to abort babies and the third one is to actually kill babies. And the purpose is this kind of anti fertility thing, that the witches are engaged in a, you know, a kind of desire to destroy the world. And the way that they. That they stop the act between a man and a woman, one of them, which is very strange, is the idea of making the male member disappear. And of. When you read it in the book, it's really crazy because they're trying to decide whether or not this is just an illusion or whether it's actually happened that the person lost their member. But on the one hand, it's also. It doesn't really matter. They try to figure it out. It doesn't really matter because the idea is really an idea of castration. The idea is to remove the male. The second thing is, is of course, the idea of. Of stopping the normal relationship between man and female through the use of demons, through the use of incubus and succubus demons. And this is the idea that if a person, if a man has relations with a succubus and a woman has a relation with an incubus, then the normal relationship between the male and the female will not. Will not happen. The third way is, of course, that the women who were giving birth to babies would also be the ones who would help women abort if they wanted to. And so this is also one of the things that the witches are doing is to stop the act of giving fruit, to stop the fruit of the act of sexual union. And finally, there is also in the idea that the actual killing of babies, when the baby is born, then they will. They will kill the baby. Now, like I said, when the guys who are writing the book are trying to understand how it is that a human person can have a relationship with a demon, you can see that they're very uneasy because even in their Thomistic categories, you cannot cross that line. That is, a demon cannot have a relationship with a human person and create an offspring because one does not have a body and is a spiritual entity and the other one has a body. And so they're trying to explain how it is that they could do it. And they talk about the secondary causes. And so when you look at the secondary causes, it's then when you start to think about them, it's very interesting. It can help you understand some of the things that are happening around us today. So one of the. One of the things they say, for example, is that what the witches want is that they want women to have children from other men, basically. And so they have this notion that the. The incubi and the succubi, that is the, the male demons and the female demons, the ones that are having relationships with women, what they do is that they gather the seed of the men. And so these, the, the succubi demons gather the seed of the men through secondary causes. They don't say what it is. And then they, and then the, they give the seed, seed to the incubus and the incubus then uses that seed to. To impregnate a woman. And then when she gives birth to the baby, it's not her husband's baby. Now, of course, when we see it at first glance, we're thinking, this is crazy. Like, this is insane to think about these demons that are gathering male seed and then are then using it to impregnate women. And it sounds like something from a really bad horror movie. But if we think about understanding secondary causes, then all of a sudden it's not as strange as you might imagine. So you can imagine, for example, that a. You can imagine example that a non physical being, think of it maybe as an image of a woman is on the one hand there to make the male lose his seed and so to, to. To lose his seed so that he doesn't have normal relationships with his wife. And so there are plenty of examples of that today where there are these disembodied female images that are actually there to do specifically that they're there to get men to lose their seeds so that they do not have normal relations with women. On the second hand, you have also this strange thing called fertility clinics where they're are actually people who are gathering seed from men and are using that seed to then impregnate women. And so what the, the, the people are describing in the Malleus Malikorum is something that we have exact examples of that right now. And so the causality is the causality when you talk about it, the causality of a demon to reality. That's. You have to understand that it's not the same kind of causality. It's a spiritual causality. And then there are secondary causes which make it happen. And so the idea, for example, that you know that all these images online are there to make men lose their seed and that, that there would be a Tucson."}
{"episode_id":"SW - #364 - 2024-11-17 - Did the Witches Win - The Hammer of Witches through a Symbolic Lens","start":810.98,"end":812.9,"speaker":"Laura Diaz","text":"The weight is over. Mediweight loss."}
{"episode_id":"SW - #364 - 2024-11-17 - Did the Witches Win - The Hammer of Witches through a Symbolic Lens","start":812.9,"end":815.06,"speaker":"Mediweight Loss Spokesperson","text":"They're officially open on North Oracle Road."}
{"episode_id":"SW - #364 - 2024-11-17 - Did the Witches Win - The Hammer of Witches through a Symbolic Lens","start":815.06,"end":818.3,"speaker":"Laura Diaz","text":"That's right. No more counting down the days. You can walk in right now and."}
{"episode_id":"SW - #364 - 2024-11-17 - Did the Witches Win - The Hammer of Witches through a Symbolic Lens","start":818.3,"end":820.02,"speaker":"Mediweight Loss Spokesperson","text":"Start your journey to a healthier you."}
{"episode_id":"SW - #364 - 2024-11-17 - Did the Witches Win - The Hammer of Witches through a Symbolic Lens","start":820.02,"end":821.94,"speaker":"Laura Diaz","text":"Hey, it's Laura Diaz from iHeartRadio."}
{"episode_id":"SW - #364 - 2024-11-17 - Did the Witches Win - The Hammer of Witches through a Symbolic Lens","start":821.94,"end":854.93,"speaker":"Mediweight Loss Spokesperson","text":"And you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications you can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication but with a customized plan, weekly check ins and a licensed physician guiding me every step of the way. And the cost the same as those risky online options."}
{"episode_id":"SW - #364 - 2024-11-17 - Did the Witches Win - The Hammer of Witches through a Symbolic Lens","start":855.09,"end":858.93,"speaker":"Laura Diaz","text":"Tucson, your moment is here. If you're ready to take control, feel."}
{"episode_id":"SW - #364 - 2024-11-17 - Did the Witches Win - The Hammer of Witches through a Symbolic Lens","start":858.93,"end":860.77,"speaker":"Mediweight Loss Spokesperson","text":"Better and lose weight the right way."}
{"episode_id":"SW - #364 - 2024-11-17 - Did the Witches Win - The Hammer of Witches through a Symbolic Lens","start":860.77,"end":862.61,"speaker":"Laura Diaz","text":"Medi weight loss is ready for you."}
{"episode_id":"SW - #364 - 2024-11-17 - Did the Witches Win - The Hammer of Witches through a Symbolic Lens","start":862.61,"end":865.09,"speaker":"Mediweight Loss Spokesperson","text":"Walk in, get started and see real results."}
{"episode_id":"SW - #364 - 2024-11-17 - Did the Witches Win - The Hammer of Witches through a Symbolic Lens","start":865.25,"end":869.73,"speaker":"Laura Diaz","text":"Call or visit mediweightloss.com to learn more and book your free consultation today."}
{"episode_id":"SW - #364 - 2024-11-17 - Did the Witches Win - The Hammer of Witches through a Symbolic Lens","start":869.73,"end":873.25,"speaker":"Mediweight Loss Spokesperson","text":"That's mediweightloss.com to design the Lexus Es."}
{"episode_id":"SW - #364 - 2024-11-17 - Did the Witches Win - The Hammer of Witches through a Symbolic Lens","start":873.33,"end":881.57,"speaker":"Announcer","text":"All we had to do was listen. Your ears said exactly where to put the speakers. Your eyes told us where to put the available head up display."}
{"episode_id":"SW - #364 - 2024-11-17 - Did the Witches Win - The Hammer of Witches through a Symbolic Lens","start":881.57,"end":883.73,"speaker":"Laura Diaz","text":"Hey Lexus, find me an alternate route."}
{"episode_id":"SW - #364 - 2024-11-17 - Did the Witches Win - The Hammer of Witches through a Symbolic Lens","start":884.51,"end":899.83,"speaker":"Announcer","text":"Right foot helped out it let us know you'd enjoy a little more torque. Turns out you had a lot to tell us. We certainly heard you. The Lexus Es not just for you by you experience amazing at your Lexus."}
{"episode_id":"SW - #364 - 2024-11-17 - Did the Witches Win - The Hammer of Witches through a Symbolic Lens","start":899.83,"end":1356.7,"speaker":"Jonathan Pageau","text":"Dealer demon behind that you know, doesn't mean that there aren't also actual women who are involved in this process. But the person who is looking at these images and having this interaction is not interacting and with that person is not interacting with an actual human person but is interacting with a projection with a, with a kind of spiritual, you know, an imagine an imaginary thing, an image disembodied image which appears before them and, and it is causing and that man has a relationship with that image rather than having it with his wife. And you can see of course it's, it can also be the same for, for women in that sense where you know, the imagination or the imaginary man can also cause her to not have normal relations with her husband. And so those are would be the secondary causes. Of course the very idea of seed being gathered and brought to other women and so that a man will end up raising a child that is in his has all kinds of secondary causes. It's not only of course there's a fertility clinic. There's also just the very let's say culture of promiscuity also the culture of women having children outside of marriage and then marrying someone who will raise their child for them, you know, even though it's not, they're not the actual father of the child. And so all of these cultural manifestations, you know, they are the secondary causes for these demons acting in the world. And so when you read now this story of these demons who are having relations with humans, all of a sudden it doesn't sound as crazy because we don't have to imagine a physical relationship between the demons and the humans, because that's not possible. There is no physical relationship between. Just like there's no physical relationship between an idea and a thing. The type of causality is a different type of causality, causality of principality. It's, it's the same also with this idea of these succubi and nikubi demons. And it's actually looking at the modern world today that we can understand these stories even better than maybe we could a hundred years ago. Because now we, we, let's say secularism and the kind of anti Christian world has played out long enough that these secondary causes are starting to appear extremely, in an extremely strong manner. The other strange thing is of course, this idea of the desire to remove the male member. Now, of course we can see this in metaphorical terms. A lot of the interpretations of movies that I've done where I've showed this whole replacement narrative is of course this in a very, let's say, not as grounded, but it is the desire to emasculate men. And we see it in all the advertisements, we see it everywhere right now, where the, the image of the woman who humiliates or beats down or does whatever is truly a form of emasculation. But there is even a more direct version of this. Now. We've seen several stories just last year of women who have sons and whose sons are very young, who think they are transgender. And the woman is getting ready to give the child hormones to block their male development. And ultimately that could also lead to an actual removing of the male member. Like no joke. Exactly what the people in the Malleus talked about. The complete emasculation of the male. And we saw in these recent stories that when the boy was removed from his mother, then all of a sudden the boy, you know, his whole problem started to go away and he just started to identify as a boy again. Now, you know, there is also, it's not necessarily always one woman who's doing that, but there's a general pervasive narrative in culture right now which is actually encouraging this form of emasculation in all kinds of ways. Some which are more abstract and some which are quite, quite direct. You know, the very idea that we, that we think that we have accepted that men get clipped, you know, at a certain age. Because you know, you children are a burden and a pain and you don't want them. So you get clipped, you actually get castrated is also part of this. It's also exactly this whole narrative of the emasculation of the male is happening self caused, self, self done to itself. And so in a medieval mindset or a late, you know, early modern mindset, you would say of a man who goes and gets clipped that he is bewitched, that he is, that he is, that he's bewitched, that he has a demon or something like that. And, and at least he is affected by demons. Now of course, the third example is everybody probably understood what it's referring to in terms of the abortion and in terms of killing babies. This right now, especially in North America, has become so extreme. We've seen laws trying to be passed where children can be aborted all the way up to birth. And you know, we get even in the theoretical sphere, these discussions of post birth abortions that we've heard a few years ago, you know, people talking about how, you know, unwanted child, this whole story that we heard about, you know, will make him feel comfortable and then we'll decide what to do with them. Then you really get this idea of actual post abortion, post birth abortions, which is just infanticide really. And so this idea that infanticide would also come to the fore and would become an important part of our culture is also a sign that in the end the story of witches that we saw in appear especially in the 16th century as the world was starting to, as some of the already, some of the anti church, anti Christian rhetoric was beginning to take form, you know, you know, it hadn't yet really percolated but as it was slowly beginning to take forward as we were looking towards the enlightenment and this getting stronger and stronger, that we would finally see that, you know, although there are some really crazy things in that book on witches, nonetheless, the actual narrative of what it is that these, these anti Christian people want, what it is that they want and how it's going to play out seems to have played out. And so it seems for at least for this short term, it seems that, yeah, seems that the witches won. And so hopefully, hopefully this is not a permanent situation and that we will see, we will see some changes in culture or some flips in culture that will, will bring the pendulum back. And so I want to thank everybody for your attention. As usual. You can get involved in the comments below. Don't forget the Facebook group as well, where a lot of this discussion is happening and I will see everybody very soon. If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase, so go to thesymbolicworld.com and thank you for your support."}
{"episode_id":"SW - #364 - 2024-11-17 - Did the Witches Win - The Hammer of Witches through a Symbolic Lens","start":1357.5,"end":1359.98,"speaker":"Laura Diaz","text":"Tucson the Weight is Over Mediweight Loss."}
{"episode_id":"SW - #364 - 2024-11-17 - Did the Witches Win - The Hammer of Witches through a Symbolic Lens","start":1359.98,"end":1362.18,"speaker":"Mediweight Loss Spokesperson","text":"They'Re officially open on North Oracle Road."}
{"episode_id":"SW - #364 - 2024-11-17 - Did the Witches Win - The Hammer of Witches through a Symbolic Lens","start":1362.18,"end":1365.38,"speaker":"Laura Diaz","text":"That's right, no more counting down the days. You can walk in right now and."}
{"episode_id":"SW - #364 - 2024-11-17 - Did the Witches Win - The Hammer of Witches through a Symbolic Lens","start":1365.38,"end":1367.1,"speaker":"Mediweight Loss Spokesperson","text":"Start your journey to a healthier you."}
{"episode_id":"SW - #364 - 2024-11-17 - Did the Witches Win - The Hammer of Witches through a Symbolic Lens","start":1367.1,"end":1369.22,"speaker":"Laura Diaz","text":"Hey, it's Laura Diaz from iheartradio and."}
{"episode_id":"SW - #364 - 2024-11-17 - Did the Witches Win - The Hammer of Witches through a Symbolic Lens","start":1369.22,"end":1402.08,"speaker":"Mediweight Loss Spokesperson","text":"You can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At Medi Weight Loss, I got the same medication but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options."}
{"episode_id":"SW - #364 - 2024-11-17 - Did the Witches Win - The Hammer of Witches through a Symbolic Lens","start":1402.43,"end":1406.03,"speaker":"Laura Diaz","text":"Tucson, your moment is here. If you're ready to take control, feel."}
{"episode_id":"SW - #364 - 2024-11-17 - Did the Witches Win - The Hammer of Witches through a Symbolic Lens","start":1406.03,"end":1407.83,"speaker":"Mediweight Loss Spokesperson","text":"Better and lose weight the right way."}
{"episode_id":"SW - #364 - 2024-11-17 - Did the Witches Win - The Hammer of Witches through a Symbolic Lens","start":1407.83,"end":1409.67,"speaker":"Laura Diaz","text":"Mediweightloss is ready for you."}
{"episode_id":"SW - #364 - 2024-11-17 - Did the Witches Win - The Hammer of Witches through a Symbolic Lens","start":1409.67,"end":1412.11,"speaker":"Mediweight Loss Spokesperson","text":"Walk in, get started and see real results."}
{"episode_id":"SW - #364 - 2024-11-17 - Did the Witches Win - The Hammer of Witches through a Symbolic Lens","start":1412.35,"end":1416.83,"speaker":"Laura Diaz","text":"Call or visit mediweightloss.com to learn more and book your free consultation today."}
{"episode_id":"SW - #364 - 2024-11-17 - Did the Witches Win - The Hammer of Witches through a Symbolic Lens","start":1416.83,"end":1485.77,"speaker":"Headshop.com Spokesperson","text":"That's mediweightloss.com looking for your next Go to Smoke Shop. Stop scrolling. I've got you. Headshop.com is the number one online smoke shop already trusted by over 100,000 happy smoke smokers just like you. They've got it all. Dab rigs, vaporizers, glass bongs, smoking pipes, even thca flour. All in one place. Need a new daily driver? Grab a smooth glass bong or a classic smoking pipe. More of a concentrate fan. Their dab rigs, E rigs and wax accessories are designed for smoother, harder hitting sessions. And yes, they've even got legal THC flower. Best part? Every order ships fast and discreet, which is why thousands of smokers keep coming back. So don't waste time hopping between shops. Shop the best in dab rigs, vaporizers, glass bongs, smoking pipes and THCA flower. Right now@headshop.com, the number one online smoke shop, headshop.com has what you need. Check it out today. Oh, and because you're listening right now, you get 10% off your next order when you use the coupon code HSHOP at checkout. Go to headshop.com now and smoke smarter."}
