{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":0.4,"end":13.36,"speaker":"Fr Joseph Lucas","text":"Because repentance is about admitting that we are against God and turning back towards him and re establishing relationship. Because we're in the wrong, we take on the blame. And the more we take on the blame, you know, we allow God to be God."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":25.2,"end":28.88,"speaker":"Jonathan Pageau","text":"This is Jonathan Pedro. Welcome to the symbolic world."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":32.06,"end":32.3,"speaker":"Fr Joseph Lucas","text":"Foreign."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":38.54,"end":92.75,"speaker":"Jonathan Pageau","text":"So hello everyone. I have the great joy to be here with Father Joseph Lucas. Father Joseph is the priest and pastor at Christ the Savior Cathedral, the Oca Cathedral in Florida. He's also become a good friend and he is the editor of the Rule of Faith journal that you can look up on Amazon. It is an orthodox journal of theology. But here I have him here with me today because we had amazing discussions when I was there. He has published his own thesis on the question of sacrifice in Saint Cyril of Alexandria. I am lucky to have a copy of it here. And I thought that it would be a really wonderful to explore that with him now and look at how the church fathers, obviously, especially St. Cyril, sees the question of sacrifice in the Old Testament, in the New Testament, how Christ transformed the question of sacrifice. And, and just in general the insight that he provides. And so Father Joseph, thanks for coming with us."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":92.91,"end":94.51,"speaker":"Fr Joseph Lucas","text":"Thank you and for inviting me."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":94.83,"end":109.55,"speaker":"Jonathan Pageau","text":"And so when we talk, you said you had watched, I think, even one of my videos and you thought there was some interesting connections to make with the manner in which St. Cyril presents the question of sacrifice. So maybe you can start us there and tell us what it is that you think, what insight do you think that he provides?"}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":110.51,"end":152.58,"speaker":"Fr Joseph Lucas","text":"Well, I think for one thing, it's. It's great because St. Cyril really had a. He focused his career, I would say he focused his career on trying to understand the Old Testament and how the New Testament is the fulfillment of the Old Testament. And because sacrifice is such an important part of the, of the law, he had to deal with it a lot. And it comes up frequently throughout his writing. So he gives, you know, a very deep interpretation of it. But, but it's also important, I think, to understand it as part of his overall biblical interpretation. Like what he's trying to do with the law, how he's trying to bring the law into, you know, into the church in a way that, that can be understood properly. And, and so sacrifice, I think, is at the root of that."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":152.9,"end":155.3,"speaker":"Jonathan Pageau","text":"And so what does he think sacrifice is for?"}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":156.82,"end":230.65,"speaker":"Fr Joseph Lucas","text":"Well, I think the very first, the very first reference, if you go sort of chronologically through the Bible, the first sacrifice is Cain and Abel. And he mentions it two places. So he has his commentary on the Pantate So he mentions, you know, he goes into it there. And then he also brings it up again in his commentary on John, which is much later in his career. And between the two of them, we come away with a few, a few ideas. And the first one I think that's, that's really important is the idea that sacrifice is innate in human nature because there's no commandment. God doesn't tell Cain and Abel, go sacrifice. He never says, you know, here's how you do it. They just spontaneously do it. There's lots of ways that you could come at that. You could say, well, there's other things not written in, you know, in the text. That would be one way of looking at it. But since Cyril approaches it that, that there's this natural desire for humans to want to offer to God something, to be, to sacrifice to God, he doesn't flesh that out until a little bit later what that ultimate sacrifice should be. But in that context, he said it's just something natural. And so because one of them was a shepherd and one was a farmer, they just took from what, what gifts they had and naturally wanted to give something to God."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":230.89,"end":231.41,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":231.41,"end":276.45,"speaker":"Fr Joseph Lucas","text":"And when I, when I first read that, it struck me because, you know, that kind of ties in with, say, like an anthropological or perennial idea of the, of the fact that sacrifices is in every single culture throughout the world. Right. That innate desire is there. People want to do something for whatever it is, the numinous, the supernatural. You know, there's, there's whatever they perceive God to be. They want to make offerings. And, and so the very first offering that's recorded then in the scripture of Cain and Abel is about that innate desire and then how God responds to that desire, the right way to do it and the wrong way to do it. So, so Abel's the right way to do it, Cain's the wrong way to do it. So that's kind of where it starts out."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":276.96,"end":293.92,"speaker":"Jonathan Pageau","text":"And so for sure, at the outset, it's important to notice that since Cyril doesn't see the sacrifice of Cain and Abel as in any way a propitiatory sacrifice, he doesn't see it as something that is like kind of sacrifice for our sins the way that a lot of people think sacrifice is only for."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":294.88,"end":362.29,"speaker":"Fr Joseph Lucas","text":"Right. I think. Well, a good point would be to define what we mean by propitiation. So if we mean propitiation in the sense of just it's pleasing to God, that could be an acceptable definition. Father Stephen Young and I just, he was here last week and we had a long Talk about that. And the fact that it can be used in that way. Right. But the problem is, is that it came to mean in the west, assuaging or removing anger that God has. Right. So it's like. So that's kind of a pagan definition. And definitely you won't find that pagan definition in St. Cyril. And later on when he starts talking about the law, that's when we get into how he defines it. And probably the word I use a lot is expiation in English because it has the. It clearly connects to what. What Saint Cyril is trying to do, but definitely not. With the King and Abel sacrifice. There's no sense of. Of God being upset with them and they need to. To. To, you know, somehow turn God's face back towards them or something like that, you know, them to be in communion with God. It's just a. It's. Saint Cyril sees it as a natural desire to want to offer to God, to be in relationship with God in some way. Yeah."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":362.29,"end":381.81,"speaker":"Jonathan Pageau","text":"So it's a. It's kind of. Yeah, it is. It's almost. It's like to give back to God or to offer back with that which has been received. And so, I mean, this is a. I know, maybe he doesn't. But what does he see as Cain's misoffering? Because in the text, it's very vague. It just says, basically, God doesn't accept it. Does he. Does he talk about that?"}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":382.53,"end":400.9,"speaker":"Fr Joseph Lucas","text":"Well, the Septuagint gives us a little clue and he. He hones in on the Septuagint because the Septuagint says, you did not rightly divide it. Okay. So. So he picks up on that, you know. So what does it mean to not rightly divide it? Well, it means he. He offered the leftovers, basically, is how, you know, to paraphrase him, like, what. So you have."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":400.9,"end":402.86,"speaker":"Jonathan Pageau","text":"He didn't offer the best part, Exactly."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":402.86,"end":406.3,"speaker":"Fr Joseph Lucas","text":"Right. He didn't take the very best and offered to God. He took what he already didn't want."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":406.86,"end":425.01,"speaker":"Jonathan Pageau","text":"Interesting. That would. That would also connect it in some ways to the. The. The classic story of the. The sacrifice of Prometheus. Like in the Greek myth, where Prometheus is supposed to, like, the people are supposed to offer the meat, but then he offers the bones and just hides it with the skin so that, you know, they trick the gods, basically."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":425.73,"end":426.09,"speaker":"Fr Joseph Lucas","text":"Yeah."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":426.09,"end":426.45,"speaker":"Jonathan Pageau","text":"So that."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":426.45,"end":446.06,"speaker":"Fr Joseph Lucas","text":"So, so it's about disposition from the beginning. And that's kind of. That's another theme that runs throughout St. Cyril's commentary in the Old Testament. This idea about the right disposition when you offer, what does it mean? So there's an inter, there's an internalization. You know, it's, it's what's coming out of the heart that's being exhibited through the external action, you know, through the sacrifice itself."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":446.38,"end":477.21,"speaker":"Jonathan Pageau","text":"Now, but I didn't know that about that. In the Septuagint, there's a hint about why it is that he, the sacrifice. And that's interesting because, I mean, that's, that's a, that's one of the most, I mean, Septuagint is one of the most ancient testimonies of biblical interpretation we have in the, in the translation. It's like, this is how we translate it. It means that this is how we see it. So that's a, that's fascinating. And so then, so then after that, I guess Cyril kind of moves into the story of sacrifice. And so how does he come from this, this early sacrifices up to Christ? Like, how does he see that relationship?"}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":478.33,"end":678.78,"speaker":"Fr Joseph Lucas","text":"Well, it's the way he, he approaches the law in particular, is that everything in the law. So this is, this is part of, I think we have to look at how he, how he interprets the Scripture, what his exegesis method is. And the first. Well, I would say, you know, the experts disagree on this, but I, I take this side, is that his earliest work is called On Worship in Spirit and Truth. That's the, you know, the phrase from St. John's gospel. And there's a debate whether that was first or whether he wrote his commentary on the Pentateuch first, but it seems that that would make more sense. He wrote On Worship and Spirit and Truth first because he lays out how he's going to interpret the Scriptures. And it seems that he followed like, throughout his career. He started with, then he went on to the Pentateuch, and he kind of moved in chronological order through the Scriptures and got to the Gospels and Epistles later in his career. And why that's important is because he starts out his book on worshiping spirit and truth with how do we interpret the law? And how does it relate to the New Testament? And he has this, he has this probably imaginary interlocutor that he's talking with. And, and, and this, this guy is, is walking along with a copy of the Gospels. And, you know, it's this perfect setup. You know, he says, oh, you know, Cyril, how do we reconcile these two things? And he quotes first Matthew when it says, when Christ says that not, you know, that he didn't come to abolish the law, but to fulfill It. How do we reconcile that with where he says in the Gospel of John that we're going to worship in spirit and truth? It seems that he's doing away with the law. And then St. Cyril says the answer is in St. Paul. It's the transition from the letter to the Spirit. And then he kind of the rest of that text, he's kind of unpacking what that looks like and applying it in a kind of a. Almost looking at like the meta narrative of Scripture, like, or what, what Saint Athanasius called the scope of Scripture, which, like, you know, the, the, the sort of arc of story from Genesis all the way to Revelation. And, and he goes through, and he shows how the two things relate to. And he has some, some pretty strong things to say about, about the law. Like, he, he picks up on what St. Paul says when the law is a type and a shadow. And so he says the law is a type and a shadow and the formation of a piety that is still in travail and has the beauty of truth hidden within itself. And he says that the law was imperfect only because they weren't ready to interpret it through Christ. There's this transition that happens where, where the law had its purpose, but it could never be. It could never do what it was meant to do. He says that very clearly. It's never able to do what it was meant to do until the fulfillment of the law came. Christ. And then through the lens of Christ, we understand it in a, in a, in a penagic or elevated way. And so that's kind of his starting point. So then he applies that to sacrifice. All the sacrifices are in some way pointing to some aspect of what Christ was coming to do. And so that's, that's kind of the way he looks at it all the way through is he takes these very sacrifices and he reinterprets them and says this is how it pertains to Christ or this is how it pertains to the church. You know, sort of this type and antitype, you know, relationship throughout all the sacrifices."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":680.54,"end":699.44,"speaker":"Jonathan Pageau","text":"So can you give us some examples of what. Like, let's say, let's take one. Let's say the Yom Kippur sacrificing. Does he, does he talk? Does he. Oh, yeah, deal with that, because that. I would love to hear what he, how he says about the two, like the goat and the, the sacrifice. The goat is given to Azazel. Like, how does he reconcile that with Christ?"}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":699.6,"end":790.85,"speaker":"Fr Joseph Lucas","text":"Yeah, so, so, so Azazel, for him is, is the devil that's interesting because. But. But it's interesting that he says it's not offered to the devil, son. Offered to the devil. You know, essentially he says that. That that would be a myth. He said to say that it was offered as a zel. As the devil would be a myth. But the idea is that. Is that. So he. He starts out with saying that. That the. The symbolism of the two goats, they have to be absolutely identical. And the reason is because they're just two aspects of the same offering. Just two. Two different aspects of the same offering. The first one represents the. The blood of the goat taken into the temple and represents purification or expiation. So it shows the fact that Christ would come to die, and through him we are. We are purified of sin. Okay, so that's the first. The meaning of the first half. The second half, he does talk about Christ carrying sin away. Right. Connects it to the ascension. The idea is that Christ going off into the desert land where Azazel is, where the devil is, it's him going, sharing Hades and then ascending up, rising up, and then ascending up into the heavens. And then he calls it the untrodden land. Beyond is paradise. Right. He goes up to be enthroned in the heavens. And so he. He sees it in a very different way. So basically, the two goes represent the crucifixion, resurrection and ascension. You know, that's kind of what together they mean they're all part of the same offering, but different aspects of the same."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":791.41,"end":797.06,"speaker":"Jonathan Pageau","text":"So he sees the goat that's cast into the wilderness as resurrection and ascension."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":797.3,"end":797.78,"speaker":"Fr Joseph Lucas","text":"Yes."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":798.26,"end":798.82,"speaker":"Jonathan Pageau","text":"Huh."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":798.98,"end":806.18,"speaker":"Fr Joseph Lucas","text":"Yeah. Now he doesn't. He. He says that he does tie in at one point and say that. That definitely he carries away our sins."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":806.58,"end":822.5,"speaker":"Jonathan Pageau","text":"Yeah. So I can imagine, like the herring of Hades. That makes a lot of sense to think of that. In the sense that he takes his sins and. And. And he kind of goes into. It, goes into the world of death, you could say. But it's interesting to think of it as a. As ascension. And, and yeah, that."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":822.5,"end":882.64,"speaker":"Fr Joseph Lucas","text":"That one's kind of surprising. It's a surprising interpretation. Let me see if I find a quote right here. It's a good one. So he says that. He says he likens the himself to the scapegoat in order to be sacrificed for sin. So in some sense he connects himself to sin. But then he says, for he arose and departed to the untrodden land, meaning into the heavens in some way carrying our sins to the city on high to present himself before the Father on our Behalf. So it's a, it's a, it's a weird connection of all of us taking the sins on, carrying them away, but then ascending up and, and, and then he'll connect a little bit later to the idea of him being the, the high priest mediator. So he carries them up to offer them up before the Father as, as our mediator to be purged of these sins in the heaven. So it's, it's, in a sense, still like a connected expiation. Yeah, but it's, it's unusual how he connects it to the resurrection and the Ascension up. But he uses that same theme a couple of different ways with Yom Kippur."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":882.64,"end":899.36,"speaker":"Jonathan Pageau","text":"So he says the untrodden land. So he's, he's connecting in some ways the, the, the, the paradise with the strange land or a land that we don't know. Like, as if the paradise in some ways is a. Using the image of wilderness for paradise. Like that. To me, that's weird. Like, that's a surprise, I have to say."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":901.61,"end":925.13,"speaker":"Fr Joseph Lucas","text":"Yeah, it's, it's, it's, it's unusual. It's, it's not what I expected because, you know, when you, when you first do a cursory reading of, like, the Fathers, when you're trying to try to come up with a hypothesis, you know, for a thesis to examine the text, that's not what I would have come up with initially. And then when I went, you know, of course you read the text to let the text teach you. And then you get to these things, you're like, okay, he's. He's coming at this from a very different perspective than I thought."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":925.13,"end":943.48,"speaker":"Jonathan Pageau","text":"Yeah, but it's interesting. I mean, it's, it's interesting, definitely. And so, and so what? Let's say, can you think of a. So does he still have this idea also of the offering to God? Like that the crucifixion is an offering in the sense of the Cain and Abel sacrifice. Does he, does he talk about that a little bit?"}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":944.12,"end":1018.69,"speaker":"Fr Joseph Lucas","text":"So he's, he's fine with saying that the offering was made towards the Father. All right, so this is before. Because it's not until the, about the 10th century that they work out this whole idea that, that, that the. The Son is also the re. Receiver. But he does mention elsewhere that the Son as God also receives the offering. So he kind of presages that a bit by about five centuries, which gets worked out later on in a local council in Constantinople where they say that the Son is also the receiver, along with The Father and Spirit. So he does say that. So on one hand, yes, it's the Son in his human nature. So this is something that would be controversial to maybe some people who think that Cyril is kind of like an actual Monophysite in some way, has a definite idea of the distinction of the two natures. And so Christ's mediation is really in his human nature. Right. Or through his human nature. So, so through his human nature, he's offering himself up to the Father. But as you know, as God himself with the Father, he's also receiving that offering. So he does mention that as well. So there's this kind of connection there. But, but one of the things he's very clear about is that there's no point in which the, in which the Father somehow is disconnected from him in this offering."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":1020.53,"end":1045.14,"speaker":"Jonathan Pageau","text":"Yeah, that's important like that, that, on that. Because this is something we've seen recently, this idea that when Christ says, you know, why have you abandoned me? That God did abandon him. This is something that I think Martin Luther ends up saying explicitly that, that, that God abandoned Christ in that moment on the cross. But since Cyril does not go in that direction."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":1045.94,"end":1069.3,"speaker":"Fr Joseph Lucas","text":"No, in fact, I, we don't have any idea who he's responding to. At least, I haven't, I, I don't know and I haven't found any other researchers who, who have looked at this. But he's responding to somebody when he says that, you know, there's some, there's some who would say that the Father looked away from the cross when the Son offered himself. And he goes at links to say, why this is a ridiculous idea."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":1069.67,"end":1070.03,"speaker":"Jonathan Pageau","text":"Mm."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":1070.03,"end":1144.06,"speaker":"Fr Joseph Lucas","text":"As he said. First of all, you know, first of all, there's, there's two reasons. One is that he is with one nature, with the Father, and that's, that's obviously, you know, on a theological level, but then he says, just on a very practical level, he said, why would the Father look away from that which he desired? You know, this, this offering was the will of the Father and the Son. And that which is most honorable. Why would he look away from something so honorable as the self offering of His Son? So there's this idea that, you know, there's nothing, there's nothing tainted in the, in the, in the offering of Christ. This is his, this is what was meant to be. And, and the Father would never, would never distance himself from that offering. He's a part of it, in the fact, in two ways. The fact that he's at one with the Son in nature and also that and that he and the Son both desire this. They have a common will, that they desired this thing to happen. And there's no sense of. Even in his human nature, because that's the one thing Cyril does, even though he. He definitely makes clear that there are these. You know, there are two natures, a human and defined nature. It's always the incarnate Son acting. I think that's one of the important principles of his theology is this. It's. It's the One incarnate Lord acting, you know, and so therefore you cannot. Even though it's through his human nature that he is the high priest."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":1144.06,"end":1144.94,"speaker":"Jonathan Pageau","text":"Can't divide it."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":1145.1,"end":1147.18,"speaker":"Fr Joseph Lucas","text":"Yeah. He's not. Yeah. You can't divide it anyway."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":1147.41,"end":1149.13,"speaker":"Jonathan Pageau","text":"And so how does he. I mean, maybe you."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":1149.13,"end":1149.33,"speaker":"Fr Joseph Lucas","text":"You."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":1149.33,"end":1155.33,"speaker":"Jonathan Pageau","text":"You don't have an answer, but how does he interpret that phrase, you know, when Christ cries out to his Father."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":1156.93,"end":1184.94,"speaker":"Fr Joseph Lucas","text":"So he. He has essentially laid out throughout. This is more so. Not so much in his exegesis, more so in his. His theological writings, but especially in response to Nestorius, he makes clear that all the things that Christ. Christ went through, he did it not because he needed for his own, for his own sake, but in order to transform it for our sake. So, for example, the, The Garden of Gethsemane is very important for him."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":1184.94,"end":1185.38,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":1185.38,"end":1214.37,"speaker":"Fr Joseph Lucas","text":"Garden of Gethsemane is a point where one of the blameless passions, one of the things that human beings all suffer through, you know, even if they're. If, even if they were perfected, would be the fear of death. Because it's natural for us to really die. We want to live. We have a sense of eternity and the fear of death is real and that humans have to face this. And so in the Guardian Get Simi, he takes on the. The human fear of death in its fullness in order to transform it for us. He says and does the same because."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":1214.37,"end":1220.89,"speaker":"Jonathan Pageau","text":"He accepts, finally, that's always what people have to understand is that although he goes through that anguish, then ultimately he accepts."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":1221.21,"end":1221.53,"speaker":"Fr Joseph Lucas","text":"He."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":1221.53,"end":1224.41,"speaker":"Jonathan Pageau","text":"He says yes to the. To. To what is going to happen."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":1224.89,"end":1239.43,"speaker":"Fr Joseph Lucas","text":"Right. Yeah. He always, Saint Cyril always emphasizes the idea that it's a voluntary offering. It has to be voluntary. It has to be Christ doing this fully, taking it on active in every single part of it in order to transform it for human nature going forward."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":1239.59,"end":1289.67,"speaker":"Jonathan Pageau","text":"Yeah, yeah. In the Garden of Gethsemane, there's so many mysteries about that, because one of the things that I think is going on in the Garden of Gethsemane is that we're actually facing. We're actually seeing Christ in the garden about to eat the fruit of the knowledge of good and evil. But he doesn't want it. Right? That's the difference between him and Adam. He actually knows that if you eat of that fruit, you will die. And he says, no, if I can be spared the fruit, if I can be spared this cup, then. But if that is your will, then I'll do it. And so it's like God gives him the fruit and now he takes it and dies. But then that is the image of his being God. You could say that it's his deification. He's already God, but it's his moment where he does in fact manifest fully that he, he is like God by eating the fruit."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":1289.83,"end":1352.56,"speaker":"Fr Joseph Lucas","text":"Right. Well, it's, it's, it's a, it's a, it's a, you know, the, the self emptying keeps happening throughout his entire earthly life. You know, it's not just, it's not just that he, he poured himself out in the conception in the Theotokos womb. It's not, that's not the only moment in which he, he becomes humble and enters into the, you know, the status of a, of a slave. There's an ongoing, you know, self emptying throughout his life all the way up to the cross. Gethsemane's part of that progress. And then on the cross, when he's saying, you know, my Lord, my Lord, why? Why have you forsaken me? He's taking on the, the, he's taking on that, the, the, the human sense of separation, of dejection, of, you know, and this is again part of him accepting all the blameless passions. And, you know, because those are things we don't have control over, right? We just like hunger and thirst and all those other things he's taken on. He has to ultimately take on the fear of death, the fear of separation from God. And then death itself is the final foe he has to take on, you know, in his, that he overturns through the resurrection."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":1352.8,"end":1389.33,"speaker":"Jonathan Pageau","text":"And, and, you know, I know, I know. Father Steven Young, in part, and others have pointed out that in that moment where he calls out and, and, and asks God, ask his Father why he abandoned him. There's also a prophecy happening while he's saying that because he's quoting from a psalm in which at the end of the psalm, God raises up, you know, David out of the pit. And so it's like he's actually, so he's saying, like you said, he's purifying it. He's like he's like, I'm gonna, I'm going through this, truly. But there's a secret prophecy hidden in what he's doing, which is that God will raise him up in the, in the, in the end. It's very powerful."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":1389.77,"end":1492.55,"speaker":"Fr Joseph Lucas","text":"And it's always. Cyril uses the, the phrase, you know, for our sakes all the time, right? So his idea is, I like to think of it, this is if you remember back in the maybe late 80s and 90s, I don't know if you had this in Canada, but we had the Oxiclean commercials when they first came out. And you had the tank of Oxiclean, you know, the white powder thrown in the water, and they stir it up and. And they have this immensely dirty cloth or something, and they, they dip it into the Oxiclean and they make a point of saying, instead of the Oxiclean looking dirty, the cloth comes out white, you know. And so this is, this is my analogy to try to. Try to put a. Put forward exactly what St. Cyril is explaining, right? So, so he's like this Oxiclean, right? So sin and, and, and these things are trying to, you know, to attack him. And in his human nature, he. Instead of him being affected anyway by the sin, he doesn't. That's why St. Cyril points out, you know, that Paul says that he's without sin. He's like us in all ways, but he's. He's without sin. Is that when sin tries to. Tries to attack him or any of the blameless passions try to affect him instead of him being affected, there's an immediate reversal for the sake of human nature at large, right? So he reverses it or repels it, in a sense. And because he's of one nature with us, according to his humanity, we share in the benefits of that in a potential, right? We potentially share in the benefits of that. When we by faith are united to Christ, we. We are given that power to repel the sin, to not be affected by it. So it's part of his. It's part of his overall idea of how we're saved, how we're transformed. It's all rooted in how he, you know, how he responds to these things."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":1494.43,"end":1531.06,"speaker":"Jonathan Pageau","text":"And so what it's interesting, which kind of comes to mind in terms of what the way that he presents sacrifice is that it seems like if the sacrifice of Cain and Abel at the outset is natural in the sense that it's something that is in us to want to give up to God, then it wouldn't. If that's how he sees the origin of sacrifice, then it makes sense that he would move towards the idea of self sacrifice. Right. Where ultimately you realize that the ultimate sacrifice is the giving of oneself. And so maybe you can talk a little bit about his ideas on that and how Christ brings us into that difference."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":1532.02,"end":1573.45,"speaker":"Fr Joseph Lucas","text":"So the first thing is that the law was a way to channel the innate desire. That's the first thing, right. So people have this innate desire like Cain and Abel. And so all of human kind was in some way making offerings and, and reaching out to what they understood God to be. But in the revelation that God gives the beginning with Moses and forward, he's basically channeling that. He's basically giving order to it, arranging it, but he's doing it. The one of the things that St. Cyril is very clear about is that none of it was necessary. Right. There was no God's. God is without necessity. He doesn't need any, he doesn't need meat offerings, he doesn't need anything. Right? There's."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":1574.44,"end":1579,"speaker":"Jonathan Pageau","text":"Which is said, which is said in like it says that in scripture. And that's really important to remember that."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":1579.4,"end":1594.12,"speaker":"Fr Joseph Lucas","text":"Right, exactly. I mean, so especially in the prophets, you know, it's all through like Isaiah and Ezekiel and things like that. And he, and he does. One of the things I focused on in my, in my thesis was also on the, the, the prophets. You know how he sees that in the prophets. So, so none of these."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":1594.2,"end":1629.23,"speaker":"Jonathan Pageau","text":"Let me just say one last thing is that's really important because, because if we believe that, then we understand that the idea of the trade, something sacrifice, like the, of the simple trait of like, you know, or, or also the idea that God needs sacrifice in order. In order to forgive our sins or some kind of weird idea that this is necessary in, from the point of view of God for this to happen in order. Like as if there's this like weird rule that, you know, well, now you've sinned, so now you're impure. So you got to kill these things so that God will. God will, that you can have access to God again. Like that is not nowhere, right."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":1629.39,"end":1725.95,"speaker":"Fr Joseph Lucas","text":"This type of thinking, there's no quid pro quo. Yeah. In the offerings. Yeah. There's the sense that God doesn't need it. And so he does two things. So for one thing, he makes it clear that he's going to organize and sort of channel this desire entirely to prepare people for his coming. And the only necessary offering of himself. He's the necessary offering to accomplish what he desires to do, which is to save humanity, to overcome death for Us and things like that. So that's, that, that is what he would say would be a necessary offering in the way that, that God wants to, to help mankind. So he basically establishes or channels this, this Old Testament offering system in order to point everything towards Christ. So everything is pedagogical. He takes up that, that idea from St. Paul that the laws is a, is a tutor or pedagogue. And so it's all pedagogical or, or symbolic to point towards the one true offering of Christ. And then he can, then he can go through and, and apply the spirit of the law, which. The spirit of law is the intent. So, so what's the true intent? And he goes, he presses this really, really far because he essentially says that, that the Old Testament law really had, at some points he says it wasn't efficacious in any way. Right. There's nothing it could actually do. There's a couple points where he concedes a little bit and says that so long as the, as long as the Israelites were doing it with the right intention, their faith had some efficacy. Right? There was something they were gaining from being faithful and obedient to God, but that it couldn't actually do anything because."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":1726.35,"end":1732.63,"speaker":"Jonathan Pageau","text":"It wasn't just a, like a mechanical system. Like, obviously that, that's ridiculous to think that. Right, that anyways, Right."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":1732.63,"end":1763.93,"speaker":"Fr Joseph Lucas","text":"Well, that's, that's why, that's why it gets condemned by the prophets. The prophets say, look, you think it's an automatic thing. It's all about your intention, about your acting in faith. You're doing this in obedience and faith and love towards God. When you do it in the right way, then God is somehow blessing you. That's what St. Cyril is basically saying. God is. God will bless you in response because you're doing it out of faith. So he's channeling this desire for sacrifice. If they do it the right way, with the right intent, like, like Abel with the right, with the right heart, then God will respond back with blessings for them. Okay. Yeah."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":1763.93,"end":1842.34,"speaker":"Jonathan Pageau","text":"And let me just say, I just want to say the people, for the people watching and to understand how this is organically true in anything that has to do with any type of relationship that you engage with others, whether it's hierarchical or whether it's, it's, it's across levels, is that you know it. If you, it's not just like, okay, so shake the person's hand, you know, do this and that, and if you do all these things, then you'll be in a right relationship with others. Like, we all know that's nonsense. Like, that's not true. Of course we have to shake the other person's hands. Of course we have to. We have to be polite. We have to do all these things that are kind of like rules, but if they're not done with the right intention of. Of entering into communion with the person, then we know that we could do all the right things. And. And then we would find ourselves in disharmony with others. And so it's. It's as true for a family meal, for how you relate to your children, to your parents, to your. To your spouse, as it is for how we also relate to God. So it doesn't mean that completely remove the. The rituals. The rituals are there to embody the intention, but without the intention, then the rituals ultimately can become. Can become pernicious even. You know, it's like if you shake someone's hand and you, you know, you give them that look like, you know, it's like, I actually hate you, then the handshake is null, you know."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":1842.5,"end":2027.35,"speaker":"Fr Joseph Lucas","text":"Yeah, yeah. Symbol plus intention. I think that's. That's a good way to say what. What Saint Cyril, how he defines it. You know, you have to have the. The meaning is there, but the meaning has to be backed up by the right disposition. And I think what's. But. But here's what he says, though. This is. So it's this idea that. That the antitype Christ is the only one who imbues meaning to anything that happened. Any of the types. The type only. Only exists for the sake of the antitype. And so. So, for example, he says. He says, though the law of old was not sufficient to help those in olden times, the mystery of Christ was outlined in it. But with the coming of Christ, purification by a type then of necessity fell in abeyance, since the reality was now present. And then he goes on to say that, you know, that the real reason that there was any kind of, you know, efficacy in the Old Testament sacrificial system was because already Christ was there in it. And now the Christ has come, it falls away. And it sounds like some of the wording he uses. I don't know if. Have you ever read Leto Sardis? Saint Melito Sardis is. This is a great if. If you have time to get it sometime. I know it's in the same. Vlad's popular patristic series. It's on Pascha. It's the sermon that Saint Melito Sardis gave in the second century, probably like on the eve of Pasco. It's like. It's like a poetic sermon that he gave, and there's sections of it that are quoted later on in our Paschal hypnography. So it actually got picked up in the church. And it's. Many scholars think that he was a Jew who converted to Christianity and became the Bishop of Sardis. And so Saint Melito. I'll read this little section of Saint Melito. It's very similar to what Saint Cyril is writing a couple centuries later. He says this about the Passover and the blood of Christ. He says, tell me, O angel, this is the angel of death. At what were you turned away? At the sacrifice of the sheep or the life of the Lord? At the death of the sheep, or the type of the Lord, at the blood of the sheep or of the Spirit of the Lord? Clearly you were turned away because you saw the mystery of the Lord taking place in the sheep. The life of the Lord and the sacrifice of the sheep, the type of the Lord and the death of the sheep. For this reason, you did not strike Israel, but it was Egypt alone that you made childless. So it's like the angel of death comes and he already sees the mystery of the Lamb of God who comes to take away the sins of the world, and he's turned away by that. Very similar to what. In fact, I'd like to write an article at one point, seeing if there's any connection, if St. Cyril had any access to St. Melito. Because there's a sense in St. Cyril that, you know, that everything, any kind of response, positive response, God had to Israel in the Mosaic system was because he saw that they were fulfilling what would. Would ultimately point to Christ. Right? Christ, the one giving it power in some way. He says otherwise it would become ineffectual if they did not. If it was not connected directly to Christ."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":2028.07,"end":2049.05,"speaker":"Jonathan Pageau","text":"And so then how does St. Cyril, or does he connect this ultimately with the Christian life? That is to. To show that our life is a living sacrifice. Right? There's these. These phrases that we say in. In our. In our liturgical practice that. Or that we see that. That we are meant to give ourselves ultimately, that. That is what all of this is leading to in terms of our own practice."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":2049.61,"end":2145.18,"speaker":"Fr Joseph Lucas","text":"Yeah, that's actually, that's. I would say that's probably what everything is about for him, because he says, you know, so the sacrificial system points to Christ and then Christ accomplishes what he needs to accomplish. And so what is the spirit of the law now? The spirit of the law now is to see how we become Christ in our self offering. So, so basically he sets up this idea that we have to voluntarily die and then he connects that to this idea of picking up our cross each day and following after Christ every day is like a, like a spiritual death or our own self emptying for the sake of God. And, and this kind of sets up an entire way of looking at the world, you know, this, this idea that the Christian is the one who's constantly sacrificing himself. Yeah, it's interesting. I tried to, you know, when I was, when I was completing the dissertation, I spent a couple years just reading all the literature on sacrifice I could possibly find. And so I had to read, I had to read like, you know, you name it, Gustav Allen, all these different ones. I read everyone who talked about different aspects of sacrifice and some of them Christian, some non Christian, anthropological studies. And I came to Rene Girard and, and I was trying to see in what ways like his scapegoat, you know, idea, you know, and there's a sense that I, I saw that there's some, some parallels between his idea of the scapegoat and how he says that Christ ultimately fulfills that he becomes one who takes on everything, you know. But it was a little, it was still a little bit too Protestant for me, you know."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":2145.18,"end":2232.7,"speaker":"Jonathan Pageau","text":"Well, it's not just that. It's. That is that Gerard misses another aspect of sacrifice. And so if you take the Yom Kippur sacrifice, for example, it's like there are two sacrifices, my friend. There's one that is out to the wilderness and there's one that's offered up. And the sacrifice that's offered up is not the same, is not. Christ brings them together in a very, very mind shattering way, but they're not the same. And so, you know, it's like, for example, like the pouring out of libations and all of these types of behaviors that the ancients said cannot be reduced. Scapegoat, sacrifice. And so Gerard is as if Gerard gets half of the story right, but he's missing an entire half of the story. Which makes his theory, in my opinion, insufficient and means that it's difficult for him to reach this conclusion. So his tendency will be to say that Christ has abolished sacrifice and now there's no more sacrifice. Right now there's no more sacred. There's actually no more sacred anymore. Whereas the Christian, the true Christian position is to say Christ has shown how all of this has to become internalized and that we can be. Take the sins of others to some extent even that we can sacrifice ourselves, that we can become the scapegoats in many ways. That that is a healing and that it. And that internalized process now is the way that we live. And it's actually the way that it's actually our morality is based on that implicitly or explicitly is based on that image of what the, what sacrifice is."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":2233.26,"end":2265.85,"speaker":"Fr Joseph Lucas","text":"I think, well, in the 20th century and Saint Silomon, the Athena, he has this idea that, you know, the ultimate goal is for us to all become Adam in a sense and take on the sins of, of the world in a sense. Right. To be like Christ is to be able to become a scapegoat ourselves, to become, you know, the Passover offering ourselves to the entire. All the symbolism of the, of the Old Testament sacrificial system capitulated in Christ. We have to imitate that. We have to take that on in some way and live a life of self offering of constant sacrifice."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":2267.37,"end":2304.62,"speaker":"Jonathan Pageau","text":"And it's unbearable. Like it's. I hate every moment of what you just said. Like, I just hate that. I don't want to do that. But I can see in the stories, like if you look at the, some of the stories of the saints, you have very powerful images, especially in the monastic stories of monks who do exactly that, who actually take on blame of things they did not do towards the salvation of others. And in the, in the, and when people see the monk taking the blame for their sins onto themselves, you know, they're transformed in ways that reproach or that just scolding or whatever punishment would never be able to accomplish. It's, it's. Some of these stories are pretty amazing."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":2305.1,"end":2432.82,"speaker":"Fr Joseph Lucas","text":"Well, if I, if I could branch off into just something else for one second, it ties in with. So I've been. My kind of whole project over the last 20 years has been looking at, you know, soteriology, how salvation works through the, the Father's interpretation of the Bible. And before I started working on sacrifice and expiation, I looked at justification. And, and so I have a little, I put out a little book back in 2010 based on my research on that and it was focusing on the Desert Fathers. And so the Desert Fathers were picking up on the Gospel of Luke where in the Gospel of Luke, in the. The parable of the. Of the publican, the Pharisee, the, The publican, basically by, by accepting all blame, he descends down and the. And he's the one who's vindicated or justified by God because he descends down by taking on all blame. And God's the one who vindicates and lifts him, right? He exalts him. And then the Pharisee, he exalts himself and God lowers him, right? He brings him down and, and condemns him. And of course, the words, the word in Greek for to justify or vindicate, its opposite is, which means to condemn. Those two words are used in the parable. So it's the opposite of to vindicate, right? He gets condemned down and, and that gets picked up in Orthodoxy in the, the hymn for one of the. One of the troparia for that Sunday of the public and the Pharisee during Lent, it says for the, you know, for the publican exalted himself or lowered himself, abased himself and he was exalted up. And the, the Pharisee exalted himself and he was, he was abased, you know, he was brought down low. So we had this idea that, that when we take on the blame, when we take on and become that offering, we allow God as judge, Christ as judge, to be the one to lift us up and exalt us. You know, he's the one who takes us up to the, to the heights rather than ourselves, you know, so it's kind of linked to this. That's why you see this, this sort of language throughout, especially like the ascetical writings and epic fathers. The desert fathers."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":2433.22,"end":2522.33,"speaker":"Jonathan Pageau","text":"Yeah. And it. Understanding that way makes so much sense of so many Bible stories, you know, even from the beginning, from Genesis, you know. And so, you know, you. That's how you can understand that what God is asking of Adam, you know, to not raise himself up, you know, to not himself take the fruit, to not, to not pull himself up, that what God wanted for him was to, for that God does like that God was going to raise Adam up. And you see that in the, in the scripture. And sometimes it's tricky for people because it's. People might find it hard to see that in the text because it's like. Well, you know, it's a, It's a bit tricky of St. Ephraim to say that God wanted to give him the fruit. Doesn't say that in the text, you know, but if you take the entire scope of, if you take the entire scope of. Of scripture and you kind of see it together, you realize that it's there all through. Like even the story of Solomon when it's like God asks Solomon what, what he wants, it's like, I will give you. And then he says, I want the knowledge of good and evil. And God Is like, good, that, yes, that's exactly what you should ask for, and I'm going to give it to you. But he doesn't, he's not trying to take it for himself. So this weird moment in Solomon shows us already that this was there in the whole narrative scripture, this idea that what was received from above is different from. Than what is taken for ourselves. It's the opposite in some ways. And it, and we're lifted up when we, when we abase ourselves. It's. It seems contradictory, but once you kind of see the logic, you're like, well, actually, no, that's really how reality works."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":2522.95,"end":2759.22,"speaker":"Fr Joseph Lucas","text":"Yeah, yeah, it's, it's so, it's. It's so prevalent throughout all of the. At least in the. I'm not as familiar with the Western liturgical tradition, but in the Eastern liturgical tradition, I mean, this idea of humbling yourself is, is just ubiquitous. It's everywhere. I mean, it's just, I mean, all, all of Lent focuses on that, right? All the, the hymns and the various themes of the services. It's almost always about how do we humble ourselves before God? Repentance is, of course, part of humbling, which is so important during the fasting seasons, because repentance is about admitting, you know, that. That we are against God and turning back towards him and re. Establishing relationship. Because we're in the wrong, we take on the blame. And the more we take on the blame, you know, we allow God to be God. Because when Christ says that, you know that he says, judge not lest ye be judged. He's not talking about a lack of discernment, right? Because the same word is the same word. To judge or to discern. They're not two different words. We sometimes translate them differently, but they're the same word used in different parts, positively and negatively. In the New Testament, what he's saying is, don't usurp my position. I am the Lord. I sit on the throne of judgment. I hold the keys to life and death. Don't usurp my position. It's not your place to determine, you know, the, the outcome of, of, you know, human affairs or of individual humans. You have to humble yourself and see yourself only in comparison to me. He says, right. And so again, in the Desert Fathers, there's this idea of, you know, when, when it's. When it says, you know, who is man that, you know, he's made a little lower than the angels. And they take that and they say, you know, God placed us down here, you know, in this, in this reality. And you know, this idea of up and down, right, of above and below. We should only be looking up. We should only be. We should. We're down here only looking up at the Lord and comparing ourselves only to Him. And we compare ourselves only to Christ. We can't really exalt ourselves in any way, you know. In fact, this ties into, like in Isaiah 6, when Isaiah, who's probably the holiest man of his time, right? He's this incredible prophet and he gets initiated into the throne room of God. He's there in probably what St. Paul would call the third heaven or something like that. And. And he says, I. I am undone. I'm a man of unclean lips. There's this idea that the, that the, that the saints have, that the more we focus on Christ, the more we are moving towards Christ, the more we have to humble ourselves, the more we have to sacrifice ourselves. And lower, because we recognize how, you know, how flawed we are, how sinful we are in comparison. Right. That comparison, it's like this weird inversion where we're moving towards Christ and maybe to an external observer it would seem like we're becoming sanctified. Our own perception of it. We realize how much further we're getting away from him simultaneously. So various. Various saints would say, like, at the end of their life, you know, oh, I haven't even begun to repent, you know, or, you know, or I'm afraid, you know, they're glowing with the uncreated light. And then. And the people there hear him talking and say, you know, oh, he says he's responding to the demons. I don't have any hope, you know. You know, so these kind of inversions of. Of that. This like a simultaneous movement toward God and the sense of moving away because we're just so, I hate to say repugnant, you know, because of our sins, but it's our perception of that, right? It's not saying anything about God's perception of us. It's only speaking about our perception of ourselves when we start to really know ourselves in relationship to Christ, you know, and the more we're able to offer ourselves up freely to Christ, the more we move towards Him. But the more we realize how much more work we have to do in offering ourselves up."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":2759.38,"end":2828.01,"speaker":"Jonathan Pageau","text":"Yeah, yeah. And you can see, like, you know, you can see how this applies even at lower levels, you know, when you think, you know, when you think of the problem of the politician, you know, the problem of democracy, for example, which is that you end up with, like, narcissists, you know, because you have to, you have to fight so much to get it. Like, you have to do everything, you know, and, and basically to get that position of power, you have to be willing to do anything, lie, do whatever it takes just to get there. Whereas what we really want is something like a reluctant king. Like, that's what we would really want, right? Someone who we know is the best to be the king, but really he doesn't want to be the king. And we almost have to force, like, to say, no, you're the king. You know, like all these stories of, of the ancient bishops. You know, they go get the, the monk in the cave and see, say, okay, you're the bishop, and you, you would just run away and bring it back. No, no, like, we know that you're the bishop, so that's what we would want. But it's a. It's. Yeah, it's difficult to. Yeah, it, it's. It's at the one hand impossible. You know, it just feels impossible. But on the other hand, you know that it, it has to be that way. And that's the, that's actually the best image of reality."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":2828.33,"end":2828.73,"speaker":"Fr Joseph Lucas","text":"Right."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":2829.45,"end":2842.49,"speaker":"Jonathan Pageau","text":"Father Joseph, this was amazing. Like, thank you so much for, for this conversation and, and, and, and, yeah, and I hope I will see you. I think you're. You said you're going to come to the Symbolic World Summit and so people can. We'll be able to meet you there."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":2842.49,"end":2852.29,"speaker":"Fr Joseph Lucas","text":"Yeah, that's my plan. I hope they get up there. I mean, it's not that far. I mean, Tarpon Springs, we call it Tarponi P. He. That's a Greek because it's, it's entirely Greek. Exactly."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":2852.29,"end":2854.21,"speaker":"Jonathan Pageau","text":"It's like the Greek capital of America."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":2854.29,"end":2860.89,"speaker":"Fr Joseph Lucas","text":"I try to get up there once every year or so, and my family and walk around the Sponge Docks and buy some Greek stuff and bring it back to Miami."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":2860.89,"end":2867.41,"speaker":"Jonathan Pageau","text":"So, so, so definitely looking forward to, to, to seeing you again and thanks for your insight and thank you for your time, Father."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":2867.65,"end":2868.21,"speaker":"Fr Joseph Lucas","text":"Yeah."}
{"episode_id":"SW - #317 - 2023-12-05 - Fr. Joseph Lucas - Sacrifice - The Paradox of Salvation","start":2868.61,"end":2883.63,"speaker":"Jonathan Pageau","text":"If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase, so go to the symbolicworld.com and thank you for your support."}
