{"episode_id":"SW - #075 - 2019-11-23 - Problems with Steven Pinker's Enlightenment Narrative","start":0.24,"end":1289.53,"speaker":"Jonathan Pageau","text":"Hello, everybody. I am currently speaking at an Orthodox Christian Fellowship meeting for their leadership, and I have a bit of spare time. And I have been reading Steven Pinker's book, Enlightenment Now. I also heard him speak on Jordan Peterson's podcast recently. And so I thought it would be a good opportunity to talk a little bit about his ideas, about his book Enlightenment now, and some of the problems that come up in a manner in which he frames his narrative, let's call it. This is Jonathan Peugeot. Welcome to the Symbolic world. So most of you who are watching this will know who Steven Pinker is. He is a psychologist at Harvard University, social psychologist, and he does studies on thinking on society. And he's recently been known for pushing the notion of Enlightenment and how the values of the Enlightenment and the think of the Enlightenment are the key to the problems that we're facing and are the reason for, for all the positive things in our world today. His book Enlightenment now, which is, I think, his most recent book, deals with the questions of how the world is getting better, the questions of the reason why they seem to be doing better because of Enlightenment principles, what he calls Enlightenment principles, and also the threat of this based on what he calls counter Enlightenment principles, and also a regressive attitude going back to religion and going back to all those things. So Steven Pinker, he's quite anti religious. He really is a kind of atheist materialist in the Sam Harris version of it. And so it's very fascinating to read his book and to try to analyze the way that he frames reality. And understanding the way he does that will also help us see the inevitability of some of the patterns that I've been telling you guys about and some of the manners in which we frame the world in order to present, to present a coherent story. And so Steven Pinker says that his whole way of thinking, his whole manner of presenting the world is based on reason and that if only human beings would center their activity, center their intentions on reason, then a lot of the problems that are around us would go away. And this is what he calls Enlightenment thinking. Now, what you realize as you're reading his book is that what he's also presenting, kind of underneath his call to reason, is a narrative. He is giving us the usual progressive narrative. So when we analyze the progressive narrative, we can get some understanding about some of the problems that happen when we. When he frames his way of presenting the world as being obvious and inevitable. So one of the first interesting things he does is that he gives us these Enlightenment principles, reason, democracy, Science. And then he tells us about the counter Enlightenment principles. And then he mentions totalitarianism. He also mentions romanticism, you know, this kind of focus on will and emotion and all of that. And that stuff is bad. Like, we need to get rid of that stuff and we need to focus on the Enlightenment principles, which are democracy, reason and science. And what's fascinating is the manner in which he frames that, because the counter Enlightenment, what he calls the counter Enlightenment and the Enlightenment are two faces of the same thing. For example, in his book, he quotes Hobbes quite a bit, and he quotes Hobbes as an example of Enlightenment thinker. Well, Hobbes was a totalitarian thinker. He believed in absolute. He believed in absolutism and an absolute monarchy. And so absolute monarchy, the French monarchies, the English monarchies, Louis xiv, you know, Charles I and those types of monarch that tried to be absolute, those were Enlightenment thinkers. They were done in an Enlightenment manner. If you ask Napoleon what he was doing, he would have told you, I am furthering the Enlightenment. And so already you see a problem in the manner in which he's presenting reality. He's able. What he's able to do, and it's. It's quite tricky, is he's able to look at the modern world and to everything that he likes about the modern world, he's able to say Enlightenment. And everything he dislikes about the modern world, he's able to say counter Enlightenment. And by saying counter Enlightenment, he's able to suggest that somehow this counter Enlightenment is going back to the past, going back to the horrible things of the past, which are, you know, akin to religion and to all that superstitious stuff. And so it's very fascinating because the totalitarian spirit is a modern. I mean, obviously there are traces of all these things in the past, but the focus on this kind of totalitarian idea is something which happened at the same time as the other Enlightenment ideas that were coming back in the 17th century and the 18th century. It is. It is extreme. There's something a little bit dishonest about simply choosing the things you like about the modern world and putting them on your side and taking all the things you don't like about the modern world and putting them in being akin to all those horrible, dark medieval things that you want to get rid of. Now, we see the same thing in the book Explaining Postmodernism by Stephen Hicks, where he puts postmodernism all the way back into the early modern era and all the philosophers that he doesn't like in the early modern era. He puts them. He traces a line where he says that all these thinkers are the ones that led to. To postmodernism. And he even mentions Kant, he mentions Hegel. And it's like, it's crazy because, I mean, the idea that Kant is not an Enlightenment thinker is absolutely insane. It's not insane, but there's something extremely dishonest about simply slicing the world like that, putting the good guys on one side, the bad guys on the other, and then telling your story that way. But it's a story, you know, the way that Steven Pinker tells the story is no. Is no better or no worse than any superhero story where there's a clear bad guy, a clear good guy. We're on the good side, and we're going to defeat the bad guys. And it's fascinating because he, obviously, he presents his whole thinking as moving away from that type of approach. He presents his whole thinking as moving away from this identitarianism that he sees as evil to this conviction that he sees as evil. But at the same time, he presents, and it's a very clear narrative. The good guys who want these things, the bad guys who want these things, they're totally separate, and we need to vanquish those bad guys. But like I said, a lot of the ideas that he opposes originate in the same thinkers that he also supports. Voltaire, when he went to England, he was amazed by the strength of the royalty and how royalty was there to impose Enlightenment principles on the world. A lot of the colonial efforts of the early modern era were done in a desire to bring enlightenment to the world and to shine the light of reason and of science and all of that on all these other cultures. And so these are the things that Steven Pinker puts to the side. He either ignores them or he doesn't connect the dots together in order to show how all of this is related together. So one of the problems of the way that Steven Pinker is presenting reality and presenting his narrative is the problem that Jordan Peterson has been trying to express in different ways, which is the idea that true religious narrative tries to encompass all of human reality within the story. And so it tends to focus or to bring into the scope of the story the light and the dark sides and the left and the right hand, you could say all of that tends to be part of these stories. Now, one of the things that Steven Pinker does is, by the way, that he's able to frame. He's able to ignore certain aspects or marginalize certain aspects of reality. And Pretend that if we just don't focus on them, if we just focus on reason and science and humanism, then we'll all be fine. But there's a problem with that. There's a problem. The problem is that human beings are not only reasonable, there are other aspects of the human person which exist. And you can't just ignore them. You can't just ignore them because they're always there and they will always manifest themselves. So you have to take them into account. I can explain it this way. If you say something like reason, only reason. Focus on reason. Focus on reason. Then what you can do is then when something unreasonable presents itself, when something unreasonable within yourself or within the world starts to manifest, you can say, there, there, I'm telling, I told you, you need to focus on reason. Because look at the unreasonable thing and look at how it's manifesting itself. Focus on the reason. Focus on reason. But the problem is that that thing, that unreasonable thing, it's there. You have to deal with it. You can't just say, no, no, no. It's like, I just want you to focus on reason. So if there's something unreasonable that happens, it means that that's not what I told you to focus on. But the problem is that the side effects of what you want aren't necessarily what you control. You can't just say. A good example is like, you can't just say, I want society to be based on reason and I want society to be based on democracy. And then you think anything that isn't based on reason and on democracy, if it doesn't happen that way, then it's not what I want, it's not what I told you to do. But the problem is that reason and democracy don't necessarily totally jive together. Because in the book. It's fascinating because in the book, Steven Pinker is constantly complaining about how people are not capable of being reasonable, how the majority of people are incapable of. Of focusing on reason. But then he says, we need to be reasonable and we need democracies. How can you have those two things together? You can understand why people like Hobbes, who said we need to be reasonable, rather pointed to a kind of absolutism, which is to have someone with absolute power that could impose reason on the world because people left to their own mechanisms don't tend to choose reason. How many people do you know who actually vote for someone based on reason? I'm pretty sure that Justin Trudeau was elected because he has a pretty face, rather than people being reasonable and Thinking reasonably about the problems in the world. And it's fascinating to watch in the book how I would say, like, almost half the book is Steven Pinker complaining about how people are incapable of being reasonable and at the same time saying, that's what we need and we also need democracy. So. So it's like, you can't just say, this is what the world should be like. And whatever side effect comes about that you can just ignore it and pretend like, well, that's not what I said. I didn't. You know, I said, it's like if. It's like if I told you you need to be nice and you need to be really, you need to be nice to people and you need to never hurt anybody, and you need to do only good things. Do only good things. And then when somebody does bad things, it's like, well, no, that's not. I didn't. I told you, do good things. Do only good things. If you do only good things, then there'll be no problem in the world. I mean, can you argue with that? Can you argue with the fact that if you only do. If I tell you, just do good things, and then there'll be no problems in the world? So if there are bad things happening in the world. That's not what I said. I said do good things. And that's the way that Steven Pinker approaches reality, the side effects of his thinking. There's a very powerful image. That was an engraving by Goya. Most of you probably will have seen it. It's called the Sleep of Reason Produces Monsters. And I'm sure Steven Pinker, if he saw it, he would consider it part of the counter enlightenment. But there's a very wise, very wise thought in that engraving. It's that you cannot be only reasonable as a person, just like you cannot just stay awake. It's like if I told you you could accomplish. You can work 24 hours a day, you can accomplish so much. All you need to do is work 24 hours a day and then you'll accomplish all of this. And then if you fall asleep, you're like, no, no, no, I told you, don't fall asleep. I told you, stay awake. If you stay awake, then you'll be fine. But the problem is that the human being has cycles. We have cycles of awake and sleep, just like we have cycle of reason and unreason, or reason and emotion, or we need reason. And we also have other aspects, which is our desire to belong or desire for identity. And what Steven Peaker does is he shows us all the negative aspects of belonging, as if we don't need that, but we need that. And there are negative aspects to belonging, but we have to deal with them instead of just put them aside and say, no, no, no, no, no, just focus on reason, be reasonable, and everything will be okay. And so what it does, it's ignoring of one of the, of some of the major aspects of how humanity works, which is these cycles which we have. Human attention is, is not constant. Human attention falls from attention to distraction, or you could call it from focus to opening up to question. All of these, these pattern of focus and opening or the pattern of attention and distraction, the pattern of being awake and being asleep. That's just how we exist as human beings. And you have to take that into account. You can't just ignore it and tell, and tell people that, I told you to stay awake, I told you to be reasonable. And if you're not reasonable, then you're just not doing what I said. And so if you only did what I said, then everything would be fine. And so there is an ignoring of how the human person works and some of the inevitable elements of the human person. And so one of the things that Steven Pinker does is that because he doesn't see these cycles, he doesn't see them. So he, he sees this, he talks about this progress and then he sees, I mean, obviously he sees the totalitarian moments in the 20th century and he says, oh no, but that was the counter enlightenment. That was the, all of this progress. That's the enlightenment. But anything that led to the totalitarian spirit, that's the counter enlightenment. And so now in the World War II, there was this blip. We fell into the counter enlightenment thinking. But now we're back on track and we're just going to keep going up and up and up and up. And if we make the effort, if we just make the effort, we'll keep going up. You know, if we, we, we stay focused on reason and focus on that, but that's just not how reality works. That's not how human beings work. And the World War II was only, you know, was, was barely a generation ago. And, and you think that that was just a blip and now we're just, it's just going to be constant sailing from there. No, they have, we have cycles. If you pull the blanket on one side, it's going to snap on the other side. If you say just, just, just, just reason, then chaos is waiting in the wings to come back and devour this over emphasis on reason. You cannot have just one. It is not possible to have just one. It is, it is ignoring the human person, ignoring an important aspect of what it means to be human. And so what the. And one of the problems is that one excess leads necessarily into the other. And so, for example, what's fascinating in his analysis is that he talks about how democracy is in danger. You know, how, you know, we're seeing. Is democracy just going, Democracy is in danger. Now we can see it in United States, we can see it in Europe, we can see it all of this. And he's bemoaning the fact that democracy is in danger, but he doesn't understand that the very mechanisms of democracy lead to its own problematic reality. And that the mechanisms of democracy can lead to a breakdown of cohesion, a breakdown of understanding, an incapacity to agree on things. And that stalemate will create the desire for a totalitarian regime. And it's not. This is. I mean, Plato saw this in the Republic. Plato described the mechanisms of democracy as leading to tyranny. And Steven Pinker has a wild statement in his book where he says that democracy has never led to totalitarian regime, but rather that it's thugs who took over governments. And it wasn't the democratic process. But it's like, sorry, that's not what happened in Germany. The Nazis were elected, people desired Hitler. You can say what you want. People desired. The Germans desired Hitler. Just like, just like people in. Some people in Europe now are voting for harder, right governments that could even be even worse. People could vote for even the harder, even harder totalitarian governments. You know, the idea that communism wasn't desired by the people, that the people didn't, that there wasn't a mass of people that participated in the revolution is absurd. You know, Plato talks about how the excess of liberty leads to the excess of tyranny. Those two things are related. You know, a traditional understanding of the world, a traditional vision of the world, understands this pattern and wants to create a smooth sailing in the pattern. That's what the, you know, that's what things like the liturgical year is for. That's what the manner in which, you know, I've talked about the structure of the Church as from the center leading towards buffer, buffer areas, places where chaos is allowed in. A little bit like the carn or little moments in a year where we let in some of the unreason in order to evacuate it, you could say, so that we can restart the cycle and move to something unreasonable. But if you pretend like those things don't exist or that we can just focus on one and not at some point, get the other. You misunderstand what a human. What human consciousness, how it works. Human consciousness functions through this wave. This wave. And what you want is. You don't want it to go into extremes. You want it to remain, you know, small waves of attention and dispersion, you could call it. In the traditional mystical practice of the Orthodox Church, for example, we have the Jesus prayer, where one is an invocation. You know, you invoke the divine name, say lord Jesus Christ, the Son of God, and then you say, have mercy upon me, a sinner. And so you have this attention and then you have this dispersion. And it has to do with breathing. You breathe in and you breathe out. You focus, you concentrate, and then you disperse. And that's the pattern of everything. You cannot have only inhalation, you cannot have only awake, and you cannot have only reason. To think so is to delude oneself. So I hope that this was helpful. You can check out the talk that Steven Picker, you can find him online if you don't know much about him. And I wouldn't suggest to read his book. I mean, you can read his book, but if you understand this, if you understand what I'm trying to explain, the reading of the book will be very frustrating to you. But there's a lot of data in there that could be interesting. You know, we can't deny that science."}
{"episode_id":"SW - #075 - 2019-11-23 - Problems with Steven Pinker's Enlightenment Narrative","start":1289.77,"end":1291.85,"speaker":"Announcer","text":"Has brought a lot of material good."}
{"episode_id":"SW - #075 - 2019-11-23 - Problems with Steven Pinker's Enlightenment Narrative","start":1291.85,"end":1308.03,"speaker":"Jonathan Pageau","text":"To the world and that our societies are peaceful at the moment. You know, doesn't mean it's going to be like that forever, but. Yeah. So I hope you enjoyed this discussion on Steven Pinker's book and. All right, guys, I will see you soon."}
{"episode_id":"SW - #075 - 2019-11-23 - Problems with Steven Pinker's Enlightenment Narrative","start":1309.63,"end":1374.49,"speaker":"Announcer","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially. Going to www.thesymbolicworld com support or else on Patreon Pageau videos as well, and on Subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
