{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":0.24,"end":8.8,"speaker":"Paul Kingsnorth","text":"It might even be, if you want to talk about it, kind of mystically or spiritually, that we can somehow sense this thing being born around us. And that's part of the confusion of the moment."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":8.88,"end":9.36,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":9.6,"end":23.2,"speaker":"Paul Kingsnorth","text":"Something else is in control at this point, and it isn't really us anymore. These systems have outrun us. You know, the machine is much bigger than us, and to some degree, it's starting to not need us as much as we thought it did."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":39.58,"end":63.81,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. I mean, obviously following your newsletter. Just overjoyed at getting it every time. And so I was hoping that we could talk a little bit about your project right now and what you're doing, because I think when we talked last time, you hadn't yet started."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":65.64,"end":67.4,"speaker":"Paul Kingsnorth","text":"Yeah, I think I was just kind of. Yeah."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":67.8,"end":68.96,"speaker":"Jonathan Pageau","text":"Or maybe just starting."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":68.96,"end":82.44,"speaker":"Paul Kingsnorth","text":"Maybe. Yeah, I think I was just starting off, but I wasn't sure where it was going to go. And it's kind of still not quite sure where it's going. I more or less know. But yeah, it's. It's been. It's been really interesting, actually. And, you know, the world has changed so much, like we just said."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":82.68,"end":83.2,"speaker":"Jonathan Pageau","text":"Exactly."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":83.2,"end":88.64,"speaker":"Paul Kingsnorth","text":"In a year. It's like. It's like trying to. Half the challenge is just keeping up with what the hell's going on. Yeah."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":88.64,"end":89.48,"speaker":"Jonathan Pageau","text":"Yeah. And doing it."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":90.28,"end":93.1,"speaker":"Paul Kingsnorth","text":"Talk about current affairs much and staying."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":93.1,"end":97.58,"speaker":"Jonathan Pageau","text":"In touch with knowing what's going on and then letting it not totally suck you into."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":98.06,"end":110.7,"speaker":"Paul Kingsnorth","text":"Yeah, that's the big challenge. Yeah. I mean, I think you're very wise not to engage in current affairs very much on your channel. Actually. It's the way. It's the way to do it. You have to just keep that same distance from it, you know?"}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":110.94,"end":137.63,"speaker":"Jonathan Pageau","text":"Yeah, I'm trying. I was a little more involved with what was going on here with the. You know, because I felt like it was more grounded, like I had my feet on the ground. I had a sense of what was going on and the consequences of the decisions of the government in terms of the COVID actions and stuff. So I felt like I was. That it was fine to be more involved and a little more active in that. I even went to the trucker, participated twice in the trucker protest."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":137.63,"end":143.59,"speaker":"Paul Kingsnorth","text":"All right. Okay. Yeah. How was it? I was really following that. It was very, really interesting and weird what was going on there."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":143.59,"end":174.52,"speaker":"Jonathan Pageau","text":"It was astounding. I mean, it was astounding because it really revealed the disjoint between the narrative and what was actually happening. When you go. You went there. It was amazing. And not only was it amazing, but you could find hours and hours of people streaming. You know, you can go online on YouTube and find people walking around the protest for five hours at a time every day, and so you can know what was actually going on. But nonetheless, it didn't matter in terms of the narrative. And so it was astounding."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":175.08,"end":188.52,"speaker":"Paul Kingsnorth","text":"It's a great revelation, isn't it? Maybe it's one of the things we could talk about, but it was the same with Brexit in Britain, you know, exactly the same. That was supposedly a fascist uprising. And then you actually went to see what was going on, and funnily enough, it was nothing of the kind."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":188.84,"end":189.56,"speaker":"Jonathan Pageau","text":"Exactly."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":189.72,"end":196.6,"speaker":"Paul Kingsnorth","text":"It's the same narrative. It's just rolled out, you know? Yeah, you got to be the testing ground there, didn't you, for the. For the new bio, Biostate."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":196.84,"end":230.73,"speaker":"Jonathan Pageau","text":"That's definitely what it feels like. It's strange to think that Canada is somehow, let's say, the center of anything in terms of narrative, but it seems like it just happened. Also because our prime minister is so sold to the whole thing. He's just so completely sold. And we should have known. I mean, he's been saying things for 10 years that since he's been in politics, he's been saying the same thing. And you know, that what he's saying, what it means when he says something like, we are the first post national nation."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":230.97,"end":231.41,"speaker":"Paul Kingsnorth","text":"Yeah."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":231.41,"end":243.37,"speaker":"Jonathan Pageau","text":"And when you hear it at first, you're thinking, oh, you know, he doesn't want nationalism. He doesn't want that. I understand that. But then when you realize, oh, what it means in terms of globalism, you think, okay, so that's what that means."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":243.93,"end":246.81,"speaker":"Paul Kingsnorth","text":"Yeah. Yeah. Hiding in plain sight."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":247.37,"end":248.09,"speaker":"Jonathan Pageau","text":"Exactly."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":248.17,"end":249.37,"speaker":"Paul Kingsnorth","text":"That's what it feels like."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":249.37,"end":322.32,"speaker":"Jonathan Pageau","text":"So, all right. So, I mean, I think that if you're. Okay. I'm actually already recording. I think we could just keep going. People know who you are. Everybody knows, I think, by now who Paul Kingsnorth is. I'll introduce you. Paul Kingsnorth is a writer, and I had him on my channel before. He's written several novels, but recently he's been writing a wonderful substack that I keep telling people subscribe to Paul's substack because he looks at the situation with a piercing insight. He doesn't give in to extremes, but he also has a very keen look on what is going on, what it means for us as. As humans, what it means for us as Christians, as people living in this world, trying to find our place and make sense. And so I was Hoping that we could talk about that a little bit. What your recent project is also get a sense of what it's been attracting to you because I imagine all of a sudden your horizon of people that are contacting you, that are discussing with you has changed in the past few months. And so I would really like to get a sense of that. Maybe we could start with that and you can tell us what was the impetus behind this substack and what is it that's kind of driving you as you're writing these articles?"}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":322.56,"end":533.48,"speaker":"Paul Kingsnorth","text":"Yeah, well, it's always a challenge for a writer to know what's driving him, but really, for the past 25 years, I suppose since I started writing, I've been writing pretty much about the same thing, even though I didn't necessarily know it consciously. And that's true of my fiction and my nonfiction as well, actually. And the thing I am writing about is the manifestation of this giant system of control, technological system of control, state control, corporate control, and all the rest of the manifestation of that versus the kind of human scale way of life that maybe is more traditional, but also is still very extant in large parts of the world. And I started off writing that, writing about that as a young kind of environmental activist, I suppose, very much a man of the left. Not that I've ever liked putting myself into boxes. But you know, my first book was a kind of very much a kind of idealistic young man's anti globalization tract. And I spent a long time traveling the world and visiting communities that were kind of resisting corporate capitalism and the spread of this thing. And I've really spent, as I said the last 25 years writing about that from different perspectives and in different ways. And I suppose my politics have changed a little bit. Although actually fundamentally I still believe the same things I did when I was 19. But what I've seen, what I've come to see is I suppose, a much broader perspective of what's going on. And just over the last couple of years with what happened with the COVID pandemic and the way that that was dealt with now, what's going on in the Ukraine, and more broadly than that, actually just the kind of very, very rapid rollout of this technological society, very interconnected, very technological, very, very much openly now, monitoring people and controlling people and shutting people down if they don have the correct perspective, it's become very much clearer that the thing that I've been writing about for a long time is manifesting very kind of publicly everywhere now, whatever you think of say, a vaccine, passport system. Whether you think that's a good or a bad idea, that's very clearly something that could not have happened even five or 10 years ago. The technology wasn't available. The ability to do it wasn't available. Similarly with, say, shutting Russia out of the global financial system. Again, whether or not you think that's good or a bad thing, it's now a possible thing. Whatever you think of what your government did in Canada with the truckers protest and the ability to remove people from the financial system if they don't like the government's actions, again, that's a thing that is now happening in a way that it hasn't been happening, at least in the west, before. And so this substack I'm writing is really just kind of a way of. Well, firstly, I just write to get things out of my head, otherwise I'm going to go mad. I mean, that's fundamentally. Certainly in nonfiction terms. I mean, fiction is much more creative and enjoyable, but nonfiction, you're trying to work out what the hell's going on. So I'm really trying to outline this thing that I've called the machine, which is a term that was coined by greater writers than me in the past, from D.H. lawrence to George Orwell, to just describe this almost impossible to pin down, but very obvious manifestation of technological control that's been growing for hundreds of years, but is now accelerating. And I'm trying to work out what it is, what it means, what the alternatives are to it, if there are any. And also somebody who's a Christian, but quite a new Christian. I'm trying to understand what that means in the context of the Christian faith and more broadly, what's the spiritual perspective on it? Because increasingly it's obvious to me that this is actually a spiritual crisis more than it is anything else. So. So, yeah, that's quite a lot to be going on with, isn't it?"}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":533.88,"end":547.16,"speaker":"Jonathan Pageau","text":"No, but I think it's wonderful. And I felt that it's been very complimentary to the things that I've been talking about in terms of the notion of the system of the beast, let's say I've used. I kind of use apocalyptic terms, which I guess scares people."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":547.78,"end":547.9,"speaker":"Paul Kingsnorth","text":"Think."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":547.9,"end":655.69,"speaker":"Jonathan Pageau","text":"I'm always saying it's the end of the world, which, who knows, maybe it is. But that's really not the point. It's mostly about showing that in Scripture there is a pattern that relates directly to the notion of technology and control and which begins with the idea of the Mark of Cain. Writing is actually part of this technological system. And it moves into the city of Cain, into weapons, into civilization itself, which contains in it, you could say something like the seed of Cain. It means that civilization isn't all bad, but it necessarily has an aspect of it which is about the problem of inclusion and exclusion and the problem of controlling your borders and controlling what is inside and giving yourself power in order to do that. It's kind of an inevitable part of civilization, but one which has a very dark aspect. And as technical capacity grows, we always see it as an increase in power, which it is, of course, it's an increase in power, but that means that those that wield political power are always, always their power is increasing as technical capacity is increasing as well. So I actually frame it as a. I frame it as both the machine in terms of control, but also it's like balance with the weird anarchism. It's as if there's on the one hand, this sense that you should be completely free to do. To be. To do whatever you want, that there's no limit on you and your identity and whatever you want to be, but that in order for that narrative to be possible, there's a counter narrative which is always growing with it, which is that you always have to be completely safe and complete. Everything has to be safe and in a very, very secured area so that you can experiment all that craziness. Because obviously in the normal, traditional world, you can't just be whatever you want because you'll die of hunger, you're just not going to eat."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":655.93,"end":656.57,"speaker":"Paul Kingsnorth","text":"You won't."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":656.78,"end":703.36,"speaker":"Jonathan Pageau","text":"You have to stay connected to other people in the community in order for the community for you to exist. But in this world, it's a vacillation between. I'm a completely idiosyncratic being that does whatever they want and can express myself in whatever manner I want. But at the same time, I live at the same time in a world that is completely controlling me and setting down limits that if you cross them at this point, you're excluded in ways that would not have been possible before. When money becomes digital, I won't be able to. I won't be able to unless we actually start bartering again, which might actually happen at some point. But if money is digital, unless I have a chicken hiding, I won't be able to participate in the financial system. I won't be able to buy, won't be able to sell."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":703.68,"end":923.04,"speaker":"Paul Kingsnorth","text":"Yeah, well, I've got a load of chickens outside and they lay a lot of eggs, so you're too far away to share them with unfortunately, but at least I get to make. But that's something. But it's. Civil civilization is a control system, has always been a control system. And all civilizations from Rome to Babylon, as you mentioned, obviously a control system. So this one is the most effective and the most global and the most technologically advanced. And so it means that the things that the Babylonian kings or the pharaohs might have liked to do to control their population are now possible. And if you have a system that is decentralized and which is this dependent on, say, global supply chains and is this dependent on technology? And there's also this dependent on growth, because a capitalist economic system requires endless growth. And in order to keep that going, it's necessary to do all sorts of things, from managing population numbers to managing industrial output, to managing trade. You can't allow any of the balls to drop to the floor, otherwise the whole thing potentially falls apart. So the need and the desire for control just grows and grows and grows. And yet at the same time, as you say, you have this kind of, on the one hand, extreme coercion and on the other hand, kind of extreme liberalism or individualism, in which, on the one hand, yeah, we can be anything we want, literally anything we can imagine. We can redefine our own bodies if we feel like we've just done that. But at the same time, if you cross any of the kind of red lines that are drawn by the culture, then you're dead meat. And you could literally be, you can have your bank account taken away. And this is happening to people. And so you've got this sort of strange combination of extreme liberalism and extreme illiberalism at the same time. And it's, it messes with the head, actually. I mean, you talk about different people writing to me, but maybe the common, I mean, I have people from right across the spectrum writing to me all the time. And a lot of the common, maybe the common factor that people will often come out with is I just have no idea what the hell is going on. And people tell me at least sometimes that they value what I'm writing because I'm trying to work that out and they find it useful to sort of come along with me. But it is just so immensely confusing because so many of the things which, as you say, maybe in a more customary society, people will just live with family, community, local level institutions, roots in a place, all of these things that would define most traditional societies around the world, they've all been demolished. And so we're left with, on the one hand, the individual and on the other hand, the increasingly powerful state, which has a kind of corporate arm and a media arm, and that's almost become one blob of power, corporations, the state and the mass media, and then there's us little people, and depending on where we live in the world, we've got more or less of a kind of rooted community around us. But fundamentally, the whole thing is reduced to a binary of the powerful state up here and the little person down here. And so that's how you get this weird thing in which you can define your own reality, but at the same time, you're more controlled than you've ever been, and it's extremely confusing, and it's kind of rushing in that direction all the time. And the other thing to think about is just the huge wave of imagery that we're battered with all the time, the possibility now, through social media and the web, to just give us endless images. I mean, the war in Ukraine is a great example of this. Has any war ever been kind of so relentlessly covered and livestreamed? You know, you can get this diet of horrible images and news and conflicting ideas and opinions all the time, and it's almost impossible to. You know, I long for the old days where you turn the BBC on and the man would tell you what was going on, and that was the news, and there'd be a war reporter, and there he was, and he would say, this is what's happened here. And it's. Yeah, so you've got all of these kind of these forces coming at your consciousness from so many different directions. And I think increasingly, a lot of people just find it almost impossible to manage it, actually. Just to navigate the whole system."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":923.28,"end":1073.42,"speaker":"Jonathan Pageau","text":"Yeah, I mean, I think the way you present it as the two extremes, I think that that's the key, is that a normal kind of traditional, what I call this kind of symbolic world is a constant negotiation between levels of existence. So you exist in these embedded communities, so you have your, you know, you have your friends and your family, and that creates a kind of cohesion. And then that's embedded in churches or embedded in community groups, embedded in villages and towns, and, you know, and ultimately does reach up. It can reach up very high in terms of empire, in terms of nation, but because you have these buffered realities, then, you know, at the point where sometimes the king might become tyrannical, you can find some solace and some protection in your family or in these more embedded communities. But because of the way that the system is getting set up, because of the fact that the state. In many of our countries, the state has become the sole arbiter of all your existence. It decides pretty much everything about how you're going to live your life. Then you have these two extremes where the state becomes more and more powerful and human beings become more and more disconnected from each other. And then the power becomes absolute. But people don't feel it so much. I mean, until they do, right? They don't feel it until they do. Like you said, if they're inside, then they're okay. And they feel like they can do whatever they want. They can watch whatever Netflix show they want, they can consume as much in any manner they like. But as soon as sometimes the face of the system shows itself. And I think that that's something that during COVID it has something happened. It was funny when Justin Trudeau basically shut down people's bank accounts. I think that I don't know exactly what happened. We don't know what happened in the background of that, but it seems like he let the mask slip a little too much for some people because all of a sudden a week later they pulled back or a week and a half later. But I think they realize that this is telling people we can do this. Not only we can do this, we're going to do it. We're going to do it increasingly. And the Russia situation is the same like watching people in Russia going to the store and then using Apple Pay and it doesn't work. Do you think that that's only going to be used outside? That it's not going to be used inside? It happened just a month ago in Canada, so of course it's going to be used on you."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":1073.58,"end":1127.38,"speaker":"Paul Kingsnorth","text":"And the short sightedness is astonishing. I mean, I have say, friends on the liberal left, my old activist buddies, and I see some of them out there cheering on what Trudeau did because they bought into the line that this is just a bunch of fascists who've turned up to wade swastikas and so it's great that he can shut them down now, even if that was true, which as far as I could see, it wasn't true at all, but even if it had been true, even if it had been a fascist rally or whatever, are you still really comfortable with the government doing that? Do you think that that won't be used elsewhere? Do you trust any authority at all to have that degree of power over anyone? You've got to be very short sighted to do that. I mean, it's interesting looking at Trudeau from where I am, because I no expert on Canada, but he's almost a poster boy for how to be a liberal, isn't he? In the global sense. He says all the right things and yet at the same time he's just used the most authoritarian powers in any modern democracy that I can see."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":1128.5,"end":1173.74,"speaker":"Jonathan Pageau","text":"But people don't under, they don't realize. I think it's also, there's a sense in which people just don't know history or actually totally understand, seem to not understand how democracy works or how systems work. And so I always use an extreme example and I tell people if I rape a child, they won't take away my bank account. If I go out in the street and I start killing, slashing people's throats, they're not going to take away my bank account. You understand that? So why do you think that it's normal to take away bank accounts? That's insane to think that you will actually cut people out of the capacity to pay for. And people just thought it was a normal thing to do and to do it against your political enemies. That's insane. It's like we're reaching levels that are hard to describe."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":1174.06,"end":1333.71,"speaker":"Paul Kingsnorth","text":"That's the thing that's new. And it's like this stuff has been normalized. Something has happened over the last two years where this kind of firstly, society has become incredibly tribal in the West. I mean, we already had this culture war brewing in America, which has come roaring over into Europe as well, especially into Britain, less so where I live in Ireland, thank the Lord, but I'm hoping that will last. But you already had this culture war after Trump was elected and Brexit happened in Britain. There were already all these divisions opening up and people weren't listening to each other at all. But it's gone into hyperdrive over Covid because, you know, the war against the unvaccinated and the so called anti vaxxers was astonishing. You know, I'm not vaccinated myself, so I had to sit here and be excluded from the life of my society for six months for no obvious scientific reason at all. But even if there had been, you know, even if the arguments for that had been legitimate, which in my view they weren't, it was still done without question, with no discussion and with a complete media blackout on any dissenting views, no conversation in some countries, obviously it was worse. They had mandatory vaccination in other places and it was so normalized that it seems to me now that, you know, wherever you are, whichever kind of side of this fake battle that you decided to put yourself on. It's increasingly possible for you to justify extreme measures against the guys that you've decided are the bad ones. And there's this kind of extreme moralism on the one hand, where your enemies are not just wrong, but they're evil. And then, as we were saying, that's coupled with the ability to use power, technological power, especially in a way that hasn't been possible before. And then at the same time, you have this kind of development of the sort of the moral state in which the state is taking very clear lines on what is acceptable to say, what is not acceptable to say, what are moral positions, how you should behave at work, how you should relate to each other in a way that states have never really done before, at least to this degree. You combine all of that and we're going into a situation where nobody's listening to each other. Everybody wants a war, or at least a lot of people do, especially the ones on Twitter. Apparently social media sites, you know, social media sites have so much power and influence just for basically a bunch of people sounding off on the Internet, which is what they were, what they are. The ability of those sites to effectively destroy people's lives and reputations sometimes astonishing. So you've got all this stuff kind of converging at hyperspeed, and it's quite frightening. I don't know where it ends, because you ask yourself, how could you defuse this? And I don't know how you can defuse it. In the context of a culture that's disintegrating, I think, and an economy that's starting to fall apart with a kind of ecological background of disintegration as well. It's difficult to know. There's certainly no returning to whatever period you thought was normal, put it that way."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":1334.11,"end":1432.23,"speaker":"Jonathan Pageau","text":"No, it doesn't seem like that's for sure at this point. We're not going back to anything, and people have to stop thinking it's going to return. Two years after the beginning of COVID most of the countries still have emergency powers and they keep pushing back. When they're going to let that go. And why would they let that go? We let them have it for two years. So, I mean, maybe they will for a little moment, just to make people feel like. Made people feel like they're doing something. But the track is set, the pattern has been accepted. And so by now it seems like only a very, very large crisis will be able to kind of pull us back from what is happening. And so I don't necessarily. Yeah, I don't anticipate that with great joy. But it seems like it's not going to return without some massive crisis. Very big one. It will sadly have to be very big for it to pull back. And so in the meantime, I think that Rodrier's kind of idea for the Benedict option all of a sudden becomes more and more salient for us because there is really nothing else you can do besides try to make yourself resilient in terms of human connections in your actual physical space to create alternative networks besides the one that are mediated by the state and by the banks and by all of these systems. Obviously, we can't avoid it. We're so caught into it, we can't avoid it, but we can at least be conscious and try to find other solutions to be more resilient as this is moving forward."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":1432.87,"end":1545.71,"speaker":"Paul Kingsnorth","text":"Yeah, and it's interesting that you mentioned the Benedict option, and that's, again, that's a sort of. It's a variation on things that have been happening forever almost. I mean, I like the idea of the Benedict option, but I was thinking recently that we also need an Anthony option. You know, people who are just going to go to the desert and live in caves that came first, the desert fathers. But, you know, also, you know, you could look back to the. Look back to the 60s and the intentional communities that were created by, you know, people broadly, I suppose, from the left rather than the conservative movement or whatever. But it's not, you know, you can look at that wherever you come from, wherever you place yourself on any spectrum, if they're even real things. Yeah, you can look at the system that's developing around you, and you're going to have to say to yourself, right, how can I best avoid this way that I can escape it. Whether that's a physical escape, which it probably has to be, I think, increasingly as much as possible, but also, you know, a spiritual escape. And I think that has to be about forming communities with others, you know, in some way and being, you know, even if there's a lot of value in even just online communities of people who think the same as you, but also, you know, practical, physical realities of places where people are gathering to do things differently. And, yeah, it's interesting that, as I say, you can be. You can be from any sort of. From a different perspective, from different place on the cultural spectrum, but you can see that that's very clear that that's what's going to have to happen. And that's almost, interestingly, it feels like a sort of invitation to recreate real community again. In places I think so anymore. And that's, you know, if you want to look on the bright side of all this horror we've been talking about, that's what it is. You know, it's like, okay, we've got to this point where this civilization is so inhuman to everyone who doesn't conform to its increasingly narrow kind of bandwidth of what you're allowed to say and do. You just got to get the hell out, you know, you've got to tune in, turn on and drop out, as the hippies used to say."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":1547.15,"end":1633.34,"speaker":"Jonathan Pageau","text":"But you're totally right. I felt we had the experience here where because of the measures and because of as the measures were moving towards church, especially, we're moving towards legislating who can go to church and who can go to church. Luckily, I mean, luckily, by the grace of God, our church passed the COVID test, because for some churches, I think some churches in Canada, they'll never get over what happened because those that impose the vaccine passport on their own members and were forced to have someone at the door checking you and knowing that if you can't pass this test, you have to go back home. I don't think those churches are going to survive. I mean, I think they might kind of coast for a while, but I don't think they'll ultimately survive their own spiritual decisions. But luckily our parish did, and for that, we are much stronger than we were at the outset of COVID and it was so hard. We lost our buildings because nobody wanted to rent to people anymore. And it was like this constant wheel of obstacles. But because of it, our parish has become stronger and more deliberate. And so I think that hopefully people can take that as and the same with even some friendships we have. It feels like we became way more deliberate about our friendships and about the connections that we have because we realize that everything else might be taken away, but this is the most precious thing."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":1633.86,"end":1697.12,"speaker":"Paul Kingsnorth","text":"Yeah, no, I had a similar experience, actually. I mean, luckily. I mean, I'm a member of the Romanian church here in Ireland. And so, you know, the Orthodox churches here are quite different, I think, from, say, the Catholic Church, partly because they're immigrant churches and so they sort of slightly operate under the radar. But it's, you know, it's a different. It's a different feel. But we didn't have. I felt the same that, you know, people, at the same time as people weren't discussing this in the church at all. I mean, people discuss it outside, but it wasn't something that came into the liturgy or something or into sermons, you know, vaccines or whatever. People had different, different opinions and who knows? But nobody was asking anyone else who was vaccinated. That never happened. I've never seen that. Nobody, you know, nobody cares. No one's going to make that judgment. And yeah, absolutely, you come out of that with a strong sense of what's actually real here and who's real and who is going to treat you like a human being. I've certainly lost friends over the writing that I did about vaccine mandates, especially a lot of my old lefty friends. They now think I'm. I don't know what they think I am, but I'm a right wing conspiracy."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":1697.12,"end":1698.16,"speaker":"Jonathan Pageau","text":"Theorist of some kind."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":1698.4,"end":1802.99,"speaker":"Paul Kingsnorth","text":"And that's it. I am a right wing conspiracy theorist. And that's very interesting to me because as far as I can see, I'm saying the same things I was saying 25 years ago on this subject, right? Aren't you the left? Aren't you supposed to be against the state power? Aren't you supposed to be suspicious of Big Pharma? Aren't you supposed to be suspicious of Big Tech? Isn't that the whole, almost the entire point of the left? How come you've allied yourself with these guys and I still cannot work that out? I mean, the trajectory of some people on the left who are now accusing people who are saying what they said 10 years ago of being fascists. I mean, I cannot get into my head quite what shift has been made there, but it's just part of the general weirdness of the whole situation. A lot of the people who used to spend their time raging against state power are radical authoritarians. Now they want the state to clamp down on almost everything as far as I can see. I've heard people who I used to think were anti capitalist activists arguing for the state to jail people who aren't vaccinated. It's a rabbit hole. It's a lot of different rabbit holes. And it is almost as if it's that invitation to escape from this is an invitation to get your spiritual and your practical feet on the ground again and say, okay, how can I get some sanity back here? And the more I look at, say, the Amish who have a very critical, intelligent relationship to technology, which is not just a blanket rejection, but is also not the kind of mindless, button pressing acceptance that we have in the west, the more I look at that and I think, okay, well, they've managed to survive for 400 years. There's something that works there, you know, whether or not you share their particular Christianity or Christianity at all. You can say there's a community that knows how to make itself work. So what are they doing that we could emulate even if we're coming from different places and traditions?"}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":1803.47,"end":1890.01,"speaker":"Jonathan Pageau","text":"Yeah, I've told people, I've always brought up the old order, Mennonites and the Amish for people who want to look at real functioning communities. I would think that when you look at all the communities that came up in the 60s, all of them, most of them just failed. I don't think if there's any that still functional. Whereas the Mennonite communities have hundreds of years of history and like you said, their approach to technology. People think that they just reject technology. They don't. What they do is they ask to what extent technology is going to serve or not the community. That's the only thing. That's what they ask of the technology. You'll find different communities come to different conclusions. Some will say, oh, we'll have one car for the whole community or a few cars for the whole community, and people will have to share it. And so therefore no one will be tempted to have all the problem with the car. And they're so right because the car makes you have friends. All your friends can be an hour living an hour or 30 minutes from you. And so you don't have community, you just have friends that you visit like this. And you know, I mean, that's what, that's where we are, that's life. But there's a manner in which that is obviously a problem that we don't. We're not friends with people that are friends with each other and that have to deal with the kind of communal. Not some of us are, but a lot of us don't have that, especially if we live in suburbs. We just have neighbors and then we have our friends that we visit. And that's really just the car that did that."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":1890.75,"end":1980.85,"speaker":"Paul Kingsnorth","text":"No, absolutely. I mean, I kind of cut my teeth as an environmentalist, as a, as an anti car activist. Actually back in the 90s, you know, I used to chain myself to bridges and try and stop roads being built. There was a big movement of that going on in Britain in the 90s. And that was one of the critiques, actually. You know, it's like this, these things, not only do they trash the countryside and the towns because you have to build motorways everywhere, but they're radically isolating. You know, you get in your car, you put your own music on, you go where you like. And that's kind of, you know, that's fun. It's the kind of liberation myth of the West. You know, it's like James Dean and all the rest of it. Yeah, Bruce Springsteen, get in your car, drive where you like. But you know, there's a consequence and there's, you know, it makes, makes me think there's a. There's a long standing Christian critique of technology that you'll get famously in people like, say, Wendell Berry, who's been writing about this for 50 years, about community and about technology. Ivan Ilyich is another one. Jacques Ellul. Jacques Ellul's books are terrific from a Christian perspective. His absolute critique of exactly what you're talking about. The system of almost the system of the beast, but the system of control and how this is all rolled out. And these guys were writing half a century ago that Wendell Berry's been writing since before I was born about this and he lives it as well. So this is almost like the ground has been prepared in a way by a lot of very smart people who could see this coming. And it's now here and it's going to accelerate. And so the question is, yes, how do you go and live that? And you know, the answer is going to be different for everybody, but it has to be. That question is going to get more urgent every week. Yeah."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":1981.09,"end":2031.47,"speaker":"Jonathan Pageau","text":"A funny story if you. It's a funny and sad story if you want to know how crazy the world has become. I was asked to talk at the Jacquelo Society this summer here in McGill by some of the prominent members of this society. And I didn't even know what was going on. It caused a massive controversy and then a massive problem in the society. And it went up all the way to the president of the society, supposedly because I'm. Supposedly I'm a notorious anti vaxxer. And I thought that's hilarious. I mean, I don't even care about the vaccine. I always. I've been saying from the beginning that my issue with this has very little to do with what they're injecting into me. It has everything to do with the system of technological control, which is. Which is. In which it is wrapped. And I thought so the Jacqueline Society won't let me speak there, you know, and they're supposed to be Christian anarchists. It's just hilarious."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":2031.63,"end":2241.9,"speaker":"Paul Kingsnorth","text":"That is quite something. I wonder what Jack and Lil would actually have thought of that. I think you've had a lot of things to say about vaccine passports. Yeah. And it's exactly, exactly that point. I mean that the writing that I did about the vaccine system was, was talked about in exactly the same way. You know, this is anti vax writing, which it wasn't. I don't care whether anyone's vaccinated. You should be vaccinated if you want to be. Again, it's about the system of control that is connected with it. And that is something that plenty of vaccinated people are concerned about. Right. This is not an issue of good, vaxxed or bad, unvaxed or vice versa, but because of this insane tribalism where people are just looking for an enemy and not listening to any of the nuances. It's almost as if, as you said earlier, people aren't really concentrating on what's going on. You know, I think because people, a lot of people anyway, certainly in the ones who are really in the political, ideological trenches, are so obsessed with destroying their enemies, whoever they think their enemies are, they're not paying attention to the bigger picture, which is that whoever you are, whatever wing of the spectrum you think you're on, you're going to have to do what this thing says. You're going to have to conform to this machine. And it could take any number of different shapes. If you think that nice Mr. Trudeau is using his emergency powers. Well, and that's all right because you're a liberal like him now, wait 10 years and see if Canada gets a very right wing government which starts using them against you. Do you not see that possibility? Of course, anything could happen once the, once the system is closed around you, which is one of the points that Jacques Yellow made endlessly. You know, it doesn't matter who you are, you're going to have to be, you're going to have to conform to this world, as St. Paul would put it. So how are you going to not conform to the world? And that's a, it's an interesting spiritual question as well as a practical one. You know, and I think that's the root of it because as you said before, actually a lot of the sort of idealistic communes that were set up in the 60s, most of them collapsed. And Jonathan Haidt did some writing about this a few years ago. He quoted a study on this. And any community, any intentional community that was set up over the last 50 years or so in the west that survived, almost all of them were religious. So they, you know, they may or may not have been Christian, but people came together with a higher aim. And their higher aim was to serve God, to do whatever spiritual work they thought they had to do. The ones that Fell apart were the ones where lots of kind of idealistic individualists came together to change the world and then fought each other and then slept with each other and then the whole five minutes. But the ones that survived, and still survived till today overwhelmingly have a higher aim. They have a spiritual aim, which is a lesson, you know, because just having a community in sense of being in a place isn't enough, unless you think you're doing something that is more significant and important than politics or anything worldly, actually. So that's that. The thing that interests me now, and I don't know the answer to it, is maybe you can answer it for me. What's the. What's the. I'm hoping so. What's, you know, what's the. What's the. For a Christian, particularly, what's the spiritual response that we should have to this? I mean, we've talked about sort of Benedict option in a practical sense, you know, going to a place and forming a community. But you know what? This. I'm interested in this one and it's question, how do you live? Because, you know, you can do what I've done to a degree. I live on a small holding out in the country and I have friends around me who are similarly kind of alternatively concerned about the thing, the machine. And so we try not to participate too much. And I don't have a smartphone, I don't have a tv, so I'm sort of on the edge of it. But you're still in it all the time. It's still all around you. You can't not engage with it. So the question is, what's your spiritual work? How do you. How does that manifest in your life? I suppose."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":2242.14,"end":2343.64,"speaker":"Jonathan Pageau","text":"Yeah, I mean, I think. I definitely think that first of all, just being intentional is the first step for most people at least, understanding that that's going on. And now being intentional about your choices and about the things that you attend to, you know, most of it, I think has to do with hierarchy and. But it's hard because. It's hard because these technological things, they. They're made to basically devour your attention. They're made to take it all up. But. So I don't, obviously, I don't think that there's anything wrong. And to a certain extent, I think Christians will always have to somewhat engage with the system because we're not. I don't think Christians are, unless you're really a monastic. But even monasteries are never isolated completely. There's always a sense in which we're also meant to radiate in the world in terms of example and in terms of patterns. So I think the best thing would be to be deliberate and to be hierarchical in what is your priority. And so make sure that your family, that's the. You know, your family is the priority. Your communities are the priority. Create deliberate relationships with people around you. Work towards alternative systems, but not be, I think, being wise about it. You know, Christ said, be innocent as doves and wise as serpents. And I think this is. Right now is the time to do that. I made a video about King David and how King David escapes the tyranny of St. Paul. About St. Paul. That's hilarious that I said that of King Saul. Freudian Smith, because Saul becomes Paul in his own story. So I get St. Paul. Like, that's the problem with symbolism is when things connect in your mind. Too much."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":2343.64,"end":2344.48,"speaker":"Paul Kingsnorth","text":"Too much symbolism."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":2345.12,"end":2394.88,"speaker":"Jonathan Pageau","text":"Too much symbolism makes you say that King David is escaping St. Paul anyways. So King David tries to escape the tyranny of King Saul. And by doing that, he becomes everything of the margin. He associates with these debtors and thieves. He lives in a cave. He pretends to fight for the enemy of King Saul. He feigns being crazy. He does all these things that are completely. Look like he's a strange, shifty character. And so I think that we have to start thinking that way. We have to not be naive about things, but understand that we also have to be shifty at this moment and be able to be able to navigate with some trickery, you know, the world that is laying itself in front of us."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":2394.88,"end":2396.92,"speaker":"Paul Kingsnorth","text":"Yeah, yeah. It's a trickster moment, isn't it?"}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":2397,"end":2397.56,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":2398.04,"end":2514.6,"speaker":"Paul Kingsnorth","text":"And there's an issue of just trying to be in the world but not of it. Which is the thing I keep coming back to all the time. It's very interesting. I've been reading a lot about the desert fathers, the early ascetics recently. And what's interesting about so many of them, so many of the saints who go off to live in the desert, including Anthony himself, they go off for a period of time, but then they're called back again. And it's interesting, actually, you know, it's St. Anthony. In St. Athanasius, Life of St. Anthony, he talks about Anthony spending 20 years, you know, first in the tombs and then in this ruined fort, hiding from everybody. And eventually people just break in and force him to come out. And he kind of walks out and he says, Athanasius says he'd been initiated by God. Right. So he'd been through this enormous training period. And then he came out and it was like he was ready to teach now. So he had to teach and he had to go and do his work in the world, whether or not he wanted to. And any other number of saints, from St. Cuthbert to St. Colman here in Ireland, have the same thing. They spend their time living in caves or on islands. They try to escape, they do their work, but then when they're ready, they're brought back in again. So it's almost like there's a balance between the desert and the town, really. You have to get that balance between the world and the kingdom, right? Even if you're certainly not ever going to be a great saint. And so maybe that's. I keep looking for the challenge in the moment, right? The challenge in the time. What is it that we're being offered here? What are we being shown? Why is this happening? What's the challenge for us? And maybe that's what it is. What's the balance between the world and the kingdom that you have to somehow achieve? And as you say, it's a dance, isn't it? It's a kind of daily dance to try and not get consumed literally by the machine. But at the same time, you know that you can't walk away from it entirely wherever you go. You can get a 5G signal in the Amazon now. There's no escape from it. You can go to the Arctic. You still require a vaccine, passport, apparently, to go to. Yes, I've heard about that research station. So there's no escape. So is that balance all the time?"}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":2515.25,"end":2527.01,"speaker":"Jonathan Pageau","text":"So how is this. Because, I mean, I've been following, really, your substack and the articles, but are you working on any fiction right now? Has this been kind of informing your own fiction writing?"}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":2527.17,"end":2629.69,"speaker":"Paul Kingsnorth","text":"Well, I'm not. I've got the paperback of my novel. Alexandria is coming out in May in Britain. It's already out in the States, actually. That's a novel which is exactly about all of this. I find that what I do is I tend to write the same thing in fiction and nonfiction. I write a novel and then I write the same thing in nonfiction or the other way around. For some reason, I can't get the things out of my head. And so that book is an examination. It's set a thousand years in the future, and it's an examination exactly of the kind of the battle between the body and the machine, which is what this is coming down to. This is coming down to a kind of gnostic machine culture in which we upload our minds and live forever, supposedly, versus a kind of rooted bodily humanity, which is, again, I think you could probably trace right back to Cain. You could trace it right back to Adam and Eve, actually. You're going to follow. Is it thy will be done or is it do what thou wilt? You know, those are the kind of two extremes I keep seeing. So that's the. I mean, that's coming out. But that's a novel I wrote before COVID actually, so I haven't. I'm not writing anything else at the moment, apart from these essays, because they're all consuming, to be honest. Just too consuming sometimes. I'm working my way through what this system is, how it came about, how it's manifesting today. And then the final part of the series, which I'm going to be starting, I suppose, in a few months, is the conversation we've been having now, really, how do we live through this? What are the kind of practical responses we can have? And it's been a really interesting project. Not just the writing, but the conversations with some of the readers. You know, there's some really smart people, and some of them are quite intimidating. They're much cleverer than me, which is great because they tell me things I should be reading and things I should be seeing. But it's that, as well as the state of the world has helped to sharpen, kind of how I'm seeing feels."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":2629.69,"end":2679.31,"speaker":"Jonathan Pageau","text":"Like there's an interesting watershed moment that happened, I guess around the time of the trucker convoy where there are certain things that no one was allowed to say or very few people dared say before. And then all of a sudden, public figures were starting to talk about things that no one was allowed to talk about. The World Economic Forum, and I imagine when you did in your. In your essay, people came after you saying conspiracy this, conspiracy that. But all of a sudden that seems like that watershed is. That's. That's happened. And so now, you know, you see Majid Nawaz on Joe Rogan talking about. You find people, you know, Jordan Peterson has been talking about it. So you see people mentioning it now in a way that is just more realizing, wait a minute. This is not. There's no. There's no hidden conspiracy. They're just telling you what they're going with, what they want to do, and they're showing how much power they have. Like, there's nothing hidden about it. It's just there."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":2679.87,"end":2715,"speaker":"Paul Kingsnorth","text":"No, it's fascinating that, again, this is another one of these political kind of weird things that's Happened when I was an anti globalization activist 20 years ago. You know, we were all protesting against the World Economic forum and the G8 and the WTO. That was what the left did. It was what the anarchists did. Right, of course you do, because these are the global power structures. Now, apparently mentioning the same thing makes you a right wing conspiracy theorist. And again, you know, I read Klaus schwab's book on COVID 19, which is called COVID 19, the Great Reset. It's a very boring book. It's not at all disappointingly dull actually. But you know, this, this is not a conspiracy theory. It's a very, very clear."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":2715.4,"end":2717.16,"speaker":"Jonathan Pageau","text":"It was on the COVID of Time magazine."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":2717.24,"end":2717.76,"speaker":"Paul Kingsnorth","text":"It was."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":2717.76,"end":2721.32,"speaker":"Jonathan Pageau","text":"They had a Time magazine saying the Great Reset on the COVID Yeah, I."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":2721.32,"end":2759.48,"speaker":"Paul Kingsnorth","text":"Mean, it's like an agenda, it's a program. These are the most powerful guys in the world. They love global capitalism. They want to roll it out. Here's the plan. You can like it or lump it. To be fair to Klaus Ferrari, he's very open about it. He's got a website. This is not doing stuff under a volcano. This is very clear. These are the powers of the world. People used to know that the left used to know that the activists used to know. I don't know why it's been left to the likes of Joe Rogan to have to talk about it when all of the people who used to be anti capitalist have suddenly decided it's fine, it's a mystery. But yeah, it's very, very open. And as you say, people are now just talking about it because you can't not talk about it. It's very clear what's going on."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":2760.28,"end":2761.16,"speaker":"Jonathan Pageau","text":"One of the things that."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":2762.04,"end":2788.92,"speaker":"Paul Kingsnorth","text":"It's like the tip of an iceberg, that Klaus Fab is just a sort of useful whipping boy because he's kind of naive enough to put his ideas on paper and put them out there. So everyone goes for him as if he was a kind of ringleader. But he's just a manifestation of the system that exists and he thinks it's a good thing. He thinks it'll be great once the world is managed in this way. And this is what's going to save the planet. And seems to me there ought to be a discussion about that without the conversation being removed from the Internet."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":2790.12,"end":2836.44,"speaker":"Jonathan Pageau","text":"To see what happened is not that difficult in the sense that someone somewhere realized, or maybe it just organically appeared that if you made a gesture towards that part of the system we talked about, which is you can be whatever you want, you can self identify you can that all identities have. All these marginal identities have value. If you can gesture to that, then people will give you all the control you need on this side. It's a weird game. So Justin Trudeau says our only value is inclusion. That's what he said. He said our only value is, as Canadians, our only value is inclusion. And so it's like if he does that, then you can close down people's bank accounts."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":2837.64,"end":2954.82,"speaker":"Paul Kingsnorth","text":"Yeah, well, it's interesting. I mean, I think that the way I'm understanding it is that, as you say, that there's a kind of ideology of borderlessness that really is about that. It appeals to a lot of people on the left because they think borders are oppressive, which sometimes they can be. It appeals to capitalists because borders get in the way of the free flow of movement and labor. It appeals to Klaus Schwab, who's a kind of globalized ideologue who wants a one world system. So, as you say, you can get a lot of people on board by gesturing towards the notion that all borders and boundaries are bad things. So there are no borders, there are no boundaries, there are no limits. And once you start to say there are no limits, then you're back into the technological system again, because the technological system fundamentally says we are going to use technology to liberate you from nature, including your human nature. And that's why, you know, the guys in Silicon Valley are very, very open about their project that we're all going to end up living forever. This is how it's going to be. Well, the oligarchs are. And I don't know if the rest of us will be able to afford it, but most people, they certainly will be. And that, again, is this kind of gnostic project of borderlessness. No borders, no boundaries, no limits. No natural limits, no political limits, no cultural limits. All limits are bad. All borders are bad. All boundaries are bad. And that's a project that a certain type of leftist and a certain type of capitalist and a certain type of political ideologue of different stripes actually can get on board with, because it's about busting through boundaries. It's about saying, yeah, we can define anything in any way. We can define our gender any way we want, our society, we can define nature any way we want. We can redefine death or abolish it. All that's left is the kind of the will. It's the will to power. Anything that you can imagine, you can do. And so you start to see this system of being created which simultaneously tells us There are no limits to anything. At the same time, controls us in a way that we've never been controlled before. And it's a. It's a. It's a sinister combination. Yeah."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":2954.82,"end":2986.13,"speaker":"Jonathan Pageau","text":"And liturgically, you could say, in terms of actual religious manifestation, embodiment. What we can. We saw during COVID is the final result of that, which is the isolation of individuals, the absolute isolation of individuals from each other. And, you know, the masking and the cutting off, the social distancing, you know, it ended up being. Narratively, it ended up showing us what that world looks like, how this world of like, infinite will to power in the Metaverse is basically a world of complete self isolation from others, isolated individuals."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":2986.13,"end":3088.36,"speaker":"Paul Kingsnorth","text":"And they're sitting there. There's a terrific famous photograph, I'm sure you've seen it, but one of Mark Zuckerberg's events when he's running the setting up his photo metaverse, and there's this room full of all these kind of guys with their headsets on, and Zuckerberg's just walking, walking down next to them, looking very smug. And you think, there's the future. Everyone is utterly isolated here, utterly isolated, but theoretically all in the same place in this, which isn't real, but they think it's real, or they pretend that they do. And there's kind of Zuckerberg, the oligarch, looking very happy about this. And it is a recreation of the world in which you're utterly isolated, staring into something that's fake, but you have an illusion of togetherness which has replaced the real togetherness. And the new illusion of togetherness is profitable. Absolutely. Every aspect of it can be milked for cash, everything can be milked for money. Everything is tracked, everything is monitored. Unlike a real community, which is not profitable at all, except on a cultural and spiritual level. If you're living in a real family, in a real community, in a real place, not very much can be monetized, not very much can be turned into a consumer good and sold back to you, because those are not your values. So we take everything human, we destroy it, we monetize it, and then we sell it back to people as a kind of fake digital community. And if they don't like it, they can have their bank accounts taken away. There's your system, there's your system of control. The disturbing thing about it, you can look at Zuckerberg's film of the Metaverse, good example, is how many people seem to think this is just going to be great. There are a lot of people who are really up for it. And in some ways, it doesn't have to be imposed. It has to be imposed on those at the margins who object to it. It. But for a lot of people, it can just be sold to them and they seem to like it. And that's the most disturbing thing to me."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":3088.6,"end":3123.6,"speaker":"Jonathan Pageau","text":"Something happened too, in terms of narrative. You can see it in the shift between the Matrix and Ready Player One. The aesthetics of the Matrix as the system that has to be resisted, as the system that has to be escaped, got replaced by Ready Player One, which is who controls the system. That's all that matters. That is, it's not that you can try to limit its power. No, it's all encompassing. It takes up all of your attention. And it. It is the most powerful controlling thing. It's just. The question is, who is going to control it? And the last Matrix movie, which was horrible, by the way, but I watched anyways because I wanted. Because I had a."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":3123.6,"end":3126.16,"speaker":"Paul Kingsnorth","text":"Anyway, you watch these things so that we don't have to."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":3127.12,"end":3154.78,"speaker":"Jonathan Pageau","text":"Because I had an intuition that the new Matrix movie would be something like Pro Matrix. Like it's Pro Matrix, but pretends to be rebellious nonetheless. And it. It was kind of like that. I'll spoil it for everybody. It doesn't matter. It ends with like. It ends with Neo and Trinity. Trinity taking over from Neo and becoming like the man in the relationship, you could say. And then both of them becoming heads of the Matrix, basically saying they're going to steer the Matrix in the direction that they want."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":3155.18,"end":3179.28,"speaker":"Paul Kingsnorth","text":"And I was like, wow, that's fascinating, isn't it? I was thinking to myself idly today that if they made a version of the Matrix, now Agent Smith would be the good guy. He'd be misunderstood. And. Yeah, no, that's very interesting because the other thing I think about endlessly is the Ring of Power. You know, Tolkien again, he keeps coming up and to try and control the Matrix for good is the equivalent of taking the ring to use it."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":3179.28,"end":3180.12,"speaker":"Jonathan Pageau","text":"It's exactly that."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":3180.28,"end":3269.41,"speaker":"Paul Kingsnorth","text":"You know, it's like. And what's so interesting about that is that of course, the wise people, people like Gandalf, they know you can't even touch the ring, right? It's the foolish and the ambitious ones who think you can take it. It's the humans and the twisted wizards and you have to use the Hobbit because the Hobbit, the Hobbit is so kind of naive and innocent that it's possible for him to touch this thing. But no, we're in the world in which we all think that we can take the ring and use it for our own good or we can control the Matrix. You're right. And that's been the shift for the last 20 years. And that actually has been the shift perhaps on the left as well. It's certainly been the shift in the green movement that I used to kind of run with. The green movement 40 years ago was being directed intellectually by people like Ivan Ilyich and Jacquelo and when or Berry. It was a movement of people who said, look, we've got to get out of this machine and we've got to rebuild community and have a relationship with nature. Because that's how you protect nature. It's by living with it. Right. And caring for it. It was human. It was about the human scale. And that was always what the old Greens were about. And the new Greens are about as many wind farms as possible, as many solar power stations as possible, as much technological control as possible, as long as you use it to create a sustainable system. So it's exactly the same narrative. Take the ring and use it for good. Control the Matrix. Don't worry, it'll be fine. This time the good guys are running the huge control system, so that's all right. It is like an endlessly repeating system. It's a Tower of Babel story again, isn't it? That we talked about last time you stuck. Don't worry, we'll just, we'll all get together and build this thing and it'll be fine."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":3269.65,"end":3357.34,"speaker":"Jonathan Pageau","text":"It'll be totally, it'll be totally fine. But I mean, we know the story. We know that this, we know even by the very nature of these systems that they are increasingly fragile. There's no way around it. That's what they are. Because they also, because even the notion of the metaverse is if you, you can understand how fragile they are. Because the identity of your, your, let's say your supposedly self willed identity in the metaverse is nonetheless extremely contrived within the parameters of the metaverse. People, I mean, I guess people, your embodied existence is so. It has all this breathing space, you know, in its, in its experience. You have, I mean, and you, I'm telling you that because in your books that that's what you also are constantly bringing up is that these experiences, that almost even normal day experience, like drinking water or putting on a shirt, like these experiences have an infinite complexity in them. They have a kind of infinite richness which gets completely stunted in the digital world by the very fact that the parameters are limited in the program. And so there's a sense in which that's an image of how these systems cannot, because a human person cannot be fully contained. You just can't. You cannot contain an identity completely. It's impossible by definition. And so trying to do that will ultimately lead to fragility and a shattering. At some point. You cannot. It's not possible."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":3357.93,"end":3487.2,"speaker":"Paul Kingsnorth","text":"No. Well, and that's the hope, actually. You know, God is. God is not mocked. That's. That's the hope. You can't. You can't contain the human, you can't contain nature, you can't recreate it, however clever you think you are. And everything is. It's all built on sand. I mean, you can, you know, these things will rely on the power grid to operate, right? They all rely on fossil fuels. They all rely on the enormously complex grid of civilization, which is destroying the natural world and undermining its own kind of cohesiveness at a human level as well. So it isn't, firstly, it can't be contained. You actually just literally cannot reproduce nature as much as you think you can. And secondly, it's coming apart already economically, ecologically, culturally. It's undermining itself by attempting to do this. Which is why, interestingly, I think if you compare our moment to, say, the 60s moment. So the 60s, you've got this huge counterculture. And if you look at the sort of the. The cultural stories that are coming out of the 60s, they're all about optimism, right? We're going to. It's the age of Aquarius. Everything's going to be great. We're going to smash the shackles, we're going to get rid of the limits. We're going to. We're going to. It's going to be free love and etc. Etc. Didn't really work out. But the stories now that are coming out even from the supposedly countercultural movements are all stories of, let's see if we can get the hell out of this collapsing system. So, you know, what is. Jeff. What does Jeff Bezos and. And these guys offer us? Elon Musk. They offer us a life on another planet because we've basically ruined this one. You know, don't worry, we can build bubbles on Mars. We'll live in them. We'll go off and live in space. Or you can live in the metaverse. We'll create another world rather than trying to live in this one. And that's what it comes down to with all of these guys. The new ideology. It's gone from this is the age of Aquarius. We can create a utopia here, you know, to. Okay, that was a disaster. Nevermind, literally build another world and live in that one. You know, we'll either live on the moon under domes, or we will live in the Metaverse. It's almost like we've given up on nature. We've given up on human nature, we've given up on culture, we've given up on everything human and real. And we're going to allow the likes of Mark Zuckerberg or Elon Musk to build us a new kingdom. It's a twisted religious story of transcendence, basically."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":3487.44,"end":3582.58,"speaker":"Jonathan Pageau","text":"And there's something, I think there's something also about how, let's say the physical world or the embodied existence it creates, it sets up a certain amount of limits that frames your experience in a way that is just. It's unacceptable to a lot of these, of the ideologues. And that's, I think, part of the problem. Right, because it's not true that. I mean, you can pretend we're seeing the problems of that. You can pretend that you can self identify as anything, you can do that. But it's going to look very odd. It doesn't look odd in the metaverse because you can just basically change your avatar into whatever you want. And so in the metaverse, you actually can just be whatever you want and nobody will know that you're something else. But there's a disjunct in reality, which is that this world imposes limits. They impose kind of these sacred limits to the possibilities of different identities and how they interact with each other. And I think that that's even in the technological problem project itself and this kind of fetishization of technology and pushing the limits further. There's something in which the notion that the, you know, it's like you, you want to put pork jeans in tomatoes. And it's not even that, it's just, you really just want to do it to show that you can break down the natural, you know, identities and the natural things that exist in the world. It's like, it's almost like it is like a will to power. But in the, in the physical world, it always will be limited. You know, it'll always, always be contrived. And so Metaverse is the great, the only solution in the end to their ideology."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":3583.14,"end":3730.78,"speaker":"Paul Kingsnorth","text":"It's playing God. I mean, quite literally. And I always come back to the eating of the apple. It's, you know, what's the offer here? What's the offer? Well, you can either live according to the will of God, according to the dao, according to the way of things, and you can achieve a theosis in the end. You know, you can be raised up, or you can say, well, you know what? I think I'll walk away from that. I'll individuate and I'll be God myself. I'm going to choose power over communion effectively. And that's the oldest story. And I always talk about this thing I call the machine as a effectively. It's a machine for destroying limits. That's fundamentally what it does. It is the thing that unites all these supposedly disparate strands of politics and economics at the moment, which is. None of these people believe in limits, and they don't think there should be any limits. And any thought of being limited, limited is an outrage increasingly. You know, it's. It's crazy. It's dangerous. It's. It's, you know, whether it's limits around your nation or whether it's limits to your. The length of time you can live, or as you say, limits to what you can identify yourself as, limits to what your culture can be, limits to the. The amount you can exploit nature. All of this is, you know, those limits should just not be there. We don't. We don't think that's fair. It's a. It's almost an injustice to be limited. It might be that this is kind of the final phase of liberalism, and liberalism being a project that tells us that we can break through limits. You know, many of, you know, and part of that has been beneficial for us, but it's almost kind of metastasized into a project that doesn't understand where true limits are. Because the battle. It seems to me that in any sane society, you've got a balance between limits and, you know, the need for limits and the need for freedom. And as you've said before, you know, the balance between the margin and the center, and the balance has to be there. You can't have a society that's too centralized and controlling. You can't have a society that has no limits on anything. Otherwise you haven't got a society. Right. So you've got to achieve that uneasy balance. And we've gone to the point in all sorts of ways now where the aim of almost everything at the head of our culture is the destruction of all limits and all stories and all boundaries and all borders and anything that gets in the way of whatever we think is going to somehow make us fulfilled. We don't even know what that is. Right. We don't know what the aim is. It is almost like it is like a broken technological version of a religious story. You just use your own technological power to effectively get to heaven and live forever rather than doing anything that requires you to question anything or break it down again."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":3730.94,"end":3759.34,"speaker":"Jonathan Pageau","text":"Yeah, and the deal ends up being that ultimately we end up serving the machine. That's the secret deal. It's, that's the, the secret that the genie isn't telling you is that ultimately it really is like a bad horror story or some old legend about, you know, something, some witch offering you, like a cookie, offering you something that will give you some power, but then ultimately become a slave of, become a slave. And I think that that's what to."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":3759.34,"end":3783.56,"speaker":"Paul Kingsnorth","text":"Be a battery in the Matrix, don't you? I mean, that's why that original story was so good. It's like, hey, you know what you are? You're just a battery, you know, and you think, you think you can live forever. You know, you're actually in a pod halfway up a tower being, being siphoned for your electric current is a horrible image. And it's, it's such a resonant one because it's kind of true. That's, that those original films worked because they channeled something that probably the filmmakers didn't even know they were doing."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":3783.8,"end":3791.64,"speaker":"Jonathan Pageau","text":"I think that's what I said. I think they, the, they made that movie and then spend the rest of their life trying to kind of undo or deconstruct their own movie."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":3792.15,"end":3810.55,"speaker":"Paul Kingsnorth","text":"I think they did because they'd shown that was such a powerful set of images disguised as a kind of kick ass kung fu movie. You know, it was basically like, here is modern life, this is what it is. And everybody kind of knew it. So when you saw the images presented like that, you just thought, oh my God. And it's. Yeah, as you say, they can't, they can't undo it once they've done it."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":3810.63,"end":3889.21,"speaker":"Jonathan Pageau","text":"And there's a way in which that, you know, McLuhan talked about how we're becoming this, the reproductive organs of the machine, like that basically the machine needs us in order to reproduce. But what I realized is that opposite from what we see in the Matrix, we're actually being farmed for. Intelligence is what we're being farmed for. So it's taking the highest aspect of humanity and then somehow making it into a resource. And so we're there to give intelligence to this thing. We're there to make Google intelligent because machines don't have intelligence on Their own. They need to farm it out to humans, gather it up into algorithms, and then use it to turn it back on us. But ultimately, we're providing intelligence and we're doing it by attention. It's really religious. It's like, do you want to know how a God was born in the old world right through our attention, and are giving our intelligence to this thing? Then it is becoming more and more alive and more and more salient and coming back down on us and imposing itself through its different parameters, through its rules, through its framing of our reality. So it's a very, very disturbing trade that we're participating in."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":3889.21,"end":3995.23,"speaker":"Paul Kingsnorth","text":"Yeah, it's like creating an egregore, isn't it? The disturbing thing about it is that in Silicon Valley, there's a lot of guys who are very conscious of this, and this is their religious welfare. You. I talk often about this book called what Technology Wants by Kevin Kelly. I don't know if you've read it, but it's a really good book. If you want to know how these guys are thinking, you should read that book. It's a few years old, and I wrote an essay about it a while back, and Kevin Kelly's one of the. I don't think he worked for Google, but he was certainly right in there with the Silicon Valley lads. And Kelly's book precisely says this. He says, look, this system that we're creating, which he calls the technium, not the machine, but it's the same thing. He says. He says it's using us to create itself. So it's a really interesting book because it's almost a very sharp critique of the machine that you might expect to say, get from someone like Ell, except that Kelly thinks it's good. Right? So he fundamentally is saying, you know, because you get a lot of critics of technology, and then the counter critics will come along and they'll say, oh, no, no, technology is neutral. It's just what you do with it that counts. You know, you can use it for good or use it for bad. And Kelly says, no, that's rubbish. Technology is not neutral. It has an agenda. It's going in a certain direction, and it's using us to create itself. And this is going to be terrific because what we're basically doing is building our evolutionary replacement. Okay? And this is what these guys are really up to, and they're very open about it. Again, it's like Klaus Fab, though. They're not. They're not hiding anything, Right? They genuinely believe, in a very mystical sense, in A very religious sense that they are creating a new world with a new consciousness in it. And maybe they are and they're trying to manifest a new consciousness through this stuff. So as you say, Google is not just a thing that helps you to find stuff that you're interested in. It's a collection mechanism that's been created very deliberately to do that. And again, that was very open."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":3996.19,"end":4018.07,"speaker":"Jonathan Pageau","text":"Yeah, but it's not going to be an old, it's not going to be a new consciousness. It's going to be a very, very old consciousness. Like a bad, like a bad, like a bad, you know, fantasy narrative where, you know, an old God is buried in the ground and then you finally unearth it and it comes back. We'll be staring down Azazel in no time now."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":4018.07,"end":4092.74,"speaker":"Paul Kingsnorth","text":"Actually, funnily enough, that was sort of the plot of my novel, or at least the conceit of it as well, is that, you know, what you think you're raising is not what you're raising, but you are raising something. And so on one side you've got critics of technology like El Al or Wendell Berry who can see what's coming. On the other side you've got the Kevin Kelly's and the Mark Zuckerberg. They can see what's coming too, but they think it's great. They're trying to create it and then in the middle and lots of other people who are just going, oh, you know, it's fine, it'll be right. Or I don't really like it, but I don't know what to do. That's most of us, we're stuck there. Whereas on these guys are deliberately creating a very particular world and it's manifesting very fast. I mean it's. If you, if you're not disturbed by the armed robot dogs which are already in operation, then I don't know what to say to you. You know, where do you think this is going to? Where do you think it's going? It's. Yeah, that's, that's what's coming very fast now. It might even be, if you want to talk about it, kind of mystically or spiritually that we can somehow sense this thing being born around us. And that's part of the confusion of the moment. Yeah, Something else is in control at this point and it isn't really us anymore. These systems have outrun us. You know, the machine is much bigger than us and to some degree it's starting to not need us as much as we thought it did."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":4093.06,"end":4162.31,"speaker":"Jonathan Pageau","text":"Yeah, but there's A manner in which that is technically easy to see because as the system rolls out and as it becomes more and more apparent what direction is going, in order to remain relevant, you have to compete in order to be of those that help the system attain its goal faster or else you're going to lose power in the system. So all the governments are all competing about who gets that digital ID first, who gets to digital currency first, all of this. They realize if you fall behind at this point, then you're going to be left back in this thrust. So the system itself seems to be, like you said, kind of creating itself through our desire to participate in it and our desire to not be on the margins of it. And so it's, you know, it really is all like. Elon Musk is an easy vision of that where he consciously said it. He kept warning, warning, warning, and then realized, well, okay, well, I guess these warnings aren't being heard. So I need to now not get left back and I'm going to create a neural chip in your brain that's going to connect you directly to the Matrix."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":4162.47,"end":4175.29,"speaker":"Paul Kingsnorth","text":"Yeah, yeah, I know. I've never quite been able to work him out, actually. I don't know what's going on with Elon Musk. He's in very strange character. You never know quite what side he's on, do you? But, yeah, in terms of what he's doing, it's very clear which direction it's going in."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":4175.69,"end":4188.25,"speaker":"Jonathan Pageau","text":"I mean, he has a very disturbing humor about it. You know, Starlink is very close to Skynet. I mean, it's basically taking the same words and just changing them a little. Like, what's the difference between Starlink?"}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":4189.53,"end":4217.96,"speaker":"Paul Kingsnorth","text":"It's like the guys who thought. Presumably either they thought it would be funny or they have no idea what's going on and they decided that it would be a good idea to put your scannable vaccine passport chip in your right hand. You know, to literally put it under the skin in your right hand, which is already happening in parts of the world. It's like, okay, hang on. We have a mark in our right hand through which you need to buy and sell. Is this an elaborate joke or is this something very much worse? What's happening here? You know, which came first, the prophecy or the guys who thought it would be funny to joke about the prophecy? Yeah. Does it matter?"}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":4218.6,"end":4267.76,"speaker":"Jonathan Pageau","text":"No. Yeah, yeah, it doesn't matter. It seems. But it does seem like Christianity. This is part of the story. This is all supposed to happen somehow. We're not supposed to participate in the scandal but the scandal will happen. This is going to manifest, and we need to be attentive as it's happening and not be naive about what its implications are. Especially for me here in Canada, when they imposed the COVID passport for church is when. Then I started screaming at the top of my lungs, like, okay, now there's no. I cannot, I cannot be silent about this anymore. This is now really reaching in the level that is apocalyptic. So we have to not be complicit as much as we can in this."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":4268.88,"end":4394.84,"speaker":"Paul Kingsnorth","text":"Well, that was the same for me as the vaccine passport system. Up until that point, I'd been thinking, okay, well, maybe this all makes sense. I don't know. Who am I? I'm not a virologist. I'm doing what I'm told. But it was very clear that what was happening with the passport system was nothing to do with the science behind the vaccines. It was nothing to do with the science behind the virus. And it was very much about coercion. And the fact that, as I say, everything kind of clicked into place. You had the state, you had the corporations, you had the media, and they were all going down the same track without any dissent. And it was extremely disturbing. And you didn't have to know exactly what was going on to scream at the top of your voice and say, this is wrong. But then, of course, as soon as you did, you were called a crazy conspiracy theorist who thought that lizards were running everything. But again, it's that sense of, you just know there is something very bad happening here when this kind of stuff is just being rolled out and we're okay with it. And it continues to be rolled out. As you say, the digital currencies are coming, the global digital IDs are coming. The ability to shut people's bank accounts down is already here, but it will get much easier when that stuff happens. And yeah, at this point, if you haven't seen what's unrolling, you need to wake up very quickly and then work out what you're going to do about it. Because it's not going to be. It's supposed to be a system of total control. I don't think it will be because I don't think it will work and I don't think it can last. It's too ambitious. It's not going to be able to be rolled out around the world, but it's going to be rolled out far enough that it could do. It's going to do tyrannical things. And the disturbing, the really frightening possibility is that some of the things they're trying to create in Silicon Valley will work. You know, some of these artificial intelligences will come about. The giant system which barely needs any human interaction at all will be able to work. And that's the name of the game that's very much on the table. So, yeah, you need to think hard about whether your option is Benedict or Anthony or anything else. You know, I don't know. But, yeah, that's where we are, I think."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":4395,"end":4398.28,"speaker":"Jonathan Pageau","text":"Yeah, I'm going for the King David Ronin option right now."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":4398.68,"end":4404.52,"speaker":"Paul Kingsnorth","text":"Yeah. Yeah, you need a list of different options that people can contribute to. You know, I think it's. That's the way forward."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":4404.76,"end":4448.86,"speaker":"Jonathan Pageau","text":"Yeah, but there's an interesting. Like I've been playing with the image of the ronin. Like there's this interesting story in Japan they called the 47 Ronin, about a master that was wrongfully, let's say, lost his honor wrongfully. And all these Ronin spend 50 years, like, I don't know, years and years preparing for their revenge. But in doing so, some of them have to fall into all these states that look completely dissolute. You know, someone becomes like, you don't. Not sure if he's really a drunk or he's pretending to be a drunk, but like, there's this fall into these states of hiding and of end of trickery, let's say. So I think that at some point that's the. This is the situation. We have to be wise. We have to be wise like serpents."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":4448.86,"end":4537.53,"speaker":"Paul Kingsnorth","text":"So, yeah, and I think we can't afford to be respectable either. You know, I mean, that's the other thing. I always come back to this. I mean, Christ was not respectable. None of his disciples were respectable. St. Anthony was not respectable. St. Francis was not respectable. You know, you can't be conformed to the world because this is where the world is going consciously or unconsciously. So you have to be prepared to be. Well, all the things that Christ told you, you were going to be right rejected and humiliated and attacked and all the rest of it. Not for the sake of it, just because you're being a contrarian, but, you know, you have to. That's the really hard bit. You know, you have to say, if I'm going to walk in the direction I need to walk in, I'm going to be metaphorically wearing rags or maybe actually wearing rags. So there's a lot of renunciation. I think that has to come somehow, and that'll be different for different people. But maybe that's the hardest bit for those of Us who probably come from sort of comfortable countries, you know, there's a renunciation involved, whether it's reputational or physical or material or whatever it is. You know, there's. And that's what the interesting people always do. You know, it's always the marginal people who can bring the wisdom back into the center. You know, the fools for Christ. This is what we're. Not that we're all going to be called to doing the same thing. But there's something that nags away at me about the need to, to renounce and to walk away in some way before you can see what the kind of the next stage of the path is. So that's a really interesting question to kind of pray on actually to think, you know, what's the renunciation here? Where do I walk? Which way do I go?"}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":4538.49,"end":4549.65,"speaker":"Jonathan Pageau","text":"Listen, I think this is a good place to end. Thanks for that bit of wisdom. And everybody, you need to subscribe to Paul's substack because it's just great."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":4549.65,"end":4550.14,"speaker":"Paul Kingsnorth","text":"It's a."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":4550.37,"end":4576.13,"speaker":"Jonathan Pageau","text":"It's a wonderful place to meditate and to think about what's going on in a way that is insightful but also, let's say, not political. Not political in the basest sense. Not one sided but really thoughtful. So thanks for all the work you're doing and I'm really looking forward. Paul and I are collaborating together on a project called the St. Basil's I forget St. Basil School of Writing."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":4576.64,"end":4576.96,"speaker":"Paul Kingsnorth","text":"Yeah."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":4577.28,"end":4607.38,"speaker":"Jonathan Pageau","text":"And so I'm looking forward to doing that as well. One of the solutions to this problem is also to help people understand true beauty and tell better stories, make better images and be able to participate in the world through beauty. Because it's not a small thing. It actually creates patterns for imitation for other people. It sends out ripples into the world when you participate in beauty. So. So everybody look forward for that as well. So Paul, thanks for your time."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":4607.54,"end":4608.82,"speaker":"Paul Kingsnorth","text":"Right. Thank you, Joseph."}
{"episode_id":"SW - #229 - 2022-04-19 - Paul Kingsnorth - Civilization and Control","start":4609.14,"end":4671.18,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thec symbolicworld.com support or else on Patreon the Pageot videos as well, and on Subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
