{"episode_id":"SW - #228 - 2022-04-12 - The Book of Enoch - Fallen Angels and the Modern Crisis","start":0.24,"end":4183,"speaker":"Jonathan Pageau","text":"This can really help us understand the modern world and can help us understand the modern crisis. And I think that in order to kind of understand the modern crisis, the first thing we have to understand is that the modern world is not only born out of technical knowledge, that is, there's a direct relationship between technical knowledge and the relationship with angels. This is Jonathan Peugeot. Welcome to the symbolic world. So, last week I gave a talk at a college here in Quebec looking at the Book of Enoch and its relationship to the modern ecological, apocalyptic narrative, you could say. And I got such a good reaction on social media, a lot of people wondering if I would put it up. Not realizing that it was in French, I decided I would make a version for the English Channel, which will be a little more detailed, a little more focused on some of the details from the Book of Enoch and how it can give us a key to understanding some of the things that are happening to us today. And so before we go into the Book of Enoch itself, it's very important to understand, first of all, the narrative creation, which is in Scripture, because, of course, the Book of Enoch is a. Let's say it expands on the creation narrative and especially on the flood narrative. And so it's good to kind of understand the basic structure of the Fall, so. So that we can understand how the Book of Enoch and the way it describes the relationships between these fallen angels and the women and civilization is really just an expansion of something which is already there in the origin, in the Fall itself. So, of course, we know that in the beginning, God created heavens and the earth. He creates the world, and he places Adam and Eve in a garden. Now, traditionally, especially in the Syrian tradition, the garden is understood as a mountain. And that's very important because we're going to see that the Fall and the different analogies of the Fall will appear all through the text and will also ultimately appear in the Book of Enoch and what it means to move towards the flood. And so in this image, we see Adam and Eve in the central garden, with the tree of the Knowledge of Good and Evil there in the middle, the fountain at the bottom. And we see the serpent around the tree. And Adam and Eve are tempted, and it is by desire for knowledge that they are tempted. And it's very important to understand that, especially according to, once again, not just the Syrian fathers this time, but also people like Saint Irenaeus of Lyon, there's a sense in which the fruit of the knowledge of good and evil was going to be given to Adam and Eve ultimately. But the reason why it made them fall was because they took it too fast. They took it through an act of desire. It says that, you know, the woman saw that the fruit was good to eat, and so she reached up and grabbed it for herself. And because of that gesture of taking it for yourself and taking it in desire, that is what will ultimately lead to a fall. And as we understand this, it will also be a way to kind of understand the difference between the normal Christian vision of the world and a more Luciferian vision of the world, which understands, let's say, the Fall even as something good. You see that in Gnostic teaching, you see that even in some of the moderns, like people like Jung seems to suggest that there was something good about the taking of the fruit. Ultimately, in the story of scripture, God will turn this into a good. But we need to understand it as a fall in the moment itself, because it is done through a sense of self aggrandizement and a sense of desire, slavery to our own desire, which will become the model for everything else that goes about. And so we see now in this image, we see Adam and Eve falling all over. On the. On the left here, we see the angel throwing them out of paradise with the flaming sword, which is not very flaming in this, but nonetheless. And then we see Adam and Eve working the ground in the garden. We see Eve sewing and making thread. We see Adam tilling, and we see them especially covered by the garments of skin. And so we see that when they fall, God says, cursed in is the ground for your sake in toil you shall eat of it all the days of your life, both thorn and thistles it shall bring forth to you, and you shall eat the herb of the field. So it's very important first of all to understand right away the image of the fall, because the fall means coming closer to the earth, but in the sense losing control of the earth. It's important to see that in the outset, God says to Adam and Eve that they can eat from any fruit that they found in the trees of the garden. And but now as they fall, God tells them that they will eat the herbs from the field. So now they're eating from the ground. Before, they were taking the fruit, which was up in the structure in the trees, and now they're eating directly from the ground. And you can contrast that as well, or compare it to, for example, when Nebuchadnezzar falls in the book of Daniel. And where, you know, as he falls, God tells him once again that he will eat the grass of the field like the animals eat the grass of the field. And. And so you can see in the story of Nebuchadnezzar, he becomes an animal and starts to eat out of the grass of the field. And here again, Adam is moving down the mountain into animality. And in doing so, he's now eating the herb that comes from the ground. But he's then also receiving the garments of skin. There is, of course, the notion that they have to work, that now the world becomes opposed to them. That as they leave the balance of the garden, this unity that they had in the garden, and they're brought about into a world of opposites. And one of the basic opposites is now the opposition with the world outside of them. The inside, outside relationship. And the dual relationship that is part of reality now becomes a form of opposition, not a form of complementarity. We see that, of course, in the relationship between Adam and Eve themselves. Eve is supposed to be the complement to Adam. The, let's say, the person that accompanies him, that come from his side. And now there is an opposition which gets set up between Eve and the serpent, between Eve and Adam, and of course, now in general, between man and the world itself. And that is represented by the creation of thorns, the coming about of thorns in the world. And so now Adam has to work very hard in order to receive the bread from the ground. And ultimately that fall will come continue, and Adam will end up falling all the way down until he becomes the dust. And of course, the fall is not just falling. It's a fragmentation. It's a moving down the order of creation, down into the animals, down into animality, and then ultimately down into the dust itself or down into the water, which we'll see, of course, in the story of the Flood. Then it says that Adam, that God made for Adam, that the tunics of skin. I've talked about this quite a bit in my different lectures. But to recap it a little, the garments of skin are the origin of technology themselves. That is, it's the origin of technology itself. That is, God places a shell around Adam in the world of death. He takes. Adam is falling into the animality. He's falling down into the lower aspects of creation as he moves into this dual. But then there is a trick which God can use, which is to use those elements of death to also create some kind of barrier to stop Adam from falling further or falling too fast, you could say, of preserving this kind of moment of life and death, you could say, to give Adam the chance to change. That's Ultimately, what that's for. And so these garments of skin are placed on Adam and Eve in order to preserve them in the world of the fall. And it becomes the very key to understanding technology, which is a gathering of the things below to cover us in a world of danger. And of course, at the outset, Adam is covered by these garments of skin on his own. And so he takes a garment of death to protect himself from the thorns. But then later that will start to grow. And so the garments of skin will get bigger, they will start to become more and more heavy, we could say. And this of course, happens at the second fall. Now. Now we tend to think that in the Bible there's one fall, but really the book of Genesis, especially up to the flood, is just a series of subsequent falls. And it's important to understand that, of course, once again, in order to understand the book of Enoch, because the book of Enoch describes one aspect of these multiple falls, an aspect which is becoming more and more cosmic, which starts with Adam falling. And that fall has repercussions and starts to have waves and waves. As the garments of skin get bigger and thicker and. And there needs more protection against the world of death, then that leads ultimately to a breakdown. Now, of course, as you know the story Cain and Abel, I won't go into the details of why, but Cain offers a sacrifice to God and is rejected. Abel offers a sacrifice to God and it's accepted. And because of that, Cain once again lets go of his desires, becomes obsessed, becomes bitter, becomes angry, and. And through that kills his brother Abel. Now, the killing of Abel is now something like a second fall. And we need to understand it that way, because when we look at what God says to Cain, we'll see that there's a direct reflection with what God says to Adam. So he says, so now you are cursed from the earth which has opened its mouth to receive your brother's blood from your hand. When you till the ground, it shall no longer yield its strength to you. A fugitive and a vagabond, you, you shall be on the earth. So remember now, when God told Adam, he said, you know by the toil of your brow that you will be able to get your bread from the earth. And now he says to Cain, it's even worse. It's like now it will no longer yield its strength to you. It's becoming more and more impossible to live in this world of death, the world where there's a breaking apart between heaven and earth which is manifesting itself in different ways. And this of course, means that Cain also loses his home and Adam moves away from the garden, down the mountain, you could say. And now Cain is going even further out from the Garden of Eden and will become a wanderer, won't even have a place that he can call his own anymore. Now opposed to that. So you can understand that just like God gave Adam and Eve garments of skin in order to protect them in the world of death, now Cain goes further out or further down into the world of death in and now he needs a bigger protection, which is why there seems to be an opposition, there seems to be an opposite going on. Because Cain is the one that builds the first city, so it says. And he built a city and he called the name of the city after the name of his son. So some people think that's a strange contradiction, but it's not a contradiction. No more than it is that Adam and Eve fall, move out of the garden, and now they don't have a place to, to protect them or a balanced place. And so they have to add this layer of death to protect them from death. Now in order for Cain to be protected from his wandering, he needs to increase the garments of skin. And now he makes them something like social garments of skin. And so he creates a wall not around a person, but a wall around a whole community of people. So we can see the fall becoming bigger and bigger. It starts with a person. Now it's becoming a. A fall which takes into account entire groups of people. This has to do in itself with the fragmentation of the human person, the multiplication of the human person into now families and groups and different individ and different clans which will clash and which will come to oppose each other ultimately as they build cities around them. Now you can understand that the, let's say the relationship between building a city and the fall and the fall into opposites. Because as you create walls around spaces, you are creating harder opposites. You're creating a sense of inside and outside which is becoming more and more prominent. Now what happens? Let's say, what if you would put. Let's say, you know, you have a house, and so you put somewhere in your house a, you put a vault, like a big vault. You know what's going to happen to people. What are you telling people when you put a vault somewhere? What you're telling them is that there's something precious there, there's something worthy of your desire. And so by hiding something, you also are enticing more desire. And so in order, let's say you can see it, you're Protecting something. And by protecting it, then you're also making it more desirable. And so there's an increase. You could say there's something. An increase in the fall, which happens by the very process of creating these opposites more and more. Now, down in the descendants of Cain, you will have the different aspects of all technology. All civilization will be created by his descendants. And so Cain has several descendants. We come to Lamech, who has three sons. Sorry, I wrote two sons. He has three sons. He has Jabal, Jubal, and Tubal Cain. So Jubal is the father of those that dwell in tents. So even the nomadic people. The Jubal is the father of those who play the harp and flute. So you have a sense of even everything that's related to the arts. All of that is also related to the descendants of Cain and then Tubal Cain, who is an instructor of every craftsman in bronze and in iron. And now we have the creation of weapons, of course. And so the fall increases as this is happening. So here we have a nice little image of Tubal Cain, of Jubal and Jabal together. It's hard to imagine them getting along, though. But, you know, in this image, they're all together just because they bring about all the war and all the chaos. All right? And so now in scripture, there's that weird little sentence which comes after all of this. It says there were Nephilim on the earth in those days, and also afterwards, when the sons of God came into the daughters of men and they bore children to them, they were mighty men who were of old, men of renown. So this is a very mysterious verse. Nephilim is something like the fallen ones, and it's translated as giants in other places. It appears in scripture, of course, when the Israelites enter the promised land and encounter these giants. And so there's a sense in which there's a relationship between this fallenness and the giants and the increase. And so a way to understand it is you can also see that there's a relationship between the increase of the fall itself as it becomes more and more cosmic, and. And the description of these great and mighty men. Think about it. It's very simple to think about the creation of a city and the increasing of the body that way. What does that create? Well, it will ultimately create mighty men, because now if people are able to ascend up these hierarchies in the world, then they have more power. And so a king of a city is, of course, more powerful than an individual. His body is bigger. So there's a sense in which this is, of course, what the. The Nephilim or the giants are related to. They are. Now, whether or not they were giants, actually physical giants, that's also possible. It doesn't bother me at all whether that would be the case. But it's important to understand it more than it is to think of whether, you know, what it looked like, let's say, physically or not. It's mostly important to understand that there's a relationship between an increase of fall, an increase of animality, an increase of body, as the garments of skin get added and get beyond bigger. So you have something like giants. You have these gigantic creatures that are very, very powerful. And so we see a few images of giants, of course, the one is David and Goliath, who is also related to this, because the different tribes of giants which are encountered in Israel, you know, as Israel regains its territory, are related narratively, and not just narratively, but even in terms of name and in terms of the connection in the text itself to the Nephilim that are there before the flood. I've talked about this in other talks. I won't go into it too much, but it's important to understand that this type of story is there everywhere. So when scripture talks about the idea of men of renown, we can understand it as heroes in general. And the heroes, of course, that appear in ancient mythologies, any ancient mythology, has a sense in which the origin of their civilization, of their great cities, of their powerful things, were demigods. That is, they were half God, half man, and that usually their father was a God and their mother was a human. Sometimes it's the opposite, but most of the time, that's what it is. And so this appears in every culture. Here we have an image of Gilgamesh, of course, and Hercules that are these powerful men that were very terrifying. We always have to remember that when the old world talks about these demigods and these heroes, they're not talking about heroes the way we understand heroes today, but are really talking about heroes in the sense of these very powerful, terrible beings. And I chose, of course, Gilgamesh, because Gilgamesh would manifest this power over his, let's say, political body by wanting to sleep with all the women in his kingdom. So he would go and, you know, on the first night of someone's wedding, he would sleep with the man's wife before the man had access to her. It was a way to, let's say, embody the entire body politic and kind of have his strength and his power fill up the world. And so you can understand someone like Gilgamesh as a giant in many ways, because he was that being that had a very large and powerful body and was very powerful in the world, and because of that, was able to accomplish great deeds. Now you see the same, of course, in the terms of Hercules was very strong. He did all these amazing feats, but Hercules was a terrible man. He killed all his children and nonetheless is still considered a hero. And so we have to think differently about the heroes and understand that when scripture talks about these men of renown, these men that are related to the sons of God that came and had encounters with human women, as this way of understanding it. And one of the things that's important to really get as we come into the Book of Enoch is to understand that there are two traditions in the Christian world. One is that there were the sons of God that came to the daughters of men refers to angels, and the daughters of men referred to the daughters of Cain. And there's another tradition which is that it's the daughter, the daughter, the sons of Seth, the Sethites, those that replaced Abel as the chosen one, you could say, as the one who carries the legacy of Adam into the future, that it's them who now came and came to the daughters of Cain. Now, those two traditions, of course, they're very different in their narrative, but they're not so different in their implications. They're not so different in their implications because they. They both imply a fall. They both imply something from above coming down and joining with something from below in an act of desire. And in that act of desire, it ends up manifesting itself in bigger bodies, more powerful bodies, patterns from above which are brought down into the world below, or authority from above, which is brought down into the world below in a way in which kind of fills up the world with that authority and creates these very powerful bodies. So although those two traditions, some people might get annoyed that I'm saying they mean the same for us. For our case, it's more important to understand their meaning and you can hold on to whatever tradition you want. That's fine with me. But I think it's important to understand the meaning that we find in the Book of Enoch because it is so relevant to what's going on today. Now, of course, all of this leads, of course, to the end of a world. And it says, and God said to Noah, the end of all flesh has come before me, for the earth is filled with violence through them, and behold, I will destroy them with the earth. So all of this this corruption, this fall, this. This focus on the body, these bodies that become bigger and heavier, these civilizations, these cities that are also related to desire. Remember that. That's why corruption fills the earth. We're going to see that more in the Book of Noah. How that all comes together is what leads ultimately to the world now not being sustainable anymore and falling apart. And so, of course, we get the flood and Noah's Ark. You know, Noah's Ark is often seen, you know, in the modern world. There's like a weird, cute aspect to Noah's Ark where you see toys and, you know, puzzles and books for children. But Noah's Ark, the story of Noah, is the most terrifying story in scripture. You know, it is so terrifying to imagine the entire world collapsing under its own chaos and violence, and ultimately only a few people, the seed of the righteous, surviving. All right, and so that's the basic story in Scripture to kind of talk about how Genesis, the creation narrative, leads all the way down into the flood. So what we see in the Book of Enoch will be an expansion of this, something which will help us understand what are the implications of this narrative that's already there. And even as you notice, I've teased out certain elements from Scripture, which to some people might not be obvious on the first reading, but you will understand that the reason why I'm able to tease them out is also because I've been formed by other narratives like the Book of Enoch, which were kind of this expansion to help us see patterns in scripture that are there but that are sometimes hard to pick out for some people. So the version of the Book of Enoch we're going to look at is going to be the first part of what often people call the Book of Enoch, or sometimes it's like different Enoch 1, 2, 3, or whatever. It's really the Book of Watchers, which is considered by the scholars to be the oldest part of the Book of enoch, composed in 300-200 B.C. the complete text of the Book of Enoch was found in Ethiopia in, I think, in the 19th century, if my memory serves me correct. And the Book of Enoch is quoted in the early church fathers, but it's also quoted in the Bible. It's quoted in the Epistle of Jude. And it seems like there were parts of it which were found in Qumran and different parts of the world. The book did come into, let's say, was forgotten by some people or was kind of set aside by some of the church fathers because of the problem of the idea that angels would have relationship with women, and that would create children. Of course, that's very problematic for our metaphysics. But I think that especially now, and if you're watching the or listening to the Lord of Spirits podcast with Fr. Stephen DeYoung and Fr. Andrew Damick, you will see that they have been able to, in my opinion, they've been able to really help us understand what this means and how it's possible in a way that kind of heals over the opposition or the problem that a lot of the later ancients had with the book. And the answer is that these were rituals. There were rituals between, that were set up religiously between a priestly caste and sometimes temple prostitutes or sacred prostitutes, and that it was a ritualized way in which to embody the God in the world, just like they had ritualized way of embodying the gods in statues or, you know, in temples and practices, then they had a way to sexually imbibe the God into the world through ritual sexual practice. And that this really, it really kind of heals it together. And it also joins it back to what I was talking about a little bit before, which is that this is related to civilizations themselves. It's related to, let's say, religious practice, civilizations, cultural developments, and that it's not just about, you know, although narratively we can use the image of the God coming down and having an encounter with a woman, we need to kind of expand that and understand it, that it. It has cultural and civilizational implications. All right. And so the Book of Enoch starts with a kind of notion of the coming revelation. It talks about how, you know, Enoch is the one who's speaking, and Enoch knows that there's going to be a flood. So he kind of prepares the reader to understand that. And he says, he talks about how there will be a manifestation of the Holy One of God himself, who will therefore tread upon Mount Sinai, appear with his host, and be manifested in the strength of his power of heaven. As we talked about how all shall be afraid and the watchers will be terrified. Great fear and trembling shall seize them, even to the ends of the earth. The lofty mountain shall be troubled and the exalted hill depressed, melting like a honeycomb in the flame. The earth shall be emerged, and all things which are in it will perish, while judgment shall come upon all, even upon all the righteous. But to them he shall give peace, he shall preserve the elect, and towards them exercise clemency. So you get a sense in which he's telling you. Now, what I'm going to tell you is what is going to bring about the end of a world? The world is going to end, but don't be worried, because the just will be preserved and God will show clemency to the justice. And then what will happen is that once all of this happens, there's going to be a strange transformation, and then all will belong to God. So then shall all belong to God, be happy and blessed, and the splendor of the Godhead shall illuminate them. And so there's a sense in which this fall will lead to a final apocalypse, a final revelation, in which all things will now become connected again. You can already see that there's a similar version of this in the Book of Revelation itself, where the destruction of the world leads to the New Jerusalem. Talk about that a little later as well, and how it relates to the book of Enoch and to Cain and the building of the city. I've talked about this in other videos, but we'll go over it nonetheless. So what's interesting is that the book starts by describing natural patterns. And so we need to understand how. How the ancients understood and how the notion of the watchers were understood by these people. It was that God had appointed on the world these angels that were watchers, that were those who were principalities over different patterns of the world. They were the culmination of these patterns into intelligences. And these intelligences manifest themselves in the world through these regular natural patterns. And. And so that's why at first, it really describes just the patterns of nature. And it says, all who are in the heavens know what is transacted there. They know that the heavenly luminaries change not their path, see that each rise and set regularly, every one at its proper period, without transgressing the commands which they have received. They behold the earth and understand what is there transacted from the beginnings to the end of it. They see that every work of God is invariable in the period of its appearance, and they behold summer and winter, perceiving that the whole earth is full of water, and that the cloud, the dew and the rain refresh it. So they go on to describe different natural patterns. But what's important to understand is that the way it's described is that these watchers are set over these regular patterns because these patterns are intelligible and they are intelligent, they are causal in the world. The patterns that we see in the heavens, they legislate the different transformations that we see that are stable, that are balanced. The change of the seasons, you know, the water which comes down from the mountains down into the ground, goes back up and then comes down as rain. These types of natural patterns have a regularity to them, especially those in the heavens. The lights up in the heaven have a regularity to them. So you need to understand that if you don't understand that for the ancients in the Bible, so that the stars and the gods, the stars and the heavens, the stars and these principalities are the same because they are a manifestation of the regular patterns of God's will on the world. And so God's will is nothing but the regular procession of orderly patterns into reality. And so that is what these principalities are above. That's what they are, the watchers, they watch over the, these patterns. It's hard for us to think that way. It's easier for us to think that way once we see them start to go off key. And when the patterns start to go off what they're supposed to be, then it's going to become clear to kind of understand them as these intelligences that are acting in the world. Because, you know, when they act outside of the script, let's say we can see the effects of them because those other effects, right, the effects of the natural patterns, they become like the, they just become taken for granted. They're just the world we live in. They're not, they, they don't, they don't. They tend to fall into the background of our existence because they just are, let's say, the, the water in which we live, the natural patterns of the world. So what happens is that of course you have these intelligences that now fall into the world and they do that by desire. They see what that which is below. And instead of just being, let's say, a normal, let's say in the normal hierarchy of things, of overseeing the patterns of being, the culmination of these patterns, they now through desire, want to come down and find, let's say, bodies. And we can understand that this happens also from below. So the intelligences above, you can describe it as them desiring the feminine that is below the potential that is below, and desires to come into that through a desire to modify and to transform the patterns to their own power, you could say. And another way to understand it is to understand it from below as well. To understand that the men that the descendants of Cain, in order to protect themselves, looked up and with desire, just like Adam and Eve reached up in order to take the fruit of the knowledge of good and evil, reach up and now take these patterns from for themselves, not only to see them like was described at the outset. You know, at the outset, these patterns are described as good, as beautiful, as powerful. These secret patterns that are there in the world are part of the way God lays out the creation. But now there's a sense in which people reach up into those secrets, grab the secrets and use them to make themselves more powerful. And that's very important, that it's a repetition of the fall. But now it's really at a cosmic scale, and it's related to desire, which is why there's a sexual aspect to it. It's related to multiplicity of beings and also to the creation of giant bodies. You know, these giant bodies represented by the different levels of civilization and everything. All right, so these fallen intelligence, they took wives, each choosing for themselves whom they began to approach and with whom they cohabited. Teaching them sorcery, incantations and the dividing of roots and trees. And the women conceiving brought forth giants. So there's a relationship between the union of the intelligences and the women, right, and the bringing down of knowledge. Those two things are the same. They really are the same. They're bringing down the knowledge into a world that grasps for them with desire. And so it says that the stature of these giants was 300 cubits, which is, I think it's like, what is like something like a football field. It's like 300ft or something like that. Maybe even more than that. I don't know, 300 yards or something. It's huge. It's just these huge, huge things. By the way, the size of the giants described in the Book of Enoch is the same as the size of the ark, the ark of Noah. This helps you understand even more what this is about. That it is about the technology itself. It is about the building of these giant garments around us to protect us, to give us power, to help us act in the world of danger. So we need to understand, by the way, that Noah's ark is a continuation of this and a transformation of this into a good. But at this point, saying that the giants had bodies that were 300 cubits is to help us understand that there's a relationship between that and the ark itself. But what's important is that also there's a sense in which, now that these giants have bodies, now these giants devour. They eat. They're hungry, they eat the world. They devour all which the labor of men produced until it became impossible to. To feed them. And then they turned against men and they started to devour men. Now understand that you can understand it in a narrative way as these giants that have giant bodies that just eat and eat and eat. But you can also, of course, understand what it can also refer to in terms of civilizational manner. You can imagine these cities that devour, that devour through the desire of its elites, that kind of gathers in, gathers in, and it also devours men. This is, of course, what even, you know, the prophet Samuel told the Israelites that if they have a king, that that king will devour their children, that king will take their sons and their daughters to fight in his war, his daughters to have children with, to have to sleep with, and their sons in order to fight in their wars. So there's a relationship even there in terms of narratively what it is that is being referred to here. And so they began to injure birds, beasts, reptiles and fishes to eat their flesh one after another and to drink their blood. And the earth reproved the unrighteousness. And so people notice that these large, huge, gigantic bodies are out of control and that they're devouring the world. And so think about, already think about in terms of the ecological narrative, the way in which we develop, describe the civilizational problem in which we're in. In terms of the way in which we are devouring resources because of our giant bodies. We have these giant bodies that are out of control, that are devouring resources and are also devouring humans. Of course, this becomes clearer and clearer, especially when we look at, when we look at Google and we look at social media and the Internet and how it devours us. It lives through our attention, our attention feeds it and makes its body bigger and more powerful and makes it fill up the world even more. And so what's important also to understand is the difference, because later in the other parts of the Book of Enoch, later Enoch will ascend up into heaven. And as he ascends into heaven, he will himself discover all the secrets of the way in which the world lays itself out. It's a beautiful narratively describe vision of the cosmos, of these gates, these gates out of which the different heavenly bodies come in and come out, and how they process regularly through the sky at their allotted time. And so there's a sense in which Enoch will discover these secret mysteries that are referring to. But there's a difference between that, let's say Enoch ascending up into the heavens and discovering the secrets and now these intelligences coming down into the world and. And modifying the world. That is what ultimately technology is. Technology is a modification, an adding on of, you know, the earth onto things in order to make them more powerful. So it is once again an acceleration of the garments of skin themselves. But now it becomes more and more so. It says, talks especially about Azazel. Azazel is important in this. And Azazel is important as well, because Azazel ends up in the Bible. Azazel is also in scripture. He's the demon of the wilderness to which the Israelites sacrifice a goat every year. Moreover, Azazel taught men to make swords, knives, shields, breastplates, the fabrication of mirrors, the workmanship of bracelets and ornaments, the use of paint, the beautifying of the eyebrows, the use of stones of every valuable and select kind, and all sorts of dyes, so that the world became altered. What's important is to understand the world became altered. The. And what's also important to understand is what is the strange relationship between all these different aspects of reality. He makes swords and knives and shields and breastplates, but then also mirrors and bracelets and ornaments and the use of paint and beautifying the eyebrows. Now, of course, all of this has to do with metal making, has to do with taking the minerals from the earth and transforming them, because, of course, mirrors at that time would be made of metal. And also even the beautifying of the eyebrows was a certain metal that was used to paint the eyebrows of women. But it also shows you the relationship between power and desire, the relationship between getting swords and weapons and making yourself more powerful in order to conquer others and protect yourself from others. And also the desire to make yourself more attractive and more beautiful through adding ornaments, through adding this layer on top of you of paint and of beautifying your clothing, of doing all that in order to attract others. So you can see that this relationship between desire and power is there, by the way, right in the beginning with Adam and Eve in the garden, with Eve there at the tree. But it also now has. You can see its implications in terms of civilization, how there's a relationship between all of these together. So what this does is, of course, impiety increases fornification, fornication multiplies, and they transgressed and corrupted all their ways. Unless you understand that, you won't understand the relationship between fornication and technology. Now, it's a lot easier to kind of understand for us if you just take a second to. To see the relationship between fornication and technology. If you think, of course, of contraceptives, if you think of pornography, if you think of the Internet and just how elated it is with eroticism, you can kind of see it, but you can. Sometimes it's hard to understand the connection that it has to do with power and desire. That is, the desire to increase my power in the world, to accumulate these goods, to accumulate these statuses that I can get by a nice car or this or that is related also to making myself attractive and also, you know, say, joining with, sexually with things and with people. There's this. There's a relationship between this desire and power which is unavoidable and which is, of course, represented very beautifully and powerfully in the story of the book of Enoch. And this ultimately, although it was done in a way through the desire of these intelligences to be embodied, but then also the. The desire of men, the desire of the descendants of Cain to be more powerful. What it ultimately does, though, is it leads to the destruction of men. And so you see all the different demons that are teaching different things. I won't go through all of them. You know, teaching sorcery, the dividing of roots, observation of the stars, signs, astronomy, the motion of the moon. And so, like I said, all of these patterns, they later will be discovered by Enoch himself in Scripture. But these are all used to control and to modify reality rather than just, let's say, a spiritual contemplation and participation in the way the world is. And then. So that leads to men being destroyed. And it says, and then men being destroyed cried out, and their voice reached out to heaven. And the manner in which the voice reached out to heaven is that you have now these intelligences that became deviated, that started to want to find body for their own desires. And now you. But you also have the intelligences that remain stable, that remain directed towards the infinite, directed towards God. And so the way it works is that the voice of those that are falling, the voice of those that are being destroyed by this call up to heaven. And then you have the archangels, Michael, Gabriel, Kafel, Suriel, and Uriel. They look down from heaven and see the quantity of blood which was shed on the earth and all the iniquity which was done upon it. And so they hear the voice of them. And then they turn up to God and they tell. They ask God to do this. So the earth, deprived of their children, has cried even to the gate. Now it's the angels saying. The angels are telling God, the earth, deprived of her children, has cried even to the gate of heaven. And now to you, ye holy ones of heaven. Sorry, I'm still. It's still now the people that are complaining to the angels, it Says, and now to you, the holy ones of heaven, the souls of men complain, saying, obtain justice for us with the Most High. So they're telling now the angels not to come down, let's say, and mingle with them. But they're looking up and they're asking those, those principalities above to obtain justice from. That is what is above them. They're saying, go up into, into the hierarchy and call upon God for us to now bring justice down to us. You can think of it as the way in which, for example, in the Old Testament the people would go to the prophet and ask the prophet to pray for them, or go to the priest and ask the priest to pray for them. But now you can see this at a higher level. They're asking up to say, intercede for us to God above, intercede through us to, to God. And that's what happens. And finally what's interesting is that God finally lays down his judgment. And there's an interesting little tidbit in the way that God judges that is very fascinating and can help us understand what exactly the judgment of God is. And we often think of the judgment of God as this arbitrary thing that comes down from heaven, you know, throwing lightning bolts. Just God is angry, so he sends down his anger. And there's a way in which we need to understand that that's real, that the anger of God is a real thing, that if the world goes against what it's supposed to be, if it starts to move in directions that are counter its nature, then the anger of God comes down upon us. But that anger of God is the very result of us going away from what God wants. It's in the very pattern of moving away. So the distortion of reality, the modification of reality towards our perversions and our desires is what is going to destroy us itself. And so, interestingly enough, God turns to Gabriel and says, go to the biters, the reprobates, to the children of fornification, and destroy the children of fornification, right? The offspring of the watchers, these giants, go destroy them from among men, bring them forth and do what? And excite them one against one another. Let them perish by mutual slaughter, for the length of days shall not be theirs. So you can understand that the truth of these perverted patterns at some point starts to manifest itself. And how does it start to manifest itself? They start to manifest themselves as their incapacity to exist. So the truth of these patterns is that people will fight amongst each other. And so God is saying, Gabriel, excite in them this capacity to fight against another. But that's in their very pattern of what they're doing as well. In that pattern of desire, in that pattern of trying to be more powerful, to be more vain, to be more attractive, to attract more attention. All of that will lead us against each other. And so that is where the truth of those horrible patterns start to manifest themselves. And it means that people start to fight and they self destroy ultimately. So you could think of it, you know, like, you know, you know, as someone, someone who starts to take heroin and they take heroin. And then at some point you could say, you know, the judgment of God is on that person. But it's just, it's actually also just the consequences of them taking heroin. That is the truth of that pattern of taking heroin is that it's not sustainable. If you do it constantly, then at some point it starts to, starts to break apart and, and you know, you start to self destroy and that appears as the judgment of God. All right, now it's important to understand that this story of these intelligences which come down, like I mentioned before, the story that you find for example, of the gods, the Greek gods or the Mesopotamian gods that now encounter humans and become the kings and the leaders of these civilizations, you can also see versions that are related to technology. And it's very interesting because you'll notice that all the same patterns are there. So for example, we have the story of course, of the Titan and there's a weird relationship in, let's say, ancient imagination between the Titans and the giants, although they're not actually the same. In Hesiod, for example, they end up kind of all becoming the same, these fallen, these ancient gods, and then also these giants that are, that are the side effect of relationships, that of Heaven being castrated and his semen kind of falling on to the chaotically onto the world. You can understand that these angels that come down into the world and chaotically manifest to bring about transformations is not, it's not exactly the same, but you can understand how it's related to, let's say, Heaven being castrated and his seeds getting spread out chaotically and bringing about these giants. But you can also understand that the Titans, of course are the first, first rebels against the God of Heaven. They're the ones who rebel against the God of Heaven. And Prometheus would have been in that clan of those that rebelled against heaven and now brought down the patterns into the world and brings fire to the world. So what's interesting is that in the Greek myth, most of the Time, this is actually seen as positive, that this is a positive thing, right? Prometheus brought down the patterns of heaven into the world world to modify creation. And this was like, you know, a desire to liberate humans, to liberate them from the tyranny of heaven. And if you know people that are Luciferian in their thinking, even if they don't know that that's what they are, some people actually do, they'll realize that that's also how they see the fall in the Garden of Eden. They see it as something like the Promethean relationship. But what's interesting is that the punishment that is given upon Prometheus, which is often seen as horrible and unjust, is that every day his liver will grow. And then every day an eagle, which is the symbol of Zeus, will come down and eat his liver every day. What's interesting is that the liver for the ancient Greeks was seen as the house of emotions. So the liver was the place of emotions in the body. So you can understand that also as the passions, if you want, is that Prometheus's passions, because he brought down these patterns to heaven through a rebellion against heaven itself, that his passions will cycle and will constantly be brought back, then will be taken away, then will be brought back and will be taken away. And you can understand it as the cycle of any passion, of any desires, of any time that you act in desire and you end up in this cycle where you're never really satisfied and you keep. You keep turning in a circle, in a circle. So you can see it, of course, in the story of Prometheus, but you can see it a lot even more clearly in the story of the Minotaur. Now, in the story of the Minotaur, there is the story of Pasiphae, who was the king of the wife of the king of Minos. And the gods, they make this beauty. They give this beautiful bull to the king of Minos. I forget who gave it to him. It gets complicated. I forget these, the details, but they have this beautiful white bull and they entice Pasife to fall in love with the bull and to want to have a relationship with the bull. Now you can see, interestingly enough, how it's inverted, right? It's a weird inverted relationship, but it's still very similar. It's like this crossing of levels of ontological reality, of different levels of principality, which are crossed through irregular desires. And this irregular desire causes monsters and causes chaos and causes violence and breakdown. So Pasiphae falls in love with the bull, wants to engage with it obviously cannot. So what does she ask? She asked Daedalus, who is the great technician, he's the great artificer, to create a animal shell for her. So he creates this animal shell around her and a fake bull in which she goes into. And by hiding herself in this animal shell, then she can enter into relationship with the white bull. And that's how she gives birth to the Minotaur. And of course, the Minotaur is a cannibal. He goes around and eats people and he. He has to be hidden in the labyrinth in order to prevent the chaos that has been unleashed on the world of hybrids and mixture. It's important to understand that in some traditions, the Nephilim, of course, also created hybrids. It was part of what they were doing. So you can see, of course, the notion of hybridity is related to all of this. That is, you can understand the angels, these high identities or these high intelligences that cast themselves down into these lower causalities through desire and so mingle and create more and more mixture in terms of confusing of identities. It's already a confusing of identity for, you know, Pasiphae to have a relationship with the bull. It's a confusion of identity for these higher beings to mingle with these lower beings. But then that also creates these. This different mixture which is at the bottom of the world, the place where identity breaks down, right? The dust of the earth, where things start to fall apart and not hold together. There's, of course, an image of that in the vision of Daniel, where you see the head of gold and the different metals of the different section of the statue, ending with the mixture of clay and iron at the bottom. So you can understand that the hybrids that these giants create and the hybrids that were created by the relationship between Pasiphae and the bull is something like these hybrids and this confusion of identity which brings about chaos and death at the edge of the world. It's, of course related once again, that I mentioned the fact that in manuscripts you have all these hybrids on the board of manuscripts. But it's also related, let's go back to the very top of this. It's also related to the way in which de demons themselves are represented in Western iconology, these demons themselves are represented already as this mixture and this chaos and these. And these animals that are, you know, birds and mammals and lizards that have faces, you know, faces on their crotches that are, you know, that are falling upside down. All of this is a representation of already this problem of what happens when these identities fall and how they start to break down and to fragment into hybrids. Now, of course, all of this leads to the flood, which is the breakdown of everything. And, you know, the place in which all of this falls apart. Identities collapse, violence is too much. There's too much opposition, there's too much chaos, there's too much breakdown. And it all falls apart into the. The flood. And the flood is caused by all of these different factors at the same time. This can really help us understand the modern world and can help us understand the modern crisis. And I think that in order to kind of understand the modern crisis, the first thing we have to understand is that the modern world is not only born out of technical knowledge. That is, there's a direct relationship between technical knowledge and, and the relationship with angels. There's a direct relationship between, in the west, between this technical, rationalistic point of view and this weird esoteric angiology and demonology, which occurred at the end of the Middle Ages and started to become more and more prominent. Now, you can look into these figures yourself. I'm not going to go into detail, but just to help you understand that at the very outset of modernity, during the, during the Enlightenment period, you have figures like John Dee, who was the main counselor of the. Of Queen Elizabeth, who was a. Who was a magician, who was a, you know, hermeticist, who was all these things. Now, what's most important to understand here that one of the things that he tried to do was to contact angels. He tried to have. He tried to receive messages from. From these beings that were above. And these beings ultimately led him himself into a lot of confusion and led him to practice wife swapping and things with his partner. And it just became very weird and disturbing. But there are many examples of that. You can look these up. Josephine Peladin, who was a French kind of decadent religious figure in the 19th century, who, who led to what's known as the Symbolists. The Symbolists were a. It's funny because I'm a Symbolist. Not the same kind of symbolism, but these Symbolists were these artists at the end of the 19th century that explored the spiritual, but in very kind of dark terms. You see it in painting, you see it also in the music, a lot of the music. A lot of these kind of dark, you know, the Sabbath of witches and all of these types of imagery were explored by these people. Of course, you have Blavatsky and you have Crowley, who practice sex, magic and demonology. And of course, I've mentioned this before, and I mentioned this in another podcast, and I mistook the name of Crowley's. One of Crowley's beings, which was Lamb, who he was having encounters with and who was dictating knowledge to him. And it's just interesting because Lam looks like a gray. And there's a relationship, direct relationship between. You can understand that in the Enlightenment period, there are some people trying to break through and to kind of recontact these intermediary beings. You could say. And this was directly related to the development of technology. These same people were also. They were directly related. You can't. It's hard to get away from that. But now we can understand the giants. We can understand that giants have been unleashed on our world. And we see it, of course, in terms of this armaments. We see it in terms of the physical corruption, knowing the ecological crisis, pollution. We see it, of course, with the obsession with hybrids, and that this is related and is inextricable from moral corruption. Now, people tend to not want to see those related together, but they. Because, of course, a lot of people that are involved in the moral corruption are decrying the physical corruption, but they don't realize that the desire that is bringing about the moral corruption and the confusion of sexual identities and the desire to live out your sexuality in a completely disincarnated, disembodied way is related to the desire to increase your power in terms of technology so that you don't have to submit yourself to the natural power patterns of the world. Right? We have the electricity, which means we don't have to follow the patterns of the lights in the sky. We have cars, which means that we can spread ourselves out, we can move faster, we can do all these things which are modifications of nature. And that the desire we have, that the desire that we have to kind of engage with that in an obsessive way is the same desire which leads to the moral and the sexual corruption, let's say. And this, of course, leads to a destruction of humanity, whether it is a destruction through people getting sick because of pollution, because our food is technological and our food is degrading, the quality of our food is degrading. People use contraceptives, pornography. All of this technically brought about this relationship between technique and desire, brings about a fall in birth rate and ultimately of the vision of a collapse. And I think that it's interesting because although I do believe that the environmental narrative is often weaponized by people who want to control it and people who want to bring about their own very disturbing Luciferian utopia, there is nonetheless a reality, which is that some of These machines that we've unleashed on the world, they are very dangerous to us. You know, just the idea of nuclear weapons war is not a joke that exists. It's possible that nuclear destruction will visit upon us. You know, I was talking to Bret Weinstein. I think the podcast should be coming already come out by the time you see this. But he mentioned, you know, that there are hundreds of nuclear reactors in the United states that require 24 hour electrification. And so it's like if the electricity stops, they will meltdown. And there are hundreds of these. So it means that there's a man in which we're acting as if we want power and power and power. And we have no sense of calculating what this means in terms of the modification of the world in which we live. And this is important to understand that. Now, the question to understand now, ultimately, the key to how this is related to fallen angels and to know these falling watchers is these patterns. They are active intelligences and nobody controls them. Because we often think that these things just exist in the world and that they don't act upon the world, but the manner in which we can kind of see that, that they act upon the world is that we don't control them. A good example is of course, the environmental crisis itself, which is that although our politicians use environmental crisis politically to do whatever it is that they want to do, everybody kind of understands that whoever backs away from this increasing of power is going to lose politically. And that if we now back down, then China will win. And so the mechanism of its implications in the world are playing themselves out in a way that nobody can stop anymore because they have their boots in the reality and are making reality move in a certain direction. And a good example of, a good example that we see in stories is this idea, of course, of the genie in the bottle. That is, you know, you ask a genie for something, your desire. What's your desire? And you understand that the genie is the pattern that has all the power to implement it in the world. So you connect those two together, this intermediary kind of angelic or pattern figure that is fallen, because that's why he's trapped in this lamp. He's trapped in the world. And now he says, what is your desire? So you tell him your desire. And then what happens? You get your desire. But then because you engage with that pattern not through true knowledge, not through true kind of ascending knowledge where you, you encounter and embody and understand the pattern, but because you do it with desire, you don't understand the pattern. You're invoking. And therefore all the ramifications that you hadn't planned on start to play themselves out. And now you have. There's no. You have no control over it. So you. You ask for something, and then all the side effects of what you asked for start to appear. That's, of course, the classic story of the genie. And a good example of that is, of course, the automobile. We wanted the automobile. People wanted the automobile because they could see that it would make them more powerful, it would increase their speed, would increase their capacity to travel long distances. But what that led to, people didn't realize at the outset that it would lead to the reorganizing of our entire society, to the reorganizing of the way that cities are planned, the way that all communities function, that we would create these suburbs with just houses, and then when we create these shopping centers with different just stores. And then we would create these cultural centers where you go to see movies and you go to the theater and that these would all be disconnected. And so. And because of the car, you could not. You could live in a world where you don't interact with your neighbors because you're constantly going to work 30 minutes there, going to the store 30 minutes there, visiting your family and your friends that live an hour away. And it actually restructured all of our society, and it restructured the very way in which our communities existed and. And actually led to the fact that communities cease to exist. It's not the only factor, but it definitely led to the capacity for us to exist without embodied community. And that was not, of course. I mean, I'm sure that Ford. That's not what he wanted. That wasn't in the plans. But these patterns, they're intelligent, they act upon the world, and they have their own will, you could say. And once they're unleashed, then you cannot stop them. And some of these giants that you see in scripture and that I've been telling you about civilizations and armies or bodies and these kind of big bodies that exist in the world. We've got one coming very quick on us. And it is, of course, artificial intelligence. We realize that artificial intelligence, nobody controls it. Nobody totally can see inside that black box. And it's so powerful, and its ramifications are impossible to fully account for. But everybody understands that if you don't run that race, then you'll lose. And so even though someone like Elon Musk was warning everybody about artificial intelligence just a few years ago, he realized that whoever doesn't participate in the body of this, of this emerging God is going to lose. And so nobody can stop it. Even if you try, it's just going to happen. And of course, nuclear weapons are of course the same because. Because it's the same. You create nuclear weapons, the other person creates nuclear weapons, and then you create more and more. And it's very hard to come to a point where you totally de escalate. Because whoever de escalates and whoever doesn't de escalate, even if it's in secret, is going to win. And so it has a will of its own that's kind of manifesting itself through an intelligent pattern. And so that can also help you understand how the deals we make with these intelligences, if we do it through desire for power, then they will lead to destruction. And that for itself is the position in which we're in right now. For those that still hold on to a kind of Luciferian vision of the world, I think they should be able to see that. To think that one more technical move, let's say, is going to bring about the solution is to misunderstand the very way in which this is happening. And so there is of course, in our, in our stories, in our narrative, there is of course, all of these things come together. And so the relationship between aliens, technology, the obsession with the imaginary, fantasy, the idea of fiction and fantasy, all of that, how it comes together, violence, sexuality, hybrids, cyborgs, robots, psychedelics, this anti human spell that we see, this idea that humans need to be transcended, and of course this weird opposition between chaos and domination that fills up all our fictional stories as well. It's just one more representation of what it is that's kind of going on. And it's not surprising that some of the prominent orthodox thinkers in the 20th century have connected and other Christian thinkers have connected. The relationship between these fallen angels and this image that we have of the grays and of these aliens encounters, how that's related to technology, how it's related also to psychedelics. If you look into the relationship between the development of Apple computers and psychedelics, you'll see that all of this is kind of coming together. Remember that the Fallen Angels also taught, taught people how to make these drugs and to make these concoctions, you could say, and that there's a relationship between using these concoctions to go into the spiritual world without truly ascending in moral virtue and in transformation. But it's like a shortcut, right? And to increase your power is also all related to this as well. And of course this leads to the end of a world. Now, when it talks about the end of the world in the Book of Enoch, it's an interesting image. And so, of course, it talks about, you know, the end of a world. It talks about the earth being emerged. All things are going to perish. The judgment will come upon us all, but it will come upon even the righteous. But to them he shall give peace, shall preserve the elect, and towards them exercise clemency. Then shall all belong to God. Be. Be happy and blessed, and the splendor of the Godhead shall illuminate them. So there's a sense in which, although this is all happening, this world is collapsing and falling apart, that through this there's a mysterious transformation operating itself, and that it is ultimately leading to God filling all in all, and that this knowledge, even though it was taken, let's say, in ill will, in passion, and it leads to destruction, God can ultimately transform that into. In true illumination and true filling up of his presence in reality. I don't know how that works. I don't know how it happens, but it's definitely described in the Book of Revelation as the heavenly Jerusalem which descends unto heaven and becomes a perfect balance between the garden and the city, between that moment of innocence in the garden and now this falling into knowledge through passion, into ultimately a true knowledge in the end, where things are integrated together. So the story does have a happy ending. But in the meantime, understanding the Book of Enoch can help us see how the patterns that I described in Genesis are one of the ways and one of the keys to helping us understand how the different manifestations of our world are connected together, how the different ways things are breaking down are not separate from each other. But the relationship between desire and power and the breakdown, the fragmentation, the relationship between hybrids and technology, all of this is directly described, it's described in Genesis, and then, let's say, built upon in the Book of Enoch. And it can help us understand our situation now. And it can also help us understand, let's say, the way out, which is to make move. It's not. It's important to understand, once again that it's not that these technologies are necessarily bad in themselves, but because they come about through desire. That's what leads to the destruction. So it all. It. But it does lead to the possibility, this whole imagery and the imagery in the Book of Revelation, to understanding how, if things are in their proper place, if things are in their proper function, that they can lead to something better. And so hopefully we can be a part of that, at least on a small scale. At least around us, to the people that surround us. So I hope this has been helpful. It was a long kind of trek through the Book of Enoch and how it's related to us today. I hope it was helpful to help you understand what's going on and why this book is important to understand again today. So thanks for your attention everybody and we'll talk very soon. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon the Pageau videos as well and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
