{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":0.24,"end":49.59,"speaker":"Jonathan Pageau","text":"So, hello, everybody. I am here with Vin Armani, also known as Cyprian, who is a bitcoin developer, quite known in the bitcoin community. He's also recently been received into the Orthodox Church. And so there's quite a lot to talk about with Cyprian. He's been following my work for a while. We've been engaging on Twitter. We've also. We planned to talk a bit early before and it just didn't work out. So this is actually a good time, since he has been received into the church, to figure out what is the connection between bitcoin and his journey into the church and all the things that he's discovering. So I'm pretty excited about this conversation today. This is Jonathan Pedro."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":50.15,"end":51.83,"speaker":"Jonathan Pageau","text":"Welcome to the symbolic world."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":62.37,"end":64.77,"speaker":"Jonathan Pageau","text":"So, Cyprian, thank you for joining me today."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":64.85,"end":87.01,"speaker":"Vin Armani","text":"Oh, it's a pleasure and an honor. As you said, I've been following you for years now, so I've appreciated the work that you've done. And then when you started to become interested in talking about bitcoin, I was like, okay, well, if this can happen, it can happen. And I think that now is definitely. We had spoken about it some months ago, but I think now is definitely the time to have this conversation."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":87.32,"end":120.27,"speaker":"Jonathan Pageau","text":"And it's interesting because you probably follow this, that I'm a little suspicious about the coins and bitcoins just in terms of what they are and what they're doing and everything. But it's funny, there's a personal connection now that's coming in, which is my son, who's 16. He said, Dad, I really like to start investing in these cryptos. And I thought, okay, you're 16. He wanted to put almost all the money he made in his job into this. And so I said, okay, well, let's do it together. So we both put in a certain."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":120.27,"end":120.75,"speaker":"Vin Armani","text":"Amount."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":122.67,"end":139.79,"speaker":"Jonathan Pageau","text":"And so we're trying to figure it out together. So it's actually a funny time because I'm doing this for him. But at the same time, I guess I have to figure it out. I have to kind of solve my problems with bitcoin. So tell me a little bit how you got involved into bitcoin."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":140.99,"end":193.33,"speaker":"Vin Armani","text":"So I have a very sort of interesting history. I've. I've led a pretty interesting Life. And in 2012, I was in Las Vegas. I was in basically an all cash business, and I had a lot of cash. And my background is as a software developer. So that's my professional background since. Since my youth. It's kind of been the confluence of let's say entertainment and media and art and technology. And so I've been. Those are my two sort of life interests. And so they've. I found a way to combine them throughout my career and I was looking at different options of what can I do with this money. Like, I started out with money in my safe at home and then I had to get a better safe. And then I spent all my days after I would leave my home thinking about the money that was in my."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":193.33,"end":193.65,"speaker":"Jonathan Pageau","text":"Home."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":195.65,"end":203.18,"speaker":"Vin Armani","text":"And that wasn't very nice. And so Las Vegas is actually a great town for cash, as you could probably imagine."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":203.18,"end":204.9,"speaker":"Jonathan Pageau","text":"I imagine I've never been to Las."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":204.9,"end":522.46,"speaker":"Vin Armani","text":"Vegas, but I imagine, yes, it's a great town for cash. And so you could do a lot of things in cash. Much more than really I've been able to do anywhere except for maybe here in Saipan. And you know, I tried some things anonymous, private vaults and some other kind of cool and fun things. And then I recall that I had, you know, heard about this thing, bitcoin, and I think maybe I had seen some, either some article or some developer friend reached out to me in 2012 and I said, oh, let me check it out and found somebody that I could just do hand to hand transactions with and did a few of those in late 2012. The price was $15 per Bitcoin 2012, man. Yeah. So I, you know, spent a few thousand dollars doing that and ended up giving a lot away to people and telling people and like, oh, hey, check this out, it's cool. The wallets had just come out at that time. The first exchange, Mount Gox was sort of firing up and then there were some other interesting things like this site that was on the dark web called Silk Road. And I started to see, oh, this is kind of interesting. But I didn't really think much of it. And I was like, I don't know, this doesn't really seem like where I should be putting my money now. It doesn't seem like there's a lot going on here, but it's interesting and I sort of didn't pay attention to it. And fast forward to fall of 2013. So let's say around Thanksgiving time and here's this news, like Bitcoin to $1,000. Like it was the first time that it had ever gone to $1,000. So I was like $1,000 and immediately I'm scrambling, like where? Oh, this. Calling friends and everything, like, remember those bitcoins I gave you and all of this? So some was lost for sure. But I recovered Enough. Let's just say I had a very good Christmas and it was very nice. Everybody was very happy with the gifts that they got. And I pampered myself for my, my good investment and took some great vacations and everything. But I also said, this is insane. There's no. Because I was looking at it and I said, there's no reason, there's no fundamentals behind this to why it would have gone to a thousand. And that's actually very important. It's actually very important. And I think that I heard the previous interview that you did and you began saying that you had some suspicions or you were a little bit suspicious about bitcoin. And I think that's an appropriate feeling to have. So I was also quite suspicious, but interested. And then in 2014, I started just developing on the side as doing some hobby things, some little projects and whatnot. And in 2016, I sort of dropped my previous life and came out as like a libertarian, which I couldn't do. I was on a TV show. And so like, having a libertarian political bent publicly is not necessarily something that you want to do while you're taking a paycheck from a major network. Right. To be a star of a team TV show. So I was, you know, I kept quiet at that time and. But then I came out and started, you know, talking and podcasting and whatnot and really getting into the cryptocurrency side as it was starting to make its, its next sort of build up and then started developing more. And from 2017, I founded a company called Cointext that's we, we just recently sold off assets to that. It's like an SMS wallet, basically. So anybody with the phone through SMS could do this. And so I founded that company and was the lead developer of that. And since that time, Bitcoin has been my full time. It's been what I've focused on exclusively with my professional career. And I've just really enjoyed delving deep into it. And since last year I've been doing this school, bitcoin Mystery School, which we can talk about how that came about because it's directly tied into my journey to orthodoxy. And at this point we've got hundreds of students who are in there. It takes place every month. There's now a continuing education course. And I wrote a book, finished the book that I had been writing called Render unto Caesar that is tying in these philosophical elements of bitcoin. And I think that there's a really important conversation to be had. The questions that I've heard you have about Bitcoin, about trust, about authority, about sovereignty, about value. These are the questions no one is having. But it's when you realize how bitcoin addresses those things, when you realize what bitcoin has to say about who we are as human beings and the nature of reality, then you really see the power of it. And then the idea that, oh, it could go from 15 to 1000 starts to not. You start to see what the fundamentals really are. So right now my time is spent doing really more research and development types of things and educating my students and training up new developers. Basically, that's now what's going on in the continuing education of my school. So it's full time. It's 100% full time Bitcoin for me."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":522.54,"end":534.38,"speaker":"Jonathan Pageau","text":"All right, I guess that begs the question, so what is to you the philosophical underpinning of, or what is the metaphysical or whatever cosmological underpinning of bitcoin? What is it?"}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":534.87,"end":758.72,"speaker":"Vin Armani","text":"In a nutshell, the bitcoin project as described by its inventor Satoshi Nakamoto, is to be able to allow any two parties to transact value, to transfer value with one another over a communications channel, which in this case we're talking really about the Internet, without the need for an intermediary, a trusted third party, really a financial institution. And in the introduction to the white paper, he says, what is needed is a payment, a financial payment system based on cryptographic proof instead of trust. And it's an interesting idea. And when you delve into what is cryptographic proof, really what I believe and what it has turned out and made sense to me that he's saying is what is needed is a system based on faith instead of trust. And it's the difference between faith and trust. Trust being that which we have interpersonally between people, which is heavily based on reputation, and faith being that sort of foundational framework with which we predict what is going to happen in reality. So it's not that we like trust that one plus one equals two. Our relationship with one plus one equaling to is faith our. It's not that we trust that the sun is going to come up tomorrow. Of course it might not. Right? There's always the chance that something happens, an asteroid hits the sun, who knows? But we trust that it's going to come up. And that or our relationship with the sun coming up tomorrow is not trust in the same way that it's like, hey, are you going to pay me back that money that I loaned you? Right. These are two, these are two different things. And so it's the system that we have now is a trust based system. It's a reputation based system. It's the only way that we can move funds from one person to another and exchange values. So as we move into this digital realm, we have a system based on trust. And I think very soon, very, very soon, and Canada may be one of the places that it starts, people are going to start being cut off from that system as they're being cut off from other aspects of life. And that trust can be revoked. But you can't revoke the sun rising tomorrow. You can't revoke one plus one equals two. And so this is what Satoshi is delivering. This is what bitcoin has the capability of delivering. And so it's a very different. It's also like nails on a chalkboard to me, when people talk about bitcoin is money and then go on to tell you all the things about money. Bitcoin is definitely not money. I've been saying that for years now. It's something completely different from money. Or at least. So I'll give you an example. I'm sitting here on my deck. I'll tell you how bitcoin is money. I'm sitting here on my deck. There's things that fly by in the daytime. I see birds. I see their silhouette, but I also see butterflies. And at a certain distance, they look really similar. And then at night, sometimes I'll see bats. But it's like somebody saying bitcoin is money is like somebody saying, oh, see that butterfly? That's a bird. Now let me tell you all about birds. And it's like, well, no, maybe we need to take a little closer look at this thing and a little closer look at this other one. Like, yeah, they make this flapping motion and they move through the air. And maybe we could talk about flight and aerodynamics and all of these things, but it is so different that we need to take a deeper look and we need to not be categorizing it as something that has come before, because it really isn't."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":759.6,"end":887.23,"speaker":"Jonathan Pageau","text":"And so I think that what I'm getting from you is that bitcoin, because of the way it works, because it is somehow an impersonal process. You could call it a natural process to be generous. It's a natural process. And so something like its blessing falls on whoever participates in the process. And it actually doesn't. It doesn't have to do with human intermediary authority, which is, like you said, what we're seeing right now is Especially with the pandemic and the way it's playing out is that we're seeing methods and ways in which people can be excluded from systems radically and kind of in a surprising way, people even you can see we've been seeing people get their bank accounts removed and PayPal accounts dropped, and all this kind of happens. I guess I understand that, but I also wonder because Bitcoin is dependent on systems that are related to these systems of power, including the Internet connectivity, and also traceability. There's a certain amount of traceability just by the fact that even though people will say that it's anonymous and that the coin is not directly related to you, the trace of wherever you are doing these transactions is something which can be traced and then is ultimately linked to these systems of power. So, I mean, that's my impression. Unless there's maybe there's ways around it for people that are super tech savvy and are the dark web and all this stuff. But it seems like it's, at least for most people, they'll also have to use all these intermediary organizations like exchanges and wallets and all of this stuff. And then to get the money, if you need to use this money, you have to have some form of bank account. The way that you're talking about it, I kind of get it. But it seems like it's still far from doing exactly what you're saying. Or am I wrong?"}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":887.63,"end":1127.99,"speaker":"Vin Armani","text":"Well, interestingly, you are right for one story of Bitcoin. So bitcoin actually has two parallel narratives that are happening. And it actually comes from the very start and the way that Satoshi put it into place. So there's Bitcoin, the concept of Bitcoin. And with this concept of Bitcoin, that it really actually isn't dependent on the Internet per se, any way that any digital means of attaching to machines, you would be able to do it. The cryptography and all of that, the consensus rules, all of these, you can make your own networks. And this is kind of the idea of the concept. So this is what I'm primarily focused on. And this is where the. Let's say this is the lifeboat. The lifeboat is in the concept. But you are absolutely right in terms of this other thing and how bitcoin has manifested itself. And the reason it's manifested itself is because Satoshi added in as. As these things always are, like the traditional mythological structure. In order for him to build this thing, he had to add in this seed of corruption, if you will. And the seed of corruption was Basically, as he was building this, he built the system and he's like, okay, the system works great, but why would anybody, when this thing has no price, it's not worth anything? Why would anybody utilize their computer to keep this running? Which was something he needed a critical mass of people to do. Why would anybody do this? And so if people go to the white paper, there is a small little section that's called the incentive section. It's only nine sentences. And basically what he came up with was this idea and he said, okay, here's what I'll do. I will incentivize people to keep their computers up and running, because if they'll keep them up and running and running the software, every 10 minutes, somebody, based upon their percentage of computer power that they're giving to the network, is going to get some of these coins. And I will also make the amount that is going to be given total on this particular network, this particular game. Because each bitcoin network is really a game that's taking place. So the reason why would someone play this game because a chance to win some money. In the beginning, it wasn't worth anything. And everybody that was doing this, yeah, there was some idea that they would get some money, but it wasn't why they were doing it. They were interested in what could this bring to society or what could this do in the future. Tech heads, early adopters, whatever. As it started to get a price, and the main reason that it got a price was, as I said, these dark web markets. So as it started to get a price, $0.01 and then $1 and all of this, you started to get this inkling of people wanting to just run their computers to generate the coins to them. Before, everybody who had a wallet, everybody who was on the network was also a miner. There were very few people on. So everybody was a minor. If you were on the network, you were a minor. Then you started to get into this situation where of course, people were like, well, I can trade it. There's a place to trade it. People will buy it. So let me just run machines. And then we start to get into this mining industry. And what inevitably happens is that some people had coins. They want that value to go up. And there's a certain segment, it's the largest segment of people involved in bitcoin. It's almost everyone who's a bitcoin thought leader. They are dedicated and they even say they call it NGU technology. They are dedicated to the number go up mythos and ideology. They are dedicated to the price go up idea. And the only way to get the price to go up is you've got to get more people to play the game basically to buy in, like you and your son are doing."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":1127.99,"end":1129.91,"speaker":"Jonathan Pageau","text":"More people to want bitcoin, basically."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":1130.15,"end":1245.28,"speaker":"Vin Armani","text":"Yes. And the way that you do that, the way that they do it is it's basically the final corruption of satoshi. Of what? Satoshi. Because what was he playing with? It's a bit cynical. He's playing with greed. Right. He was leveraging greed. Now if he doesn't do that, because he didn't have to, he could have just said either one, it's unlimited supply, or two, he could have said, well, I'll just dump them all onto the network to start and then I'll just give them to my friends. The network would have worked exactly the same. What makes bitcoin? Bitcoin would have been exactly the same. But he added in this incentive to start out, to get people to bootstrap it, to get people to use it. And so now what we have is we have that incentive run amok. And so when people see bitcoin, so you look at bitcoin and you say, well, there's all these intermediaries. What are you talking about? It's something to eliminate intermediaries. Yeah. All of the intermediaries are based around the price going up. All of this is around the price going up. And if bitcoin is going to be killed and the BTC network is going to be killed in this process. So people who are buying into the BTC network, the price may go up, but no one will be using the network because they buy it on Coinbase, they buy it on PayPal, they buy it from some exchange, they leave it on the exchange, they put their US dollars or Canadian dollars up and then they don't move it on the network. And as the price goes up, they sell it and they take us and Canadian dollars back. This is not bitcoin because bitcoin's whole purpose is to remove the banks, to remove the financial institutions. And everybody that uses a financial institution to enter into the game is not doing bitcoin. They're doing this other story, this number go up thing, which is a part of bitcoin. But again, it's the seed of corruption that's always planted at the beginning. Right. This is the typical, typical mythological pattern."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":1245.36,"end":1266,"speaker":"Jonathan Pageau","text":"And so I kind of, I mean I kind of get it. But for example, like, so the idea would be that satoshi put in limited amount in order to create rarity. And that rarity would then create desire. And that desire then would, would, would incentivize people to mine the coin."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":1266,"end":1346.97,"speaker":"Vin Armani","text":"Let's say it's the appearance that the appearance of rarity and the appearance of scarcity. So these same individuals will say, oh, it's the first digitally scarce asset. Which is just absurd. It's an absurd statement to make because the digits in digital are ones and zeros. The number one and the number zero cannot be scarce. And also the idea that anything digital would be scarce. I mean, this video could be viewed how many times on how many machines, by how many people because it's digital. The whole idea of the digital revolution is that nothing is scarce. So to say this is the first digitally scarce asset, that's a game that's being played on you. That's someone who is playing the game of, oh, as we say, buy my bags. But he gave the appearance. If people read the incentive section, it's very clear. It's very cynical actually. Like he says, I'm going to give this appearance because I need to do something to get people. And you know what, if it's good enough that they're like, oh, it's kind of like, okay, it kind of feels like scarcity, maybe it will be valuable someday. He's putting the pieces, the pattern of what makes something valuable so that people will play the game. But it still is just a game."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":1347.61,"end":1352.51,"speaker":"Jonathan Pageau","text":"But I think I don't totally follow you. Are you saying that bitcoin is not scarce?"}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":1352.91,"end":1353.71,"speaker":"Vin Armani","text":"Absolutely not."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":1353.79,"end":1355.31,"speaker":"Jonathan Pageau","text":"There's no limit of bitcoin."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":1355.39,"end":1456.24,"speaker":"Vin Armani","text":"No, and I can prove that to you. So bitcoin BTC has been forked many times now. So what happens when there's a fork is some set of nodes decide that they're not going to accept the same transaction rules. So the same rules of the game, and they continue on with a new ledger, new history. Basically, it's a schism. Okay, so it's like 1054. So Bitcoin has had a 1054 and it split into bitcoin and bitcoin cash. Now, similar with the church split, they share the same saints before, right? They have all the same history before. But now what you have is you have two sets of saints that come off of here, two sets of traditions, two sets of histories that come off. And you can split that five ways from Sunday. And every time you split it, you get a new 21 million coins. So that first split created 42 million. And then two years later or one year later, one of the splits BCH split into two again. BSV and BCH. And then just last year, BCH split again into Bitcoin ABC, which is now called ECASH and BCH on this side. So even just between those on which, by the way, Satoshi Nakamoto could come back and spend his coins because he's the first saint, right? So the coins that he mined, he can spend them on every single one of those chains. So you already don't have 21 million coins. You already don't. Every time there's a split, Satoshi's coins double the number of coins double."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":1456.24,"end":1459.36,"speaker":"Jonathan Pageau","text":"So anybody can split his coins double too."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":1459.68,"end":1464.16,"speaker":"Vin Armani","text":"Everybody. Everybody who was holding coins at the time of the split, they double."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":1464.16,"end":1477.04,"speaker":"Jonathan Pageau","text":"They double. So it's. So there is a sense, there is a sense in which the scarcity is somewhat preserved because whoever already has coins has the same ratio compared to all the coins that are possible, let's say."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":1477.52,"end":1566.08,"speaker":"Vin Armani","text":"Sure, but. Sure, but there is no limit to how many times it can be split. So there are split. I mean, those are just a few that I'm mentioning. There's bitcoin gold, there's bitcoin private, there's bitcoin candy. All of these are traded on exchanges. Now. They don't trade for very much, but the idea here is about scarcity. And so this is just provably that. Well, it's not scarce because if I've got somebody who's willing to mine it, I can fork a coin tomorrow. It's very easy. I just pull the code down, change one consensus rule, let it run on, on mining rigs, and boom, we're done. So there's no, there's no barrier to entry for someone to inflate the currency. Now, they can't inflate it necessarily in the exact same game. But that almost, that almost doesn't matter because what we see is that to compare it to something like gold, where that's. This is the faith versus trust thing, right? Like when we talk about gold being scarce, it's like, well, yeah, the number of atoms within the earth, like the earth sphere is. There's a finite number, but in this case there truly is no finite number. So it's quite different. But you can make people perceive it. And that's the important part. It's the perception and that's what's giving it the value in the market. There's no doubt that it has it."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":1566.54,"end":1585.9,"speaker":"Jonathan Pageau","text":"So what role do you see it playing then? Like, let's say in the world? Because if it, if it, if it can be split indefinitely and you know, it's not based on, on trust of the people, let's say that that are instigating these. How do you see it working and what do you see its purpose?"}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":1586.54,"end":1644.16,"speaker":"Vin Armani","text":"The purpose is. Well, we're about to see the purpose. So the purpose of, of Bitcoin is to be the parallel economy, to be the lifeboat, to give the capability for the, I mean just to be quite frank, to give those individuals who do not want to take the mark, to give them the opportunity to actually have a society and a financial system. Because this is what is coming and this is sort of the end piece. But yes, Bitcoin outside of number go up. Bitcoin is not very valuable while everybody still has access to the financial networks. So if everybody still has access to the financial networks, there's not a lot of utility in bitcoin besides the gambling and the number going up. So we are saying that if once."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":1644.4,"end":1657.29,"speaker":"Jonathan Pageau","text":"People start get really cut off from the financial system, then then all of a sudden the reason for Bitcoin and the value of Bitcoin is going to be apparent and it's going to come more useful, let's say, for people."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":1657.69,"end":1754.42,"speaker":"Vin Armani","text":"Yes, but it won't. But the price of Bitcoin in that case is going to not matter as much because it's really the concept, it's the idea that you can pop up a bitcoin network whenever and wherever you want to using this. So it's not that we're going to see one network, it's that we might see for every one of these communities that's around, we might see an individual network within that community. And so it's actually the knowledge of how do you constitute a bitcoin network? What are the principles being used, the cryptographic principles, the proof of work? This is the important part because if you have that and some ability to manifest that in code, then you can pop these things up. So yes, in some ways I'm very glad that the number go up is happening because were the number go up not, and I'm not poo poohing it for that reason, thank God it's there because if it wasn't there, this idea may never have even reached the minds, it would have just died on the vine and it would have been some apocryphal thing and nobody would have even seen the white paper in the code. But because that was there because people are actually looking at it, there will be the capability when this happens in the, I think not too far future for certain individuals to be able to reconstitute themselves and to have an ability to not have to do the things that are going to be necessary to remain within the system."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":1757.19,"end":1778.71,"speaker":"Jonathan Pageau","text":"Then how do you. I mean, how do you solve the. How do you solve the. I guess would you would have like closed networks? Like you would. You could. You would basically set up closed networks that wouldn't be connected to the big ones, like connected to the big ones that have authority and then run. Run it on. That is. I guess that's the only final solution to this."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":1779.19,"end":1833.07,"speaker":"Vin Armani","text":"Yeah. And that's where the real. It's not. And I won't call it even an innovation, but the real revelation of bitcoin comes in. And the real revelation of bitcoin is called proof of work. And it's a unique. It's the first time that humans have ever had this capability. And basically it's an epistemological tool. It's not a technological tool. Because what it allows is it allows two people or more and unlimited number of people who have no interaction with each other or who might even have adversarial relationship with one another to come to consensus on events having happened in the real world. And that event being that some amount of measurable work was done, some amount of measurable labor took place somewhere by someone."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":1833.47,"end":1836.44,"speaker":"Jonathan Pageau","text":"And this is. This is the mining."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":1836.68,"end":1965.46,"speaker":"Vin Armani","text":"This is. Yes, so mining. So we call it mining. And the term mining actually comes from that little incentive section. And it's the. Again, it's the poison pill, if you will. Because Satoshi, as a sort of a side remark or maybe perhaps to wet people's whistle a bit, and to get at the greed, he says, this system, the way that I've put it together, this pattern of the limited supply and it being sort of trickled out and emitted out. He said it's like gold miners mining gold that it gets more expensive the more you pull out of the ground. So he said, I've put this in here. He put it there. Yeah. And it was. It was the bait. Right. So the. Even the idea of mining is it sort of obfuscates. Proof of work was before mining, before proof of work had been around for, at that point, over a decade. So proof of work was being used. And really what it is is it is a way of leveraging the laws of nature, so mathematical laws that again, we have faith in. And in my school, Bitcoin Mystery School, the first day of our sort of novice initiation class, the students actually do this proof of work by hand. And it's by it's doing and watching it that they Actually develop the faith as well. Because you see that, oh yeah, I can predict the future and we can make this more or less difficult and we can tell mathematically how long it's going to take somebody to complete this task. So I can give you a task, Jonathan, and know that on average it's going to take you two minutes to do it. Or I could give you a new task and know on average it's going to take you five minutes to do it or 10 minutes. So I can actually charge you, right. I can charge you in your time, charge you in your work. And anyone in the world seeing that what you build from out of this work, which is basically a number that you generate, can verify and validate whether they knew us, whether they saw what was going on. They can just look at the information and say, if they're in a bunker, they could look at it and say, oh yeah, this guy did 10 minutes worth of work."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":1965.54,"end":2004.24,"speaker":"Jonathan Pageau","text":"Okay, so that is. So I guess what I'm starting to understand is that is where the value comes from. The value comes from provable time energy that is spent. So these numbers don't come out of a, out of a box. You have to spend so much energy and time in order to generate a coin. And therefore that is the value. It's like a sweat equity type value where you know that so much. Okay, that's useful for me to think about it that way. All of a sudden it's not so much just a magical thing, like a completely random process."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":2005.12,"end":2092.47,"speaker":"Vin Armani","text":"Yeah. And it's important for everybody to think about it that way. And it's why it's so frustrating to me when I see people who are Bitcoin thought leaders who spend zero time on explaining proof of work. They say, oh, it's a proof of work thing, and then they just go right past it. But proof of work is everything in Bitcoin. All of the other stuff had been done. There's also public key cryptography, which is doing something similar in that it's utilizing the laws of nature, it's utilizing things that we can have faith will be the same and are verifiable by everyone because it's utilizing math. And basically in that way it's proving not ownership. But actually it's very interesting. It's proving that you know a number that is fundamentally unguessable. So it's not ownership, it's actually knowledge. And this is why I tell people that this is not a technology, this is an epistemology. Because really what it's about is it's about knowledge and the verification that someone knows something without knowing you, without seeing you. You can present me some set of data and I can say, oh, this guy knows a specific number and this is your private key. This is how you're able to spend your Bitcoins. And by the same token, you can present me some other data and I can say, oh, this guy has done X amount of work, X number of what's called hashes."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":2092.55,"end":2114.71,"speaker":"Jonathan Pageau","text":"So what's interesting is that right now it's actually this proof of work which is being attacked, that is the media, let's say the official channels are attacking proof of work as the reason why Bitcoin is bad, why it's a problem because it's environmentally unsound, it's using up all our resources, et cetera, et cetera. So how, how do you see that strange situation?"}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":2115.35,"end":2189.99,"speaker":"Vin Armani","text":"Oh, it's not strange. So when Satoshi released the, the first version of the software, he released it onto a mailing list, a cryptography mailing list called the Metsdao cryptography mailing list. Now this was a mailing list with basically professional cryptographers, mathematicians, an industry list. And there were criticisms. There was only one cryptographer, one old school cryptographer called Hal Finney, who was a big supporter on the list. Now, I've written a lot and I believe Hal Finney actually was Satoshi Nakamoto and that he had basically given himself a double identity so that he could support himself. There's also some other things that Hal had been through. The cryptography that's involved years before that was considered a munition by the government. And there's one of the first programs called Pretty Good Privacy that was developed by a gentleman named Phil Zimmerman. He was actually investigated for an arms control violation by the Department of State. He was potentially going to be held up as the same that you would for like selling a nuclear weapon. That's. Yes. Why?"}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":2189.99,"end":2193.47,"speaker":"Jonathan Pageau","text":"I don't understand. Why would that, why would that, why would that be the case?"}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":2193.95,"end":2436.75,"speaker":"Vin Armani","text":"This is. Yeah, Good, good. So cryptography, the history of cryptography, this type of cryptography, mathematical cryptography, dates back to World War II. And this is what was going on with, at Bletchley park with the Enigma machine and you know, cracking the German, the German codes. That was where the first computer was actually made, the first digital computer colossus. The reason for the existence of the computers that we have was this was cryptography was codes. And these were considered to be basically state secrets. They were completely in control under the control of the nsa. I'll read you. I found an interesting quote lately that I said I'm going to read this to. So in 1976, when this technology was basically dropped by, there's six guys that are involved. One of them is a guy by the name of Whitfield Diffie. And his quote, he said, after they released their paper, he said the National Security Agency's crypto monopoly was effectively terminated. And this is what he says, he says every company, every citizen, every now had routine access to the sorts of cryptographic technology that not many years ago ranked alongside the atomic bomb as a source of power. That's how valuable the cryptography that's used in Bitcoin was viewed, let's say from World War II through the 70s and 80s. What's being used is munitions grade cryptography. If you send a message using this, no government can decrypt it. So these were, states were holding these things as secrets. And so the idea to think that it's like these are, this is a weapon of incredible power, incredible power. And people don't know that that's the case. Right. So this is one of the things, this is why I do my school the second day, we spend it all on cryptography and, and showing people that like, yeah, right in your bitcoin wallet is the capability for you to do this type of cryptography and send these types of messages. Most people have no idea. This is not part of the number go up narrative going back to Satoshi releasing this when he released it, one of the founders of the Electronic Frontier foundation, as a matter of fact happened to be on that list. And his criticism at that time, this is 2009. This is a day after it's released. No one is even mining it. It's running on three people's laptops. He's saying, I just wish that we don't have more computers running this spewing carbon into the atmosphere. Okay, that's hilarious. Yes. And this is 100% true. The emails are there, you can go and look. So this is a purely ideological attack against something that is a threat to something else. And that's what people should understand. Bitcoin does not use very much electricity whatsoever. And especially if you've got one of these secondary networks, there's Bitcoin like BTC that's using, I don't know, 90% of the electricity. And the reason it's using that much electricity is because the price is so high. Because as we're talking about, the value is correlated to how much work is being done. So if it costs me $10,000 to generate one bitcoin, I obviously can't sell that bitcoin for less than $10,000. And if Bitcoin is going for $50,000, I've got to do $50,000 worth of work. Well, that $50,000 translates to more electricity. But the price is apropos of nothing, Jonathan. That's the point. The price is only related to how many people are coming on to into the. Into the number go up Cult."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":2437.71,"end":2459.95,"speaker":"Jonathan Pageau","text":"But there is a way in which that proof of work is, is going to stabilize the price like it's going to. It is going to limit it going back to $15, let's say. Because if that happens, then the whole system stops. Everybody stops mining. If it goes down to a certain level, it just stops. No. You don't think so?"}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":2460.38,"end":2492.55,"speaker":"Vin Armani","text":"No, no. People would keep mining. They would just. It would use a lot less electricity. The issue and the number go up. Colt will present this and to a certain degree it's correct. The issue is that the way to disrupt the network is to acquire 51% of the total amount of work that's being done at any given time. So this is a 51%. If you do that, you can control the consensus. This is built in. This is the threat."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":2493.35,"end":2499.75,"speaker":"Jonathan Pageau","text":"So the more it's worth, the more work is being done to outperform the others."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":2500.31,"end":2603.73,"speaker":"Vin Armani","text":"Yes, and the number go up. Cult calls this security. They say the higher the price, the more secure the network is. This is not really true because there's only a limited number of things that you can do with that 51% and you can always cut that. If you are, you know, if you have a community that's relatively small and some attacker comes on, it's relatively easy to switch out the software and to cut them out of the loop. And this has actually been done in bitcoin forks in what have been called hash wars. So this is like not theoretical what I'm saying. This has actually been done on multibillion dollar networks where you have a few miners who have a lot of the hash power and they've sent secret versions of software to one another to cut out an attacker who's been there. So there's a lot of ways to mitigate it. There are bitcoin coins that have traded for $50. Like I say, there was a time when bitcoin was trading for $15 and it was just as safe and secure then as it is now in terms of the actual attacks or anything that happened to it. It's really? If there's one network, yes, it's a problem if it's just btc. But if I'm like, I don't need that network. I've got my community that I'm trading with, we'll just fire up our own, and we'll just make it so that only we can utilize the network, no problem. So this is why I say there's two stories, and one story takes you down one particular path, and the other story takes you down a completely different path, where you realize it's a tool that anybody can use, that's open, permissionless, and anyone can fire up a network."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":2605.49,"end":2640.92,"speaker":"Jonathan Pageau","text":"So I guess one of the suspicions or one of the things that is strange about bitcoin is the fact that it was created by an anonymous person. And so this, of course, opens up the thought that there's something else going on, that it's actually being released by some kind of state actor or something more nefarious. What do you think is the reason why it's been released by an anonymous person? Like, why do you think this was? Was it that maybe the danger, this cryptographic danger of being suspect by governments or something like that?"}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":2641.32,"end":2792.77,"speaker":"Vin Armani","text":"Yeah, well, like I say, I believe that it was this gentleman, Hal Finney. So he was the first person to support bitcoin on this mailing list. He was the first person besides Satoshi Nakamoto to mine. He was the first person to receive a bitcoin transaction. He received the first bitcoin transaction. He was also the first person to ever tweet the word bitcoin. So his Twitter handle is still there, alfin. And you could go down to January 9, 2009, and there's a tweet that says run in bitcoin. And it's interesting because it's kind of a pilgrimage site for bitcoiners. You'll see throughout the years, people have gone and they leave little. It's like going to a tomb. Because he died of ALS, actually. Okay. So he became paralyzed. He died in 2014. And his disappearance and becoming paralyzed coincided with Satoshi's disappearance. But Hal Finney was the second developer also on this PGP project. So he actually witnessed his friend Phil Zimmerman. He was actually working for PGP until he died. He witnessed his friend Phil Zimmerman be investigated and almost be. And go through the whole thing. It's a crazy story. MIT ended up sort of stepping in and printing the code in a book, and they said it's freedom of the freedom of the press and all. It's really cool. And it started the whole free software, open source movement. Hal Finney was involved. So having gone through that, it would have made a lot of sense for him knowing that there was a possibility that this would happen to create an anonymous identity and to put it out. The good thing about Bitcoin is that the concepts that Bitcoin uses are, they all precede Bitcoin. So these are all concepts that had been tested for decades. And the cryptography, the hashing, all of that is you use it every day. So we actually couldn't do commerce on the Internet without it. When you see that little lock up on your browser bar when you go to an e commerce site and you see that lock, click on that, go into the certificate. You'll see words like SHA 256. That's the hashing algorithm that's used in Bitcoin. You'll see rsa, that's the public key cryptography system. So these are all used and the code is open source. So it's been gone over with the fine tooth comb since that time. There's nothing hidden. This is known technology. It works. It can be reconstituted from scratch."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":2794.94,"end":2859.24,"speaker":"Jonathan Pageau","text":"Yeah, I think the state actor thing is mostly not Bitcoin itself, but rather create, how can I say this? To create a threat which is strong enough so that will justify the government creating its own digital currency which will have many strings attached. It seems like this is happening now. I saw an article recently about creating programmable digital currency in England, for example, where. Where in the code of the currency you can decide what it can be spent on. You could decide that the money will lose its value after a certain time. They can only be used by certain people. This is something which is live happening right now in terms of. And it seems to be in some way a reaction to the crypto world saying, okay, well, we need to now create our government, you know, because this is all dangerous. This is, this is dark web, this is all this illegal stuff. We need to create our own digital currency to compete with that. And people will just accept it because the rest is dangerous, like the other stuff is dangerous."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":2859.8,"end":3184.41,"speaker":"Vin Armani","text":"Yeah, well, let's go down that rabbit hole for a minute because it's actually, it's actually much crazier. And I think your audience will appreciate this and I urge them to go down this rabbit hole themselves. So what you're talking about is a central bank digital currency that's also called the cbdc. And there is a CBDC that was created by the Federal Reserve that is ready to be released the Federal Reserve had actually announced that they were going to release what they called a discussion paper. It's basically a white paper. They said that was going to happen in July. It hasn't. There's some legislation that's in this latest bill in Congress that is probably what they were waiting for. But what's interesting about this is it was created, this central bank Digital currency was created by the Boston Fed and the MIT Media Labs Digital Currency Initiative. Now what's interesting about this digital currency, so people can go look it up. This is not secret. You go look up the Digital Currency initiative at mit. That's who created it. You can go and look up Federal Reserve and that Google it, the cbdc. This is known. What's interesting about this digital currency Initiative is in 2016, MIT Media Lab reached out and hired the three basically top BTC Bitcoin developers. The guys who held the keys, what we call commit access the keys to the code. The people who were deciding what goes into the code and what doesn't go into the code. So this is Gavin Andreessen, who basically had the keys handed to him by Satoshi Nakamoto. He was like, let's say the heir of Satoshi Nakamoto, now disgraced within the bitcoin community. Corey Fields and Vladimir Van der Leyen. Vladimir Van der Leyen is particularly important because he's considered fundamentally the lead developer. He's the guy with the most. He's the bishop, right? With the most power to be able to determine what goes into the code or not. So they hired them in 2016 because these guys were working in an open source world and they had no income. So they had no direct bitcoin income. And so along comes MIT and says, come and work on this research project. You can just do bitcoin research and all of that. Now if people go back, what's great is to go back on the Wayback Machine and go and look at the Digital Currency initiative site in 2016 and you scroll down and you see that indeed from the very start they were working on central bank digital currencies from the very start, two months before the Federal Reserve was going to announce that yes, this had been created for them by mit. Vladimir Van der Leyen, who was the last one left, basically quit at the Digital Media Lab, quit at the Digital Currency Initiative and went basically silent. He basically just went silent, really. So what we come down to is the lead developers of bitcoin, of btc, of bitcoin core, the main software, are the ones who built the exact currency that you're talking about for the Federal Reserve. They're the ones who built it. Because again, money, at the end of the day, it was about, well, I got to feed my kids. Like, how long is that? You know, this is. We're seeing that this is the narrative, right? The I gotta feed my kids narrative is leading to everything. Now, one additional tidbit that's very interesting. The head of MIT Media Lab is a gentleman by the name of Joy Ito. Right around the time that the Epstein scandal broke, he was forced to quit. He was forced to quit. Why was he forced to quit? Because it was found out that around the exact same time that they started the digital currency initiative, Jeffrey Epstein was donating a ton of money. And there's emails, some of it even in the name of another individual that we've seen quite a bit, who used to run a tech giant and is now retired from out of that. In his name and emails saying, this is coming from that gentleman. But please mark it down as coming from Epstein. Okay. Now, I'm not saying what that was going to fund, but when you understand that the Federal Reserve was secretly funding their centralized version of Bitcoin using the exact characters who were at the same time working on bitcoin, core people can go down that rabbit hole themselves. But it's just like all of this is real, right? So, Joy Ito, he was disgraced. He had to resign. It was a big. You go look at New York Times, all of that, because Epstein was giving money under the table to them and he was hiding it. Yeah. So it's coming. No. So, Jonathan, again, that's coming. That's here. It was built by the same people that built bitcoin. And it's not that it's a reaction to bit. It's not that it's a reaction to bitcoin because bitcoin's bad. It's that it's a reaction to Bitcoin because bitcoin is powerful. So they were like, no, we need to have our own Bitcoin. But no proof of work. None of this stuff we control. We control it centralized. But all the rest, the cryptography and everything, because bitcoin works."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":3185.21,"end":3197.13,"speaker":"Jonathan Pageau","text":"So it'll continue to be a kind of fiat currency, but it will be digital and it will be traceable. And it will have all the. Let's say the cryptography. Cryptographic power of."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":3198.09,"end":3198.65,"speaker":"Vin Armani","text":"Yep."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":3198.65,"end":3207.21,"speaker":"Jonathan Pageau","text":"And programmable as well, which means you can get money in your account and then if you write the wrong thing on Twitter, the numbers can vanish."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":3207.69,"end":3231.24,"speaker":"Vin Armani","text":"Yes. Yeah. Or just Be locked. Yeah, it doesn't matter if it vanishes because they can also create as many as they want. Right. Because the proof of work is what's controlling the emission schedule. But when they want to print new money, no problem. Yeah. They just press a button. Still, believe me, they're not going to give themselves a 21 billion limit. Okay. Like that's not what's going to happen with the central bank."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":3231.88,"end":3237.48,"speaker":"Jonathan Pageau","text":"But it's mostly the idea of being able to lock people out of the economy in ways that we haven't seen yet."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":3237.88,"end":3250.99,"speaker":"Vin Armani","text":"This is, I mean, that is the key and it's not just lock people out. I think actually one of the most nefarious and frightening scenarios is expirable money."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":3251.39,"end":3251.95,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":3252.03,"end":3258.11,"speaker":"Vin Armani","text":"So they send you the funds and they're like, if you don't spend this in 30 days, it's gone. You know, money won't self destruct."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":3258.35,"end":3266.27,"speaker":"Jonathan Pageau","text":"Soft communism. You know, you get your allowance and you also can only spend it on certain things and then it, then it, then it disappears."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":3266.27,"end":3299.24,"speaker":"Vin Armani","text":"Yeah. So this is, this is here. Yeah, it's ready to be, it's ready to be released. I can't imagine that it's not going to be tied to all of these other things. Yeah. And that same digital currency initiative built for Japan, for China, for. There were a few, there's like seven or eight countries that they built for, for uk. So it's all coming from the same place. It's all coming from the same place and it's all based around the fundamentals of bitcoin."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":3299.88,"end":3321.1,"speaker":"Jonathan Pageau","text":"All right, so I guess like now that we're at the end of this very dark scenario, I do want to hear about, I do want to hear about. And of course I'll laugh when I say that I do want to hear about how this, how this whole process kind of led you to orthodoxy. Because it, to me it seems like a strange, just. Yeah, a strange thing how these things can be related."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":3321.58,"end":3391.25,"speaker":"Vin Armani","text":"It is, it is very strange actually. So, you know, as I said, I've been working in this space for, since, since 2017, full blast. And I've gotten a chance to work with some of the biggest companies on really great projects. But I've also been lucky that I've been able to work with individuals who I was ideologically aligned with. So it hasn't been these sorts of exchanges and the coinbases and whatnot. It's been companies like Bitcoin.com and others who are more focused around this vision of sovereignty, of financial sovereignty and people Having that in bitcoin, being able to deliver it. When all of this goofiness started in 2020, I was living with my family in Southern California, and I knew this is not the place to be. So I saw in March when the thing started happening, I was like, I know this pattern. I know exactly where this is going. And we had been planning to move to Saipan, but it got very much moved up, and we found ourselves here April 5th."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":3391.49,"end":3394.77,"speaker":"Jonathan Pageau","text":"Oh, because this is recent, I thought you'd been in Saipan for a while."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":3394.77,"end":3526.52,"speaker":"Vin Armani","text":"No, no, we came here because of that. So we came here fundamentally as refugees. And I've had a strong spiritual bent, and I've been involved in a lot of different, very powerful things. So I had a very long relationship that many people know, many years with ayahuasca and plant medicine and those types of things. So I had a. You know, I had a. I've always had a strong understanding of the mystical. Like, the realness of the mystical. In other words, like, no question that, like, there are spirits, there is a spirit world. Like, they interact with us. You can speak to them. And I think people who have had the experiences that I've had, you walk away like, oh, it's real, right? Like real shamanist, shamanism type experiences. But in about. In 2019, 2018, I. I started delving into. Back into Christianity. And it was through. I'd seen a Christopher Hitchens speech around the time that he was, you know, dying of cancer and where he said that he was reading Darmaid McCullough's book, Christianity A History of Christianity the First 3,000 Years. I said, oh, this is very interesting that this avowed atheist would be, like, crowing about how excellent this book was. And so I got it on audiobook, and it was sort of over the course of the year when I would do yard work on Sundays, it was like, okay, let me just dig into this. Right? Hadn't been to church since I was a kid, you know, had been exploring all of these other things, and it. It really. I was really struck, getting back into the ancient church about how little I didn't know in terms of that history, and then started into a practice of prayer. Of course, I don't know what I'm doing and fasting. And I started to get some. And I was working on bitcoin and some very difficult problems at the time. And through the fasting and through this, what I now understand was developing a system of prayer. Through that, I actually started getting. Solving all of these problems. Like, I would be in the middle of a fast. And I was getting. And I was like, okay, this is so kind of very mercenary, you know what I mean? Where I was like, okay, I'm getting."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":3526.52,"end":3528.36,"speaker":"Jonathan Pageau","text":"So much insights from the past."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":3528.6,"end":3782.07,"speaker":"Vin Armani","text":"Yes, exactly. And so when I. When I came to Saipan, I said, well, I'm going to actually take up. And. And where I had gotten the fasting stuff was. It was mainly a lot of Pentecostal that I was consuming, Pentecostal stuff. And I was like, oh, this is very interesting. And it was resonating with me. Like, I said, oh, there's a spirit thing. And so when we got here, we ended up. We had this beautiful house right on the beach that was. That we lucked into. And I just started, morning and evening, a practice of prayer. And I don't know. I don't know how it was that I started doing the Jesus prayer, right? So I don't know how I ran across it. Maybe it was from a Pentecostal thing. But I said, I'm going to do this, and I'm just going to. This is where I'm going to go, and I'm going to start with this. And it was actually in. It was coming back off the beach that I had this flash that said, you're going to do this school. It's going to be called Bitcoin Mystery School. You're going to teach these things. You've been working on these things. You're going to teach these things. And I was like, nobody wants to. What? This doesn't even make any sense. But I said, okay, I'm going to follow it. Because I was writing my book. I was getting a lot of insights from my book, from this practice of prayer. And I just announced, hey, I'm going to do this thing. Put a thing up. Somebody who I had spoken to in the past reached out to me and said, cool guy. And he said, hey, there's some guys in my parish. I'm orthodox. I knew he was orthodox. There's these guys in my parish. We would like to all do this as a group. We've been talking about things that may be needed in the future. We think bitcoin's important. We'd like to do this as a group. I said, oh, awesome. You guys can be like my guinea pigs. I'll do a private course. You guys will be the very first course. And it was in that course that one of the participants in the course was the priest of the parish. Okay. And it was in. It was. So it was in that time and sort of some. I don't know, there was something going on with those guys. It was really awesome. And him in particular, I was like, he's a really unique guy. And I was like. And I said, I wonder if he's got any YouTube videos or anything like that. And I just started that night, in between the first and second, I just started watching all these videos of him. There weren't that many, but things that he had done. And it just really spoke to me. And sort of at the end of the class, I said, hey, Father, you know, I don't know if you're open to this, but could we talk about maybe you helping me with my prayer? Like, I would like to be more effective with my prayer. And. And so it was over the course of several months of him and I just having a. What's become a very deep relationship that obviously my prayer got much better. And he, you know, sent me Orthodox prayer book and started talking about if you want to do this. Little did I know that I was becoming a catechumen. And, you know, then. Then things just. Things got really, really potent and powerful. And honestly, to a point that was beyond, like, I was going really far in terms of my prayer. I had, like, I say I had previous. This previous shaman shamanistic experience. So I was like, oh, I'm going to try to approach it like that. And things just got actually really serious to a point where I was like, oh, this is too much. Like, this is. I can't do this. And so it was funny, like, the next time I said, I need to talk with you the next time we had a conversation. And, like, what I was wanting to say to him was, I need to be at the church, like, because I would like to continue this practice, but I can't do this outside of a framework of the church. I realize that now. Right. Like, I'm going to hurt myself mentally, even physically. Right. So I was like. And it was. And it was through that that he said, okay, then, let's. Let's formally start your catechism. And so we did that. And then just through. I mean, it was very providential the way everything fell into place, that he. He and a reader from his parish, you know, we arranged. Brought them out here to Saipan. They, you know, yeah, we set up a little chapel. It was beautiful. They did the first Orthodox services that had ever been done here. Baptized me in the ocean. Actually happened to be, crazily enough. I'm married to a Russian Orthodox woman and my kids are baptized. Yes. And my children and my Children are baptized Russian Orthodox."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":3782.07,"end":3784.39,"speaker":"Jonathan Pageau","text":"This is for. How long have you been married?"}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":3784.68,"end":3797.08,"speaker":"Vin Armani","text":"I have. I have six years. I have a five year old. Yeah. I have a five year old and I have a. She's almost three. Three year old, two and a half year old. That those were the only times I had ever been in a Orthodox church where the baptism."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":3797.96,"end":3798.76,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":3798.84,"end":3801.2,"speaker":"Vin Armani","text":"But it's so interesting. Like, she never pushed it on me."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":3801.2,"end":3802.28,"speaker":"Jonathan Pageau","text":"Yeah. Right."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":3803.32,"end":3878.36,"speaker":"Vin Armani","text":"But so obviously it really fell into place. And then. So they came. Came here, did my baptism, sanctified our marriage in the church, which is beautiful. So we got to have a church wedding here. And. Yeah. Since that time, it's actually crazy things have happened after they left a few weeks later, randomly. We're out on the beach. Fourth of July. Fourth of July, as a matter of fact. We're out on the beach. I take my daughter into the water. I turn around. Sitting in the seat where I had been sitting is a priest. Orthodox priest in Saipan. Exactly. And I'm like, what? And we were out there celebrating. So all of our friends were there, and their mouths are, like, wide open. He's in a. He's in a full black Cossack, big silver pectoral cross. My wife is crying. And it's like, he's a mission priest. He's got a parish in Taiwan. He answers. He's like, got this. I forget what. I forget what it's called. It's kind of. It's like the equivalent of like an embassy sort of thing that the Russian church does. So he answers directly to the patriarch. And so he said, you know what? No Russian priests have been here for 200 years. We have the records. But I just decided that I was going to come here and Guam. And you people are the first people that I've ran into."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":3878.68,"end":3881.72,"speaker":"Jonathan Pageau","text":"And he didn't know you were Orthodox. That's hilarious."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":3881.72,"end":3960.89,"speaker":"Vin Armani","text":"Well, my. My wife saw him walking. Yeah. With his Cossack and everything. And she. Which calls him in Russia, and he's like. Comes over and sits down. And then I walk up and I'm like, why not? This is. This is incredible. And so. So then we got. We had more, you know, more services here. And actually some of the. The people who are here kind of. There's a little crypto community. Two of the brothers, after experiencing that, decided that they were going to become catechumens as well. So it was pretty crazy because it's been incredible the things that have happened here. Part of what was happening with Bitcoin was that the patterns and the reflection that I was seeing, and a lot of this is in the book that I wrote, Render unto Caesar, was that it really is a reflection of the Trinity, the things that are happening in bitcoin. So the way that bitcoin lays itself out, the pattern that's there, it's very much an echo of the way that the Trinity is laid out in the tradition. And so these were the types of things that were happening. And so for me, I tell people it's because bitcoin brought me to orthodoxy. And so it's just the series of events that happen, because it makes no sense. The way that this whole thing happened. It makes no sense. The way that it's laid itself out makes zero sense. But yet here I am."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":3961.13,"end":3976.01,"speaker":"Jonathan Pageau","text":"Yeah, here you are. That's for sure. So can you explain. Can you give us a hint of why bitcoin, how it manifests the Trinity? Because maybe it's too complicated, but when you said that, I was like, okay, I would like to know that."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":3976.25,"end":4089.64,"speaker":"Vin Armani","text":"Sure, sure, sure. So bitcoin is basically the interaction, as are so many things, of some set of foundational and fundamental rules. Randomness and consciousness. Right? So. So this sort of potential. Potential and randomness, this is what's happening in the proof of work. So what proof of work is. Proof of work relies upon basically the law of random numbers. And so that's what we're. We're utilizing. When you do proof of work, what's happening is that you are. You're basically, let's say, rolling gigantic dice. And every single time you do this, it's called a hash. And what comes back is a number. And you're fundamentally trying to roll below a certain number. That's astronomically hard to do. So if you tried to do this by chance, to give you an example, we're talking about exahashes that are being done on these bitcoin networks. So it's a million million million of these roles. So that's a one with 18 zeros that you have to do every second in order that every 10 minutes, you would come up with this number. So it's like. It's actually that it's less likely. So there's a lower probability of finding a bitcoin block, like, on a per hash basis than a virgin birth would be. So it's like they would say, well, a virgin birth is, like, technically possible. Even like a materialist, they'd be like, okay, yeah, there's some. And if we had this confluence of events and you could lay it out that it would be like, oh, it's a one in a quintillion quadrillion chance that it would happen. Well, finding a Bitcoin block is literally less than that, less probable than that. That's why you got to do so many roles. Right. So you have this entire sphere of potential."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":4090.68,"end":4091.4,"speaker":"Jonathan Pageau","text":"It's basically."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":4091.92,"end":4092.12,"speaker":"Vin Armani","text":"Yeah."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":4092.12,"end":4097.68,"speaker":"Jonathan Pageau","text":"So a budget die is being rolled and then you have something which recognizes the right number."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":4098.56,"end":4146.72,"speaker":"Vin Armani","text":"Yes. So, so some set of fixed rules. So these would be like the consensus rules, but that are also related to these mathematical truths. Right. So they're built on top of the one plus one equals two. Right. So we have these truths. We have a, we have a, A box in arena, whatever you want to call it. We have some framework inside every. In which everything is working. And this is the framework of nature. And then you have this very real probability that's going on. And then you have the interaction of logos. So it's that the logos actually is interacting with the. So the consciousness of individuals can change some aspects of the rules. The consciousness of the individuals is actually needed in order for somebody to turn on their machine and actually get it going. Right. Like it can't work by itself."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":4146.96,"end":4147.36,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":4147.6,"end":4153.52,"speaker":"Vin Armani","text":"So there's, so there's this three way. So you have this reality, you have the system that's working."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":4154.08,"end":4157.44,"speaker":"Jonathan Pageau","text":"It also needs, it also needs like something to care."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":4158.16,"end":4158.6,"speaker":"Vin Armani","text":"Yes."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":4158.6,"end":4163.2,"speaker":"Jonathan Pageau","text":"Or do I need. You need a, you need an agent to care about this or else, like it's not going to happen."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":4163.84,"end":4211.82,"speaker":"Vin Armani","text":"Yes, exactly. Exactly. And so this is the very much to me in contemplation, in prayer. Prayer, in moving through this. And again, I go into it relatively deeply in my book. That it's. This very much to me is an echo of the sort of the trifurcation, if you will, of the one God into the three persons, into the eternal everlasting Creator. That is all. Everything into the potential of the Holy Spirit, where, where everything is. And into the, the Logos of the sun, into, into the care, as you say, into the human element. Right. And that. It's the interaction of all three of those that makes the system. Yeah. And so I'm not sure about much that for sure."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":4211.82,"end":4253.62,"speaker":"Jonathan Pageau","text":"I'm not sure about the Trinitarian. But what I do see for certain is like the creation narrative in Genesis, like the idea of heaven, earth and then man, or, you know, the, the, the perceiver, the, the. The agent which is able to act as a joining of the two together. So you have this like crazy potential that's bubbling, that's bubbling up all this stuff, you know, you have a pattern above, and then you have something in the middle which is able to perceive that which is valuable out of what is coming up, is able to say, oh, that one. That number is the one I care about. All those other numbers, they can just fall away. That's the one that matters. And then that is what kind of makes the system work, let's say."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":4253.78,"end":4324.55,"speaker":"Vin Armani","text":"Yeah, I think that's very accurate. And it is also that the numbers themselves. I mean, as you just articulated, it's not the numbers themselves that are valuable, because getting the same number on a future block is not. There's nothing there. It doesn't mean anything. So it's not just that you're looking for that number. Right. It's you. That you have to have a very specific number that's tied to a very specific history. Right. So. And that's the. That's the. As you say, that's the awareness. That's the consciousness that's looking at it. And so it. When. When the system is. Is looked at as it is, it's very different than. And it's very unfortunate to me that how it's perceived by the public when they talk about Bitcoin and why you're absolutely right to have suspicions about that story is that, oh, this is something that I buy, and then the number goes up, and then I sell it after the number has gone up, and here I am, and it's like, no, it's really a lot deeper than that. There's a lot more going on, and it's brand new."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":4324.71,"end":4374.78,"speaker":"Jonathan Pageau","text":"All right, listen, we've been going for quite a while, so I think this. You've definitely brought me at least along and understanding the manner in which it generates value and at least how we can understand it as a kind of this cosmic pattern of how something has meaning, let's say. And so it's helpful. I still need to. Definitely need to think about it. And interestingly enough, I guess I'm being dragged into this right now. And so I will start to kind of experiment it in participation with my son. And see, I don't. At least for now, it's not also, I don't. How can I say, I'm not attached to it? And so, like, for me, you know, we put it in. Put in a bit of money, and we're just kind of watching it. It's like. It's like an experiment for me. So I'm just trying to figure out what it is. And so, yeah, so I will continue on. Thanks for your Time and."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":4374.78,"end":4400.31,"speaker":"Vin Armani","text":"Absolutely. Well, what I would say, Jonathan, with that is pull it off the exchange and put it in a wallet and send it between your son, send it to people, use it. Right. Because I understand, like you, you've put in the bit of money and you're watching it go up, but it's like, if you want, if you do want to feel it, if you do want to explore it, like, you're going to need to use it, Right."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":4400.31,"end":4440.69,"speaker":"Jonathan Pageau","text":"So you're going to need to seem like there's ways, like the idea that you could use it. It only works if you exist within a network of people that are like, you would. I would need to be like, let's say, in your network of crypto users, where we all recognize this and so we can use it to exchange between. Amongst each other. Right. But right now, let's. I'm not in that. I don't have a world around me where I can say, oh, the guy who comes in, I don't know, guy comes to mow my lawn. And so I send him some crypt. I send him some bitcoin as a payment for it, let's say. But that doesn't. At least now, at least in my world, that doesn't exist."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":4441.31,"end":4484.19,"speaker":"Vin Armani","text":"Well, maybe, maybe what we could do is maybe for your carving class or one of those things, start accepting cryptocurrency. And if you want some help with that. Yes. And then you can be in the community. I will promote that to my community and tell them, go get into Jonathan's class and pay with crypto. I sell all my books for crypto. I sell my classes for. For crypto. So it's like that will give you the opportunity. There's nothing that allows you to feel the power more than actually not buying it and waiting for it to go up, but to actually sell goods and services and your labor and to get it in exchange to use. I would love to help you."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":4484.35,"end":4484.71,"speaker":"Jonathan Pageau","text":"All right."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":4484.71,"end":4486.35,"speaker":"Vin Armani","text":"Yes, I would love to help you do that."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":4486.51,"end":4503.92,"speaker":"Jonathan Pageau","text":"All right. I will definitely keep that in mind because I think that I agree with you that it's the only way that I can really understand what it is. And so. So we'll see what happens, everybody. We'll move slowly down this path. So thanks. Thanks for everything, Cyprian, and for sure we'll talk very soon."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":4504.24,"end":4505.04,"speaker":"Vin Armani","text":"Thank you, brother."}
{"episode_id":"SW - #206 - 2021-12-06 - Vin Armani - The Bitcoin War","start":4505.84,"end":4567.85,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon, the Pageau videos as well, and on Subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
