{"episode_id":"SW - #207 - 2021-12-13 - The Symbolism of NFTs","start":0.24,"end":1396.45,"speaker":"Jonathan Pageau","text":"So a few weeks ago I announced that I was going to be doing an NFT project for our graphic novel God's Dog. And I guess I was kind of surprised at the reaction. Super positive, extremely negative. And it seems to be turning into one of the most controversial things I've ever done, which is strangely hilarious. But it gave, seems to give an opportunity to maybe talk a little bit about the symbolism of NFTs or which will end up being something about understanding a little bit better the symbolism of the margin, the symbolism of what Mathieu in his book called the symbolism of time. And so I did call Mathieu and we had a long conversation on the phone to try to see how would be the best way to present this to you. And so here is the result. We're going to talk about the symbolism of NFTs. This is Jonathan Pageau. Welcome to the symbolic world. So everybody these days is talking about NFTs for good and for ill. There's a lot of buzz around them, especially since the Bored Ape Yacht Club with which is probably the most popular NFT scheme out there, was on the COVID of Rolling Stone magazine just a few weeks ago. And so everybody's talking about it and I'm seeing a lot of people make fun of it, saying it's a scam, other people saying no, that it's the future. And so, you know, what is going on? Why is this, let's say, why, what is the big deal? And so for those of you who don't know what NFTs are, they're non fungible tokens, that is, they are basically contracts which declare that you own a digital property. That's what they are, you know, and so they have several uses. But for now, what seems to be the main use of the NFT is in the art world. So you can buy a piece of art, a JPEG or a video or some sculpture, and then you will have a proof that you bought it. Usually those artworks will be sold in, will be sold in very limited amount, either a one, a one print off or maybe just a few. And so you get this contract basically that you own the NFT and that you own this digital artwork. The contract is on the blockchain, usually through Ethereum, but it can be done through other, other cryptos. And so your, your ownership of it is inscribed on the blockchain, basically. So you can transact it, you can sell the NFT, you can buy the NFT and there's a market. NFTs go up in value, sometimes they don't. There's a lot of stuff out there that doesn't meet, that has no value. And there's some things out there that are insanely valuable. You know that NFTs that are worth hundreds of thousands of dollars. And so the big problem that people are pointing to is that there is no direct relationship between the owning of the NFT and the object that you're owning. So if you buy an NFT of a piece of artwork, you own it in the manner that, let's say not even you own it in the manner that you have a contract saying you own it, but you don't own the copyright on that image. The artist owns the copyright on that image. So you're not allowed to, let's say, print it out in a book and sell versions of it. It's the artist who has that capacity. And because it's a digital artwork, let's say it's a jpeg, then that JPEG can be copied by anybody, can be screen grabbed by anybody, and can be shared online in the same way that any other JPEG or any other file is shared. And so this is why people are saying there is a scam is because let's say in terms of ontology, in terms of just reality, there is no connection between you saying that you own the thing and, and you actually owning the thing. So if I buy a car and then I have a contract which stipulates me buying a car, then I have the contract which proves that the car is mine, and then I drive the car, I use the car, and if someone takes the car from me, then they're stealing the car. But with an nft, the problem, this is why people are saying it's a scam is that it says you own the thing, but, but you don't actually own anything. In practice, anybody can copy the JPEG and share it around. And there has been some funny memes recently about people getting angry at others screen grabbing their NFTs, which, this is the Internet, folks, obviously this is gonna happen. And so most people just react to it and think that it's hilarious that people would be offended that these NFTs are getting shared one way or another. Other similar things can be very annoyed at NFTs because it seems to be doing what they don't like about the money system, which is that there's no relationship. There's just these contracts that are there that have no connection to actually in reality owning anything. It ends up being a weird kind of prestige. Maybe you know, this proof of purchase that is just that Just makes you seem important and. Or a kind of pure speculation on a market that is. Seems very absurd to many people because like I said, you actually don't own anything. And so I could make a painting and I could sell it to someone. I could take a picture of that painting and then sell it as an NFT online. And so who is like, how. What does that mean that you have the nft? All right, so what is going on in terms of symbolism? So thinking about NFTs can help you understand a process which is the process of the separation of. Of heaven and Earth, the place where the identity and the manifestation actually start to pull apart and what it is that that means. Now, I've talked about it in several ways as well. Matthew talked about it in his book the Language of Creation. You know, I tend to talk about it in terms of the idea of the monster, for example. And so the monster has a confused identity. There's. We struggle to fit an identity on the phenomena that we're seeing. It can also be in relationship to something like the idea of parasites or the idea of the strange or something which is added onto something else. Mathieu talks about it in a way that can be very helpful, which is the relationship, for example, between bread and yeast. And so when you're making bread, you have the dough, you have the seed that is brought together with water into some dough. And so in order. But in order to make the bread rise up, what you have to do is you have to add a little bit of a monster inside the bread. So you take some live this living parasite bug of a yeast, and you add it to the dough in order to make it puff up, let's say. And so that is the role of the place where heaven and earth doesn't fit is that adds a lot of potential. You could say it puffs up your potential. It can have both a positive and negative effect. It's a dangerous game to play when you start to add, let's say, parasites to something. But at some point you'll notice that you do it all the time. So, for example, if you're eating something, let's say you make some chicken, right? So the chicken has a certain flavor. But what will you do? You'll add spice to the chicken. So that spice is not the chicken. It's a stranger. It's an alien thing that you're adding to the chicken in order to increase its flavor. Now, adding the spice to the chicken won't really increase its food possibilities, won't increase the nourishment that it's going to give you, but it'll increase the flavor, okay? And so you can understand it that way, the idea of like increasing the flavor. And so another good example to that is the idea of adding ornamentation to things. And so you have a chair and so you'll decorate the chair. Now, the decoration of the chair doesn't add to the capacity the chair has to hold you when you're sitting in. It doesn't add to the solidity of the chair, but the decorative aspect of the chair or the ornament, the adding of something strange onto the chair, like, let's say, a motif or a specific color or a specific thing that isn't related to the chairness of the chair, it will increase the experience of the chair. It will, let's call it this way, it'll increase the glory of the chair. That is probably the best way to understand it. And so. But it doesn't necessarily, like I said, it's a dangerous game to play. And so the problem, the question of NFTs helps us see what in a certain manner has been happening from a very long time, but now it's happening in an extreme way, which is that our entire money system is something about that, right? It's something about thinking about, let's say, a trade, a direct trade between two people, right? And so you have this direct trade. Let's say I have chickens, you have whatever it is, you have wood. And like we try to figure out, you know, bartering what the value of one is, what the value of the other in relationship. And then we create this trade. And so what happened in the world is that people created an intermediary step which was using precious metals. And until then it was all kind of holding together. So we have this precious metal that we use to trade different things so that it's easier. It kind of, let's say it lubricates the transaction, makes it very easier for things to kind of move towards each other. And so that was already one thing. But then when we started making actual paper money, when we start having promissory notes where the money itself is nothing, but we add this to the process in order to increase the possibility of trade. And the more we increase it, right, the more that we diminish the relationship between the gold or the metal and the promise and the paper and this more kind of fluffy, random thing, then we're able to increase the value that we can access. We're actually puffing up the market. So you can see the way that that has increased with time in terms of money. And so that is one of the reasons why people don't like NFTs. A lot of people that are really into Bitcoin because they see Bitcoin as a solution to the problem, this problem of money, which is that with time what happened is that people separated value, let's say actual value of trade. They separated that, you know, it became disconnected from the amount of money that kept being, you know, put into the system. So when, for example, the US Went away from the gold standard, what happened is that it increased incredibly the amount of, say, puffed up the amount of value that you were able to access. But it also made, let's say the system brought the system in a dangerous place where it became very, it becomes more fragile, you know, and it, and it's increasingly makes it unrelated to value. So what it's going to happen is it's going to move into extremes because it's not holding together. It'll move up and down in value much more and, and it will create cycles of, let's say, of crash and boom and bust because it's disconnected from stability. So think about it as a really, as moving into the waters of chaos. The waters of chaos bring you up and down, up and down. We always think that the waters of chaos are just the breakdown. But the waters of chaos also include this kind of extreme of up and down where you have this, this movement from one side to the other. And so this is what it would kind of happened, of course, in the monetary system. And people think that Bitcoin is a solution to that. Now Bitcoin, I'm sorry to say, the more I hear about it, I do think that it's useful, but it also is part of this process because the things we value in the world, our food, you know, our relationships are, you know, let's say, places we can stay experiences, these are the things that, that have true value for humans. And Bitcoin is just another version of this added process by which we ultimately can get to the final thing. And Bitcoin is even in a certain manner because it is, because it is, let's say it's in a digital space, it's just numbers. All of this is also why it does this as well. For the same reason that the boom and bust economy does this. Bitcoin does this because it's disconnected from true value, which is the things that we care about in the world. Right? The idea that human beings should care about Bitcoin is always a secondary thing. It's A secondary thing to having a safe place to live in all of these things that actually make up our lives now. So what is the issue with the nft? And so the NFT does that also, but in a very, also very wild way. It, it's tends to, it's used, it's doing this on the bitcoin and the crypto world. And it's almost separating it even more, where there's even less of a relationship between a weird contract and the ownership of something which is, just doesn't, doesn't exist. Now this isn't the first time, by the way, that this has been tried, this has been experimented with in the art world. For example, in the, in the 1960s, there's an artist, his name was Klein, and he was an experimental conceptual artist. And one of the things he would do is he would create contracts with rich people. And so they would sign a contract where Klein would just blow a piece of gold leaf into a river and then the gold leaf would float down the river and that person would give the artist a huge amount of money to do that. The only thing left from that, that moment was this transaction that had happened. And so the person, basically the person only had the prestige of having bought that transaction. And that was the artwork. The artwork was just this, this momentary thing that was incapable, you were incapable of grasping and holding onto. And so, strangely enough, you could think that the NFT is the ultimate version of this notion in contemporary art, that art is the process, that you can actually own the object. And so that's an interesting aspect of the NFT as well. And so now if you look at the symbolism that I've talked about, you can understand how this NFT notion of the separation of heaven and earth has to do with monstrosity. And it has to do with ultimately with someone like St. Christopher, who is the dog headed saint, who is the patron saint of travelers, who is the patron saint, you know, the saint, I always call him the patron of the patron saint of the end of the world. So there's a relationship between the two. And so what we're trying to do is we're actually trying to create a NFT project that is taking into account, playing with this notion of the separation of heaven and earth and what that means, because one of the things that happens in the separation of heaven and earth is that it also reveals sometimes some of the highest things. And so, for example, the crown on the king is also a kind of separation of heaven and earth because it is this ornament that is put on top of the king in order to signify that that king is bigger, like is more than the normal person in virtue of something which is not in their body, which is not, let's say, attached to them, something which has been added to them from the outside. And so it has to do. So this adding can be a kind of adding of potential, which is dangerous, which is kind of this moving into monstrosity and moving into the fragility of the monster space, but can also be adding in terms of an adding of glory that is added above. And this definitely has a lot to do with a lot of my discussion about the relationship between death and glory, the relationship between the ornament below in terms of a kind of crass ornament and the ornament above in terms of this higher aspect of reality that is really like glory. And so what we're trying to do in our project is try to connect those two together. And that's why the NFT project is based on the idea of secrecy and the idea that in the graphic novel that we made, there are certain hidden patterns that are there that have to do with understanding the story in a deeper manner. So you can read the story, not get them, but underlying that there are certain kind of hidden patterns that are there which will continue on in the next books and will kind of play out the, let's say the, the deeper aspect of the story. And so that is what we're trying to include in the nft. And so the tiers of the different NFT that we'll be minting will be related to the revelation of these hinting at these secrets. And so each tier will have an, each higher tier will have an extra page that will hint at these different mysteries. Now, just because someone buys the NFT doesn't mean they'll understand the hint. And so there'll be an. The idea will be to play with that notion of ownership, of secret and of sharing. Because if you buy the NFT and then you get the hint, but you don't understand symbolism well enough to understand it, you might be tempted to want to share what you get because the downloadable will be, will be accessible to you only. But obviously you can screen grab it, you can share it, you can do all kinds of things with it that you want to, that you want, that you decide to do, realizing that if you share it, you might be reducing its value or you might be increasing its value. It'll be hard to tell in this kind of, in this kind of wavy, wavy world what it'll do. And so the tiers will have the, the lowest tier will be, which won't have any secrets, it will be 40 NFTs. The second tier will have 20, the third will have 10, 5 and then 2. And the very top tier will be the most precious secret because what will be in the top two NFTs will be an actual extra page, an extra comic book page, a story page, which will reveal a secret which will start to appear clearer and clearer as the books continue. But once again, just because you buy it, just because you see it, doesn't mean that you'll get it, that you'll get the hint. And so even at the top tier, that's why we wanted the top tier to have two, is that you'll always know that there's someone else who has it as well and one of you might be tempted to share it. And whoever shares it of course will be a hero to the others in that are interested in this. But then that might reduce the value, who knows? We will figure it out. And so that's what we're trying to play with in terms of the NFT and what we're hoping to do is of course try to show, participate in how this type of project is there to inflate, you know, the whole thing, you know, inflate it in terms of, let's say, attention that is getting more people to pay attention to this book that we're doing, but also inflate it in terms of course of the money we're able to gather. Because like I've said several times, I'm not taking any profit from this first book. I want to gather as much as I can in order to assure that we can just make all the next books without having to resort too much to outside funds, let's say. And so it is also a way to kind of inflate it in that way, in a way that others can participate in. Because obviously if we do this in this book and then we do it for the second book and the third book and the fourth book, each time we redo a new NFT project, then the ones before it will probably go up in value as well. And so that's the idea. That's why we want to explore the NFTs with this project. Because this story is about a dog headed saint and is about the edge of the world and the moment when earth and heaven start to separate. What can that mean in terms of danger, but what can that also mean in terms of opportunity? And so I hope this was helpful to kind of understand a little bit the symbolism of NFTs. I know people have crazy, like have a lot of ideas and a lot of our stakeholders in this and have strong opinions. And so yeah, go wild in the comments and we'll see what people think of my and Matthieu's interpretation of this. So thanks everybody for your attention. There's still a few weeks to back the God's Dog project, if you're interested, go into that. And if you're interested in the NFT project, you have to, you have to, you have to send me an email somehow or because we're doing it a little more in a closed space that that will include a Discord server. And so thanks everybody for your attention and I will talk to you very soon. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon the Pajo videos as well, and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
