{"episode_id":"SW - #128 - 2020-12-06 - October Q&A","start":12.56,"end":6191.66,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. So hello everybody. So I see two more V's is in the. The chat. Seeing him there makes me want to announce that on Halloween Night at the 31st at 10:00pm Eastern if I am right, two more piece. You can, you can correct me if I'm wrong. At 10 o' clock Eastern on Halloween night, Tomor is going to premiere the album which is based on my talk the Pentecost for the zombie apocalypse. And so I will be joining the stream as well. And so I've heard a few of the songs and I'm looking forward to seeing everything that he comes up with. I think that I've shared a few of the songs as well, but it's going to be a lot of fun. It's going to be happening if I understand it on, on the. I forget which channel. Anyways, I will, I'll be posting the link on social media very soon, so pay attention to my Twitter and my Facebook and I'll post it on YouTube as well in the, in the comment section. So. All right, so looking forward to that. There's a few things coming along in the, in the next few weeks. Very. So you know, you guys know I'm on Think Spot, but I'm not super involved on Think Spot. But nonetheless I'm going to be doing an event with of all people, with Sargon of Akkad with Carl Benjamin. You know, I've since 2016 and when Jordan Peterson kind of exploded, we, we drew attention to a bunch of YouTubers and a bunch of people who were talking about free speech. And Sargon is one of them. I, you know, he was a very kind of hardcore atheist and I've seen him kind of move his needle, be less aggressive towards religion, less aggressive towards Christianity. And so I'm really looking forward to having a discussion with him and seeing, you know, getting a sense of his perception of the symbolic worldview and how it affects his also his ideas about religion. So I don't have a date yet when that's going to be put up, but we're doing the discussion next week. I'm also going to have a discussion with Tom Holland, which I'm looking really looking forward to that. I read Dominion, which is excellent. You know, some just wonderfully written chapters in there. His chapter on the Enlightenment, his chapter on, you know, the that which a chapter that talks about the Enlightenment, the relationship to the French Revolution. There's also the chapter on kind of scientific discovery and ultimately, you know, the chapters about communism and just about the modern world in general are really, really wonderful. So I'm looking forward to that as well. So there are some things that I'm not so sure about. If you've read it, you probably could guess what are the things that I don't fully agree with him on, but it'll be interesting to, to have a discussion about that stuff as well. All right, so I don't know if there's something. No, it's not Tom Holland, Spider Man. It's Tom Holland, the writer of Dominion, which is a new history on Christianity. Tom. He's one of the guys he, let's say he's one of those people now that is in a post secular state where he realizes the importance of Christianity, the inevitability of Christianity in our cultural discourse and is trying to find his way and decide where he places himself on that question. So, yeah, interesting, interesting, interesting character, to say the least. All right, so the way this works, as people know, people who are on Patreon who, who, who are subscribed at $10 or more get to ask questions in advance for the Q and A. And so I will go through those questions. If people put in some super chats, I, if, if I still have energy at the end of the, the Q and A, I will check the super chats to see if there's something interesting in that. I know it's not ideal and some people complain that, you know, that they wish I could answer all the questions. It just seems like, at least for now, it's the most logical. It's the, the way that I can, you know, make sense of the questions. Or else questions are just too many. Even now there's already too many questions. All right, so here we go. So I'm going to start on the Symbolic World website. So Puma asks, is there a connection between Jacob's blessing over Ephraim, where he says that there that he will be a multitude of nations, and the fullness of the Gentiles that Paul talks about in Romans, since the word used for multitude in Hebrew has a connotation of filling. And Ephraim is representative of the northern kingdom which was absorbed into the nations and making those tribes that were part of the north indistinguishable. Although in the common translation it at least seems to be connected to Abraham being a father of multitude of nations. I don't know about the translation. One of the things I know that's interesting and this is something, you know, once in a while, like, I pay attention. YouTube has afforded us some interesting things Sometimes it's interesting to listen to kind of Orthodox rabbis or. Or Hasidic rabbis and listen to the way they talk about things. And if you. If you pay attention to the way they speak about things, you'll see that they often talk about the different nations of the world as basically being descending from Abraham in a kind of weird, strange, convoluted way. And so they. They identify all the different nations as different aspects of the different lost tribes of Israel and things. And so it's an interesting cosmology which also, you know, leads towards a kind of universal image of salvation, something which we often don't. People don't associate with Judaism. But I've seen, really seen rabbis talk about it that way. And so that's as much as I can say about that. So Adam asks. So Adam asks, hi, Jonathan. In Mark 8:22, 26, Jesus leads a blind man out of the village, heals him, and tells him not to return. I can't figure out why all this about leaving the village and not returning. Could you connect some dots? They come to Bethesda and some people brought a blind man and begs to touch him. Took the blind man by the hand and led him outside the village. When he had spit on the man's eyes and put his hands on him, Jesus asked, do you see anything? He looked up and said, I see people. They look like trees walking around. Once more, Jesus put his hands on the man's eyes. Then his eyes were opened, his sight was restored, and he saw everything clearly. Jesus sent him home saying, don't even go into the village. Well, I think that this is one of the ways to understand it is that at least at the beginning, you get the feeling that Christ wants to remain somewhat secretive about what he's doing. And so he doesn't want his miracles to be known at first. And so you can almost see it as a. As a seed that's kind of growing, you know. So he starts small with his disciples, does a miracle with his disciples, and then he starts to do miracles more and more. And he warns people not to talk about his miracles at the beginning. And then it's as if you can see like a kind of progressive revelation that happens through his story. I think that it has something to do with that. There are other places where he tells people not to talk about his miracles. But that's a really interesting story, that story. I was talking about that today with Neil Degrade of Durgport Robbins. We were talking about this story and how. What's interesting about that story is this idea that Christ, first of all, he spits on his eyes. And you know, you can kind of see it as this water coming from above. That's how I understand it. The fact that he takes the, the person outside the village, you can imagine it as some, the way that you can kind of see it is almost as if like he's taking the, the, the beggar, the blind beggar outside the village. So he's manifesting, he's bringing him out into chaos, you could say, or outside of the city. And so he's. Which is manifesting who, what he is, which is a, a blind beggar. So he's an outside figure. And so he's taking him to where he is and then he spits from above. And so he, he sends the water coming, coming down from above like, like rain or you know, like meaning coming from above. And that's what heals him. But the weird thing about the story is the first part where at first he says, I see people, they look like trees walking around. And, and then Christ has, puts his hands on the man's eyes. Like, it's like he covers his eyes and then his, his eyes open up and then he sees things normally. And so it, it's weird. It almost feels like at first his vision was too harsh, high. It's like at first he just sees patterns, sees these trees, right? These, these patterns walking around. It's as if Christ has to kind of lower his vision a little bit by covering his eyes and then he's able to kind of see the flesh. You know, it feels like that's what, what's going on in that story. But you know, it's very mysterious. I mean, there's so many things about Christ which are very mysterious. So. All right, so David Flores asks, what is your favorite monster? And I would have to say that would be the dog headed man. You know, that's, I don't think that's much of a surprise for those who know my, my relationship with St. Christopher, you know, and so I would say that's what it is. So Shay McKay asks. Hey, Jonathan, Jordan Peterson is back home. In his Return home video, he mentioned he's working on a lecture series about Exodus and Proverbs. Is he in contact with you or your brother about those? And you don't have to answer this because it's a second question. Wait, is this the second question? Don't ask two questions. You're confusing me. But he thanked God for his mercy and grace. I wonder if he had a spiritual experience and were you in contact with him during these difficult times. And so, I mean, it could be a. This could be an opportunity for me to talk about that. No, I haven't been in contact with Jordan for, For quite a while. I would say for several months now. I, I received. I had a small exchange with him while he was, I think in Serbia or he was just finishing up in Russia. But it was just. We talked about maybe a future carving that he wanted and that was it. But he, he said that he was still feeling very bad, very ill. And so he was struggling to concentrate. And I felt when I watched the video, first of all, I was very grateful to see him and I was really overjoyed, you know, and very emotional to see him appear on YouTube all of a sudden. But I was also, I also saw that. I could see that he was still struggling and I think he still had some, some healing to do. I mean, like all you guys, I would, I would be looking forward to seeing what he comes up with with Proverbs. And I was really, really surprised that he, he didn't just thank God for his mercy and grace, but he said, he said by the grace and mercy of God. Like, that's as if that if this is going to happen by the grace and mercy of God, which really surprised me because I never heard him speak that way. I never heard him kind of talk about God directly as something which is related to his personal life. And so that to me was extremely kind of touching and gave me hope, you know, because I know, like I've been praying for him and a lot of people have been praying for him, you know, in the wings, clergy have been praying for him, and he's been going through some crazy stuff. And he's also. What's the easiest way to say this? He's also been attacked. Like, he's, he's not. This is not just happening. He's also being attacked. And so if you are someone who believes in these things, then, then pray for him and pray for his salvation and pray that, you know, praise that his. His eyes are opened, you know, that's all I can say and that he can see for himself. All right, so CS Treatzel asks. Hello, Jonathan. I apologize in advance for the semi. Long preamble, but I think it's necessary. I hope so. These long questions, they, they. They're not good. You need to be able to, to synthesize your questions. All right, here we go. When thinking about the heaven and earth dichotomy established in Genesis, I started to consider the distinction between negative abstract higher principles and negative lower material principles. For example, a fallen angel is higher, more abstract negative principle. I was thinking of it perhaps as an evil spirit or personality which can manifest itself in a person's being via a godless ideology. Maybe one that puts power at the pinnacle of its hierarchy instead of God. But there would also be lower material negative principles such as wild animals that prey on humans, I. E. Alligators, crocodiles, snakes, parasites. Yes, or natural disasters, etc. Etc. In relation to each other. This creates a masculine feminine dichotomy with the category of the evil. Is this an accurate way of understanding the pattern of evil? And if so, doesn't this support Jordan Peterson's view of order known and chaos unknown as having both positive and negative polarities? I've heard you cast criticism on chaos being associated with feminine. However, this seems to be caused by immediate mental association with chaos as being wholly negative. We forget that chaos can be good, such as the chaotic exodus of the Jewish mass living Egypt. All right, to be honest, I don't totally understand your question. Maybe I can say it this way. I would. The idea that chaos. So the idea that chaos is negative, negative in the sense, not in the sense of immoral, negative in the sense as, let's say, non being or not. Or not or not. Declaration Chaos is a question. Chaos is potential. Chaos is what is it? Right? It's asking what is this? And so it's a, it's a, it's a. It's asking for an answer. So, so chaos asks the light to. To reveal it or to, to. To contain it or to reveal it. Okay, so in that sense that's also the relationship between the masculine and feminine aspects of, of, let's say chaos and order or chaos and name or something like that. And, and so in that sense that's the best way to understand that. Now there is definitely this relationship of. So you can understand it like, you can kind of understand it as these principalities that have fallen. So they're below. So you can have like, you have a Mac. Macrocosm. And then you also have our world, which is smaller, let's say. And then you also have, you also have these parasites and things at the bottom. But some of the predators are not negative, they're not below, they're above. Predators are often above. That's if you don't. You need to understand that in order to understand symbolism. Like let's say predatorial birds or predatorial lion. The lion is seen as like above and so is the bird. And, and these this is more like the predatorial aspect of heaven. And there is a predatorial aspect of heaven in the sense that heaven picks things up and lifts them up. I've talked about this before, and so I think that, yeah, so I think that I'm struggling with, like, the categories that you're, you're, you're, you're trying to fit into this. And so I hope that my, my rambling was helpful to, for you to understand that. All right. And so Luca Ascovic asks. Hello, Jonathan. How does one stop fearing demons? This is related to our talk. It's okay if you don't remember. The question still stands. Usually whenever I have an anxiety, I face it head on. But in this case, I don't want to call for something that I cannot fight or assimilate. Yeah, I don't call, don't call up demons. And don't. The Church fathers say we shouldn't face demons directly, at least unless we exit, know exactly what we're doing, and we know exactly how to, how to deal with them. The idea is not so much to, is not just to face the demon. That's a, that's a dangerous thing. One of the ways to deal with demons is to attach yourself to something higher rather than just facing the demon. Or if you, at least if you're going to face the demon, you need to make sure you're attached to something higher or else that demon is going to, going to kill you or, or it's going to go away and then it's going to come back with its friends and it's going to come devour you. Right? And so it's not, you know, it's, that's one of the reasons why. And I suffer from this as well. Like everybody suffers from this. But that's why, for example, the, the, the Church fathers always say that during Lent, it's not enough to just fast. If you fast and you don't pray, then you're getting trouble. Like it's, you're going to be in serious trouble. Because if you just try to hold off the passions, but you don't attach yourself to something above, then it's. Those passions are going to come back and loop and are going to, you're going to swipe your feet from under you. So I think that that's the best way is to attach yourself to something above prayer. You know, counsel from, from a priest, a pastor, depending on what your tradition is. You know, those are the things. Or even if you're a child, like, you know, your, your parents Asking from. Asking help from some. Someone who has some authority over you is also a way to. To help you to fight your demons. Bearing in mind. So, Isadore asked, bearing in mind the symbolism of 6 and 666, can you speak on this six feet apart COVID policy and burying someone six feet under. It was really hilarious that someone posted at the early part of COVID there was like a Red Cross poster and. And it showed how you're supposed to be apart from everybody. And so it showed like, someone. And then it. And then it had people in different directions from them, and it was like, six, six, six. And so it was pretty funny. It has to do with the distance of man. Six feet is like, let's say, the ideal distance of a man, I think. And so I think that that's. That's one of the reasons why we bury people six feet under. You can imagine, like a. A man, especially northerners, especially kind of European types, like a man standing. And then you bury the person at the feet of what that would be like if you dug a hole and you have a person standing from head to toe, then you put that. You put the person at the feet of that. Of that standing man. And I think that the kind of intuition of wanting people to stand six feet apart has to do with this idea that it's the distance of a person. It's like you need to have between you and another person the distance of someone. It seems like that's kind of an easy, intuitive way to go about talking about distance, because obviously this actual six feet is clearly arbitrary. It's not. I don't see how. How that could be, like, a scientific thing. All right, okay. So look, so there's a question by someone named Heather. Heather. I'm not going to read your question. It's too long. You guys can't. You can't write, like, three paragraphs. And so maybe next time try to just kind of condense your question because it's just too much. All right. Samuel asks. Hi, Jonathan. Please don't think I'm trying to get you in trouble for this. Oh, man. But this is something I'm struggling with and hope you can help. Do you think you can catch coronavirus from taking communion? Thanks. And sorry. So I would say, just like my other questions, I need to. I need you to submit to your authorities in terms of what they're. How they're dealing with COVID And that's what you need to do. You need to submit to your authorities. But I would say that my first Reaction, gut reaction to, to, to that question is no, you can't get coronavirus from taking communion. The question, the question, I'm laughing because it's like you, you'd never get corona, you don't get coronavirus from taking communion. You get coronavirus from, get, from being in contact with coronavirus. So interpret that as you will. All right. So Whiteyear 2 says, My family goes to a non denominational church and like most reformed churches, there is a heavy emphasis on mission and evangelism, both local and international. How does Orthodox Church read the Great Commission in Matthew 28? Thank you. Go therefore make disciples of all nations, baptizing them in the name of the Father, Son and the Holy Spirit, teaching them to observe all. I have commanded you and behold, I am with you always to the end of the age. So I mean, the Orthodox have always been, have had always been very active in terms of the mission field. That is, you know, if you look at the movement from Constantinople, you know, out into Russia, Bulgaria, all the, you know, all of the Balkans were basically evangelized by the Orthodox over the centuries. And, and so yeah, it's definitely part of, part of the Orthodox ethos. I think that I would say that the Orthodox probably put a large emphasis on, you know, make them disciples, not just save them, not just, you know, because there's something about the kind of mass, the mass mission work that goes out and tells people just to believe in Jesus and they'll be saved. You know, that, that obviously Orthodoxy is a slower process because it, there's a whole ethos which comes with it. There's a whole training, you know, the fact that for example, catechumen, usually you are a catechumen for at least a year before you're, you're baptized, before you enter into the communion. And so it's like, it's not, it's not an easy thing. Becoming Orthodox is not easy. And so because of that, it's also a slower process. And Orthodoxy also tends to not be subversive in the way that it converts people, which is something that some people will struggle to understand. But Orthodoxy tends to move through, through, let's say the conversion of princes, you know. And so this is something that Protestants will really struggle to understand. But there's an idea that, that there's something about a respect of the hierarchy. And so Orthodoxy is not meant to come and subvert the political order within a state. It rather comes and tries to bring Christ into a fulfillment of the state itself. And so Orthodoxy doesn't bring revolutions in countries or in peoples it brings about usually the conversion of the king or the prince. And you see it in so many examples and how orthodoxy spreads from Constantine to different parts of the world. And so then it ends up being like a fulfillment of the very nature of those people. And it doesn't become, doesn't become like a weird parasite in the culture. So that's how I see it at least when I look at the way orthodoxy spread, that's what I see. And it's very weird. And, but it's different today for sure because look at me, I converted to orthodoxy in a, in the kind of weird post Catholic world. So, you know, it's not a universal thing. So Eddie T asks. Hello, Jonathan, I've got a question about the nature of the devil's motive for rebelling against God. Is the Devil a usurper who aspires to take God's place on the heavenly throne? Or is he more like a modern day anarchist who seeks to abolish hierarchies altogether? No, for sure. Well, first of all, anarchists are not anarchists. They're never really anarchists, especially violent anarchists. They're little tyrants. They say anarchy, but what they really mean is if, you know, kind of like how Jordan Peterson phrased it, if I was in charge, you know, if I will destroy this, but if my ideas, if my vision was in charge, then everything would go smoothly. And so the, the Satan is prideful. He wants, he believes that it stops at him. Like he believes that he's equal to God. And that's the origin of all sins and it's the origin of all, of all evil, which is to think that reality stops at you, to think you contain everything. And that's when you, you, you discount your relationship to the infinite and you want to contain everything, then that's when things start to break apart. And that's the nature of rebellion. All right. And so. Bleeding mermaid. Whoa. Asks. With Halloween approaching it all, I thought I'd ask you about the symbolism of ghosts and our modern idea of paranormal activity. We know demons exist, but I'm curious as to why people claim to see ghosts of dead human beings who are haunting them. If this is a modern idea or if it has roots in premodernity, why do we see dead people? Well, we see dead people because we remember them. That is, dead people don't stop to exist when we, when they die. I think the best way to understand ghosts or hauntings is, has to do with a kind of residue. It has to do with a residue of A person. And so it's not. I don't think that when people see ghosts or if they encounter these types of events that what they're encountering is the actual dead person. It's the actual dead person in the way that I encounter residues of people. If I know I can. I've talked about this before. Like, if I move into somebody's house and they haven't removed the paintings and they've left everything the way it is, then I am encountering residues of these people. And so this you can imagine as physical residues of the person. Right? So traces of the person that lived there. But you can also imagine something like psychic residue of the person that is, you know. You know, and because also places are. Are living, they're not. There isn't a total disconnect with the idea that people live somewhere and how their, Their. Their psyche influence that space. It's probably the best way I can explain it. But, you know, I'm not surprised that this happens. Like, you know, it's not. Someone says that a place is haunted. It's not. I don't think they're making it up. There's. That there's phenomena that is going on there which is. Which is probably manifesting a. A conjunction between the people who are encountering those phenomena. Like, it's. It's probably not just the ghost. It's. The ghosts are. Whatever is influencing the space is probably sensitive to the person. That person too. Like, there needs to be a hook in that person for the ghost to really manifest themselves. At least that's what I. What I think. And so it's like, why are we talking about this stuff, man? I guess it's Halloween. And so, yeah, that's as good as that's gonna get. All right, so C. Seretta asks. Hey, Jonathan. To carry the theme of this Halloween spooktacular. What? All right, so monsters, historically, they were threatening and external to human civilization. Over time, they became more human, more internal, more harmless. Today, monsters are portrayed as parents and lovers and friends, entirely benevolent and entirely internal. Yeah, violent society places monsters outside, but that is not enough. If the monsters are not also dangerous, your kid will go make friends with one and ride it into your home. Is there a way to refang monsters without catastrophe? I mean, I think, I think that it's inevitable. You know, I think that for sure, right now there is a. There's an extreme. Because we are so obsessed with marginal. And so we're. Because we're so obsessed with equality, we end up actually. We end up actually Affecting the very struggle of, the very structure of how monsters appear to us. You know, Sesame Street. I've talked about this in several talks. You can check out my, my talk on the Pentecost of the zombie apocalypse, which will be Featured with by 2 more of these on, on Halloween. You know, but the monster will always return. The monster will always return even if you try to suppress it. And then you, you just have to pay attention, you just have to pay attention to the way that, to the way that people who love monsters speak. And you will catch them. You'll catch them talking about monsters, you'll catch them talking about the dangerous stranger one way or the other. You know, those that are not like us, whether, and if it's a super like, if it's like a super lefty, extremely open person, they, they're scared of, you know, right wing people. You know, the image of the, of, of the. Okay, here's a, here's a left wing monster if you want one. And it's a very common one. The inbred hick from the bayou right now that's a left wing monster. That's like a, that's the monster of people who are open to everything. And the inbred hick is exactly a monster in the sense that the, the idea of the inbred person who becomes a kind of monster because the levels of causality which are normal between couples and a man and a woman and a society are broken, then that is. But it's like a left wing monster because instead of. It's like it's a too close. How can I say this? It's a right wing disease. To be inbred would be like a right wing disease. It's like you're keeping things too close, you're holding things too tight. You're not willing to go out of, outside of the tribe enough. And so that's what creates the inbred hick monster. But it's still a monster because it's still a breakdown in causality. You know, there are breakdowns in causality that are, that are, let's say, relationships with things that are too far. You know, the idea of the foreign woman that you find in scripture, the idea of the, the, the woman whose feet go down to death that, that Solomon talks about in the Proverbs. You know, this idea of, of, of demon, of angels having relationships with, with fallen men like this, too far. But there's also a too close, you know, and that's why there are all these. I talked about the sins of purity that you find in scripture. There's a few places where you find these sins of purity and incest seems to be one, but it also breaks down the normal causality between the opposites. Right. And so always remember that there are different kinds of monsters will always return. You cannot avoid them. All right, okay, so here we go. So Timothy asks, once you told us a riddle about a dialogue in your brother's book. You guys will not leave me alone with that. All right, so in the dialogue, Esau asked Jacob to journey together, but Jacob replies that he will travel at the place of the flock until both of them meet. In Sayer. Why did your brother put this passage in his book? We found some comment from Matthew that relates Jacob with the slow pace of God making the foundation stone and Esau with the accelerated pace of man trying to emulate God's work with bricks. Do they meet at Seir when Jesus unites Jacob and Esau in himself, or do they meet at the end of times? Well, there you go. You've given me a way to answer it. That I. That I. That I can. Which is. So, yes, they both meet when Jesus unites Jacob and Esau and himself, and in the seed form. But then they also meet in the end when they. They. And this is the mystery, if you want to understand it. It's the. It's the mystery that St. Paul refers to when he talks about the branch that is cut from the tree, you know, and then it's cast into the fire. And then the other branch, which is. Which is put back into. Onto the. Onto the tree. And so. And so, yeah, that's. That's as much as I'm going to give you guys. You can figure it out. You know, it's not. It's not that hard. You can figure it out. All right, so Esau is Adam. Always remember that. Esau is. Is. Is. Is Adam. And he's related to Cain as well. Right? So Esau is related to Cain in the sense that he's the brother that tries to kill his brother. And. Yeah. All right. Okay, here we go. Roxanne asked. Thank you for your generous work. Here's a fairy tale question. The Grimm Brothers story, the Golden Bird parallels the story of Prince Yvonne and the gray wolf. However, the prince's animal ally is a fox. Once the prince has achieved his quest, the fox implores the prince to kill him and cut off his head and paws. At first, the prince refuses, but finally complies. The fox is transformed and revealed to be the brother of the princess from The Golden Castle. Happiness ensues. Personal taste aside, do you see this as a distortion or a valid symbolic variation on the story? I've never heard of this story. And so I'd have to think about it. Really. I'd have to think about it because does. I don't. I wouldn't think it's a distortion. You know, fairy tales have all kinds of different versions. They're never. They're never uniform in there. They appear to us uniform because we read them in books, but in kind of traditional world. They always have tropes and variations on how they manifest themselves. And so I'd have to think about it, about. And I'd have to read it too, to see if the brother of the princess. There's a relationship in other places in that story. You know, what's his relationship to the princess? What's his relationship to the. To the main character? So, sorry, I can't answer anymore, but I don't know the story well, so. Hi, Jonathan. Your video on the parable of the Sower has been really helpful in understanding the depth of this symbolic pattern and how it manifests in my life. All of Matthew 12 seems to be preparing for the parable of the Sower. What is the symbolic significance of King David eating the bread of the presence from the temple? How might this relate to the role of blasphemy and even the return of an unclean spirit? How does. How do we till the right ground for the right seed? So the significance of King David eating the bread of the presence from the table is super important. It's super important because in a way, it's an imperfect. It's an imperfect version of what Christ is going to do. That is. I've talked about this before. You're right that it does have to do with the role. I wouldn't use the word blasphemy, but it does have to do with the role of bringing the improper and healing the improper. And so the Messiah is able. The Messiah connects all the levels of the hierarchy together. This is something that I've tried to kind of explain that the Messiah Christ isn't only at the top of the mountain, but he links all the hierarchy together. And that explains a lot of the strangeness of his story. If you see it that way, then all of a sudden a lot of things seem to make sense. And there are a lot of things that Christ does which can seem like. Like transgressions almost. But if you understand it that he's doing this, then you can see. Then you can see that he. He's manifesting this union. And so, you know, the idea that King David, you know, is given the bread of heaven and the fact that he kind of does. He does something which is considered sacrilegious, it has to do with some of the things that Christ does, like the idea of offering his body and blood to be eaten, you know, and the idea of joining the extremes together in this kind of holiness and then this kind of sacrilege which appears in the form of the cross. Right. The form of the cross is the idea of the union of the highest and the lowest together in one image. And so. And I think that that's what happens. There's many versions of that in Scripture. One of the stranger ones is, of course, you know, Samson, who takes the door of the city and brings it to the top of the hill. Like, you know, you take the door of the outside and then you. You carry it up the hill. When you read it in the story, it just sounds so odd. Like, why would he. You understand that that's one of the things Samson is trying to do. He's trying to kind of join all the levels together. The lowest and the highest together, the first and the last, the beginning and the end. Right. That's one of the things he's trying to do. But he's doing it kind of in an imperfect and mismatched way, whereas Christ is really revealed, the perfection of the symbolism. All right, so is Kanye west the catacomb of so Tan Moosin? Musman asked, is Kanye west the catacomb of second Thessalonians? Will he the catacomb and the Great Schism? Do you see our political climate pointing to the return of the king? So I'm not sure I understand your reference, because maybe I don't know what that is. What is this? All right. I don't know enough about the concepts that you're. That you're trying to get me to talk about. So I'm not sure what it is you mean, but I can answer your second question. Do you see our political climate pointing to the return of the King? I think that, yes, I think it does, but I think that doesn't mean it's going to happen. It can get a lot worse. It can get a lot worse before it gets better. So, yeah, so don't keep your hopes up. I mean, I think that inevitably it has to at some point, point to that, but, you know, and it can also be a negative thing. It doesn't mean it's going to be positive because I think the image of Antichrist is all obviously an image of a kind of kingly figure which, who is trying to be everything. And so yeah, yep, yep, yep, yep. So it's not necessarily going to be good, but it can be. It can be. There could be a kind of wake up and a return to order and a return to property. Do a proper hierarchy. You could say that could happen. Or maybe only in the eschaton, maybe. Here we go. I'm now done with the symbolic world, I think, and I'm going to move into subscribestar. Nicola asks, I honestly don't know if this is a good idea, but could you call in some favors to get yourself an interview with Joe Rogan? I don't think I have access to Joe Rogan. I don't think that, I don't think that I, I have enough clout in the, in the, in the world to be invited on Joe Rogan. You know, whatever. Who knows? It might happen one day. I'd be happy to talk to Joe Rogan. I think that he is a good listener and he's a, and he's a smart guy and if, if he, and he gives people room to speak. And so it could really be, it could really be a vessel to kind of talk about symbolism to a very, very large audience. But, you know, he, he's, he's the biggest podcaster in the world and I, and because my work is not very political there, there would have to be like a major controversy around me for him to invite me on his podcast. All right, so David asks when explaining the parable of the sower, Christ talks about Isaiah, through Isaiah, about forgiving them their sins if only they would just turn and understand with their hearts. As a denizen of the edge of the world for over 10 years, my physical, spiritual and life in general has fallen apart completely. Well, I'm sorry to hear this, David, I wanted to ask you what is meant by understand with their hearts? Does this refer to the flash of insight and meaning, to doing various good deeds, to. Does it refer to repentance and get your life together? Does it refer to becoming a monk and spiritual purification? I'm seeing received in sin? Please help me to understand, good sir. And so the notion of the heart is really just the notion of the center of your being. And so the idea of turning and understanding with your heart has to do with, first of all, turning in the sense of being receptive to turn. You have to stop going in the direction you're going. And so you have to. That's One of the aspects of repentance. Repentance means that you're going in a direction and then you turn right, you turn around, and then when you turn, then you also have to be. Your heart has to be available. The center of your being has to be available to receive the, the new seed, you would say. And so if you understand things with your heart, with the center of your being, then they will transform you and they will become, they will kind of have repercussions on the, the, the, the rest of your life. But the thing is, is that you can't. It's hard to provoke that. It's hard for you to provoke, understanding things with your heart. And the best way to do it is to repent, like to break down your. And it's not, it's not just, it's not just like a moral thing that you hear all the time. It really is a structural thing, which is that if you want to have light, you have to break down the existing patterns. And so if you repent from your sins and you do it sincerely and you do it, you know, every time that you sin and you, you make a habit of repentance, then you, you're breaking down the kind of disorder that say, the parasitical patterns that are in your life, and you open yourself up to then understanding Christ with your heart or receiving Christ in your heart, to use a kind of evangelical way of talking about it. And then, and then that will take hold in your center and it will start to ripple out. But like I said, because it's hard to do that, it's hard for you to will that into being. It's more. The only way to really do it is through repentance, is by starting by breaking down the current patterns. And that's what baptism does as well. Baptism is a breakdown of the kind of dysfunctional patterns that are there at the time. All right, so XRD asks. Hi, Jonathan. I'm really liking your videos on postmodernism's viral nature. I shared the latest with my friend and you wondered if you've commented on the whole Cuties, the Netflix movie debacle. Now, it's obvious why ideologies target children for indoctrination, but something about postmodernism, hostility towards childhood stands out to me in particular. What are your thoughts on that? Yeah, I haven't talked about that, mostly because I try to avoid, trying to avoid clickbait controversy in general. I'll talk about things that are there in politics, but I try to avoid that, that kind of heated Stuff that really pops up, you know. But if you want to understand, let's say, you know, the world always manifests itself in extremes. And so, you know, I was thinking about making a video on this, but I maybe do it on Bitchute or something because on. On YouTube, like just answering your question will probably bring me. Give me trouble with YouTube. But the two extremes of culture manifest themselves in the way that they act and then also in the way that they interpret what the other person is acting. And so let's say the desire to sexualize children is first of all a desire to bring passion down at the. As low, as close as possible to the origin. Okay. Because one of the aspects of the. Of the modern. Of the modern world, let's say the more. The kind of. The more chaotic part of the modern world, the more kind of open and degenerate part of the modern world is to want to reduce everything to desire, right? To want to reduce everything to our passions. Our passions are the only things that are true. And so it's inevitable that they want not only desire themselves, those that are. End up desiring those that are younger. They also want to. They want to project desire into as close to the origin as possible because that's what they are like, that's what they. That's their being. And so, yeah, and. And so it's just. It's just going to happen. And it happens almost in a. In an unconscious way because if you look at the way that it's. The movie was. Was at least framed as being anti. Against the sexualization of children, but then it ends up doing it anyways. And so it just. It's like a weird unconscious thing that people engage in and end up kind of manifesting nonetheless. So at least that's how I understand that. But one day I'll make a video about. Let's say the other aspect of that is. Is kind of racism and the way people view each other. Like it's pedophiles versus racist, something like that. And so anyways, we can talk about that. But this is. This is probably. This is gonna get me in trouble. All right. Okay, here we go. So Dorothy, KK says. Hi, Jonathan. I recently read the chapter about dreams in your brother's book. I think that chapter was the soundest thing I read on the topic. But I'm struggling to relate those dream interpretations with the outside world. I get the idea that not having enough heaven would mean a lack of heavenly guidance, that our passions are taking over or something like that. But what does it mean to not have enough body. Can you give some examples or am I looking at this the wrong way? Well, I've given a few examples of not having enough body. Utopia is the best example of not having enough body or not being capable of manifesting in body. And so, and so you, you have something which is too high and doesn't. Can't land in the world. Can't really find a body, you know, and so you imagine people who have, let's say, extreme conspiracy theorists also, let's say they, they, they don't have enough body. And so they have these ideas about the world, and they have an idea about the way that the world works. And they end up kind of floating in these ideas. And then they try to connect things below, but they don't totally connect. And so they're actually not really connected, but they really want to see them as being connected. And so any idea that doesn't have enough instantiation in the world is something that doesn't have enough body. Right? Let's say a false scientific, a false scientific theory will end up not having enough body in order to be real. It'll, it'll just kind of float up into the air and won't and won't land. So those are a few examples. And I mean like an example in your life, because I see you're trying to relate it to your life. Is, is of course, the idea of having ideals that are too high, right? It's like, okay, so I'm gonna stop smoking tomorrow, right? You've heard that kind of stuff. I'm going to, I'm going to start exercising next week, and I'm going to do it every day and I'm going to do it for an hour a day and then nothing happens. Right? Those are not having enough body. Those are having ideas that don't land and don't. Don't manifest themselves. You meet people like that who have projects, who always have wild, huge projects. You know, someone who wants to be a writer. You know, this is a great example. Someone who's like, oh, I want to write novels. Like, I want to write novels. And then you ask them, like, so have you, you know, have you written some short stories? Have you written a few smaller texts? And maybe you've tried to publish. Have you, have you worked on the, let's say, just the outline of your novel? It's like, no, but I want to write great novels. Like, I want, I want, I want to be a great author. I want to be the best author. But they're not willing to Put in the, like, little work that you need to do to kind of get there. And so they just end up being these lofty dreams that never land and never, never make, never become anything. Everybody has both met people like that and also have had those in their life themselves. So. Okay, so here we go on to Patreon. So I was really tired when I started this, but I'm. I'm feeling pretty energized also because a lot of these questions are. You're leading, you guys are leading me into like, difficult corners that I need to get out of. All right. Okay. So G. Garcia asked, do you think it's possible to fully escape the materialist worldview if you were born in it? Was it more responsibility to raise, inculcate the next generation with symbolic lens so they don't have the same problems as us? Sometimes it feels like instead of viewing the world under a microscope, I'm now looking at symbols under a microscope. Hope that makes sense. Thank you. Yeah, it makes sense. I understand what you're saying. You know, this is of course one of the dangers of what I'm doing, and I mentioned this in a few videos, a few talks before, is that there's a danger in explaining symbolism. It's almost like a last ditch medicine. Right. It's like, okay, the world is going to hell, everything's falling apart. We have to explain the symbolism because it's explaining symbolism and living symbolism is not the same. Right. Let's say manifesting symbolic patterns and living in them is not the same as understanding them and it's not the same as explaining them. But you hope that it's going to be at least a ladder because it's better than being in the crazy upside down symbolism. So at least it gives you tool to first off, break out of the upside down symbolism and then hopefully start to climb the ladder so that you can integrate some of these symbolic things. But I agree that it's difficult and I don't know if it's fully possible. Yeah. All I can say is by the grace of God and just one little thing at a time, you know, one little integration at a time. So Benjamin Kincaid asks. Hi, Jonathan. There are a lot of troubling things going on in the upside down world. Can you talk about what gives you the most hope? How are you seeing this acted out in the world and what stories portray this in scripture? I mean, it's, you know what gives me the most hope right now? I'll tell you guys. It's you guys. It's you guys that Give me the most hope. And you know, the. You guys know that there's a Facebook with a Symbolic world Facebook group where there's really active and lively discussion and out of that has been coming articles on the Symbolic World blog. Just wonderful articles, great, high quality articles. And you know, it's not like the blog right now has a huge, has a huge readership, but what it does and what it is, it's like a training ground. It feels like I can. I'm looking out now in the world and I'm seeing these little seedlings, like I'm seeing these little trees that, you know, 10 years ago, even six years ago, I. There was nothing I met here. And I felt like we were the only people in the world that really thought this way or really was able. Were able to perceive this symbolic patterns. And so all of a sudden I look out and I see it and I see it and it comes back to me in weird ways. Like, it comes back to me in like secondary ways where, you know, I'll read an article and it's obviously not somebody who follows me, but in that article I'll see that there are things that five years ago I never could have seen a way of seeing the world, way of explaining which seems to be kind of permeating. And I think that I'm participating in Matthew's participating it. Other people are, but it's like I can see it growing. And so I feel like this is it. This is the hope for the future, right? That we're the hope for the future. That we. I mean, we in the sense that people who are able to discern these patterns and will hopefully try to integrate them in new stories and, and also kind of re. Enliven the old stories in a way that can help us reconnect with our roots and so ultimately, of course, reconnect us to God to the extent that that's. That, that, that, you know, that that's part of it. Of course, it's not just a question of mental, mental games and mental understanding, but the understanding is also part of it too. So that's what gives me hope right now. I'll be honest with you, because there's not a lot much else giving me hope. Okay, so. Elise Spinola. So, hi, Jonathan. In Genesis 27, Isaac, already blind, blesses Jacob instead of Esau, who was the firstborn. And in Genesis 48, the same situation occurs in which Jacob also blinds. Blesses Ephraim instead of Manasseh who was the firstborn. What does that mean? Now this is A really interesting, interesting story because I think that there, and I've talked about this with material. It's like there are like two interpretations of that story. And in a way they're. They're opposite stories. They're opposite interpretations, which is really fascinating because so you, can you. You imagine that. So Jacob, okay, so Isaac is tricked, right? And he blesses Esau, right? He blesses Jacob instead of Esau. So he's tricked into doing that. So it's a trick. So, so Jacob flips the world, kind of flips the, the world upside down. And like a trickster takes the, kind of, takes the gold, you know, like Jack. Jack and the Beanstalk takes the gold from the, the giant, right? So he's like, Jacob is Jack and he takes the gold that he's not, that is not supposed to go to him. So that's what happens. Now then when Jacob blesses his sons, his grandsons, I mean, you can understand it one as he's perpetuating the trick. And so the idea is that he actually crosses his hands over and he's going to bless. He ends up blessing the. The younger one instead of the older. But if you read it carefully, it's not clear. There are other. Another way of interpreting it, which is that he's rectifying the trick. That in fact that Joseph is presenting them upside down as if he, Joseph wants to continue the. The. Because Joseph is also kind of weirdly part of that, right? Joseph is not the oldest. Is not the oldest. And so Joseph wants to perpetuate the blessing of the youngest. But then Jacob ends up actually by crossing his hands. He ends up. It's like a double flip where Joseph presents him the sons upside down to bless in the youngest first. And then Jacob double flips cross his hands and ends up blessing the oldest one. And it's not clear in the text which one it is. But so it's an interesting, it's an interesting. It's an interesting thing. So it's either that Jacob wants to perpetuate the upside down or it's that Jacob as the kind of trickster character has flipped the world upside down and now he's double flipping and he's bringing it back right side up. That's the way. Those are the two ways that I interpret that. So Paul Dimal says, hi, Jonathan, I assume you've read Dune. What did you think of its symbolism? Are there particular themes that you liked and any that you disliked? Man, I read Dune when I was like 14 years old and I really don't remember enough of it. And recently I tried to reread it again. I tried to reread it as an audiobook, and I tapped out. I just couldn't. I don't know why. There was something about it. I just couldn't. So I'm sorry. I just don't have a good answer for you. I mean, I do want to read it at some point. I would like to. A lot of people are telling me that I should and that there's some interesting things going on in there, but I. Like I said, I don't remember. I read it way too long ago and my perceptions weren't. Weren't sharp enough at the time for me to now remember what. What was good about it. So Sander Cuter asks, how's your family doing? Yeah, man. Yeah, it's tough. It's a tough time. It's a tough time for everybody. But, I mean, we still. We still hope to get into our house. That's really just been the, like, the weight on our shoulders is to still be in this rented house after, you know, more than a year. And, yeah, it just. We just. It just. It just has to end. So that's pretty much what's going on. But in general, I would say we're doing. We're doing okay. I think that, like, we haven't. I think I mentioned that in the last Q and A. It's like, I haven't been back to church since COVID started just because it was shut down, Then it was open, then it was shut down again. Now I think it's open. I don't. I'm not even. It's as if I'm not even. And so that has been bad for me, at least for my soul. I need to kind of find a way to go to confession and go to church. So that needs to happen. So pray for me for that, guys. But everybody is kind of in a similar situation, unless you're in, like, the south somewhere where it's totally open and it's as if nothing happened. But at least in Canada, we're all kind of going through this. So Christopher asks, what is your favorite book or story in the Bible and why? I mean, there's no competition for that. It's definitely. I mean, it's the story of Christ. That's. That's for sure. If you're. If we're going to break it down in terms of. Of Christ, it's definitely the story of the Resurrection or the crucifixion and the Resurrection. So I'm not I'm afraid I'm not going to surprise you by that. If we talk about the Old Testament, though, let's talk about the Old. Let's use the Old Testament because that's, you know, it's. It's kind of cheating to say Christ maybe. I would say the story of the creation story. That story. You can't get enough of that story. Creation story. I would say a hierarchy would be like the creation story, the. The Exodus story, story of Noah, of Jonah. So we have no. I just love all the stories. But for sure, creation has got to be Creation Fall is just the best. And then he asked if I offer clergy discounts on my carvings. I don't actually offer clergy discounts on my carvings. I really try to price my carvings in a accessible way. And so it is possible to get a carving for me for, like, $300. And it's also possible to get a carving for me for, like, $10,000. And so what I try to do is I. I really tried to scale my prices enough so that if someone doesn't have the means to get a bigger carving, they can at least get a small. A small carving if they just save up a little bit. So that's the way I do it. And I try to have my prices affordable, that some icons are kind of affordable for everybody. So, yeah. All right, so Ari Fisher asks. Greetings, Jonathan of Quebec. In a fairly recent interview we did on a Goge podcast, you got into the issue of universalism versus commitment to a single traditional path. I think a lot of what you said hinge on one of your initial statements, which is that you have to be on a path. Path meaning a traditional one. All right, so you say that I've been attracted to Christianity, seeing how much you'd have forced people in their lives when attempting to move into it Myself, I've run up against the wall that at some point you have to actually say and believe that this religion is the truth instead of just being a pragmatic thing. I've also heard you say that you're a Westerner. Then there's no denying that the Christian story is your story, which, again, I totally agree with. But should such things, such a thing be the deciding factor in one's choice of a path? If someone in their heart of hearts really felt called to be a daoist, but was a Westerner, could you say it would be better for them to distrust their heart and become a Christian or follow it and become a daoist? I mean, I think it's. I Think it's very. It's very difficult for a Westerner to be a daoist. Difficult. Nearly impossible. Especially a Taoist, of all things. Man, some of those Taoist stuff is so weird. Like, there are nearly impossible for us to understand. Like all these weird practices and weird fasting and like, weird, weird, like kind of proto medical things that there's a lot of. It's very difficult to be something like a Taoist. So I don't know how to answer your question in the sense that I do believe that. I do believe that in all the, let's say, legitimate traditions or all the legitimate religions, I believe that there are glimmers of truth, that there are things in there that are really pointing and that are really helpful to people and pointing higher and that are kind of a manifestation of this pattern of reality. And I. And I do think that I don't tend to. To have this like Christians have it and everybody else is. Is horrible. I just can't think that way. Just impossible because I just. Because Christianity is the pattern of. Because I believe the pattern that I see in Christ is the pattern of everything, then. Then it has to kind of be there everywhere somehow, at least a certain extent. And so that's how I think. But I do, do think that Christ offers the capstone. Offers the. The. The integration of the pattern in a way that is not seen in any other religion. And so it's difficult for me to answer your question in the way you. Maybe you want me to answer it. I mean, I think that. Yeah, that's as much as I can say. All right. So Tanner Math has asked, what is the symbolism between newly wedded couples going on trips for their honeymoon? Is there something to the idea of a new husband and wife needing time away from the normal social structure to form their own bond without interference from their past lives? Yes, I think that's what it is. I think. I think that it's also probably very much related to fertility. It's probably related to the idea of if you go on a honeymoon and if you take an entire month, like an entire month which is also an entire menstrual cycle, then you are, let's say, starting. The idea would probably, at least in the old times, it probably would have been that the person should become pregnant during that first month. Like, that's probably what in a traditional world would have been understood, is that if you take. So it's like you take a full month together in order to start your family and as you said, in order to restart the pattern of the family in a, in a. In. In its own, with its own pattern. But that probably definitely included having a becoming pregnant in the first month ideally. Although nobody, nobody would. Most, very few people would think of it that way today anyways. Who can take a full month anyways? Like people don't take full month honeymoons anymore. At least I, I don't. I never heard anybody do that. So Charlie Longoria asks. Hello, Jonathan. What do the role of urban legends, folktales play in symbolic worldview? How are they similar, different from fairy tales? I always loved reading stories that must not die as a kid. We have an urban legend in my town called Devil at the Disco, where a young girl sneaks out during Holy Week and dances with a handsome stranger only to realize he's the devil. I live close to the Mexican border, so we have a lot of these kinds of tales told for generations. Popular story is La Llorona and all of our grandmothers have heard of her. Haha. And so yeah, the idea of the. So I would say that they're very, they're similar in the sense that fairy tales are probably. Fairy tales are more stable and they're also longer. They tend to be more kind of cosmic in their, their scope. They tend to have a more microcosmic thing. Whereas these kind of small legends or these, these little urban legends or small folktales, they tend to be smaller in terms of their repercussions. But for example, the devil at the disco story is, is a, is a universal story. You know, the idea of a young girl that, that dances with the devil, we have it in Quebec. We have the same legend. We have the, the story of the, the woman who dances with the devil. And I think there's probably there in almost every culture. There are different versions of it though, which is interesting. For example, one of the versions that exist in Quebec of the woman dancing with the devil is that she dances him out like she out dances the devil. She dances him through hell and then out of hell and the, the devil can't take anymore and he's the one who gives up. So that's an interesting little tidbit there. All right, so AJ Del Toro asks. Hello, good sir, hope you're doing well. I've been attending Orthodox services for a year now. I grew up. So you also grew up Protestant. If I could ask you something in Protestantism, as you know, so much of the service is off the cuff or from the heart, you could say I'm not so used to this way of doing things that reading from the liturgy can seem dull. I'm not saying the problem is the way Orthodox do things, because the problem is certainly with me, I'm used to fast food and now being forced to eat vegetables. Yeah, I understand that. Anyways, I was wondering if you were ever struggle with that, and if you did, did it get easier? I would say yes, I did struggle with that. And I think, like, my kids definitely struggle with that, 100%. Even my wife struggles with that kind of stuff. I think it's normal because we, like you said, we're used to this more kind of personal, informal way of doing things. The key, I think, is to. Is to. To kind of tame the liturgy. I would say that is to get to know it. And once if you get to know it and it becomes familiar to you, then it won't. First of all, it won't be as dull. And second of all, it will be more like a. You'll know where you are, and so you'll feel like you're on a path, like you're in something that you know what's going on, and that can help. So understanding the different sections, like the two main sections of the liturgy, and then understanding why the liturgy is built the way it is and, you know, what it's leading up to and can kind of help you to. To participate more actively. And. And so that you're also not just going rote, but you. You engage personally as you're going through the. The. The liturgy. All right, so Kenan Wang asks. I've hear you talk about the function of Christ in the hierarchy. What do you see as the function of the Holy Spirit? Well, I mean, first of all. Yeah, so Christ. Let's not go into that. Okay, so the Holy Spirit is. So you can understand the. The. In the role of manifestation. You could say the Holy Spirit is that which kind of fills. Or you can imagine it as the breath that is under the Word. And so it has to do with this kind of. Has to do with this kind of filling and opening. And. And it can also be represented as fire, as this kind of spreading out of the presence of God into. Into something. And so it has to do with this. So the Holy Spirit, especially in the story of Pentecost, you can see how the Holy Spirit is kind of coming down and going to the. Going all the way to the end. Right. So manifesting the different languages with the tongue of fire. Right? So, so this idea of speaking fire that. So that it splits into all these different aspects. And so that's why also, like the so that the Spirit comes down upon the waters, comes down upon man. God blows his spirit into the dust, and then it kind of saturates the dust and brings it together. That's the best way that at least I can understand that. So what is the symbolism of the gospel, and why do the angels long to look into it? The gospel, okay, it was revealed to them that they were serving not themselves but you. And the things that have now been announced to you through those who preached the good news to you by the Holy Spirit sent from heaven, things into which angels long to look into. Well, it's the incarnation. That's what I think that the angels, the angels wish to look onto the Incarnation. That is, that this is the mystery, let's say, of the Incarnation. It's the mystery of also man, which is that by. We are lower than the angels. But the ultimate mystery is that by being filled as we are filled by the Spirit and as we're. We are, we manifest, let's say, the incarnational principle in Christ, then we end up being more than the angels, that we end up actually containing more. It's like, so it's not. So being above is one thing, but filling up the hierarchy is another. So we have bodies. And so the. The idea of this incarnational principle is that which the angels look down upon and wish, right? And that's why they. That's why they had intercourse with women, because they saw the flesh and they kind of desired the flesh. There's something about that which is above which kind of peers into that which is below and desires it, or. Or is. Is. Longs for it. Okay? And. And so that's one of the reasons why human beings end up being kind of higher, ultimately higher than the angels or more full than the angels or something like that. All right, so how many questions are left, man? All right, okay, Here you go. So Walrus King 14 asks. Hello, Jonathan. With Halloween coming up soon, I have a question about inversion holidays. Do you find that they can still provide value to a person desiring to live a symbolic Christian life in our modern society? I often hear other Christians say that the celebration of such holidays is blasphemous or demonic or heretical. Without truly understanding the historically symbolic roots of said holidays, however, I rarely hear anyone talk about their usefulness in our present society. Do you feel that the inversion holidays lose their meaning and purpose in a world that is constantly inverted? Is there an appropriate way to reclaim these holidays, or are they better off lost to time? I mean, I agree with you. I think that I think one of the reasons why people put so much like why Christians end up having like a more puritan vision on these inversion holidays is that the world is completely upside down. And so they see, for example, that, you know, so there's something real about it, which is that if you celebrate Halloween more than you celebrate Christmas, but if Halloween is a bigger holiday, you know, and if Halloween tries to take over Christmas, then it's a serious problem, right? It's a sign of our times. And so I think that people perceive that and their intuition isn't wrong, but in the end, they're always going to be there. They're not going to be able to get rid of the inversion holidays. You just can't. Right? Traditional Christians, like I saw some, you know, people will bash Halloween, I understand, but then they still celebrate some kind of carnival, some kind of Mardi Gras. They'll still go to the fair and they'll still go on the Ferris wheel and, and go on the, the merry go round and woo and turn around sitting on a bunch of weird animals. They'll still do that. It's not, they can't, you can't totally avoid it. And so I think that it's better to understand it, but it's also, I think it's also good not to be a scandal to people. So, and so I think that if you meet a Christian who, who doesn't understand the purpose of the gargoyles and doesn't understand the purpose of the, of the upside down, it's. There's no point in pushing it on them. There's no point in trying to, to make them react by talking about it or by bringing it up, you know, But I mean, I think that it's useful for us to understand these and to understand the role of the margin and the upside down and all of this and how it's there in Scripture. It's. It appears in many places in Scripture. And so it's like these are the, the types of Christian man, I can't believe I'm saying this, but it's like the type of Christian that totally doesn't understand, say inversion festivals is usually the type of Christian which really doesn't like many of the stories in the Bible or pretends like they do, but they really don't. And, and also maybe don't even know them, don't really even know all the weird stories that are in the Old Testament because. And there's a lot of weird stuff in the Old Testament and Purim, which is an inversion festival, which is based on the book of Esther and was there in the time of Christ is an inversion festival. I'm sorry to tell you. It's. And it's a. It's a. He was there during the time of Christ. So I know what to tell you. All right. So Lucas Fernbach asks, what is the symbolic meaning of Bao? I don't know. I mean, in the sense. In the. In the sense of the Israelites. BAAL is the. Is the foreign God, right? And so BAAL is the. Is the foreign God which asks you to sacrifice your children too. So it's a. It's a foreign God that has a. Born practices and. And they, you know, engages in, you know, where there's like kind of sacred prostitution and all these things which are. Which are kind of. For the Israelites are seen as defiling. And so it has very much something to understand about how the foreign God brings about. Brings about abhorrent practices and defiling practices. So Franz Schnetler asks. I noticed that on the COVID of Timothy Wares the Orthodox Church, there's a striking depiction of Jesus in a mandorla that I can't help but see as incredibly yonic. I might be going insane, but even the position of his head and body evokes it. Yeah, it's made stranger by the red bolts coming out of his hands that evoke. That evoke blood. How's this to be understood, Sabaka, as an Orthodox Christian? Look, I don't know what to tell you, bro. I mean, I think that. I think you have to be careful not to see things upside down. I think that. I think that understanding the. The Mandora somehow as a. As a covering or as a glory in the sense of a. In the sense of the feminine as the glory of man. Right. If you, if you see that in. In. I think it's in prophets where it says that the wife is the glory of her husband, then there's not. It's not completely insane. It's not completely insane, but I would be careful not to see things upside down and then not to see. Not to understand. Not to understand like genitalia as the root of symbolism, but understand genitalia as an examples of the symbolic patterns. Right. And so it. And yeah, that's the best way to. For me to say that without getting into that too much. Okay, so why do elves have pointed ears, Jason? Lindsay asked. Huh? I don't know. I need to think about that. Why do elves have pointed ears? And I'm sure Matthew would have a great answer to That I never thought about that I'll think about if I think if something comes to me for the end of the Q A, I'll answer. But I don't have a quick answer for you on that. So Drew McMahon asked, the new Testament gives accounts of Jesus at birth as a child, just one story and the remainder as an adult. Is there symbolism of these specific time frames? I mean I think that for sure it seems like Christ. They show the image of Christ at birth, at the beginning of adolescence and as an adult. So I think that seems to be what's going on is that Christmas. It's really kind of synthesizing the different trans. Major transitions in, in human life without going into detail. So that's, that's kind of how I see it. And the way that they do it seems to be to. For you to see that Christ was already what he is right from the beginning. Right. So right when he's born, the magi come in and give him gifts. And then when he becomes a teenager, he, you know, all the wise men in the temple listen to him. This seems to be one of the reasons, it seems to me, it seems to be the reason why. Why it's done that way. All right, so the wakeful asks. Dear Jonathan, my friend suffered a crisis of belief and faith while a young man in Protestant church. This was a problem related to many. This was related to many of the problems with literalism, materialism and lack of symbolism that you described. He is beginning to feel the need for religion again and is receptive to your ideas. However, the resurrection presents a problem to him. Unlike the stories in the Old Testament, the resurrection requires, that is the creed to believe in a literal event. He would most would be most comfortable with it being a symbolic story. Do you know how he might be able to approach the resurrection? I mean it is a symbolic story. It's. It's happened, but it's also a symbolic story. It's not you. It. The desire to separate those is really one of the big problems is that symbolism happens. Like symbolism is the way the world manifests itself. And so the way to. Wait. So I'm putting out, we're putting out a video. It's going to come out probably either tomorrow or on Monday, I hope. And it's, it's based on JP Maxo's article on miracles. And so I think that this requires kind of a long answer. And, and I've been working up to it. I've been avoiding it a little bit just because I needed to kind of bring people To a certain point. But at some point we come to a, we come to understanding when we understand the world, that the world manifests itself as these emergent patterns or these, these, these patterns, these things which emerge into patterns and also patterns which come down and name the different emergent properties. Right. Once we kind of understand this kind of jump up at different levels, we realize that the world emergence is moving towards meaning. And so the miracles that people really struggle with instead of actually being the, the freak things that, that don't make sense and that are, how can I say this? That the freak things which people use to destroy religion, the miracles of Christ are always there to actually crystallize how the world works in a way that is, that is beyond normal events. And so it actually brings reality. So it's like imagine all these levels of emergence and it kind of lifts the world up into, into kind of a crystalline, really shining moment where meaning shows itself. And the resurrection is the summit of that, right? The resurrection is the very, the very, the very way in which things that are broken in multiple come together into one. And that, that is the pattern of reality. That, that is how things happen. And that the, the pattern has more permanence than the body and that the body dies, but the pattern doesn't. And the, the pattern ultimately has the capacity to bring back to kind of, let's say to, to find a body, like to find a new body. You could say it that way. And look, I can't watch the video. When the video comes out, you'll see that it's going to be, hopefully it'll help understand. But you're right that without the resurrection there is no Christianity. And it is not sufficient to think of it as just a kind of metaphor, like, a metaphor like someone made it up like nothing happened, like Christ didn't. Like there wasn't an event behind the resurrection and somebody at some point made it up for some reason. That's definitely not the way Christians understand it. Resurrection, something that happened and it's a mysterious event. Like I, like I've said in many of my videos, people who think they, they, they've got it like they know what it is, is you be careful. Because Christ is, doesn't, isn't recognized in the resurrection. That is his resurrected body isn't recognized by the disciples, isn't at first recognized by Mary Magdalene, isn't recognized by the, the, the disciples on the road to Emmaus. And so it means that it's not a straightforward thing, right? The resurrected body is not as straightforward like you Know, someone dead on the ground and just stands up. Right. It's not straightforward. It's a mysterious body. It's not this. Not the same kind of body than the. Than the one that you have now. And so maybe that can help you to see it, to think that it's not trying to understand it in kind of weird, materialistic categories. It's going to lead you astray because the scripture seems to. To. To tell the story in a way that is not simple and is not easy to. Is not easy to contain in terms of material categories. So that's as close as I can say. So Norm Grande asked, why do you and I, good luck to your friend on his journey is I can say, you know, all the best and God bless him. Norm Grone says, why do you feel that it's more accurate or appropriate to view the primary biblical narrative as incarnational, as light that comes down and fills up the world from Jesus vs Barabbas video rather than salvational? Thank you for your work. Well, because. Because if you understand it as incarnational, it also contains the. The salvational. It contains salvation. It's just bigger because it also. The incarnational story contains even the creation story itself. So the creation story is an incarnational story because it ends with the spirit of God getting blown into dust, into a dust body. And that makes man. It's an incarnational principle, let's say. And then it ends with the glorious city which comes down from heaven. And so at first it's like a. At first it's a person, it's a body, and then at the end, it's an entire community or the communion of the saints, which are, let's say that heaven are joined together, heaven and earth. And so it's bigger than just salvational. And so there is a salvational aspect to the story in the sense that we're lost, that we're broken, that we're sick, that we're, you know, that we're not complete. And then the story of making us whole, making us. Well, making us complete, you know, but that is the hot. Let's say that salvation is part of the bigger. Because that's what dust is too, right? The dust is fragmented, it's broken, it's not together. Then God brings it together and then blows the wind into Adam. And so it's already. So salvation is already. Is already implied even in the creation of man. Not in a moral sense, but in the sense of. Of things that are broken and fragmented are brought together into. Into one. All right? And so end Dominus asks, does artificial intelligence have symbolic meaning? What did you mean by AI is like a fallen angel? So I've said this a few times, I guess in my videos. And people are caught, are catching up to this. So the idea is that we're making, we're making like a mechanical or a connecting, a connected body. We're, we're creating this like electric network and we are, we are submitting ourselves to it. Did you, do you see that, what we're doing? Like, do you see that we're submitting ourselves to our creation. Right? So we create Google, we create Twitter, we create Facebook, create these networks, these like information networks and these algorithms. And then we submit ourselves to, to this kind of robot that we created. And so that, that is part of what I mean by a fallen angel. It becomes a, it becomes a principality, but it has a body. And so it's a principality with a body and it rules over us. And so, and it's very, very powerful. Like, it's not just like, it's not like a little thing. It's not, it's not like that can happen in your own life, in your own little passions. It's like a cosmic thing. It's like this cosmic, let's say it's like a cosmic golem, like this cosmic structure. And then we, we look at it as if it is superior to us and as if, as if it is we, we are submitting to it. And, and then it's, that's it. It becomes a vehicle for a principality, becomes a body for a principality that comes down. And, and, and that's a, to me, that's my best understanding of what a fallen angel is. Right. So that's, that's, that's as much as I can say to that. So. All right, guys. All right, let me see. So I usually, I do. I will check the YouTube, see if there are some super chats last minute. Right, Sorry, I wasn't already ready with this, so I hope everything in the chat is better. I know last, last time there was only Brad in the chat and you know, despite him always being the one with the flaming sword, I think he wasn't able to swing it, to swing it enough. So thank. Thankfully Jacob was there with him this time. Hopefully that was helpful. All right, so let's see. All right, so we've got. Oh, we've got a few. All right, okay, so here we go. So Ulysses K. Hughes asks, you once mentioned for, for 10 year olds, sorry, you once mentioned that Dante's Divine Comedy was an arc. Can you expand on this definition. Are there other works of literature, art or music that are also arcs? Well, I think that the scripture itself, in a way, is a kind of arc. The, the, the. The idea that, let's say Dante's comedy, because the thing about the ark, especially the ark, led the Ark of Noah is we, we tend to think of the Ark of Noah as like a pure thing. But the Ark of Noah is not, is not really a pure thing. It's more like it contains everything in one frame. And so in the ark is, are the animals at the bottom of the ark, and then there's the head or man at the top of the ark. And you can kind of imagine, you see it sometimes in images where the birds are kind of above or at the top of Very, very top of the ark. And so it's a little microcosm. And so in that sense, I think that Dante was able to create a microcosm in which people could actually live. And that's really something like people could actually. Dante's. Dante's comedy ended up creating tropes that people actually live in. And so his images of heaven and Purgatory and, and hell are, are images that entered into the consciousness of people not just in a. Not just in their desire to be entertained, but in the way that they engage with their own lives, their own sins, their own values. And, and it stretches from the, from the cosmic. So there's an aspect of his work which is talking about God and how God reveals himself in the world. And some of the characters that he meets are at that level. Like, even. He even brings in, like the old gods. He even brings in the old Greek gods and Roman gods and, and, and they're all there. Like the whole antiquity is kind of brought into the story, right? Everything is brought in. Like, that's why what. I mean, it's an arc. Like everything of value is brought into this big structure, all the old. At a cosmic level. So the angels, the gods, the, the demons, all of this is there then at all the political level. And so all these historical figures are there, but then also at the personal level. And so he encounters all the people in his life that he had to deal with at the different levels of the hierarchy. So at every step of the hierarchy, he encounters the different levels. So it's like a, it is an amazing fractal structure. And so that's what I mean. Like, that's an arc because it, it's a, it's a, it's an amazing microcosm, but not just Like Lord of the Rings is the microcosm because you can't live in Lord of the Rings, but you can live in Dante's comedy. Like, it, it's a, it's a, it has, it's a structure of, of, of the ascent of an actual person through, you know, through this kind of mythological structure of being. So it's pretty amazing. I mean, Dante's comedy is an amazing thing. Okay, so, so curious Cretan for 399 says, what would be the symbolism of the gargoyle? Well, I think I talked about this quite a bit. You know, if you haven't seen my videos on it, I would say watch. Stay. Come, come on. On the 31st of October with two more V's and watch the, the, the Pentecost for the zombie apocalypse talk, because you'll see it there. But it has to do with the monsters on the edge. It has to do with the, this image of, of monsters on the outside, you know, on the, on the edge of the world. And then the church as a microcosm on the edge of the church. And so they have their apotropaic that is that it's using death to fight off death, using monsters to fight off monsters, you know. All right, and so Layman Theologians for $5 says, thank you. Well, thank you to you. Father Matthew for $5 says, what do you think about the symbolism present within the movie the Passion of Christ? Does Mel Gibson get the symbolism right? I think Mel Gibson gets a lot of the symbolism right. Man, I really struggled to watch that movie. I really didn't really particularly like it just because of the, just because of like, Mel Gibson's obsession with like, hyper violence. But I would say that in terms of the symbolism, like the symbolic patterns that he manifests in his movies, he seems to get really, really. Well, you know, I was. It's like, for example, like Apocalypto is as Christian a movie, as a Temptation of Christ, like as the Passion of Christ. I mean, I mean, his, he has. Mel Gibson is a great storyteller, like a wonderful storyteller and a very powerful. He has a powerful symbolic intuition. So, So, I mean, I, I still think, I think that it's going to be interesting to see because he's doing the Harrowing of Hell, which is like, supposedly he's doing the sequel to the Passion, which is going to be. I can't imagine. I mean, it might be amazing. Who knows? I mean, he's, he's really intuitive. So what is the monster most relevant? This Halloween. Oh man, I have no idea. It feels like I'm not even sure. Is there even going to be like, I'm not sure my daughter wants to go out on Halloween and I'm like, is there even going to be Halloween? Are people actually going to be engaging and giving candy and stuff? I'm not sure because we're people in like Corona Panic. So. Well, my daughter, like my 13 year old daughter, she, she's going to dress as a plague doctor. So there you go. Maybe that's, that's what we need this Halloween. Are people dressing up as plague doctors? Do that. So Theodore Malone asked the two witnesses in the book of Revelation describe a pattern similar to Peter and Paul. What about Moses and Enoch? Yes, I, I think so. I think that the idea of the two witnesses, if you understand the two witnesses, as something similar to the idea of, of the transfiguration of Christ where he has these two witnesses. The idea of, of Moses and Elijah or Moses and Enoch, you know, Enoch and Elijah are, are very much the same in terms of the pattern of what they manifest. And so yes, they're definitely the, let's say the right hand and the left hand. Moses and Peter, Paul and Enoch and Paul who was taken up to the third heaven. Right. And so I would say yes, very much so. So. 15 Lee for 1999 USD any thoughts on the Zodiac Killer? I'm afraid I have no thoughts on the Zodiac Killer. I just don't. I don't do I. I don't think I even know the story well enough to, to, to, to have thought about it. I'm not a. Yeah, so sorry, I can't answer that. I mean I would have to look into the story, so. Shaky raindrop, $5 ask. Hi Jonathan. I lost my job this week. I'm sorry. Just want to say thanks for all you do. Been watching since I was 16. The idea you present have changed my life. Well, thank you. Shake your raindrop. I wish you the best. Strange time. It's a strange time. So I wish you the best in finding some opportunities for your life. So the golden thread for $5 asks any thoughts on movies normally running about 2 hours? That an artifact of the medium or perhaps deeper? Gospels are about two hours to read as well. I don't know, I've never thought about the two hour thing. Yeah, I'd have to think about it. I mean liturgy is usually about two hours. So I wonder if there's something, I wonder if there's something about like a normal cycle in the human person. Like I don't know the kind of cycle of attention or cycle of participation. I'd have to think about it or have to. I'd have to look into that. So last one, last super chat. Here we go. Luke Lemon for USD 10, $10. When people say the eyes, the window to the soul is disconnected to the wheel symbol, we see across different religions, including your symbolic world logo. Eyes and wheels have a similar pattern. I mean, I don't think so. I don't, I don't think it has necessarily to do with the wheel. I mean, it could have something to do with the wheel in the sense of understanding the wheel as a center with, with spokes. And so the, let's say you can understand the, the center of the wheel, the axis of the wheel or the hub of the wheel as being the pupil, right? As being the hole that the light goes through. And so in that sense, I think you can understand it that way. So if you understand the wheel as this solid thing of manifestation and in the middle, especially when you see versions of the wheel, like in some Eastern traditions, where there's, it's like it's empty in the middle, so it's like a circle, empty circle in the middle. And then there's the spokes. So it's this idea, the place where the light goes through and then the manifestation which comes out. And so I think that, I think that in that sense the eye is definitely related to the wheel, but I don't know if, if it's the idea of the window to the soul. I think when people say that the eye is the window to the soul, it has to do with the fact that on the one hand the eye is that one of the, that with which we give meaning to the world is through the eye. And so the eye, let's say the invisible aspect of yourself comes out of the eye. You know, when they have these ancient. I love, I love when people make fun of old, old ideas. You know, you see it all the time, this idea that there's a ancient way of understanding vision. Like the idea that there's a ray that comes out of the eye and, and, and like touches and hits things. And then people, materialists are always making fun of that and think how stupid it is, right? The idea that there's a ray coming out of the eye which understands it. And it's like, dude, there is a ray coming out of your eye which, which, which hits objects. It's called attention. It's, it's, it's really is a ray. It's A focused thing which focuses. And then that's how the world reveals itself. Like it's not as, it's not a, it's not a material ray. It's a, it's a ray of meaning which comes out of your eye anyways. So I think that in that sense the, the eye is the winner to the soul in the sense that that's the soul or the invisible aspects will shine out of your eye and then will coalesce things into meaning. But then also, I mean, when you look at someone, you look into their eyes, you, that's how you, you, you are also able to look through people's eyes in order to perceive their intention, to perceive their, you know, whether they're telling the truth, whether they are happy, even their emotions. Everything will come, will come out mostly through the eyes. So, and you can see that like when you draw, for example, you know, you can change someone's emotions just by changing like the eyebrows, right. So you can, if you make a little caricature, you can help. Yeah. People can perceive different emotions just by changing the shape of the eyebrows around the eyes. So that can help you understand how we perceive the fact that we can do that. Then you can draw on a piece of paper, a face with different eyebrows and you have a different perception of emotion means that that's also what we perceive in other people. We have that shortcut where we kind of see meaning or see intention and all that in the eyes. So. All right, guys, I think that we're done. It's like every, every month I keep going longer and longer. So I don't know how this is going to end. If I, if I'm working up to these like huge long, three hour things, I don't think I could do it. But so, yeah, so I would say thanks to everybody. Thanks for your attention, thanks for your support and you know, we've got a lot of good stuff coming up in the future. None of this is, is ending and hopefully when I am back in my house, things are going to get more streamlined. This is, this is going to be nicer and there'll be better camera and better lighting and all that stuff. So. All right, guys, thank you for everything. Thanks to our moderators, to Jacob and Brad, thanks to two more views. Don't forget to, to, to be there on October 31st. And I will post the link to that on Twitter and on Facebook and on YouTube. So pay attention to that and I'll talk to everybody next month. Bye. Bye. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description and so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved you can also support the podcast financially going to www.thesymbolicworld.com support or else on Patreon Pajo videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
