{"episode_id":"SW - #152 - 2021-04-06 - February Q&A","start":12.56,"end":7892.21,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. Here we go. So, hello, everybody. Always a joy to see people in the chat. Already it looks like the conversation has been going around, going on for a little while already in the chat. Got a few announcements to make before we start on the question period. Biggest announcement, I guess, is that, as you know, oh, so symbolic memes is there. If you guys have not seen the memes that this channel has been putting out, it's been. It's hilarious. Very, very funny memes. Very funny meme. So check it out. Some. Some pretty funny stuff. So, so today, Jordan Peterson put up the discussion that I had with him on audio. And then tomorrow he will also put up the video part of the video version of the discussion. And so I'm pretty happy until now. The reactions that I've gotten from people are kind of what I was hoping. The discussion is quite touching and surprising. Jordan just doesn't hold back. Like, he just goes all out in terms of talking about the difficulties that he's going through, the questions that he has. And so I was really happy about that discussion. I would say that the discussion that I. That's going to. That's going up with Jordan, it's pretty much if I could have had any discussion with Jordan Peterson in public. This was the discussion that we had. We went over several things we talked about in private, but then we even explored some new territories. So I'm pretty happy about it. And I think that. And I mean, we'll see, we'll see what happens, but I feel like it's going to have a positive impact on people. So I'm pretty happy. So if you want to listen to it already, you can check it out on his audio podcast and if not, you can wait tomorrow to watch the video version. So, so, yeah, so that's. That's going on right now. Say so. One of the things I'm trying to do right now is there are a lot of stuff happening. I'm having the whole website redone and let's say also kind of working with a marketing company to look at strategies like what are the best strategies to kind of present my message the best way I can. One of the issues I've had is that I'm all over the place. You know, I'm an artist. I'm doing this graphic novel project. I'm doing these videos, the podcast. There is now a blog on the website and I also started a new podcast with JP Marceau. You might have seen him on my channel a few times. He also has his own Facebook channel. JP is the editor for the Symbolic World blog. But we've decided to start a French podcast. And so we're hoping once a month, maybe more, who knows, we'll see. But we're going to put up some French content, going over a lot of the English content that I've been doing for years, and maybe doing it in a more systematic fashion. JP is a more systematic person in general. I just kind of make videos and go from idea to idea, and hopefully you guys can gather some kind of pattern in what I'm doing. So that's going on. So one of the things that I'm trying to do is because of YouTube's pressure, let's say, and because of the massive pressure we felt in social media in the past few months, I mean, the past few years, but it's accelerated, of course, in the past few months as well, is I'm really trying to focus on the website so that if ever my YouTube channel goes down, then we'll have an email list, we'll have another platform that we can use. We can put up the videos on Bitchute. They're already going up on Bitchute. But, you know, you know, if. If YouTube goes down, then we can promote those videos. So what I want from people, I'm hoping from people, is that they go to the website and subscribe to the website. There's a down at the bottom of the website, there's a subscribe field, and you can subscribe there for free. And you will be getting notifications by email of any new content that is coming out on the symbolic world. So. So I'm really trying to focus that. And in order to do that, I'm. I did a raffle this, this month, and I'm going to do another one this month as well. And so for all the patrons that are supporting you financially, you get like two. Two chances in the raffle. And then for the people who are subscribed, just subscribe. You get one chance. So I don't know, I didn't even look at who was who, but the names of the two people that won. The first one is a sweater that is the image of everything. Sweater, Black. Black sweater. And that one was won by someone named Adam White. And then the second was. Was a St. Michael. St. Michael tote bag. And that is. Was won by someone named Charles Streetsel. So both of you guys, I will send you an email in the next few days, and you'll probably get it this month. All right? And so this month I'm Doing it again. So please sign up to the website. So this is why I'm doing this, so that if the apocalypse happens, we'll have more time to continue the symbolic world discussion. All right, so I'm going to have two chances again, like I said, two things. One is going to be a nice light gray 7 days, 6 days of creation T shirt, and the second one is also a T shirt is a black griffin T shirt. So. So sign up this month and at next month, I will do another raffle and I'll do this for a few months because I really want people to sign up. All right, so that is. That is the announcements for now. All right, so I'm happy to see Brad and Lisa are there and I see Neil Degrade is there. Derpo Robbins, you guys, check out the conversation I had with him. He's been really involved in symbolic world discussion and his last album has all these really fascinating prophetic sayings that just came true. So, you know, when we say symbolism happens, there's some people that can even, you know, intuit this, the patterns and. And somehow predict the future. So. All right, here we go. So I'm going to start on the symbolic world website. And I'm feeling kind of spry tonight, so hopefully I'll have an energy level that's up. That's up, that's up all the time here. Okay, so here we go. All right, here we go. All right. Before. Before that, there was one last thing I wanted to show you guys because. Because Teespring sent me this really cool, like, watch the Fool's Water Bottle. So I'll be drinking from my watch the Fool's Water bottle. And. And someone noticed and pointed out that the great thing about having it on a water bottle is that every time you drink, you're actually turning the fool and the king. So on the design, this design, I put like, some are the king on top and some are the full on top turning. So just having fun with that stuff. It's a lot of fun. Okay, here we go. So, Symbolic World website, Tan Mooseman asks, what is the relation between sacred liturgical language from other languages? What makes some languages holy and others not? What's the key differentiating principle other than tradition, perhaps? Well, I would say that there's something about ancient languages that really do. Does make them particular. Like if you look, for example, at the difference between the Hebrew, let's say, and Greek and Latin, Hebrew has an idiom. There's the Hebrew letters are idioms, and they're even actually hieroglyphs. Originally. And so each Hebrew letter visually represents something. And so the letters also have numerical value. And so there's an idea, let's say in kind of Jewish and Hebraic language that the actual constitution of the words are meaningful. That is that there's something about how the letters are brought together. That because each letter actually has a meaning it's not just an arbitrary signifier which is pointing to a sound then there's actually other meanings that can be held together by word and that words, the constitution of the words themselves are part of their meaning. And so there are languages like that, like, for example, Chinese and there are other languages like that where the relationship, the fullness of meaning which can be contained in the words related to numbers and related to a kind of poetic reality within the word itself, you know, is something that is absent from languages that are purely frenetic. And so Greek and Latin use a Semitic Alphabet but they kind of took a Semitic Alphabet after they lost their own writing. So you can imagine maybe their own writing before had a more kind of idiomatic or, you know, poetic structure within the very words whereas now it's just this kind of arbitrary signifying. But one of the things that phonetic languages do is that they offer more power. And so because of this kind of. Because of the phonetic structure, it offers more possibilities in terms of how those languages can expand. And so it makes sense that, for example, a language like Greek would be. And Latin would have been used for Christianity because Christianity was meant in a way, to kind of fill up the world and kind of go to the edge of the world. And so there seems that there's, to me, at least there's a relationship to. From the movement from Hebrew into Greek and Latin and then into the Roman languages, you know, the romantic languages and all these other languages that there's this kind of movement from this extremely highly qualitative thing and then moving out into filling up the world while, I think, keeping and preserving the. Or containing the deeper meaning there in there as well. But it's probably very good to know Hebrew. I think that's one of the advantages that us moderns have is that we have more access to Hebrew than did the ancients, so the Old Testament. But, I mean, a lot of people are going to knock me because a lot of people are really, really attached to the Septuagint. And I think the Septuagint is amazing and I think that it has a very important part to play. But nonetheless, I think that there's something about the very ancient languages which is very highly qualitative in what they can contain within their structure. So hopefully that answers that. So Nomad in Socks asks, would you mind going over the macrovision of what the symbolic worldview does for individuals and groups who use it? I've been trying to sort of map your philosophy as a whole, and we'd love if you could try to string it all together from top to bottom. And so one of the things that having a symbolic worldview does is at least now the thing is that in an ancient world, you really didn't need to have an explicit symbolic worldview. It was kind of like the water you bathed in. And I've often said that there's a trade off that I'm doing. And we have to understand the price of that trade off, which is that as the symbol, as we reach the edge of the symbolic world, as we get into the, to the margin of that very pattern, that is as the, the, as the clown world and all this upside down stuff and all the marginal identities start to, to, to scream loud, you know, all the dragons are screaming and all the gargoyles are laughing. So as we reach that world, it becomes harder and harder to, to see how all of this is connected. And, and so having this, having the symbolic worldview, I hope is a way to kind of jumpstart the engine and get people to kind of get a macro vision of both, of helping them understand how this breakdown that we're going through is actually connected to a larger pattern which is linked to a center, which is linked to the relationship between heaven and earth, all of these more traditional patterns. And so that's really what I'm hoping to do with helping people have a symbolic worldview. But it's important to understand that one of the reasons why the ancients didn't talk explicitly about symbolism, the way we talk explicitly about symbolism doesn't mean that it wasn't there. It means that it was taken for granted. So when we have to start to explain symbolism instead of just living it, instead of imbibing it in ritual forms, imbibing it in songs and music, in, you know, in all kinds of events and architecture, all of this, then when we have to start to explain it, it's actually bad news. But that's where we are. So what I'm hoping is that regaining a symbolic worldview will, at least for some people, be a kind of cpr, a kind of CPR to kind of help people breathe again and rediscover from, from the inside, how to participate in reality, you know, In a fuller way. So hopefully that answers that. So Luca Askovic asks, what is the symbolism of Genesis 34? Man, you guys, the chapter where Dina's daughter, Dina, the daughter of Jacob, is raped by Session. Session and his father strike a deal so that Jacob's family and Hamor's family intermarry. Later, Shesham, his father, and every male in the city that they resided in were killed by Levi and Simeon. How did this story connect to other stories of the Bible and ultimately to Christ? Man, you guys, that story, that's one of the toughest stories in the scripture, but it's also one of those stories that says a lot about how reality works. And so you can understand that story as, let's say, explaining the relationship between identity and the strange and identity and the foreign. And you have to be careful. Like sometimes I talk about the idea of the foreigner and the foreign. And you really have to understand that category as a universal category. It's not just about foreigners in the strict sense is that every identity has foreigners to it. Like every form of group, like your family has foreigners. That is all the strangers outside that you don't know are strangers to you. And so it really is a universal category. We have to be careful not to see it too strictly. But in terms of this story, the idea is that first of all, it's important to notice that Hamor, the father of Seshem, means donkey. It means ass. That's the first thing to understand for those who have seen kind of my talk about the symbolism of Christ sitting on the donkey as he enters into Jerusalem and what that means both for. For, let's say the. For Jews and for Christians. It has to do with this idea of the, the stranger, the impure animal, the. The donkey as the image of this strangeness, okay? And so the problem, the problem is, happens at. On many, on many sides. And so you could understand it as that which is outside taking your possibilities, right? And so the, the. The. The feminine, the female, the sister of. Of the. Of the brother, the daughter. She is, she represents the possibilities of that world. You could, it could have been someone's wife, you know, it could have been just like you see in the story of. Of Abram and his wife when he goes into the foreign land and his wife is taken by the pharaoh. Okay? This is similar in terms of the symbolic structure, what it's talking about, which is that the, The. The. The strange can take your possibilities and can take them away from you so that it will ultimately destroy you, right? So you imagine a foreign army on the outside, they ask for tribute, they ask for something and you start to give away your wealth to that which is outside. And then you, you. You starve yourself and you stop to, to. You stop to be. So. You stop to be fruitful. And so you can imagine that. So this thing happens where the stranger takes the. Takes Adina by force. And so now Jacob tries to remedy the situation. Jacob tries to remedy the situation by saying, is there a way that we can actually bring you in and make you in communion with us so that when you, if you engage with us, you're not taking our possibilities, but you were actually building together? And so what he asks is, he asks them to be circumcised. And so when he asked them to be circumcised, he's saying, remove the donkey, remove the outside, remove the animal part, remove the garment of skin. And if you do that, then we will be able to enter into communion with you. And therefore, when you engage our possibilities, it'll be a mutual building rather than you taking them away from us and then, and then us losing. Losing what we have. Okay. And so, and so that act by Jacob, which is a problematic because. Because Seshem raped Dina. And so it's, it's not like there was. Everything was balanced at the outset. It's like Jacob reaches out and wants to be in communion with someone who raped his daughter. And then the sons are like, we're not going to have this. And so what it does is sometimes I talk about how one excess leads into another. And so Jacob's desire to enter into communion with someone who raped his daughter leads to an excess which is the son saying, yeah, is that what you want? We're going to slaughter all of them. And so then comes the other side. It comes. Here comes identity manifesting itself as a cutoff as like, we're going to chop off the. We're. We're going to, we're going to cut off the margin. Like, we're completely going to eliminate the. And so it's like the image of, of the image of the, the sons of Jacob slaughtering the daughters of Hamor is a circumcision in like a very dark asp, Very dark version of circumcision. They're like, we're going to remove this. Okay, and so how does this relate to Christ? This is very, very, very much related to Christ. Christ is, is all about trying to solve the problem of the inside and the outside and how it is that. So you can imagine that Christ goes all the way Right. Goes all the way and is willing to die even at the hand of the foreigner, at the hand of Hamor, because he dies at the hands of the Romans. He also dies at his. The hands of his own people. So that also, all of that is kind of the extremes are manifesting themselves all at the same time. But the idea is that Christ succeeds where Jacob failed, that is where Jacob failed to enter into communion with the, The. The stranger, Christ succeeds. Christ is able to, To. To. To join himself with Rome, with the, with those that killed him. It takes a long time and it happens in a kind of. In a. In a very deep, you know, and bubbling up way, but it ends up happening. And then Christ takes over Rome and Rome. It's not that he takes over it, but that Christ and Rome actually now end up, finally end up being joined together. And so you could say that the problem which is set up in this story, that the problem of the inside and the outside, the problem of how the outside tends to take what's inside, and then you want to deal with that either by entering into communion with it, either by pushing them away, you know, or there's another possibility which have been to just to disappear, right? To be taken up by the, by the outsider. And you can see it in that story, by the way, because that's also what's happening. Because when you see from the side of Hamor, he's saying, it's like, ha, like we are going to enter in communion with them and then very soon they'll stop to exist and we'll basically take up their identity, right? And so it's like all of the dark sides of this problem of inside and outside are manifesting itself in that story. And then Christ comes and brings a kind of universal solution to that problem. So, all right, I'm talking way too much at each question, which means that I'm not going to make it through the end of this. All right. So Benjamin Rva says, before encountering Capella Romana's album Lost Voices of Hagia Sophia, it had never occurred to me that music in the past was composed for specific spaces. The different cathedrals had different acoustics and would play differently. This may be wonder. Do you think we could, in the near future offer digital pilgrimages where people might experience holistic historic liturgies and other cultural practices in their original context through technologies like VR? Might this provide a means to transmit the body, cultural practices that the written word does not? Would there be something inherently wrong about a virtual Eucharist? I would say there's definitely something wrong about a virtual Eucharist. Like, especially because Eucharist isn't just that it has to be embodied. You have to eat the bread and you have to drink the wine. It's not a mental activity. It's not a virtual thing. It has to actually happen. And it also has to happen in communion with others. There's a reality of like, kissing the cross and kissing and kissing each other and this bowing before each other and the smell of the incense. And all of this reality which is making us have the same experience in the same place, I think is very important. I mean, whether or not someone would want to create a pristine representation of some ancient liturgy, I don't think that's completely useless. But it might not be as useful as some other people think, which is that tradition is not the same as archaeology. Tradition is not the same. Real traditional people, let's say, don't want to preserve past things, just to preserve past things. That is an ancient church, even if it was hundreds and hundreds of years too small. When it was too small, and the, the. Let's say they had a lot of money and they, they had donors and they were capable of, of making it bigger. They had no problems tearing walls down and making it bigger and renovating it and re. Rebuilding it because. Because tradition is alive. Right? And it's. They also wouldn't want to destroy it. Like, they weren't looking out to. To break down the past and build up new things, but they also didn't have a problem with it because the tradition was a living, breathing thing. And so, so the idea is that if we're. If we couldn't, and it would be very, very stupid to try to revive some practice that happened in Constantinople, you know, thousand years ago, if it was just to be kind of very, very historically accurate. You know, like I said, tradition is a living, organic thing which both looks to the past, but is also not a slave to the. To just. To the forms just because they. They exist. Right. So hopefully that. That makes sense. All right. Okay. So Josh the mover says, what is the meaning in Psalm 50 of the line, prevail when thou art judged? It seems to suggest God will be judged. Is this referring to the world's opinion of Christ as when Pilate judged him? I would have to look at the context of that because I don't necessarily remember that. Like, who is that? Who is that referring to? I. Look, I'm sorry, I don't know. I don't understand the context enough to be able to answer You, Josh. Sorry about that. Prevail when thou art judged. I would need to. I would need to take the time to look at the context. Sorry about that. Maybe next time provide a little more. I know I asked you guys to write short questions, but maybe provide a little more context because I don't know that that psalm by heart. All right, so Jane VA says, what is the best way for someone new to the Orthodox Church to seek a congregation? In the D.C. area where I live, there are Greek, Russian, Coptic, Romanians here at Kokan. Et right. My journey has been raised fundamentalist, Protestant, rebelled by becoming anti religious. Jvpu Curious about Orthodox church. Any resources you can offer? I don't wish to stagger into the Orthodox equivalent of a Baptist church. So, I mean, I would say. I would say the best thing is to contact the priests. The best thing would be to contact the priest and to kind of see what kind of church that you're dealing with. You know, I would say, like, my experience is that often the Antiochian churches and the OCA churches, the Orthodox Church of America, are more welcoming to strangers, strangers that aren't part of the ethnic group that the church is representing. So, you know, if you have a Greek church or, you know, like a Romanian church, sometimes it'll all be in Romanian. And then there will be like a more ethnic aspect to the church. And so that it can be fine if you can handle it, but it can also be alienating. It can be difficult. So I would say to see, like, if there's a church that the services are in English, that's already probably a good sign, a sign that they're open to newcomers. They're open to people that aren't part of their strict group. And so that would be what I would suggest you to do. All right, so Timothy Aspaslaw asks, hey, Jonathan, in Roman Catholicism, it is allowed to draw Jesus Christ as the Lamb of God. Yes. Can you talk a bit about why we don't find these images in the Orthodox Church and how that relates to iconology? So this is a more technical question, but I mean, it's important. And so I don't talk about kind of the specifics of iconography so much, just because sometimes it gets difficult. But so in the early centuries, there was a council called the Kinesex Council. And the Kinese Council was a council between the fifth and the sixth Ecumenical Council. And so in the. The Kinese Council had several aspects, but one of the aspects it had was to say that in. In Christ we have the. Let's Say we have the antitype of the prototype. And so you can imagine that in the Old Testament there were prototypes of the Incarnation and so the Lamb of God, different images that could be used to represent, to represent Christ, but with, with the coming of Christ, we have the real thing. We have the thing itself. We have Christ. And so we should represent in images the image of the person Christ, and not represent him as the antitypes, as the, the shadows before which were kind of pointing to the. The Messiah. So this was a council that, that, like I said, was between the 5th and 6th Ecumenical Council. Now, this council was never accepted by Rome. And so when the Council arrived at the Pope's desk, the Pope was so annoyed at this suggestion that that is the moment where in the Catholic liturgy, right, in the Catholic Mass, it always has, when it says a Lamb of God, that takes away the sins of the world. That's when it got fixed into the Mass because the Pope was like, I'm not going to let this go through. And so then the Pope actually commissioned to renovate a church in which he had. He had the Lamb of God portrayed in a more kind of very, in a very, let's say, elaborate way. And so that separation stayed until now. And so in Orthodox churches, sometimes they take that idea within the, the Kinesex Council and they actually push it further. And so, for example, that, you know, I will tend to represent. I'll be very comfortable representing Christ in glory with the four. The four animals of Ezekiel, you know, as the four evangelists. But in some churches, they will, they won't do that. They'll only represent the evangelist as the people. And so you'll see, like in Orthodox Church, often you'll have the dome of Christ in, and then in the corners of the pendentives that are like the four glories or the four protrusions of Christ, then they'll represent the four evangelists, but not as animals, but as people. Whereas in the west that remain, but in the east, you still do find people that will represent the four glories as animals. And so that's what it is. It was one of those squabbles between east and west, which happened quite early in the story story. So, so that's less symbol, less about symbolism and more about just inner church squabbles. All right, so what is the symbolism of milk and honey, specifically with regards to the land of Israel? Milk and honey are like, it's a. You could understand it as, as, as two graces that are coming from God. You can Understand it as something like two aspects of wisdom or two aspects of knowledge. You know, one of them is. One of them has to do with the idea of, more like, of feeding, let's say, directly in terms of what comes from the mother. And then the other has to do with kind of wisdom, which comes from something like the wild, right? And so one is from the mother, one is from the bugs. You know, one is from the. One is from the inside, one is from the outside. And so it has to do with this idea of this relationship of how there is something sweet, there's something feeding, and that there's something sweet that comes from the inside and also something sweet that comes from the outside. And so the ultimate example where you can see this symbolism is, for example, when Samson finds honey in the carcass of the dead lion. This is really showing the symbolism of honey. And so the idea is that the lion, first of all is impure because it's not a kosher animal. And the lion is impure also because it's dead. And Samson is supposed to be a Nazarite, and so he's actually not supposed to touch anything dead, and he's not supposed to consume anything impure. And so he finds honey inside the dead carcass of the animal. And so there. And. But honey is kosher, so it's important to understand that it comes from the wild, it comes from the outside, but it, It. It's also kosher. It's also something that the Jews were allowed to eat. And so it's like from this dead carcass, from the, The. The impure, the foreign, the strange, you know, the hamor, the. The donkey, all of that. That nonetheless, in that. That fringe possibility, he finds the sweetness. And so that's also why John the Baptist, who lives in the desert, eats bugs and wears garments of animal skin, but also eats honey, because that's the wisdom that he has access to. It's this kind of wisdom which is hidden in the outside. So. All right, all right, here we go. So, Nelson, Justin, Evan, when the Bible speaks of the church, is it meant to be interpreted as one of the Catholic, Orthodox, Protestant, etc. Denominations? Or does it point to something like the invisible fellowship of all true believers, regardless of denomination? Do you know of any examples of instantiations of the pattern if there is one? And so when the Bible speaks to the church, it talks about the one church. There's only one church. And it's not invisible because the body is not invisible. The body is visible. And so it's A paradox. It's a sad. The fact that the church is broken or it's hard to even say that. The fact that there are these divisions which happen in the story of the church is a scandal. It's not normal. It's something which shouldn't be accepted. It's something that shouldn't be seen as inevitable and something we have to just accept. Right. It is a sign of our sinfulness. It's a sign of our incapacity to hold together. And so when the Bible talks about the church, it talks about the one. There's only one and it's visible and it's the body of Christ. So that's what it is. Okay, so Eric says it would be very interesting to hear you talk about the divine council. The giants are getting some body in regards to the article, by the way. God bless. And so those who've heard me talk, I'm constantly trying to get you guys to listen to the Lord of Spirits podcast. It is, in a way, advanced listening. It's advanced listening in the sense that, you know, Father Stephen and Father Andrew, they really stay in the story pattern. Like they really talk about it in a very mythological story version. And so it can be intense for kind of atheists and secular minded people because it's like, all right, here are these hierarchy of angels and here's this divine council and God is sitting in his throne and the angels are worshiping him and are becoming principalities in the world. And we're called to be principalities. All right, so but if you want to understand, I've said this all the time, like you'll. I think someone, I think Lisa or Lassa, who were running the chips, the Clips channel, put up a clip recently, which is, which I talk about that, which is that the hierarchy, the hierarchy that I talk about in the world is not a hierarchy of concepts, but is really a hierarchy of beings. And that's actually how it works. And so you can imagine that there are beings that, that come up into principalities, and then these principalities are beings that go all the way up into the higher, higher forms. And you can imagine that at the highest, you have a divine council, which is the closest beings around the divine, the divine, the divine throne. And those are the highest principalities in the world. They are the rulers of all aspects of reality. And so the higher aspects of reality, and so they also worship, they serve, but they also become the principles. And so the idea that Father Andrew and Father Stephen are trying to help people to understand is that one of the things that happens with Christ is that we are called to become that, to join the divine council to become, to become principalities in our participation in Christ. And so their contention, and I totally agree with it, is that when we talk about the patron saints of things and the patron saints of places and of churches, that's an actual reality. It's not just a kind of like a poetic desire to name something after someone we like. It's like that being is acting as a principle for that, for that community, for that church, for that whatever it is that's being named, you know, through the name of a saint. And so there's a competition. There's a competition in the principalities. There's still some struggle in there. You know, it's like, especially as we become secular and we start to name things after people that aren't necessarily in that divine hierarchy. And so there's a competition, there's a war in heaven and, and there's a fight between the principalities and who is actually going to become, you know, the different. Who's going to name that, how are we going to name that street, how are we going to name that bridge, how are we going to name these things? This is super important in how reality lays itself out and how we see what is ruling in. In the world and what is holding it together. So. Or participating in its fragmentation, we could say. All right, so Kingsley says. Hey, Jonathan, wondering if you can elaborate more on how you view modern counseling approaches, techniques, CBT, psychoanalysis, etc. Are there specific counseling approaches or techniques that you would deem harmful? I probably don't know enough about that. My father is a psychologist, by the way. I might have mentioned that before. One of the things like, for example, I'll tell you an interesting thing. My father right now is using something called family systems therapy. And he finds that in this system, this, this family systems therapy, there's this idea that there's an analogy between how a family works and how you work in as a person. And so there's this fractal structure where you have different parts of you that have different wills and volitions, and they're, they're fighting amongst each other, they're collaborating, and that you have to be able to bring them together into a communion in the same manner in which a family brings themselves into communion. And so my father has been taking up that approach because he sees it as coherent with a kind of more traditional vision of the human person, this kind of fractal reality, and more, let's say, in communion with how the fathers would talk about the psyche and all of this. There are some really good orthodox books that talk about that. There's a. There's a book called. I think it's called Orthodox Psychotherapy, I think it's called. And then there's also one of the great books which was written in French, actually. And now I'm gonna forget his name. My goodness. It's called Theology of Illness, and it's written by a French author. And now I'm gonna forget his name. It's gonna. It's horrible. And somebody can remind me in the. In the chat what his name is. I have it in there somewhere in my library. It's called. His name is Jean Claude Lachey. Man, I hope he never hears this and sees that I forgot his name. So Jacques Claude Lachey has written a. Written a wonderful book on. On spiritual illness. And he's a. He's a physician, but he really goes into the church fathers and how they view the psyche and how to apply different methods to kind of help people through their. There's psychological problems. All right, so David Flores says, what symbolism has captured your attention currently? Also, your AI Conversation was awesome. Well, happy you enjoyed the AI conversation. Oh, I mean, capture my attention. You know, there's. All the COVID stuff is hard to. To avoid. Like, the COVID stuff is majorly capturing my attention. And so I'm being very, very attentive to what's going on and the moves that are happening and what. What it means in terms of societies of control and, let's say, systems of control and systems of naming and systems of identification. I've been very sensitive to that and how the strange idea that it would be related to Covid and vaccines and tracing and all of these ideas is what I've been thinking about. So I'm actually working on a video which will be on the Mark of the Beast. And. And so I'm taking my time because I don't want to say anything. Anything that will. People will think is crazy. But I'm probably going to make a video on the Mark of the Beast very, very soon. Hopefully this week or maybe next week. All right, so from. Okay. Mikael, Hi. You have said more bad things about Michelangelo's art than Raphael and Leonardo have said combined at the same time. You come yourself from a Western background. Are you not afraid of she bears coming after you? Have you ever rather. Have you ever considered rather following the pattern of the abbot Sujur of St. Denis, who learn the text of Eastern mystics and revolutionized Western architecture by sponsoring the birth of the French Gothic. Or maybe it is exactly what you do with your YouTube channel. Yes, I, I think the Sujur of St. Denis is a very important figure in terms of understanding what art can do and understanding its relationship to the manifestation of spiritual realities in the physical world. And so it's like one of the reasons why I'm not so afraid of going after Michelangelo is because he is like, everybody sees him as the summit of, of like Western art, as like the, the great genius and the great initiator of everything. And honestly, like, I really don't see him that way. And so, and so I actually find it, find it kind of funny that I see him rather as kind of like the, the beginning of the decline of Western art, you know, so, you know, I just think that's funny and. But I really do believe that. I really think that Michelangelo's art is, has all. Has everything in it, which kind of came about later in terms of the, the breakdown of visual, of a visual reality. So. All right, so Jacob, Jacob says it is obvious that we live in the time of excessive chaos. Values confusion, gender confusion, etc. Or could it be argued that it's actually the time of excessive order? Eg, there's no room for any kind of non conformism towards the rules of the outrage crowd one way or another. How was the time before unbalanced to the other extreme so that the pendulum had to swing so far to the border? Is it still the World War II residue? And P.S. are you planning to visit your wife's homeland in any time in the future? So my wife is from Slovakia and so I would love to. We've been there once at the beginning of our relationship, but we haven't been there since. I was actually thinking that maybe we could go there for several months with the kids so that they kind of get a sense of that aspect of their, their heritage. So I would love to do that. And you're right, your intuition about the situation right now is very good because when I often talk about the clown world stuff and how the world is upside down, but this is. The pendulum is kind of there at the same time. So we. There's both a. And a kind of excessive, you know, insane upside down clown world. And there's also a kind of excessive, insane culture of control. And so that's why like this, the joke that. How is it that we could have Brave New World and 1984 at the same time, even though we're watching it happen in, you know, before Our very eyes. And so that is kind of the weird contradiction of the 666 symbolism and the system of the beast, let's say, which is that in the desire to control, to name everything, in the desire to kind of have an all encompassing system, it also ends up moving out into the exceptions and let's say featuring the exceptions. And so it's like this strange contradiction. And, but then it also is leading to. It also leading to the kind of. This is why the upside down is also a hierarchy. It's like an upside down hierarchy. That's why, like the satanic hierarchy you could call it. Right. That's why the world as it breaks down, it actually forms like a weird inverted hierarchy, you know, rather than just kind of break down into, you know, kind of fall apart and spread out. So, and so, and is it World War II residue? It's more than World War II residue. It's just, it's just like, you know, when we talk about like fractal patterns and fractal cycles and so this is what's going on. It's like the thing that happened before World War II. Let's say, let's say communist revolutions, Weimar and, you know, technological advance, all of this weird stuff. And, and then identitarianism, all of this was kind of happening and now it's happening like all of it at times 10 in terms of maybe not the communist revolutions, but let's say several aspects are happening way bigger. And so. Yeah, what does that lead to? We'll see. All right. Cooper Hayes says while dragons may be more real than dinosaurs, where do the fossils fit into the symbolic worldview? So, so a good way to understand what fossils are is that they're residues. They're residues from a world that's gone. That's what they are. And so that's also what dragons are. Dragons are also things that you don't know what they are that kind of, nonetheless have take up form and then come in and try to devour you. And so that's also what dragons are. And so the, there's, it's not arbitrary that there's a relationship with, with fossils and the vision of dragons and of these ancient beasts that are, that are there in the ground and that we don't remember. But they're, they, they manifest, they're there nonetheless and they're not part of our world, but they end up being part of our world by manifesting this kind of fragmented kind of animal chaos that is, that is there. And so there's a total relationship between the experience of fossils and the. The categories of the dragon. All right, all right, so we're done with the Symbolic World website. And it is 10 to 10. Not bad. I have energy. These. I used to not be able to go more than like an hour, and now I think I could probably go for two hours. Should be okay. All right. And so here we go with now on Patreon. Oh, I did not like just for people, if anybody's new here, the. Oh, I wanted to do something before I move on to Patreon. I'm gonna do this right in the middle of the video so that people actually have to watch half the video. Is that the last patron only video that I made is a video on the symbolism of the Jesus prayer. And I made it patron only video. And some people are very not annoyed. Maybe some people are annoyed with me, and some people don't understand why I did that. And the reason is that I've been thinking about making a video about the symbolism of the Jesus prayer for a while, but I didn't want it to be a public video on YouTube that could be picked up by the algorithm and that could be promoted just because it is a very. It's a difficult subject and is not something that is meant to be cried out into the stratosphere. And so. And so what I wanted to do is to offer to people who are more engaged. And so I put it up for patrons only, but also for people who are on the Facebook group, people who are on the Discord group. And I told people that they can share it privately to those who think would be interested in. And so right now I'm going to post the link to that video in the chat. And so because you guys are here and you guys are involved and you're watching this live, I also want to make it available to you guys. And like I said, go. You can share it to people in private, but please don't let's. I don't want this to be like a public video. Right. And that's the. That's the idea of this, of. Of why I made it private and why I kind of tried to contain it, let's say. All right, so. So it's there in the chat, but I will probably, by the end of the discussion, I'll probably delete it from the chat so that it doesn't end up in the public video. All right, guys. Okay, so now let's go into the patron Patreon questions. So Bjorn Olsen asks, I wonder if the inability to hear and see each Other that we are seeing on both sides of the political sphere right now. And the general misinformation coming from every angle regarding the current situation is somehow related to the spirit of confusion. Could you elaborate on that? How can we overcome it? I mean, I would say yes, that's a good way to understand it. I mean, one way to understand it is that as we cease to have something which unites us, then the things that are separate at the bottom are going to start to move farther and farther away from each other, right? So think of it as like a wheel or think of it as a mountain. As you move farther away from the mountain, the points that were close together at the top are now becoming further and further apart. And they. Because they don't remember what it is that is bringing us them together, then they can't see. They can't see in the other. The other part. They can't see that that other part is linked with them higher up, you know, and so what's going on is just inevitable. It's like. Like when someone says something like multiculturalism is. Is. Is. Is wonderful. It's like. What do you mean? Like, I. It's a very disturbing way of seeing the world. It's like there's a multiculture. There can be multiculture. There's always been multiculture. But that multiculture nonetheless has to have something which unites it above. There has to be. There also has to be a uniting principle which will join the different multicultures together. Or else it's war, right? Or else it's conflict. Or else it's the incapacity to see why I should be next to the person next to me. And so the idea of diversity in itself or multiculturalism in itself doesn't work. It's impossible. It's a complete impossibility. It can only work if there's something, there's some principle higher which is joining them together. And so if you look at ancient empires, like if you look at the Byzantine Empire, it was massively multicultural in the sense that there were Syrians and Armenians and Greeks and Latins. And there were different aspects of society that have their different practices and the different guilds and their different. So it had massive variety, but it also recognized something that united it together at the top. And without that, that what's going on now is inevitable. Conflict will grow, because how can you. If you don't recognize what's joining you together, then all you can see are enemies. All you can see are people that are different from you. And ultimately that doesn't that doesn't work. It's not possible. All right, so, hi, Jonathan, what is your take on the symbolism of sealing as used in Scripture? For example, the seven seals in Revelation and being marked by God's seal in Ephesians 1:13? My intuition tells me sealing has to do with being authorized, having a defined traceable origin, and thus following a straight path. Please also comment on the seven seals in Revelation. And so. Well, there are different aspects to what you. Yes, there are different aspects to the seal. And so it depends on the context. But obviously a seal is something which is, like you said, it's making it authoritative. And so if you put a seal on something, it is saying, this comes, this is authentic. This is the real thing. It comes, it is connected to the thing that sealed it, right? And so if, like you write a letter and then the king puts his seal on the letter, he's saying, I recognize this as my. I'm recognizing this as my word. Even if the king maybe didn't write it himself, he's saying, I give it authority, right? And so that is what the seal means. It means that it comes with the authority of that which is above it. And so it's like I if you receive the seal of God, then you have been bound to God and, and your actions and your, the things you do will be manifestation of that which sealed you well, even if it's your own gestures, they nonetheless will have received the authority that God has given you. So that's the idea of the seals. Now, there's another aspect of the seal which is also a holding secret, which is a holding into the inside. And that's more. How has more to do with the idea of, of the seals in revelation. So it's the idea that there are the seal also like if you have a letter and there's a seal that closes it and keeps it shut, and it's only meant to be opened for a specific reason. And so in that sense, the, the idea that, let's say that there are some things within a structure of authority that are only for itself, that are meant to be kept secret within, within the organization, right? That aren't meant for the outside. And so that will also be. Will also receive a seal in the sense that it will. It's like the seal then becomes like a wall around it which is saying, this is meant for the inside, this is meant for us, and it has to be contained. And so the idea of the breaking of the seals is, is that let's say these mysteries, when they get opened up and then they, they kind of pour out onto the world. They, they, they act, let's say they, they don't. They act like wrath, let's say. It's like that which is held together inside has a certain, let's say, the love of them you can imagine, like the love of the mother for her children, which keeps that inside and keeps it protects the inside. Once that same love gets turn to the outside and opens up, it can become she bear like she bear love where now I'm going to ravage what is not in the inside. And so the breaking of the seals in Revelation seems to have to do with something like that. All right, all right. So Nina Moore says, I don't have a question, but I'm so stoked because I just got my obviously Santa Claus exists shirt. Well, I love it and so do my kids. Well, I'm happy you enjoy it. I had a lot of fun making that, by the way. My daughter is. I designed that with my two daughters. And so my daughter who was, I mean, I guess at that time she must have been like 7 or 8. She's the one who made the writing. She wrote it down. And then with my other daughter who's a little older, she kind of helped me to think of the design and how to put it together. So that was fun. All right. So Jeff Dunlop asks if enlightened culture is depersoning. God becomes high ideals, King becomes constitution, Father replaced by money, mother replaced by childcare. Does this system eat itself in the end? Does it bring the return of the person? And so, yes, I mean it's definitely. It's already happening, you know, it's already happening. So. But I think it's not completely. And I think what I'm doing and what other people like me are doing is part of that, is part of now showing how once you once enlightened culture starts to really take seriously the person or to now turn the eye back and try to understand the, the personal, then it starts to lose its bearings, it starts to lose its, its foot and then, then the person is going to reappear and is going to start to re manifest himself. So. Yep. So Nathan Hart says, can you explain the story of Jacob wrestling God? I've read many interpretations, but none of them quite capture the powerful, mystical, condensed aspect of what happens in that short moment. Yeah, because that's a tough story, man. That's a. That story is difficult. At least I find it difficult to completely understand. It definitely has something with Jacob. It has something to do with Jacob. Himself. And the problem of Jacob, you could say. And so it's like, you know, when. When. When Christ says that the. The kingdom of God comes through violence or comes to those who take it by violence. There's something about this idea that Jacob is able to pull the blessing down on himself. And it's something which is like. It's less, especially as a Christian. It's like the kind of thing which makes you uneasy because there really is this idea that grace comes first. But in that story, that's what you get. It's like Jacob. Jacob wants the blessing, and he's willing to fight for it, and he's willing to go all out and, you know, he's willing to do all kinds of things, right, to get the blessing. You can think that that's what he's doing. Like, think about it this way. Jacob is wrestling with God when he steals the. When he steals his brother's blessing, he's like, he's willing to do anything to get it. And so it's almost like most people. Most people will do. Will fight and do anything to get the riches. But what does it mean when Jacob the snake is willing to do everything, willing to lie and cheat and do all these things to get the blessing? It's a very strange story. So when Jacob. When Jacob, you know, pretends to be his brother in order to get his father's blessing, he's already doing that at a lower level. And then when he. Then when. Then when he wrestles with the angel, that's what it's showing. It's like he's willing to do anything in order to get the blessing, and he gets it. So I don't know what to tell you, man. I'm not going to make any theological pronouncement on that, but that's what it is, you know, and you can see it. You can see that the story is structured so that you realize the relationship between getting the blessing from his father through weird means and then getting the blessing, you know, of. Of God through weird means. All right, so Jonathan Morgan says symbolism of the boogeyman and monsters under the bed. And that's a pretty simple one, isn't it? Don't you think? I mean, the sense that it's like you're sleeping. Sleeping is the place where reason starts to break down. It's the place where consciousness goes away. That's where monsters come from. Monsters come from the place where reason breaks down. It comes from the place where the category system breaks down when you encounter the unknown. And so you can imagine that the experience of also being at night and then going into unconsciousness and then understanding that the monsters come from below in the psyche, but they also come from below just normally, right? The crocodile that pops out of the water and, you know, and grabs you, this monster that comes out and gets you that image, or the snake that pops up and gets you, or, you know, the creeping. The creeping beast that will surprise you. And so it makes sense that those monsters would be under your bed because they're under manifestation. They're at the bottom of the world. They're in the. They're in hell, they're in death, whatever, however you want to. To phrase it. So imagine the world as a hierarchy. You have the ceiling, then the bed acts as a level of being. And then under that, there's this unknown, dark, chaotic level of being which is under there. And that's where the monsters are. That's where they come from. All right. So Ron Wood says an icon that is used for liturgical purpose has a clear place and explicit use. But apart from ornamentation, how should art be integrated into the body of a home? Roger Scruton suggested humans don't need everything to have an explicit use in the utility sense. Is this true symbolically as well? And so one of the things. So there's several things that. Let's say that the objects that you put in your house, there are several things that they can do for sure, if they're beautiful and they're useful, that brings things together. And so. And so, for example, having a beautiful vase or a beautiful kitchenware and having that displayed, that can be something which is kind of joining things together in terms of not having things that are arbitrary. There's also a joining which is related to memory. And so the idea that in your home, you would have objects that. That participate in your story or that help you remember things. And so if you look behind me, like the basket that is there, it's a basket. Obviously, I don't use it as a basket, but that basket is something which has very intense personal connection to me because it's a basket that I brought out of a war zone while I was having good gun, while there was gunfire going over my head, I carried my clothes in this basket to be evacuated. And so it's like that basket is very strong, but I also find it very beautiful and aesthetically pleasing. So then I put it up. And so similar things that you'll see around me will have some connection. And so my wife and I, both. My wife and I, we really don't like having arbitrary art in our house. And so the art that we have is usually connected to something, connected either to memory, connected, made by a friend, made by me, or that the subject is something that we care about and that is close to us in some way. So I think that the closer you get to that, the better it is for creating a coherent space. But there's also decoration is not. Is something, decoration is something. And so decoration is also something that you can do, you know. But I would be wary of the contemporary art. Like wary of art which is, which is extremely cynical and ironic and kind of these double triple ironies, you know, I would be very cynical about, I would very cautious about putting that up in your house just because, you know the things that you have around you will affect you. All right, so JL Says hello, Jonathan. I remember a video with John Vervaeke and I think Paul Vanderklee and JP Marceau. From what I can remember at one point in the video, John gets excited when he finds out that perhaps he can believe in miracles if he can equate them with the placebo effect. I've seen you and others talk about the placebo effect and emergence and all this stuff before, but I'm afraid it's all a bit over my head. Is it possible to get a dumbed down explanation of how miracles relate to the placebo effect? All right. And then he says, do you have any idea when John Revaake's religion's coming out? When's it dropping? I don't know what you're referring to there. I hope he's not starting a religion, but. So how does the miracles relate to the placebo effect? It's actually quite simple. Is that helping people see the placebo effect and helping them think about it is forcing people to see something which everybody recognizes as exactly existing, Right? So everybody recognizes that the placebo effect is a real thing because it's there in research. You know, if, if you're going to have a proper research on medicine, you need to include the placebo effect in your research because they. People recognize it as an actual phenomena, but it's a phenomena whose causality is not the mechanical causality. It's a, it's a causality of meaning. And so what causes the placebo effect is meaning is meaning authority, right? Trust. That's what causes the placebo effect. And so those things, right, Meaning, trust, authority. That's what miracles are made of. Miracles are made of faith, authority and meaning. Because miracles aren't just freak events. All the miracles of Christ are extremely meaningful. They are showing the pattern of reality. And so that's why the placebo effect is like a. It's like a wedge in the world where in the materialistic world you can point to something which no one can deny and doesn't function by materialistic material causality in the kind of mechanical billiard ball type of causality that people think about. So that's why it's important and that's why it can help people understand. We're not saying that the placebo effect is miracles. We're saying that understanding the placebo effect can help you understand how there are events in the world that happen through meaning. And that's what a miracle is, just at a higher level than placebo effect. All right. And so Dorothea asked, hi, Jonathan, have you watched the anime Fullmetal Alchemist Brotherhood? And so no, I haven't. A lot of people have told me I should watch Full Metal Alchemist. And so maybe, who knows, I don't know. I. I don't watch a lot of stuff. And so I'm actually watching. Some people will probably get annoyed with this, but I am actually watching the second season of Attack. What is it? Attack on Titan or whatever, the Titan show. It's very violent and disturbing, but there's a really interesting play understanding of how the giants work and how the walls. You know, I won't spoil anything for you, but like there's a relationship between the walls and the giants and there's like, there's infiltration and so it's all about the inside of the outside and how some people from the outside can. Can help fight off the outside and stuff. So it's actually an interesting structure in terms of that, but maybe one day I'll watch that. I don't know. So like I said, I don't watch a lot of. A lot of stuff. So says at the beginnings of Christianity, the cross was originally not depicted with Christ on it. It over time this changed. Can you speak of why this happened and. Or the symbolism and effect of this change on Christianity and how this changed the Christian view of Christ and the symbol of the cross in general? So I think. So I think one of the things that we can understand of how Christianity laid itself out is that we have to understand early Christianity as a really. It was an initiatory group that is, in order to have access to what the Christians really believed, you had to be initiated into the church. So it wasn't like today. It wasn't like preachers on every corner or me on the Internet, you know, just revealing the mysteries of the church that never. That didn't happen. So you had, you see it. It's still contained in the liturgy today, in the Orthodox liturgy, where you have the first part of the liturgy, the Liturgy of the Word, which was meant for even people who were in Christian catechumens, but even not anybody but catechumens that weren't in communion. And then those would leave, and then there would be the Liturgy of the Faithful, where the highest mysteries of the Christian church was revealed. And so you see that, for example, there are early texts called mystagogies, and these mystagodes, what they were, were when someone was a catechumen and was entering into the church, once they were baptized, then they would be told, like the real mysteries. But before that, they weren't told. It's like you, you get the sense even that maybe some people didn't know about communion before they were baptized. So when they were baptized, all of a sudden they were faced with the mystery of eating the blood and body of Christ. You know, it's like you can almost get that sense that that's what, that's what was going on. But so the idea is that the crucified Christ is the highest mystery there is. It's like, do you realize how scandalous that image is? Like, can you even fathom how scandalous it is to have this dead body on the cross and say, this is an image of your God? It's like, it's a very scandalous, insane proposition which can only be approached to very slowly and very methodically, and that a person has to be brought into that mystery and initiated into it. And so now we've taken for granted. And I think that that's what happened is I think that the mystery of Christ as the church became more accepted, and as the church became the standard culture, then the mystery of the cross and the scandal of the cross was accepted and the mystery of the cross became available to people and kind of people lived in it. And so it then became possible to represent Christ on the cross, whereas before it would have been like too high a mystery to show people explicitly like that. But there are some, like, early representations of Christ on the cross that are very schematic, like 5th century images. There are a few, but often even at the beginning, Christ would be shown, like with his eyes open, sometimes wearing like a kind of royal vestment. And it's really late, like 9th century, 10th century, you start to see images of Christ dead on the cross, like The GEO crucifix seems, I think it's like 9th century, I think, or late 8th century. And so it starts to come in later, but I think that's what it is. But I mean, I might be wrong, but that's my take on it. All right, so Eamon says, jonathan, could you speak more about the meaning of sex and its effects on binding two people together? How does the soul get bound and what are the patterns of the binding and unraveling? And so, I mean, the scripture doesn't say that, that, that the soul gets bound together. It's not like the two souls become one soul, but that you get bound in the body. That is, you become one body and you become one. So it's. Some people, it's not that complicated to kind of understand it. It's like what a body is. It's like. I really love Father Stephen from the, the podcast, the Lord of Spirits podcast called, when he talks about the body as a nexus of possibilities or a nexus of powers. And so it's. And, and by the way, I think I use that when the, the, I use that exact wording in the, the talk with Jordan Peterson. Kind of like a little tip of the hat to Father Stephen there. But so you can understand that when you join two bodies together, the successful joining of the two bodies together is an extra body. It's a, it's a growing of the possibilities. And so you join together with, with someone in the body and then you have fruits. It's like that's, that's, that, that's the more immediate way to understand it is that it really does bind you with someone. But it's like you don't necessarily have to just have a child every time. But, but it's like you can understand that the fact that this is what this is doing by joining you to someone and then having more body, it's like that's one of the things that sex is. It really is a joining. And so then, but it happens kind of in the hierarchy, this idea of the man as the head of the family and the woman is more on the body side, you would say. And so you could understand that when a man and a woman join together, the woman becomes the vessel, becomes the body which receives the, receives the, the, the seed of the man. And so she, she becomes one body with him in the sense that she becomes like the, she becomes the, the home of his body. Right? So, so, I mean, I don't want to become explicit here, but it's like she becomes the home of his body. And so that is how they become one body. Right, One. So something coming from above and something coming from below joining together in that sense. Right. So that's, that's, that's it. And so, and so. But it's a real thing. Like it's a real thing. And, and there are subtle aspects to it. It's not just like a carnal thing. There's a, there are subtle joint. There are subtle aspects to the body that aren't just carnal and. Right. There are subtle aspects of you that get joined together with someone in, in a, in a sexual union that are very hard to dissolve. And so that has to do with memory, it has to do with attraction and let's say connection. Right. And so those things are not physical in the grossest sense, but they're nonetheless part of your nexus of possibilities. So your memory is an easiest way to understand. It's like if you have intercourse with someone you, then that is going to be part of you for forever. It's like you can't get rid of that. It's part of your story, part of your memory. And then if you bring that, if you, then you have a relationship with someone else, you're going to bring that memory into that relationship and it will be damaging to that relationship because you'll compare because you'll still have some longing for, for, for that which was there before. You'll be. So it's a dangerous game to play in terms of if you really want to join together in a union with, with your spouse. It's a dangerous game to play if you come in with all these other experiences because it's going to be part of that. It's going to be like a, like parasites in your relationship that are going to be there. So. All right, so Christopher Mihali says, can you clarify your dragons are more real than dinosaur statement? And so kind of like that. There was a question like that a little earlier there. It seems pretty obvious, doesn't it, that dragons are more real than dinosaurs. I mean, dragons contain dinosaurs, dinosaurs don't contain dragons. So dragons are more real than dinosaurs. All right, so let me explain it a little more. So the dragon category involves the fact that you don't know what those things are completely. And so they're the chaos element of these bones that are strewn about in the world and that are there in the ground. The unknown aspect of it is contained in the category of dragon. These monsters that, that you don't totally understand. One of the funniest things is like to see like the artist, the scientific rendition of dinosaurs and how they keep changing all the time. And they think that they're getting closer. I don't know, whatever. They imagine what, what the dinosaurs look like and they think that they're somehow being precise about it and it's just hilarious, you know, what colors were dinosaurs? And then we have all these images and we think that they're real, but the dragon is more real because the dragon says this is part fantasy. Like, this is, this is the way that we're representing the dragon is a fantasy. Because we've never seen a dragon like, or if we have in some vision or some, some ecstatic state or whatever. And so because of it, it means that all of these elements are more joined together in the right way. They more, they more contain. They contain more reality than this like, weird. This weird. They act as if people like the scientists act as if dinosaurs are like species in the world today that they can just like almost as if they, they still exist. And then they can just like put them in categories and they can tell us how they, what they ate and like what their digestive system was like. And you hear these scientists make all these hilarious statements. Then, then, then, you know, like in two weeks or in few months, then they'll realize that they were wrong. And then now they'll have a better idea of what these dinosaurs look like. Sorry, guys, I don't. You got. I'm so. I. I always feel bad when I, I become extremely cynical about, you know, scientists. So. All right. Okay, man. So the wakeful says. Dear Jonathan, is there a conflict between the path of theosis as experienced by the mystic and the social solidity of a church? Isn't it the case that mystics who have claimed to experience theosis often claim to shed the specific forms, ritual, litany, etc, that provide a church with structure? To quote Meister Eichardt, whoever sees God in a definite mode, accepts the mode and Mrs. God who is hidden in that mode. Who. Whoever seeks God without a mode, however, grasps him as he is in himself. So this is, this is actually like. You could say that this is how you differentiate a real mystic from a fake one is in your question. So I'm going to tell you guys like a little secret about mystics. And so yes, that's true. It's true that the theosis leads to an experience of God that is beyond all form. And so even in hesychasm, you know, the experience of divine light is without image, right? It is. It's a. It's something which is beyond any experience in the strict sense. And so you don't. They actually don't have vision. There's no vision. There's just this direct encounter with the infinite. And so there, there. There's no form, right? That's how the highest mystic encounters God. But that. No form, right? That, that highest aspect, when it comes back down, it always takes body, it always takes form. That's why the world exists, right? That's why the world is also an expression of the infinite. And so you can imagine that the highest aspect of something is kind of like a negation of that thing or negation of the particularities of that thing, always. Okay, so the highest aspect of a cup is the negation of the particular aspects of the cup, right? It has to be. Or else if it's just the particular aspects of the cup, then it's not going to be a cup. So all identity functions that way. So you can imagine that as you get higher and higher, it gets more and more lofty. And then when you reach the highest sphere where all of reality itself is like, stopping, and then this last move where you move into the formless, then it's like, that's how reality works. But nonetheless, when you come back down, it all lays itself out. And so if you want to know the difference between, let's say a real mystic and a fake mystic is the fake mystic is going to be an iconoclast. The fake mystic is going to, is going to, to. To say that authority is wrong, that the church is all off that. That, that all the forms of the church are evil. And so it's like that's, that's the difference. It's really interesting to see, like you, because you've heard people like that probably today, you've heard people like that that will say something like, I believe God is beyond all forms, you know, and therefore I don't participate in any forms. And so the real mystic will do that. It's a, in the, in an ascetic sense. But then nonetheless, they, they. The, the, the, the. Let's say the, the true mystics in the Orthodox Church will still take communion if it's, if it's possible for them. They will still participate in the church services if it presents itself to them. But they don't have to. They wouldn't, they don't need to. Right? There they are beyond that. But they still will. If they descend, they will descend in the body, right? They won't, they won't hate. They won't hate the form they won't hate authority, you know, Anyways, so, so think about that because I know there's so many neo spiritualists today that are exactly that. And that's the problem with the Gnostics. The Gnostics, that's one of the problems with the Gnostics is that they had a glimpse of this mystery that God is beyond all forms, but then they weren't able to come back down and see that the forms are also manifestations of the divine at the level at which they were, and not always just these evil corruptions of the divine principle. So it's a big deal. All right, so Chase and Lindsay asks. Hey Jonathan, in your recent video with Dr. Paula Boddington, the notion that there is a priestly cast bringing their idols into the world through machines was brought up. This is a pattern I felt for several years now. However, one thing I've always wondered and Kent pinned down is if these people are consciously aware that they are serving as priests for some kind of hidden deities. I find it hard to believe some of these techie people are consciously sacrificing to bring about long dead pagan gods to ruin our lives. Are there any stories in history or scripture about people who unintentionally serve as priests for foreign gods without realizing it? The closest story I can think of is King Solomon and the gods of his many wives. Yes. But it feels different than what's going on right now. Thank you for any insight. And so, yes, I think that your insight about King Solomon is actually a pretty good insight in the sense that, and the relationship not just to King Solomon, but the relationship in scripture between the idea of taking foreign wives and the danger of taking foreign wives and then serving foreign gods. There's, that's exactly what it is. It's that I think most people there are probably some that are more aware than we think, and we hope not. But I would say most people, they don't, they serve the God for the goods that they get, right? They're willing to serve the God to get the goods, right? So it's like they just see the goods, they just see the beautiful woman. They don't care about the God. And if they, they have to serve the God to get the beautiful woman, they're like, yeah, whatever, I just want the beautiful woman. And I think that that's what, that's what's going on in a lot of this. It's like they, they, they know that they can get massively rich and massively powerful by engaging in this behavior. And that's what's driving them? And they don't necessarily totally understand or realize that they're being duped as well, you know, so that's at least what I think. But, you know, who knows, who knows how explicit some of this stuff is in those spheres? So AJ Says, hey, Jonathan, I've heard you say a few times that we did not learn our lesson from World War II and that we're headed toward a not good place. My question is, can anything except a major catastrophe change our course? Because I want to believe that enough good art, enough powerful stories told from the right framework can make a difference, similar to how Jordan Peterson said the Gulag Archipelago helped bring down the Soviet Union. And so, look, A.J. i think you're right, and I think that that's what we have to do. But I think there's going to be suffering. Like, I can't see any other way. And even with, with Solzhenitsyn, like, I mean, that didn't come easy. That book didn't come easy to him. That book cost him a chunk of his life, you know, and a chunk of his youth and a chunk of his energy and, you know, a lot of suffering. So it's like, I agree, but, but I don't think, I think there's, there are going to be catastrophes, and so hopefully, hopefully there'll be enough good to at least have some, some arc there amidst that. All right, so Angel Terpstra says, hey, Jonathan, you've told that the pattern of reality is so overwhelming that only saints can access it. What struck me in this phrasing was the connection between insight on the spiritual pattern and spiritual practice. Can you elaborate on this? 20 what extent does spiritual practice support these insights? I'm asking this because, and probably more of your viewers engage with symbolism and the pattern of reality from a more didactical angle. Yes, most of my insights are derived from you. They are taught, although it affects my spiritual life, these insights are not derived from my spiritual life. How does spiritual practice are becoming more holy relate to insight on the pattern? What is your personal practical experience? And so I think your question is very good because the idea of spiritual practice is participation. And so, like, I talk about participation, but there's a difference between talking about participation and actually engaging in participation. And so spiritual practice, whether it's being part of a communion of saints, whether it's, you know, attending services and, and then also the more personal spiritual practices like fasting, like praying, like the Jesus prayer, you know, as you saw in the, in the video, and, and attention to your sins, attention to God. All of these spiritual practices, what they'll do is that they'll, they'll make the pattern part of you. Like you in the sense that you will be experiencing it and you will be transforming, you'll be transformed so that then that will become the soup, like the thing you're in. It'll become like the world that you actually live in and not just something you think about. And so the idea, like, you know, the idea that the saints see the world transfigured, you know, that they look at the world. If you read Saint Maximus talks about reaching a spiritual state where when you see, when you're experiencing reality, you always can see the will of God hidden in things. Like, you can always see the spiritual, the logi, the spiritual realities or the spiritual reasons for things as you are engaging with them. And you also see that they're not in contradiction. But not just see, but it's like experience it. So, so, so, yeah, so that's the difference. And I think that it's probably, I hope that it's helpful to know it in terms of your mind so that you think it's important enough to then engage in the spiritual practices that will bring you to live it, that will bring you to actually experience it. And, and it have it be more than just theory. All right, so Kevin Patterson says. Sorry, I'm just looking at how many questions are left here. What time is it? 10:30. All right, so. So Kim Patterson says to guard against evil looks, some people wear evil eye talisman to guard into adultery. People wear wedding bands. Yes. Reminder to self signal to others. What talisman can an unmarried person use to guard against promiscuous activity? Both succumbing to it, warding off advances? I imagine such a talisman would also help a person lower their paranoid suspicion of predatory behaviors in others. Well, wear a cross, dude. That's. That, that's probably what you should just do, just wear a cross. So take it seriously. Like if you wear a cross and you, you, you're in a situation where you, you are going to take your clothes off, but then you, you have to take your cross off or you see it and it's there dangling in front of you. Like, hopefully if you've taken that cross seriously, it'll be a reminder of where not to go. So that's what I would say to do. So Ryan Pinkham says, does the Hail Mary have the same sort of structure as the Jesus prayer? And so I would say, no, it's not the same structure, but I would have to. I should probably make a video about that. I don't. I actually wouldn't want to go into that right now. It would be something that I would. I would like to think about more profoundly and then talk about, Talk about the words of the angel. It's like, well, first of all, you can see the difference. Like, Hail Mary is coming from above and is talking about that which is below. Right. Because Hail Mary is. Is spoken by the angel Gabriel. And so whereas the Jesus prayers is talked about from below, moving to above. If you understand that the Jesus prayer is patterned on the publican prayer, that it's like, you know, God have mercy on me, a sinner, then it's. It's like above looking below. Whereas the Hail Mary is, strangely enough, like, from the angel looking down upon the. The mystery of. Of the. Of the space of revelation. You could say. All right, so Jason Gadawaltz asked, could you talk about discernment in relation to other virtues? Also, please make a video on numbers. You talk about discernment in relation to other virtues. I mean, I can talk about discernment in the sense that discernment is the capacity to identify things properly. And that's obviously very important to identify the origin of things, you know, to know what they are truly. And so I think that that's really important in terms of when you meet people and also when you encounter certain experiences, when you have feelings, to be able to name them properly. So you can think something like discernment is something like the capacity to properly name things. And so definitely there's a difference between discernment and other values because discernment is directly related to knowledge and to intelligence. So it's a little different. All right, so Charlie Longoria says, what are your thoughts on the Bible project? I've been finding this channel extremely helpful in reading the scripture again after many years, especially the Old Testament. Yeah, I like a lot of the stuff they're doing. I. I actually tried to have the main guy on my channel. I wrote them and asked them if you'd be willing to. To talk to me, but they said he wasn't taking interviews, so I guess that's not going to happen. But I think they're interesting. The most interesting thing about them is, is that. Is that I. I feel like this is this. I'm. Oh, I. I hate when I always have to. Not when I always have to criticize prostitism, but one of the greatest. One of the greatest, really fascinating thing that's happening right now. And I'm excited about it, I'm really positive about it is how several Protestants, whether it be the Bible project, whether it be you know, what's his name, the the through new eyes, James Jordan and the, the, you know, or there are several people that are seriously kind of seeing the patterns and are now noticing the patterns of scripture. And I feel like they, the Bible project is part of that. But there's the thing that I think they're missing is that they somehow don't see how it's the pattern of everything. Like they, they, they really, they see the pattern in scripture and they, they do want it, they do want to get let's say some morals, some morality to it. But it feels like they don't see how, how like I said, like it's the pattern of everything. And so how it, it then how you can use example like I, I rarely hear these people give examples in common day, common experience of what the Bible is doing. And so that's where I feel like, like they're missing something. But maybe, like maybe I'm wrong. Like I don't, I also don't want to be. But I would love to talk to these people and, and see what they think of that. So King of Rat Kings, is it wise to say that story is akin to mathematics in as much as 2 +2 equals 4 is both true and real despite the fact that numerical qualities only manifest as a secondary property attached to a primary phenomenon available to the senses. And so I mean I would say yes, it's related to mathematics in the sense that stories are related to, related to proportion and they're related to patterns. And so it's like just like mathematics is, is a display of a pure display of patterns, you know, in that same way then stories are more let's say embodied display of patterns. So. All right. Don Palermo says my community is riddled with a tendency in reactual in reaction to the idle machine of self help culture expressed inorganic food movement to instead celebrate being seriously indiscriminate about what we put into the body. Yeah. Zero Discrimination is supposedly the evidence of true liberation and faith. Well that's odd. I see truth in this tendency and something deeply bothers me. I consider the purpose of sustaining the body to host heaven and also the meaning to die purposefully. Maybe the blurring of the lines of the category for what is food? Is a uniquely modern issue. Is it relevant to my question, which I failed to clarify succinctly that the desert fathers went without but did not do the opposite to put anything in? Yes, Exactly. So I would say that there's a difference between fasting and eating anything. Like, you know, there's something, the idea that, because it's not important, like, because in the sense that, because, because it's more important to, to focus on spiritual things and, and, and, and all that, the idea that then you could just eat anything is absolutely stupid. Like, it's stupid because, because eating is a passion. Like eating is not just a fuel, right? And so it's like you have desires to eat things. And so, so the idea that you could just eat anything is also showing you that you just give in to your desires. Like, discipline in eating is actually a, is actually a kind of pointing to spiritual discipline. Like, that's why there's fasting in the church. And so, and so the idea of not eating certain things and not eating all the time or not eating certain quantities is actually very important in order to tame your passions and to tame your body so that you are, you're able to not be focused on it. So someone who says, somebody who says something like, you know, it's only God is important, doesn't matter what you eat and so he eats anything, you might realize that that person is more of a slave of what it is they're eating that they would wish to admit to themselves. So, so, yeah. All right, so Agar's mom, it says. Hi, Jonathan. How would you describe the difference between improvement of one's psychological well being versus deification of that person? Are they similar processes? Are they completely different? Do they have the same goals? Thanks. They don't, they don't have the same goals. It's like one of the problems of the idea of, of psychological well being, the way we understand it today is that it's, it's, it's, it's a, it actually sometimes is not helpful because we have this idea that, for example, I've talked about self esteem before. The problem of self esteem and the problem of, of seeing people as like little gods and thinking that you somehow have to attain a kind of happy state. Right. It's like you read the church fathers and they will tell you that it's like this happy state that we kind of look for. And you know, I mean, I'm guilty of that all the time. I'm not, I'm not trying to, I don't want to judge anybody. But that happy state that we're, that we're going for, that, that doesn't lead to holiness at all. And you know, the state of a saint is something more like a Kind of ecstatic pain. Not, I can't, I couldn't say, I didn't say it that way. It's more like something like a kind of living in a kind of sorrow for your sins which is also filled with, with a kind of joy of being connected to God. And so it's actually quite self deprecatory like it's actually quite seeing yourself as nothing really and then being connected to God. But then the thing about that is that what happens to people who really see themselves as nothing isn't low self esteem. It's actually a healthier kind of, it's actually, actually will end up manifesting itself as a kind of full use of your capacities and a, and a, and a true use of your capacities and not a delusion, you know, and not the disappointment of, of not accomplishing things because you think you're better than what you are. Like that kind of, that kind of problem of the, of the kind of psychological well being thing. So yeah, and I say that but I'm like, I'm all, I'm all in that world. Like I'm not a, I'm not a ascetic. You know, I, I tried to have comfortable lifestyle and I, and you know, and so it's like I, I want to be careful but I, it's not the same as deification, that's for sure. The road of deification is a, is a, is a harsher one. All right, so what Jacobus Rudania says, what is the symbolism of volcanoes? Could they be pointless mountains representing pride, eg, pride taken over Pompeii or topless hierarchies erupting open doors to deadly chaos? It's be interesting. I really haven't thought about volcanoes so much. They definitely have something to do with, with like you know, the lower fires like erupting, you know, and causing chaos into the world. And so maybe you could understand something like volcanoes, something like a revolution. Maybe that'd be a good way to understand it. And that's why it also appears as like a mountain but then this mountain like spews out this, like this lower fire. I don't know, I haven't thought about it. I just should think about it more before I speak. All right, so Eric Fisher asked. Hi Jonathan. Sorry, this is question is a bit risque for YouTube. I'm curious about your thoughts on the symbolism of the relationship between Christianity and Islam. I was very interested to read in Dominion about how the Muslims consider themselves the descendant of Ishmael and also how Tom described Islam as a kind of wedge that was driven between east and West. Christendom. Yeah. Contributing to the schism. What do you think? Is there some hostile brothers things going on there? Well, let's just say this. Like the early Christians, the early. The Christians that were there in their beginning of Islam saw Islam as a. As a Christian heresy. That's how St. John, the Damascene, St. John of Damascus saw Islam. And in terms of history, that is absolutely true. Our knowledge of history and our understanding of history is in terms of Islam is so twisted by the Enlightenment. It is so twisted by the Enlightenment because the Enlightenment tried to use the Crusades as a bludgeon to smash over the head of Christianity. And so in doing that, and also because there's. Also because after the split between east and west, the west wanted to portray itself as kind of this all powerful thing, especially in the Enlightenment too. The Enlightenment wanted to erase Constantinople, just erase its memory as if it never existed. Because it's embarrassing to think about Constantinople, which, when your purpose is to bash, you know, how dark the ages were before you, because then what do you do with Constantinople, which was this glorious city, you know, until, Until. Until things started to fall apart when the, the, the. When the Islamic invasion started to happen. And so, yeah, it's like the, the, the. If you think about it just practically, like the. Islam basically surrounded Christianity and then made it difficult for everything to happen, like for communication to happen, for trade to happen between the different aspects of the Christian world. And so it's like, yeah, that's one of the things that happened. All right, so Benjamin Kincaid says, I recently listened to your conversation with Dr. Paula Boddington on the ethics and narratives surrounding AI. I'm wondering if you have any advice for those currently working in tech. What can we do to help steer things in a direction that's good? Pray, like, pray a lot. Oh, man. That's like. I feel like just some pastor that's giving generic advice. But I would say that to be. I would say that if. To be attentive, to be attentive to your actions, to your intentions, to be attentive to the reason why you're doing things and, and to pray. And so because it's. It's. It's not going to be easy, it's gonna. It's gonna get. All of this is gonna get worse. It's gonna get very difficult. So. So, yeah, I don't know, man. I mean, I don't think tech is bad. Like, I, I think tech is good. I think ultimately it can Be. It can serve the good. But I think that it's definitely not looking. It's not looking bright at least. But look, I mean, here you guys are listening to what I'm saying because of tech. So it's like, I don't want to be the guy knocking tech because. Because obviously it, it has increased power. It has increased the power of reach that anybody can have. And so it has, definitely has, definitely has value. But, but for sure, AI is, yeah. Scary. So, yeah. But the one thing I do, I wanted to say, because I kind of went, the question about Islam, it doesn't change that there are some, like in, within, let's say, Islamic art, there are some amazing things that were done and that if I read some, I read. I've read some Islamic writers that have a very powerful understanding of reality, you know, and so I always kind of talk about how. I think that. I think that as, as Christians, it's good to be capable of seeing the sparks of light which are in the surroundings. And, but just be careful to not, let's say, to not make them your own in the sense that you're able to notice the places where there's light, you know, in, in other cultures and other religions, in other. In ancient myths and in weird, weird, weird places. And so, but it's also, but it's also about being able to kind of see that without, you know, without then throwing up your own world into the air and saying, okay, well, it's all the same. Then let's all just do whatever and, and let's just all be universalist because that leads to nothing. Like it leads to. To. Leads to porridge. And so, so, yeah, so maybe that's the last thing I could say about that. All right, guys. And so, yeah, those were all the questions. And it's 10 to 11, but I will go into the super chats and let's see, I never have them ready because. All right, so I'm not following the chat for some reason. It wasn't good. All right, so here we go. All right, so Louis Dura for $5 US asks what does the burning bush of Exodus symbolize? And so that. That's a, That's a complicated question, but you could. An easy way to understand it is that God manifesting himself in the world while letting the multiplicity of the world continue to exist. Right. So that's the best way to understand it. It's like the mystery of how God can manifest himself without destroying the particularities. Right. With that, unity can manifest itself without destroying particularities that's, that's what the burning bush is about. And, you know, and it reach its culmination in the perpetual virginity of the virgin, which remains completely untouched and is not never taken up, but nonetheless becomes the place and the body for the divine logos. All right, so the golden threads for $20 says, please shill more for your Odyssey. I believe it'll be a great space. You can sync it to auto upload YouTube videos. And it has a better UI than Bitchute and is not as vulnerable. I'd also use your name for the channel. Easier to find, I think. I do have an Odyssey channel, don't I? I've told you guys that I'm working with a company called Content Safe, and they're the ones who are running my website. It's the same people. His name is Matthew Ramer, and they've been kind of putting my content up on Bitchute and on different platforms. So, I mean, I thought I had an Odyssey channel. Maybe. I don't. I don't know. I'll check it out. All right, so Ray Fleming, for five pounds says, how do you find the correct balance between telling the truth and the virtue of not exposing everything a la Noah getting drunk? And so it's, it's pretty simple. It's not that simple. It's. It's hard in the immediate moment is that truth also has to do with the reason why you say something. And so if you can examine the reason why you would say something, that is also part of whether or not something should be said. So it's not only about being factually accurate, it's about why would you say that in the, in the, in the first place, right? Because there are plenty of facts that you don't say that are real. Like, you know, all the random things that are happening around you, right? You don't go up to someone and tell them, like, tell them that, oh, there's a fly, you know, on the counter. Like, you don't say that. And so the answer is, why would you say something? And that's how you are able to, to find the, the, the, the balance. And so sometimes there are moments where if you don't say a certain fact, you are, you, you are acting immorally because that fact has a, as it has a danger to it or has a scandal to it or has something that has to be revealed, right? And so if you see, I don't know, you're walking down the street and you see someone like, robbing, you know, I don't know, pickpocketing, someone and then you don't say anything because you don't want to get involved. Then not revealing that fact is like a lie, right? It's not telling the truth there it becomes like a lie. But so it's always, it's all about the reason why you say something or not say something. Like if you don't say something just because you want to get out of trouble, right? But you can also not say something because you don't want to get someone else into trouble. And that, like, you can cover someone sometimes if you do it out of love and you do it, you know, in a good way. So that, so it just really depends on the reason. So. Jamie Cummings for 999us says. Hi, Jonathan, any thoughts you'd like to share on Hegel? I have to tell you that certainly after two hours of speaking, I'm not going to talk about Hegel. Sorry, Jamie. So Francisco Caldes for 2 Euro says, why God orders a man to be killed for working on a Saturday. All right, this brings in a harder discussion, which is that one of the problems with people reading the Old Testament is that they get hung up on the. On how many times God says to kill someone for breaking a, breaking a law. And by doing that, you are, you, you actually obscure at some point, you don't, you're not able to see what's being said. Like what it is it. What is it that is, is being talked about. So a better way to approach it is to understand, just to say, why is it forbidden to work on a Saturday? And why is it important? Because if you just say, why to be killed? It's like in the Old Testament. The problem when people think about these tribes in the deserts is that they don't understand what it meant. Like, there's no prisons. When you live in a desert tribe, there's nothing to do with people that break the rules. You can punish them to a certain extent, right? You can make them, you can try to make them have reparations, but at some point it's like there's nothing to do. You can't put people in jail and keep them there if they do things. And so it's like this. The idea of not working on the Sabbath is about preserving the cycle. It's about preserving the normal running of things. And so you have to leave the residue, you have to leave the remainder and not touch it, right? And that's super important because if you touch the remainder, if you try to integrate the remainder, you're actually bringing about the end of your world. You're actually accelerating a process which will lead to the destruction of your. Of your identity. Right? And so. So you have to leave it. All right, so Joshua Anderson for 499 says, do you think it's possible that Eve was tempted by the serpent in the garden in Genesis on a sexual level? And so I don't think so. I. I think that that's really. Okay. So the problem with this. The. The problem with this is that it's also because. It's like. It's also because people don't. Don't understand all the symbolism of what. Of what the sexuality is. And so, so if you want to understand it this way, you could. You could say that Eve does join herself to the serpent in the sense that the serpent tells her something, and then she believes him and acts in coordination with the belief in the word of the serpent. And so the serpent is. So she believes the serpent rather than believe God, and so she joins herself with the serpent and then becomes a body for his will, for his being. Right? And so in that sense, you could say that she joined herself with the serpent, but you definitely do not have to think of it in terms of a physical union between the beast or something that is, like, explicit in the way that people want to think about that. But you could understand it analogically as the fact that Eve does join herself with the serpent. And so. So, so, so there is a. There is a. How can I say this? There is something analogous to sexual symbolism in what's going on, but it's not directly right. Just in the same way, when I. When. If you read the story of Christ and the Samaritan, there's sexual symbolism going on during the whole discussion between Christ and the Samaritan, where he talks about the fountain of pure water and the well, which is referencing Proverbs, where it talks about joining yourself with the foreign woman, which is what he's doing in that story. But it doesn't mean that he had sex with her. It doesn't have to mean that. Right. It just means that this symbolism, because it's fractal and it works at different levels, that it scales at different levels. It doesn't have to become, you know, just like the fact that we are the bride of Christ doesn't mean that Jesus has sex with us in, like, a physical sense. Why am I saying this? Like, why do I have to say this? I don't have to say this. All right? But I'm saying it anyways. All right, so Ulysses k. Hughes, for 5, sorry, guys, man alive for 5 says, is the Holy Spirit the feminine aspect of the Holy Trinity? If not, what is the feminine aspect of. Of God? And so, no, the Holy Spirit is not the feminine aspect of the Holy Trinity. And so the feminine aspect of God. So that's what theosis is about, guys. Theosis is about that. It's about. It's about that. I don't know what to say. All right, so the golden thread says USD for USD 5. Given your fluency in multiple languages, that the cosmos manifests itself differently to you according to which logos you're thinking, speaking in? I mean, I don't know that many languages. I know two and a half, I would say. And so there definitely is a difference, right, in terms of the manifestation. It's actually helpful to know several languages because it helps you to see how the meanings of things, they kind of point up also above the language. And so it can help you see how the way meaning embodies itself definitely affects how you relate to the world, but it also can help you see that they point above, they point beyond themselves, you know. All right, so Luca Irimadza for $5 Canadian says our EDM raves like the anti church. The structure seems similar with the DJ is the priest, the stage is the altar, and the altar boys are the tech. I mean, yeah, for sure. I mean, in the sense that, that so many of the modern, so many of the contemporary kind of these types of events are like, let's say, parodies of religion, you know, and so a rave is one example, but there are others, you know, Burning man and all that kind of stuff are all these kind of parodies of religion. So V2 Zooey for CF CHF5. I don't know what that is a question, just by curiosity, why did you choose Orthodoxy rather than Catholicism would convince you of Orthodoxy rather than Catholicism. So I mean, there's several aspects. One is obviously theosis first. Then there is the iconography, which was still alive. And so as an artist, I was so excited by the fact that I could participate in the traditional language of visual language of the church in terms of architecture and art. And the iconography, which was still kind of the sacred language which was alive. And so I would say that. And then I would just say the theology that I read, you know, it's like I just read Vladimir Lasky and was just completely astounded by, by him and, you know, the hesychasm, the Jesus prayer, and, you know, the, the reliance on St. Gregory of Nyssa and St. Maximus the Confessor and all these saints that I really love rather than saints that. I mean, I appreciate some of the Western thinkers like Augustine. I have appreciation for Augustine, but I, I mean, I think St. Gregor of Nyssa is superior to Augustine in terms of what he brings again, you know, so. Yeah, so Griswold grim. Griswold Grim. I know who you are, my friend. So he says, paintball for Jesus. For or against? I don't even know what that means. Like, I don't even know what that means. All right, so David Franco Jr. For 4.99 US says, are you still taking questions? And so I guess I am not anymore. Like, I'm stopped now. So no more questions and get through these and then we're done. So, BRANDON Samuel for $5 thoughts on Joseph Campbell. His massive God series is less in credit than his other work, which makes me think he is not as New Agey as rumored. I mean, I don't know about Joseph Campbell. I would say Joseph Campbell is one of the things that I read from in college, like when I was reading Postmodern Theory, someone gave me a copy of his interview with Bill Moyers and, and it had an effect on me. I have to say. It had an effect on me. It was probably part of my kind of moving towards pattern and moving towards. So, I mean, he's not completely useless, but I would say that he's like a secondary thinker, you know, kind of. So I haven't, I, I haven't read that much from him anyways. But I always tell people, look, to be honest, like, get your insight where you can get it. And, and so true insight is true insight. Someone sees a pattern in the story that is useful if I don't care where it comes from. If it's like some of the patterns that Jacques de noticed in, in the text in terms of the margin was right on, like smack on. He, he. He could see the pattern. I don't agree with his conclusion about what it means that he perceived this. And I think it's the same for people like Joseph Campbell or, or other like kind of psychoanalysis who tried to do interpretations of fairy tales and that kind of stuff. I think you can find some insight, like I said, where wherever it is, you can find it. The idea is just about hierarchy. It's just about knowing what you're attached to and where your main lights come from and then secondary lights. It's okay. All right, so Kana H Asks a few months into learning from you, and I'm wondering How we can test proof, theories on symbolism versus just seeing a pattern and hoping we're right. Well, the way that you test a pattern is if you, you should watch with the video I did with my brother, because Matthew and I did a discussion about this. And the way that you test it is that it has to. First of all, it has to scale. And so the pattern has to scale at different levels of reality. It has to be found in other stories and in other places. And so if you just find a pattern in one story and then you can't think of other stories that have the same pattern, then you're, you're, you're, you're in the wrong. You're going the wrong way. Like, you're in the wrong. You're following the wrong thread, okay? And so that's the way you do it. And so that's why if you listen to my. Watch my video, you'll see I'm always skipping. And so, like, even if I'm in a conversation with someone, someone will say something, then I'll think of a pattern, and then I'll be like, oh, yeah, and there's that, and there's that, and there's that. And so I'm skipping between different levels of reality. So if you listen to my videos, watch my videos, you'll see I often have, like, a biblical example. I'll try to find some example from another story, like a fairy tale or a myth, and then some example from popular culture or from, like, everyday life. And so trying to kind of move across these different levels is the best way to test whether or not the pattern you're seeing is, is an actual pattern or just some fantasy you have. So Chandler Turner for 5 USD says, I've been reading of Ibn Arabi's work as he referred to the same God as Christianity. And can I use his prayers? Well, look, Chandler, I have a lot of respect for Ibn Arabi's writings. And, you know, I think that he's probably within Islam. He is probably the person that has the closest vision of Christ and of God as we find within Christianity. But having said that, I would not recommend that you use his prayers if you are a Christian, because why would you, like, why there are. We have Christian prayers. Why would you use his prayers? And so it's a dangerous thing to kind of. To skip around. You know, it's not a. It doesn't. It can lead us astray. All right, so Gustavo Luiz, I guess for $20, I guess from Brazil. Hugs from Brazil. Try to know the work of Italo Marsili. His work here in Brazil is revolutionizing Christianity. Jordan Peterson was for the English world. He is for the Latin world. I will check them out. I've never heard of him. All right, so my brother and I are on good terms. He's struggling with being happy in life. I'm figuring out how to, but I don't know how to communicate how I'm doing it. And word, he'd Bach at straightforward advice. Any insights? Thanks. That is so natural phenomenon. That question is extremely vague. And I, I'm sorry, I don't know how to answer that because I don't know, like, I don't know enough about your brother, and I don't know enough about. I don't know, like, I, I, I. Obviously, if you don't have authority in someone's life, it's probably a good idea not to give people advice. That is, that is for sure, because it rarely will be taken. Well, you know, give advice to people who trust you and, and who see you as having authority. That's the best way to give advice. If not, then become that person. Right? Become that person that your brother sees as someone to look up to or to have, has authority. And therefore, you'll avoid that, that problem. So it's an easy. I'm giving you an easy answer, but obviously I know these personal things are difficult to deal with. All right, so bastion for 699canadian is the symbol of the eye looking at the viewer, often in clusters, as a symbol, a symbol of an oppressive force. An example of rejecting God by those authors looking at the viewer often. So I'm not sure I understand that question. Brassian symbol of the eye looking at the viewer, often in clusters. That's a symbol of an oppressive force. I'm sorry, Brass. And I don't totally understand your question, so I can't answer it. All right, so Brandon Samuel Fre says also Joseph Campbell said the story of the Grail knight is the basis of Western individualism. Thoughts? Yeah, I don't think that's, I don't like that. I don't like that very much at all. I think that the, so there's a difference between. So I understand why he would say that. He says that because the, the people, because the, the knights who seek the Grail, they, they all go in their different directions. So it's, it's like they, they kind of see the Grail where they see it. So the Grail actually manifests. Would manifest itself to them. Right. Kind of where they are. And so I understand what, what, what he's trying to refer to. But I would say that it's more a way of understanding that, say, the glory of God or the presence of God descends into the particular and that it can manifest itself in all places. It's hidden in the world. The sparks of God are hidden in reality and can be encountered where you can encounter them. It can be encountered in the places where you're capable of encountering them. But that Grail is nonetheless a chalice of communion. And so finding the Grail should bring you in communion with the others and should become kind of bridge towards other people and a kind of bridge towards a place where you come together. And so, and so I don't agree, I don't agree that the Grail is the beginning of Western individualism. All right, so Exodus for $5, US ask which books would you recommend for a 10 year old? Which books would you recommend for a 10 Year Old? I mean, I would say Narnia. And so obviously that's an easy one. But there are other good stories, like 19th century stories. There's some good stories, like, I think that the Jungle Book is nonetheless good. And, you know, fairy tales at 10 years old, you can still have kind of more complex versions of fairy tales. Yeah, that's what I would say. So symbolic memes says, hello, Jonathan, can we go to sleep now? You are allowed to go to sleep, symbolic memes, as long as you promise to continue making funny memes on symbolism. All right. Should probably stop. People keep putting in some, some super chats. All right. Mike Zasek says, do good stories intentionally embrace archetype and patterns of reality as they're being written or they're more subconsciously incorporated. I would say, I would say that they, I would say to be careful, to be explicit. I always tell people, like, study symbolism. And then if you're writing a story, don't think about symbolism when you're writing it. You have to, it has to kind of come out and then you can edit it later and you can look at it, what you wrote later and then see what, whether or not you can tweak a few things. But if you try to think about archetypes and symbolism when you're writing a story, you're not going to succeed. It's going to come out horrible. All right. Okay, so I am going to go, guys. So thanks for everybody popping in. We are at 2 hours and 15 minutes. For some reason, I'm getting more stamina as I'm doing these videos. And so. All right, so thanks Everybody, for your. So Mike Zazik says, oh my gosh, you are like the first human being that's ever gotten my last name right on the first try. Interesting. All right, so good night everybody. It was a lot of fun. And so, yeah, so check out the podcast with Jordan Tomorrow on YouTube. So share it. Comment. We need positive comments in there because there's bound to be. There's going to be some negative comments in there. So it was good to talk to everybody. Thanks all the moderators to Brad and I think, yeah, Lisa's there. She's still awake at this late time for her. And so I appreciate everybody. Sorry to other people whose questions I was struggling to answer and sign up to the website like I said, so we can avoid censorship. And so I will talk to everybody very soon. All right, let me need to get on here to stop it. So. All right, bye everybody. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially. Go going to www.thesymbolicworld.com support or else on Patreon Pageau Videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
