{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":12.56,"end":14,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":14.4,"end":16,"speaker":"Stephen Woodford","text":"Welcome to the symbolic world."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":26.09,"end":108.38,"speaker":"Jonathan Pageau","text":"Hello, everybody. I'm here with Stephen, who is better known as Rationality Rules. Rationality Rules is a very successful YouTube channel that takes on questions of debunking different spurious arguments about the existence of God and other philosophical questions taken from the point of view of rationality and also scientific method and all those kinds of approaches. Until recently, I felt like I'd seen some of Stephen's videos and I felt like if we had had a conversation, we'd just be talking past each other. And so recently I saw him take up the question of Bret Weinstein's idea of metaphorical truth, and I heard him speaking about it in somewhat positive terms, at least in somewhat positive terms. And so I thought this could be an interesting place for us to connect and at least have a little bit of common ground out of which we can build an honest and an honest discussion about how far this can go, what are the limits of it, and what it means for our different positions. So. So, Stephen, thanks for coming along. I really appreciate yesterday. I just want to tell everybody, yesterday we had this discussion and then we had some technical difficulties at the beginning, and then after that I forgot to record it. And so I'm still annoyed about that. But hopefully there'll be enough of the kind of raw intensity of our discussion yesterday left over today. Not too much. We didn't have a fight or anything, but we went into it."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":109.42,"end":113.42,"speaker":"Stephen Woodford","text":"Metaphorical fight, right? Exactly."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":114,"end":125.84,"speaker":"Jonathan Pageau","text":"All right, Steven, so maybe you can tell us a little bit about how you see Bret Weinstein's position in terms of metaphorical truth and then we can just go on from there. I don't think we'll have a problem having a conversation."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":126.08,"end":161.9,"speaker":"Stephen Woodford","text":"Yeah, sure thing. As you said, we're going to be traversing some of the same ground as we did yesterday, and because of that fact, we're going to be able to do it in a more precise manner. I think it was really fruitful. And to everybody listening, I assume you are as well. But I'm really interested to hear what your views are, and if you want us to have subsequent conversations, let us know. Just before I do tap into the metaphorical truth aspect, I just want to say thanks for giving me your time today, Jonathan. I appreciate it. I've watched your work for quite some time, and while I disagree with you here and there, I think that you're a force for good and I'm really appreciative of the work that you do. And you're also a fantastic artist. So yeah, thank you very much."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":162.06,"end":162.86,"speaker":"Jonathan Pageau","text":"I appreciate that."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":162.86,"end":330.24,"speaker":"Stephen Woodford","text":"Thanks. Okay, so let's talk metaphorical truth. And it relates, of course, in the context to Jordan Peterson's perspective on religion and Carl Jung's archetypes, motifs, etc. And also let's. What that's all predicated on is evolutionary psychology and the fact that we've evolved to survive, not necessarily to know the truth. In fact, it's not even. Just not necessary. It is. We haven't evolved to know the truth. We've known. We've evolved to survive. Right. So metaphorical truth, as Brett Weinstein was explaining it. And I should just, you know, say that I don't want to put words in his mouth, but I do think I understand it to at least a degree. So, you know, don't interpret me as being, you know, Brett. That's just for anyone listening. So when it comes to metaphorical truth, it's something that is literally false. But if you act as if it is true, you get the net result of what you're actually looking for. And one of the examples I gave in the video that you probably watched was to do with the bubonic plague, the black plague, and how it vitiated through the communities and destroyed lots of people's. And they were desperately trying to figure out why is it spreading, how is it spreading? And they came up with the miasma theory of disease, which is the thing that has, you know, permeated since I think. I think it's Roman times. It goes back quite a long time. And it's the idea that there's bad air. If you go out into the bad air, you're going to get this bubonic plague, you're going to get these diseases and you're going to suffer. Well, that's just not true. That's literally false. It's a scientific error. It's objectively false. However, if you act as if that's true, you actually get the result that you're looking for, and that is that you don't contract the bubonic plague. So it's metaphysically true. It's true if you act it out, as perhaps Jordan Peterson might say. And I think this is a wonderfully valuable insight from Brett, and it is the baby in the bathwater, which I do agree that people, if we're not careful, will discard from religion, because religion tends to capture these metaphorical truths in. In really precise ways. Sometimes I'm convinced, sometimes they don't, but. Or sometimes they make mistakes. But in general, they tend to get them Correct. So be it Christianity or Islam or Hinduism or even astrology or something we spoke about yesterday, and it will come up again today. Communism and, you know, the, the, the, the Soviet Union, I think in their ideologies or in their religions or whatever it might be, some of the patterns of some of the metaphorical truths that manifest then obviously not arbitrary. They're here for evolutionary advantages. I could go on, but I'll send it back to you for now."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":331.12,"end":476.04,"speaker":"Jonathan Pageau","text":"So I think that I'm really happy to hear the way you're describing it as well, because this is, I would say that my hiccup with Brett in terms of understanding the way he talked about metaphorical truth is I feel like if you describe religion that way, you will be able to capture a few things and you'll look at religion and you'll be able to see that this here works. Like, if you apply. This here doesn't work. But the difficulty is in that you'll still have a bunch of nonsense and things that you don't understand why it's there. Like, why does it say this? Why does it say that? And I feel like this points to a certain extent to the limit of the theory, because one of the aspects of the metaphorical truth theory is that it helps reconcile, let's say, religion with science. But even if you see religion as something to look at and to study, if you have a theory which, when you use it, gives you a few examples of connect in a few ways to what you're studying, but then most of the time doesn't fit and the rest looks like nonsense, at some point you have to reevaluate the theory. That is, if you just say this whole social phenomena that has lasted for thousands and thousands of years is mostly nonsense. And once in a while, among these things, there are some things that connect. What I like to do is to rather, like I said, use this idea of metaphorical truth as a ground to kind of maybe build more and try to understand a little more what the religious patterns are about. And you actually said it in the discussion, like just now, you said it. So I'm going to grab onto that. It's rather than describing specific actions you take in the world, they're rather describing patterns of being. They're rather describing the way in which identities, categories, participation functions. And in terms of the idea of the plague doctor, it's an okay representation. It's not actually a religious one, because in Scripture they're not. They're not describing scientific realities, they're describing ways of acting and so it's not as if they're trying to. So even Brett Weinstein's example of."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":477.96,"end":478.24,"speaker":"Stephen Woodford","text":"The."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":478.24,"end":491.92,"speaker":"Jonathan Pageau","text":"Porcupine, you won't find something in scripture which is akin to that type of description in scripture. There's no place in scripture where it says, this is a description of the mechanical causation of something."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":492.16,"end":528.51,"speaker":"Stephen Woodford","text":"So you say, well, sorry to interrupt, but I would disagree with that. But we can go into that in just a sec. Well, you know, like you can you. It depends on the way in which you read it. So you could read it where it says, and you've spoken about this before, do not mix linen and wool. Well, that could be said, as you know, do not mess with a porcupine because it will throw its quills. Both of those are not true. And both of those are relating to something more deep, something that relates to our evolutionary psychology, something that's very, very deep indeed. So deep, in fact, that we may not even understand why it has manifested itself that way. Right. So how are they different?"}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":528.83,"end":558.12,"speaker":"Jonathan Pageau","text":"Well, they're different because if you say, don't touch a porcupine or don't approach a porcupine because it throws its quills, so you could, you could say the description that a porcupine throws his quills is not. It's just not. Doesn't happen. Porcupines don't throw their quills. If I say something like, don't mix linen and wool together. I'm not telling you. I'm not telling you what. Why? I'm not telling you what it's going to do. I'm just saying it'll make you impure. Something like that."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":558.12,"end":565.6,"speaker":"Stephen Woodford","text":"It'll partially. Sorry. Right. If it's, if it's an edict, if it's a rule or a regulation saying."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":565.6,"end":577.65,"speaker":"Jonathan Pageau","text":"Don'T mix linen and wool together, don't plow a field with an ass and an ox. Don't. Don't boil a baby in a goat in a mother's milk. It's not saying. It's not giving you a description of reality."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":577.65,"end":587.41,"speaker":"Stephen Woodford","text":"It's saying it's giving you a prescription. Right. Don't act this way. And also. So it's still also a prescription to say, don't go near the porcupine."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":588.13,"end":607.1,"speaker":"Jonathan Pageau","text":"Yeah, it's closer to that. Like if you say, don't go near a porcupine, then that's not a description of reality. It's a prescription of on how to act. So what I mean is that the metaphorical truth aspect is it's problematic because you say it's literally False. Like what is literally false? If I tell you, don't mix linen and wool together."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":608.54,"end":625.38,"speaker":"Stephen Woodford","text":"Well, as you said, that one is just a pure prescription. So in that case, it wouldn't work. But you could have a rule that says, don't go out and associate with, you know, people in the city. Why? You know, because you'll catch bubonic plague because of the air or whatever. There's elements of it that's not true, but there's elements of it that is true."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":625.38,"end":663.13,"speaker":"Jonathan Pageau","text":"Yeah, you won't find a lot of those in religious. In religious prescriptions, the consequence will usually be a kind of a general consequence. It'll be something like. Okay, a good example is something like a very strange one, actually, that's maybe difficult for people to understand is that in scripture there's an idea that you should be careful not to count people not to have. What's the. Sorry. When my English brain. My English brain stops is to be careful not to have. What are they called when you count the people in a country?"}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":665.53,"end":666.85,"speaker":"Stephen Woodford","text":"A consensus. Yes."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":666.85,"end":667.93,"speaker":"Jonathan Pageau","text":"Not to have a census."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":667.93,"end":668.33,"speaker":"Stephen Woodford","text":"Right."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":668.41,"end":674.01,"speaker":"Jonathan Pageau","text":"So there are places in scripture it says, do not have censuses. If you have a census."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":676.01,"end":676.45,"speaker":"Stephen Woodford","text":"It will."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":676.45,"end":679.33,"speaker":"Jonathan Pageau","text":"Bring about plague or bring about danger."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":679.33,"end":679.61,"speaker":"Stephen Woodford","text":"Right."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":679.85,"end":786.92,"speaker":"Jonathan Pageau","text":"And so it doesn't explain why. It doesn't tell you why. It doesn't even connect the two together. It's saying if you count things too much, if you try to account for everything, then something bad is going to happen to you. And so you can think like, that's completely insane. It's not the same type of causality as the. Don't approach a porcupine, that a porcupine throws its quilt. It's not telling you how the mechanical thing is going to work. It's just saying if you count people to try to account for everybody in your country, then that's going to cause danger. It's going to cause some kind of calamity to your country. And then you could ask yourself, why is that? Like, why would that happen? And I think it's interesting because I think that right now is probably one of the best times that you could understand that. Like, you could understand that if you try to create total systems of control, then it's always hiding a backlash or the destructive backlash in the. In the desire to create systems of total control. You always have to leave some messiness on the edges in a social structure or else there will be some danger that's going to come up. There will be some kind of calamity. If you try to account for everything, you will Create an invisible amount of. It could be as simple as you will create an invisible population which you think is not part of the system, but will have no stake in your system and then will want to undermine it, like something like that. And that could destroy your identity. But it doesn't tell you what's going to happen and how it's going to happen. It just says, don't do this. And then if you do, there'll be these kinds of consequences, very kind of general consequences."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":787.48,"end":829.15,"speaker":"Stephen Woodford","text":"No, I appreciate you can get you. There's like a nuance here with some that are describing things that are just not true. You know where biblical scholars at a time was, or at least some of them was describing the earth as flat and they were using biblical sources to do so. And they were literally false in what they were saying. But they may have had metaphor, metaphorically. They made it may have been metaphorically true in some of what they were saying because they were saying it for certain purposes. But you also have something that relates to prescriptions, to rules and regulations, and it doesn't, it doesn't nest in the same way. And I appreciate what you're saying there, but if you take that pattern of being that you were just referencing, where exactly would you ascertain that from? Christianity, Just so that we have done the table."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":829.87,"end":897.62,"speaker":"Jonathan Pageau","text":"And so, yeah, it's probably a good idea to tell you so. In scripture, if you think of the Bible, for example, there are many, like you said, many other religious texts actually have the same pattern. It's really a universal pattern. And so if you read the Genesis creation account, you notice it's built in a certain way, it's constructed in a certain manner. And it has two categories. It has one. It has, first of all something which seems to be beyond categories. And then it has two categories. Heaven and earth. You could call it masculine, feminine. You could call it essence and potential. There are different ways people have tried to phrase these two categories. Yang, yin. And so you have these two categories. One is kind of related to light, to naming, to identity, to breath, spirit. There's all these different analogies which are given when you read it in Genesis, you see it. Then the other one is related to darkness, to potential, to chaos, to unformedness. Feminine also. Bringing forth like that can kind of bring things forward from below."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":897.62,"end":905.26,"speaker":"Stephen Woodford","text":"That's interesting that you've put feminine twice on the negative connotations there. Is that something you hold or what did I say?"}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":905.26,"end":906.02,"speaker":"Jonathan Pageau","text":"That's negative?"}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":906.42,"end":908.78,"speaker":"Stephen Woodford","text":"Darkness, femininity. And then."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":908.78,"end":910.58,"speaker":"Jonathan Pageau","text":"Well, it's not necessarily negative."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":911.06,"end":922.44,"speaker":"Stephen Woodford","text":"No, I'm just curious whether or not you hold it. I've noticed that with people, they seem to be. And I can get it, because if you look at human history and you want to understand these patterns of being and you look at the human, light."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":922.44,"end":951.8,"speaker":"Jonathan Pageau","text":"Is not necessarily positive. Light is also. Can be quite negative because there are some things you don't want to shine light on. Like name can also be negative. I told you, if you count your country too much, you're going to bring calamity. Now, that's an excess of heaven. It's not an excess of earth. It has nothing to do with darkness. It's the opposite of darkness. It's not leaving darkness will also cause calamity. So there can be excesses of heaven and there can be excesses of earth, there can be excesses of light and there can be excesses of darkness, sure."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":951.8,"end":977.76,"speaker":"Stephen Woodford","text":"But this becomes. This is just like a language thing. It's the way in which we describe things. Right. So I could choose to use darkness as a description for anything I find to be negative. So if I have these intuitions, you know, for example, to be tough on immigration, not allow people into my country, then I can describe, don't let the darkness come in. Whereas I could flip this around and go, it's light for. It's good to let people in. But then the lights being the. The bad. Like there's a language."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":978.8,"end":992.88,"speaker":"Jonathan Pageau","text":"Well, usually you won't rarely represent the coming in of people from the outside as light. You could phrase it, but you can, you could. I would struggle to see how you could do it in a way that would be convincing."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":993.6,"end":995.96,"speaker":"Stephen Woodford","text":"Yeah, more resources, Potential."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":995.96,"end":1067.83,"speaker":"Jonathan Pageau","text":"Yes, resource potential. All things that are related to unformed possibilities that are coming from the outside and will now attach themselves to an already existing identity. And so the stranger, the foreigner usually does end up having that kind of a kind of feminine aspect in the sense that here are these things from the outside that we're going to bring in and that are going to rejuvenate us, that are going to give us more kind of like sleeping or eating, we're going to add more potential. And so it has a positive aspect, but it can also have a negative aspect. If it's an invasion and it's the same from the other side, you can have a king or you can have something that's from above that says, no, we're going to establish our borders to avoid being invaded from the outside. And that could be positive, but it can also be we're going to crush anything that doesn't fit in this hierarchy. And therefore. And then it appears as negative and as tyranny and as the king, you know, let's say clamping down. And so the negative and positive aspects can come from both sides of that basic structure, let's say, of heaven and earth that you find in Genesis."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":1068.15,"end":1281.44,"speaker":"Stephen Woodford","text":"Yeah. And it, well, you find it in, as you said, in all sorts of patterns of being in all sorts of religions and all sorts of ideologies and cultures. And the language that we use is largely arbitrary to how convincing. Well, no, hang on. It's arbitrary in the sense that it's down to the individual's interpretation. That's what I mean by arbitrary. So let me, let me still man the metaphor, metaphorical truth thing just to make sure that it's. It's broadly put across where my views are, if you wouldn't mind, at least. So you have this concept of the metaphorical truths. And one thing I've noticed, because here's one thing I do in general, I've been doing it for about six months and it's been really good for my mind, and that is that I've deliberately escaped my echo chambers. And I go into echo chambers, which is just like forums or even comment sections in other channels where I'm listening to what those people in those chambers think of certain ideas. And it's really helpful because it helps with understanding where. Where, where straw men or just misunderstanding might be taking place on my part and also from what they might not be understanding from me. So what I want to express in relation to this, on this topic is that I not only see metaphorical truth as this thing where it's, you know, literally false but metaphorically true. No, I also recognize that these things arbitrary. So you take snakes coming up in Genesis, where it comes up in Greek mythology, it comes up in Egyptian, if I'm not mistaken. It basically pops up all the damn time. And this is not arbitrary. Right. Snakes have been our predators for, for millions and millions of years. And so when you see it depicted in Harry Potter or whatnot, it's, it's not, it's not arbitrary. It's not. Someone just went, I don't like snakes. Let's put it in. No, this is telling us something fundamental about our psychological evolution. And I think that there is plenty of babies in the bath water and there's plenty of fantastic resources to be harvest from our stories. So if we take the stories which have been crucial to human civilization and we don't discard them, and honestly, I don't know, many atheists at all that want to do this, what you do is you take them and you go, right, let's really try and figure out what this is saying about us as individuals, as a species, and you can look into it and figure out what's true, what's not what. And because they evolved alongside of our adaption, we can also appreciate that some of them will not be applicable to the environments that we envelop now, because the environments and the pressures and the. The situation that we find ourselves in now is simply not the environment that we evolved in. So I'm not saying we can escape our evolution or that we have, but we are experiencing threats that we're simply not evolved to deal with. And that means that these intuitions that we have that may have, you know, the patriarchal systems that you find in a lot of religions, especially the Abrahamic religions, that may one day have been the perfect thing to do, given the environments where it evolved, it's now catastrophic. It's now a really bad thing to have, potentially. We need to look into these and ask these questions. One thing I get frustrated with is, and we went through this yesterday, and it'd be interesting to get it on the table again today, is that you don't seem to be able to recognize that some of the patterns in Christianity could potentially be very, very wrong. And it's not just the patterns. Sorry, it is the patterns that are wrong. It's not what certain Christians do with Christianity."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":1282.08,"end":1324.38,"speaker":"Jonathan Pageau","text":"All right, so let's take what you said. So I'm happy you said that. It's not arbitrary. The images that are used in these stories are based on our experience. And so the difference between light and darkness is not arbitrary, because when it's light, you see, when it's dark, you don't. Right. That's just an experience. And darkness is. Light comes from above. And darkness, if you fall face on the ground, if you're in a cave, if you're underground, then you're in darkness. And if there's no light in the sky, then you're in the dark. And so these patterns, they're based on our experience. And so when you have this description."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":1324.38,"end":1329.26,"speaker":"Stephen Woodford","text":"Jonathan, just. So I definitely am on the same page as you. When you say experience, do you mean our evolutionary psychology?"}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":1330.17,"end":1332.09,"speaker":"Jonathan Pageau","text":"I just mean the experience still today."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":1332.17,"end":1336.13,"speaker":"Stephen Woodford","text":"You still have individual. Okay, do you also. Is it both?"}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":1336.13,"end":1422.84,"speaker":"Jonathan Pageau","text":"It's a universal thing. It's what built us, it's what made us. Right. It's what makes us. It's the patterns in which we exist right until today. So it's like, I have no problem understanding that you can describe the world as being round and turning around the sun. That's a completely legitimate description of. Of how things happen. But it's also a perfectly legitimate description to describe your horizon of experience as below and flat and the sun coming up in the morning and going at night, going down at night. If you don't have that, then you're in trouble because your whole world is managed around that experience. Most, I'd say 98% of people get up when the sun comes up around the same time and go to bed when the sun goes down. It manages our life. It's a pattern of being right. It's part of our existence. And so if we, first of all, if we look at it through that basic experience, then a lot of the stories in scripture, instead of thinking that they're descriptions of scientific things, they're descriptions of the human experience, then a lot of them make more sense. Even the creation narrative in Scripture, if you look at the creation narrative, obviously, to think that that's a technical description of how things came about, you have to be insane. Like, you have to become kind of. Kind of whacked out because it's like, so grass came before the sun. Like, I don't see how that in terms of scientific description is possible."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":1422.92,"end":1428.24,"speaker":"Stephen Woodford","text":"But if you see it because you're lucky enough to live in this day and age, right, and you have more access to more things."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":1428.24,"end":1432.12,"speaker":"Jonathan Pageau","text":"In the second century, there was already people who were saying, this is not what this is about."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":1432.36,"end":1464.84,"speaker":"Stephen Woodford","text":"I know some people have. The vast majority of Christians have had far more literal interpretations than you today, as you know, you're not. Trump's advisor, Paula White, is. Yeah, but the thing is, and. And do you think if we polled most Christians, say, in the Red Belt across America, if we said to them, you know, do you accept even just evolution by natural selection, which you have to be scientifically illiterate not to, you'll find a massive proportion of them, no. They actually take this story really literally. And I just want to put out here that as I think it literally."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":1464.84,"end":1492.35,"speaker":"Jonathan Pageau","text":"Too, I don't take it scientifically. That's not the same thing. It's more literal in the sense that it's more immediate. You experience those things. You didn't experience evolution. You don't experience the sun turning around the earth turning around the sun. You don't experience how round the earth is. Right. The closest experience to you that you have is closer to what's described in Scripture than the system of planets that turn around the sun."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":1493.2,"end":1516.48,"speaker":"Stephen Woodford","text":"You can't have your cake and eat it too. You were just describing that you have this situation where it's not arbitrary. Well, to say that it's not arbitrary is to say that you're the product of this psychological evolution, that you're the product of your ancestors that have evolved in certain environments. And so these stories and these motifs and these archetypes have manifested in our stories today. You can't have that and also deny the evolutionary process. Right."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":1518.09,"end":1519.53,"speaker":"Jonathan Pageau","text":"I don't understand what you mean."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":1519.69,"end":1524.73,"speaker":"Stephen Woodford","text":"It's almost like you're at odds with. With these. But to pivot back to it, to keep it back where we was."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":1525.13,"end":1525.53,"speaker":"Jonathan Pageau","text":"You."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":1527.13,"end":1601.08,"speaker":"Stephen Woodford","text":"You have this situation where most Christians even alive today, with all of the science and the revolution that's happened, don't have this. This view that you do. But for what it's worth, what I would say is that I do want to explore these motifs in Christianity, in Islam, in Hinduism. I really do think that there's babies in the boa of water that need to be saved. But what it requires is an earnest conversation where we recognize that, you know what, Christianity is not perfect. Some of the patterns in Christianity are destructive. Some of them are. Have most of humanity been really good, such as the repression, you know, yesterday we were speaking, you know, were you saying potentially, you know, repression of homosexuality may have been good in some environments? I don't agree. Agree with that. But even if that was true, it certainly I would. I don't see reason to believe that it's true today. And so that needs to be discarded. This is the. This is the problem with the stories. It's. If you take certain ideologies that are not treated with reverence, that are not dogmatic, that don't have people literally believing them in any kind of capacity, you can take which bits are good and remove the parts which are bad. You can take the bits which are now applicable to the world and the problems that we have and remove the bits that are not. When it's taken more seriously. But go ahead."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":1601.32,"end":1707.14,"speaker":"Jonathan Pageau","text":"So let's take the. So what I'm trying to describe is a frame, okay? So the religious stories, the religious prescriptions, they're frames of experience, and they have two extremes. They have a invisible scream that's like a pattern extreme or a naming extreme or order extreme. Then you have another extreme, which is a chaos extreme or potential extreme. And those are really kind of two extremes. And the world happens in between, and the world has to find a balance between these two extremes, and that's in Scripture. If you look at the description of the Genesis account, you'll see that it starts very high. So it starts with the grass and the stars, and then it moves down. So it's like the birds and the fish. Then it moves down, and then it comes to the animals, and then it goes to the middle, which is the human person. And then the human person is a gathering of dust and the breath of God blown in man. So it's a pattern of two extremes which come together and meet in the middle in the human person. Because the human person has reason, the human person has logos, has the capacity to discern, to participate, to produce patterns. So the human person is at the middle of this whole thing in terms of the experience we have of the cosmos. Okay, now that is. I won't go into the details, but that pattern is the reason for all the laws in Scripture. Every single law in Scripture can be understood as finding the balance between heaven and earth, finding the balance between the two extremes of reality. You could say order and chaos, or you could say naming. And so that I know my pattern like I know my frame."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":1707.38,"end":1709.06,"speaker":"Stephen Woodford","text":"Is this true of Islam as well?"}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":1709.22,"end":1709.7,"speaker":"Jonathan Pageau","text":"Sorry."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":1710.1,"end":1719.3,"speaker":"Stephen Woodford","text":"Sorry to interrupt. I want to make sure I'm following along. I know that's like one of the major purposes here. That pattern that you just described, Is that true of other, say, religions?"}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":1719.3,"end":1720.9,"speaker":"Jonathan Pageau","text":"It's true. Yes, it is."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":1720.9,"end":1721.62,"speaker":"Stephen Woodford","text":"Okay. Okay. Yeah."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":1721.62,"end":1749.02,"speaker":"Jonathan Pageau","text":"But you wanted to make sure, I would say most. Most religious patterns, most religious systems are trying to find how this connects together, trying to find how these two extremes connect together. And then they do offer different solutions at how to connect these two things together. But the pattern is universal. The pattern is the pattern of reality or over our experience of reality. It's the pattern of our experience of reality."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":1749.34,"end":1754.06,"speaker":"Stephen Woodford","text":"So that pattern that you described, John Jonathan, is good and bad?"}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":1754.38,"end":1757.02,"speaker":"Jonathan Pageau","text":"No, it's not good and bad. That's not the right way to see it."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":1757.02,"end":1758.78,"speaker":"Stephen Woodford","text":"That seems to be the cushion across."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":1759.16,"end":1782.52,"speaker":"Jonathan Pageau","text":"And that's exactly. By the way, that's exactly one of the things that Christians are trying to fight. For example, in the early centuries, there were Gnostic sects. And the Gnostic sects, they tended to see the lower part of this pattern as evil in itself. And one of the things the Christians did was to fight that very strongly and say, no, this basic structure is not good and evil, Right?"}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":1782.52,"end":1782.8,"speaker":"Stephen Woodford","text":"No."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":1782.8,"end":1844.38,"speaker":"Jonathan Pageau","text":"Good and evil, good and bad, or good and bad? No, it's not. And you can see that. You can see there's some beautiful descriptions for example. And so the idea that water is kind of chaos or potential, right? So there's a beautiful image in Saint Ephrem the Syrian, who's an early Christian mystic who talks about how the people who were in the Garden of Eden, they could go down the mountain of Eden, go down the cosmic mountain, and then when they reached the ocean, they would walk on water. And so the idea is that. Is that the water and the chaos and the Leviathan and all these images of the. Of what is below as being bad is not necessarily for the person who has that balance. For the person who has that balance, nothing is evil. St. Paul says nothing is evil in itself, right? Nothing is evil things. It's just that some things are not useful. And so there are different ways of. There are different ways of talking about this, but that's not the point. The point is not to see heaven as good and earth as bad. Why would it be part of creation if it was bad?"}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":1845,"end":1849,"speaker":"Stephen Woodford","text":"Would you. Would you. Is this is why you would use terms such as order and chaos?"}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":1849,"end":1854.68,"speaker":"Jonathan Pageau","text":"I guess water is chaos, but it's also potentiality. But water can also be something else. I would. I want to go into the details."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":1855.08,"end":1864.52,"speaker":"Stephen Woodford","text":"Basically, it seems that you're talking about this dichotomy and this meeting ground. As you were saying, as you look at the story of Genesis, you obviously have an A and a B here. And it seemed that you were talking about the process."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":1864.92,"end":1868.28,"speaker":"Jonathan Pageau","text":"There are two extremes in manifestation, right? And so."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":1868.6,"end":1869.24,"speaker":"Stephen Woodford","text":"So since."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":1871,"end":1899.51,"speaker":"Jonathan Pageau","text":"Let'S get into, like, concrete things. So, like, when you experience an object, like let's say you experience a car, there's an aspect of the car which is variable and multiple, and you experience that, right? Because there are several cars. You recognize that this car. This is a car. This is the car. This is the car. This is the car. The problem is that they're all different. So how do you know that they're the same thing? Like, how do you know that a Mercedes and an Audi, you can use the same category to describe them because they're very different. They're extremely different."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":1899.92,"end":1900.88,"speaker":"Stephen Woodford","text":"Well, they're both atoms."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":1900.96,"end":1978.78,"speaker":"Jonathan Pageau","text":"And so there's a pattern. So there's a pattern above, there's a heaven of that car, and that the heaven of that car is the pattern of the car. And you see that. But you can't just have the pattern. You can't, because you need the car to exist in its multiplicity. So there has to be a joining of heaven and earth for the reality to exist. So you need both the pattern and Then you need to leave room for the multiplicity to manifest itself. And so in scripture, it's. So in scripture, like, for example, God says to the earth, bring forth, and then gives a general category. So it says. So God says, bring forth the plant which produce seed. And then the earth brings forth plant which produce seed. And so you have this relationship between, you could call emanation and emergence, where there's both a name and identity, but then there's also this multiplicity which comes up and fills up the identity. So it's like you could say, okay, so God says, bring forth cars. So he gives us the name car. And then Audi and Mercedes and all these different companies now start to bubble up and to produce versions, multiple versions of that identity."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":1979.41,"end":1979.61,"speaker":"Stephen Woodford","text":"Right?"}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":1979.61,"end":1987.09,"speaker":"Jonathan Pageau","text":"And so that's the, that's the basic. It's a pattern. It's not a. It's not a pattern which is limited to religion. It's a. It's just a description of reality."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":1987.57,"end":2229.76,"speaker":"Stephen Woodford","text":"Well, this is, this is the thing. There's certain patterns that are, in our evolutionary psychology that seem to be. They're probably forever going to be applicable to the environments that we find ourselves in. They're always going to tell us something very important about our being. You know, you have like, the outside and the inside. And whether you want to use the connotations of light or, or dark or whatever, you want to use chaos or order, it doesn't really matter. The point is that that's always going to be something that flows through us. And you're going to find that in ideologies. You're going to find that in religions. And I get this. I'm someone that's totally cool with this, and I don't want to. I'm not someone that wants to go, look, let's just throw everything away and start from scratch. No, you can't start from scratch because there is no scratch. You are the product of your evolutionary psychology. There is no scratch. Right. I get this. Right. But we're in this situation where we have developed enormously over the last 2000 years, especially since the Enlightenment. Like, there's been enormous amount of changes just in, in a technological sense, let alone, like the philosophy and the science. I guess the technology part is, is dependent on the science. So we're dealing with new situations and new problems. And let's go for the patriarchy version because I think that's a good pattern. That's, that's come up a lot. Why? Because Homo sapiens evolve in such a way as to have a patriarchal system, you know, something that Jordan Peterson's mentioned. And it's why men tend to be more assertive than women. And, you know, none of this is arbitrary. It's like this is a reflection of our, of our past. I get this. And I think some people like to pretend that that's not the case. It's just not true. That is the case. Right. Doesn't mean it's always going to be the case. It's just you're going to see statistical anomalies that, sorry, a statistical basis that represents that fact. So when you're in tribes, you want to have a patriarchy. Why? Because it may. Evolution hasn't chosen this arbitrarily. It's probably because you needed an assertive, strong leader, someone that would make, you know, certain decisions in certain ways. And so that was selected for. But now we live in a massive cosmopolitan world where an aggressive act isn't going to be one tribe going up to another tribe and like doing a war dance or even throwing a couple of spears and potentially killing one of them members or whatnot. No, it's going to be an atom bomb dropped on your head. So those traits that were selected for may not be useful in the world that we live, or it may not be what we should have at the highest part of our hierarchies today because our environment has changed. Right. So it may be that actually more feminine traits are more or are going to be better given the world that we have. It doesn't mean you put female people in power, just mean because you get feminine traits in males as well. I would say that I'm relatively feminine with some of my traits. I'm high in empathy, for example. That is something I would say tends to be a feminine trait. Some people may disagree with me. I don't think. I don't think it's an accident that most vegans, for example, are female. I just, I don't. I think that's a reflection of the fact that they're higher in empathy. So my point being here is that these patterns come up in our stories. And this is why you find that Christianity has a lot of this patriarchy, Islam does, so does Judaism, etc. You have other religions that don't have this and you have other ideologies that certainly don't have this. And what we need to be able to do is to look deeply, scientifically at those stories, what they're telling us, and try and take what's good and remove what's bad. We have to be in a situation where we can say Christianity's primary motif of loving your neighbor, of having a top. A God that's looking after his children and children that revere the, The God. That. That's still good. That's still something that, that's probably something that's always going to run. That's probably Christianity's strongest message. Right. It's a strong motif, but it, it's, it's wrong in some of the other patterns that it's got in the sense that it's no longer true because the environments that we live in now, that's not good enough. And this is why. Yeah, cool."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":2229.76,"end":2235.84,"speaker":"Jonathan Pageau","text":"So I would, I would. So let's, let's. I'm not gonna. I don't want to argue with the specifics of what you said. I want to, I want to."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":2237.36,"end":2241.04,"speaker":"Stephen Woodford","text":"If you want me to understand your position, you have to deal with that issue."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":2241.04,"end":2252.64,"speaker":"Jonathan Pageau","text":"No, I don't see a solution. I promise you, this is what I'm going to do. But what I mean is, you said, you said there was a lot of specific arguments. What I want, I want to try to encompass the main, My main objection to your, to your argument, which is."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":2252.64,"end":2254.32,"speaker":"Stephen Woodford","text":"See, I think there was one argument."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":2254.81,"end":2295.87,"speaker":"Jonathan Pageau","text":"Okay, all right. Okay. So, yes, you're right. It was one argument. Let's say the world has changed. The situation has changed because of technology, because of, let's say, things you didn't even mention, like, for example, massive population, you know, and massive travel, you know, there's also the different political movements which have come about, which have, which have affected the way people think. And so because of this change in the environment, then we should be able to change the way, the pattern. We should be able to choose other patterns which would be more appropriate to that environment. Do you feel like that your argument. Enough."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":2296.75,"end":2348.74,"speaker":"Stephen Woodford","text":"Close. I just want to add, just to make sure. Yes, yeah, close. Because there's an important element, the way in which you speak about Christianity is. I've noticed that you tend to speak of it as the default position. You say, you know, some of the motifs that you find. You. You maybe you're convinced of that proposition, and that would explain why you do so, but I'm not convinced of that. I think that, you know, there's lots of religions and ideologies that have existed for a very, very long time that don't subordinate half the human race, for example, that elevate women. Not just. They're not just different, but, but no, they really are just as capable in all senses, and they should be able to ascertain the highest roles, the top of the mantle. So it's not that I want to replace the patterns. I want to recognize which patterns are most suitable for today. It's not like I'm trying to develop something new here. It's more I want to balance them according. And we have to be able to ask the good questions, but go ahead."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":2348.74,"end":2535.36,"speaker":"Jonathan Pageau","text":"So religions, or really the word religion is such a complicated word because it tends to separate things. But let's say traditional societies, let's use it that way. Traditional societies had rituals and patterns and stories that would celebrate and participate in this frame of reality that I tried to describe to you. Right, so here's the frame. There's usually in most traditions, even though people don't tend to realize it, but there's an absolute, like something that is above all categorization, which is, which is beyond the basic opposites. I say most, most religious systems end up having that, even though sometimes they don't talk about it so much. But you have an absolute which is beyond all categorization. You have these opposites and then you have the world playing itself out within these opposites. And so religious traditional societies, they celebrate that and participate in that through architecture, through how they lay out their buildings, how they organize their societies, their storytelling, their dances, the liturgical year, how they qualify time, how they see themselves as playing out this pattern. And so it's not like they're standing above the pattern, thinking about it and then saying, well, here's what we're going to do. If that's not what it is, it's an embodied, experienced participation in a dance. And so it's a give and take and a movement that we kind of, as we imbibe these patterns, let's say there's a blessing from heaven which comes down because as you're embodying the pattern, then the pattern reinforces itself. And that pattern is true. It's true because that's how reality lays itself out for human beings. So you can see it as like this, this like self fulfilling wheel of participation in the world, okay? And so I know in that pattern, and that's one of the reasons why it'll be hard for you to understand too, like when, how much I speak out of my Christian position because I know where I stand, like I know where I am. I am in this story, I am in the Christian story, I am in the Christian. I participate in the pattern in an active, real way. And so when you tell me that we need to apply different patterns or choose different patterns, because the reality underneath has changed. My question is, where are you? Like, where do you stand? From which position do you stand that you are able to judge this? And then what then is your purpose? Like, what is your goal? What are you reaching towards? What are you trying to make happen? Because you say good and you say bad, you say better, but I'm not sure I know what that is. Like. I don't know what it means to say that we need to, let's say patriarchy is not acceptable anymore. We need to replace it with something else. But I'm not sure what is this good that you see either in the future or in this new pattern? Like, is it more equality? Is it equality? Is it, like, I don't know what it is the good that you're referencing?"}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":2536,"end":2679.97,"speaker":"Stephen Woodford","text":"Okay, so an answer with a question. I don't think that words such as good and bad, right and wrong have any intrinsic meaning. The meaning comes from essentially a Kantian hypothetical imperative of the teleological aspects and consideration. It's the goals that make it, whether or not it's good or bad. So it depends on your goals as to whether or not something is good or bad. So if you see something through the vision of Christianity, you're going to say it's good if it lives up to the expectation of Christianity, if it lives up to God. If you're seeing it through, say, communism, you're going to say it's good. If it is something that emancipates the proletariat and removes power from the bourgeoisie. It, you know, that's. That's how good or bad works. I'm in the same boat as you. I completely recognize this in the sense that I'm trying to. My intrinsic axiomatic definitions of good or bad are a product of my psychological evolution, the same as you. But it seems that you've done this really cool thing, and so is Jordan Peterson and Carl Jung and other people where they pointed out, they went, look, we can really start analyzing why these stories have. Have come out the way that they have. We can really start trying to figure out why it is that we have these intuitive, axiomatic understandings of right and wrong and good and evil. And, you know, it's not arbitrary. This, this is amazing. And I want to go a step further than you in the sense that. And I don't want to go all the way because I don't think you can. I just want to go, okay, that's great. How do we navigate between one. Which of these stories are correct? Which of these motifs are actually representations. Two, which of them are still applicable to the environments that we have today? What is the way in which we navigate through this? Because you could do this with communism. You could take communism and you can take like Lenin's readings reading a couple of days ago, where he was describing how you needed to put down the. All of the movements that were happening to try and remove his power. He was using metaphorical language. He was saying we must sever the head of the tyrant and keep the power with the. The board with the proletariat. You can analyze this for all. It's good. I could do exactly what you do to Christianity to it as well. I could go, listen, the central motif of communism is that the top must look after the bottom. And that's why you need to make sure that the person at the top is someone that really has a good relationship with the bottom. Like you can do all of this stuff and you can though."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":2679.97,"end":2684.15,"speaker":"Jonathan Pageau","text":"Jonathan, finish the argument and we'll see if we can really do that. Go ahead."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":2684.7,"end":2724.15,"speaker":"Stephen Woodford","text":"Sure. But the thing is, is that you could do this with that. You could do it with veganism, you could do it with so many different topics. You could do it with religions, which is, I think that religion is the cancer of archetypes because it turns them into something dogmatic that you can't question anymore. I think that's the big problem. And then you also have this issue where you actually have a lot of people that literally believe at least some of the aspects, which is what you have in every religion. Like you have people, most people just simply really do believe that a conscious being called God exists. That is looking at who he sleeps with and on what position. You don't have that position. From my understanding. You don't even believe that there is a conscious being called God out there."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":2724.15,"end":2769.54,"speaker":"Jonathan Pageau","text":"Wait, wait. I don't believe that God can be limited to being, but I believe that God. I believe that there is something above all categories and that something is the source of everything and that it's not a something, it's St. Maximos describes God as being and non being at the same time. And so there are different ways of describing this absolute. And consciousness is a good way to understand God. It's a good way to understand God because from heaven comes meaning and pattern. And so patterns come from above. And so our capacity to notice patterns and to engage patterns and to produce patterns is, let's say, culminates in the infinite and culminates into God."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":2770.1,"end":2798.88,"speaker":"Stephen Woodford","text":"You know how you have the new age religions which basically Use this kind of form of Spinoza's God, where they just go, God is energy, man. And so you can't refute the positions. This is, of course not what you're doing, but it is scarily close to it because you know what I mean when I say a conscious being. It's a being that literally can see you. Literally is watching you. A conscious being. And I know, I understand that maybe you would see that as a straw man of Christianity, but it's simply not. Christians do believe that there really is a conscious being."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":2800.32,"end":2804.88,"speaker":"Jonathan Pageau","text":"I believe God can see you, and I believe you can speak to God, and I believe God can answer."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":2805.04,"end":2806.88,"speaker":"Stephen Woodford","text":"I know, but is God a conscious being?"}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":2807.36,"end":2811.52,"speaker":"Jonathan Pageau","text":"God is more than a conscious being. I can't. It's. The thing is that if you want me to limit God."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":2811.92,"end":2837.17,"speaker":"Stephen Woodford","text":"That's interesting. I didn't know. That's interesting. I didn't have you down as someone that believed actually in a conscious being. I thought you were more of Jordan Peterson kind of style in the sense of, no, there is no conscious being watching us. You know, but we could use consciousness in such a. We could redefine consciousness in a way that's perhaps meaningful under this architecture. I didn't have you down as someone that actually believes in a conscious, conscious being, but fair enough in my."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":2837.17,"end":2860.76,"speaker":"Jonathan Pageau","text":"Even a conscious being, because the problem with a conscious being is that a conscious being is. Especially if it's. Especially if it's made equal as just a phenomena in the world, then I do not believe in a conscious being. It's like I believe. I believe that the gods exist, but the gods are higher up. They're vertical relationships to the world. They're not horizontal."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":2861.08,"end":2863.88,"speaker":"Stephen Woodford","text":"You need to find consciousness for me. That will help."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":2864.28,"end":2871.4,"speaker":"Jonathan Pageau","text":"No, I do. I use the word consciousness to a certain extent because it's kind of the word that people are using today. That's not the word that the traditionalists use."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":2871.4,"end":2873.96,"speaker":"Stephen Woodford","text":"Traditionalism. No, no. Can you. Can you define. Yeah."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":2873.96,"end":2875.48,"speaker":"Jonathan Pageau","text":"Can you define intelligence?"}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":2876.12,"end":2877.72,"speaker":"Stephen Woodford","text":"Sure. But can you define consciousness?"}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":2878.95,"end":2961.48,"speaker":"Jonathan Pageau","text":"I mean, my use of intelligence, which would probably be. When I say the word conscience is what I'm actually referring to has something to do with the capacity to perceive patterns and the capacity to produce patterns. And so you're capable of perceiving things from below. You could say you have a sense mechanism that is able to take in, and then you also have the capacity to influence and to have influence on the world. And so I would say that that's probably the closest thing that I can use to talk about consciousness and Then that, then ultimately, then the idea of self consciousness in the sense that that capacity to attend, right, and then to produce, let's say, can also be turned within. And therefore it creates a kind of capacity to attend to oneself. And then that would be something like self consciousness or being conscious of self, let's say. So John Vervaeke doesn't like the word consciousness either. Like, there's a professor of psychology from the University of Toronto that I'm in constant conversation with and he calls it relevance realization. And so it's a great word. It's actually a great word. It's the capacity to know what's relevant in indefinite multiplicity. And so it's the capacity to engage, perceive patterns and produce them."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":2963.07,"end":2971.15,"speaker":"Stephen Woodford","text":"Okay, so if we, we can put aside your use of consciousness just to try. For me to be able to illustrate a point. Can you define the colloquial use of consciousness?"}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":2972.27,"end":2998.53,"speaker":"Jonathan Pageau","text":"I mean, people just usually are trying to describe this, the, their experience of being awake, their experience of, of having this first person experience. That's usually what people are trying to, to kind of grasp at because it's difficult to describe it because it's the frame by which we experience the world. So it's hard to look at once. It's hard to self look at the, it's hard to analyze the system by which you analyze things. It's very difficult because it's differential loop."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":2998.77,"end":3017.06,"speaker":"Stephen Woodford","text":"I appreciate that. And I also appreciate that words, you know, they change, they have meanings, they don't, they're not, they're not authoritarian. I get this fact. But what I'm trying to illustrate to you here is that I, I would wager good money that most people that call themselves Christian today, let alone in the past, really do believe that there's a conscious being watching."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":3018.26,"end":3104.69,"speaker":"Jonathan Pageau","text":"That's the thing, that it's okay, because religion, religion, the way that this pattern that I'm telling you works is that it scales at every level. And so it uses language that is accessible to the dumbest person. And the effect it will have on their life is a real effect of manifesting their behavior. And so we say father because the analogy between the experience of the Father and God is a very good analogy to help you understand something which is above something which is, let's say, naming, that gives you a name, that gives you unity, all of that. And so of course that someone who is not very educated and is very simple will have a very immediate and emotional and very, let's say, naive vision of that. And that's totally fine as Long as there are also people and they're also theologians and there are also people who are able to grasp the patterns in a more systematic way, and that those people are the ones who are writing the books, and those are the people that are ones that are guiding the. And I agree. Look, when you talked about Trump's advisor. Look, I agree, and I'll be the first to say that Christianity has gone off the rails for several centuries and has devolved into a very kind of sentimentalist and kind of disturbing version of itself. And I feel like one of the things that I'm trying to do and that a lot."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":3104.69,"end":3106.21,"speaker":"Stephen Woodford","text":"I want to go back to the old days."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":3107.54,"end":3108.66,"speaker":"Jonathan Pageau","text":"Sorry, are we cutting out here?"}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":3109.22,"end":3113.78,"speaker":"Stephen Woodford","text":"Slightly cut out there? Yeah, but I was just going to say, do you want to go back to the good old days kind of thing?"}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":3114.42,"end":3146.73,"speaker":"Jonathan Pageau","text":"No, it's not about going back to the good old days. It's about reinvigorating the pattern. Because it comes back to my question, which is if the only thing you can do is reinvigorate the pattern, because you didn't totally answer my question of where are you? Where do you stand in order to be able to judge which pattern you can use and which pattern is good. And you didn't tell me, like, what your teleology is. It's like you didn't tell me what you're aiming towards. Let's say you mentioned that that's what Kant talks about, but you didn't. Didn't tell me, like, what you're aiming towards."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":3146.97,"end":3279.16,"speaker":"Stephen Woodford","text":"No, no, no, I did. I did. So I'm a product of evolution by natural selection, and so I'm in the same boat as you is how I said it before. I'm in the same boat as you in the sense that I don't have definitive answers. I have to work with what is best around me. And now. And now what I have to do is also navigate the fact that my intuitions may not be correct because they've evolved for an environment that I simply am not in anymore. I've evolved for an environment that, as I use as an example, feminine traits look like they're going to be better off than masculine traits in this cosmopolitan world. And so my, My. My intuition just might be wrong. We need a way to navigate this space. We need a way to take this very, very seriously. Don't throw the babies out the bath water. But to be able to recognize that some of the ideas that we had before one were just wrong. Like, they actually weren't patterns of being, they were bugs. Not features. And two, that they were actually features. They were correct, but they're just no longer applicable or they're now actually destructive. The order has become the chaos. So if I can really nail my point here, because this is one of the reason, this is one of the things that frustrates me the absolute most. And you'll be able to help me out here, right? You've talked about your experience and your being and it's really good that you get to live your experience and I get to live my experience. But what if your experience is that you're homosexual? Right? What if that's your experience and you live in an environment which, either because it's a feature or because it's a bug, it could be a bug or a feature that doesn't belong in this society. What if it is that you can't actually be yourself, you can't live your, your experience, existence, the way in which you've actually evolved to be. You know, homosexuality is found in all sorts of social species and it's something that's absolutely natural. And yet we live in an environment where you're doing this, hey, let's like take Christianity, be very careful not to remove this or to remove that. There's people that are being denied their experience, their way of life, and it just, it just. We have to find a way to be able to go. Some of these ideas don't apply anymore. And this is something that frustrates me. Tell me one of the patterns of being in Christianity that is that, that is not applicable today."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":3279.4,"end":3375.32,"speaker":"Jonathan Pageau","text":"Is there any a pattern of being in Christianity itself? I don't, like I said, I don't. I really struggle to. I do in fact struggle to, because the thing about a pattern is that it's a pattern. And so I think that the pattern that I described to you, which is just the basic pattern of the universe, and I would say that probably most religions agree on that. Christianity, what Christianity offers is a particular. In that pattern. It offers a particular tweak on it. And I think it tries to offer a solution to some of the problems of the pattern. And the solution is. Offers is that there is an inevitability of hierarchy. These hierarchies are inevitable. You can't get rid of hierarchies. They're just hard coded into how the world works. And so what then is the nature of this hierarchy? And the way the answer of Christianity is that it's love, is that that which is above cares for that which is below, and that which is below submits. To that which is above. So that's the particular thing that Christianity offers. And now then in reality, it'll manifest itself in different ways, and so there'll be different applications. And so, for example, the prescription on homosexuality, I wouldn't say that that's a pattern. It's not a pattern. It's an application of a pattern of being, and it's a particular application of it. And so there are reasons why Christians believe that. And I mean, they're based on this pattern. You know, we can go in. I don't know if we want to go into it now, because we've been talking for an hour. I don't know if you want to go into that right now."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":3375.4,"end":3384.84,"speaker":"Stephen Woodford","text":"Sure. You know, I'm relatively flexible. As we said, we can have other conversations, but it feels like this would be a bad time to stop because I feel like we're getting to the essence of things. So do your point, because I don't."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":3384.84,"end":3389.44,"speaker":"Jonathan Pageau","text":"Think homosexuality is the essence of things. But that's okay. I don't mind talking about sexual taboo."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":3389.44,"end":3397.08,"speaker":"Stephen Woodford","text":"No, but. So this is. This. It's not the homosexuality. It's that people were denied to experience who they are. It's very."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":3397.08,"end":3400.2,"speaker":"Jonathan Pageau","text":"Well, so you think that homosexuality is who someone is."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":3401.35,"end":3406.23,"speaker":"Stephen Woodford","text":"It's part. It's integral to some individuals. Yeah, some individuals say not for bi people."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":3406.31,"end":3410.71,"speaker":"Jonathan Pageau","text":"Do you think homosexuality is. Let's say it's an identity and it's not a behavior?"}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":3411.19,"end":3417.35,"speaker":"Stephen Woodford","text":"No, it's some. It's. It's. It's just as wired into them, certainly in many cases as it is that you're straight."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":3418.63,"end":3434.05,"speaker":"Jonathan Pageau","text":"I don't. I don't think that it's a category either. Being straight is not a category. Heterosexuality is a modern. It's a category that pops up with homosexuality. It's not a. It's not a category that you'll find in scripture that you'll find in any religious system. Heterosexuality is not a category."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":3434.29,"end":3443.13,"speaker":"Stephen Woodford","text":"Well, it is. And again, this is a language thing. It's the way in which you use this language. So you have, like, Leviticus, you know, telling you what to do with homosexuals."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":3443.13,"end":3447.81,"speaker":"Jonathan Pageau","text":"Which is, you know, Leviticus doesn't tell you what to do with homosexual. Leviticus tells you what to do with behavior."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":3448.13,"end":3449.57,"speaker":"Stephen Woodford","text":"It says stone them to death."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":3450.21,"end":3513.41,"speaker":"Jonathan Pageau","text":"It says to stone men who are caught having sex with other men. By the way, in Leviticus, it doesn't say to stone women who are caught with other women. It just says to stone men that are caught with other men. And I'm not saying that in Christianity, let's say lesbian relationships are acceptable. But the Bible doesn't condemn identities, it condemns behavior. And so if you think that someone's behavior is identical to their identity, that to me is already. One of the problems of the modern age is that, is that traditional categories of identity are not behavior. Traditional categories of identity are things that give you their place in the world, will tell you what place you have in the world. So you could criticize some of those identities, but they're not the same as behavior. We could even take a negative one. We could even say that the identity of a slave is something which is not great, but a slave is not a behavior. A slave is a place you have in the world."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":3513.57,"end":3530.69,"speaker":"Stephen Woodford","text":"No, but you can deny someone's. You can, you can phrase it in the forms of behavior, but at the end of the day, you're denying someone's experience. You're denying actually, funny enough, the thing that they've evolved to have. So in the case of, you know, don't do this and don't do that in forms of homosexuality."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":3530.77,"end":3532.93,"speaker":"Jonathan Pageau","text":"Right. We've also evolved to kill people."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":3533.49,"end":3533.97,"speaker":"Stephen Woodford","text":"Yes."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":3534.21,"end":3542.12,"speaker":"Jonathan Pageau","text":"So we deny that experience to people. Like, we deny that, but we're not denying their identity. Like, we're not actually."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":3543.32,"end":3630.66,"speaker":"Stephen Woodford","text":"Well, if you, you know, you read numbers, they seem perfectly fine with putting to death every man, woman, every man, woman and male child to death because it's part of the outside. So it's like, well, really we've evolved to not put. To kill within our own tribes, not the other. Which is why we have these cognitive dissonance and this cognitive bias when it comes to certain charities and certain things that we see that are really bad, which rationally should make us act. But it doesn't because that's actually not the way that we've evolved. It's wrong to say that we've evolved not to murder. It's like. No, murder has always has been this category which is only to your own people, not to other people. It's. And it's blurred. I will say it's blurred because it's difficult to figure out where, where that line has put itself. But it seems really clear that that's where the evolution has, has put us. And again, like, the Bible would support this because the Bible is telling you, it doesn't just tell you stories of what they did to people which are outside of their tribes. It gives you edicts on what to do. It tells you, you know, where you. Where to get your slaves from, because you can't slave your own people. And if you do slave your own people, then you know, you've got to set them free after xyz only if they're male, not if they're female. You get to keep them forever. But if they're a male, you get, you know, you can, you have to set them free. But if you get your male slaves from the lands around you, then that's perfectly fine. Well, you know, you can understand why that would evolutionary evolve. I would produce the hypothesis that that's probably not a good thing for us to be working with."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":3631.38,"end":3810.21,"speaker":"Jonathan Pageau","text":"And one of the things that Christianity offers is a way to work out this problem. And you're right that it's a problem. You can see it like in Scripture, it's a problem. And you can see it, like you said, by how severe the penalties are for any behavior which goes away from, let's say, the identity of the tribe or the cohesion of the tribe. It's like in scripture, in the Old Testament, the number of things that you have to kill someone for are just insane. It's just so many things. The consequence is that they have to die. And you can understand it in a way in the sense of a really tight knit tribe in a place that has very little recourse. And I mean, can't have like a, can't create systems of, let's say of prisons or whatever. Like they just can't. They have this extreme version. And so what Christianity tries to do is to try to say, okay, so we have this inside and outside. We're not going to get rid of it, it's going to be there forever. And we have this hierarchy which is not going to go away. So how do we elucidate? How do we participate in the best version of that? And so the answer that Christ gives is love your enemy. And so love your enemy is interesting because he's not saying he's not your enemy anymore, right? And so if your enemy attacks you, it's completely, you know, it's like if it attacks a country. Christians have always accepted that you can defend yourself, you can fight off the enemy, but you still have to have the capacity in you to see your enemy as human and your enemy. And the same with this, with the idea of sinning. So certain behaviors continue to be prescribed, especially in terms of sexuality. So adultery, any kind of. And traditional Christianity is pretty radical, by the way. It's more radical than people want to admit, which is that any sexual act which is not within the promise of a marriage and that are involved in Somehow in a pattern of family making is prescribed. So masturbation is prescribed even within a couple. Like, if you don't have full relationships, then it's prescribed. But also everybody knows that that still happens. Like, these things still happen. People still masturbate, People still have sex with men, still have sex with men. All of this is prescribed. And we also have this idea that you have to have compassion for others, not judge others, and you have to tend your hand out to those that have fallen and continue to have compassion for them. And so we can argue over the specifics of the homosexual question, but it's going to come back. It's like the pattern itself is going to come back. So we can take that one and say that one shouldn't be part of it. But okay, we could argue about that all day long. But there are other behaviors which are abhorrent and that we prescribe. But we also don't want to dehumanize the person that is doing it. And we want to continue to consider them human and to let's have a way back. Like have a bridge so the person can come back."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":3811.01,"end":3910.65,"speaker":"Stephen Woodford","text":"Okay, so with Romans, homosexuality was just fine with spark. With Spartans, it was just fine. In fact, Spartans used it as social adhere, as making it so that they adhere to each other, that they work harder, that they fight harder, because the person beside them is someone that they deeply love. The Greeks were okay with homosexuality. This is what I don't appreciate the Christian centric narrative here, because it's just not true that the natural order of things is that. I actually think that it's probably a bug. Now, it may not be. It may have been something that was something that was selected for, and it was a good thing during a certain time or given certain, certain conditions. But here's a question for you, okay? Given that we have these mutually exclusive religions, these mutually exclusively exclusive motifs, these mutually exclusive patterns of being, unless you want to define them all in some. Something so basic as order and chaos and be vague about it, which is one of the frustrations I have. But if you have all of these religions with these different views and these ideologies with different views, and we recognize that they're not arbitrary, but rather they are a product of. They are a manifestation of our evolutionary psychology. How the hell do we navigate which one of them, which of them are features, and which of them are applicable today? Because the only way I feel like real progress can be made is if you're willing and able to recognize that Christianity isn't the best thing since Sliced bread. It's. It's a great thing. And it has. And let me make that clear, I really do think it's a great thing. It has, it has better patterns of being, say, than communism."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":3911.22,"end":3964.28,"speaker":"Jonathan Pageau","text":"But. So how do we know that with. What you're saying is. Again, the same problem that I mentioned again, is that you, you tend to think that you can stand outside of this. I could say, how do we. Like, who are we and where are we standing? That we can decide which patterns, like which religion is better and every. That's not our experience of reality. Our experience of reality is that we are the product of a story and we are the product of a world, and we live in a world and we live in embodied existence. And so the solution to making Christianity better is to be a Christian and to make it better. Like, there's no Christianity outside. Like, it's not people that are. That people that are standing outside and are telling Christians we don't know where they're standing from and telling them, like, here's something you're doing wrong, here's something you're doing right. And we don't even know what their telos is, like, what they're aiming at."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":3965.32,"end":3967.96,"speaker":"Stephen Woodford","text":"Don't start with Christianity. Start."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":3968.04,"end":3969.08,"speaker":"Jonathan Pageau","text":"But I'm a Christian."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":3969.32,"end":3971.4,"speaker":"Stephen Woodford","text":"But don't do that because that's not your identity."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":3971.4,"end":3972.52,"speaker":"Jonathan Pageau","text":"Where should I start from?"}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":3973,"end":3988.57,"speaker":"Stephen Woodford","text":"The fact that you're an evolved primate and that you have this, all of this wiring in your head, this psychological evolution, and you don't know which parts are bugs, so don't have this assumption that Christianity is bug free. It's not. It's very likely not. Why do we know that? Because no ideology is bug free."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":3989.04,"end":3992.88,"speaker":"Jonathan Pageau","text":"Right. And what scale are you using to judge the bug from? Like, where are."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":3992.88,"end":3996.36,"speaker":"Stephen Woodford","text":"Like I said, same as you. The same as, you know, because I."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":3996.36,"end":3999.68,"speaker":"Jonathan Pageau","text":"Have a pattern which I judge, which I participate in the world."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":3999.92,"end":4004.16,"speaker":"Stephen Woodford","text":"You're an evolved primate, Right? Correct. Let's go."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":4004.16,"end":4006.4,"speaker":"Jonathan Pageau","text":"That's definitely not my first category."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":4006.8,"end":4009.12,"speaker":"Stephen Woodford","text":"No, because I don't have that experience."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":4009.2,"end":4011.04,"speaker":"Jonathan Pageau","text":"You have the experience of being an evolved primate."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":4011.44,"end":4012.12,"speaker":"Stephen Woodford","text":"Okay. You're."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":4012.12,"end":4012.48,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":4013.12,"end":4015.16,"speaker":"Stephen Woodford","text":"Our experience would necessarily be that, like."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":4015.16,"end":4018,"speaker":"Jonathan Pageau","text":"When you wake up in the morning, you have that experience. Like, I had the experience."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":4018,"end":4060.72,"speaker":"Stephen Woodford","text":"But no, no, that's. That's a conscious consideration. That's not the same as experience. Like, if you want to say, you know, when I wake up, and I might. I'm not actually scared of spiders, but, you know, you see someone that's scared of spiders, that itself is a testament to their evolutionary psychology. They are an evolved primate on this spinning earth. And everything that they think they know goes back into this evolutionary psychology, all of it. And so we have to navigate from that starting point, or at least a starting point, that way beyond Christianity. The starting point is. If you say that Christianity is a starting point, then. I can't. You just. I can't. I will never get through to you. Because it's the same as someone that says no, Islam is, Is the primary motif. That's where the starting point is. It's game over."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":4060.88,"end":4092.99,"speaker":"Jonathan Pageau","text":"So if. So let's say you say I am an evolved primate that is on this spinning earth, that to me, that's a secondary consideration. That's an abstraction. It's an abstraction from knowledge that people have developed and theories that people have developed. And it's something that you. It's just like people who say that, who talk about the solar system. The solar system is a total abstraction. It's an abstraction from an experience."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":4094.91,"end":4097.95,"speaker":"Stephen Woodford","text":"Forget the earth thing. I know what you're saying. I'm just trying to express a point."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":4098.03,"end":4101.15,"speaker":"Jonathan Pageau","text":"But it's the same with the evolved primate thing. It's an abstraction."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":4101.15,"end":4106.06,"speaker":"Stephen Woodford","text":"Okay, okay, we'll forget that bit. I just find that I'm conscious and I experience the world around me."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":4106.06,"end":4107.62,"speaker":"Jonathan Pageau","text":"That's good. I like that one. Okay."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":4107.62,"end":4198.2,"speaker":"Stephen Woodford","text":"And then. Yeah, and then the next thing I realize is that my consciousness. No, no, no, no. Next one will be. Next one will be. I mean, that's just a way of describing it. Right. But it's a way of describing this sense, and that is that, you know, I bear the stamp of my lowly origin, the way that you'd put that in simplest terms. I guess I need more time to put this correctly. But it would be I'm a conscious. I'm conscious. And the next thing I recognize is that my, My intuitions are not arbitrary. They come from an evolutionary background, which is why I was saying it. But if you want to get technical, that's. That's. That's where the starting point is. So then what we have is these ideologies, these religions, and they're not arbitrary because they are substantiations that have these. The same substrate that have these metaphorical truths, that have these Jungian architects, archetypes and motifs in them. And we have to figure out which of them are bugs, which of them are features, because they can't all be correct because many of them are mutually exclusive. And then more importantly, we have to figure out whether or not they are applicable to the environments that we're in now, which we simply did not evolve for. We haven't escaped our revolution in its entirety. Nowhere near. We never will. Okay? We will always bear the lowly stamp of our origin, as Charles Darwin put it. However, it's. It's undeniable that the environments that we have today are vastly different to the environments that we evolved in. And we have to be able to recognize that some of our intuitions, some of the motifs that are in our intuitions are going to be today. Chaos, where they were yesterday, order."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":4201.88,"end":4300.2,"speaker":"Jonathan Pageau","text":"I think this is probably where we reach the end of the conversation, because I think that you can't. We are handed something. We are handed a story. We're handed a story from our family, from our nation, from our ancestors. And we live in that story and we live through that story. And I feel like what you're asking me to do is to step outside my story and now look at my story from a position that you're not clear what it is, and then evaluate my story from a position that I'm not sure clear what that position is and why I would like in terms of what goal. And so I think that. I agree, I totally agree that there are some things that, let's say that are not that, say medieval Christians did or that medieval Christians engaged in that are no longer suitable for our world today. But there's an organic reality. There's an organic process which is much closer to how a life deals with problems and expels naturally certain practices and then brings in certain practices naturally. But that has to be done from within the life. And so you can't. So if I'm in a country, I have to be a citizen of a country in order to now decide how to make my country better. If I want to try to remove myself and stand outside and say, well, now we have to decide which country is the best, and then we can decide which country we're going to join. It's like we're being handed a place in the world. We receive it."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":4300.52,"end":4304.84,"speaker":"Stephen Woodford","text":"I think that's a straw man of the position that I'm trying to convey, or I don't mean to."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":4304.84,"end":4305.24,"speaker":"Jonathan Pageau","text":"I'm sorry."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":4305.24,"end":4314.6,"speaker":"Stephen Woodford","text":"No, no, no, no, no. I think more accurately, it may just be a failure of articulation on my part. So I apologize for pushing the straw man first. So I'm just going to try one last time to get this across. All right."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":4314.6,"end":4316,"speaker":"Jonathan Pageau","text":"Probably we should call it after that."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":4316,"end":4410.47,"speaker":"Stephen Woodford","text":"And we'll call it after that and listen to all the comments and do another conversation. If you people feel like, this was fruitful. And I do, by the way, I've really appreciated your time. I really have, Jonathan. I find this fascinating and it was really fun and fruitful conversation for me at least. So I'm not trying to abstract to a point where we completely step out of our psychological evolution and then try and figure out which ones are good or which ones are bad. I'm not, I'm disagreeing with you that Christianity isn't the lowest, it isn't the highest in the hierarchy, or it isn't the lowest in the substrates that we can find. I think Carl Jung's correct. I think Jordan Peterson's correct in the way that he's described it. Where he goes a level deeper than you, he goes, christianity is not arbitrary. And in fact, to have the point that it's not arbitrary, you have to say that it's based on something. What's it based on? It's based on our evolutionary psychology, on our evolution. So you can go back one step further by going back one step further just to that. I'm not trying to go further. I'm not trying to get to this state of rationale, this, this straw man enlightenment vision. I'm not trying to get there. I'm just going to there. And I'm saying that once you get to that point, you can record, just as you recognize that some of the motifs, some of the archetypes, some of the patterns of being maybe incorrect in Islam or communism or whatever it might be, as soon as you drop down to that layer, you're emancipated to be able to say, Christianity has some really good motifs, but. Or has some really good patterns of being. But some of them probably are not correct, and more importantly, some of them are not applicable to the environments and the pressures that we have today. But I'll give you the final word."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":4410.47,"end":4422.23,"speaker":"Jonathan Pageau","text":"You will? Oh, man. I was going to say exactly that. I was going to say, I'll let you have the final word and then maybe say, I'll launch something out there and then maybe it'll open up for the next conversation just before you do."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":4422.47,"end":4432.08,"speaker":"Stephen Woodford","text":"Just so I can definitely say that I've given you last word. Thank you, everybody for listening. I'm going to read all the comments. I'm really interested. Thank you for your time, Jonathan. Go, go, go."}
{"episode_id":"SW - #134 - 2021-01-06 - Rationality Rules - Possibilities and Limits of Metaphorical Truth","start":4432.08,"end":4576.62,"speaker":"Jonathan Pageau","text":"Okay, so the thing I would say is that if there's this idea that, let's say you have the pattern, the stories and everything, and that this is then based on supposedly this idea of our evolutionary psychology, and that this is what gave rise to these other patterns. What I would like to go further and think, where does the evolutionary psychology come from? What is that? Because it's also not arbitrary. We developed based on patterns which seemed. They have to be, if not the patterns of reality, then the only patterns of reality that we have access to. There are no other patterns of reality we have access to. And so then it flips it up like it flips it up and actually puts up up in heaven and creates divine patterns of being which manifest themselves in the world, in stories and in. And in our psych. Our psychological structure, let's say. And so. But it's like now I kind of launched us into a whole. It's a whole other thing. But I appreciate you giving me the last word and I also, I really appreciate this conversation. I do feel like you're really trying to understand what I'm saying and I hope you feel the same. And so. And it'd be good to see what people say in the comment section. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well and on SubscribeStar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
