{"episode_id":"SW - #403 - 2025-08-05 - Why you might want to watch the new Superman movie","start":0.4,"end":1493.85,"speaker":"Jonathan Pageau","text":"Hello, everyone. I went to see the Superman movie. I've been kind of out of the superhero movie stuff for a while now because it was so horrible. And, you know, I heard that this one was different. And because I did like the James Gunn movies in Marvel, figured I'd go see the movie. And I would have to say that I was pleasantly surprised. It wasn't a great movie. It's pretty mid in general in terms of movies, but it definitely wasn't woke. I have to say. It wasn't di. It wasn't. It didn't have all of. All the annoying characteristics and the kind of preachiness that you see in. That you've been seeing in movies now for the past two decades. It was a Superman movie, a basic Superman movie. There was, of course, one trope that was changed, and I'll mention that at the end of the video if you don't want to get spoiled. But I wanted mostly at the outset to look at the symbolism of Superman and to kind of understand the symbolism of Superman, especially in terms of, say, American narrative, you could call it. Or you could also call it something like, again, post World War II, consensus narrative. Of course, Superman comes from before World War II, but there is already that story of the relationship, let's say, between two different types of thinking of the excess of the one and the excess of the many was already there before World War II. It's just that because the Allies are the ones who won During World War II, that story, you know, you could say the Superman story, the. The American story became the trope or became the pattern for most storytelling, at least in the West. And what is that story? This is Jonathan Pedro. Welcome to the symbolic world. Now, the first thing to understand about Superman, just from a conceptual level, I really do believe that it is to understand it as a reaction or as a, let's say, comment on. On the. On Nietzsche's Ubermensch. In some ways, Superman is very much not directly on the. The Ubermensch per se, but on a vision or an interpretation of the Ubermensch as was being developed in ge with the kind of slow rise of fascistic ideas. The Superman character becomes in some ways a reaction to that. To that. Whether conscious or not, it doesn't really matter. It's a different type of Superman. What's the difference between the one Superman and the other? And so Superman is, first of all, was created by two Jewish writers. And in some ways, I do believe that it does reflect, if not their personal experience. But in some ways, the. The reality of the Jewish reality in Europe and the Jewish reality in the world for the past few thousand years, which is in some ways to be a stranger in a strange land. You know, you can also, of course, understand the district, the destruction of Krypton and the exiling of Superman into a strange land. As, you know, the destruction of Jerusalem and the exiling of the Jews into a strange land. And so that is the one thing that is important. But that narrative of the. Let's say the stranger that is exiled and is now living in a strange land gets in some ways tagged on to the very story of the United States as a kind of federation. This idea of a group of diverse people of different peoples that kind of come into a place and decide to make a project together and decide to ally themselves in order to exist together. But this existence together is very much focused on the individual, on individual rights, on difference as a kind of, you know, a kind of power that you can tap into and multiplicity as a power that you can tap into. Now, you know, these narratives aren't completely clean, of course, you understand, There are all kinds of little counter narratives. But if you kind of see it basically, generally as a. As a basic story, that it was especially becoming true in. In 20th century America especially, you know, moving towards the second part of the 20th century with the civil rights movement kind of becoming important and all of these different things happening, The World War II consensus kind of setting itself down. Then the story of Superman crystallizes as really a important story in Americans. America's mythology. Now, what's interesting about the superhero genre itself, and of course, Superman is the first superhero and so represents it very much, is that there's. There are a lot of things butting up against each other. One is, of course, people talk about the superheroes as the gods. That is a very big mistake. The superheroes are not the gods. They're more like demigods. They're more like. They're more like gargoyles, right? They're more like these hybrid figures that. That protect the. The world from danger. And that's why the superheroes look the way they do, right? They're not the ones that participate in the unitary identity of. Of the world. They're always strange in some ways. They always kind of come from the outside. So. So you have. Superman is an alien from another planet. Batman dresses up as an animal in the scary. You have, you know, Martian Manhunter, for goodness sake. You have Wonder Woman who's in Amazon. You know, all of these superheroes. You have this weird sense that in some ways they are more like exterior things coming together, joining in a kind of league in order to defend the world against enemies. So they have much more in common with protector figures in that sense, more. Much more in common with gargoyle type activities than they do with the idea of the gods themselves. So maybe they're like little titular spirits, but like titular spirits in the. Really, in the apotropaic sense, that is, in the sense of something strong and scary that you put on the border in order to stop the. Stop the invaders from coming outside. And in that case, because that's what they are, they also have something in common with that which is from the outside. Right? And so what does Superman protect us against? You see it in Superman 2 especially. He protects us against the. He protects us against the Kryptonians, right? He protects us against things that are similar to where he comes from. You know, the stranger that enters in and then gets joined to the unity of the group is the best tool you have to. In order to fight that which comes from the outside. If you think about how, for example, the Byzantine emperor had a Varangian guard, he had all these Scandinavians that he hired in his service, and they would come to Byzantium and then would owe everything to him, of course, because he's the one who brought them there. And so therefore became very loyal to the emperor and was able to defend the emperor against outer threat and also defend the emperor against people who would be corrupt in his own organization. So this is of course, the model that we're looking at when we're looking at figures like Superman or like the superheroes. In some ways it is the power of the convert, right? The power of the convert who comes into the church from the outside and then becomes a Christian and then has a kind of zeal to defend the church against heresy and to defend the church against people from the outside. And it's the same in some ways with the immigrant who kind of really wants to come in and to join into the. The nation. And once that person has joined, you know, once they've been let in, you could say they owe so much to the people that let them in that now they become. And also because they know about what's on the outside, they kind of come from the outside. They have the power of the outside, if you can say, a kind of strength of the border, a strength of the outside, so they can then turn that strength towards the outer power. There are all kinds of stories like that. There are insane stories that we use in God's dog legends that we used in God's Dog, for example, of Saint Mercurius, who encounters the dog headed men and then he converts these dog headed men to his service. But then when he faces monsters and when he faces enemies, he can kind of turn the dog headed men against the enemies. And so he has these monstrous converts that come in and then they become the best tool to fight on the outside. And so this is what in some ways, Superman represents. And so what makes Superman, though, such a perfect superhero? Why, why is he the perfect superhero? And it is because Superman in some ways is the integrated stranger. He is the fully integrated stranger. He is someone who has, who has this identity from the outside and in this sense also a very powerful identity. One which is kind of a sense of almost like heavenly, royal or scientifically advanced. That's the version you get, of course, in the. Can I say this? That's the 20th century version of that, which is like this highly technically advanced civilization that he's left and that he's kind of brought with him, you could say. And he has all of that power, the power of the, of the outside. But he fully joins to the nation, that is that he submits itself, he submits himself, especially in the early comics of the American way. He, he fights for the country that has adopted him. He also passes for one of the people from, for the people of the nation. So his Clark Kent figure is completely integrated into society. He doesn't stand out. He doesn't, he doesn't, you know, try to go against the grain, try to impose his, his Kryptonian ways on the humans. Rather, he takes on the identity of the people inside and he only manifests, you could say, his strangeness when he is defending the nation or defending his new home from outside attackers or from corruption within. And so because of that, that's why in some ways he becomes the perfect superhero. Because he both has the power of this outside, monstrous, kind of strange, extraterrestrial, alien sense, but then he is also completely devoted to the people that he has joined. And he uses his strength to defend the world against the evils from the outside that are coming to attack it. So that's why in some ways Superman is such a perfect superhero. And it's also, I think, a good image of what America, the United States, and can be if America is properly aligned. Which is to understand that, you know, when more hard right wing people say, you know, America isn't a land of immigrants, it's like, yeah, America is a land of immigrants, folks America, you know, its whole narrative is about people gathering people from the outside and then joining them to the nation in a way that is a melting pot and in a way that brings about the American identity. But that is what gives the strength. That's an aspect of the identity of America that gives it strength, is that it is capable of bringing in a lot of difference and multiplicity. But then it does join it to its. To itself. So what is the power of the immigrant? The power of the immigrant. If the immigrant gives himself to the new identity, you kind of unleash the secret power, right? The secret power of the convert, the secret power of the newcomer that has all this new energy and that once it's joined to the group, then radiates out, right? It's the secret power of the Norman conversion, that when the Normans convert to Christianity, they bring in this new secret power, and then they go out and they, you know, they basically become the. They do the Crusades, because it's this kind of new energy that joins with this world and then radiates out. And so this is one of the important things about Superman. And I think it also speaks in some ways to the. If we come back to Siegel and Shuster, who created Superman, in some ways, it comes back to one of the aspects that has made America so powerful is that one of the things that the United States did is that they welcome the Jewish people that were excluded from all the different nations. And so they said to the Jews that were being. That was being kind of beaten on in. In Russia during the. Around the times of the Russian Revolution, and they said, you can come to America. The same with the. With those in Europe. They're being persecuted. And they said, come to America. And in some ways, the deal was come to America, but it's the same deal as everybody else. Like, put your service in. Put your intelligence, put your capacities, put your. Your strength in service of the nation. And that is one aspect of what has made the United States so great. So for those who have been following, we are about to launch our new Rapunzel book very soon. We were so excited to get this into people's hands that we actually air shipped about a thousand copies. And some people were able to access those 1,000 copies we sold. I think it was 900 copies we had on sale. We sold 900 copies in, like, 26 hours. And so I'm really excited to see how, you know, people reading it and getting the first glimpses. We already have some reviews coming in. We. It was also a way for us to test our new shipping service and our new distribution service. And we couldn't believe it. People were getting their books. Some got it on the same day that they ordered it. Other people's got them one day, two days later. And so we're really happy to see this new distribution system work out. And so we decided that the book is going to be launching explicitly in about a month. But we decided to still do a pre order for those who are interested because I recorded an audiobook version of the wrapunzel book. And we also put together a kind of worksheet to go through the story with your kids, with your family. So we thought we could offer that to those who were willing to pre order the book. Those that already bought the first, very first thousand copies were able to get it. And so we wanted to extend that offer to those who wanted to pre order. And so go to wrapunzelbook.com and get your book. I cannot wait for people to read this because this is where the story gets interesting. This is where the threads are going to start to come together and where the characters are going to start to repeat. So get in on tales from once and ever. This is the third book. We still got a whole bunch coming. We've got three books that are in production right now. And so, yeah, excited. This is the thing that gets me the most excited is this fairy tale project. So thanks everybody, and go get your book. One of the problems that is happening now, and this is in some ways that kind of the. The end of the World War II consensus, or like the. How it's starting to mess with people's minds is, is that if Superman had come and had tried to, let's say, was serving the interest of Krypton while he was in America, and it wasn't clear what his allegiance was, right? Whether his allegiance was to America or to Krypton, then he would never. He could not be the same character. He could not be Superman. He could not have the power that he has. And in some ways, he would be constantly suspect of being a traitor, constantly suspect of serving the interest of something which is from the outside. Now, now I comes to the new Superman movie, which I'm going to spoil for you. So if you haven't seen it yet, you can maybe stop watching the video right now. And so one of the things they do in the new Superman movie is they change one aspect of his origin story. What they do is that when Superman arrives, there's a video with the spaceship and there's a message from his parents that tell him to kind of join to this new country. It's a beautiful new planet, and to join himself with these people. And I think it says to serve these people. But then half of the message is corrupted. And so he only hears the first half. And that's what leads him to become Superman, right? So basically, he serves the people. He has this kind of serves the good of the nation, of the planet where he is. But then in the movie, they figure out a way to decode the last part of the message, and they find out that in the second part of the message, his parents basically say, you're the powerful, they're very weak and so dominate them, rule over them. And then also basically inseminate as many human women as possible in order to kind of repopulate the world with the Kryptonian. The Kryptonian lineage, you know. And so because of that, all of a sudden, now Superman is rightly so in the movie, rightly so suspect of being a kind of a foreign agent. He's suspect of being a foreign influence of all of a sudden, his power becomes dangerous for the. For the United States. Because why is he doing it, right? Is he doing it because he wants to take the strength of America and give it to the Kryptonian lineage, take the strength of America and give it to the Kryptonian power and subjugate that power to himself? I found it to be a very smart move, a very interesting thing to do, because in some ways, what James Gunn does is he says the danger of people coming from the outside is. Is real. Like, it's real if the people that come from the outside and join to your group still have a strong allegiance to the place where they come from. Because in some ways, you're taking the power, right? In Proverbs 5, it talks about the idea that beware the strange woman. Beware the loose woman. Her tongue drips honey, but her feet are down in shale. And it says to beware of her, because what she will do is she will basically take your strength and give it to the stranger. She'll take your identity and she'll dissipate it out into. Into something else which is not you. And so I was really surprised and kind of impressed by the fact that James Gunn dares to make that part of his story. To say that, you know, the Kryptonians can be represented as this invader in some ways, right? The alien invader that tries to take over. But that what happens is that Superman realizes that he finds more value in his adopted home, and that he kind of swears allegiance to his adopted parents, realizes that they're the ones who really gave him his values. They're the ones that have provided for him a home to live. And so he basically switches and then starts to. Instead of playing that message from his Kryptonian parents, he then watches these videos of when he was a child being raised by his very, very American parents. Surprising, again in the movie is that he gives those parents a southern accent. That might seem like a detail, but that is not a detail in American iconography, which is that the Southern accent in American Hollywood iconography is usually to show someone as being stupid or to show someone as being backwards and as being, you know, kind of hick like and, and, and socially regressive. All of these are what are. Is being signaled in American movies and in American media when they show someone with a southern accent, which is why most people that enter into media try to get rid of their Southern accent, which in the movie, of course, Superman does that, you know, so we could. I don't know what that exactly means. But nonetheless, what he ends up doing is he finds he ends up kind of giving his allegiance to his Southern, you know, kind of homegrown parents. And I found that to be a very beautiful thing in some ways. And I thought that. I'm really surprised that gun went in that direction and signaled things in that direction. And so what it does is it shows you, you know, the need for, yes, people that come from the outside, but also, yes, they have to if they want to join a nation or if they want to join, if someone from the outside wants to join your team or your company or your nation, they have to have an allegiance to the reason why they're there. They can't only care for the place where they come from on the outside. And that is in some ways what is happening now. Like all of the madness of so many things that are happening in, in the narrative, you know, several of the wars, but then also the immigration crisis, the United States, the illegal immigration crisis, all of these are this story shaking, which is, you know, how can we integrate things from the outside, you know, without being dissipated, without being completely taken over, and without our strength moving towards outer or foreign interests. So, you know, and if you pay attention, right, all of that, whether it is the way in which people are trying to suggest that, you know, the right wing people are beholden to Russia, or whether it's now people trying to say that America is beholden to Israel, or whether it's trying to say, you know, all of these different narratives, everything about also the problem of, you know, millions of immigrants coming from the southern border are all about how do we both understand America as a nation that integrates people from the outside, but how do we formulate that integration as a true integration and one that serves the interests of the place itself and not give power to the outside? And so Superman, in some ways in his imagery is the best example of that, is a beautiful example of someone who comes from the outside and puts his strength to the service of the place where he is. This is of course, the story also that's kind of playing out in the movie in the series Invincible. You know, surprised to see also this coming into the Superman story. But these are the questions that are important. And, and, but I would say, you know, if you want to watch a movie, I would say go see the Superman movie. It's worth, it's worth in some ways rewarding people, but not going insane. There are still tropes that are annoying in it, of course. The bad guys, Russian, you know, of course, you know, I mean, there are things that are. That are just kind of, kind of tedious in the, in the movie. But I would say most of all, it's just a basic kind of action superhero story that tries to recapture the power of the first superhero in a way that I think is. Is done quite well. And so thanks everybody for your attention. Hope you enjoy this and talk to you very soon. Bye Bye. If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase. So go to thesymbolicworld.com and thank you for your support."}
