{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":0.32,"end":18.16,"speaker":"Jonathan Pageau","text":"I would like to welcome you to episode 16 of the Symbolic World podcast. On this episode, I am playing for you a discussion I had with my brother Matthew on symbolism in the book of Genesis. And this was recorded before Matthew had published his book."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":18.64,"end":20.12,"speaker":"Matthew Pageau","text":"It would be really worth it for."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":20.12,"end":51.44,"speaker":"Jonathan Pageau","text":"All of you to go on Amazon and find his book, the Language of Symbolism in Genesis. And you'll see that we're just touch a little bit on symbolism, some of the issues that he goes into detail in his book. And so enjoy. This is Jonathan Peugeot. Welcome to the Symbolic World."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":62.11,"end":276.54,"speaker":"Matthew Pageau","text":"Okay, hello everybody. So Mathieu and I, we are starting our second conversation for our YouTube channel. And we thought that this time we could talk about the. The problem of self reference and also the idea of how symbolism works as a series of embedded patterns, one in each other, like a kind of fractal structure where the larger structure repeats itself in the smaller structure. And how those two questions, the question of self referentiality and the question of patterns embedding themselves as replicating themselves in embedded structures, how they're related. And to be honest, we're a bit nervous to talk about this because the whole question of self reference and the question of things that refer to themselves is the kind of subject which just when you try to talk about it and when you, even when you try to think about it, turns your brain into a kind of mush where all of a sudden you can't see clearly because of the problem of something trying to look at itself. But it's a really important aspect of symbolism and it's an important aspect of what's happening right now in the world, because this problem of self reference is popping up more and more, even in science and, and in culture. And so it's important to talk about it. So maybe the first thing we can start with is the question of how we mentioned this in our last discussion a little bit. The problem of science as it stands right now is that it approaches the world as if the theory with which it's looking at the world is not part of the universe, but it has to be part of the universe, because I mean, the universe is everything. And so the theory has to somehow be part of the universe. But the question is, how can it be at the same time part of the universe while being the thing that's looking at the universe, trying to understand it. And I think that consciousness really is the key to this, you know, and I think that the reason why, like Jordan Peterson and even people like Sam Harris, they're trying to talk about consciousness and sometimes they struggle to fit all those things together. There's an intuition that consciousness is the key because consciousness is a self referential phenomena. It is the capacity that we have to kind of in one way stand above ourselves and look at ourselves, but at the same time this capacity to look at ourselves is part of ourselves as well. And so, so there's this, there is, it's as if the origin of, of, of consciousness is a self referential loop which then moves out into the world and then becomes a coherent, a coherent, let's say, structure of representation. But it starts in, in this necessarily self referential loop. And that seems to be that self referential loop at the beginning of reason or at the beginning of logic and the beginning of a structured world seems to be the thing that science or that kind of skeptic type people want to avoid. They want to avoid the inevitability of that, of that problem of a self referential loop at the beginning of things."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":278.86,"end":336.24,"speaker":"Matthew Pageau","text":"Yeah, I would say consciousness or I should say self awareness or something like that. Maybe not just consciousness is when you begin to include yourself in your model of the universe. So we make models of the universe. That's what we do on a regular basis. I would say you become a little bit more self aware when you become aware of the fact that there is a theory and there are facts, or there's language and there's facts. And when you get out of the system and you see this, that's one kind of awareness. But then I think there's another level of awareness where you realize that or you identify with not the language, not the theory, but the mediator between the theory and the fact. It's hard to explain, but it's one."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":336.24,"end":494.32,"speaker":"Matthew Pageau","text":"Of the things that seems to be bringing this up. And this has been interesting for me to watch. And I see it with, especially with what Jordan Peterson has been talking about is using biology and using Darwinism as a way to show the problem of this self referential loop. Because when using biology and neuropsychology and Darwinism, you have to realize that our models of the universe, the way we look at the universe has to be part of the process which made us human. It has to be a product of evolution or a product of the manner in which we think or the manner in which we look at the world. You can't. It's like when you used biology or Darwinism as a basis for the science. All of a sudden, you know, even physics has to be a product of evolution. Even mathematics has to be a product of evolution. And so there is enough, it seems like there's enough science, self referential capacity for self reference to be able to give something which looks like the traditional. Yeah. Which looks like the hierarchy of values that we find in the traditional worldview. And so that's been interesting for me to watch because, you know, the way Jordan has been presenting this hierarchy of values isn't exactly the same ontological hierarchy that we find in a traditional representation, but. But there's enough correlation between the two to be able to say, okay, well you know, in the Bible and when we talk about God in heaven and when we talk about angels and when we talk about earth, that's what we're talking about. We're talking about a similar type of structure which is the type of dominance hierarchy as he uses, as Jordan uses that you have in Darwinism and that dominance hierarchy, where let's say our theory of physics would be in that dominance hierarchy and would be, let's say, one of the major tool that human beings has developed to interact with the world. That type of self referential capacity is what gives that the possibility of that hierarchy of values. Like I said, like we're saying, this is stuff is really difficult to think about and difficult to talk about, but it seems like that."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":494.32,"end":496.68,"speaker":"Matthew Pageau","text":"What's funny is, is. I'm sorry, go ahead."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":496.68,"end":497.44,"speaker":"Matthew Pageau","text":"No, go ahead, go ahead."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":497.44,"end":560.16,"speaker":"Matthew Pageau","text":"Yeah, I was just gonna say when you think in, within traditional terms, as in a traditional cosmology, it's not a complicated subject at all. Yeah, it's the most obvious thing. But when you try to think of it with a lens of science materialism, then it becomes a really complicated thing because you're trying to, let's say, find some kind of agreement between the traditional cosmology and the materialistic one. So that's what's difficult. It's trying to reconcile those two perspectives really. Because. Because when you begin to think in a traditional way, it's not a complicated thing at all. The idea of self reference and the notion that the universe is a fractal is one of the first things that you encounter because it's a natural thing. I mean, symbols are usually fractals."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":561.36,"end":567.82,"speaker":"Matthew Pageau","text":"Okay, so maybe instead of trying. Because maybe instead of trying to break through the scientists."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":567.82,"end":568.74,"speaker":"Matthew Pageau","text":"Yeah, I don't think that's going to happen."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":568.74,"end":611.24,"speaker":"Matthew Pageau","text":"I don't think it's going to happen. In this conversation at least we've exposed the problem. But I think maybe by giving a few examples from the traditional point of view, giving a few examples from the Bible might be the best way for people to see how this works and how it elucidates not only the Bible, but it also elucidates our experience of the world. So I don't know if you want to talk about. I know that in your book, one of the major structures that you elucidate is the relationship between the cosmic shape and the shape of the human being and how those two are images of each other. So maybe you can go a little bit into that, knowing people will be able to get all the details when your book is out. But maybe you can explain a little bit of how that would work."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":612.36,"end":649.05,"speaker":"Matthew Pageau","text":"Yeah, okay, I can try. It's a difficult thing because almost all of the concepts that we use today are not the same as the ancient concepts. So it's always difficult to talk about symbolism. I'm still going to try, but it's always difficult because we always assume that we know the meaning of words, and we do, but it just happens to be not the same as the ancient meaning. So when I talk about these things, I'll try to. If I realize that the words that I'm using, using them in an ancient way, then I'll try. Or if you see that I'm doing that, maybe you can."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":649.29,"end":680.16,"speaker":"Matthew Pageau","text":"But one of the things you can do is at least aesthetically, let's say, like. At least in terms of the actual terms of the story, you can show the parallels in the terms of the story so that people can see that there's clearly a relationship of structure. And then once we show that, then after that, we can try to explain, let's say, the deeper meanings of those concepts. But at least people don't even see the actual pattern. Like, they struggle to even see the pattern. So at least once they see the pattern, we can then try to explain it."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":680.64,"end":796.07,"speaker":"Matthew Pageau","text":"Okay? So the most. The easiest to understand, I would say the microcosm that's easiest to understand is the one you just said which relates an individual to the entire universe. And when we say that, we're talking about the cosmos that's in the Bible, okay? Not the materialistic one that we have today, the mechanistic one. We're talking about the universe as described in traditional cosmology, where you have heaven and earth and you have a mediator, which is man. When you look at it like that, and when you understand the idea that earth means factual reality, physical reality, and heaven means ideas or theories or principles that are not manifest or that are not concrete or practical, something like that, then you can start to see that individual human Beings, their shape is the same as that cosmos. And it's actually pretty obvious we no longer see it that much because we no longer see the cosmos in the ancient way. So we're not used to seeing those connections. But when you do, then you realize that an individual has a mind and a body. The mind is the equivalent of heaven and the body is the equivalent of earth. And in the Bible, it's pretty clear when God creates Adam. And by the way, Adam means humanity. So that I think that's important to mention because that's just another example of different. That the Bible can be interpreted at different scales. Because the word Adam means an individual, a human. It's the name of an individual, but it also means humanity at large itself."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":796.07,"end":798.51,"speaker":"Matthew Pageau","text":"Right. It means man itself. Yeah."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":798.51,"end":815.8,"speaker":"Matthew Pageau","text":"So humanity, something like that. So whenever there's, in the Bible, it talks about Adam. In the story of Adam and Eve, it's talking about humanity at large, and it's also talking about an individual. So that's something to be aware of. It's just an example of microcosm."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":817,"end":855.93,"speaker":"Matthew Pageau","text":"That example you gave itself is an example of how it's using a particular image, a particular, let's say, story of a man to be the microcosm of. Of humanity. And so even in the story itself, it's built to be that way. And then the shape of man, let's say at the beginning of Genesis, when God creates heaven and earth, it says God created heaven and earth. The earth was chaos and void, and the spirit of God was above the waters. And so you have this idea of spirit and spirit is wind or breath."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":857.63,"end":865.55,"speaker":"Matthew Pageau","text":"That's also important to say when it says the word spirit, it means wind. It also means breath because breath is wind."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":865.71,"end":866.11,"speaker":"Matthew Pageau","text":"Right."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":866.27,"end":867.79,"speaker":"Matthew Pageau","text":"There's no difference between the two."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":868.11,"end":872.51,"speaker":"Matthew Pageau","text":"Like what you said in the last video, it's not a metaphor. Breath is wind. Breath is actually wind."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":872.51,"end":914.42,"speaker":"Matthew Pageau","text":"And so, and the only difference which is important, that's another example of a word that we have to sort of redefine. The word spirit, breath, soul, all those words, they refer to the breath. It means breath. And right away, if you understand that, you can see the relationship with heaven. And in the story it says God formed Adam from the dust of the earth and blew into his nostrils the breath of life. So right there you can see that it's all about joining heaven and earth. So the breath comes from heaven and the. And he raises some earth, and then that's man. Yeah. And that's made from that union."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":914.42,"end":961.79,"speaker":"Matthew Pageau","text":"And. And it's exactly. When you talk about the mediator, then it shows exactly that, that man is the mediator. Because in the beginning, these two things are completely separate. You have. You have heaven and spirit and breath and wind above, and then you have this chaotic, formless earth at the bottom. And those two things don't look, say they don't touch each other. They're separate. And then there's the creation of the different strats of creation. The heavens and then the grass, and then it comes closer and closer and closer until you reach the human being. And then the human being has the heaven enter into the earth and joins with the earth. So that quite explicitly in the story, man is."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":961.79,"end":963.87,"speaker":"Matthew Pageau","text":"That is a microcosm of heaven and."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":963.87,"end":1004.26,"speaker":"Matthew Pageau","text":"Earth, but also the mediator, because he joins them together. He's not just a representation of that separation, but actually a representation of that union. And then within man there's another microcosm which is the separation of man and woman, which represents again, heaven and earth, which are separated. You know, man being heaven and woman being earth, but then united at the same time. So like, then that keeps, you know, it's like these microcosm keep embedding themselves into each other to create this fractal structure that we're talking about. The Bible is just full of those. Those fractal like structures."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":1005.7,"end":1044.68,"speaker":"Matthew Pageau","text":"Oh, yeah. I just wanted to say something about also again, the concept of breath. Maybe just talk a little bit about that. Because it's also important to understand the connection, if you want to think in that way, where the breath is related to the mind, the breath is related to the intellect. That's something we don't really. We don't really see things like that anymore. But it's a pretty obvious thing actually, that your breath and your intellect are related. Because if you stop breathing, I mean, I wouldn't recommend this, but stop breathing for 20 minutes, you lose consciousness."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":1045.64,"end":1047.24,"speaker":"Matthew Pageau","text":"Yeah, less than 20 minutes."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":1047.48,"end":1048.92,"speaker":"Matthew Pageau","text":"Yeah, I know, but I was making."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":1048.92,"end":1051.64,"speaker":"Matthew Pageau","text":"Sure that you're unconscious."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":1051.8,"end":1059.96,"speaker":"Matthew Pageau","text":"Yeah, so. So there's a clear connection between breath and consciousness, consciousness and intellect, and, and things of that nature."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":1059.96,"end":1070.9,"speaker":"Matthew Pageau","text":"You remember when we were kids, people would play that game where they would choke someone. That's a bad game. But people would like choke someone until they actually passed out. It was like a very disturbing game that people played."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":1071.14,"end":1090.3,"speaker":"Matthew Pageau","text":"But there's also the idea. I just wanted to say that the idea is there is an obvious connection between heaven, air, wind, breath, intellect that we don't necessarily see anymore. But when you read the Bible, you have to understand these connections in order to understand most of the stories in the Bible."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":1090.3,"end":1140.55,"speaker":"Matthew Pageau","text":"Yeah. And also one of the connections between breath and intellectual is through the idea of word or logos. Yeah. Because speaking is the manifestation of intellect, and speaking is. Words are pushed by this breath. So the breath pushes out the sounds. And so there's an obvious relationship between the manifestation of intellect and breath. And you see that in the story of Genesis itself. Again, we. When God speaks in order to separate the things of the world, God speaks. And so you have to kind of almost see this image of this breath that is above the earth. And then it becomes the vehicle for God's intellect to manifest itself and create the world."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":1140.71,"end":1182.43,"speaker":"Matthew Pageau","text":"And importantly, the first words that come out of God's mouth are, let there be light. Okay. So it says the breath of God or the spirit of God, or the wind of God hovered over the waters. And then God said, with that breath, let there be light. So the light is, in ancient cosmology is meaning. It represents the intellect, the meaning, the principle, the idea. So that which gives meaning to other things, that which defines things, It's. It's the logos, it's the word, it's reason, it's logic, things of that nature."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":1182.43,"end":1237.12,"speaker":"Matthew Pageau","text":"Yeah. There's this verse. I think it's Christ who actually says that, who says the eye is the light of the body. And I remember you always read. Boring. These annoying materialists who just see that as a kind of. A kind of misunderstanding of science, once again failing to realize that people were just. Weren't materialist 2000 years ago to see it. Rather, in that sense, that when you take into account the consciousness in the scope of how the world exists, if you take into account the fact that consciousness mediates between the potentiality of the world and then the capacity for that world to have sense and have meaning, then the idea that the eye is the light is the lamp of the world makes total sense. Because when we look at."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":1237.12,"end":1242.64,"speaker":"Matthew Pageau","text":"Because light is not. Light is meaning. In ancient cosmology, light to look at."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":1242.64,"end":1269.11,"speaker":"Matthew Pageau","text":"Something is to separate it from the potentiality and to define it. To define it. Yeah, to make it into a concrete. Not to make it, but to participate in its appearance as a concrete thing. Because, I mean, you could separate it into. Into atoms and atoms and neutron whatever and subatomic particles, but we don't. It's focused, it's coherent. And that the human consciousness is part of that emergent phenomena."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":1269.75,"end":1295.02,"speaker":"Matthew Pageau","text":"Yeah. So I think that's another. Yet another example of how we have to redefine words. Because the definition of light today is again, a materialistic definition. But in the past, in ancient cosmology, it was not the same at all. So it's extremely important to re understand the meaning of light in a traditional cosmology when reading the Bible."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":1295.02,"end":1349.78,"speaker":"Matthew Pageau","text":"Once again, it's not hard to do that because all you have to do is to understand it in terms of phenomenology, in terms of how the phenomena, how we interact with that phenomena. I mean, light is that which makes things visible. That's what light is. It isn't in a human experience. Light is not a wave or a particle or like, you know, the speed of light is. All those things are not important in the way we interact with it in our everyday life. Light is that which makes things appear. Like it makes them visible. It turns. Like if you walk into a dark room in the absolute darkness, you're going to bump into things, you're going to. You're going to not know what's there. You could die, you could fall into a hole. Anything could happen. But when the light goes on, then all of a sudden things become clear and things become separate. Things become unified and defined."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":1349.78,"end":1350.46,"speaker":"Matthew Pageau","text":"Well defined."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":1350.54,"end":1358.94,"speaker":"Matthew Pageau","text":"Well defined in your experience. And so. And that's what light is. That's why also why, like you said, that's why the first thing God creates is light. Because it's that."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":1359.18,"end":1405,"speaker":"Matthew Pageau","text":"It's that possibility synonymous with speaking, with word, with language. Yeah. And so, yeah, I was thinking an example again of that. Man is a mediator between heaven and earth. So when God asks Adam to name the animals, that's a perfect example of being a mediator between heaven and earth. Because then what Adam has to do is take an abstract idea that he has and then bring it into concrete manifestation. So he names the animals according to certain ideas that he has. That's the idea. So he's like embodied. He's seeing his ideas embodied in certain beings in the world, and he's giving that identity to those animals."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":1405.08,"end":1447.32,"speaker":"Matthew Pageau","text":"Yes. And it's important to see because this is one thing that people are struggle with, is that the idea. When you say he has these ideas about the world, people right away think, oh, it's relativity, subjectivity. It's like, no, that's not it. Because he is a mediator between heaven and earth. The connection between the idea and the phenomena that is appearing before him is a unitive and a real thing. Like it's actually the thing itself. Like it's the capacity to participate in the thing itself as well. It's not just like he has this. He has a fantasy or, or whatever. Right."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":1447.32,"end":1448.84,"speaker":"Matthew Pageau","text":"It's not just a whim."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":1448.92,"end":1450.44,"speaker":"Matthew Pageau","text":"Right, right."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":1450.6,"end":1454.68,"speaker":"Matthew Pageau","text":"It's based on. It's based on his reason. It's based on his intellect."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":1455.64,"end":1509.74,"speaker":"Matthew Pageau","text":"But his intellect, he is the connection between heaven and earth. So he's. He is the point where that those phenomena that he is encountering actually connects with their meaning. Like, it's not. It's not in a way, like he doesn't have a choice, like the way we think of choice today in naming the animals. He sees the light of his eye like the. The and his word come together and participate in the being of that. Of that thing that's in front of. In front of him. It's hard to think about in such kind of direct way because we, you know, our experience of the world is more. Is more, let's say deluded, let's say. But we have to understand that the story in Genesis, Adam represents man as such in a. In a kind of pure, let's say, untrammeled way. Let's say before the Fall, we would say in Christian terms."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":1513.9,"end":1519.34,"speaker":"Matthew Pageau","text":"So. Yeah, and it's related. The idea of the Fall is related to losing that capacity."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":1519.75,"end":1520.07,"speaker":"Matthew Pageau","text":"Yeah."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":1520.07,"end":1533.99,"speaker":"Matthew Pageau","text":"So losing the capacity of correctly naming the animals or correctly perceiving the world according to its spiritual meaning. So, yeah. So we can't imagine what that means, obviously."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":1534.39,"end":1573.15,"speaker":"Matthew Pageau","text":"And in the Bible, that image is there in the story because when Adam and Eve are chased from the garden, the consequences that God gives to Adam and Eve are that, like the idea that Adam will have to work the ground and the idea also that there will be thorns is this notion that it's as if the earth is revolting against Adam's mediating principle, or else he's losing his capacity to be a natural mediator. And so he has to supplement that state with effort. Like he has to. He has to be careful because."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":1574.91,"end":1575.23,"speaker":"Matthew Pageau","text":"The."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":1575.23,"end":1587.23,"speaker":"Matthew Pageau","text":"Potential, the world, let's say the created role, becomes dangerous for him. And so he has to fight it off in some ways and he has to hold it at bay so that he can continue to play that role as mediator."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":1587.23,"end":1653.6,"speaker":"Matthew Pageau","text":"Yeah, well, yeah, the idea is that. Well, this will give us other examples of microcosm in the Bible as well. The idea is that after the fall, humanity has to correct or fix certain things artificially in order for the meaning and the fact to match correctly. So, for example, there's a lot of examples in the Bible, like you said, working the ground in the garden, Adam naturally gets food. But this is. See, now, if we want to talk about these things, we have to again define a Lot of terms, but that's another example of being a mediator between heaven and earth. Humans eat food, okay? Food comes from the earth. We eat it, it becomes our body. So it's kind of a reproduction of what I said before. When God created Adam, he formed him from the earth. Well, each time we eat, we're doing that in a way."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":1653.6,"end":1656.6,"speaker":"Matthew Pageau","text":"We're gathering the earth into ourselves, to."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":1656.6,"end":1761.38,"speaker":"Matthew Pageau","text":"Ourselves, in a way that works. Because we can't just eat soil, obviously. We have to arrange the matter in a way that it will be able to host our intellect, our patterns, our ideas. So you eat certain foods that can host your mind. That's the idea. Your spirit. So not all matter can do that. And the idea is that in the garden, there was a natural way in which this happened with the fruits of a tree. And then once we lost that, then we had to fix things so that they could host meaning. So the greatest example of that is the idea of building the temple. So why do they have to build the temple? Because they have to artificially join heaven and earth. It doesn't happen in a natural way anymore because of the fall. So now we have to arrange the facts in a way artificially so that they're able to host the identity, the breath, the spirit of God. It becomes like a body for God. Similarly, when we eat food ourselves, we have to arrange it. We cook it, we fix it. We don't eat raw meat, for example, because if we do, we might get sick. Getting sick means that it doesn't host our spirit correctly. That's what it means. So when you cook food and you arrange it in a way that it becomes edible, it's kind of the same thing as building a temple. It means you're arranging certain facts so that they can artificially host your spirit, your mind."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":1761.46,"end":1801.32,"speaker":"Matthew Pageau","text":"Yeah, and there's like. And there's a grand pattern in the Bible, like the grand story, which is. Which kind of embeds all these things together. And this idea is that you have this garden at the beginning, and then the fall, we move away from the garden. We keep moving further and further away from the garden. And as we move further and further away from the garden, we have to supplement that fall with artificial, like clothing, then agriculture, then cities, et cetera, et cetera. And in a way, it's like. It's straight. It's like a moving away from the garden. But it's also a way to preserve the possibility of being mediator in heaven and earth."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":1801.48,"end":1803.32,"speaker":"Matthew Pageau","text":"And to preserve the. Yeah, exactly."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":1803.32,"end":1854.19,"speaker":"Matthew Pageau","text":"Then at the very, very end, of the whole story, this idea of this new Jerusalem that comes down from heaven, we have this idea of that. The final, let's say, manifestation of this whole big, big, big, big, big pattern is a giant city. Right. So a perfect city, let's say, which. Which is the full supplemental thing with in the center, the garden with the tree in the middle, in the garden in the middle, and then the whole center. So it's like there's this whole process, this whole story in the Bible, and at the end, there's an image of the final result of it, which. Which kind of re. Encapsulates the whole story, let's say. So it's like that's also an example of how these patterns, like, they embed themselves in each other. And then finally there's this final image of this giant pattern of how the world exists. Yeah."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":1854.27,"end":1922.78,"speaker":"Matthew Pageau","text":"So here's another example of microcosm, which is related to what we just said. So the idea of nakedness in the Bible, the idea of being either naked or dressed is also an example of a concept that applies to different scales of reality. So when we say in the Bible, when it says naked, it's a very deep concept, but we can talk about it a little bit. I don't think I'll be able to reach all of the implications here, but the idea is naked means natural. That's what it means. But that has a whole lot of implications in the Bible. So things are natural. When you say they're naked, it means they're in their natural state. But if you think about this ancient cosmology, what was the most natural state is the first day of creation. Before creation is this world covered with water. That's what the most natural thing in that cosmology is, the flooded world. This is a little bit strange. We're not used to thinking like that at all."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":1922.78,"end":1925.7,"speaker":"Matthew Pageau","text":"That's tough for people to get it. But it's important. It's really important."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":1925.7,"end":1990.09,"speaker":"Matthew Pageau","text":"Yeah, it's important because with that idea, you can understand a lot of the symbolism in the Bible. So the most natural state is this state of cyclical reality, which is the first day of creation, where everything is fluid. And. And that goes with the idea that things haven't been differentiated yet. Right. Everything is connected in a fluid way. Things aren't distinct. So when it talks about being naked, it's related to that idea. So this is why, also in the story of Adam and Eve, it says the snake was the most shrewd beast of the field. But the word shrewd, naked means naked. Okay. But then when you understand the idea that naked in the Bible refers to the most natural state, then you can understand why the snake is naked. Okay. Because the snake is like this fluid being. He's like the water at the beginning. Naked means natural. It's like the most primitive state. Now, there's nothing wrong with nakedness until the fall."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":1990.41,"end":1990.97,"speaker":"Matthew Pageau","text":"Yeah."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":1991.29,"end":2028.23,"speaker":"Matthew Pageau","text":"Because things were naturally mediated correctly. That's the idea of the fall. And then when there's the fall, it means Adam and Eve tried to eat something they couldn't handle. That means they tried to take facts into their. Include facts that they didn't know what to name, how to explain with their theories. That's really what it means. So when you eat something that you can't handle, that's the miniature version of a bigger picture where you see things that you don't know how to name, you can't name, you can't identify. Yeah."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":2028.23,"end":2037.63,"speaker":"Matthew Pageau","text":"And that has something to do. I mean, Jordan Peterson is always talking about this kind of entry into chaos where, you know, you face something which disrupts you."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":2037.63,"end":2037.83,"speaker":"Matthew Pageau","text":"What?"}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":2037.83,"end":2070.83,"speaker":"Matthew Pageau","text":"You know, it's like. And all of a sudden you, you don't know. Like, he talks often about this idea that, you know, you find out that your spouse has been cheating on you for 10 years. And so that, that, that, that, like that hitting of a fact or something that you can't handle, you know, throws your whole world up into upheaval. And it's like everything is on the verge of falling apart. And so then you have to, you have to work at putting things together. Like, you have to. It's like it needs the work to bring things back."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":2072.03,"end":2089.16,"speaker":"Matthew Pageau","text":"Exactly. You have to fix things, make them fit your mind again. Make them fit your plans. Let's say you have plans. Something happens that isn't part of your plan and you don't know what to do with, makes you wander. Yeah."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":2089.16,"end":2111.23,"speaker":"Matthew Pageau","text":"It could be anything. Your car breaks down, you're driving on a trip, your car breaks down. All of a sudden you have to change your plans. If you don't, you're going to wander and be in absolute chaos. You have to work to rearrange things so that it can fit what you want, what you're trying to do, or that it can lead to something that isn't just absolute nothingness. Right."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":2111.71,"end":2178.53,"speaker":"Matthew Pageau","text":"Yeah. So the idea of nakedness and dressed, it has a cosmic meaning and it has an individual meaning. So the idea is that things are either in a natural state or they're artificially fixed to make them work, to make them to make your theories match the facts. So this happens at the individual level. I mean, you have an idea, have a plan, but maybe your body, your passions or whatever don't cooperate. Yeah. So you want to do something, but let's say you're lazy. That's your body telling you, no, sorry, I don't agree with your plans. I'm not gonna follow along. So you have to force, artificially force yourself to do certain things. So that's what it means to be dressed in the Bible. And clothing itself is an example of that. So again, it's not about having metaphors. The idea of clothing, that's what clothing is for. Ultimately. It's to correct your passions. It's to give your head, your mind."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":2179.09,"end":2179.49,"speaker":"Jonathan Pageau","text":"Your."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":2181.49,"end":2184.97,"speaker":"Matthew Pageau","text":"Things that have a purpose, to give them dominance over your body."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":2185.21,"end":2199.85,"speaker":"Matthew Pageau","text":"Yeah, yeah. Because you know, you're cold. So that's an example. Let's say you're cold and so you wear clothing so that you're not cold. Also you, if, let's say you. Everybody was naked and all of a sudden, you know, your desires would be."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":2200.01,"end":2201.25,"speaker":"Matthew Pageau","text":"There would be problems, would be."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":2201.25,"end":2215.54,"speaker":"Matthew Pageau","text":"Always be away, awakened. And so to clothe them is to be able to manage those desires so that you can do something else besides being completely taken over by those, by those, by those types of thoughts and such. Yeah."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":2215.54,"end":2292.24,"speaker":"Matthew Pageau","text":"So here's another example of again of seeing it as at different scales. So you can say, for example, so clothing, when it talks about dressing in the Bible, another example, if you look at it, a slightly bigger scale. So at a social scale, let's say at the scale of a society. Well, you have the same idea. You have some individuals that are the head of that society. They're the leaders. They make the laws. They, they make sure that the laws are followed. And then you have a population. So the idea is, in order, dressing, Dressing this society would mean making laws and forcing people to follow the laws. Like jail, for example, is an example of clothing, but not at the scale of the individual, at the scale of a society. So you make some laws. People don't naturally follow those laws necessarily. So what do you have to do? You have to fix the population so that it follows your laws. So when you put people in jail, that is the equivalent of dressing yourself."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":2292.24,"end":2294.32,"speaker":"Matthew Pageau","text":"Right. Extreme version of dressing."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":2294.32,"end":2298.4,"speaker":"Matthew Pageau","text":"Yeah, well, it's, it's. Yeah, it's only extreme because it's a."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":2298.4,"end":2300.24,"speaker":"Matthew Pageau","text":"Bigger scale social level. Right."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":2300.24,"end":2367.56,"speaker":"Matthew Pageau","text":"You look at it at a bigger scale, it always, it's always more extreme. I mean, if we, if we, if we were at the scale of our body parts. And we saw that what dressing did, we would probably find it extreme, but we're not. So. So now here's an example, here's another example also of different scales. So these are very complicated subjects, but we're going to try anyway. So at the individual scale, we're talking about eating before taking in matter into your body. So that same concept exists at a slightly bigger scale, which is the scale of a society, A society or a civilization eats. But what does it eat? It eats people. It looks crazy to say it doesn't literally eat people with the teeth, but the society is a being and it integrates more individuals. So when somebody is integrated into a society, that's a larger scale version of an individual eating food. And that's very important in the Bible."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":2367.56,"end":2385.08,"speaker":"Matthew Pageau","text":"And the way it eats people. People, let's say, to not make it sound crazy, is that it integrates their work, it integrates their businesses, it integrates their tax money, it integrates, you know, their children, and it also makes them. It makes those."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":2385.08,"end":2386.2,"speaker":"Matthew Pageau","text":"Gives them an identity."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":2386.2,"end":2413.06,"speaker":"Matthew Pageau","text":"Yeah, and gives them. Exactly, that's what I was going to say. Participate in the identity of the city or of the nation or of the group, whatever that is it gives them. It says, you're part of. Of this group and your exchange, like your trade for that, that you give me your strength, your work, your services, so that we all participate in this unity. Like this unity. So, yeah, it's a perfect example of that appearing at different scales."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":2413.22,"end":2501.07,"speaker":"Matthew Pageau","text":"And it's actually exactly the same thing that we do when we eat food, because food is matter, we eat it, it becomes our body. What does that mean, become our body? It means now you will follow the laws of this being. The laws. So my hand used to be a sandwich. It's not a metaphor. I mean, I ate a sandwich, it became my flesh. Now this flesh follows the instructions of my head, it follows the laws, it follows my identity. It doesn't follow only its natural state anymore. Again, there is no metaphor in there at all. So at a bigger scale, individuals are eaten by a society. It means they're integrated into that body on the condition that they follow the laws of that society. They follow the rules. So that's like the sandwich becoming my flesh and following the laws of my head. It's just at a slightly bigger scale. So what does it mean to dress the body at the individual level? It means put clothing on, but it also means to force my body to some degree to do certain things that it naturally wouldn't. Because like I Said you could either be lazy or you could have too much energy or something like that and you have to restrain yourself. So in a society, same thing, there are certain rules that are there just to restrain artificially make the body coherent."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":2501.87,"end":2627.6,"speaker":"Matthew Pageau","text":"Yeah, I think that if we try to come back slightly to our beginning point, which was talking a little bit about, let's say, the way the place where thought is today and the questions that scientists and those types of thinkers are asking themselves, I think that we can come to this notion of this concept of emergence, which has been kind of a buzzword for the past ten years or whatever. I don't remember exactly when it started, but it's idea that these patterned beings appear at different levels of manifestation, like an individual, a city than the cosmos and planetary systems and all that. That in fact, and the struggle scientist types have in accounting for that jump in different levels of manifestation. Well, I think that we can say that the key is consciousness, like it has to be consciousness. And that taking into account the self referential loop at the beginning, the self referential loop of self awareness and consciousness, including the fact that we are the ones looking at these phenomena into the system, is going to be the only way to get out of this dilemma. One of the things that I want to do in these YouTube channels, and hopefully we can do it together as well, is maybe sometimes take particular stories or particular laws in the Bible and, and then just show people how that fractal structure of symbolism, how these patterns embed themselves in each other and how really almost all, like let's say all of them even are just a repetition of that very first story in Genesis, of the creation story, where heaven and earth are separate and then united in the human being. That all the stories are just kind of these repetitions of the same pattern in different ways, different scales with different variables, but just kind of repeat the same and fit into each other."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":2628.16,"end":2640.2,"speaker":"Matthew Pageau","text":"Yeah, the story of the Garden of Eden is the ultimate pattern of everything. It's meant to explain everything. Well, there isn't the solution to the. It's meant to explain the problem that we're in."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":2640.2,"end":2645.6,"speaker":"Matthew Pageau","text":"Well, I would say the solution is probably if it's Christ. I think that solution is the story of Christ."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":2645.6,"end":2647.76,"speaker":"Matthew Pageau","text":"It's not in the story of Adam and Eve. That's what I'm saying."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":2647.76,"end":2715.11,"speaker":"Matthew Pageau","text":"Yeah, we'll get there at some point, start talking about how the story of Christ is like almost is this answer, like constant answer to the dilemmas and the openings that are proposed in Genesis, how his story kind of unites Everything together, let's say. But we need to kind of move through it slowly so that people can understand it when we talk about it. Okay, well, I think that we've got some good stuff. And so this is what we have until your book is ready and people can dive into it in more detail. And so, yeah, so we'll talk more and see if there's other examples that we can bring up and maybe go into certain stories together. One of the things I'd like to do maybe in the future with you is I wanted to talk about the story of Tamar, which you talked about in the video with Jordan Peterson, because I think a lot of people, I think that that story is really difficult, but I think that if you can understand that story, you can understand a lot of things that are happening right now in our society. So it'd be interesting to talk about."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":2715.35,"end":2731.59,"speaker":"Matthew Pageau","text":"Yeah, it's often a question of redefining the terms again. That's why it's so difficult to talk about symbolism today. Things that used to be absolutely obvious in the past have become extremely difficult to understand today because we don't have the same perspective at all."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":2733.27,"end":2756.33,"speaker":"Matthew Pageau","text":"Luckily, we still have our everyday experience which we can use as a base for understanding symbolism. So hopefully we can get people to get back into the more primordial experience of their body and their everyday life, which is a good way to start, at least. Alright, so everybody will see you very soon. Bye Bye."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":2757.45,"end":2761.49,"speaker":"Jonathan Pageau","text":"If you enjoyed this content and our exploration of symbolism, get involved."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":2761.49,"end":2762.81,"speaker":"Matthew Pageau","text":"I love to read your comments in."}
{"episode_id":"SW - #016 - 2018-09-19 - Symbolism In The Book Of Genesis - With Matthieu Pageau","start":2762.81,"end":2774.16,"speaker":"Jonathan Pageau","text":"The comments section below. Please go ahead and share this on social media to all your friends and also please consider supporting us financially on Patreon. You'll find the link to the Patreon page in the description below."}
