{"episode_id":"SW - #127 - 2020-12-02 - Understanding Kanye West on Joe Rogan","start":0.72,"end":1095.71,"speaker":"Jonathan Pageau","text":"So this past weekend, we saw drop the interview between Joe Rogan and Kanye West. It was exactly what I expected. And it would be impossible to really dissect what he said and, you know, everything that was said in that interview, because it was. It was truly a kind of, let's say, a kind of madness of words and of images that, although at the first glimpse, looks like it was all over the place and kind of wild, but when you look at it from a bird's eye view, all of a sudden patterns appear and you start to see what exactly was going on. And so that's mostly what I'm going to try to do, is try to take a bird's eye view of what happened during that interview, try to see how he is really manifesting the manner in which a kind of folly or a kind of embodiment of the fool has the capacity to flip things around and to bring back a kind of balance. This is Jonathan Peugeot. Welcome to the symbolic world. So yesterday on social media, I posted a quote, and I said, quote, beauty will save the world, unquote, Kanye west on Joe Rogan in 2020. Now, of course, Kanye west did not say that during the interview directly, but there was an interesting process during the entire interview, which was that Kanye west would say things for like, 15 minutes and would draw these analogies and would talk at different levels and would bring about different examples. And then Joe Rogan would, in one sentence or in like, two sentences would say, yeah, this. You know, this is what you're trying to say. And Kanye would look at him and go, yeah, of course. And so ultimately, I would say that if we could resume, everything that Kanye west said in his interview was, was that. And of course, that quote is a kind of misquote taken from Dostoyevsky, from the. The Idiot in which the. The Prince Mishkin, who is the idiot in this, that story is asked, is it true that you said that beauty can save the world, that beauty will redeem the world? And the Prince doesn't answer. But this, of course, has become a trope in kind of orthodox culture to talk about how beauty will save the world. Often people don't understand what it means, but in this context, in the context of Kanye, I think we can understand what it means or what it could mean, let's say. And so if we had to synthesize what Kanye basically was doing during that interview, he would circumambulate around a point, and so Joe Rogan would ask a question, and then Kanye would, instead of answering the question directly would start to give different analogies at different levels. And this is how we see the manner in which kind of how Kanye west has something of a symbolic perception or has symbolic intuition, which is that he understands the world analogically. He understands that once you have tapped into a certain pattern of being, then it doesn't matter what you apply it to. You know, no matter what you apply it to, then it's going to work because you've actually tapped into a true pattern of being. And if you had to resume everything that Kanye was saying, it's. That seems to be what he was saying. And so a great example in the interview is when Joe Rogan asks him, if you were the president, what would you do differently? What would you do differently? And his example that he gives is he said, I would redesign those suits. That is, he watched the debate between Donald Trump and Joe Biden, and he really didn't like the way they were dressed. And so he was saying, I would redesign the suit. Kanye west, what I understand is that he even redesigned the room in Joe Rogan's studio where he was speaking before he gave the talk. And so this is really the understanding when I say beauty will save the world. The way that Kanye sees the world is through design. That is, he understands it not so much, first of all, as moral questions or moral quandary, but actually a manifestation of pattern and a man a manifestation of analogy between different realities. And so for him, redesigning a suit is the same as redesigning a state. And so it was really fascinating because every time Joe Rogan would ask him about something in politics, he would say, this is what I did in music. The way that I write music or that I design shoes is the manner in which I would be president. And at first glance, you would think, how insane is that? And there is a kind of craziness to the way that he was talking, but deep inside, there was also these amazing nuggets of truth that would come out as he was speaking. And so as he's riffing on fluoride, and, you know, the example was just amazing at the example that all the different levels that he kept bringing. Bringing about. But you could see that he had this really, the symbolic intuition, because at some point, he talked about how he said, we are in the movie, we are in the story, we are in the video game life is the real story. That is, the way that art manifests itself is not actually entertainment. And this is something I've been hounding at you guys forever. It is participative, and this is what I've been telling you that Kanye West's intuition has been moving towards. This is why he's also created these Sunday services. While he's. Why he's interested in design, while why he's interested in technology, why he's interested in creating sustainable communities. He talked about making a monastery, he talked about all these things that he's involved in is because he basically understands art as participative. He understands that art is creating frames in which we exist. And if you create analogies, so if you redesign the suit, it will actually affect the way that people behave. And of course, we know that's true. When he says it right away, when he says, I would redesign the suits, you'd think, wow, I can't believe he gives that example. But intuitively, we understand that, you know, if. If you could give extreme examples, like if the. The presidential candidates came out during the debate, you know, wearing chains and spikes and, you know, had dyed their hair, then no one would take them seriously. And so the idea that there isn't an analogy between the public discourse, between the state and the way that the politician presents himself is, of course. Of course that is true. It's true that those two things are analogous. And so. But the way that Kanye understands it is at such a primal level that for him, it's all. It's almost all the same. And so if he has this intuition about a pattern, then whether he applies it to a rap song, whether he applies it to, as he said, ruling the free world, then it's all the same. And so there's some deep intuition in what he was saying. But at the same time, I would say that in the interview, we really got this sense of this character who, on the one hand, is going in every direction. So he's completely scattered. He's constantly going, riffing off, and he talks about giving a symphony. But I would say that in the context. I think that in the context of the interview, the symphony happened in the relationship between Joe Rogan and Kanye West. That is, Kanye needs something to. Seems like he needs something to focus him. And. And so Joe was pulling out, let's say, the thread of all the symphonic things that Kanye was saying. And I think that maybe that's why Kanye is so good at design, is because when he speaks, he kind of circumambulates, and he. He's going all over the place. But if you're creating an object, like if you're making a shoe, you. If you're making something, at some point, you have to synthesize that into. Into something which holds in space. And so it forces him to kind of focus his analogical thinking down into the object. But when he's speaking, then he knows that it's very difficult to think that he has a limit of time and. And of things he can say. And so he tends to just jump up, jump between all the different level. Different levels. Give an example from Star wars, then give an example, you know, from politics, from rap music, and then fashion. All of this seems maddening at the first glance, and in a way, it is maddening. Ultimately, there is something frightening about someone who kind of goes off in all these directions, but there's also a kind of energy and there's also a kind of, let's say, honesty that is difficult to deny. You know, one of the things that I. That I noticed about Kanye West a long time ago is that he was capable of acknowledging his contradictions. And so that's something which maybe is part of his. His manic state, which is the capacity to recognize your contradictions, but it's also a kind of lucidity, which most people don't have. He was. He's cap. He was capable of recognizing when he's actually a hypocrite. And, you know, he has certain values, and then he does other things. And then I remember in an interview, someone saying, like, aren't you a hypocrite? And he just said, yes, yes, I'm a hypocrite. And you could see it in this interview, he said some things which most people would never say in public. Like, he talks about how he's a Christian and he wants these Christian values and these. These Christian, Christian values towards sexuality, towards all this. And then at the same time, he's saying that he still has a problem with pornography, and he still watches pornography. And so it was like this. This capacity to be completely honest and in that honesty, to embrace. Embrace these contradictions. You know, the whole time he kept saying that. On the one hand, he brags about how much money he has, and then right in the next sentence, he says how money is nothing and how money has no value and that it's just a tool. But you can see that he. He kind of embraces that contradiction, which just to a certain extent is dangerous, because that's what leads into a kind of breakdown. But at the same time, it also offers him a certain amount of power because there's nothing you can get on him, because he knows himself, and he knows he's both extremely prideful and extremely arrogant. But if you point out his foibles. He also, he's just like, yeah, of course, these are my weaknesses. These are. These are my foibles. And so that those extremes are both kind of exciting, but they're frightening at the same time. And there's something extremely frightening about some of the things that he says. Of course, when you hear someone say something like, God calls me to be the leader of the free world. You know, the only reason why we don't find it absolutely frightening is because there's something in Kanye, because he's a rapper, because he's, you know, he's goofy in the way he acts and the way that he. That he's acting, acted in the past. There's something which, because we can kind of laugh at that, then it makes it okay. But if anybody else said that he has a calling from God to be leader of the free world, we would run away, like, at 100 miles an hour from that person, you know, and the idea also that. That you're going to redesign reality, that you're going to redesign the world is a scary, scary thought if, if you take it too seriously. But in his kind of contradictory character, in his kind of. Because he. He manifested in these kind of strange opposites and these strange contradictions, it rather. It rather makes us hope, right? He says he believes in utopia. He says he believes in world peace. And anybody who says that should frighten you, Seriously frighten you. Anybody who tells you that he believes in world peace and that he's the one who's going to bring world peace, is really a dictator, is a. Is a very, very dangerous person. But there's something about the way he says it, like I said, the way. The fact that he's also willing to acknowledge his weaknesses and that he's also kind of circumambulating and he's throwing things out and he's. He's. He's all of a sudden says something, and then he stops and he says it in a way that sounds like a rap. And then he says, I hope someone will. I hope someone will take that and put a beat to it. You know, there's some. There's something about the way that he speaks which makes it less frightening because in a certain manner, he's funny. And so. But nonetheless, I would say if you have not watched this interview, it's definitely worth watching it just to get a sense of this idea of this kind of. This kind of fool character who, who is living in contradiction, who flips everything around. But then, like I said, he says it right there in the interview, he says, I tell the truth, but in a world, you know, I said, he said, in a world full of lies, that truth sounds like craziness. And that's exactly what I said about him, you know, last year. That's exactly what I said about the character of the fool, is that when the world is upside down, that's when the. The fool appears as someone who tells the truth. Because it's almost in his nature to want to flip things. And so. And you can see all through, he's talking about. He wants to change everything. He wants to. He runs to renew the world in every manner, which is frightening, but because the world is upside down, then he. To do it. He ends up saying things that are true and that at least we can pay attention to in terms of the truth. There's some things that he said in that interview that no one else in the world is allowed to say. What he said about abortion, what he said, you know, also about, on the one hand, talking about racial conflict and segregation and kind of racism that's in American culture, but at the same time, talking really about how in order to trans what it needs, what you need to transcend that, and that success is what you need to transcend it. There's all these ways that he's speaking that are very difficult to. That it would be very difficult for other people to talk about. So if you haven't watched the interview, I would say it is definitely worth it. I had to watch it twice or actually listen to it because, you know, It's. It's like three hours, right? And I listened to it at, like, 2 or like 1.5, especially the second time, just the first time, I was like, what's going on? What's going on? I felt like I was on a carousel ride and that I was being spun around. And of course, I expected that because that's who he is and that's what his role is. But then on the second time around, then I was then able to perceive the analogies that he was going through and how he was. He was constantly using analogy as the manner in which he approached reality and helping. Trying to communicate that if you grasp the patterns and then it doesn't matter what you do, like, if you have that intuition, then you can do anything. And I felt some resonance with what I'm trying to do as well. Obviously, on a smaller scale, I'm no Kanye, but I would say that sometimes when people look at what I'm doing and they look at the fact that I'm making icons, you know, I'm making reliquaries for the. For saints and making objects for churches. I made a bishop's crook for the Archbishop of Montreal. But at the same time, I'm making comments on movies and on anime. I'm, you know, I made a video, a video talking about video games. I'm also designing T shirts and I'm making a comic book, But I'm also involved in the Orthodox Arts Journal and talking about sacred art and sacred symbolism and the Bible and all that stuff. And so, to me, there's something about the way that he's acting that I understand very deeply, because in what I'm doing, but in also my perception, it has to do with the fact that the pattern of reality, if you glimpse it, if you understand it, if you have a perception of how things work, then it doesn't matter what you're doing. They can be applied at any level of the world. Of course, in my case, I'm applying it more directly to art and so trying to create, let's say, stories and images that appeal both to the most common or the most popular level of reality, but that can also speak to the highest aspects of their participation in the life of the church, which. Whereas for him, he basically spans from making shoes to making music to. Then he. He thinks that he can reorganize the free world, let's say. Um, and so whether or not we think that he can be able to do it, there's something about his intuition which is right, and something about the way he perceives these patterns, which is, of course, right, and something about his honesty as well. So those were just a few thoughts about the discussion between Kanye and Joe Rogan. I'm sure there are many more insights that one can get from what he's saying. A mix of excitement and, if you're attentive, also a little bit of frightful things, and also a kind of sense of this spinning and spinning, which is somehow, nonetheless, showing us some golden nuggets of truth, which he's also saying at the same time. And so I thank you for your attention, guys, and I'll see you very soon. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward, and it is based on a series of videos that you can find on my YouTube YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
