{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":0.16,"end":59.17,"speaker":"Laura Diaz","text":"Tucson, the weight is over Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project. Ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight and serious risks. At mediweight loss. I got the same medication but with a customized plan, weekly check ins and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":59.25,"end":236.22,"speaker":"Jonathan Pageau","text":"That's mediweightloss.com City planning and architecture is the most important art. You know, I'm not an architect but I can see that because it fades behind people's perception. It pre models the way that people understand who they are, what's their relationship to each other, you know, what's inside, what's outside, you know, what is above, what is below. Just building basic orientation in your life is based on city planning and an architecture. And there's a deep alienation in modern living that comes from living in these horrible places and these abstracted spaces with no center and no community and no sense of relationships. That's a call for people to take it seriously. For people who are studying architecture that you're doing the most important thing. It's hard right now. It's hard to do it. But that is the most important thing to be done. This is Jonathan Pedro. Welcome to the symbolic world. Rapunzel and the Evil Witch is officially available right now. It is not in pre sale. It is not a pre order. It is in the warehouse. You can just go to rapunzelbook.com and you get the book. We have a new distribution system which has just been amazing. People are getting their books in a few days. All the pre sale and pre order books have already been shipped. People already have them. And so this is the third book where a lot of the symbolism is going to come out it's our celebratory tone. The third book in the series of the Tales for Once and Ever illustrated by Heather Paulington. This is where the symbolism is going to start to show, where the characters are going to, are going to repeat. So I'm particularly excited about this book and the continuation of this series. And so go to wrapunzelbook.com now and you can just get the book, get it in a few days. So thanks everyone. So hello everyone. I am here with my friend Andrew Gould and with Michael Diamant. We are going to talk about urban planning, about architecture, traditional architecture, about all the projects that are happening. Michael is an advocate for traditional architecture and for proper urban planning. And as many of you know, Andrew is an architecture tech. He's been on my channel a few times. He is a long standing friend of mine. We started the Orthodox Art journal now in 2012 together and he is one of the biggest reasons why I actually was able to start icon carving. So I have a great debt of friendship and to him. And so Michael, thanks for doing this. And maybe you can start by telling us a bit what you do. It's a very odd thing to think of a kind of architecture advocacy. So maybe you can explain a little bit what it is that you do."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":237.56,"end":435.34,"speaker":"Michael Diamant","text":"Well, thank you very much for having me on this podcast. Well, some of the concepts may be alien to an American audience because I think in the US you do what you want. If you want to build a Gothic cathedral, you build a Gothic cathedral. You're much more free in your mind in the US than we are in Europe. We're always constrained by, you know, both by our municipalities have much stronger to say what we are allowed to build and also socially what we are allowed to do. So it's a bit different. So what I do, what I've been doing the last 14 years is social media advocacy for new traditional architecture. It began in my native country, Sweden, but now it has spread to all of Europe. There is an architecture uprising in every European country. There is in Turkey, there is in Lebanon, there is in Israel. I was in contact actually with a woman in Syria, Korea. But now everything has faded away there. There's an uprising in India. And I'm also in contact with a professor at Hong Kong University that want to start something similar in China. But of course, you know, they can't call something uprising on the social Chinese social media. Basically what the advocacy and what the uprising movement is about is to make ordinary people, that is non architects realize that, that we can build beautiful today. Most people, an overwhelming majority, think that there is some kind of rational reason why we build so ugly today. They think it must because of costs or because if you want high standard of living, it must be ugly. And that is totally false. So when dig down into this, you realize that everything is about ideology. And architects, most architects, not Andrew, of course, are what we would call modernists. And their ideal, actually I would say almost, is to be ugly. Because like modernist artists, they feel special if everyone hates what they're doing. So we do advocacy and we make ordinary people very successfully. In Sweden, in Norway, now in Germany, Netherlands, all very much realize that we cannot build beautiful if we want. It's a choice. It's not a necessity to build things ugly. We can build beautiful and we also should build beautiful because all of the. Of course, you must have all kind of practical reasons today why promote beauty. You can't just say, you know, it's for good, it's for higher ideal. You must promote it as you know, it's good for health, it's good for well being, it reduces stress. So of course we talk a lot about that. But also the democratic argument, if people want it, then we should build it. So as said, this has been very successful in my native Scandinavia and it's spread to other European countries. And now in the public discourse in Sweden, most people know that all the ugliness that they see in the built environment is built on purpose because the architects wanted to build this way. And that's a success because then you have a discussion, a proper discussion about Arabian environment."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":436.14,"end":478.44,"speaker":"Jonathan Pageau","text":"Yeah, well, I guess that there's a. I'll be the devil's advocate for a little, because obviously I don't really don't think this. But maybe, Andrew, you can pipe in on this as well, which is, of course the argument is that traditional beauty is something. Either it's arbitrary or it's oppressive. Right. It's either arbitrary or it's an image of the old world of hierarchies, of the days when we had kings and aristocracies and that modern architecture is functional, but it, it's also democratic in the sense that it's equalizing. You know, it has this kind of the, this, this aesthetic of, of equalizing, equalizing things. And so I don't. How do you answer to those arguments?"}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":478.84,"end":481.16,"speaker":"Michael Diamant","text":"Yes, that's the lie they sell. Oh, sorry."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":482.52,"end":514.02,"speaker":"Andrew Gould","text":"Well, I was going to say that some, some of those things are lies and some of them are true. I would. The equalizing argument, I think is. Is large. Know, the communist Governments liked building, you know, identical housing blocks with identical apartments in an international modern style. Not just because it was cheap and easy to build such repetitive buildings, but also ideologically, they liked that it was equalizing."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":516.66,"end":518.34,"speaker":"Michael Diamant","text":"It's reductive architecture."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":518.34,"end":624.03,"speaker":"Andrew Gould","text":"Yes, yes, but of course, I mean, that kind of socialist ideology is mostly out of favor nowadays. The idea that classical architecture, for instance, specifically references the time of plantation slave holding or old regime France or whatever your sort of political enemy might be, that doesn't really hold water. Because traditional classical architecture was basically all architecture until the mid 20th century. It existed in every type of governmental and political system. Places like the Athens Republic or the Dutch Republic used classical architecture the same as autocratic kingdoms used it. The British Empire used classical architecture after it freed slavery, just as Americans used it before freeing slaves. It just, it does not correlate to politics that way. It doesn't actually even correlate very well to sort of, you know, communist ideology. You know, yes, communists justified their ugly architecture because it was equalizing. But Americans were building the very same ugly equalizing housing blocks in American cities at the same time. And they justified it because it was, you know, of its time and of the nuclear age and looked like the future. You know, we justified it by claiming it was great and modern, and they justified it by claiming it was, you know, equalizing and humble and, you know, appropriate to the working man."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":624.03,"end":626.39,"speaker":"Michael Diamant","text":"But it's a nonsense argument."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":626.39,"end":629.39,"speaker":"Andrew Gould","text":"It's the same stuff. Yeah, it is a nonsense argument."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":629.39,"end":711.6,"speaker":"Michael Diamant","text":"And there is a reason why they use this and talk about all this nonsense. It's because they don't want to talk about architecture. They always want to talk politics. Because as long as they talk politics, and if you swallow that bait, then they don't need to talk about architecture. But also, if you put classical architecture, vernacular architecture, and modernist architecture and just compare their merits, okay, which one is more climate friendly? Okay, then classical architecture wins. Which one is more humane? Classical architecture wins on every metric. Classical architecture would win. That's why they never ever want to talk architecture. They would go aggressive instantly on politics and talk all this nonsense. Because the only way they can win, as soon as they cannot talk politics, they lose. And that's why, you know, I have, okay, I use maybe offensive terms here, but I got something called a race card in these discussions. I'm half Jewish. My mother was born in a refugee camp in the Soviet Union. Her parents were Polish Jews. So they can't call me an auntie, you know, because they are texture. And as soon as they can't do that. They just dumb fun. Then everything falls. So everything is based on being able to label people and not talk about architecture."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":712.08,"end":769.85,"speaker":"Jonathan Pageau","text":"Yeah, I just watched the. I just watched the brutalist movie, which. It was unbearable. I really did not like watching it, I have to be honest with you. And they have this crazy thing at the end, right, where the niece of the architect announces that the secret, like motivation or reason behind the architecture was basically to recall the Holocaust and to recall the gas chambers. And I was like, what kind of insane thing is this? It's like, are you promoting it this way? Are you promoting it in the sense. So now you want us all to live in the gas chambers? Is that what you're trying to suggest? It was nuts. It was a wild argument. I mean, I don't know. How is that what modernism ends up being like this, this. This nihilistic desire for us to live in inhumane spaces, to remind us of our own horror or to remind us of our own death or something."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":770.09,"end":843.15,"speaker":"Michael Diamant","text":"But, you know, it's, you know, with beautiful things, you don't need many words to describe it. You know, beauty is instantly. If. If I look at one of Andrew's works, you know, you don't need to know anything about architecture. You don't need to know anything about symbolism. If you do, you can of course read a. But you can appreciate it instantly. Just being an ordinary layman, never ever open a book about architecture with all this modernist type of architecture because it's so empty, just like modernist art. You need to invent a story. So. So what you call it, they are snake oil salesmen, I think that's the word you're using. They have to, you know, they have to invent all this story. And they of course, very narcissistic because they sell these stores and also they don't. How do you say? They don't live like they preach. They made a survey. That is probably very true in the US they made a survey. The Union of Swedish Architects made a survey where Swedish architects live. And overwhelmingly they live in classical architecture and they also work in classical buildings. And then they make modernists for everyone else. And it's probably the same. If you would look up where all these modernist architects live, you will see the same pattern."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":844.51,"end":874.99,"speaker":"Jonathan Pageau","text":"And so tell us a bit about also city planning, because we tend to think about architecture at the outset, because that's our most immediate reference. You know, you see a building, you kind of see the. But it seems, you know, what's exciting about what you're doing. And also What Andrew, what you've been doing, you know, for decades is you're not just involved in building, but also thinking about the environment, thinking about city planning as an extension of the architectural idea. So maybe Michael, if you want to start us on that and then Andrea, I'd love to hear from you as well."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":875.15,"end":983.77,"speaker":"Michael Diamant","text":"Yeah, well, apartment. First of all, you know, when building cities, we're talking about apartments mostly, but townhouses of course as well. Apartment living is not very attractive in the Anglo world as I understood it. And the reason for this, and I may be totally wrong, this is just my outside perspective, is because you traditionally, except for a few places maybe in California, you don't have what you call it courtyard urbanism. You have a green space in the middle and the building envrops it. So you don't get greenery, you just have massive blocks. So that makes that you get very uneven density in the US you either get townhouses or villas or high rises. You don't get gentle density, like three to six story buildings that are mixed use and that are so attractive to live in that even upper middle class want to live in them. Like in Europe, I would say continental Europe then. So that's a problem. But you have now there is a woman in Chicago that does really, really good. You should have as a guest sometime really good advocacy for courtyard urbanism in the US Just because I think, and she thinks as well, it's the only functional way to make it more attractive for middle class people in the United States in the Anglo world to live in apartment buildings. Because if you have a family, of course you want the kids to have some kind of greenery. And in the courtyard you have protected private greenery. So. Yeah, so. So yeah."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":983.77,"end":988.45,"speaker":"Jonathan Pageau","text":"And then you also have windows on both sides of the apartment, which is one of the problems of apartment living."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":989.57,"end":991.73,"speaker":"Michael Diamant","text":"Yeah, yeah. Do I have windows on both sides?"}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":991.73,"end":1022.19,"speaker":"Jonathan Pageau","text":"What about like the, the spatial argument? Because there's people I guess will make an economic argument and say that, you know, it's, it's more cost effective to build a high rise or to build the condos that, you know, take up all that space. Because the, you know, there's the density argument are here our city has agreed to a certain density, you know, for environmental, for all these reasons. So because of it they're kind of in trouble. Like they have to build these things that have more density in order to justify their requirements."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":1022.59,"end":1105.38,"speaker":"Michael Diamant","text":"That's a good thing with city planning, that it can be very political. I don't know how it works in the US but in Sweden the politicians have the last word. So we can choose the exact amount of density that we want. And there is no goal of having maximum density. What you want is attractive and livable density. You want gentle density. You don't want tower blocks with hundreds of people that live like ants and no one knows everyone. You want create community spaces and the courtyard urbanism is very much. You have not too much density and not too little density. And you also have an enclosed space where you meet your neighbors. Because you know in this closed space, the courtyard there you have you. It's a closed space, so it's not an open space for the public. Everyone in the courtyard is either people that live around the courtyard, in the buildings around the courtyard, or their friends. So there you have a lot of social activities, you have barbecues, birthday celebrations and such. And the balconies are centered towards the courtyard, not towards the street. So people sit on their balconies towards. You also get a lot of watchful eyes there. How to say that you have architecture of community. You create community by having this type of a fixed amount of people, not too many, not too few. And you meet the same people every day. You don't need to be your friends, but you see them enough so it becomes natural to have conversations and such."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":1109.06,"end":1272.22,"speaker":"Andrew Gould","text":"You also get the highest density with mid rise development. Curiously, urban cores that have high rise, like skyscraper building heights, they actually don't get more density for that because they need a lot of space between those skyscrapers. They need very wide roads for all the traffic and emergency vehicles that have to access access them. They need a lot of space for all the scaffolding and so forth to build them. So like when New York City went from mid rise development in the 19th century to skyscraper development in the 20th century, it did not actually gain any density for that. In fact, you usually lose density when you see that transition because everything's going to office space into giant penthouse apartments for the super rich oligarch apartments that nobody really lives in that are just investment property is. And regular people can't even afford to live downtown and wouldn't really want to because it becomes an inhospitable, windswept place. Yeah, so it's true that mid rise urban cores have the highest living density, but even that's higher than we really need in America. Most new development is not urban at all. It's suburban sprawl, which is very low density. Single family houses or if it's apartment buildings, it's still low density because they have huge parking lots in between them. Yeah. I was lucky enough to grow up in one of the few American cities that has courtyard apartments. Brookline, Massachusetts. It's a beautiful Victorian garden suburb town of Boston that's a mixture of Victorian single family houses, attached townhouses, and courtyard apartment buildings that were typically three or four stories tall. And everybody of every class back then lived all mixed together in this town. Everybody could walk to corner stores. It was kind of an urban paradise and there was very little traffic because of it. And it was very high density. So we could really, the fight here is increasing density from suburban density to sort of traditional urban mixed use density. In America, we have loads of land. There's no need for people to be building Manhattan kind of urban core density to house our population. Frankly, in Europe there's not either. Because Europe doesn't even have a replacement birth rate."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":1272.22,"end":1272.86,"speaker":"Michael Diamant","text":"No, no, no."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":1275.18,"end":1288.12,"speaker":"Andrew Gould","text":"There's not a need for new housing in Europe except insofar as there is sort of runaway immigration and need, you know, foreigners. That's, that's a political problem of its own creation right there."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":1288.12,"end":1288.76,"speaker":"Michael Diamant","text":"Exactly."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":1290.28,"end":1376.32,"speaker":"Jonathan Pageau","text":"And so the, I mean, it's so difficult because when, I mean, obviously I'm very convinced by your argument. And so what is driving the madness? Like, what is driving. Because one of the things that I get the sense, because it's not just about having courtyard building, for example, like one of the problems of urban sprawl, of a suburban sprawl especially, is the kind of specialization of space where you have, you have highways and then highways connect huge shopping centers to like huge living areas. And there's this kind of disintegration of, of space. Right. People take their car, they drive 45 minutes to work, then they drive 45 minutes home, and there's all this kind of fragmentation. You know, is there, is there a way to discuss. Because Andrew, you were involved in the, the, the building of Ion, which was a very kind of experimental new urbanist project near Charleston where they tried to recreate this sense of like a little market with housing and a few churches, this sense of a center, of a city center. And it's been very successful. Like obviously it made the prices of those buildings just skyrocket. And so is it possible to recapture that today there is a five minute city? Like there's. That people are talking about, about that. So maybe I'd like to hear your opinions on, on the basic problem of urban planning right now."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":1376.96,"end":1379.04,"speaker":"Michael Diamant","text":"Well, so. Sorry."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":1382.08,"end":1533.98,"speaker":"Andrew Gould","text":"Well, yeah, well, I, I think, I think that's, that's mostly true, Michael. I mean, in, in America I would say, you know, it's been proven that new urbanist developments are politically popular. Good for real estate value, good for the developers. Bottom line, the things that stand in the way of it, bad zoning. These kinds of developments are typically in suburbs of older cities. And suburbs tend to have low density zoning. And they tend to still be sort of holding onto this fear from the 1960s that high density means poor people and chaos. And it still tends to be old people who are, you know, sitting on town councils in charge of zoning and they just, you know, they like their ranch house on a three acre lot and they just can't picture why anyone would want to live in a high density, mixed use kind of neighborhood because they remember when they, you know, left that kind of neighborhood in 1965. Yeah, so that's, that's a big part of the problem is out outdated zoning. Another big part of the problem is just regulatory stuff. You know, rules from highway departments, traffic departments, fire departments, rules that require really wide roads, really easy vehicular access, really high parking to dwelling unit ratios. Yeah, these bad regulations make it, it really difficult to do urban density or urban type walkable design. And then another big hindrance is a talent deficit among the designers. There's not that many classical architects or traditionalist urban planners or traditionalist traffic engineers to go around. So a developer who wants to build something that looks like a traditional town may have a really hard time finding local consultants who have the skills or the knowledge to do that. They might find people who say they can do it, but the results are often very poor because they're all people who are trained at modernistic design schools. Yeah, that's been my observation."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":1535.26,"end":1536.38,"speaker":"Jonathan Pageau","text":"What do you think, Michael?"}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":1536.62,"end":1685.63,"speaker":"Michael Diamant","text":"I completely agree with everything he says because we are having that problem now in Sweden, where I live. So now we have a political will for more traditional projects. The problem is that we have, we have, in a country of 10 million, we have five classical architects. So we really, you know, they can't do a lot of work. So it is, you know, the sorry for, for butchering English, but I think you call it Oxam's race or you know, if you, if you deep dive in. Everything's about the ideology that they teach at school. In architecture schools, Most architecture schools, 99% of all architecture schools, they will not teach anything about classical tradition, classical city planning, classical architecture. They will label it some kind of history lesson, but it's not. So all the, you know, all the things that we appreciate about the classical city and the classical city planning or the cities that we visit, you know, when you tourist in, in Savannah or in, in Charlestown, it's not by accident that they are so good. Everything's very well planned. So you need to know these things to be able to do them. And because an overwhelming majority of our architects are not educated into this, they are even ideologically against to learn. You know, they have been ideologically conditioned to never look past, never look to the past, because the past was, you know, we already talked about it, classicist, racist, slavery. You know, they will label it in our way. And if something is, you know, labeled that way, it makes people less curious to open a book because why should I learn from these racist, slavery, owning, etc. Etc. So everything starts and begins at architecture school because all these regulations that are bad, of course, they are very bad, but they are not written in stone. If all architects were educated, classical, you could have meaningful lobbying to politicians and we could change the regulations. But, you know, I would say that most architects don't know what regulations that should be changed make good city planning. So that's the basic problem. So you will always come back to that. You know, people want to blame capitalism or, you know, capitalism built, you know, 100 years ago, the world was more capitalistic and it built marvelous cities. So that hasn't changed. The only thing that changed is the architecture profession that changed. And then suddenly the whole world became ugly."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":1687.15,"end":1738.89,"speaker":"Jonathan Pageau","text":"I've had so many. It's so weird. Like, I've had so many architects come up to me in, at conferences, at different speaking events. They come up to me in this kind of spirit of desperation, as if they feel lost. You know, they. They have this desire to connect with ancient wisdom, but they feel as if there's no room for them and that there's no. Like you said, there's even a difficulty in learning how to do it. Like there'. Finding the skills is difficult. And so it feels like the people are there, right? The people who desire to learn these skills exist and that they're kind of. They feel disconnected and alone. And so is there an option for them? Is there a place that they can go? Is there a group that they can contact so that they can at least form networks in order to have some kind of strength?"}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":1739.37,"end":1878.27,"speaker":"Michael Diamant","text":"Yes, they can. First of all, there's never been more talent in the world than there is today. The problem is that all this talent is directed wrong strongly. So we probably have, you know, at least a million potential Michelangelos in the world, but none of them are directed to do art or architecture. They probably do computer game graphics or something, you know, so it's. We have to have talent. We have talent, you know, how to say. The number of people in the world that have access to, you know, higher education is very, very large today compared to 100 years ago. But they are just directed wrong. There are places, there are a few places. There are a few places in the US you have Notre Dame University where you can. And now I think there is at least four or five colleges where you can study to become a classical architect. And there's of course social media and the Internet. So there's a lot of, you know, different groups on Facebook, on Instagram, on Twitter, on Reddit. So every political spectrum, you know what you prefer then. And you can find like minded. Of course, you know, there is no, really, there is an English speaking architecture uprising, but there is no specific US Architecture uprising. There is a small Canadian uprising, but with the US it's hard to begin because the US is a continent you would need, as with Europe, you would need one for each and every state, just for people to connect with like minded. And there you find each other and there you hear, you know what options there are. I know in Europe I get connected, I get Halloween. A lot of students reach out to me and I direct them to the study options that there are, you know, the summer schools now you can do a master and a doctor's degree in classical architecture in Trondheim University in Norway. And I think almost every European country now has a summer school and they're also talking now about creating a permanent classical architecture education in Paris. So there are things going on now, but most important is that you just connect with like minded because then, then you do self study. A lot of you, you can, you can study yourself and then of course you can take contact with people like Andrew and you can do, have an exchange. What books can I read? Where can I learn the symbols? How can I learn the craftsmanships? What studies are that work with these kind of things?"}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":1879.71,"end":1894.65,"speaker":"Jonathan Pageau","text":"Andrew, you're in the US You've seen, I mean, it seems like there is some change in theory. Trump was supposed to pass this classical architecture bill for these federal buildings. And so it feels like there's at least little bit of wind in the sails. Maybe you can tell us."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":1895.53,"end":2126.93,"speaker":"Andrew Gould","text":"Yes, there is. You know, my, my experience is that outside of academia, outside the universities, the, the modernist ideology no longer has very much of a hold on architecture. I most, most architects that I have interacted with who are working on, you know, commercial projects around the US Most of them are pretty willing to do classical architecture in theory. They just don't really know how to do it well. Most developers would prefer to do it in theory, but they're a little. They know from experience that it doesn't usually come out very well and that it's kind of complicated finding all the right people to get it done well. And so there's a lot of sort of, of path of least resistance, inertia that's perpetuating modernism. My personal feeling is that a really big problem is that because we've had a hundred years now where architecture schooling is treated as a technical scientific field akin to engineering, it's ended up being a field in which people with a sort of engineer's mindset, those are the people who are attracted to the field, those are the people who excel in architecture jobs because architecture is not a very artistic discipline for the most part now it's mostly a matter of understanding immensely complicated building codes, understanding immensely complicated mechanical systems, dealing with banks, dealing with money, dealing with business stuff, keeping on schedule. It's all, you know, the kind of guys who have, you know, you know, master's of business administration degrees actually do pretty well in the architecture field. They know how to keep money correctly categorized, they know how to keep things flowing, they know how to communicate with the lawyers. And that's mostly what architects do. And so I often interact with architecture firms. Sometimes they're firms that have been asked to collaborate with me on projects where the developer would like a more classical result in the project. And, and often the guys in these firms, they've really gotten over the ideology stuff. They're totally on board with New Urbanism and New Classicism in theory, but they have no artistic skills with which to do it. They might stick some classical columns on their building, but they just don't, they don't have the eyes to see that their work just is not right. And when I tell them it's not right, here's how you make it right, they get kind of defensive because they think classical architecture should be like a couple of rules you follow, like following the building code, but it's not. It's art. And art, art can be partially reduced to rules, but not entirely. And you know, guys who just don't have an artistic temperament aren't going to be able to do it. So yeah, we really need to find a way, a long term solution to this is going to involve finding a way to get people with artistic templates, temperaments into architecture. And it's not going to be by Making them learn all the building codes and deal with all the bureaucracy because people of an artistic temperament don't do well with that. It's going to have to be a system where there's some people in charge of the artistic part of architecture and other people in charge of the technical part and figure out a way for those types of people to collaborate productively."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":2127.65,"end":2219.05,"speaker":"Jonathan Pageau","text":"Yeah. I have two things that pop up in my mind when listening to you. One is that most of the architecture that we see is just horrible. Like, it's just boring and horrible and just. And then what they seem to exist is a few flagship, like wild projects that always kind of push towards future. This futuristic image of the skyscraper or this really deconstructed image of the building. And those are the ones, those are the architecture projects that get, get the attention, right? So, you know, Google, ham, Bilbao and all of these, or the Shard or all of these kind of wild crazy projects that, that, that get the attention. So those look to people, they, the. That's what creativity looks like, right? That's creative. That's, that's the artistic part. Like, look at all this really creative architecture. That's one. Like. And the other problem is, like you said that most of the, the buildings that try to look classical today, they look like caricatures. And it's hard because you go into these. Sometimes you go into these neighborhoods of mansions, right? These mansion neighborhoods. And although the buildings are trying to look like classical, they're just hard to look at because they look like a joke. They look like someone took a classical building and made a joke with it. And this is, this is like a, this is a millions of dollars in, in these buildings. So I don't know what you think about those problems. Let's say."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":2219.69,"end":2462.84,"speaker":"Michael Diamant","text":"Well, well, there are two, two separate problems. The, the. How do you say? The, the buildings with strange shapers, they are a result of the modernist mindset because, you know, it began with pure rational buildings. You know, the 60s building, the 70s building, you know, the one that you see in, in Washington, those, the brutalist one that people hate. But now it mutated to narcissism. So the only thing that matters that is promoted in architecture education and among modernist architects is novelty. It doesn't matter if the building is good. It doesn't matter if people like it. It doesn't matter if it's beautiful, it doesn't matter if it's functional. The only thing is novelty. So how to create this novelty? They use computer programs because they can instantly calculate so the building won't fall down. And then they can recreate all these strange shapes and then they win prizes because no one has ever done this before. So that's the crazy buildings. When architects get a free hand, it's based on this insane ideology. The other, the boring ones, the very boring boxes, they are also because of modernism. They are because when developers in every field, when you profit maximize, you do it in two ways. One is to cut costs. The other is to add a value that people are ready to pay, pay more for. If we take, you know, Apple smartphones, they cost $100 to produce and people pay $1,000 or $1,500 for it because it has a value that people are ready to pay more for. In architecture, very few people are ready to pay more for modernist architecture. So the only way for developers to profit maximize is to cut costs. Why the architecture uprising we can show so many projects is because those developers that try classical architects here in Sweden, in Germany, in France, everywhere they notice, oh, it's profit maximizing to build this way. Maybe we can cut cost, but also let's say we add, let's say 5% cost, then we can sell it for 15% more. So the way to profit maximize is different in the classical market and the modernist market. But with that said, you can make a very cheap classical building that's very beautiful because the classical is not in the materials, it's not in the ornament, it's in the facade division. You have this. If I should explain classical button, Andrew will probably angry at me now. It's from an outside non architect view. So is it. Basically you have this three part facade division of almost every classical building. So you have a base with a baseline, then you have a midsection and then you have a roof section. And this three part division is like the human body. If you go out and look at an old. Even if you can look at a classical skyscraper in New York and they will have the same division of the building. So the base is a bit, it's the highest part because psychologically it makes us feel safe. Then you have the midsection and the roof section is the smallest part. So then instantly our brain can read this building, understand this building. And because the baseline is the highest line, then it feels that the building is stable, it will not fall upon us, so our minds relax of it. The second part of classical beauty is how you place the windows. So you don't have one set of windows, one row of windows like you see on this 60s building, or like random, like you See, now, on more contemporary buildings, you have, how to say, symmetry, pairs. You have part symmetries. So you have many different symmetries on the facade. So what you get is a building that is instantly readable for our mind. So you relax. At the same time, it's gentle stimulation with this. Part symmetries, not one symmetry on the facade, but part symmetries. So here you have the. If I would say the key for why we find classical architecture beautiful, if you just reduce, remove all symbols or ornament all materials, it would be this. The readability and the gentle stimulation."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":2463.77,"end":2466.25,"speaker":"Jonathan Pageau","text":"The proportions is what you see proportions as well."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":2466.25,"end":2466.65,"speaker":"Michael Diamant","text":"Yeah."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":2466.81,"end":2519.27,"speaker":"Jonathan Pageau","text":"And you see that. Like I was looking at your Twitter feed, Michael, and it was interesting because you had several projects. Because when we think of classical architecture, obviously, like you said, we think of ornament, we think of columns. But you had several buildings that, you know, were quite. Were not, didn't look antique and finished. Like they had a basic, a simple, not modern, but like a simple finish. But because of the proportionality, they still read. And because of the relationship between symmetry and variation, where you have enough variation but you also have a sense of symmetry, then you can. You feel like you said that you have something that's both real, something that's both relaxing but interesting at the same time, that doesn't, doesn't threaten you. Like, like it looks like the pieces of the building are attacking you, you know, but. But it's also like it. It has this kind of solid."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":2519.35,"end":2519.91,"speaker":"Michael Diamant","text":"And you."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":2519.91,"end":2529.46,"speaker":"Jonathan Pageau","text":"Do you want to comment on this? And also, I still need, I still need to comment on the McMansion, like, problem, like the, you know, this kind of fake classic that everybody."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":2529.78,"end":2609.2,"speaker":"Andrew Gould","text":"It's true that bad classicism is even worse than modernism in most cases because. Because classical architecture does have traditional order to it. Like, it's a classical building is very recognizable how all of its elements are ordered in relation to one another. They are partially anthropomorphic. They're also fractal. Like the proportioning rules that apply to the whole building tend to apply to the individual parts of a building. The whole building has a base, middle and top, but an individual column also has a base, middle and top. An individual window has a sill at the bottom and a projecting head molding at the top. So every part of the building is like the whole. And that kind of order, which mirrors the sort of order that we see in natural forms, in trees or mountains or living things. That kind of order is mostly what makes classical buildings so beautiful. But it also means that A disordered classical building is grotesque looking. You know, it's like a creature with two heads or something, you know, or something with one arm chopped off or something, you know, a. So, right."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":2609.2,"end":2644.38,"speaker":"Jonathan Pageau","text":"I think what you said is exactly right. And now that I can picture these horrible McMansions in my mind is that one of the things that happens is that they take the trapping. So there'll be, like, molding and, you know, there'll be all of this architectural, you know, exteriority, but the proportions are wrong. And so you have this thing with the wrong proportions that look completely out of scale. And the windows are completely wild. You know, like, the lady was just like, I just want a window there. I don't care what it does to the building. And then what it. And then in the end, it looks like this, like. Like a. Yeah, like someone with too much makeup on."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":2644.38,"end":2644.98,"speaker":"Andrew Gould","text":"Something like that."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":2644.98,"end":2645.62,"speaker":"Michael Diamant","text":"Yeah, it could."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":2645.62,"end":2705.19,"speaker":"Andrew Gould","text":"I mean, the most common mistake with ignorant classical architecture is that the. The columns are too skinny for what they're holding up. Like. Like you've got a little column with a capital, and then there's this big fat beam or this big fat pediment on top of them, you know, and then. Then it looks like, you know, somebody wearing a, you know, a big clown head or, you know, somebody with a head too big for the body. Yeah. Or you see, like, some missing element to the moldings. You'll have, like, the column, and then you'll have, like, the cornice, but there's no entablature in between. So it, like, looks like somebody with no neck. It's a grotesque effect. The nice thing about modernist architecture is in its lack of order, in its total abstraction. It is kind of anything goes. You know, the building might not have anything appealing about it, but it might not have anything grotesque about it either, because it just kind of. It looks unrelatable. You don't really have any emotional reaction to it in many cases."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":2707.59,"end":2741.31,"speaker":"Michael Diamant","text":"And that's the reductive part of it. You know, when modernism has spread all around the world, it reduces everyone to a global consumer. There's no difference between a skyscraper in Stockholm or one in Bangkok or one in Seattle. No difference at all. You can't see where it is. There's no cultural expression, and it's not even adapted to the climate. So this is also something that's, you know, very important. What classical architecture does, right, is that it's adapted to the local climate. And there are millions small details that classical found depending on where."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":2741.39,"end":2741.79,"speaker":"Andrew Gould","text":"Where."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":2742.19,"end":2803.15,"speaker":"Michael Diamant","text":"Where the building is built. You know, does it rain Much does the rain come by wind sideways or does it come upward? You see all kind of these smart solutions that are in different places. And you know, when you have an illiterate architect that does this classical, you get a lot of problems, as you have with modernist architecture because it's not adapted for climate. And then you get all kind of things that you didn't know would happen because you never learned about the tradition. I can give you a very good example. I live in Sweden, where it rains and snows a lot. Yet our modernist architects build flat roof roofs. So we get building leakage, we get leakage of water because it creates a pool on top of the floor. For thousands of years we build with broken roofs, but suddenly we should be modern. And now we build with flat roofs. And now we get all these kind of problems. And you can multiply this a million times for every country. What we lost when we abandoned traditional architecture."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":2805.3,"end":2873.89,"speaker":"Jonathan Pageau","text":"I think, I think this is really, what you're saying is so powerful because in some ways what you realize is that modernism and modern architecture, it really is an abstraction on human experience. It's a deep abstraction. Whereas all of these solutions that our ancestors came up with there, you could say that they're evolved with time. They're just iterations on iterations. You can't find the person responsible for them. They're almost organically adapted to the human body. But then like you said, in some places, actually organically, you know, embedded in the landscape. You know, they, they're, they, they were developed by the people there to adjust to their, to their lifestyle. And of course, you know, doesn't mean that we have to build like our ancestors, but we, to forget, like to just simply throw all of that, almost like Darwinian work that was done, like to just throw it out and say, okay, now we're just going to create these abstract built things is, is crazy that we thought that was a good idea. Like the, the abstracted human, this international, this international human that has no, that doesn't have their feet on the ground."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":2873.89,"end":2879.97,"speaker":"Michael Diamant","text":"You know, no qualities, no culture, no nothing, no human expression. It's just a global consumer, that's all."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":2879.97,"end":2880.41,"speaker":"Andrew Gould","text":"Yeah."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":2881.13,"end":2913.11,"speaker":"Jonathan Pageau","text":"What's interesting is that it's even more like, it's even more diverse. To think this way is to say, you know, it's like, I love Chinese architecture, I think it's beautiful, but it hasn't. It would be weird if you just prop in, in in Sweden or, you know, in, in certain places like that. Every, every place has its own beautiful things that they developed. And so we should, we should be able to say, yeah, that's what we're going to do, because that's where we are and that's the tradition we have. We can also then appreciate Turkish or Syrian architecture, all the different ones for."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":2913.11,"end":2946.87,"speaker":"Andrew Gould","text":"People, for people who have a normal love of their own culture. There's nothing more satisfying than seeing new, new art, new buildings being done that is in the tradition specific to their own nation. It's a tremendously satisfying thing to see when you see that. However, I'm afraid nowadays it's very fashionable to not have a love of your own culture. Among liberal Europeans, it's fashionable to despise your own country, to think that your own culture doesn't exist or is garbage."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":2949.43,"end":3021.23,"speaker":"Michael Diamant","text":"You're most different between the populace and our elites. Of course, the elites of Western Europe are totally. They are more loyal to each other than the country they represent. That's the horrible situation that Western Europe is in, that previously the Swedish elites were loyal to Sweden, the French elites were loyal to Sweden. Now they are loyal to each other and not the people that they represent. So yes, and they are very post national and everything. And that's okay. Now we go into politics, but I will keep it short. But that's the funny thing now that, that we need to, you know, we, we need to put more expenses on our defense in Europe. But money is just one equation. If you for 50 years told us that nationalism is bad and white men are bad, who's going to defend the country? Who's going to volunteer to fight for Britain or Sweden or France? When all these things that you want, you know, you need the young white men, I would say, in, in Western Europe, if you want to defend. And you have bashed these people now for 50 years. So they are not, you know, they are not raising their hands to, to, to defend the continent. Yeah, sorry, that was just something to."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":3021.23,"end":3118.67,"speaker":"Jonathan Pageau","text":"Know, to want to defend something, you have to be able to celebrate it. You can't defend your homeland, your traditions, your, you know, everything about it. If you're asked to despise it, then like you said, it means that ultimately we'll just be taken over by whatever. There's no, there's no inner glow. There's no inner, there's no inner light. And so, but it's, it's, it's exciting to hear that there is a bit of this, this architectural uprising in the United States. It's more complicated because it's younger. Right. It's the same in, in Canada as well. One of the things for people who are listening or watching, you should see what Andrew has been doing. One of the, one of the great things that Andrew has been doing is really searching out local styles when he builds churches where, where he's going to build them, and then adapting, let's say, the traditional, traditional shape of an Orthodox church to a, you know, New England style building or even to an adobe style, you know, you know, kind of Mexican or Californian style. And so that's been a way in which to kind of give a sense to architects of what's possible. And with the thing about your work, Andrew, that's amazing too, is that the buildings don't look, there's. They don't. They're not nostalgic. And this is the problem with, with the classicism. Sometimes that you see that sometimes the classicism just looks like a copy of an old building. Whereas what you're doing in some ways is extremely creative because you're looking into the local styles and you're fusing it with the different purposes of the building. So there's a lot of possibility there."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":3118.91,"end":3251.02,"speaker":"Andrew Gould","text":"Yeah, you're right. Well, I have a very interesting niche that I work in in that Orthodox churches in America are not a very tradition typology. We don't have a lot of old ones here. So, yeah, it's kind of a case by case invention. What should an Orthodox church look like in each region of America? And that's a way of making them fresh and new. But also, in addition to that, I really do want my buildings to each look fresh and new. I don't want them to look like copies of old buildings. I think any good traditional architect does not want their buildings to look exactly like it's 1850 or exactly like it's 1750, because in doing that would not itself be traditional because classical architecture looks a little bit different in every century through time, it always had a sort of fashionable evolution that made the people of any given decade feel like they were building something fresh and new that was important to people then and it's important to people now. So I would not say that my work is utterly uninfluenced by modernism. There are aspects of the sort of clean, crisp, sparsely ornamented modern aesthetic that I do imitate in my work, where I find it helpful, where I find it beneficial in the traditional mode in which I'm working at the time. So you'll notice that my buildings are not, you know, dripping with ornament like an 18th century building. You know, they do have a certain. They do have a certain clear rationality, a certain sort of, you know, predilection towards clear glass and bright crisp light that, you know, appeals to modern people who are used to modern buildings. So yeah, in their way, my buildings are of their time and appealing to the modern eyes of contemporary people whilst also being completely rooted in millennia old tradition of classical architecture. Yeah."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":3251.02,"end":3282.16,"speaker":"Jonathan Pageau","text":"There is also in your work there is a kind of minimalist tradition of an emphasis on materiality which I find in your work where you have a kind of great joy in the materiality of the things you're presenting. Because in some ways you are presenting the them. In a world of glass and, and, and gypsum and you know, fake walls, there's a, there's a man in which you, you're able to say, hey, this is a real thing and, and kind of feature that as part of it. Because an ancient world, they wouldn't have had to think about that."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":3282.16,"end":3282.36,"speaker":"Andrew Gould","text":"Right."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":3282.36,"end":3288.72,"speaker":"Jonathan Pageau","text":"It's like, well, this is rebuild of. You in some ways are saying, I'm doing this on purpose and I'm featuring it as a, as a part of the."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":3288.8,"end":3352.12,"speaker":"Andrew Gould","text":"Yeah. And that, and that partly comes from medieval architecture which tended to show off stone as stone and timber as timber and so forth. But that's also a hallmark of good modern architecture. The really good modern architects, the famous ones, they loved authentic materiality. They loved showing off steel for what it was and bronze for what it was. And yeah, I was taught in my very modernistic architecture education to really, really emphasize authentic materiality. You don't see that much in one of the mill modern building because one of the mill modern building is just cheap building. It's not really artistic design. But yeah, that is a certain place where you can find a sympathy between good modernism, medievalist church architecture and Asian architecture. Of course, Japanese Chinese traditional architecture has a very authentic expression of materiality."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":3354.11,"end":3356.31,"speaker":"Jonathan Pageau","text":"You've been dying to say something. Yeah, yeah."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":3356.31,"end":3406.66,"speaker":"Michael Diamant","text":"Really? I just want to say, you know, the difference between Andrew's architecture and a firm like, you know, Robert A. And Stern or most classical firms, I would say, is that Andrew create buildings with a soul. You really see that there has been a craftsman's hand on that building. It's so, you know, you feel it when you see them. That's different. If you look at a building by Robert E. Stern, the first big firm or any of the most European classical architects, it's a shape, they have a classical shape. But there is no. You don't feel that there has been a hand, a craftsman's hand. And touched it and how to say. And live in the building. So they are beautiful buildings, but they are a bit soulless. So when I see, you know, when I. Of course, I have not had the privilege to visit your buildings physically, but I only see them on all the photos that you publish on the Internet."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":3406.9,"end":3410.34,"speaker":"Jonathan Pageau","text":"It's much better when you're there, by the way. Yeah, Yeah, I. Really."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":3410.7,"end":3411.1,"speaker":"Andrew Gould","text":"Amazing."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":3411.1,"end":3477.41,"speaker":"Michael Diamant","text":"Yeah, they are amazing because they have. Even if you think they don't have that much ornament, they have much more ornament than most classical, new classical buildings. And they have this small deal that it is, I think, of a townhouse that you build on Cannon street in Charleston, and you have these small wooden cannons, you know, like columns that lifted the balcony. These things, you know, make all the difference. This enlivens a building with soul. And I've seen small ornamental details on almost all your buildings that you do. And of course, the interiors are amazing. All, you know, the craftsmanship. That is the difference between your architecture and 95% of classical architecture. And that's a problem that we have in general in contemporary classical architecture and that we discuss a lot. That they make the shapes, but they are too afraid. Or maybe they lack the artistic skills to create meaningful, ornamental. Then how to say craftsmanship, details like. Yeah, in a sense, a work of love. How to say a work of love. Not just real estate, because architecture is a place of."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":3477.41,"end":3503.71,"speaker":"Jonathan Pageau","text":"To be. It has this. It is a participative space. It's not. It's not just a place to put things in. And so, you know, when you sense the participation of the person that made the building, it increases also that sense in you that the sense that you are inhabiting a purposeful place. Right. Not just. Not just a building that could. Not just a space. It could be anything that you could be kind of moved from one thing to the next."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":3504.03,"end":3504.35,"speaker":"Michael Diamant","text":"Yeah."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":3504.35,"end":3610.24,"speaker":"Andrew Gould","text":"Well, the whole way modern architecture works as a business practice, it's extremely divorced from the construction site and from craftsmanship. Architecture offices produce a set of drawings. It goes out the door. Somebody else who has no artistic sense at all typically interprets the drawings and builds the buildings. And their goal typically, is to make the building as flawless as possible in the sense of making plastered and stuccoed surfaces as perfectly flat, corners as perfectly crisp. Yeah. So the few contemporary architects whose buildings do seem to have that human touch, they tend to be the sort of artisanal designer builders who are in charge of their own construction sites and really hire their own guys and pick up the trail and show them what to do. And I do amount of that myself. Most of my buildings are built close at hand and I'll go on the site and I'll just grab a paintbrush or grab a trowel from the workman and show him how I want it. I also am experienced at building things myself, so I know how to do that. I know how to make most anything on my own building. Interestingly, America's best architect, Frank Lloyd Wright, who falls in this interesting place sort of in between traditional and modern. His buildings have a tremendous amount of human touch soul to them. When you visit them in person, they're very small scaled, very handmade. I mean, every little detail on them just seems like beautiful little handmade, hand polished thing. And he was very much on his construction sites very, very particular with showing people how to build every little thing."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":3611.44,"end":3628.62,"speaker":"Jonathan Pageau","text":"Well, one of the problems is also the people that have the money don't necessarily have that attention as they wouldn't maybe not have the capacity or the desire to see that because they're basically making something to sell most of the time anyways."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":3628.78,"end":3691.69,"speaker":"Andrew Gould","text":"Well, a lot of Americans with money have that sort of, you know, what I would call in a derogatory sense, a bourgeois or new money taste. Where they want the look of things that are traditional as a branding thing, as a sort of virtue signaling, you know, something to Instagram, as it were. But they don't actually really like old stuff or old buildings. Like a lot of the people who commission the classical McMansion. You take them to an actual historic building and they think, oh, it's dirty, there's mildew on it. You know, the plaster is cracked. You know, it doesn't have a giant luxurious closet for me to, you know, put my shoe collection in. I couldn't live in this. You know, they actually, at heart, they're really modernists who want a very modern building that's entirely designed around modern conveniences. They just want it to have a look that is reminiscent of the aristocracy of old. So it looks good on Instagram."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":3693.29,"end":3722.91,"speaker":"Michael Diamant","text":"It's worse, it's equally bad in Europe. Everyone is new, how to say there are many upcoming people that have become middle class the last 50 years and they are so afraid to be labeled having bad taste taste. So they open a magazine and they feel, oh, I should like this today. Okay, I like this today. I should drink this wine today. Okay, I drink this wine today. You know, they have. There's no individuality at all. It's just, you know, the magazine tells them what they should like and what is considered good taste. And then they will follow that slavishly."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":3723.31,"end":3783.24,"speaker":"Jonathan Pageau","text":"Well, one of the things that I'm curious what you think because this is something I've seen here and it just drives me crazy is in some ways architectural fashion shifts where all of a sudden we have had this, I think it was about 20 ago we had this crazy shift which went from a weird kind of neoclassical, not like almost kind of like castle looking houses where they had a lot of, you know, a lot of fancy stuff. And now it's. Every single house has the same design here all through the province. It's like black with like maybe some gray stone and maybe brown with like black windows and that's it. And they're like kind of new modern, like kind of low grade modern modernist style with, with the kind of flat roofs maybe but, or very little roof. And everywhere all of a sudden it just like. And these houses just take over. Every single development has the same style everywhere. And I'm thinking that is the, that."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":3783.24,"end":3785.4,"speaker":"Michael Diamant","text":"Is actually what I described. It's, it's."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":3785.4,"end":3789.6,"speaker":"Jonathan Pageau","text":"People are afraid of these houses. They're going to hate them. They're going to think, oh, these are the houses."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":3789.6,"end":3790.08,"speaker":"Andrew Gould","text":"My parents."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":3790.08,"end":3793.83,"speaker":"Jonathan Pageau","text":"Because it's just this horrible fashion that goes through the population. Population."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":3794.87,"end":3848.8,"speaker":"Michael Diamant","text":"Because people are afraid. No, it's because people are afraid because the lifestyle magazine told them that this is what they should like. And if you are, you know, being middle class or upper middle class or striving, it's not about the money, it's about, you know, the, the culture. So you don't dare to trust your own eyes, you don't dare to trust your own taste. If the magazine tells you that this is what you should have, you buy that because we communicate in that way. So then other people will recognize that here lives a sophisticated upper middle class person because he lives in a black box. So even if they don't like it, they like what it communicates to other people that have read the same magazine and then understands, ah, this must be a sophisticated middle class person that lives in this building because it's a black building. So we are social creatures, unfortunately we are social creatures. That makes us, us do bad choices because we want to be like everyone else."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":3849.28,"end":3907.83,"speaker":"Jonathan Pageau","text":"And it's, and it's weird because we, you know, we had to remake our house about five years ago because we had, our house was flooded and you know, everybody's doing one thing here. We actually had to bend the rules of the city in order to be able to rebuild the House the way we wanted to. And Andrew helped us a little. You know, he, he designed the facade and kind of helped us to get the proportions right and everything. And it's a very simple like wooden house, you know, with, with a very kind of symmetrical windows and a nice like porch with a. And everybody stops in front of our house. There's nothing special about it. It's just, it just has a normal human proportions. Like it just looks like a normal house, the way houses should look. And then everybody stops in front of our house and everybody's surprised to see and it's just so funny and so. But it's, it's a little bit of a sore thumb because it sticks out of all of these, these brown like weird houses that are, that are being built."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":3908.87,"end":3986.16,"speaker":"Andrew Gould","text":"Well, you know, sort of fashionable house building has, has always been with us. You know, you, if you consider, you know, walking around London, you know, every, every Georgian, you know, block of townhouses in London, they all look much the same. Yeah, I don't necessarily think having a sort of a strong fashion of the decade is always bad in architecture. It's just a question of is there quality there. It's like did the trendsetters who promoted that fashion and do the architects and builders who you know, materialize that fashion, are they up to the task and are they doing good work in nowadays? They're not. Just because the entire culture of architecture and building is pretty bad right now. And of course that's not true of all the arts. You know, obviously there's other areas in which contemporary art, you know, has, has much better talent, you know, movie making, for instance. But it just so happens that there's a, there's a talent that's over the movie making things. That might be, that might be true. That might be true. Maybe, maybe. Well, where do you think the talented artists are going then? I mean, where are they going to find their home?"}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":3986.48,"end":4062,"speaker":"Jonathan Pageau","text":"Yeah, exactly. They're all terrified of AI is what's going on. But I mean I think the idea of people moving into architecture and to thinking about the environment, that's the, if we want, if we want the change to be deep, that's where it has to happen first. Because I've said this several times, but city planning and architecture is the most important art. You know, I'm not an architect, but I can see that because it, it is because it fades behind people's perception. It's actually it, it pre. Models the way that people understand who they are, what's their relationship to each other, you know, what's inside, what's outside, you know, what is above, what is below. Just basic orientation in your life is based on city planning and an architecture. And there's a deep alienation in modern living that comes from living in these horrible places and these abstracted spaces with no center and no community and no sense of relationship. And so to me, that's a call for people to take it seriously. For people who are studying architecture, that you're doing the most important thing, it's hard right now. It's hard to do it, but that is the most important thing to be done."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":4062.08,"end":4108.68,"speaker":"Andrew Gould","text":"You know, it's interesting. The people who design movie sets and the Disney imagineers who designed the theme park stuff, those are people who have very good architectural skills and who would have become traditional architects if they lived in the 19th century, but they went into the sort of virtual reality of movies and theme parks because it was an outlet where they can really do artistic work in a traditional style. But maybe what you're describing is that we're going to see that invert that people are going to start saying, you know, I'm through with working for Disney. I can't really put my talents to good use. There's too much bureaucratic and political crap. I'm going to go back to the real world and where I can do real art there."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":4109.64,"end":4116.04,"speaker":"Jonathan Pageau","text":"Yeah. We want to see that planned city that they have at Disney. Supposedly, it's not bad. Like, I haven't. I've seen a little bit of it."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":4117.56,"end":4151.25,"speaker":"Andrew Gould","text":"Having spent almost my whole life vowing that I'm never going to Disney World, I actually did end up going to Disney World because my children forced me. And, you know, I have to say, the Victorian style architecture at the Magic Kingdom is really good. It's like, it's really, really good. The detailing is totally correct. The materiality is authentic. I was amazed. I'm never gonna let anybody get away with the phrase like the Disney effect or that's Disney World architecture. Meaning it's fakey. I'm gonna see, because the actual Disney World architecture is actually really good."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":4153.33,"end":4156.99,"speaker":"Jonathan Pageau","text":"As Disney collapses, all you Disney arch text go back into the world."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":4157.07,"end":4157.51,"speaker":"Michael Diamant","text":"Yeah."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":4157.51,"end":4159.51,"speaker":"Jonathan Pageau","text":"And make. Make beautiful things for real people."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":4159.51,"end":4187.09,"speaker":"Michael Diamant","text":"Yeah. I must also add, you know, it's the film industry that saved classical music also, because if you want to hear good contemporary classical music, that's from movies, you know, the jingle of Indiana Jones, Star wars, all that is classical music. No one listens to contemporary classical music because it's just bad noise. But in the movie industry, you really got Some very good new classical masterpieces. So you. Yeah, all right, so I think we're."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":4187.09,"end":4201.61,"speaker":"Jonathan Pageau","text":"I think we're going to wrap up. But I would say Michael and Andrew, you know, to all the people listening, you know, Michael, you describe yourself as an activist. So I would say, what's your pitch? What do you, what do you want people to do? Like what, what would you like people that are watching to, to, to do?"}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":4202.01,"end":4267.1,"speaker":"Michael Diamant","text":"Well, okay, I, I. Self promotion is never beautiful, but for people that are interested, I, I can, There are two web pages that one can use and I created them both. If you go to newtrad.org there you find a directory of classical architecture, schools of classical architecture forms divided by country. And also you find an atlas. It's a Google map layers the atlas of new traditional architecture. We can find a lot of Andrew's work there. It's a complete Google atlas and you can find thousands of beautiful neoclassical projects and you can go and discover all the world and see what's happening in different countries. And through the, through the, through this web page you can also connect to the different social media pages and then you just can connect with like minded. Because the most important thing is for you as a non architect, just know that beauty and ugliness is a choice. There are no rational reasons for all the ugliness. It's a choice. We can choose beauty if we want to. That's."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":4268.7,"end":4269.74,"speaker":"Jonathan Pageau","text":"How about you, Andrew?"}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":4270.3,"end":4352.32,"speaker":"Andrew Gould","text":"Well, yeah, I would say, you know, if you're a young person who has an interest in going into artistic architecture, you know, consider going to school for it. There are some classical schools in America now that train classical architects, you know, and you might even be able to partner with a licensed architect the way I often do so that you can do projects without having to go through all of the sort of bureaucratic hell of getting licensed and so forth. There are definitely partnership arrangements that allow people to concentrate on the art side of architecture. And you know, if you're a patron, if you're, if you're somebody with money and you want to do something about the ugliness of the world, you can, you know, become a developer. You know, find, find a talented designer who can do beautiful buildings and you know, think up a project that you could do, you know, not one in a gated community that no one will ever see, but one that's like, you know, in a town, you know, find an old, find a beautiful old town that's got like an empty corner lot and build the best building in that town on that lot and put the place on the map. You know, find, find a little project with a big impact that'll really make thousands of people wake up and say, wow, we can build beautiful things again."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":4353.52,"end":4398.56,"speaker":"Jonathan Pageau","text":"That's great. That's a great call. You know, especially the one about. Cause I know a lot of very wealthy people are building these houses for themselves. Like you said, behind gates and everything. And that's fine. Obviously, if I had the money, that's what I would do for myself too. But doing it out in the community and waking people up to the effect that beauty has on our perception of ourselves, of our space and the people around us, I think that's a wonderful call. So Andrew, thank you for what you're doing. Michael as well. You know, I think this is great, important work. And so everybody, I will put a bunch of links also to Michael's social media, to the website, even mentioned to Andrew as well. And so you can check it out and, and follow through. So thanks everyone for your attention. Thanks. Thanks both of you."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":4398.56,"end":4399,"speaker":"Andrew Gould","text":"Thank you."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":4399,"end":4399.48,"speaker":"Michael Diamant","text":"Thank you."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":4399.96,"end":4415,"speaker":"Jonathan Pageau","text":"If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase. So go to the symbolicworld.com and thank you for your support."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":4415.72,"end":4478.8,"speaker":"Laura Diaz","text":"Tucson. The wait is over. Mediw Weight Loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project. Ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost the same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweightloss is ready for you. Walk in, get started and see real, real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com looking for your next Go."}
{"episode_id":"SW - #408 - 2025-09-12 - Andrew Gould & Michael Diamant - Architecture - The Most Important Art","start":4478.8,"end":4544.11,"speaker":"Announcer","text":"To Smoke Shop Stop scrolling. I've got you. Headshot.com is the number one online smoke shop, already trusted by over 100,000 happy smokers just like you. They've got it all. Dab rigs, vaporizers, glass bongs, smoking pipes, even thca flower all all in one place. Need a new daily driver? Grab a smooth glass bong or a classic smoking pipe. More of a concentrate fan. Their dab rigs, E rigs and wax accessories are designed for smoother, harder hitting sessions. And yes, they've even got legal THC flour. Best part? Every order ships fast and discreet, which is why thousands of smokers keep coming back. So don't waste time hopping between shops. Shop the best in dash fab rigs, vaporizers, glass bongs, smoking pipes and THCA flower right now@headshot.com the number one online smoke shop, headshop.com has what you need. Check it out today. Oh, and because you're listening right now, you get 10% off your next order when you use the coupon code HSHOP at checkout. Go to headshop.com now and smoke smarter."}
