{"episode_id":"SW - #021 - 2018-11-12 - Heaven and Earth From Genesis to Christ","start":0.4,"end":67.68,"speaker":"Jonathan Pageau","text":"I'd like to welcome you to episode 21 of the Symbolic World podcast. On this episode, I'm going to play for you a video that I put up last year which tries to follow a symbolic thread. One of the questions that people have asked me is how exactly do we come to symbolic interpretations, which are not just, you know, an expression of our own fancy, of our own idiosyncrasies? And one of the manners we can do that is by looking at a large scale through many stories and seeing how the same patterns repeat themselves over and over at different levels of reality. And so I will try to give up an example of that in interpreting the notion of heaven and earth from the very beginning of Genesis all the way through the Bible and into the Christian tradition. This is Jonathan Pageau. Welcome to the Symbolic world."}
{"episode_id":"SW - #021 - 2018-11-12 - Heaven and Earth From Genesis to Christ","start":78.24,"end":1773.26,"speaker":"Jonathan Pageau","text":"One of the problems with symbolism is that when you hear people making symbolic interpretations for the first time, those people can often feel like they're jumping all over the place. And sometimes some people, that's what happens. But for those that really understand the patterns that underlie things, what can sometimes seem like strange jumps are in fact a very tight and coherent web of meanings and analogies. And these analogies are built out of the extremely dense origin of something, and then they take on a more and more explicit form as the grand story, if you will, unfolds. So in terms of Christianity, the pattern begins in Genesis and then unfolds, finding its highest and most complete internalized version in the person of Christ. And in the end, these patterns are really the underlying patterns of reality. And they find their, let's say they find form in particular instances, in particular forms, and they really are the pattern that link consciousness to phenomena and map out the world as it presents itself to us. So what I'm going to do is I'm going to follow one golden thread, if you will. I'm going to try to unpack one thread for you. It's going to be a low resolution version, but maybe it'll help you to see how things can follow from the beginning and develop. So we're going to start in Genesis 1. In the beginning, God created the heavens and the earth. Now the earth was formless and empty. Darkness was over the surface of the deep, and the Spirit of God was hovering over the waters. And God said, let there be light. And there was light. God saw that the light was good, and he separated the light from the darkness. So notice there's a very deep pattern which is set up right away. First of all, there are these two Opposites, heaven and earth, they're really the two first poles, the extremes of creation. We could say the earth is described first, chaos, emptiness, darkness, and this notion of the deep. And all of these are below, we could say, and then above is the spirit, the wind of God, which is related to heaven. But then there also is the first word. And that word is for there to be light. So you can see above, wind, spirit, heaven, but also word, identity, name, right, light as the prerequisite for vision, clarity. So all of these notions of identity and meaning are related together. And together, both the heaven and earth, they give us a very powerful set of analogies by which to view things. Like I said at the beginning, of course, there is more subtlety here, but the level of resolution I'm going to take is going to be sufficient for you to at least perceive the pattern. It's important to notice that darkness, which will be in a way associated with, below, with potentiality, precedes light, okay? And in a way, it is an extension of chaos, of the void, right? Of that potentiality of creation. This helps us to understand what might seem like the stranger aspects of some of the other days, the teaming up of opposites with the stating of what is below first and then what is above, as if what is. We state potential first, the question, the frame, you know, the potentiality. And then comes light, comes word, comes an answer to manifest that potentiality, okay? So in terms of space, we see that on the third day, for example, there's this pulling of dry land out of the waters, right? And then there's vegetation. So you can imagine it, you know, like this lower waters as a kind of bottomless chaos, right? The deep, then the land itself as being slightly higher, right? Coming out of that watery chaos. And then immediately on top of that is the vegetation of this land, okay? But then right away, on the fourth day, after the creation of this, of pulling up the land and making vegetation, there is the creation of the heavenly bodies, okay? So you can see again, the opposite relation being repeated, what heaven and earth. And then a bit higher, this solid earth of vegetation, then a bit lower, the idea of the heavenly body, okay? I mean, scientifically, of course, this makes absolutely no sense, okay? And it's not as if early Christians didn't know this. Origen, for example, pointed this out in the third century, right? In scientific terms, obviously, vegetation does not come before the sun or the moon. It is a pattern of being, okay? Then on the fifth day, fish are created. So the lowest form of life, lowest in terms of phenomenological, place, right? And then on the same day, after the fish, the birds are created above as the highest form of life closest to the heaven and in a way, related to heaven, right? So this day will give us a key to understanding this notion of fish as this, as the lowest life or life hiding in chaos, life hiding in the outer darkness, okay? And this is why this image of Christ as a fisherman or the church as fishermen who put their nets out into darkness and pull in, you know, the lost sparks of life that are hiding in the void and the chaos, okay? And then the birds will play spiritual roles in many stories, and will will represent, let's say, the influence of heaven in those stories. Then finally, there is man on the sixth day. And man unites the earth with heaven itself, contains them as masculine and feminine, the two opposites within himself. We also learn in the next chapter of how man not only reproduces in himself the cosmic duality, but ultimately acts as a union of heaven and earth. Because the breath, the spirit of God, right? The spirit which was over the surface of the deep on the first day, now enters into the earth as God blows into Adam's nostrils after fashioning him out of the dust in his own image, okay? So we have this basic pattern once again. We realize that this is not a scientific description, but rather an ontological hierarchy, okay? Heaven, earth, birds, you know, all of this is described as a hierarchy with man in the middle as this microcosm, the anchor of creation, who holds heaven, meaning light, spirit, together with earth, chaos, potentiality and darkness right within himself. Now, versions of this pattern will be repeated in several places in the Bible in different ways and with different variations. But if one pays attention, one can see it quite clearly. First, when the world falls apart during the time of Noah, this is shown as a return to the primordial state at the beginning, where all is swallowed up by the chaotic waters and heaven and earth are completely separated once again. Here we also begin to see the intuitive relationship between a descent into the chaotic waters and death as the whole world and all life outside the ark vanishes into the flood. In the story of Noah, also, you can see this notion of mixture as moving towards chaos. So you can imagine the world as related to a center and identity, okay? And then chaos potential is seen as on the edge, on the outside of the world. The chaos of death will also be associated with the notion of what is foreign, okay? And so the foreign, that which is outside our identity, whatever that is, can often act as a proxy for what is unknown, right? What is uncharted and chaotic. And this you'll find in stories not only in the Bible, but in stories all over the world. The world. This idea can be shown in terms of a kind of sacred geography that can help us to understand it. So, for example, there are many ancient traditions, and you can find these traditions, for example, in the Hymns of Paradise by Saint Ephrem the Syrian. This is a book that I recommend highly, by the way. A lot of people have been asking me for reading lists. Yeah. And they're coming. Don't worry, I'll get to it at some point. But this book for sure is somewhat a book that anybody who's interested in Christian symbolism should read. The Hymns of Paradise by Saint Ephrem the Syrian. And read the introduction too. It's very good. Okay, so there's this sacred geography. The garden is set up as a mountain with the Tree of Life at the summit of the mountain. And a bit further down we have the Tree of Knowledge of Good and Evil. And then lower still, we have the wall around the garden, which, with the cherub, which protects that wall with the flaming sword. Okay? And so we can see that the fall of man is a descent of the mountain. As Adam is chased out of the garden, he goes down the mountain. And so, for example, in St. Ephrem's vision interpretation, when Cain tells Abel, let us go to the plain. So he says this to Abel just before he kills him. The idea is that he's saying, not just let us go to the plain, but let us go to the valley, right, to the low point, right? And that's where Cain kills Abel. So there's tradition will show this geographic descent to exemplify the acceleration of the fall. And so, for example, again, once again in the story of the Flood, where the sons of God go into the daughters of men, and this mixture causes these crazy chaotic giants in St. Ephrem's description of it, to help us understand what that means, he envisions the sons of God as living higher up on the mountain of the cosmos, let's say, and the daughters of men living lower on the mountain, closer to the ocean, closer to the waters of chaos. And in the flood story, for example, he'll say things like, the waters of the flood covered the entire world, but they never reached the gates of the Garden of Eden, which remained above the world. Okay? So you can kind of understand what that can mean in terms of this ontological hierarchy. Now, in the flood story, we find the first pattern of creation repeated. So as the world is Covered with water, Noah sends a dove, a bird representing heaven, to fly down and find land within the chaotic waters, participating in recreating the world after the flood. So early Christians took advantage of this relationship between the waters and death. And for example, we can see in the catacombs, Noah's ark represented as a kind of sarcophagus in the Roman catacombs, so you can see also the waters become the fish. And so in the same catacombs, you'll have an image of Noah in his ark. And then you'll have an image of Jonah in the fish. And the fish is really this sea monster, this great sea monster. And the mouth of the sea monster, for example, taken from the story of Jonah, will become an image of the mouth of hell. In later Western Christian tradition, and even in some Eastern examples, we found this mouth of the monster. And as related to death, we see it at the bottom of the ladder of the divine ascent. So the ladder of the divine ascent is the same as the mountain is this ascent of an ontological hierarchy. And at the bottom we'll find this mouth of the monster as the mouth of death. Okay? So always keep in mind, first of all, the original pattern that I told you of the waters with the spirit of God and how, in a way, the spirit of God descends to create the world. Okay? We see a very pristine example of this when the Israelites come to the Red Sea with Moses. And by Moses, action, a great wind, right? And always remember that though spirit and wind in English and in our languages are separate, in ancient languages, they were the same. And so the Israelites faced death at the Red Sea at the hand of the foreigners, the foreign Egyptians. And. And the wind from the east blows open the sea and reveals dry land. So this wind from the east, you also have to understand it as a wind coming from the origin. Remember that Eden is placed in the east, okay? And so you can imagine the east as the beginning, the origin. We see it in the sense of the raising of the sun. So this wind coming from the. You can imagine it as coming like from the top of the mountain and coming down and opening the sea, let's say, revealing the land so that the Israelites can cross, okay? And so the Israelites patch with the waters, and the Egyptians get caught in the chaos. The waters cover them like the flood covered the corrupt world in the story of Noah. So you can see this emerging, you can see emerging this general notion that sinking into the water, sinking into. To mire, for example, into the mud or into the waters, into the deep or descending into earth, you know, and how this is related to death, you know, I mean, it's obvious because we bury the dead. But in terms of a more understanding the ontological hierarchy, as in, death is a. Is a coming down the mountain and fragmenting from the one to the many. That's what decomposition is. And so descending into the ocean or descending into waters, into dark, into. Into the pit. But also we also see how all of this is related to the idea of the foreigner as a marker of death. Okay? So the basic pattern, what happens is it gets multiplied into all these different examples as if to show us different facets of this basic pattern. For example, Joseph gets descended into a cistern, right? So to then go to the land of the foreigner, Daniel, the prophet Daniel is descended into this cavern, this lion's den where the monsters are, by a foreign king. Jonah is thrown into the waters by foreign sailors, going down into the waters and facing the sea monster, okay? So the pattern is the same, but it plays out differently. But there's also a duality which gets set up in which the foreigner is both an image of chaos but also becomes an image of resurrection. Now, notice, for example, how Joseph goes into the cistern to be sold to the Egyptians, okay? But then his travel into Egypt is what will ultimately save his family from starvation. There's another even more explicit version of this where the prophet Jeremy gets put into a cistern, like a prison, and then he's pulled out of the cistern by an Ethiopian man. You know, in the biblical tradition, the Ethiopian is the ultimate foreigner, let's say, because he's so far away from our perceptions of our understanding. And so an Ethiopian man pulls him out of the cistern using these decaying, rotting rags, okay? So you can't. It's difficult to be more explicit than that. And this pattern of death saving us from death, what the Orthodox call trampling on death by death, is very important, and I won't emphasize that too much today, but I just want you to notice that it's there and that it's important. And hopefully I can explain it in a later video. So, as to the main pattern I'm trying to show you, there are plenty of other micro examples where this gets repeated, and I don't want to go into all of them. There's the crossing of the Jordan by the Israelites, the crossing of Elijah of the Jordan. Then there's Elisha's axe head, you know, which rises up and floats at the top of the waters, being raised as earth from the sea. So there's plenty of examples. But I want you to notice this example in the Psalms. There's a very powerful psalm which kind of pulls these things together. It's in Psalm 69. It says, Save me, O God, for the waters are come in unto my soul. I sink in the deep mire where there is no standing. I am come into the deep waters where the floods overflow me. I am become a stranger unto my brethren and an alien unto my mother's children. Deliver me out of the mire, and let me not sink. Let me be delivered from them that hate me. And out of the deep waters, let not the water flood overflow me neither let the deep swallow me up. And let not the pit shut her mouth upon me. Okay, so notice how he's sinking into the mire. You know, down into the deep waters, into the flood is akin to dying, is akin to be swallowed by a mouth, swallowed by a monster. Like in the story of Jonah, for example. Is it descending into a pit, Kind of descending into the earth? Not just in the water, but into the earth. But it's also becoming a stranger, becoming an alien to his own people. So all of those images that I've been trying to show you, they're all strung up in a very beautiful pattern. Now, what I mostly want to show you is how all of this then comes together in the story of Christ. There are several examples I could use, but one of the clearest seems to be the story of Christ's baptism. In the gospel of St. Matthew, it is very, very powerfully described as this, as after Christ has been baptized. It says, as soon as Jesus was baptized, he went up out of the water. At that moment, heaven was open. And he saw the Spirit of God as descending like a dove and alighting on him. And a voice from heaven said, this is my Son, whom I love. With him I am well pleased. So hopefully by now, for most of it, it will be pretty clear that this image repeats the Genesis creation story. Water below, heaven above, which opens up. And the Spirit, the wind, the Spirit of God descends in the shape of a bird, like in the story of Noah. And the voice of God is heard from the heaven, right? The let there be light, let there be of the beginning is there the Spirit and the waters, okay? And Christ appears as a kind of bridge which unites heaven and earth. You have to see it kind of like in the traditional icon of the baptism of Christ, with Christ's feet in the water, the bottom of his body in the water, and his head above, with the dove coming down. And in the traditional icon, to emphasize that even more, the way the Jordan river is displayed suggests a cave as well. Right? So we can understand that baptism is really a descent into the earth, a descent into death and into chaos. There are even versions of the baptism icon where Christ is shown standing on the doors of the abyss, the doors of. Of Hades, and crushing these snakes which are at the bottom of the world. Okay? And so the image of baptism is really a cosmic image. It becomes an image of the incarnation itself, of how heaven and earth have come together, have been fully united. But at least in the orthodox spirit, it's also a vision of how the entire creation mysteriously participates in the incarnation somehow, how all of creation can be a symbol of divinity. So one of the things that appears in the icon, if you look at the bottom of the icons, you have these strange little creatures that are fleeing, you know, the feet of Christ. In some of the icons, you'll see this. And that's from a psalm which talks about the Jordan turning away and the, you know, the sea receding from the presence of God. And so this idea that Christ descends in the waters and these images of the Jordan and the sea are fleeing him. But what's interesting in terms of symbolism is that the way they're represented in the icon, they're represented in the guise of these ancient gods, like these ancient river gods. So you can also see it as, let's say, the ancient gods or the foreign gods fleeing the presence of, you know, of Christ as he comes down into the water. Okay? So there's also this idea of the foreign being cast kind of falling away in this image. Another image of that is also in the icon. You'll see there's an axe on a tree, and that has to do with the words of St. John the Baptist, who said the axe is at the root of the tree. And the idea is that baptism is also this pruning of all the things that don't bear fruit. And so going down into death, down into chaos, is finding the essence, the origin, you know, the thing that binds you together, and also pruning and getting and cleaning off, you know, all the things which are superfluous and. And not part of what's really what you are. Okay? So you come out of baptism as purified. All right? So that's. All of that is in that image. But let's say in a larger idea, this idea of all of creation participating in this process. So, for example, on the day of theophany, which is the day on the calendar of the church where we celebrate the baptism of Christ. It's also the day where the waters of the world are blessed. And so all over the world, processions will go out to large bodies of water, and the priest will often throw a cross into the water in order to, in a way, show. But not just show, but in a way, participate in how all of this is related together. The creation of the world, the incarnation, baptism, all of these are like an interwoven web of meanings and actions which point to the mysterious way in which the universe is full of the infinite, okay? Full of the mystery of being as well. And in the service of theophany, we hear a return in the words of the service, we hear a return on some of the patterns that I mentioned here. So we hear phrases like, you are our God who drowned sin in the waters at the time of Noah. You are our God who in the sea and at the hand of Moses, delivered the Hebrews from the bondage of Pharaoh, right? And so you can see how there's this interlocking, these interlocking threads of references coming together. So then when you read certain other texts in the Bible, the pattern reappears over and over again. So imagine now, for example, Christ walking on the waters. That you can see what that can mean now. Walking on chaos, mastering the chaos of the deep. And then St. Peter, who starts to sink as he's walking out on the waters with him, and he cries out like the psalmist, save me, O Lord. I'm sinking into the mire. I'm sinking into the deep. And then Christ reaches in and pulls out St. Peter as an image of how we can be pulled out of our own passions, our own desires, our own chaos. But also he's pulling out Peter the stone. Peter means stone. He's pulling out the foundation of the church. He's creating the church as he's pulling Peter and repeating the same image that is there from the beginning in Genesis, of pulling the earth out of the sea and establishing something solid on which we can live. Okay? And so all these images come together, but let's say in terms of just interpreting a verse which sometimes might seem obscure. For example, in The Epistle of St. Peter, he talks about baptism, and then he talks about baptism. He centers it around Christ. And so he says about Christ, he was put to death in the body, but made alive in the spirit, in which he also went and preached to the spirits in prison, who disobeyed long ago when God waited patiently in the days of Noah, while The ark was being built. In the ark, a few people, only eight souls were saved through the water. And this water symbolizes the baptism that now saves you. Now, if you would read that, at first glance, you would find it very odd to see all those things put together. You know, this idea of death and resurrection. And then in the time of Noah and these giants, in the time of Noah, but. But now when you start to see the pattern, you see it happen again. I was put to death in the body, now is the earth, but made alive in the spirit. There's heaven. The basic first structure from the beginning, okay? And then he also went down and preached to the spirits in prison, preached to the fish, preached to these sparks of light which are hidden in the chaos, you know, and pulled them up, pulled them up like a fisherman pulls out the fish, okay? And then he relates it to the flood, like we've been doing since the beginning. And this idea of these spirits that were lost in the time of the flood, and then the flood is related to baptism, you know, so all of those things just kind of come together and interlock in a beautiful and very powerful way. And so you can see as this idea, Christ goes down into the. Into the waters, goes down into death, goes down to find the. The spirits that are down there in the bottom. And you can see in your mind, you know, Jonah coming out of the fish. You can see Joseph coming out of his cistern. You can see Jeremy coming out of his cistern as well. You can see the psalmist getting pulled out of the water. Okay? All of this is completely coherent. Okay? Now, this is really just a very, very tiny thread, okay? And in a way, I just wanted to kind of pull this thread out and show you and simplify things to a greater degree. But hopefully you can see just the beginning of these patterns that are there in scripture and there in tradition, and how they really can create a system of symbols by which we can act and a system of symbols by which we can view society and the world and our place in it. So I hope it was helpful, and I'll see you soon."}
{"episode_id":"SW - #021 - 2018-11-12 - Heaven and Earth From Genesis to Christ","start":1774.7,"end":1830.55,"speaker":"Jonathan Pageau","text":"Thank you for listening to the Symbolic World podcast. As you know, this podcast is, for now based mostly on my YouTube videos, which I am transferring into audio format. Please go ahead and visit my YouTube channel. There are more videos there on different subjects that I'm not going to put into audio. And please share this to your friends. I know a lot of people know about the YouTube content, but not so many people know that this is also a podcast. So share it to your friends, share it on social media. And if you can, feel free to support this financially as well by going to my Patreon page, which is Peugeot Videos. Strangely, you can go there and you can support it at any amount that you want. A month for all the patrons. I do a monthly Q and A live Q and A in which people can ask questions in the chat, and I try to have a more personal connection with people. The YouTube comments have become difficult to follow and to answer. I'll see you soon."}
