{"episode_id":"SW - #218 - 2022-02-10 - January 2022 Q&A","start":12.08,"end":7475.25,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. So hello everybody. It's nice to see right away in the chat. Dirt Po Robbins. Neil the Great is there and James Flames. For those who don't know James Flames. James is, is an artist, he's an illustrator. He's illustrated several very, very popular bands and he's a really, really a great illustrator and he kind of fell into the symbolic world and you know, interested in. In Christianity, moving towards orthodoxy. Just amazing art. You can check out his posters online. And so we've got how many people we got? We got 10 people. It's kind of nice to, to have less people and to be able to engage with the chat. I really enjoyed that last time. So hopefully this time we'll be able to do that. So a few announcements to make. I'm happy to see that Neil is in the chat. There is a new episode of Dirt Po Robin's Queen of the Night. They. They put out the first episode I guess a few months ago or about a month ago and now the second episode is out. It's truly astounding what Neil has been able to do. Obviously the music, but also the visuals, just the rich ornamentation and this kind of rich feeling of this kind of art nouveau futuristic world. Very powerful stuff. And the story of course is starting to appear. We're starting to kind of see what everything is going to be about. The characters are really interesting. So check it out. Go on their YouTube channel. It is there for free. He's doing it section by section and. And once it's all out then, then he'll probably be putting it out some way or another as a full movie. So check it out. Other announcements? I don't know. I don't have any announcements. Everybody knows what's going on in Canada right now. I don't need to announce it. But yeah, so yeah, we're doing what we can. We do what we can. And for those that are following the God's Dog stuff, it has been pretty crazy in terms of realizing hitting the logistics wall of this thing. It took forever to get the money. We just got the money about I think like a week and a half ago because Indiegogo kept telling us there was a wrong type of account and wrong type of account and it just like three times we had to go through it and so it's putting massive delays on everything. And so apologies for everybody. What we decided to do is that for those who bought the. The book, we will send everybody a. The PDF if you want to get ready to be able to read in advance because I really don't see us being able to ship this, you know, within three months because they're also telling us that there are massive delays in. In shipping, any kind of shipping, that is prints coming from overseas. So, yeah, a lot of stuff. So anyways, we'll do what we can, but we're definitely on it as much as we can be on it. So here we go, everybody. I will start. Start with the website. Oh. So, yeah, for those who are watching this afterwards, I've decided to make the Q A patron only just because I want to be able to engage with the chat. I didn't want to have these super chats anymore because it was kind of chaotic and too many questions that we reduce the questions. I have someone who goes through the questions and kind of tries to reduce them to a reasonable amount and. And then I answer them, live with people on Patreon. And then after that people can watch it if they want on. On YouTube. So it's last month we did it that way and it was great. It was. It was. Is much more human, let's say. So we'll keep doing it this way for now. All right, so I will start with people who. Supporting me on PayPal on the website. Here we go. So into the woods asks. Hi, Jonathan. Several times you've mentioned the great pitfall of the scientific worldview, that it fails to include its model of the universe in the universe. I always feel like I'm on the verge of understanding what you mean by this, but I'm desperate for a slightly fuller explanation. Thanks for any you can offer and for all you do. So maybe a good way to understand this is to maybe think of just any kind of scientific theory. So, right. A scientist. A scientist will look at phenomena or will have an insight, and then we'll try to model the phenomena into a pattern that can be quantified, that can be described, and then that can be predicted and ultimately maybe even reproduced. All right, so that's pretty much what science is. So they look at phenomena that you can quantify and they do that. Now, the problem with that model is that the model of how the phenomena interact with each other isn't part of the scientific theory. And so the problem is something like science is not scientific because in order for you to do scientific work, you have to have the model and then you apply it. But the model itself isn't part of the thing you're applying it to. It can't be right. It has to somehow be above it. It has to be a pattern. That's why in Matthieu in his book, he talks about how even in science, there is this meeting of heaven and earth where there's invisible patterns, invisible principles, and then there is potential, and there's, you know, there's manifestation or there's quantifiable things, facts out there, multiple multiplicity of facts. And the role of consciousness, the role of the person, the role of intelligence, is to join them together. And so in a way, that's why even in Matthew, in his book, he talks about how even science is ultimately symbolic, because that's what we're trying to do. Now, the reason why we insist on this so much is that one of the things that science has done, not science per se, but certain brand of scientists, what it has done, is that it has tended to kind of denigrate the pattern part of the process. And to see in our human interactions, to see the pattern part or the story part or all of these things as superstitious as an overlay, as something that is on top of phenomena. What's really important is the stuff we're studying here. But this stuff, first of all, directly in the theory, it is due to an invisible pattern. But then even on a bigger scale, the fact that you're even interested in the thing you're studying in the first place is due to an even bigger pattern, which is the fact of humanity itself, the fact of the possibility of human consciousness, the possibility of attention, of interest. All of these things which make us focus on certain things rather than others, precedes the scientific endeavor. So that's why I say things like science is embedded in religion, or science is embedded in. If the name religion gets you annoyed, ultimately, I think it's true. But you could say something like science is embedded in the social. Science is embedded in. In the capacity for intelligence, or science is embedded in human existence. Right. You could say it that way. Maybe it'd be easier for people to understand it that way, that we study certain things for certain reasons, and those reasons are not scientific. Right. Hopefully that makes sense. I hope that's explainable. All right, so David Flores asks, what is the symbolism of repairing teeth? What is the symbolism of repairing teeth? So, okay, this is the way that I. I see it. Teeth have something to do with the capacity to properly engage with the world or something like to be able to integrate the world. So teeth are the. The primary tool by which we. We eat. You know, they're the primary tool by which we take the world outside and we integrate it inside. And so when you lose your teeth or when your teeth are broken, you're not properly capable of engaging with the outside potential. So the teeth are there to break that stuff down and then make it into. Into you, basically. So that's probably why, too. Like, I think a lot of people have these dreams, like when you're really stressed out and you're losing control and you feel like things are out of your control, that you can dream that you're losing your teeth. That's one of the things people dream of quite a bit, I think. You know, you can dream like there's something wrong with your teeth. Like, all of a sudden you put your hand in and, like, your tooth falls out. Something like that. It has to do with a kind of lack of. A breakdown of your capacity to control things. You know, you're feeling helpless, feeling out of. Like things are out of control. So maybe that makes sense. At least that's my. This is really my own intuition. I've never read anything on it. Sure. I'm sure it's like the kind of union people would have. Definitely have a theory on teeth. All right, so Cormac Jones asked. Hi, Jonathan, I think I heard you say once that before you became interested in the symbolic mythology is a popular cinema, when you were younger, you favored more idiosyncratic art cinema. What kind of movies or filmmakers did you favor then and what is your opinion of them now? Were there any that were particularly formative? And so it's interesting because there was like, a weird coincidence, I guess, when I was a teenager, which is that when I was kind of coming into the moment of that moment in your late teens and early twenties, when you are. Can I say this? You're discovering intelligence, you're discovering culture, all of these things. That's when the Berlin Wall fell. And so after the Berlin Wall film, all these. All these movie directors all of a sudden that weren't so much. That weren't as much on our radar, you could say, kind of flooded into our cultural space. And so that was really the time when I. When I was discovering it. So I really remember, for example, what's his name, Kieslowski, who did the. Who did the Red, White and Blue trilogy. He also did a whole series on the Ten Commandments. I remember really getting a lot of. From those. From those also Nikita. What's his name? Mikalkov. Nikita Mikalkov. He is the Russian director. I remember seeing his stuff. But I also like Woody Allen, and obviously it was also when I was, I think 20, is when pulp Fiction came out. And so that plunged us into a whole world of Quentin Tarantino and then Japanese films and that kind of stuff. So those are the people, I guess, that inter. That influenced me the most. I would say. There's something about Kievsklowski which I keep. There was something a little arbitrary in his use of symbolism, but there was this desire to kind of create connections, let's say his series on the Ten Commandments, to create narratives that are embedded within a commandment that aren't necessarily moralistic, but are just an exploration of the consequence of breaking it or the desire to keep it. Or, you know, it was this like loose association with the commandment. And there were some interesting things there, I think. And so the same with Mikhailkov, his movie, what was it called? Forget, because I saw it in French, something about the sun. I think it was the Burning sun or something. Forget what the name of the movie was. It was an amazing movie about the rise of communism and like how the, the. Even the revolutionaries then got swept up and got taken up by the next generation who were resentful about their, their success. Yeah, so he, he made some pretty amazing movies. So, so, yeah, so those were the ones I would say. And I would say they did have some influence on me. I don't know how, how enduring the, the relationship was, but it was there. All right. Brother James asked, do you know any artists or iconographers who create icons directly in the digital realm? For instance, using Wacom, Syntiq and Photoshop, another drawing software, and then printing them and mounting them and then getting them blessed? Is that even a thing? Or do digitally printed icons always have to originate from a photo scan or a hand painted icon in real life? And side question, do you personally feel about digitally printed icons, either one source from photo scans or real life originals or ones created directly in the digital realm? And so maybe I can answer you this way. I have never purchased a mechanically printed icon. And so I have some, that is, I have some that were either given to me or, you know, in books and stuff, but I have never purchased an icon that was printed off a, an online. Where it was printed from a JPEG or something like that. So I think, and it's funny, people are going to find it funny, some people might not understand because like here's Jonathan doing NFTs and doing T shirts and doing all this stuff, but he doesn't want to have printed icons. And it has to do with hierarchy, folks. There's a power in hierarchy, which is that I believe that There is a hierarchy of materiality. If you want to look at it, I wrote an article a long time ago. You can find it on the Orthodox art journal. I think it was called the Symbolism. I forget what it was called. It was about the hierarchy of materials and how in the description of the temple or the tabernacle, there's actually a Hierarchy of materials I.e. that certain metals, like gold is mostly in the Holy of Holies, and then with some silver, and then if you move out, then there's bronze, and then there's a stone altar. So there's this, like, hierarchy of materiality which is there in the construction of the temple, but also represent manifests itself in the. In the hierarchy of the. The statue, in the vision of Daniel with that golden head, you know, the silver. Silver torso, I think. Is that what it is? The. The silver arms and the. The bronze torso, and then the. The legs of iron and the feet of iron and clay, or the toes of iron and clay. So this hierarchy is why we say. Why the ancients used to say Golden Age, Silver Age, Bronze Age, you know, that it was like this declining thing. And so that's what I think about art in general. And so I believe that when we create things for the Church, the materiality of the object, first of all, is important because we are incarnate. There's an incarnational aspect to the liturgical arts that is they're supposed to participate in the. In the space. And so they have to be born out of that material space, you know. And so I do believe icon should be made. Should be made ultimately by hand and should be made with noble materials. And so wood, natural materials, gold, natural pigments. That is the ideal. Now, I am not saying that icons painted with acrylic or that icons, even icons that are printed from a jpeg or that you buy a print of, I'm not saying they are not icons, and they cannot function at all as icons. That is not the case. But I do see it more like as this organic hierarchy, that there is a need to stay attached to these higher materials in the sacred space. Because if we're not careful and we fill up all our churches with icons that are mechanically reproduced, it will have an effect on the way that we are in the world, the way that we engage with the world, the way that we perceive the artist, the artisan, and their function in the sacred world. All of these things, I think, need to kind of be kept in place. And so if you look at the way that my art functions, I tend to really do believe in this hierarchy. And so if I make something for churches, I try to have the noble materials, the highest form of materials, gold, stone, semi precious stones, wood, and then moving down into popular arts. And as I move towards popular arts, then I'm willing to have more mechanically reproduce arts. Even if there's something. There's even on the T shirts, for example, where I do use images of holy images of protection that are guardians and you know, angels that are killing monsters, St. George, all these images that are more of the edge, of the protective edge, you could say. And then ultimately for God's dog, because of what God's dog is and because it is about monstrosity and about hybrid, hybridization and about the strange, then I felt like it was completely appropriate to go all the way into the digital and into NFTs. And so that's the way I understand that, the material hierarchy, you could say. So, yeah, I mean, people could argue with me, but for sure I'm not doing things arbitrarily, that's for sure. I've decided to do things this way because I want to participate in the fullness of the hierarchy, let's say without, without saying that the technological world is evil, but understanding that the technological world has to be in its proper place. All right, so Jay Grubb asks, what is the symbolism of Bigfoot? I mean, okay, so it's not, it's not proper to, to, to answer the symbolism of a Bigfoot, that it's maybe a good idea to understand that the symbolism of cryptids in general. And so all these cryptids that people see, whether it's Bigfoot, whether it's these different wolf men that exist in different legends in America, where, whether it's also other types of cryptids, other types of strange animals, you know, whatever the jackalope or whatever kind of cryptid that you can imagine, werewolves and all this stuff, they all have to do with the problem of the limit. They all have to do with the problem of how the margin presents itself. And so the margin always presents itself as hybrid, as mixture. But not just that. It also. And it's also aliens, by the way, if you want the, the article that I wrote, the last article that I wrote in the God's Dog Secrets book is going to be about this for those who are interested. So it's also the way they actually manifest themselves to us. So they're always not completely within the coherence of the world. So Bigfoot is always hearsay, it's always a legend, it's always someone who Saw Bigfoot furtively, You know, nobody has an actual. No, like there. No, nobody has, you know, sat down with Bigfoot, talked to him, you know, had a. Or shot him or has. Has a. Some kind of completely, let's say, tangible proof of. Of Bigfoot's existence. Because Bigfoot is this in between space. He's part of it. And all like all these other types of creatures, just like aliens and all these kind of cryptid. And so there are all these images of. Of how on the edge there's a breakdown of identity. But that breakdown of identity happens in the very way we talk about it. Not just in the monsters themselves, but in the fact that they're unexplained phenomena. Right. It's all unexplained. So the idea that something is unexplained means it's something that doesn't have an identity, that has a hybrid marginal identity. So. So, yeah. So the question is, does Bigfoot exist in the way that Santa exists? I would say that for sure Bigfoot exists less than Santa, if you want to say it that way. Or he exists like he's a monster. Bigfoot's a monster. Santa's not a monster. And monsters, you know, just like dragons exist too, right? They. They are on. They are this hybrid possibility on the edge of being. And so, yeah, so Josh the mover says, why do the Simpsons keep accurately predicting everything that happens? I don't know. I have no idea. I mean, I. I think that. But this might. This might frustrate some people because. So I. I do think that artists are somewhat prophetic just in the fact that they're making up stories. I think that the place they. The. The place where they get the stories that they make up, that intuition, part of it is something like, you could say it's something like early pattern detection. Right. So if you think about it just in terms of kind of evolutionary terms, why would people make up stories? You know, why would they do that? And it has to do with the idea of what is it that Jordan Peterson says, something like die, die in your stories. Right. So you don't die in real life. So you create stories in which you experiment with reality so that you don't have to go through all the possibilities of being, and you don't have to experience the negative things that other people have experienced. But I think there's also probably something like that, but also a kind of early detection pattern capacity that we have, which is that some people are capable of intuiting what is just over the hill and Then let's say making stories out of it. So that explains a lot of stuff. I mean, there's not just. It's not just in the Simpsons. If you could. If I could make a list for you of how many series and even movies just before the pandemic were pretty much laying out what the pandemic was going to be about, you know, and so, I mean, it's pretty amazing. So some people see direction in that. Some people see, you know, a kind of. A kind of centralized programming, which. I mean, maybe it's possible that that's part of it. I don't know. It's possibly. There are people with a lot of money and a lot of power who are trying to. Who are trying to direct how the future is going to happen. That wouldn't be completely insane, but you also don't necessarily need to have that for it to happen that way, you know, because I think. I do think that storytelling is, in part, a kind of early predictive modeling, you could say, you know, in order to help us prepare for that, which is that we intuit to be over the. Over the hill. Because it. How can I say this? It's like people. People always think it's weird that you can predict the future, but it's like you can always predict. Everybody predicts the future all the time. There's nothing weird about predicting the future. It's just that we predict the future at smaller scales, right? It's like, I know that this month is going to be cold, and I know that this month it's going to be warm pretty much. It's not 100%, but I know these things, and I know that, you know, I know that if. If I watch my kids poking at each other, if nothing happens, they're going to start fighting. And kids know that about their parents, too. They know that if mom is sitting with her arms crossed or whatever, and dad is. Her dad is doing this, that it means it'll probably be a fight tonight. And so I think that there are things like that for society where societies, or let's say very sensitive people in societies can intuit by the patterns that are happening now what's going to happen. And sometimes it can be pretty. Pretty precise, actually, and sometimes it's vague. And, you know, I don't find any of that very weird at all. I don't think there's no. You don't need a hocus pocus and magic to believe that it's possible to intuit and to predict some aspects of the future. Neil says Cryptozoology was my dream job as a child. You can still do it, Neil. You can still do it. Go find Nessie or whatever the name of it it is. All right, and so here we go. Let's keep. I need to keep. Continue to pay attention to the chat. That was the whole point of this, right? All right. Eric Salander asks. Hi, Jonathan, and thanks for a great conversation. I would like to know more about the symbolism of iron. Thor is said to need a pair of iron gloves to use his hammer. And also when handling a lightning bolt, there's also a giantess said to dwell in an iron forest. As always, thank you so much. And remember, God is still good. So thanks, Eric. Yes, God is still good. So I really got. I already talked about it, strangely enough, and when I talked about the hierarchy of. Of materiality. And so a good way to understand the hierarchy of materiality is to understand, especially in terms of the metals, is to understand that the higher on the hierarchy of the metal is, the more precious it is. That is the least of it there is. The more, let's say, incorruptible it is, right? That is, it lasts longer. You could also say that the more that it's related to light, that it has something to do with a certain amount of light in it, but then it's also softer, it also has less power in the physical sense. So it has a lot of meaning. It's precious, it's full of light, but it can't. It's not strong, it's not powerful. So now the lower you go on the, on the, the hierarchy materiality of metals, you know, you move towards silver, which is also very light, but tends to tarnish. And then you have bronze, which is darker and is stronger than silver, stronger than gold, but tends to also corrode, but not that much. And then you move down to iron. Then when you get to iron, then you have the metal that is the strongest but is also the most fragile in the sense that it, that it rusts and it. And it. And it can just vanish it if, if you leave it out into. In the, in the rain and the sun. And so there's an. Iron is plentiful, like there's plenty and plenty of iron, and it's much stronger, but it's also more fragile. It's less malleable than gold or silver. Right. It's hard to make a ring out of. Out of. Out of iron. It's easy to make a ring out of gold. And so that's the material hierarchy. And so in, for example, in the vision of Daniel, on the bottom of that, then you have something like the hybridization where you have iron mixed with clay. So think of it. I always think that iron mixed with clay for us is something like plastic, right? Something like plastic, which is uber plentiful and is extremely fragile, but is also like, let's say, fills up. Like, fills up the. Filling up the ocean, right? So plastic is filling up the ocean. That's the last thing you can also understand in terms of like. In terms of like, if you want to think of it, like, if you. If you take a precious metal and then you make a coin out of it, then what the government will want to do is they might want to debase the coin so they'll add another metal. They'll hybridize it. And when they hybridize it, then they make more, but they make it less precious. And so you can think about all that. So the reason why there's a relationship between war and iron is super important. You see that in scripture because often you get these peoples that have iron chariots, and these people with iron chariots, they're like, they're the warriors, right? They're the. They're dangerous because they have these powerful iron chariots. And so that would be why giants would live in an iron forest, for example, or that Thor would need iron gloves to use his hammer. Okay, so Bogdan asked, hi, Jonathan, how do you distinguish between an enchanted world in the medieval Christian sense and a sort of animist worldview which acknowledges the spiritual aspect of all things but is not Christian? Is it purely a matter of having the proper hierarchy with God at the top, or is there something more to it? Thanks for all your work. And so I do believe that it is a. The difference is what you said. I think the difference is that in the truly kind of the real, the true cosmology is to have. You can have a hierarchy of intermediary beings, but they are ultimately all dependent on the one, on. On God. And. And then they, you know, their powers or their authority flows from the One. And so in the different mythologies, you see that at some point, in many of the mythologies, there's a revolution in the heavens. There are some gods that try to get power from the higher God. And that's when different paganisms appear. And then that's when animism, I think, starts to appear. And so actually, contrary to the belief, I think, of a lot of the anthropologists and all that kind of stuff, because anthropologists look at animist societies now and they think that somehow those animist societies, their reflection of what was there, you know, at the origin, you know. Okay, I don't know how you say that, but I. I honestly think that it's probably the opposite. I do. I. I probably. I think that there's probably a breakdown that happened at some point where the abnormal hierarchy broke down, and then. Then all these different gods. And you can see that in stories like the story of Babel and things like that, where the different gods kind of spread out, and then people started worshiping. And so the problem with animism is that you become slaves. You either try to weaponize the principality, but you try to control it, or it controls you. And it's just this relationship of control, which is that you try to control the forces of this space or of this area by propitiating it, by. By, let's say, trapping it in some magical way and then using it to your advantage. Or you are kind of a slave to this thing, and you have to. You have to propitiate it in the sense of stopping it from hurting you. Right? You have to keep it at bay so that it doesn't hurt you. And so that is the difference, I think, between. And so this. This kind of traditional hierarchy is not. It's there obviously, in Christianity, but it's there in other traditions. It's not just there. You know, you see it in. In kind of Advanta Hinduism, you really do see something like that. And you see it in. In the Zoroastrianism, and you see it in. In, you know, there are some moments where other cultures where you can see these types of. This type of hierarchy. So the idea that. The idea that there's only that Judaism and Christianity and Islam are the only place where this kind of structure exists, I don't think that's true. I do think that for sure. Christianity, because it reveals. It reveals love as the source of. Of all things, and it also reveals self sacrifice as the mode of being that is the most proper to. To being in relationship with the divine. You know, I think it's the best, but it's not the only one that has something like that. All right, so a popper asks, what's the difference between thoughts, ideas, categories, and spiritual beings, angels, powers, principalities both in how we engage with them, host, give them body and their impact on who we are, our identity, first of all, in yourself. So maybe a good way to see it would be to understand the fractal nature of. Of reality, you could say. And so there are certain of those things which are inside you. And so thoughts, ideas, or inside humanity, you could say it also inside you. Thoughts, ideas, categories, all of this is. Is within you. And these things, they have a more active role than sometimes you might think they play out as programs. You're not as much in control of those things as you wish you were. Let's say. Ultimately the idea would be to have you as a. As a centralized being. And no matter how you phrase it, in a way it doesn't even matter. Like a lot of these categories, when people ask if people have souls and all this stuff, like, I mean, yes, but you understand it is what you need to do if you want to know what it's about. And so that there's. That there's something which binds you all together, right, that holds all of this multiplicity of thoughts, categories, let's say thoughts and ideas, first of all, right? That's mostly, let's say, within you. And then there are spiritual beings which are something like that, but they're more active and they're more cosmic. That is, they are the cosmic aspect. So as you, as a microcosm have, you could say you have these little desires and thoughts and gods, like little gods in you. You want to understand it that way. You have these little thoughts and ideas and desires, and they're all inside you and they're all fighting and they're all trying to have power and they're trying to get power over the other. They're trying to get your attention, and they're doing all these things. They're trying to get all your resources. They're doing all of this. And then hopefully you can align them together so that they are. They flow naturally from your. Your. Your identity, you could say. And then in the world, then there's a version of that, but it now it's a cosmic version. So there are principalities which act in the world, which bind groups together, which bind. Which bind all these things, all these, the way in which the world manifests itself together. And ultimately, when they're not, let's say, brought together under God, then they tend to create conflict and to create conflict. So the mystery, which is maybe difficult, the mystery is that in a certain manner, all of this ultimately is resolved by, you could say, man or by the incarnation. And so the perfect union of God and man is actually the place where all of this resolves. And so there's a certain man which, although these spiritual beings, which are more cosmic, have a different. On a different scale than your thoughts and your desires and your Ideas, ultimately they are, let's say ultimately they should also be subject to man. Man with a capital M, right? The incarnate man and the manner in which we participate in that as human beings. Hopefully that makes sense. Now what's interesting is you can see that there's a relationship between the cosmic beings and you inside. And so that's why you could say something like, that's why demons affect you. Because the demon is a demon of pride or is a demon of this, which is also inside you as an invisible desire, an invisible thought pattern, or an invisible motivation that you have. And then those are connected to the cosmic version of that. So all the imagery of like a demon oppressing you or a demon possessing you, all of these things are because there's a direct relationship between the way you are made and the way the cosmos is made. And so sometimes you can read text and it almost seems confusing. It's like, is it this person's sins, desires, or is it a demon that's oppressing them? And ultimately there's a way in which it's. It's always both at the same time. Because there's a. There's a cosmic reflection. Let's say when you become a slave of a passion or of a thought pattern or something in you, you are ultimately participating in the existence of that in the bigger world, right? So if you're. It's not, it's not magical, it's not, it's not, it's. It's. It's really very basic. It's like if, if you are tempted to be greedy and then you give into that thought pattern and that desire and then you, you act in greed, right? Then that will connect. That is what will make greed grow in the world and there'll be more greed in the world. So you're feeding this demon so that the world itself will become greedier. Because the world doesn't become greedier unless people become greedier. And. But you could also say, like, if the world becomes greedier, then people will also become greedier. There's like a top down and a bottom up relationship. Um, and so I think that that's the best way to understand it. And so now in terms of categories, categories seem a little less active, but they're nonetheless active to a certain extent. It's not exactly in the way that you would think, but you can understand that. So it's like, let's say I have a category, I have a. A pen, okay? And so this pen is a category. It's an invisible pattern. But this pen has subcategories, right? We've talked about this many times. Now, this is going to sound weird to you, but the category of the pen is actively holding together the subcategories which, which make it a pen. This is ultimately happening through us, that it's happening through men. Like I told you, ultimately, all these patterns are actually ultimately bound to. To. To man. But there's something less neutral about that, say, the man in which categories bind other categories to them. The man in which categories participate in higher categories as well. There's a judgment, right? There's. There's a. There's a judgment which is happening. The pen is judging whether or not this or that can be part of it and is judging it by its purpose, by its teleology, right? If I make a. If I make a. A pen with a snowball, the pen is going to reject it. The pen is going to judge it, and it won't be a good pen. And, and like I said, we're not excluded from that process. We're part of that process, but we can nonetheless describe the world that way. And it's completely. It's completely coherent. It's actually, I think, more coherent than. Than if we describe it in another way. Nu mash says Esau and David's physical description are very similar in Scripture. Both are described as ready, yet one is a hunter and the other is a shepherd. What is the symbolism of their physical descriptions with their contrasting treatments of animals? You did have definitely caught on to something there. That is, both David and Esau are red. That's very important. That is, there's a connection between David and Esau. You could say one of the reasons why David is close to the Messiah or that David is one of the only persons described as the Messiah in Scripture is because he is one of the characters that is. That is the closest to being able to reincorporate Esau is maybe a good way to understand that there are certain characters in scripture that try to reconcile Esau, but they don't succeed. You know, like Samson, for example, but not totally succeed, but David comes closer, and ultimately Christ is the one who succeeds in joining David and Esau, you know, and so if you want the idea of a hunter and a shepherd, it's a little harder to see because we have to expand the definition of hunter to a fisherman. So fisherman and shepherd, the one who gets the fish, brings them in, integrates them, and then the one who actually also cares for the sheep, that's Christ, is both fisherman and a shepherd. So hopefully that helps. All right. All right. Kulak asks, hello, Jonathan. What are your thoughts on the apparent pattern of the outsider from the minor realm coming to rule great empires during time of crisis, often with violent consequences? Examples are Napoleon, the Corsican, Hitler, the Austrian, and Stalin, the Georgian. Is this pattern a fallen form of the stone, of the stone builders rejecting, becoming the cornerstone? And in this way, is it a kind of Antichrist praying for you and your family up in Quebec? And so. So, okay, this is a little tricky. So let's think of it in practical terms, Right? Let's think of it in practical terms. So you have. You have groups that are fighting. Say you have a nation that isn't holding well together, that is kind of falling apart and fighting and infighting. And so it's fighting so much that no one of the groups that are represented in the fight could unify them. How could they? Right? They're too much. They're too much part of the fight. And so in this sense, this is why in these types of situations, that the stranger or the one who comes from the outside can come in and is able to go from the last to the first by recapturing the. The potential that is fragmenting, you know, and so that's what is happening there. And so that is definitely a way that that can happen now. It can happen for ill, and it can happen for good. It. It can happen either way. And so it can be an image of Antichrist, but it can also be an image of Christ himself, you know, so you can understand something like that's what Christ was to the Roman Empire, right? And so. So I think it just depends on what the. How that pattern plays out. And so that pattern could play out as a form of. As a place where it actually brings this identity to cease existing because the outsider comes in, captures the potential, and then turns it into something else completely. But there's also a way in which that can also be a kind of preservation. It's also possible that that happens, and then it kind of preserves. And so I think that this is why understanding this can maybe help you understand some stranger symbolism. Like, you know, if you think of Alexander the Great, for example, like, why are the legends of Alexander the Great that he was, you know, the son of a. Of an Egyptian priest pretending to be an Egyptian God or something like that, you know, why. Why is it that King Arthur is the bastard son of Pendragon, you know, and there's trickery involved and there's all this stuff. There's a sense in which the the character that brings things together is, is, can have some of that in it, in him. Yeah, but like I said, it's not necessarily. It does. It's not always for the, for the good, but it definitely can be for the good. I do definitely believe that in the case of Christ, it was for the, for the good. All right, Scotty says, what is a good story for understanding the pattern of prophecy or prediction, the good and the bad? I don't know. I don't know. I'd have to think about it. That's too much on the top of my head. A good story for understanding the pro. The pattern of prophecy or prediction, the good and the bad. Let me think about it. I might not be able to answer by the end of this, but I'll think about it. So Joel G. Caesar asked what is the symbolism of killing 1,000 men with the donkey's jawbone? Yeah, so we're talking about, we're going to talk about Samson, are we? So, yeah, so that's what a donkey. So the donkey is a, is an impure animal and the donkey is also a, a beast of burden. And so killing and your enemies with the, the donkey's jawbone is something like capturing the power of the, of impurity. You're capturing the power of the margin and using it against, against your enemy, you know, and so because the, the. It's funny because this is actually related. This is going to sound weird to a lot of people, but this is actually related to the speaking donkey in the story of Balaam. So in this, the story of the speaking donkey of Balaam, there's a way in which the, the, the power of this margin is made to speak like the power of the impure. And the bird of. It is made to speak in order to preserve the, preserve Balaam. Preserve Balaam from being judged. And in this case it's something like the opposite of that, where it's similar in the sense that it's, it's like wielding the power of the impure and the, and chaos in order to destroy your enemy, you know, but all of Samson's story is always about the, it's always about the same thing. It's. Right, it's, it's about this, you know, and, and the power of this. You trying to use the power of this, you know, like Matthew talks about in his book. So it's finding, finding honey in the carcass of a dead lion. So killing a thousand men with a donkey jawbone is actually the same symbolically as finding honey in the body of a dead lion. You know, I always feel like I'm not making it clear when I stay in the analogy world, but at least for now, that's as close as it's, as it's going to get. All right, and so subscribestar, let's watch subscribestar. All right, so why Jacket asks, what is the symbolism of cancer? And do you think that cancer is random or the luck of the draw, so to speak, or is it manifestation of something bigger in a person's life? Do you think the particular type of cancer is also meaningful? I. E. Leukemia versus Ovarian man? So I don't, I don't think it's impossible for diseases to have meaning. I think that certain diseases, I wouldn't, I wouldn't link it to always to a, like a person, but I think in, just in terms of a general culture, I think that diseases can have a, can have a meaning in terms of what's going on, let's say in the, in the social sphere. And so I kind of joke a little bit that, you know, Covid is the opposite of aids. You could say it's like, you know, it's the, it's the end. Covid is the end of the carnival, right? Because Covid is, has something to do with an excessive immunity reaction. And so people die from the immune reaction to Covid rather than the disease itself, it seems, which is why, at least in my understanding, which is why there's so many, a lot of vaccine seems to be causing some of the same effects to some people than that the disease is causing because it's actually your immune system which is, which is making you sick ultimately. Whereas AIDS was the opposite of that. AIDS was a breakdown of the immune system, right? It's like open to everything. The body becomes open to anything. And in Covid, it's like the body closes down and starts to actually destroy itself by being closed down. So it seems like these things have meaning. And I think that for sure, I think that cancer in general is something like a, a breakdown through pride or breakdown through not the body not being fully aligned with itself. And so certain parts of the body try to try to propagate and preserve themselves at the expense of others and end up killing the person by trying to just self perpetuate and try to, to make it make itself like a kind of weird parasitical thing within your own body where certain cells don't want to die and they, they, they, they, they're not willing to die. They just want to, to continue to live and to propagate themselves until. Until. Until you die. So I think that's meaningful. But I don't necessarily. I don't necessarily think that it's not necessarily attributed to the individual, I think, who has the disease. I think ultimately Christ gives us the most powerful vision of that, which is that as Christians, at least, the purpose of disease in our life is to manifest the glory of God, whether we are healed miraculously, like it happens to some people, or. Or whether we manifest God in our dying. And that really happens. You know, you see people the way that they deal with disease. My cousin, who's my best friend, died last year, 2020, actually. Sorry. And. And he. And the way he died was amazing. Like he was transfigured because he died with so much. So much dignity and so much peace. And so I think that that's really the ultimate meaning that disease can have. As Christians, at least that's how we should. That's how we should deal with disease is to understand that it should be transformed or flipped into glory by the way we deal with it. All right, so is there anything interesting going on in this chat here? Not sure. All right. Sorry, guys. In the chat, it's like, I'm looking for questions in the chat. I don't see any. Usually people will ask questions in the chat. I guess now they've all asked questions in the. The Q and A, so they don't have to ask questions in the chat. All right, all right. Lisa Parrot says nothing interesting is going on. So XRD says, hi, Jonathan. I saw an article which revealed that since 2005, January 6th is the day with the most deaths on average. Any thought on that? No, I've got to think about it. I mean, January 6th is. Is interesting because it's. Isn't January 6th last day of Christmas? Right. The January 6th is the. Is epiphany. So you could. If it's the. If you understand, it's the last day of Christmas or the. The. The last day of. Of. Of foolery. Of fooling, let's say. Maybe I don't have to think about it. I have to think about it. Sebastiano Gerardo says, I asked one. I don't see it. Where's your question? You need to ask it again. So let's go to Patreon now. Here we go. So Kenan Wang asked, what relationship do you see between Frodo showing Gollum mercy to be betrayed and Jesus choosing Judas as a disciple? Huh. Interesting. I never thought about that. I mean, it's interesting. It's interesting because you could say, I mean at least in the, I don't know if there's relationship to Judas and Christ, but for sure it's interesting in the sense that Gollum is the one who ultimately ends up destroying the ring despite himself. And so Frodo showing mercy to Gollum ends up being the Met, although seemingly unwise at the time, ends up being the mechanism by which the ring ends up being destroyed to the judgment of Gollum, but nonetheless. So I think that's definitely interesting to think about. That'd be definitely interesting to think about. So you could, you could kind of see it that way. You could see that, you know, to the judgment of Judas, you know, Christ knew that he had to be to die and so he chose Judas and gathered him in. And then Judas betrayed Christ to his own judgment, but ultimately to the salvation of all. Like so it's like Gollum wasn't acting virtuously when he tried to snatch the ring from Frodo at the last minute. He was being extremely selfish and self interested but he nonetheless, nonetheless brought about salvation despite him. And I think that's something that is true about Judaism as well. So yeah, actually you're right. Good, good, good observation there. All right, so there you go. See what is Serban Gerardo in the the chat asked concerning our sanctification, how true is it that we are supposed to choose Christ instead of good or evil? I read that from a Protestant book, which makes it suspicious, but it sounds kind of orthodox. I mean I, I, I'm not sure what that totally means. Like I could understand what he means in the sense that Christ is beyond petty morality, that's for sure, and that the things that Christ asks us to do are beyond the, are beyond the kind of moralism or the kind of legalism that you could engage with. So in that sense I think that it's true. But ultimately that ends up being a higher good is the best way to understand that as well. All right, one more question from Bob Briggs. John Fitchell, you're the Ronin. What do you mean? If you can say on state control media. Lol. All right, so everybody saw that I changed my, my, my profile picture for a Ronin, a version of a print that I, that I actually acquired last year. And I, I've been writing Year of the Ronin. It's just because I'm going to start very soon. By the way, I'll show you next. Probably one of my next videos is going to be about the role of the misfit in a tyrannical system and, and we're going to talk about King David and how he, how he deals with King Saul, who tries to. Who, who tries to jab him and pin him to the wall, let's say. And so we'll look at that and we'll look at other stuff like that. And so I think that that's what's going to happen. And, and also because in my case, you know, we're moving into illegitimate illegitimacy at some point, you know, the way that things are going here. Yeah. There's gonna be some tough choices to make very soon. So go back into the, back into the Patreon. Question Chasing Lindsay asks. Hey, Jonathan, before the modern age, why were cats associated with demons? I've heard this belief led to a mass killing of cats during the Black Death outbreaks. What kind of symbolism is behind your pens? Killing cats during these outbreaks, when letting them live might have helped prevent the loss of life? Or are these two facts about cats just a fabrication of modern times? Thank you for any insight, as usual, I would say, for sure. I'd be very suspicious of all the things people say about the Middle Ages. I don't know if that's true. There's so much nonsense people have said about the Middle Ages. Not just the Middle Ages, just so much that no one. Like, for example, when people tell you that the medieval didn't bathe, all this kind of nonsense, it's all made up, none of it is true. It's just complete nonsense. People see anecdotal things in some text and then they make it into a rule about everybody. What people say about the Middle Ages is used mostly hogwash. So I'm not really sure that that's true, that. That they would be killing cats. Maybe they did. I don't know. There is such a thing also as panic, you know, and so the kind of things that people did in the plague, let's say, during panic, that kind of desired to scapegoat and desired to find someone responsible. And the desire to find something to do in order to avoid getting disease is something which we will look back on this, this situation, and we will do the same. Look at those silly people thinking they're going to stop a disease with this and that. When, you know. And so I would say, yeah, I don't know. I don't know. All right. But if you want to know why the early moderns might have said that about the medievals, it was probably had to do with the fact that there's a. The legends of the witches familiar it probably has something to do with that, which is the notion that, that witches would, would, would have a. An animal that was something like the projection of them, that they would project their spirit into this animal. They could control it. That it was a kind of externalization of that, of the witch's being. And so I could imagine that that's why stories like that would have appeared, which is that with a cat, because a cat is an animal which is, it's a domestic animal and it's a, it's a domestic animal which is sneaky and hides and, and you know, does all these things that, that it would have, that people would think of stories like this. So that's the best I'm going to do with that. So Douglas Horse says, keep the Ethiopian vids coming. I'm doing it. I'm supposed to have an interview with, with Deacon Enoch that I talked about. I talked with him on my channel. I'm supposed to be on his channel at some point, but I don't know when that is. Should be soon. I hope it's soon. All right. M. Shafer asked. So I recently watched you say that fractalization is tied to death. Also, it seems to me attention itself is a kind of death giving out of yourself or giving over yourself. But in order for creation to be good, wouldn't there have to be a disintegrative attending or sin and non disintegrating attending or love or is creation the death of God? Whoa, dude, that went fast. Are sin and creation equivocal? Sincere questions for a Roman Catholic. All right, so, okay, so yeah, so breakdown is related to death. Okay, so let's look at it this way. And so, all right, so exteriorization and breakdown and multiplication and fragmentation is related to death, but it's also related to other things. It's not just related to that. It's also related to filling, empowering and adding power to your identity. And so a good way to understand it, like in terms of the fall would be, you know, a kind of mysterious idea, which is that when Adam and Eve fell, they fractured human nature into multiplicity of individuals. And that fracturing brought about a world of death. Because the fracturing happened fractally. It happened in the human nature going, going towards multiplicity of beings. But then in the human person is a breakdown of human desires and human passions and human needs that now began to compete with each other and fragment and break apart. But ultimately the secret is that this will ultimately be the filling up of the world as well. So that this, this fragmentation Once it is gathered back, maybe is the best way to understand it. Once it's gathered back, then it's actually going to become a fullness, a fullness which was not there even at the outset. And so you can think about it this way. Let me give you a simple example, as simple as examples I can find. So you put yourself in a new position, you start a new job, and you've never done it before. And so you have a knowledge, you have a moment of knowledge where you're. You're cast out of the garden, you're put into a position where things don't make sense, you don't know what it is. And so you. It's frack. It breaks down the stuff in front of you, everything looks chaotic, nothing knows what it is. And so that's painful and it's a kind of dying. But ultimately, once you're able to master that new reality, this new job that you have to do, and you integrate it, then it's actually a fullness and it's more than you were before. You become more than you were before. And so, yeah, but you could. A job is maybe not the right way to see it because it's maybe more like something like a bad luck. You end up in a situation you hadn't planned, you've never done it before, you break down on the side of the road and you've never changed a tire before. And so it's like, yeah, pain, suffering. You look around, you don't know what to do. You look at all these things, you look at a jack, you look at a wheel, like, what is this? I don't know what to do with this. And then you work it out and you suffer and you're. And it's painful. And once you're done, then that problem, that problem that happened to you at the outset has become an opportunity to become more. Hopefully that makes sense. And everybody's talking about cats in the chat. Yeah, yeah. YouTube and cats. Huh? We thought that was over, but I guess we're still dealing with that stuff. All right. One from the chat, Frederick Gopherschmidt asks, what's the symbolism of the laying on of hands and its connection to the apostleship? I mean, it's just action, right? When you act in the world, you act with your hands. So if you're hammering a nail, you're using your hands. Pretty much everything you do, you do with your hands. And so it's not completely strange or odd that if you were going to transmit some authority on someone, then you would do it by your hands, right? So like you can bless, you know, a priest will bless with his hands. But like the idea of like putting your hands on someone and then speaking so that, that's how you transfer some kind of, some authority or some kind of role, you know, it's just an extension of everything you do with your hand basically, I think is a way to understand it. All right, so Reuven Korf in back into the questions. I'm just about to begin working as an English teacher and my school has allowed me complete creativity as regards to novels, films to teach my class. Example. The text could have really been in another language just as long as it has been translated into English. Are there any high school age appropriate novels and films that you would recommend that I teach for their symbolic richness and resonance and, or any particular books you would recommend for me as a teacher to help me approach teaching my classes with a symbolic hermeneutic? I mean, if I was you, I would, I would teach the classics like I would, I would teach the, the old stories. That, that's what I would do. And so, you know, I would have them read a prose, maybe a prose version of the, of Odysseus. That would be great. That's what I would tend to be. To do if, if it was you. And so in terms of the films, then I would choose films that have kind of powerful symbolic stories in them. You know, like I always talk about the, the Ghibli studio films I think are really great, you know, but even, but I think you can get stuff from popular fiction. The thing about the thing is, the thing that can be interesting is rather having a popular fiction movie, like a Marvel movie or something, but then surprising people, which is how coherent it is. And so for example, studying a more traditional text like Odysseus and then showing how some of the, some of the tropes are there as well in, in these modern movies, you know, and so that's what I would tend to be doing myself. All right, so Marcus Shara says I became Academy on Sunday largely thanked your videos. Wow, that's wonderful. Glory to God. Have you ever read anything by the pragmatists? American pragmatist William James Charles Sanders Pierce, they both defended lives of faith as opposed to strictly modernist rationalist worldview. Pierce also developed a theory of icons and symbols. I know that Peterson has been influenced by them and I'm afraid to say that no, I have not been influenced by them and so I don't know much about, about them. Sorry. So Jeremy Fierth asks, can you talk about the symbolism of stoning a person? Is it related to the heap of stones that Jacob and Laban used to make a covenant with each other? It's definitely related to a heap of stones. I don't know if it's related to that particular heap of stones. I would have to think about it. It's definitely related to the difference between bordered stones and a heap. The difference. This is actually the difference between a, like, let's say an ordered building and a pile. Sometimes people, because they can't see the difference between a pile and a. An ordered group of things, they can sometimes get confused. But I think that's what it has to do. It's like burying someone under a pile. And a pile is like a disordered thing. A pile is like a, you know, a disordered. And I it. So I think that's probably what it has to do with. I'm sure Matthew would have way better insight on this. So Corey Ford says, does God ultimately reconcile all beings to himself? Or will some forever remained estranged? What's the big picture pattern? At this point, I'm generally persuaded by David Bentley Hart and Thomas Talbot, Following Origin, Gregory, etc, the ultimate reconciliation is true. I mean, if you watch my videos a while, you'll see that I. To me, I think that I definitely see that it all points to a fullness, like it all points to an ultimate reconciliation. You see it in the words of Christ, you see it in the words of St. Paul, you see it in the pattern that's right there in St. Gregory of Nissan Maximus. And not just the things they say, like people say, like Senger Garnitze has a few sayings that he has which suggests that. But it's not saying. It's like the very structure of the life of Moses tends to point to that and the very structure in Saint Maximus. But the reality is that the tradition, that there is a. That there is a kind of absolute casting off, a kind of eternal casting off is something which is there as well. It's there in the tradition. And I think that it's difficult when people try to. I think there's probably a reason why those two coexist. You know, someone told me about. Because we have this wonderful homily by St. John Chrysostom on Pascha in which there is this very powerful, beautiful image of this idea that all are called to the feast, like all will participate, no matter if you fasted or if you didn't fast, no matter what you did. Today is the celebration of the resurrection, all are called to the feast. And there's this powerful image. And then I remember a priest reminded me that if you read St. John's homily on Easter Saturday, or like the day before, let's say, before the Resurrection, then it's the. It's the other tradition. It's really about. About you know, suffering and, you know, the. The suffering brought about by your own. By your own passions and how. Yeah. And so. And how that is. That is a reality. Like it's a real thing. And so I tend to just leave that as an aporia myself and not try not to resolve it in the manifest. Like, try not to resolve it in. In a statement. Because I think those two traditions are there for reason, and they're there to kind of. Because there is a reality. And this is something that I've noticed and, you know, is that I've noticed that when people openly advocate for a kind of universal salvation, they tend to start to dismiss things. They tend to want to swallow the hierarchy. They tend to want to dismiss the hierarchy. And there's a weirdness that comes with it. Like there's a kind of. There's. There's a kind of strange. Yeah, there's a kind of idea. There's a kind of strangeness about that, which is all trying to destroy the world. Almost like there's the. A tendency to want to destroy traditions, destroy forms, as if it's all. It all ultimately doesn't matter, even though people will never say that. But there's a weird attitude that comes with that. And so I think we rather should be humble about it and see in the stories, see in St. Gregory of Nyssa, see in the words of Christ and in the words of Paul, like this amazing sparkle of this possibility and the amazing sparkle that. That, you know, ultimately all will be resolved, but also fear for our own. For our own passions, and see that we are very far from that and that we need to take this stuff seriously, you know. And so that's my take on that. And so I would never advocate for the universalist position ever. I think it's dangerous in many ways. So sorry to you universalists who watch this and not sorry at the same time, because I think it's the most traditional position. So. All right. So Dean. Dean Parker says, hi, Jonathan. I hope all is well. Is there much difference between the Platonic forms and the patterns you talk about in your videos? And so there's definitely a relationship between the two. I think that the more ancient cosmologies are probably closer to what I'm talking about than the Platonic forms. Although I do think that Plato is super helpful and I think that Neoplatonism especially is super helpful to help us integrate all this together. But I'm really more like. I'm really a lot older world than that. It's like hierarchies of. Of active principalities. Is. Is what I think the world is mostly made of, that is that these forms are not just abstract concepts or abstract ideas, that the ideas are active, that their purpose is. And so that's why I think Saint Max as the confessor gets it so much better because he joins the notion of forms with the notion of purpose. And. And he kind of. He joins like the notion of forms with the notion of, let's say, Aristotle's final causes. You know, that there's a. There's an active aspect, there's something which is pushing and pulling, which is bringing things into. Into. Into being, through to teleology. And so I think that that might be the difference. All right, so walrus14 says, hi, Jonathan. I recently stumbled upon a strange music genre I never heard of before. Conservative punk. Yeah, so Andy Crawford says, teaching Great Divorce tomorrow. Yeah, Great Divorce is wonderful. Like, I think. I think the Great Divorce is. Is a beautiful book to help us understand, you know, the reality of the. All the imagery we have of. Of damnation, you could say, and. And how, you know, I think it's a. I think it's beautiful. It's a powerful book for that. Even in Dante's Inferno, there are some interesting things. In Dante's Inferno, there are some interesting hints about, you know, even in hell. Like there's once, once Dante asked Virgil, he asks, he says, is it possible that things will get better for these. These people after the. After the return of Christ? And Virgil says, you know, something like maybe so or something like that. Like, he hints at the possibility. You know, and so. And so it's like, I think that those hints are beautiful and they can make us. They can make us hope and have. Have joy and a secret kind of. Of hope. But I think that we have to be careful with that and not make it into dogma and not make it into a stumbling stone for people around us. That's maybe the best way to say it. All right. All right. This made me think about your discussions on the center, still believing that it's on the margin and using that false belief to crush the actual present margin. Conservative traditional values are definitely on the margin now in American society. So seeing conservatism Become the new punk. Makes some sense. However, do you think this is appropriate? Should those who want a traditional hierarchy in society act rebellious in the manner punk's music calls for? Or is being a conservative punk and oxymoron? God bless. And so there's ways to be a conservative punk, guys. There. That's for sure. So we'll do it. I'm. I'm next. Okay, so next video. The next video that's coming out is going to be Richard Rowland's amazing discussion that I did with him. Amazing discussion on symbolism of Groundhog Day. Seriously, guys, it's astounding. It's really wonderful. But then after that, I'll do a video on. On King David. On King David. How King David Flees King Saul. And we'll look at the conservative punk in that video. All right, so Alan D. Rienzo says, in your spare time, can we get a video aimed towards teenage kids discussing Covid media propaganda, social media, phone addiction, excessive gaming. Oh, my goodness. And any other relevant current issues our teens face in this crazy world? I don't know. I don't know if that's gonna happen. It's just like. I don't know. Can you really see me doing, like, the more, you know, video. Like a kind of video to, like, help teen kids? I don't know. That sounds kind of corny. I don't see how I could do it without being. Without being corny. Let me think about it. Okay? I need to think about it. Because the way you describe it, I didn't have a nice image in my head. And I had a. Like, I had a hello, fellow young people image in my head when. When I read your question. So sorry, Alan. You know, I understand that you're struggling because everyone. We're all struggling with that question. Certain terms of our teens, you know, I. You know, so it's. I understand. All right, so, Nathan Hart. Jonathan, I'm not sure if you ever spent time in the American Southwest, particularly the former Spanish colonies like New Mexico. Are you familiar with the traditional art styles of retablos and riddos? How do you think they relate to traditional Eastern iconography? Could they represent a possible counterfactual to the direction Western art ended up taking, that is the decadent art of the Renaissance? There is an amazing article on this by Andrew Gould on the Orthodox Art Journal who. Where he posits a. How does he call it? He posits a kind of taking baroque and repurposing it towards something which is closer to traditional iconography. And he tries to show how indeed there is a close relationship, both in practice and in the visual style that they end up taking on, which resembles Eastern iconography. And that it's a really great article. So look it up. It's definitely worth your time. So White Lawrence says, what do you think are CS Lewis's flaws as a thinker, if any? I don't know. I like C.S. lewis. I don't think I. As a thinker, I think he has flaws as a fiction writer. There's some things in those. Those. Those Narnia books, which I don't think are great, but as a thinker, he's pretty amazing. I mean, he's amazing in the sense that if you think of. It's almost like he's a. He's a bomb that got dropped onto the kind of Western Protestant world. It's pretty astounding. And he's a bomb that was able to say things in a way that. That most Protestants and evangelicals loved, but that were deeply medieval. Deeply, deeply medieval. And his vision of the world is deeply medieval. And so I think, for sure, C.S. lewis is a definite possible turning point or platform or space of engagement that could help the modern world. And so I really appreciate, for example, Paul Vanderklee really kind of diving into CS Lewis and. And trying to really show people the power of his writing, because it's like I don't. I don't have time. And I'm also not an expert on CS Lewis. I've read some CS Lewis. I haven't read all of it. So that's probably also why. I'm sure if I read a lot of it, I might find some things to criticize. But sure, what I've read about, I've read from C.S. lewis has been quite amazing. All right, all right, so here we go. Next sense. Okay, Jay Garcia says, hope. I hope this makes sense. Is irony an angel or a demon? It seems you can't escape irony when you deconstruct a system, gg Criticizing social media from Twitter or selling your Marxist book on Amazon. But there's also irony that comes from accepting the system, eg, he who loses his life gains it. Freedom is submission to God. You mentioned Satanism. It's your irony in the Montero video. But what is its role from a cosmic point of view? So for sure, you can see that. I think that it. I think that it can be both. I think it has. This has to do with, like, the flip and the double flip or something that has to do with, like, the upside down and the. And the upside down, which turns back. And so the difference between it has to do with the fool. Like it has to do with this turning and the fool and the idea that there's a need on the edge to show the opposite or to show the place where. Where the opposite manifests, you know, the contradiction, you could say. So it's like even, let's say, in terms of. Let's say it takes something like sarcasm. Sarcasm is important because it shows you that you could say the same phrase. You could say a phrase and mean the opposite of what the phrase says. That's pretty amazing. Think about it. Think about saying something sarcastically means that you say something, but in the very phrase you have a statement. But what you're actually using it for is to say the opposite of that statement. Now that's. It's pretty powerful. Powerful because it represents the. The end of meaning, right? And so it has that function. And so I think that that's why you could say that Satanism is the ultimate irony, right? It's the. It's. It's. It's always. It's done ironically. And it's not surprising that it's done ironically because it is in a way, just an inversion of Christianity. And it's an inversion of Christianity that people don't even believe. They don't even believe in it. It's like it's all a joke, you know, but it's a joke that's ultimately played on them because they're embodying it more by not even believing it. Not even believing in it. You could say. But there's a way in which. In the story of Christ, there's also that, right? I've talked about, you know, the, The. The insane. The insane situation of Christ being on the cross and having a sarcastic statement above his head where it says Jesus Christ, King of the Jews, which is. Which says something straightforward, says what he is, is there to say the opposite, but then ultimately is saying that the thing. It's ultimately true, right? That's what Christ does with. With these patterns. It's like, right. The same with when he is. Is being tortured. You know, they. They dress him up as a king. They mock him. They do it to mock him as lowest. And then ultimately, without knowing it, they're actually revealing his true identity. And so it's like, yeah, all right. Curiouser and curiouser. Lisa Barrett says I hate sarcasm. It's funny because I, I very rarely use sarcasm, though it's true. I don't know why. Maybe I do. And I don't realize But I don't think I do actually. Actually I think. Lisa. Yeah, I think, I think there is a moment where I use sarcasm thinking about it now anyways, or whatever. All right, it will cursor. And curiouser, what's the symbolism of feeding the 5,000 with five barley loaves and two fish? I'm especially interested in the pattern of eminence and emergence taking place within the narrative sequence. And so, yeah, this is a great, this is a great miracle to understand. I like to think about this miracle in a way like that is that I could explain the miracle mechanically, let's say if I want, if you wanted to, you could explain it, but it would be nonetheless be a manifestation of how the world unfolds. And so let's say I was a pure materialist. I do believe miracles, by the way, but this is a miracle. But you could maybe explain it even mechanically and it would still be a miracle in the sense that you can imagine that Christ is there and he asks people to share their food with everybody and to share it so that we can feed everybody. And when they do that, they ask, you know, what they get from that is, you know, a few loaves of fish. A few loaves and a few fish. And so then Christ blesses the, the food. And then as he starts to share this sacrifice that someone, once, someone sacrificed his meal so some young man had food for himself and then went up and said, here I have this food and he gives it to Jesus. And then Jesus takes that and then starts to share it. So this, the self sacrifice of this person reveals, gathers the real potential that was there. And so all of a sudden there's more, there's more bread. Where does it come from? Where, where was that bread? There was only five loaves and two fish before there was implicit bread. There was bread hidden among the people. And then now this bread is being revealed as the self sacrifice of this young man. And the blessing of Christ is bringing the world together and then making them trust Christ, making them trust each other and therefore revealing their potential to all around. And so I'm not saying that that's how it happened, but actually thinking about it in a way that's actually perfectly explainable in terms of mechanical causes can help you understand what Christ does and the miracle that he brings about. But I'm not saying that that's how Christ did it, but I'm saying that you could understand it that way and it would actually help you understand the manner in which Christ reveals the pattern of reality and how it's related to trust and how it's related to binding things together and it's related to self sacrifice and all that stuff. All right, so Brandon Burns says when Christ commands the tempest after sleeping in the boat and then casts out the demons upon waking up, is this a prefiguration of his descent and resurrection? When the garrisons beg him to leave their coast after this happens, do they see him as a monster from the periphery? And so it's definitely a prefiguration of the resurrection because, I mean, there's so many things about it that's a prefiguration of the resurrection because who's the other person who slept in the, in the boat? It's Jonah. Jonah is the other person that slept at the bottom of the boat. And so, you know, so it's interesting, it's kind of playing on the story of Jonah where Jonah was sleeping at the bottom of the boat as everything was raging. And then as he comes out of the boat, Jonah says, sacrifice me in order to stop the boat from sinking, basically. And then Christ plays on that is at the bottom of the boat, like at the bottom of death. And as he comes out, then he masters the ways himself. And so definitely. And so when the garrisons beg him to leave their coast after this happens, they seem as a monster. I mean, I think they see him as a terrifying being. They seem more like a hero in the old sense of this like terrifying figure that is, that is awesome in the original sense of awesome. That is, is frightening because he's awesome. So. All right, so Manuel, Manuel Montel says, what are your thoughts of the Protestant doctrine of sanctification and its distinction from theosis? It seems the Protestant doctrine of sanctification takes theosis and divides it into two separate things, sanctification and salvation, and then distinguishes salvation as a sort of one time event, once saved, always saved, and sanctification as a growth towards God. And so I would say it actually really depends on Protestants for sure. You know, there are, there are actually some Protestants that, that seem to have, that have more of a sense of theosis. And there are also some Protestants that have a more mystical tradition, but let's say something like Calvinism, for example, at least certain strands of Calvinism that I've encountered. They definitely. I had an argument with a, with a Calvinist pastor once, which I regret just because she never got into it, but nonetheless it happened. So I got this argument with, with a, with a Calvinist minister and I was really impressed because he understood theosis and he said that salvation is a moral change and is not as ontological transformation. And I was surprised because he was really insisting on this fact. He was insisting on how salvation is and salvation and sanctification, both of them participate in a moral change in the person. It makes you a better person. But there is no, there is no going up the ontological ladder. There's no transformation of the being itself. And I, and I was really, I was amazed that he was so clear that he really believed that. And. But I also believe that why would anybody want that? Once you, once you have the doctrine of theosis. Because the doctrine of theosis, the notion of theosis makes sense of the entire cosmos and says it makes sense of everything. Because without it, you have this arbitrary God that creates beings for his glory. And then we are supposed to be good, but we can't. So God makes us good. So we can kind of become good beings so that we can praise God. And it's all very arbitrary. And so in the doctrine of theosis, you have this very powerful image of a God that creates his creatures out of love because he wants to ultimately be united with them. And that the incarnation is the very impetus of creation, that he wants to be united with them. He wants to transform them and make them participate in his very being. And it's like that is so beautiful and powerful and so much fuller and, and so to me was astounding. And it's like there's no way anybody could ever convince me to go back to that. Like, why would I ever go back to that world? There's nothing you could say. There's no verse you could quote. There's nothing you could say which would make me leave the powerful image of a loving God that exists in love and that wants to make us one with Him. Truly, truly one with Him. As much as possible, as Saint Maximus says, as much as that is possible for a created being to be God. That is what God wants from us, for us. That's what, that's his desire. That's why he created us. And so he wanted to us to share in all his glory. He want us to bring us in and make us participate in the divine council. It's like, that's awesome. But so, you know, I don't know. There's nothing anybody could say to bring me back to that other place. Sorry. All right. So Dorothea says, what do you think about the great resignation? The phenomena that around 40% of young people are either quitting their jobs or thinking about it. I've seen right wing media connecting this to the anti work movement. But my experience in southeastern Europe is that really a lot of young people are quitting and it's because of being overworked, underpaid and just mistreated by an over controlling management. Is it maybe that in the chaos of the world people just don't believe that enduring that will pay off? A lot of my friends say they don't believe there will be something like pension in 50 years. Yeah, I don't believe that. It is weird that it's happening in very different places at the same time. So I mean it is, it's a disengagement. And I think that you're right. I think that the disengagement has two forms. The one of the disengagement has. One of the disengagements is part of the notion that you mentioned, which is the idea that in the workplace or in the Indus, in industry, we see humans as machines, we treat humans as machines, we see them as machines, we see them as things that produce things. So you measure, you have to produce so much, you have to be so efficient, you have to make so many things in such time. And we compare and we calculate and that's what a job is. Basically you're a human machine. And so it's like I understand what, why people want to quit, that I understand how people want to leave that world. You're not building, you're not, let's say a village that's like everybody's working together to build the church or that everybody's working together to make sure that the village survives together, that there's a sense of togetherness. And so if the mayor of the village is a little harsh or a little annoying, you can see that nonetheless they're there to make your village thrive. But when you're working from some giant corporation that doesn't care a lick about you and that is only there to, to. To, you know, to create like billionaires and, and now trillionaires, I guess. You know, I can understand why you just wanted to just like skip out on that. I get it. But I think there's also the other part and I think there's also a kind of draw of the world of leisure and a world of, of kind of decadence and in a world of pleasure where we think that the, the purpose of existence is to have fun and the purpose of existence is to dilapidate ourselves and to party and to do all that. So it's like imagine those two worlds facing each other. One where you're either a cog in a machine and you're like, you're just a, you're just a human robot or you are something like a, like a, you know, like an indulgent, you know, video game playing, porn addicted guy person. It's like that's the reality that a lot of people have. And so no wonder that people go for the woke. Like people go for some cause like something which makes them feel like they're participating, something which makes them feel like they're building something, you know, and so it's like it has a lot of sympathy for young people today and you know, and so it's. So it's our job to reconnect. Like it's our job to try to create, participate in things that are real. That's why I say go to church. And I told you, like when I say go to church, obviously I do mean go to church. But by saying go to church, I also mean like try to be engaged in things, in projects and teams and in groups and you know, like whatever it is, co ops, like whatever it is that you can muster to create common, real, common goals and you know, real common projects and goals. I think that's, that's going to help, you know. And so. Yeah. All right, so here we go. Sorry. Why am I getting old, worked up? All right, so David Franco said, Jonathan, I've been pondering your discussions of stories for some time. You talk about different versions of medieval stories. For example, dragon is slayed or is tamed and slayed, etc. What do you make of the different accounts? The Gospels in Protestant discussion disclaimer. That is what makes the story authentic. But after listening to you, I think there's more to it than that. An easy example of different accounts would be context of Peter's recognition of Christ. Thank you. So I think, I think the best way to understand the four Gospels is rather to understand it as the multiplicity which comes, which necessarily comes out of unity. And so there's a manner in which we don't find the finality and the multiplicity. And this is. Right, the mistake of, of science in general, you know, and so we actually find the unity in the unity, in the place where these things are bring. Come together. And that there's a, there's actually a, a power, there's a mysterious, mysterious power in the ambigua. Which is. Right, which is what? The mysterious power in the places where the texts actually don't connect. That they, if you look at the two traditions, they can probably reveal something to you that is probably higher than reason. You could say that is like a kind of antinomial thing, like an aporia which reveals a higher mystery. But I think that that's rather the way to understand it. And so you can understand like the four aspects of Christ, you know, and that's what people traditionally, I think people have understood it that, you know, you know, The Gospel of St. John is the higher shows the kind of more, let's say spiritual aspect and, and the Gospel of. I get them, I'm getting them confused. And so one is the more royal aspect and then the more human aspect say. Yeah, so the, the gospel of St. Matthew, the more human aspect, the gospel, St. Mark, the more royal, etc. Etc. And so I think that that's probably the, the best way to see it, you know, so hopefully that makes sense. Sorry. Hope I didn't confuse those, which is possible. So Christian Kleist asks. Hello, Jonathan, can you talk about the relationship between Christopher and the Virgin Mary? Thank you. Oh, man. So, all right. So you could say that I've talked about the two Marys. Maybe that's the best way to understand it. I've talked about the two Marys maybe a few times in these talks where there's a tradition in the west of. You could say something like the two Marys. So there's the, there's Mary the mother of God and then there's Mary Magdalene. So there's the whore and the virgin. And in the Orthodox Church we don't have Mary Magdalene because Mary Magdalene is really, it's really a composite figure in the, in the way the west has developed it. And I think it's totally fine. I think it's useful. But in the, in the east we have Saint Mary of Egypt and so you have Saint Mary of Egypt and you have Saint Mary the mother of God. So you have the whore and the Virginia, the saturated one, the confused, the hybrid, the, the, the external one and then the hidden one, the secret one, the pure one. And they are two aspects of the lower world. You could say two aspects of Earth. Best way to see that, you can see the earth as pure, untouched and pure potential. And you can see the earth as chaotic waves, mixture, lack of, lack of identity, chaos, you know, all that stuff. So, so those are two aspects of the lower world, you could say. And, and so St. Christopher is definitely the. On the side of, of Samir of Egypt. You could say, you know, and there's a sense, and this is the mystery. There's a sense in which the. So you could say that the Mother of God carries Christ in. In the. The. Carries Christ into the manger in the secret place. And St. Christopher crosses Christ over into the strange land. But there's a way. There's a way in which the Virgin Mary kind of contains both in her. And I'm not saying the Virgin Mary is a monster and all this stuff, but there's a way in which the Virgin Mary contains both aspects of Mary because she also carries Christ to Egypt and also. Yeah, so because she is the right hand. I've talked about this before. Like the right side stand in for the center, you could say. And so the Virgin Mary contains both aspects, but mostly in the pure form. But she also is capable of going to Egypt, you could say. Right. Without losing. Without. I can't believe I'm going to say this. So she's able to go to Egypt without the suspicion that Pharaoh took her. Like he strangely might have taken Abraham's wife. Okay, does that make sense? Hope that. Hope that makes sense. So she's able. So she does have. She has St. Christopher in her, but she's not just St. Christopher. She has something which makes her. All right, let's go on the ledge with these. These answers. All right. So Kevin Patterson says, so how can a material body be feminine to its masculine, unseen spiritual identity, while at the same time its external physicality is material masculine to its feminine, hidden interior identity of the being? How can the material body be feminine to its masculine, unseen spiritual identity, while at the same time its external physicality is masculine to its feminine, hidden or interior identity of the being? Not sure I understand that, Kevin. I'm sorry, I'm not sure. I'm not sure the way you ask your question is the proper way to understand it. Maybe that's why I don't understand it, because I'm not sure the way you structure it is the right. It's like you're asking me to. How is it that this is the way it is and maybe the way you're describing it is not the best way to describe it? I would say so, yeah. Sorry, man, I'm not sure. Joe Kelly says a major flaw in agape from my perspective is that it leads to reciprocal narrowing of self sacrificing love until you get a combinatorial explosion when deciding what to sacrifice for. For. I got a lot of John Revake in that. That sentence here. Symbolism and emergence is what I see taking over society when that desolation occurs and we lose our ability to reflect or aspire. The question is in a symbolic World. How do people ascend symbolically and avoid alienating or leaving behind persons at lower levels of understanding? So a major flaw in Agape from my perspective is that it leads to reciprocal narrowing of self sacrificing love. So you get a combinatorial explosion when deciding what to sacrifice for. Yeah, I'm not sure. I'm not sure. Again, I'm not sure I follow what you mean. So why does it, why does it do that? So, so, okay, so the way that you should, let's say the way that the things you should sacrifice to, they're, they, they are objective, right? The, the highest things you should sacrifice to, they are truth, beauty, love. That's what the things you should sacrifice to their God. God is what you should sacrifice to. And then, you know, you could say that in terms of virtues. And you, you, you sacrifice things to acquire the virtues. Now of course, there are more arbitrary things that you sacrifice to. Let's say you're, let's say you sacrifice in order to get a job. You sacrifice things in order to, to do certain projects. You know, you, you end up having to, to eliminate things. You want to become a good basketball player, you have to focus on that. And so, so, so those are more arbitrary, but those will ultimately only be fruitful if you have those higher goals. If you don't, then those lower goals that you sacrifice to will become something like idols. And so what, what happens? And this is, this is something that I can't explain to you, but what happens is that when you focus on the higher things, the lower things, they actually just, they just appear on your horizon. They, they shine and then there isn't a combinatorial explosion. It actually, it's like, it's like you see the lover, right? You see the person you care for in the crowd shining brightly, and then you, you move to, towards that. And so that's what actually what happens. And so if you, if you're in a position where you're in a position of combinator explosion where it's like you don't know what to do, right? What job should I have? What, what person should I date? What, what should I, you know, what should I do? What should I, how should I, what should I look like, what should my style be, or whatever kind of question you can ask yourself in, in a life, I would say the solution to that is to aim higher. That's a solution. And if you act with the desire for truth, for example, if you act with the desire for higher things, for beauty, for love, then those lower Things will be given to you. How about that? How about if I use the actual words of Christ? It's like, search the kingdom of God and all those things will be given to you. It won't be a combinatorial explosion. So I hope I understand the sense of your question. Maybe I don't even understand the sense of your question, but hopefully that was useful for some people nonetheless. All right, Mirohamed Ali. Hi, Jonathan. Do we exist before we were born, or does our existence start at the womb or after we are born? What is the Orthodox take on this? So my understanding of the Orthodox take on this is that that life starts at conception. That is the Orthodox take on that. And that there is no. It is futile to think that there is a previous existence in the sense of. We think of time, that our. Our existence as human is born in time and space, and so are. We know we are ensouled when we are conceived. And so, you know, we could say something like, you exist as an. As an idea in the mind of God. You know, you could say something like that. That's. I think that's appropriate. But. But the way we understand is that as humans, we. We are meant to. To be. To exist at conception. Yep. So that makes sense. I hope that makes sense. I mean. All right, Norman says when the kingdom of Israel splits in two, from a symbolic perspective, why is the division so lopsided? Is it trying to show the imbalance of our spending way more time in exile, in idol worship and attention than we do in proper worship and relation to God? I think. I think it has to do with. With the notion of the remnant. I think that's probably the best way to understand it, which is that that day, as something breaks down, one of the aspects will become the seed for the next world. That's probably the best way to understand it. Something like an ark. And so I think that's why. That's why it's like all of Israel falls except for Judah and a little bit of. A little bit of others, but it's mostly Judah. You know, I think that's what it has to do with. All right, Anders Ralstadt. Hello. What symbolic insight is told in the story of Lazarus death? And is his sister Martha important for this symbolism? Definitely. I mean, definitely both Mary and Martha are important in the story of Lazarus. Like all the times that Christ encounters them. It's kind of revealing. It's kind of revealing this, the same thing. And Martha is something like. Something like the desire for control, the desire to. Or the desire to think that we've got this. The desire to get lost in the causalities, to get lost in the. All this mechanical stuff, all these. These lower causalities. And I think that that's usually what. What. What she represents, you know, and then Mary is more attention and how attention precedes those other things. And so Mary attends and Marta is. So that's why Marta, when Christ arrives three days after Lazarus is dead, she's like, this doesn't make sense. This causality doesn't make sense. If you had done this, it would have been done this. And if you hadn't done this, then this would have happened. And Christ is trying to help her see beyond that and to see that all these little things, they're dependent on these bigger things, they're dependent on him ultimately, but they're dependent on these higher things, you know. And so, yeah, that's the way I see it. All right, Alyssa says, hi, Jonathan. What is the symbolism of inverted perspective and iconography? I think someone's asked this before a few times. All right, so I can tell you what the theory is, though. This is. This comes from Pavel Florensky, wrote a book called Iconostasis, which has some powerful things in it. But one of his theories was this inverted perspective thing. And the idea was that the icon was like inverted perspective, where instead of the. The vanishing point being out in the icon out in the image, like, you know, how the image goes out into a vanishing point, that in an icon, the vanishing point was you, basically. So the. The icon was open and that it was pointing towards you, and you were like the point. And he used. I think, if I remember correctly, he used Rublev's Trinity icon as one of the types of this. And I mean, it's an interesting idea. The problem with that is that it doesn't work out. It's like icons don't have inverted perspective, or they sometimes have inverted perspective, but most of the time they don't. If you try to work out the perspective of icons, it's actually multiple perspectives. And I think, if you're interested in that, I think that Aidan Hart writes a wonderful little article about that on multiple perspectives, which is in his. In his book on icon and fresco painting. And so he talks about multiple perspectives and tries to. To see how these different perspectives have. Might have different meanings and including inverted perspective, saying that inverted perspective is kind of part of that, just one aspect of these different perspectives. So there's a lot of discussion about this perspective question in icons, and people tend to disagree a lot about that. All right, so Chandler Turner says Kanye recently released a video for his song Heaven and Hell, which features imagery heavily influenced by classical art. The most prominent of these is the illustration by Gustave Dori of Contro 34 of the Paradiso video ends with a recreation of John Martin's the Fall of Babylon. If you've seen the video, I'd like to hear your thoughts on it. If not, I would be interested to hear your elaboration on the symbolism of those famous pieces. And so, yeah, I saw the video. It's for my favorite song, by the way, on the album. And so I saw the video. There are a few things which disappointed me. I think the first thing that disappointed me was that it was an ad for his. His hoodies. It was an. It was an ad for Yeezy, the Yeezy brand at the Gap, which I was a little bit like, what? You made a song about heaven and hell and it's an ad for your. For the hoodies that are. That are displayed in the. In the video? I thought that was a bit pushing. It's like, I'm nothing against selling things. Like, I sell things. There's fine with that. But I thought that was a little pushing it, but I did. I mean, the basic imagery that I found interesting was, of course, this duality, you could say, which is that he was giving two possibilities, which is one, the possibility of ascending. And the second was the. Was the possibility of conflict and the breakdown of society. And see, that's why I think he chose those two images and was contrasting them to each other, which is basically saying, you've got these two choices. Either you go up and you ascend towards God, or you will end up in a situation where civil civilization is going to collapse and Babylon is going to fall apart. So I think that that was the basic. The basic idea in that. And it's still impressive. It's an impressive video. It's complicated that he showed that he's hiding people's faces all the time. It's. It's very complicated thing. You know, I'll tell you something about Kanye, which I was wondering if I was going to make a video about it, but I might as well just talk about it now. So Kanye did. He did a concert recently with. What's his name, the other rapper? Look at me. I'm just such a boomer. Anyways, he did this concert. He did a. He did a live concert with Drake. That's his name. Drake. Drake. So he did a live concert with Drake. And it was weird because I was I had come back from some meeting or something, and it started super late. It started like 11:30 at midnight, and I didn't know. And I caught it on YouTube before going to bed, and I ended up staying up until 2 in the morning, which was horrible. But I ended up watching the whole concert, and it was really interesting. It was interesting, like, when you watch Kanye's performance, because it really, like, if you want to see, like, the. The difficulty of. If you watch my video on the sower, on the parable of the sower, you can see the difficulty that someone like him is in. And so he was doing a concert and he was singing his songs, and most of his songs are insanely vulgar, sacrilegious. They're horrible. The words are horrible. And so here he was, doing a concert, singing his own songs, and then he would sing, and then he would stop, and he wouldn't sing. Certain things, phrases, sometimes certain words, but sometimes not saying the bad words doesn't matter, because you cannot say the F word. But the entire structure of your sense is so wretched that even if you don't say the bad word, it doesn't matter because the whole sentence is horrible. And so he doesn't say. He doesn't say the words. Then he's like. And then sometimes it's him, but in a recording, saying the words, but then he doesn't say it. And then sometimes he would give in and he would actually say the words and say the kind of darker things. And I swear, if you look at his face during the whole time, it's like you see someone who is morally struggling. Like, you can see it in his expression that he is struggling to hold on. He's holding on by his fingernails, and he. Not. He doesn't know what to do, you know? And it's like. And I get it. It's like his wife divorced him, and everything is falling apart around him. And. And it's like you can see that that's what's going on. And so it's. It's actually kind of sad. It's like a sad. If you watch it and you see what's happening, it's very sad to watch it happen. And it's understandable because he had so much. It's like, imagine you have so much power and so much fame and so much influence, and then it's like, no matter what you say, no matter what you do, people are going to love you. Like, no matter. You could say the worst. There's almost nothing you can do anymore. Like, you've already loved the worst supposed. You know, Orange man in. In culture. And then you put out an album, and it's like, number one platinum album in America. And so it's like you've done it all, and you can say anything. It's like, man, can you imagine being in that position? It'd be horrible. Like, it'd be so dangerous. So I don't know. That was sad watching that. I mean, I was impressed because it was. I mean, I like Kanye West. I like his music. But I was, like, I was sad to watch him struggle morally because of his baggage, like, because of his Earth that he's carrying with him and that he has to. He has to. He has to kind of deal with it. And so it's. There are a few people, like, for example, like, I don't know if you guys know that about Rush V, who converted to orthodoxy. Like, he actually unpublished his books, which is really impressive. He unpublished his books. He closed down the forums. He basically stripped his old world in order to have nothing left. And so it's like, that's impressive because that can lead to, you know, then you've plowed the earth more, and there's more room for the seed to grow. But, man, Kanye, I was feeling. Feeling bad for him. I mean, why should I feel bad for him? He's. Yeah. All right, so here we go. So Matthew Mo Brandon asks. Okay, this confused me to no end. Matthew 12:43. When an unclean spirit is gone out of a man, he walketh through dry places seeking rest, and findeth none. When he saith, I will return into my house from whence I came out. And when he is come, he findeth it empty, swept, and garnished. Then goes he and taketh with himself seven other spirits more wicked than himself, and they enter in and dwell there. And the last state of that man is worse than the first. Why would an unclean spirit seek dry places? If that is order in biblical cosmology, why worse than before? I mean, it feels like we should just be happy with the 1 imp and not risk 7. Yeah, that's a good question. All right, so think about it this way. Think about it that. Okay, so think about it like the world is made of attention or the world is made of worship is what I mentioned before. And so it's never enough to get rid of bad habits. If you try to just get rid of bad habits, it's going to do this. And so what you need to do is you need to replace bad habits with good habits. So asceticism on its own is not sufficient. So like, for example, you read in the Church, in the Fathers, and if you're Orthodox, you'll hear every single priest say the same thing. They'll say something like, during Lent, there's no point in fasting if you don't pray. If you don't pray and you fast, you're in danger. You're in spiritual danger, actually, because you're removing the things that usually kind of fill up your life, but you're not replacing them with something, ordering things properly. You're just trying to empty the space. But that's not how it works. Like it's going to fill back up. And so that's the idea in this parable. It's like, so you leave, you. You chase the spirit out of you. But if you don't fill the house with, with a family, you don't fill the house with, with love. If you don't fill the house with things that are worthy, then not only is the spirit going to come back, it's going to come back seven times more. So this is not, this is really like very simple. Everybody has experienced something. Some of this to some extent. Like, think about a diet. Think about a diet. Somebody who goes on a super strict diet and then is super strict and super strict and super strict, then all of a sudden finds themselves eating a tub of ice cream, you know, at midnight or whatever. It's like that's what it's talking about. It's talking about how you have to be careful when you try to get rid of the demons. If you don't redirect your attention to something productive, then you're going to fall worse than before. And everybody knows someone like that, right? It's like a drug addict who goes, who's. Or someone who's an alcoholic who, who, who becomes clean. And then if they, man, if they fall off that wagon, they're gonna fall like they're gonna fall deep. It's gonna be worse than before because. Yeah. So I hope that makes sense. But in terms of, if you. The dry places, it's just wilderness. So it goes out into the wilderness, into the desert, right? Just like the Egyptians, just like the Israelites were out in the desert. And so the desert is something like, you know, it's, it has to do with, with the wild, wild areas, the areas that are not, that don't have names. The areas that aren't. That aren't a home, that aren't part of civilization. So, you know, that's where the demons go and Then they circle, you know, and then this is lasting longer than usual. I'm interacting too much with the chat. No, I'm joking. Just joking, guys. All right, so here you go. Janet Horseman says, how would you understand a social contagion from a spiritual perspective? I have teenagers and a good half of their friends have come out as trans, non, binary, bisexual. I've talked with them about this and how this is a social contagion. But to better explain the phenomena to them, I would like to know this. As the social contagion spreads, does it gain body and strength in a spiritual way? Do the people under its spell give it more power and is it time to move to the jungle? So, yeah, I mean, definitely. And so you can understand it as a, as a, as principalities, right? It's so you have these principalities that are trying to manifest. They want body, you know, so, so these, these, these weird wild demons, they want body and so they, that's how they exist. So you can understand it as fashion, something like fashion. You can understand it as all kinds. There's all kinds of ways you can understand it where there's a way in which this is not negative that could also be positive, which is that you can also do something like this in the army, for example, where you, you set people under a certain principle and then people fall in line and they start to manifest the will of that, of that thing. But this is now just for wilder principalities where people kind of fall under. And there's also a normal desire to give. Like if you are under the spell of some principality, then you also want to gain more body for it. Know, because you know, or at least intuitively you know that that's how it will survive. And so, so this is something which has been definitely happening, you know, and so it's, there's a, there's a relationship between fashion, narrative, all of these things are making this exacerbated at this moment. So hope that helps a little bit. So, so he's asked to gain body and strength in a spiritual way. It gains body in a, in a, in a more embodied way. But then it gains authority in a spiritual way. That is, it has more reach and it has more hold on the way the world is, is, is kind of manifesting itself. But these patterns are not arbitrary. So it's like there are some patterns which will be limited in the hold they can have because they are self devouring patterns. They don't, they're not fruitful ultimately. They're kind of parasitical and so so let's say this pattern could never be as strong as the pattern of a man and a woman having children and raising them. It just can't. Or it can, but as it does that, as it gains more power, it's going to be actually, it's going to be releasing the things that hold society together. It's going to be moving towards a kind of fragmentation because of its very nature. So Drew McMahon asked, Are the only two choices God or nihilism? I mean, ultimately maybe, but not, not in, in a more everyday way. No, because, you know, there's, there's a forms of idolatry, you could say, which are not exactly nihilism, which are kind of illusions of, of absolute, of absolute meaning. And then there's also a form which is maybe the opposite of idolatry, which is of God bringing us closer to him through secondary goods. And so the secondary goods can also be a manner we move towards God. And so you can, for example, let's say, not fully know that you're moving towards God or not fully realize it, or not fully realize the implications of that, but are rather moving towards these secondary goods. But God is using those secondary goods to of kind of pull you along the way. But then also, like I said, you can also see those secondary goods as, let's say, God in themselves. And then so it's like someone who's chasing after money is not a nihilist. He's wrong. Right. He's wrong. He worships mammon or whatever, but he's not a nihilist. But ultimately it ends in nihilism. That is, if we go down the path of just these secondary goods, then the goods tend to devolve where at first people want higher goods and then they just want to get off and then they just want to die. Right. It's like there's a devolving of the good, let's say. All right, all right. Eric Fisher says hi, Jonathan. Why does Christ say that we shouldn't swear by anything, but let our yes be yes and our no be no? Yes. Please have a follow up on your last convoy with John Vervaeke. Yeah, I know I should. I keep. It's like every other day I'm like, I need to write a message to John. And then my days are so full of emails and meetings and like dealing with the logistics of God's dog and doing all this stuff like, oh man, yeah, so. But yes, yes, I will definitely do that. I need to free myself up more just to have more mental space. So why does Christ say we shouldn't swear by anything. Let our yes be yes and our no be no. And so I think this has something to do with a kind of problem of idolatry. Like, I think that's what it has to do with. I think that what was going on in the time of Christ is that people would swear on different things and that they would use that as if the truth was dependent on. The truth wasn't higher than these secondary goods. And so it's like the truth is higher. Think about it this way. So the truth is higher than the temple. The truth is higher than the. The steps of the temple, and the truth is higher by these different things in the temple. But people would make their truth dependent on things that are lower than it. And so I think what Christ is saying is like, truth is above all of these. Like, truth is above all these other things which are good, but that there isn't a hierarchy of truth. It's not like if you swear by something smaller then you. Then there's less truth in there. But if you swear, like, it's like someone. You know, we see that in movies too. Sometimes it's like people say, like, I swear on my mother, right? And it's like, okay, so if you would have sworn on that turtle, then, then maybe I don't believe you. But it. But if you swear on your mother, then I believe you. Because truth is dependent on the thing you. On the thing you. You swear by. So I think that that's, that's, that's what's going on there. But ultimately, I don't think that there is a. I don't think that there's also anything wrong with the idea, for example, of if you see, you know, the idea of, like, let's say, putting your hand on the Bible in order to, to swear. You know, I think it's mostly. In that case, it's mostly like, to help you remember the importance of what you're doing and that, you know, take it seriously. Like, this isn't so. I think that's what he's saying, ultimately. All right, Dan, Christopher, which Christian apologist and atheist would you like to best see in a debate? Loved you on irrationality rules, even if you may have found the conversation painful. I don't know. I don't like debates. I don't, I don't like watching debates. I do sometimes I can watch a few debates, but it's like, I really don't like watching debates because I, I feel like it's just to people locked in their position and, and usually there's no budgeting, nobody budgets, nobody moves. But I would definitely like, let's. I would definitely love to see a discussion between David Bentley Hart and John Vervaeke. And I know some people are trying to make that happen. And I don't know why it hasn't happened yet, because I would love to see that. I think that would be really interesting because I do think that David Bentley Hart's capacity to understand the role of consciousness is super strong. And I think that John's working out of questions of emergence and emanation and these relationships. I think it could be a super interesting discussion. Hope that happens. Lynn Holland says, are there any symbolic links between the Canadian trucker protest and historic or biblical events? I mean, you guys, if you haven't seen the meme, it was pretty amazing. The Wall of Jericho meme where you. There's someone sent me this. Like, it was actually the clown world. Pepe, you know, whatever that. That figure is, who is honking his nose. And you could see the, the tribe going around the walls of Jericho, you know, honking their, blowing their trumpets and the walls falling down. I thought that was pretty cool because that definitely what it looked like. You know, there's also, you know, the truckers there, man. It's, it's, it's all very symbolic, like the whole trucker thing, because from the very beginning of this, I remember when they started putting in all these mandates and stuff, they shut down the economy, the whole economy for a while. But the first thing they reopened, guess what it was. It was construction. And of course they never stopped the transport. And so I was like, all right. They, at least they got that right. It's like, don't scratch the bottom of the world, folks. Don't scratch the regular people. If you do that, you don't understand what's down there. You don't understand that the truckers, the construction workers, all the, the people, right? In the Marxist sense, like in the real Marxist sense, the workers, the people, they're what the world is holding on. So you gotta be really careful when you poke at those people, because if you poke at that, it's going to jump up and it's going to come get you. So it's like, it's interesting that it's truckers because truckers are St. Christopher. Basically. They're the transporters. They're the ones that move between borders. They're the psychopomps, you know, they're the in between characters. And so it's like by attacking the truckers they were. The truckers were able to kind of awaken something which didn't have body yet, you know, a grumbling that didn't have body. And so it was like, there's the body, that image of the truck. It's like, you know, there's something in the culture about a truck that is very powerful and represents the common man. And so if you scratch at that, you might be surprised at what comes up. And so it's interesting and it's. And it's. And it's inevitable, and it's pathetic to watch our government, you know, just right away scream out all the epithets. And it's interesting. It's super interesting. Because if you didn't think Covid was political before, I hope, you know now, because I hope that somehow magically being able to relate anything which contradicts the state mandates with, like, racism and misogyny the way Trudeau did it, I mean, it's just revealing how political this is and how political it was at the outset and how it is a political agenda towards certain goals. So if you didn't think that before, Trudeau saying that his. That the people who are resisting medical mandates are his ideological and political enemies and moral enemies, bringing in racism and misogyny and all the woke. All the woke speaking points. Yeah, well, it's political, and it was. It's been from the beginning. So. Yeah. All right. Jeff Dunlop says the Sabbath, the center or the margin, it definitely has more to do with the margin, but it also has something to do with the place in which the seed secretly appears in the margin or secretly appears in the potential where the naming stops, the work stops, and then the seed is secretly coming down into that to restart the world. And so that's why it has to do with also Christ in the tomb, you could say. So I think that's the best way to understand it. But there's definitely an aspect of the Sabbath which has to do with the margin, for sure. Material, I think, showed that without any shadow of a doubt in his book. I mean, man. And so Jason says, what is the symbolism of the ronin? I think I answered that from the chat. I mean, the ronin is a. Is a warrior that is no longer attached to. Is no longer attached to the traditional authority, someone who has all the. All the training of. Of the hierarchy, but for some reason is no longer attached to it anymore. So that's the ronin. It's a good way to. To end there, isn't it? So, everybody, thanks for your attention. Thanks to. To Lisa and I don't know if Brad was there. I didn't see is Brad there? Well, whoever was there as a moderator, thank you and yeah, I'll talk to you very soon. And thanks everybody for your support. Bye bye. Good night. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is, it's quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows."}
