{"episode_id":"SW - #192 - 2021-10-30 - September 2021 Q&A","start":12.16,"end":8287.16,"speaker":"Jonathan Pageau","text":"This is Jonathan Pedro. Welcome to the symbolic world. All right. Hello, everybody. So I hope everybody's doing okay. I'm happy to see that Jacob is there. Jacob Russell, who I haven't seen in a while in the. In the chat. So that's pretty cool. I just wanted to a few things before we start. I turned off the super chats and the reason why I turned off the super chats, it's just because there are just too many questions and people that I, people that I trust told me that you. That towards the end when I end up answering the super chats, often I answer very, very short answers, let's say. Or I just tell people that they're not allowed to ask you that question. So, so I turn out the super chats. When I logged on, I saw that some people had already put some in. And so I'll look at those and try to answer them despite that. But. So, yeah, so that's what we're going to do. And just to also, just because these Q and A's are becoming just unmanageable, next month is going to be a little different. And so even. Even with the people who are are kind of supporting me monthly and putting in questions, I gonna have to. I'm gonna have to have someone go through and pick the top questions also. Well, on the one hand, because it's just too much and, and you've seen it, I ran out. I kind of. My. My response has become less interesting, let's say it seems as the super. As the conversation goes on. And also the other problem is that there are some questions that keep coming up almost in every Q and A. And so for the sake of everybody who's been following what I'm doing, we're going to try to. Yeah, we're going to try to focus on those that haven't been asked the best questions. And so, yeah, so I'm going to have. I'm going to have Lisa. You guys have seen Lisa in the chat once in a while. I don't know if she's there today, but Lisa is going to go over the questions and pick the. The best ones. And so. So people have to be nice to Lisa because she's the one who's going to pick the questions. All right, so here we go. So I'm going to start. Are there some announcements? Yes, there are some amazing announcements. So despite the predictions of symbolic memes, the God's dog, the last page was penciled two days ago. And so it's officially. The entire story is. Is just needs to be now colored and inked, which means that the crowdfunding for God's Dog is going to start as soon as we can kind of gather everything together. I'm making a video. We're going to decide of the different tiers. And so we're going to start the crowdfunding very soon. And I'm really excited about it because this book obviously took a very long time to make the graphic novel, but it really is just the first book. It's not the whole story. We're doing it very lusciously with a lot of illustrations. There's a lot of breathing in the book. The taking time to show. To show the action. And so it's really going to be a series of book. And what I want is to really knock this crowdfunding out of the park so that Cord Nielsen, the artist, can quit his job and just do this full time so that we can put out books twice a year or something like that, try to get those books out to you so that we can really kind of tell this story in an epic fashion. So that is what's going on, and it's pretty exciting. I've already had some. Some international publishers, people from Eastern Europe contact me and asked me if I wanted to maybe publish with them. But at least for the English version, I really want to go with crowdfunding just because I like the idea of being in control and I like the idea of people getting involved because we're also going to produce a book called God's Dog Secret, which is going to contain some of my original drawings that I did 10 years ago of. Of St. Christopher and St. George, you know, and all the different saints that appear in the story. But also there's going to be an article written by Matthew on the symbolism of Samson. And so it's probably going to officially be the first thing he's published since. Since the language of creation. So all of that is just really. I'm just really excited about all of it. And so, yeah, so. So. So that. Those are the announcements that I have to make. Another thing that's happening is I'm going to be on Jordan Peterson's channel with John Vervaeke and Bishop Barron. That was already recorded. It was very interesting to get that put together. And so I don't know when Jordan's putting it out, but another interesting thing that seems to be happening is that I did a conference for the Jungian Society of Montreal, the Montreal Jung Society. And I didn't talk about Jung, but you guys know that I wouldn't talk about Jung, but I talked about some things that I never talked about before. And surprise, surprise, Jordan Peterson appeared in the public. And so he was there in the zoom call. I could see his wife and, and then I could see Tammy. And then Jordan appeared. And so Jordan really liked the talk that I gave and he wants to put it on his channel as a continuation of his own Bible series. So that's pretty exciting because I, anyways, I, I was able to talk about it in a way that I haven't been able to. To talk about that. Yes. So. All right, so let's go. Let's do this. I'm going to start with the, the website. And here we go. So someone in the chat, Billy A. Asked, can you please talk about why you would not talk about Jung? Well, partly it's because I don't really know about Jung that much. There's something about him that makes, that makes me less interested in him because I think the psychologization of symbolism is something which is good, but it's also limited because if you notice the difference, I really talk about symbolism as a cosmic structure. And so that is one of the issues with Jung. And also Jung just makes mistakes in some of his symbolic interpretations in terms of seeing evil as a, as a, almost like a positive force. The idea of seeing Satan and Christ as brothers, like all this kind of stuff, means that he really didn't understand Christian symbolism well enough, in my opinion. But, you know, get what you can from where you can get it. That's what I always say. And so if Jung, whatever it is that Jung says, which is interesting and true, then it's, it's worth, you know, it's worth knowing. But. All right, so here we go. Let's start. Josh the Mover ask what's the deal with all the ostensibly not non Christian celebrities claiming to have sold their souls to the devil? Is this like a new thing? I don't think I followed this. How is it that are celebrities saying they sold their soul to the devil? So I don't know. I don't know what phenomena you're referring to. I haven't noticed that people are saying that. If they are, it's not totally surprising, you know, so, yeah, I don't know. I mean, have they done it in a, in a kind of colloquial way where they basically say that they sacrificed, they sacrifice what's most precious to be famous, maybe, you know, do they mean it more specifically? That is that they, they did some kind of ritual or some kind of contract, where they sold their soul to the devil, then I. I don't know. I mean, maybe it's possible. A lot of people are crazy. All right. Okay, so Kingsley says, can you provide some insight into Sukkot, the Feast of Tabernacles, one of the three major feasts of Israel. The Christian church celebrates the other two major feasts of Pascha, Christ's resurrection and Pentecost, the coming of the Holy Spirit in the calendar, but not explicitly Sukkot. Actually, it's my understanding that we do celebrate. We do celebrate Sukkot in a way. It's the transfiguration. There's a relationship between the Transfiguration and the Feast of Tabernacles, the Feast of Tents, you know, and it has to do. To be totally honest, like, I don't completely understand it. Like, I don't completely understand it. It seems it's related because you can see that Christ is that Christ is that the. The disciples say, we want to build tents for Moses and, and Elijah. And Christ says no. And then Christ, then they are covered with the glory of God. And so it has something to do with that. It has something to do with, with a filling up of everything, you know, with the glory of God, you know, kind of the idea that in a way we don't need the tents anymore. Something like that. But I have to admit that although I can see that there's a relationship between the Feast of Tabernacles and the Transfiguration, I don't totally understand it. So, I mean, just one more thing for me to think about, because obviously it's there in the story and it's there in the text, but I don't totally get it. So King of the Rat Kings asks your thoughts related to Enoch often bring Lovecraft to mind. Do you have any thoughts on his work? Or if you've read it, on the King in Yellow by Robert Chambers. Now, I haven't read Lovecraft. I know a little bit about his kind of lore, but I haven't read him. And I keep telling myself I should read Lovecraft just because everybody tells me that I should. But I haven't. I mean, for sure, the idea of the cosmic monster is something which I think is interesting. The idea of the break in of the cosmic monster, I think is something which, which is interesting, especially now. It's as if this idea that, that these, that the cosmic monsters will break into a world that wasn't ready for them or that didn't even think they exist or had ignored their existence I think is something which is resonant with what is going on right now, which is, you know, the kind of break in of religion that's returning, you know, in a wild and kind of crazy way, this kind of possession which is happening with being possessed by, in a kind of hysteria, social hysteria that you can see related to social justice or that you can see related to even in terms of the pandemic. Right. You see a strange kind of hysteria that is, that is going on. And so I think that, yeah, so I think that, that it's probably related, but I would need to look into Lovecraft more. So Yvonne Bovain says if an election can be seen as inducing a mini revolution in order to inoculate a national body against a larger revolution, could it still be said to be a functional vaccine if the mini revolution produces no discernible effect? I don't know. I mean, I do kind of like your idea. I like the idea of a mini revolution which inoculates against a larger revolution. So kind of having a type of controlled change, you could say, right, A kind of cyclical change which is contained in a pattern so that it doesn't go out, become out of control. And so, you know, it probably the idea is that at some point, you could say this way, at some point democracy ceases to function by its very, by its very mechanisms. You know, and Plato saw that right at the outset. And so I think that that's usually, you know, it's. Rather than asking if it can still be a functional vaccine if the mini revolution produces no discernible effect, the question would rather be why is it that at some point democracies cease to produce the effect of stabilizing society and tend to move towards a breakdown and a polarization and then ultimately a call for tyranny. Right, A call because that's how Plato saw it. Plato saw it basically that it's not just that a tyrant comes in and takes over, it's that at some point people desire the tyrant. People want control. And it's something, it's interesting. Like, I remember seeing this. I think that if you're looking at what's going on right now, you can see that that's actually, it's already what's there. People want this. Like I look in, in here in Canada, you know, all these measures, all the, the pandemic measures have approval, have majority approval of the population. And so, yeah, seems people are tired of. Yeah, so, okay, Roxanne says, while I agree and, and lament that passive subjection to entertainment is widespread. Would you agree that admiration is a kind of participation? For example, if I go out on a clear dark night to look at the stars, don't I participate by being awed by God's creation? And isn't admiration deepened through knowledge? And through engaging in admiration with like minded friends, for example, I can learn to identify constellations, know their stories, also learn about celestial mechanics. Applying this idea to concerts complicates it. Thank you for your insights. And so it's interesting because I agree that admiration is a form of participation. But it's interesting that. So in a normal world, like in a traditional world, you admire valorous people. You admire people that have virtues, people who have valor, people who showed, you know, either great leadership or great, great accomplishment in the spiritual realm or in some kind of physical realm. But the world, what the world of entertainment does is that we end up admir, we end up having admiration for clowns. It's like, if people admire actors, what the hell? Like, why would you admire actors? Like, actors basically spend their time pretending to be other people. And it's actually really interesting to see how people get duped. It's like they're getting duped because they're confusing the actors for the roles that they play. And then they admire the actors. And so it's the same with these rock musician types, you know, where we're basically admiring clowns and jesters. So that's the issue with entertainment is that in its very structure, if you make it the center. So you could. The thing is, it's funny because you could admire a court jester for being a really good court jester. And I think that that's, that that's totally fine, right? And admire an actor for being a good actor. But when entertainment becomes the center of your, your society, then you have actors telling people their political opinions on making videos about who to vote for and you know, telling us that we need to get involved in this or that social, social cause or whatever. And then it just becomes completely insane. But I think people, you can see that people are getting tired of that. You know, all those stupid videos that came out during the elections and watching celebrities, Virtue Signal about COVID and everything. There's a little bit of people are realizing that this is not working, you know, and so hopefully it'll be a reason to change towards admiring more participative people. People who really participate in the transformation of our culture. You know, like admiring. It's funny because it's really interesting. It's so funny. If you look at the way it's set up, people admire actors, but nobody admires screenwriters. People admire singers, but nobody admires songwriters. Why? I mean, this is where you can see how it's completely upside down. Because at least to admire the person who wrote the screenplay, right? At least to admire the person who, with great art was able to weave together all these threads. And the same at least admire the person who writes songs. But we would rather admire the performer. And if he writes his songs, that's great, but he doesn't even have to. If he's just a performer, that's the person that we end up admiring more than anybody else. So Frederick says, might not the Internet be the whore of Babylon? It looks like an emergent host, an upside down grill maybe, into which we pour all our desires. It kind of feels like a man made demonic being, spirit without a body. And so I agree that there's a connection between the Internet and the horror, but we have to be careful not to say the horror as. How can I say this as a specific thing? The horror is a pattern of being. And the Internet can participate in its pattern. But let's say in the Internet, you have both the whore of Babylon and the beast in Revelation. So in the very structure of the Internet, you have all the possibilities of the chaos, the mixture, the passions, all of this stuff, the trading, all of the things which describe the horror. And then you also have the possibility of the absolute clampdown, of absolute control, of surveillance, of tracking. All of this is also made possible by the Internet. So the Internet, it will rather be a locus, like an extreme locus of where the relationship between the whore and the beast play out. This is rather the pattern of being. I keep telling myself I need to make a video just on that which is this change that you see in Revelation, between the whore writing on this complex, on this complex and very powerful system. But then at some point, the beast kills the whore and then tyranny ensues. But I think I mentioned it a few times in other videos, so, yeah, so David Flores says in Genesis 47, 15, 20, due to a famine in the land, the people give goods to Joseph in exchange for bread. It begins with gold and cattle, then their bodies and their land. In reading this, it struck as strange as I've seen the more heavenly items, mana or seed, come down from above, and earthly items, flesh or crops, offered upward from below. Could you elaborate the meaning of this pattern of heavenly, earthly items all being offered from below. So this is super important. Like, this pattern is super important because Joseph is Giving grain is. That's my understanding. Is he giving grain or is he giving bread? I think he's giving grain. And even if he's giving bread, you kind of have to, I think you got to have to understand it as grain. Even if it's bread, it's like a transformed version of the grain. And so then you have people giving from below to stay alive from above. And what's important in understanding the story of Joseph is that there's something, you know, it's funny because people always, I always tell people that the Bible characters have two sides. All the Bible character characters have a dark side to them. And this is better to understand it that way because if we want to look at the Bible characters as just being models for us, we're going to run into a wall pretty fast because none of them really are completely. But there always is Joseph, which people always think, see that Joseph is, you know, there's something about Joseph which is hard to see, you know, where he totally does wrong. He's the victim. You know, he gets taken, he gets taken to Egypt. But Joseph is something like the man who is too good. And so you can see how him being good and him being heavenly and him not being able to be tempted, to be tempted, let's say from below, when you see him fleeing from Potiphar's wife and being willing to leave his garment in order to kind of stay pure and stay in the garden, you could say when he leaves his garment with Potiphar's, right, Leaves his garment with her, it's almost like he's going into the garden, right? So there's this idea that Joseph is this, is this pure, but then he's. He. Then he becomes too pure and he has an excess of order. So if you want to understand like a secret in that story is, is that the way that Joseph saved Egypt gave ultimate power to the pharaoh because everybody traded all their land and centralized power in the pharaoh by the manner in which Joseph saved Egypt. And because he did that, that's why the pharaoh could enslave the Israelites was because he had handed over total central power to the pharaoh by. In the manner in which he saved Egypt. And so there's. The Bible is a very powerfully, you know, very powerfully pattern. It's, if you, if you pay attention, it does. It's never made explicit, but if you look at actions and consequences of actions and you kind of see it follow through, you know, there's all this subtext which is very, very powerful. And the idea that all the Egyptians were giving up their, their, their, their stuff. And then ultimately when they give their land, then they centralize the power of Egypt and a centralized power is able to treat its strangers, you know, with, With. Yeah, by enslaving them. So, I mean, I love Joseph, you know, he's great, but it's just good to see how, how, how the Bible works. All right, so Douglas Matthews says hi, Jonathan. Thanks for still doing these Q and A's. All right. And so on a previous Q and A, you said you don't think that the procedure is the mark of the Beast, but seems to be moving in that direction. Assuming this, that is still your position, let's say that it does eventually get there. What would that mean for people who already partook in it before it was either revealed to be or became the mark itself? Can the future affect the past in such a way that it would have been the mark all along, or would it depend too much on the particulars to answer that? So I think you have to be really careful, again, you have to be really careful about this kind of stuff because I describe patterns to you and I describe how they kind of manifest themselves in the world. And we have to not fall in like a strange legalistic world where you get trapped in something and then because you did something, then you know, it's all about transformation of the person. And so the question of being faced with the mark is a question of having to compromise the most important thing. Compromise your faith in God, compromise. Compromise your faith in Christ for another good, which is the participation in society. And so until that happens, it's just fluffy. It doesn't mean anything to say that this is the mark or that is the mark. If you're looking for just the gesture or interpreting it in a kind of very precise way where you're looking tit for tat to see what event maps onto another event. That's never the way that I talk anyways. I don't talk that way. I'm not saying it's not going to happen. It will happen, and it has happened in the past where people were forced to sacrifice their faith for some worldly good. And in the case of the mark of the Beast, it's all worldly goods, basically. Participation in society itself versus your affiliation to the divine Logos. And so. And so what you can see and what's going on right now is that a good example is like the passports, okay, In a place where the passports become necessary for you to actually go to church. Like, we're moving close to what this is about, Right. In a place where the passport will be associated to political ideology, that is that you cannot receive the passport if you don't concur, if you can be canceled politically or spiritually by you not having the passport to be able to participate in society, because it's going to go beyond the procedure, it has more to do. The mark part has more to do with the idea of tracking and absolute control and absolute calculation than the medical procedure. Okay. It's very important to understand that now, the fact that it comes through a medical procedure that is like a little injection that has to do with marking you or whatever in a certain way. I mean, it's possible that it's going to play out that way, but I would be careful not to be too. How can I say this? Not to try to map events onto each other too much when you're doing this, but actually try to understand what it means. And then when you understand what it means, then you're going to be able to identify it when the pattern manifests itself. So hopefully that makes sense. And I'm not being too vague, I'm obviously trying to avoid certain words so that I don't get booted off the platform. Okay. So curiouser and curiouser asks, is there a relationship between the scrolls of the apostles and the icons of Pentecost and the head coverings in 1 Corinthians 11? In a manuscript of the Gospels from the 6th century Byzantine, there's an image of Mary speaking between the apostles with their veil paralleling the dome of heaven above them, standing on rough, a translucent sapphire earth. In more common depictions today, I see the glorified cosmos under the apostle gathering their words in a single garment. Could the tongues of fire on their heads represent the glory of God and their testimony of Jesus, the glory of man? So it has to do. It does, to a certain extent, you could say, have to do with glory. It has to do with. But it has to do with multiplication. That's what it has to do. And so you can understand that the tongues of fire, we want to represent them. They received tongues of fire. That is, when they spoke, they spoke in all the languages. They received a tongue of multiplication, a tongue of multiplication, which can move out into the world and express the gospel in a way that is understandable to all peoples in the entire world. And so that is what ultimately the idea of the tongues of fire represent, what they are. That's just what they are. That's what tongues of fire are. And so whether or not it manifested Itself as some kind of vision of something above their heads. Like, it doesn't seem to say that in Scripture, but. But it's okay. It's great to represent it that way. I think it's important because it really is a visual representation of this. This fire which comes down from heaven, right? So it's like you can see it in the icon. You have this fire. It's like this fire coming down from heaven and spreading through the apostles out until the ends of the world. And so there's a subtle version of that which is the actual fire, the actual capacity to spread the Word and manifest the Logos and fill the world with Logos. And then there's the doing of it and the results of it, which are the specific traditions or specific embodiments of that happening. So it's like it's. It's the actual liturgies in. In Slavonic or the Bible translated in different languages, or the saints, you know, the. The commemoration of the saints of all these different lands, of all these. These. This multiplicity kind of having a concrete realization. So you have the active part. So think about it exactly like I explained, the icon of Christ. So you have Christ's blessing with his right hand, and then he's holding a book in his left hand. The blessing is the capacity to affect the world directly. The capacity to bless, to curse, to heal, to do all these things. And then the book is the result of that in the world through all the. All the memories of that, all the writings, all the liturgy, all the art, the remembering of your name in the book of life. All of these things are the result of the active part. So think of the icon of Pentecost that way. So you have the active part with the fire, and then you have the passive part or the receptive part or the manifested part in the cosmos itself, in the world as it reaches its fullness. Hope. That makes sense. And this stuff is hard to. To talk about because it's. So that makes sense. But I don't see a relationship between the veil. I'm afraid not. There's a. The veil that is the way that it's represented. The icon of Pentecost is. Is more like. It's kind of like a container, right? It's. It's this. It's this cloth which holds rather than the idea of. Of the higher veil. You could say there's a relationship between the lower veil and the higher veil, just like there's. Between the lower waters and the higher waters. But that is not what I'm not Going to go into that here you can find other places where I've talked about that. So Pnuma asked, what insight can we draw from Ruth and Esther for these times of ours? Ruth, of course, is the foreign woman who attaches herself to the people of God and becomes the ancestor of Christ. While Esther, being already a part of the people of God, attached herself to the foreigner and becomes queen of the foreign kingdom in order to save her people. These happen to both of them during upside down and carnival periods. What can we glean from them? Yes, your insight is very good this year. I like your insight. You're right. Ruth and Esther are on the. Are on the one hand the end of two stories and they are in another way they are also kind of two visions of the same reality, right? Which is reaching the end of the world and when possibilities are finished and the carnival and the joining of the. The relationship between joining the foreigner to receive new potential, you know. And so this is definitely what is going on here. And so you could say that what Ruth and Esther show are, are two ways in which this can happen. And if you look at the story, you'll see that it's very much two opposite ways. In the story of Ruth, there's the idea of what kind of stranger can join your world in order to increase it. What kind of strange can join your world in order to increase it? And you'll see that Ruth says to her mother in law, you know, she says, your God will be my God. That's about it. She can understand that, that that's how. So the idea is for the strange, for the strange to be properly joined to you. This strange element has to recognize the same transcendent thing so that you're bound together, right? So that's why you have immigrants say the pledge of allegiance. That's why you have. You know, you could imagine it like the idea of asking the Jews to come to Europe. You know, different kings would ask the Jews to come and they would become vassals directly to the king. But they had to be vassals to the king or else they wouldn't be accepted in the ancient nations. So that's the Virgin of Ruth. And then the version of Esther is something else. It has more to do with the hidden seed and what Matthieu has explained so well and what I've referred to many times, which is the double flip, the double inversion of how when the world becomes upside down, the seed is hidden and the seed can operate another. In order for the world to start again there you have to Operate another, another flip, right? You see that in the story of Elijah as well, but the story of Esther is the ultimate version of that. And so, yes, these, this type of wisdom is one we need to pay attention to, especially as Christianity starts to be eclipsed in the social sphere. You know, people will become Christians, will become something like Esther, will become something like Elijah. And so we need to be ready for that and we need to kind of understand how this can play out. Let's say think of Esther, Think of Esther as, as, as something like Constantine's mother. Let's say. It's a good way to understand it, you know, how this, these things happen and how the strange through the feminine can bring about. But it's not the strange in the, in this vert now. It's the, it's the actual seed. It's the thing that's going to, to bring life to the, to the world and kind of save things. All right, okay, enough of that, man. You guys bring me to say things that I don't want to talk about. All right, Here you go, you. You flesh. Sim world. I don't know what that means. I don't know. It's a strange name. What is the concept behind theosis? What does it take to become like God in terms of my required actions? What exactly is it that I'm supposed to imitate or become like? Can you elaborate on that a little bit more? I guess I need something like a manual. Thanks for watching your work. God bless you and your family. So, I mean, definitely, if you see it as a manual, you're going to be in trouble. And so we say that we become God or theosis happens through participation in God. So what is that? What does that mean? The idea of knowledge in the Christian world is not, is participative knowledge, right? When you know something, you somehow you, you, you have to join with it to a certain extent. There's a, there's a kind of penetration that happens and it. Obviously the ultimate version of that is a sexual union, but there's little versions of that. And so this is what, this is what it means to be divinized, which is that if you read the. For example, read San Gregory of Nyse's Life of Moses, you'll get a sense of what that is. And so you have to, you have to do. There's two gestures. Once you have to look up towards the mountain, towards the top of the mountain, where God. Where the highest place where the glory of God kind of comes into the world. So you have to have Christ as a model. And you have to attend to God, which means praying, which means worshiping, which means all that stuff, you have to eliminate. You have to break away from the lower things that attach you to the world. And so all your passions, all your desires, all these things that pull you in all these different directions, you have to kind of be able to detach yourself from that, not because they're bad, but because they enslave us. And so that's the movement you see in the ascetic practice is to detach yourself from these passions, these things pulling you apart, and then also cohere in love. So love God, love your neighbor, move up in that, into God. So it's like there isn't a. The manual is just what Jesus basically said. Of course, it's extrapolated. You can read the works of the Christian mystics, you can read the Philokalia. But the concept behind theosis is that Christianity is a non, dual proposition. We are not outside God. God is. God is infinite. God contains all things, and all things proceed from him and return to Him. And there is no outside God. And so it doesn't mean that we're all God in a weird pantheistic sense. It means that we get our life from God. Our life is in God. And as we move closer to the life of God we have in us, then we become more of who we are and we also become more in the image of God. And ultimately you can phrase it to say that we participate in God and we become God through participation. So that's the concept behind it. Hopefully that's understandable. So arosa77, says, Jonathan, is there any symbolic dissonance when an adult who had been baptized as an infant is baptized after a conversion experience? Assume both baptisms valid. So in far as being performed in a church with historic Christian beliefs and beliefs, in trying good Chalcedonian Christology, there's, there is a depth. There is. It's a. It's a messy thing. You have to see that as a really messy situation. And, and ultimately in this case, what I would say is, you, you. How can I say this? It's so like I was baptized twice and it definitely is an ideal. Like I was baptized as a Baptist person and, and then, then I was baptized again when I became Orthodox. And so it was at the discretion of my bishop. You know, some bishops will be stricter and either demand everybody be baptized or demand everybody not be baptized if already been baptized, because there is something of going through baptism another time, which is extremely messy. And problematic. But there's also a reality, which is that Christianity has become so diluted and so messy and so chaotic and so disturbing that it's difficult to know. Like, it's difficult to be completely hard about this, you know, and say that if you've been. If you were baptized, you know, no matter where you were, whatever kind of church you were in, that that is valid. So. So I would say that if you are in a situation where you're. I would say just. You have to give that responsibility to your hierarchy. You can kind of ask or ask them if it can be done this way. But ultimately you have to trust that God works through the church. And don't. Some people insist. Some people will insist to be baptized when their bishop does not want to be baptized, and then the opposite is true. And this is the wrong way to come into the church, you know, because the. The sacraments aren't just a kind of checklist that you have to get done. Right. They're also. They also function through our submission to the hierarchy and our capacity to recognize, you know, the manner in which the grace of God kind of comes down. So it's messy. All I can say is it's not. It's not. There's no simple answer. All right. Could you explain the symbolism of this passage from the Book of Kings? By the word of the Lord, one of the company of the prophets said to his companion, strike me with your weapon. But he refused. So the prophet said, because you have not obeyed the Lord, as soon as you leave me, a lion will kill you. And after the man went away, a lion found him and killed him. Thank you. I don't remember these texts. Book of Kings, and that's tough. I don't think I'm going to answer the right thing. If I answer, it's definitely super interesting. It's very interesting, huh? For some reason, like, something about the green knight kind of comes into my mind, but I'm not sure I totally see how that fits together so well. So, C.S. streitzel, you can say that. You stump me. So I need to think about it. All right, So J. Grubb says, what is the difference between a Nephilim and a God king like Julius Caesar or Pharaoh? The former were singled out for destruction in a way that the latter were not. Would it be fair to say that the fallen angel after the flood did not generally reach the same level of mixing as the Nephilim, except perhaps the nations of Israel? Could you say Julius was possessed by or hosting an angel, but not up to the point of producing hybrid offspring. I think there's definitely a difference. There's definitely a difference. But what is the difference? I mean, I think that. I mean, I don't know also whether or not the pharaoh practiced some kind of. Some kind of sex ritual, you know, to create, let's say, to kind of perpetuate this line of influence from the, from the, from above. But I don't think that's the case with Julius Caesar. You know, I think that it's rather something like they become manifestations of gods in the world, like locusts of gods in the world. And so people kind of manifest, especially in the case of Pharaoh, in the case of Julius Caesar. I think it has more to do with the idea that his genius or that his spirit, you could say, ascended into heaven and took a place in the. In the pantheon of the gods. And so I think that that's mostly what has to. That it has. It's. It's funny because in a way what Julius Caesar and Augustus Caesar was like a strange, devious promise of what Christians were actually going to accomplish, which is the idea that you. That you can ascend and participate in the. In the divine council. And so, and so it's interesting to see it that way where in the past there was an idea that some people could ascend and become gods. And it was usually very special people, you know, like kings, like you said, or terrible people, like certain heroes that were. That were just kind of these terrible presences in the world, like Hercules or other heroes. Whereas. Yeah, whereas in, in Christianity you have a sense that. That we're all called to participate in the divine council, that it's for all who are willing to. To. To be transformed. So. All right. PKB5021 says there's a book called Sapience by Yuval Noah Harari that I have seen being read quite a bit lately. It supposedly goes over the history of humankind, but completely disregards that there is narrative and even makes the claim that any ideas we have of participating in a story is made up in our head. Oh man. How can we show people in our lives that we have meaning with so many narratives like mentioned above, run rampant. What's your opinion on this? I haven't read the book. My opinion on this is that this guy is completely unaware of himself in ways that is just funny and embarrassing. And so there is a book which is bound in, in space and time, which binds words together with chapters and, and. And sentences and coherence with an introduction and a conclusion. I imagine in his book, like all books do, you know, and, and in that book he tells us that all these stories, you know, which includes the one he's telling to you now, are just made up in your head. You know, you have to almost wish for the bliss of their ignorance, of their, of themselves and how they're part of the pattern, you know, so completely unaware of themselves. Oh my goodness. I haven't read the book, but the way you describe it just seems like the same kind of nonsense you see with a lot of the. Yeah, with a lot of the new atheists and you know, and certain people, even in the so called. Idw. All right, so here we go. So Mark says, hi, Jonathan. I think you missed these three questions last month. Well, thank you, Mark. It is quite possible that I missed some, some of your question. Is it possible? Let's see. Okay. So sorry to sound like a heretic. I'm probably, I probably am one. But you talk of Christ as filling up the hierarchy. Does this make him the Holy Ghost and not the Son of God? I think it depends on your viewpoint. From God's point of viewpoint, he is the Son. From our point of view, maybe he is the Trinity. I mean, yeah, man, that's Trinitarian. Trinitarian theology always makes me nervous to talk about that. But for sure, there's a sense in which. You see this in the Fathers too. You have a sense in which we encounter the Trinity in Christ. Although they are completely separate persons, we also encounter the Trinity in the three persons. That is because they are bound to each other in love and kind of fill each other. That it, that it's not as simple as just saying three, one, we're done, right? It's far more complicated than that. Now you can understand it, the way in which, the way in which it kind of fills up the hierarchy. A good way to kind of understand it is something, something like two movements, one which is the possibility of filling. And what is one is the actual concrete filling. And so that's the way that I kind of see it. That is the Holy Ghost is, is like the. It's almost like. See, think of it, think of it. Think of it exactly like the way you speak. It's that your word is carried by your breath and that the breath is the. That which kind of opens the space for meaning to be transmit or carried from God into the end of the world. That's the best way that I can explain it. That's the best way that I understand it. And so maybe I'm a Heretic people are gonna come after me for speculating on the Trinity, but that's the way I understand it. So, okay, so I'm going on with these three questions. I forgot last month. How do actors. Nikita888, ask how do actors, the art of acting, fit in the symbolic worldview? What is the orthodox perspective on actors? And he gives an example. I mean, I think actors. I mean, it's fine to be an actor. You know, I think that I kind of bash actors just because they're so important. People give them way too much importance. You know, acting is. Is ultimately a rather trite thing in the world, you know, pretending to be something else. But there is like, there is an interesting symbolism of actors that is. That is. That can be thought about. And it's funny because I get this from. It's Guinot, who wrote an article on acting which I. Which kind of was interesting. And his idea was that you can see in the symbolism of acting the notion of a center and then the spokes. And so the actor can move out of himself and embody different aspects of reality without losing himself. So that would be the proper actor. And so something like method acting would maybe be actually dangerous for you, right? Because it's like you, You. You try to just break yourself. You try to destroy your own center and then just kind of be possessed, you know, by the thing that you're. That you're trying to act out. And you can see that they look at Jim Carrey, my goodness, like he was just destroyed. It seems like he was just completely destroyed by the man on the Moon movie because he got so completely possessed by the character that he was playing that he just never came back. And so I think that that's really. That would be like the dangerous aspect of acting. But, you know, the notion of rather that a center can move out and remember itself or not completely forget itself, but be convincingly, let's say, embody different aspects of reality could be a good. A good symbolism of acting. All right. And so he reports a question from Josh. Is the idea of human rights a truly Christian concept or just a contri enlightenment value? I'm mostly tired of hearing about rights, but I'm curious to know if there is an orthodox framework or at least a sober symbolic manner of looking at them. We bombastic Americans like to say our rights are from God, but it seems more and more the case that they're just from government and can easily be erased. Yeah, good call. So the way that. The way that the Christian worldview seems to Formulate this. And it's the way that if you look in scripture, this is what you're going to find is that scripture seems to formulate it as responsibility, not as rights. And so you'll see the prophets go to the kings and tell the kings that they need to treat their flock with compassion, with love, as if it's their children. They need to act properly towards other humans. And you see, the same with Christ basically telling us that we need to love our neighbor, that we need to treat others like we want to be treated. We need to, to act like the Good Samaritan, you know, and care for the downtrodden, care for the suffering, go to visit in prisons, feed the. So it's always framed as responsibility, whereas our modern human rights are framed as rights. And so it's actually people, instead of seeing themselves as responsible for caring for others, they see themselves as demanding and having, you know, having certain behavior owed to them. And so it's a tricky thing, you know, because in a way it's not completely false, right, that, that, because there's implications that because Christ says to the, to the, to the strong and to the powerful, that this is how they need to act unto the weak, that it's something which is, let's say, required of them and is due to the, to the weak. But it's all about framing. When you say it now to the weaker party, then it becomes, you know, then it becomes the rights and it leads towards at least to what we're seeing now, right? It leads to, to a kind of pride and a kind of hatred of authority. You know, all of that. So. All right, so Nikos asked previously, I've spoken about free will, but to be free, to be really free, to be bound by God's will, it was helpful and I agree. But do we have the ability to choose between. To be free in this sense or to stay imprisoned by our passions and sins when God calls us out of it? If you say we don't have this ability, then you probably are a Calvinist. But if we do have this ability, how does providence work? Most of the time, God's providence comes about through human actions. If men can reject God, God is dependent on human choices, and providence goes only so far. People accept his calling. What do you make of this? And so the way that it's presented in the, in the tradition, the orthodox tradition is the people talk of synergy. This is obviously not the word, it's not like a super ancient word. But this is more a later interpretation of the way that it's presented in the tradition is synergy. And so you can understand that God is always calling you. God is always calling you to say yes. And so the opportunity to say yes is always there. And it's not found in you. It really is like. It's almost like God is always there to seduce you, let's say. And so even when you sin, and I've talked about this, I talked about this recently, right, Every time you sin, there's an opportunity which appears every time. And it's a consequence of the sin, but it's the sin leading you into a place where you can see the providence of God, right? You can actually feel it, like a little awake moment when after you've done something you shouldn't have or you've given into something that you shouldn't have, you realize what you've done. And then there's this opening. Now this opening is something that you can either ignore or you can just grab onto, attend to is almost enough. Attend to that opening. And then in that attention, you'll find space. There's space in that attention. And then this is when the synergistic thing happens, which is, that doesn't mean you're not going to fall again or fall into your passions again, but it's, you know, but then that attention can grow and then you can hone your attention through prayer, through not spending your time on the things that will bring you into your sinful world in the first place. To, to. To. To meditating on holy things, to. To look upon holy things, to, you know, to sing, to do all these things which are gathering your attention in the right places so that when you have that opportunity, you. You just grab it. That's all I can say. But that doesn't. The first call doesn't come from you, right? The grace doesn't come from you. And it's the same with the sacraments. And so you can imagine that the sacraments are like this call, you know, this moment that is calling you into the life of God. And you can. And it's always there, right? It's like your baptism is there in your life and your experience in your. Even if you don't remember it because you're baptized as a child, it's still there, right? In your identity, you could say. And so there's a capacity to just hold on to it. And then there's more providence and more grace, and then you kind of. There's this back and forth movement. And so I'm definitely not a Calvinist, but it's always grace first, that's for sure. Hope that makes sense. Man, it's like these kind of questions are hard because it seems like I'm saying things that a lot of people might not even understand what I'm talking about. Hopefully you've had that experience and I'm talking just from my own experience. All right, Timothy Aspislaw says. Hey, Jonathan, you recently mentioned how movies always picture the Middle Ages as drab, brown and bleak. Do you have any recommendations for, for media that get their representation of the Middle Ages right? Alternatively, can you recommend more books on art that focus on the Middle Ages can be either text or photo based? I mean, you can have plenty of books that focus on the Middle Ages. I mean, you, you just go, just look online and look at Middle Ages, you know, middle aged tapestries, middle Age interiors, middle aged frescoes. You can just look that up online. Now, in terms of media, there's a, there are a few, there's not a lot. There's an interesting series, Russian series called Sophia and it's pretty amazing. Like in, it's. The story is, it's so, so I don't know. I, I wasn't super seduced by the story. Let's say it's kind of interesting. But the, the, the visuals are just astounding. You know, they have these highly ornate clothing with gold and you know, and then all the walls are painted in frescoes, especially in the, in the, especially in the, the castle, like the king's, the king's palace and you know, all this, this jewelry and everything. Of course, it's a royal family, so it's more ornate and you would have seen, let's say in the Middle Ages, but it gets giving. Give you a sense of like the, the love that the medievals had for color and ornament and. But in terms of other stuff, I haven't seen a lot. It's just, I don't know why. It's the same with like how they represent the Roman and Greek world. They also often represent that as white, you know, with white marble statues and all this stuff. But none of it was like that. You know, it was all color. People love ancient people love color. Just like less modern people love color. Even now, today, like go to a village in Mexico and you'll see like a Catholic church will be just covered in color. The statue is all painted and, you know, ornaments, you know, these patterns all over the wall and, you know, this kind of luscious world. So. Yeah. All right, hopefully that's helpful. All right, so unless I am Mistaken. I am done on, on this, on the website. So also, one of the reasons why sometimes I might miss the questions is that if you put them in while I'm doing the Q and A, then I'm not going to get them because I'm not going to refresh. And so just to warn you, next month I will stop the Q and A questions like a day before. So to have time to be able to manage the questions. So that means on my part, I have to promise that I won't post the questions like the, the won't. Won't post the possibility of questions three days before, which is what I've been. Which I did this month. So sorry to everybody. I'll try to post it at least like a week and a half or two week in advance. But the, the, there'll be a cut off. All right. Okay, so let's see. All right, so here on Patreon now, Justin Seligman says. Hi, Jonathan, could you please talk about the symbolism of deacons in both the liturgy iconography and the broader life of the church? Thank you. And so, I mean, sure, the deacons, it's interesting because, see, like, the deacons there, they kind of show you the hierarchy, like, because the deacons are almost like a transition. Well, there's more transitions, right, because you have cantor and then you have all these lower orders, but you can understand all the orders as just this kind of hierarchy that moves into the faithful. And it's almost, it can be indefinitely, you know, kind of cut up. And then you have altar servers which aren't at all part of the clergy, but nonetheless kind of participate in the clergy and everything. And so deacons are something like, you know, they're, they're kind of like this in between space between the, between the altar and the people. And so they had, there's something about them which is kind of bombastic and loud and, and running around. You know, they run around all the time. And that's, I think that's the best way to understand deacons. You know, they, they're in closer service to the, to the people. And they're also kind of in closer service to the clergy. They're kind of like this in between, in between thing. All right, so Drew McMan asked. Hi, Jonathan, what are your thoughts on magic? Maybe I'm making it up, but it seems to be showing up in culture more recently. And so, man, that word magic, that's a really vague word. I don't know what you mean by that. You mean like the magic, the way that C.S. lewis talked about the deep magic, that was really just basically the kind of the patterns and this, this music which is playing behind the world. You mean magic in the grosser kind of vulgar sense of using your will through ritual to affect reality. And so I think that if it's the second one, it's going to be inevitable that it takes up more space in our culture because people will realize that you can affect the world through will, and it doesn't necessarily involve complicated rituals. Right. You can see how through ritual, like, let me. Let me kind of break it down really, really at a basic, just the most boring level that you can find. It's like you can use media and ritualize speech to change the structure of reality. You can say something in a certain way which will affect the way people perceive it and will then actually transform the thing into that which you said. So that's magic. Now, there are more subtle ways. There are more subtle types of magic. There are more ritualized versions of magic. But I would say that for Christians at least, this is just not. This is not the type of thing that you need to be too attentive to because it's a kind of instrumentalization of logos and an instrumentalization of the capacities God has given us to be intermediaries between heaven and earth and to be locusts of meaning and those that gather phenomena into them. And so it's using that truth to now affect the world for my own advantage. And so in that sense of magic, I think it is definitely a problem. But I'm also not surprised that it's going to appear more and more on our horizon. So Micah Mueller says, hi, Jonathan. Thought this might be a good match. Enoch Elias is an Ethiopian deacon, would love to do a talk. And so, Micah, that talk is already recorded. I had an amazing discussion with Deacon Enoch. It was super interesting. And he, you know, Ethiopian tradition is so fascinating. So I'll. I'll let you watch it to discover some of the really interesting stuff that he. That he. That he talked about. So. All right. So Nathan Condon asked, well, hello, Jonathan. My question has to do with cremation. A family member of mine has always wanted me to cremate them and spread their ashes when they pass. I want to respect their wishes but worry about doing so. As a Christian, what is your advice? You know, I mean, all I can say is that, that the Christian tradition is to bury Derek Fiedler. Says the hopper. Do you know, not that expression. It means they're. It's like, they're like there they're kind of bouncing around and then you have to take them out. Like if they're in line, they're, they're excited to be next, but they're not next yet. So. All right, so all I can tell you is that it's not the, the, the tradition, the traditional Christian tradition is, is to be buried just because there are all kinds of implications about being buried and there are all kinds of implications towards cremation. Now, like I said, I've said this before in another Q A. It doesn't mean that if you're cremated, you're going to go to hell or any stupid thing like that. It has nothing to do with that. But I think that we need to understand that gestures have side effects that are not directly visible in the thing we do. And that's why many meaningful acts and even things people might consider superstition are not superstitious. They're not necessarily stupid because people don't, aren't able to see the side effects or the embodiment of that pattern in the world. And how in order for certain patterns to be real, there needs to be all these other things that are collated to that. And so that's why, and, and I'm not going to explain it here. I've explained it in another Q and A before. But that's why burial is, is important. But you know, I would say, I mean, I would say it's probably best to follow the person's wishes if they're not Orthodox. If they're not, you know, it's like, I don't know what to tell you. You know, it's, you know, and if they don't want to kind of participate in the Christian tradition, you can't force them. And so I would say just cremate them. You know, there's other, there are things like that in the tradition too. You know, when, when they, if a non baptized person died in, in the ancient world, they would not bury them in a cemetery, they would bury them in a mass grave, you know, because they just weren't, they weren't allowed to kind of participate in this liturgical reality. And so if people self exclude themselves from that, then you shouldn't, I don't think you should oppose them. All right, so, Dushan Babich, thank you for telling me how to pronounce that. I hope I got it right. What is the symbolism of Judge 1929? Man, you guys bring me into symbol, into judges and kings. What are you doing? And when he was coming to the house, he took a knife and laid hold on his concubine and divided her together with her bones into tall pieces and sent her into all the coast of Israel. And so you know what, man? I'm really happy that you, I'm really happy that you stumbled onto one of the most difficult, difficult verses in scripture, you know, and, and I, how can I say this? Matthew has a very good understanding of this. I have a pretty good understanding of this. But I, I'm not ready to explain it yet. And so sorry, man, but you know, I, I'll get there. I promise you I will get to explaining that story in scripture because it is a crazy story because there's a, there's a lot of other stuff going on in that story which is just nuts, right? It's not just about him having his concubine cut up, is that it's like if you know the story, he goes to, to the, to a house and he's with his mistress basically with a concubine. And then like Sodom and Gomorrah, people come to the house and want to abuse the man. And so he basically puts out his concubine outside to be abused. And she gets, and then he goes to bed and he falls asleep and then they kill her. And then when he wakes up in the morning, he goes crazy because they killed her and I cuts her up into 12. And I mean, it's nuts. And so it's completely nuts, you know, and it has to do with, has to do with the tribe of Dan as well and all that kind of left handed stuff. So, so we'll, we'll. One day we'll get into that. What I would, I really need to do is convince Matthew to write about that because he's, he would be really good at that. All right. Okay, so here we go. So Brett says, why do Moses, Jesus and Paul venture through the desert, hell on earth, death, dry, et cetera, instead of a place like the Garden of Eden, Heaven on earth, Life, water. To find God, I think it has to do with. God is always with us, even when we are going through hell. Tough times. The Lord reveals themselves to us when we are the most vulnerable. And we realize of our garments of skin can no longer protect us from what's about to happen. Let me know what you think. And so there's a lot of stuff. The best way to understand that it has to do with transition. It has to do with moving from one world to another or moving into a new world, or think about it this way. Think of it in terms of Christ, right? Being tempted, going through a kind of a temptation or a tribulation, you could say. And so it's. Think of it like. Think of it like a purification, like baptism, right? It's like this burning off of, let's say, in terms of Moses and the Egyptians. Think of that. They left Egypt as the mixed multitude, and there was good stuff and bad stuff and all this kind of chaos in there. And so they go through the desert to burn off all the stuff that doesn't belong in the Holy Land. And in the story. In the story of Israel, it is insane. It's a crazy story because the only two people from the entire original group, when they get through the desert, enter into the Promised Land. It's almost like the story of Noah, the passing of. Of Israel from Egypt to the Promised Land is similar to the flood because everybody dies in the desert. It's crazy. But I mean, it's. If you want to understand it symbolically, you have to understand it as a form of purification. It's like a form of. Of. Of burning off all the things that are holding you back and that belong to the ancient you and keeping only the seed, keeping only the divine Logos, so that you can find a new body. Right? And so that's what baptism is as well. And so that's. And so what you see in the story of Christ, when he goes out to the desert, then he experiences it as temptation. And so it's like it presents itself as this temptation to move out of himself and to give in to the chaos and give in to the fragmentation and the multiplicity. And he doesn't. Right. And he. He remains in the heart, you could say. So there are different ways to see it, right? You could see it as a burning off or as temptation, which in the case of Christ is then resisted, you know, so. All right, all right. So Jimmy Spa. Hija says what. What's the theological differences between Catholicism and Orthodoxy? I'm Catholic, married to Greek Orthodox, and personally I only think it's a cultural difference, but the faith is the same. But maybe there's more to it than what I've noticed. And so I would say it's not completely the same because it's just. I mean, it's not. And it's interesting because you really do see that Catholic people tend to think that the Orthodox are like them, and then the Orthodox tend to think that the Catholics are not like them. And so if you want to understand one of the dynamics between the two, that is definitely one of them. There's a meme Going around, you know, where it's like, I forget who it is. Like these two people. And then someone asks them, are you two friends? And then one says yes and the other one says no. It's like, that's the kind of. That's the. That's the kind of Catholic, orthodox joke. I mean, what are the theological differences? There are plenty. You know, you can look them up online. You can find many people who are wanting to discuss that and wanting to explore that. But ultimately, I think that at least in my vision, at least in the situation we are in now, it seems like in the orthodox tradition, there's more of the seed or the. Or the. The spark or the kind of mystical tradition, this kind of cosmic vision that I present, that has been preserved, but it's still there in the Catholic Church, kind of implicitly, but it's just not as. Seems like it's not as embodied, let's say. All right, so Armoury says, please comment on the symbolism of the caduceus. And if you can compare it to the symbolism of the current American Medical association logo. Does this say anything about the healthcare historically and currently? So there's a difference between the Caduceus and the Medical association logo, because the medical logo that you see is based on. Why is it that my brain isn't working? It's based on Asclepius. It's based on the rod of Asclepius and not the Caduceus. And the rod of Asclepius usually has one serpent on it. Now, in the legend of Asclepius, it seems to be suggested that there are two aspects to the serpent. And so, for example, there's a legend which says that Asclepius was. He healed people with serpents and he would take blood from the right side of the serpent in order to heal people, not from the left side. Because. Suggesting that the blood from the left side of the serpent, or the Gorgon, in this case, right, the serpent woman, the serpent monster, that the blood from the left side of the serpent monster was poison. Right. So you have this idea of poison and cure. You can see that it's related to the caduceus, if you understand the caduceus, of course, as the staff of Hermes, and the whole relationship between the idea of the messenger of the gods. The messenger of the gods, you could say, is the one that moves between that which is above and below. He's kind of the. The extension of the gods into the world and so has two sides to him. You know, can be a positive message or A negative message. And so it also is related to. To the traditions of. Of. Of. Of Hermes in general and even the more kind of hermetic traditions of. Of Hermes, which is that the way in which you act on the world has this duality, no matter what it is. Right. Medical is just one version of it. I talked about this in terms of the duality of the garments of skin is a way to understand it. And so the caduceus is just one version of that. So you can understand it as two serpents, two sides, good and bad. And so. Right. The. The orthodox bishop has a staff which has two serpents on it. And you could say that it's the same symbolism as the caduceus, but it's not a negative, it's not a bad symbolism. You're right. It's Christ with the good thief and the bad thief. And so the extensions, the one moving closer to Christ or moving away from Christ. And so understand that the in between as that moving towards the gods or away from the gods, or manifesting the will of the gods or the displeasure of the gods, it's like this duality which appears in the extensions. So I feel like when I talk about this kind of stuff, it's like it's so. It's. I'm being very hermetic. Sorry. Or very just obscure. And. And people won't understand what I'm talking about. So. Sorry. I hope some people understand what I'm talking about. All right, sorry. So, Garrett Widner. Hi, Jonathan. What is the symbolism of a maiden in a tower who escapes using hair? This is Rapunzel, of course, but I also. What I also just came across in Token Similarian, where Luthien is imprisoned in a tall tree, enchants her hair to grow, weaves it into a cloak to mask her beauty so she isn't recognized, and then weaves the rest into a rope to escape. I don't understand it at all. What is the connection between hair and escape from a high place? What is the meaning of a place that is also a prison? Being high? And so I think I've explained this before. I have a video called the Symbolism of Hair. And I think that you could probably watch that and understand, but I can explain. Has to do with extensions. It has to do with the extensions that we just talked about. So think of hair as an extension of you. Right? That is both your glory, but also your dead covering. Okay. So it's both at the same time. And so the woman up in the. The. The tower is the feminine aspect of that which is in, of the ideal, right? The feminine aspect of the ideal. Just like, just like close to the notion of the mother of God, you could say, or close to the notion of Beatrice in Dante, you know, this, that. And it's that which, it's the veil and the unveiling, right? It's the, it's the veil on the holy place. It's the veiling and unveiling of the, of the secret place where the seed is hidden, where the, the union of heaven and earth happens. And so think in the story of Rapunzel, you see, and in the version you told me, it's exactly the same. And so in the story of Rapunzel, the hair which is like the glory of this or the manifestation of this down into the world, is a way to climb up in order to reach in this mystery. And so all the forms in the world, right, the rituals, the, the, the icons, the, the, all of these are like a ladder. They're not. The things in themselves are not, are not the absolute good, but they're like little steps. And so as you encounter the scriptures, you know, you read these verses, you encounter the icons, you have all these forms, these songs, all these things that extend out of the secret place where the Logos is hidden. And so it's a ladder. So you climb it, right? How can I say this? It's like if there's recognition between you and that, if there's memory and recognition, then the steps are steps. Then all these forms, all of these things that manifest become steps. But if you are seduced by the hair itself, if the hair becomes an obstacle, the hair can become an obstacle of you seeing what is behind if you're not properly oriented. So in the version of Rapunzel, what makes the prince blind, what makes him now incapable of knowledge, is that he fails to recognize that the hair has been cut off, that the hair has been cut off, and that it is now a false ladder towards a wicked principle. So it's idols, basically. So it's become idols. All these steps, because he's incapable of recognizing the highest thing, have all become idols. And so as he climbed them, he falls and he is blinded. So it's just the story of Adam and Eve in the garden, guys, it's the same story. It's understanding that. Think of it this way, that God was going to give Adam and Eve the fruit of the knowledge of good and evil. But in order for them to get it, they had to recognize that it came from God. They had to recognize and stay in their connection to that which out of which this fruit was coming. But as soon as they see the fruit as good in itself, as appeasing to the senses in themselves, and they cease to remember the origin of it. Then when they eat it, when they grab onto that hair and start climbing, they fall into the thorns, just like the prince falls into the thorns, and they become blind. It's just the story of Adam and Eve, guys. And so it has to do with the garments of skin. All of this has to do with the garments of skin. So the garments of skin, they are layers of the glory of God, right? Just like the garments of skin on the temple. So the hairy garments and the different separators on the temple are actually steps in a ladder moving into the holy of holies. But they're also separators. They also make you further from the glory of God. And if you're not careful and you idolize the garments, if you idolize technology, anything that is an exterior form, then you increase the fall. And what you end up doing is you end up wanting to add more layers. And so in the story of Rapunzel, how is he healed? He's healed the prince. He's healed because he recognizes her voice again. He hears her voice, and in his blindness, he recognizes her. And so as he recognizes her, the water from paradise, the rivers of paradise, come down onto the prince and heal him from his blindness. Yeah, that's what it is. It's just the story of Adam and Eve. Hopefully this makes sense. All right, so Janet Horstman says, recently, some ladies I know have started wearing a shirt with an image of a skull on its side, a 10 peg to the skull's temple, and biblical Womanhood and Judges 4 or 5 written underneath. One could easily find an image of the shirt online. A year ago, I probably would have gotten the shirt as well. But having found the symbolic world, the idea of a strange figure like Jael representing biblical womanhood seems backwards. What is this odd story about? Is wearing such a shirt harmless? I don't know. I mean, it depends in what spirit it's being worn. If it's worn in a kind of weird, you know, feminism thing, it's probably not great, but it's. It's. It seems a little funny, which, you know, it's okay. But I mean, I think the idea also that. That, let's say, womanhood, you have images. There are images of saints, of the mother of God, I think even of her, like, doing the same. Like, I forget, or maybe it's not the mother of God, but I remember very specifically a female saint that's like nailing, you know, like. Like bashing demons on the head and like, nailing them down. Let me give you a little mystery about jail, is that you're right, there's something off about that story. There's also something which is pointing us. There's also something in that story which is actually pointing us towards Mary and the mother of God. Because in the story of jail, you know, she. She. It's. It's a very interesting. It's a very interesting thing which is that jail uses the tropes of seduction and woman and motherhood. And so the king comes into her tent and she covers him and she gives him milk, I think, and she. She makes him comfortable, right? And she puts him to sleep, you know, and there's some sexual undertones to it. It's not explicitly in the text, but there's some sexual undertone. But it's, It's. It's vague because it's like. It's a kind of caring that she has for this king. And then. And then in that moment, she. She uses that to kill the foreign king, basically. You have to remember that that's what he is, right? He's the strange king. He's the strange husband. He's not her husband. He's not her king. And so it's a powerful image of the feminine as well, and the feminine's capacity to recognize her own husband, right, her own king, her own, but also her own child. But it also strangely points to the story of. The story of Christ because the mother of God fixes jail because she is the mother of the one who is going to die. And so if you look at an image of the. Of the Nativity, so you will see Christ in the manger with the mother of God, you know, laying down, you know, next to him or below him, kind of as this kind of body still that. That contains him. But in the cave, right? The. The manger is also a tomb, and it looks like a tomb. And we always have to remember that if you look in Christ's halo, there's always a cross in Christ's halo in his head or around his head, going towards his head. And so the icon of the Nativity is actually the ultimate, like, fullness of the story of jail, you know, where it's turned towards salvation, you could say this aspect of. Of womanhood. And it's very mysterious, but it. It seems pretty clear that it's there in the story. All right, so Chase and Lindsay said, hey, Jonathan, I'VE noticed in a lot of media in the past 30 years that there seems to be a recurring pattern of portraying the Archangel Gabriel as an antagonist and villain. Just a small sample of films where this happens is the prophecy, Constantine, Legion and Dominion. Is there any reason why poor Gabriel would be portrayed in such a negative light? And this seems to have become a pattern. I can't seem to find any indication of Gabriel having hostile intent or becoming a fallen angel in scripture or even in other old extra biblical texts. It's very crass. It's crass and it's anti religious and it's stupid and, and you know, there's all that. But there's something, there's a mystery in, there's a mystery in Gabriel. You know, Gabriel is the, the word Gabriel, the name Gabriel has to do with, with people translated as power. But it also can have something to do with a kind of harshness, like the harshness of God. And so in, in rabbinical interpretation, Gabriel is the left hand of God and is actually associated with kind of the sword and with fire and of all this kind of imagery. And what's interesting is that in Christianity it's flipped. It's flipped where Gabriel often is in blue and has a lily and Michael is in red and has a sword, but it's kind of inverted, it's flipped from, from rabbinical interpretation. So I think that in movies where they tend to show Gabriel as being a kind of darker figure or a harsher figure, I think they're taking from, they're taking from Jewish, Jewish sources and, but still like making them trite and pathetic. Because I don't think any rabbi that respects himself would say that because Gabriel is the, is the, the Gibora, right? That he's the, he's the harshness or the, you know, that aspect of God that he's evil or all that kind of stuff. Anyways, so, yeah, so Josh said, tell Jonathan Hope that you are. Well, my question got away from me as I pondered over today. So I will try and simplified for the sake of brevity. If sainthood is rooted in being conformed to the image of Christ, it seems reasonable that the inversion of this would be transfiguration by our own hands. Have you seen examples of this in current media? Thanks so much for your time and thoughts. Well, yeah, of course. I mean, that's what the entire transhumanist move is, transfiguration by your own hands. Right? All this, all this insanity of having chips inserted in your brain and you know, of making ourselves more than human of uploading your consciousness to computer. All of this is a parody of. Of the transfiguration, you know, so. Yeah. So, Dan, Diego de la Vega says hello. Jonathan, Reading the Psalms made me reflect on the historical events of the Roman civil war and the fate of Pompeii. What do you say? The symbolic significance of the Roman general Pompey, who desecrated the temple in Jerusalem at the top of his success and fame, then years later, after losing the Roman civil war, was murdered in Egypt by assassins, then decapitated with his head placed into a basket to present to Caesar. I mean, you know, it's like I. I agree that definitely there seems to be an interesting symbolism happens moment here. But. But, yeah, but I, I never. I never necessarily thought of it that way. I mean, it is interesting that he's murdered in Egypt. Right? Interesting. You know, and then decapitated. So. Interesting. Yeah, there's. I think there definitely is a connection there for sure. It's like something that you could find in. In scripture, right? Like the story of Jezebel or something like that. It seems like that that part of the story could be found in scripture. All right. Walrus Kring, 14, says, God bless you. Jonathan, perhaps you can help me to interpret a recent dream a close friend of mine had. All right, let's see what this is. I'm not a big fan of the dream interpretation things. You guys probably know that, right? The dream place. In a local neighborhood, a group of teenagers found a hidden cave that they started exploring, at the end of which they found a dragon which they attacked and killed. People were referring to the dragon as the first dragon. After its death, the teenagers left the cave to find a second dragon was attacking the neighborhood, this one being called the last dragon. However, it was only attacking cars. Those who were not driving around were safe from its attacks. I don't know. I have some ideas in my own knowing what dragons and caves normally symbolize, but I want to hear if you have any ideas also. Don't worry, I don't plan to tell them any of this or get overly fixated on it or something. I'm just trying to test my symbolic skills. I mean, a simple way to understand it could be something like that the first dragon is hidden in a cave, is something like the seed of transformation, you know, and the last dragon is attacking things that move is. Is kind of like the final fruit of transformation or change, you could say. And so, you know, if you kill the first dragon in the cave, if you kill the meaning or the seed or the, the origin of a change, then that change is because it loses its meaning, just becomes arbitrary and out of control. And out of control, especially. And will. And will lead to fragmentation, which is represented by this burning of the cars. You know, so, I mean, that's as close as I'm going to get to any of that. So Norman Garnet says throughout the Gospels, why are the demons better able to identify and know who Christ is? Whereas his own disciples and followers seem to struggle with recognizing his true nature, even failing to hear or understand his warning of his coming death despite repeated attempts. And so, I mean, it's because demons are not embodied. They're not embodied. They see patterns. They see. Right. They see your soul. Right. They. The enfleshing of the divine Logos was also like a veil. It was hiding him. And so that's why people couldn't really see him or with great difficulty see him. And so that's why. Right, and so the, the, the demons were not. Yeah, because they could see behind there. They themselves are disembodied. And so they can. They can see patterns. All right. Marcus David, you recently said in a tweet that the mandated injections are, quote, pretty much the mark. By pretty much, did you mean that is a precursor or that it's actually. Is it. I mean, I think I answered this already. It's, it's definitely. It's moving towards. Moving in that direction is the best way to understand it, you know, so Dorothea says, is cannibalism a form of seeking intimacy from others, apart from it being a search for meaning? I've been watching Attack on Titan and it came to my mind, especially since the Titan can't reproduce by themselves. And so cannibalism is the form of. Is circular causation. Right? That's what cannibalism is. Anthropophy. Anthropophagy is. How do you pronounce it? Anthropo. I don't know how to pronounce it. Man eating. So man eating isn't exactly the same as cannibalism, Right. And so man eating, like man eating monsters, are the idea of potential or the, or the things on the outside being able to kind of devour your seed or make you waste your seed or take the meaning away from you or spread the meaning out into the wild, let's say, you know, rip you to part. Rip you apart in the wilderness. Right? It's a good image of it, you know, and you see that in Attack on Titan now they tend to like, rip the people apart A lot. So there's that, but cannibalism is a little, is different. It's man eating, but it's, it really is a, a desire for, for kind of this circular causation. You know, it has to do. Cannibalism has to do with incest and all these kind of problems of, of not getting potential from the outside, but rather recirculating potential on the inside of a system so that at some point it becomes. Comes kind of twisted and it false, it makes the system fall apart. So yeah, so that's what cannibalism is. All right, so Manuel Montiel said it seems that the New Age movement is morphing into a form of Christian Gnosticism with ideas like inner secret spiritual knowledge of God with Jesus considers an exemplar of it, but not actually God incarnate and the use of apocryphal and other religious texts to validate these ideas. Do you think this is true? And does idea of acedia play a role in it? After all, we modern men love things that come easy. I mean, I don't know. Only if the New Age movement is morphing into a form of Christian Gnosticism. New Age is just New Age. It's just a bunch of stuff. It's as idiosyncratic as every New Age practitioner. Ultimately, you know, it's idiosyncrasy itself. It's kind of mixing and matching and doing all that kind of stuff. So that's mostly what it has to do with the kind of breaking apart of the Christian narrative and then this breakdown into all these foreign and strange and idiosyncratic practices and, you know, anything from yogis and tantra to crystals and all this kind of, this kind of stuff that gets mixed up together and is just a hodgepodge, you know. And so there's a relationship between these Gnostic, these New Gnostics in the sense of the idea of using apocryphal, especially the, the Nagamati Codex, especially those that use these texts that are found buried in the ground, you know, and using it to destroy Christianity. You know, this is. So it's related to the New Age movement in the sense that like an image of the breakdown is this kind of chaotic move into idiosyncrasy and the strange and all this. But another image of the breakdown is the, is the return of the rejected. We talked about this in other guises. That is the things that are rejected at the end of a system, they come back and start to devour or judge the System. So the marginal things, right, the things that are cast out, the castaways. Think of it as the goat of Azazel, like moving out and then coming back into the camp, let's say, in order to judge those that cast it out. Because there's this problem of completeness and coherence. This is what happens at the end of anything. So there are ways to deal with that, but we're noticing, we're seeing it happen. And so the. The use of apocryphal text to destroy Christianity is. Is really the same drive which is creating intersectional culture, because it has to do with using that which was rejected to judge the order of a system. Hopefully that brings you a little further down that road. So. So Akwardox asks, from the Christian conception of the world, is there a point to secular art besides obfuscation and protection when coming down the mountain? What you talked about in the Cain story, should Christians Christian make novels and movies like Conan, Sherlock Holmes or Faust? Why? It's all about hierarchy, guys. It's all about, you know, I just told you I'm making a graphic novel, you know, it's all about things being in their proper place, you know. So think about it exactly like this problem of the mountain coming down the mountain, which is that the further down you are on the mountain, think of the waters being diluted, right? As they come down the mountain. St. Ephraim has this idea where the waters of life at the top of the mountain, as they come down the mountain, they're somewhat diluted and they lose their savor and they get mixed and with the savers of the world, right? So think about it that way and. But they're still further. Like they're further bringing water, water further out. And so think of the arts like that. Think of the art as a hierarchy of. Of layers. But those layers are both good and bad. Just like the problem of the hair that we talked about a few minutes ago. That is that the secular arts, the novels, the movies, all of this can be a way in which to bring things further out into the world to reach more quantity. But ultimately, in order to do that, you often end up having to sacrifice quality. If you understand it consciously and you understand that it's at the level where it has to be, then it can be fine. The problem is always when people put things in the wrong place. The problem is when people think that watching a movie in church is the equivalent of the liturgy, or people who think that some novel has the same amount of power and insight and participation as the scriptures or as our holy traditions. And so this is the problem. And so you could say that the problem of modern culture is not that there are secular forms of art and more participative or even entertaining forms of art. It's that we've made those the center of our culture. We've made those the most important things. We've made those the ones that we celebrate, right? And so we celebrate these kind of lowly forms as if they are the very source of culture itself and as if they are the very reason for culture. Hope that makes sense. So, wavering, radiant, ask. You know, I've only discovered you recently after a quick scan of Patreon. It seems no one has asked. Yes. I was wondering if you've seen the movie the Green Knight, and if so, what are your thoughts? Personally, I found it incredibly rich in symbolism and depth, so much so that I had to watch it a second time and wanted to watch it the third. And I feel like I still haven't grasped all that it has to say. I'm gonna disappoint you, man. I'm gonna totally disappoint you. Wavering, radiant. I don't know what to tell you. I did see it and, okay, there are some interesting things in the movie, but you have to see it in its proper. You have to see it in its frame. You have to see it in its frame which matches the frame of all the cultural things. And so I'm gonna spoil this movie for you guys. If you haven't watched it, you know, block your ears, stop listening or whatever. I'm going to totally spoil it right now because I have to spoil it to explain this problem. The movie starts with. With Gawain sitting on a throne. He's holding a scepter and a globe in his hand. And so manifesting the medieval king, the holy emperor, this is what he's manifesting. And a crown comes down from heaven to fall on his head. So right now it's all good. This is it, right? The crown coming from above. Right? Being crowned from heaven, coming down from above in order to manifest his kingship. And then when the crown lands on his head, he bursts on fire. It's already. That's the entire movie. That's the whole movie that it's all. That's what it's all about. Okay, so I'm not going to go into the details of the story, but I'm going to tell you how it ends. At the end of the movie. There's an ambiguity about whether or not go in gets his head cut off or not. Okay? But what there's no ambiguity about is that after the credits there's a post credit scene which cinches the whole symbolism of the movie, which is that there's the crown of Gawain on the ground. Remember the crown that came down from heaven to land on Gawain's head as he was sitting there on the throne in the guise of an emperor. The crown is on the floor and a little girl walks in, she takes the crown and she puts it on her head. And if you want to understand the symbolism of that movie, that's what it is. And I'm not saying there aren't some interesting aspects to it. There isn't some good symbolism in it. There is, but ultimately that's the frame of the movie. And it just strangely happens to fit with the frame of every other story which is being told by Hollywood right now, whether it's he man or Marvel or everything. And it's completely in tune with what I've talked about in terms of. Terms of the idea of self sacrifice as a trick to replace the masculine hero, the male figure, with a female figure. And so even the tropes that are positive because there is a sense of self sacrifice in Gawain where he accepts the consequence of his actions. He accepts to take the blow of the night instead of lying in a kind of Passion of Christ, little last temptation or whatever, and going back into the world and then, you know, finally really losing his head because he gives in to all these, all this politics and all this kind of playing. And so you're like, yeah, that's it, you know, that's that, that's. That's it. But then, then it just becomes he man, right? It becomes the same story as he man, the same story as Logan and all these stories of, of. Of the masculine hero sacrificing himself in order to be replaced. And it's just, it's just too bad. I hate to have to see it that way. But that's what's there in the story and it just fits with everything else. So sorry, man. Watch it again. Watch it now with that in mind. And then watch all the other stories, right? Watch all the other aspects and you'll see that the entire movie is about Gawain Deal dealing, failing and succeeding, but strangely succeeding with the feminine, right? Giving the head back to the feminine. That's the story, dude. That's why that saint is. That's why he meets that saint. That's not in the original story. He goes down into the water to find the head of the dead woman and puts the head back on her in order to save her. And it's like that story is totally fine. It's a great story but if you stitch it all together it's just the same thing, the same nonsense. All right, so David Lueders. I'm going way too long on these questions guys. Sorry. So David Lueders says hi Jonathan. Firstly, if you say my last name it's pronounced Litters. Sorry, David Litters. All right. I enjoyed your appearance on the Babylon Bee. I think it will be my new go to video for introducing symbolic thought to people interested. Thank you, I enjoyed that discussion as well. So anyways, my question has to do with the symbolism of ice and temperature more generally. Two instances of this appearing significantly in stories come from the mind come to the mind. The ninth circle of hell in Dante's Inferno. The second is the story of Fourier, a mathematician who made major contributions to equations relating to dispersion and heat related equations. He, he was known to always feel cold even during, I guess during summer. I guess it's not there but his feel called especially during summer despite wearing multiple thick coats at all times. Thanks in advance for your patience with all these long questions. So I don't know anything about this Fourier guy but, but I mean I think that in the, in the sense of, of Dante it's, it's a really interesting like game that Dante plays because there's, there's a century with the image of ice, especially Dante. It's, it's like fire is still the possibility of change, right? There's still something about fire and it's actually, it's subtly there in Dante, you know. And, and, and I can show you where it is. And I was reading the Inferno again recently and there some subtle hints in Dante, you know that what he's seeing there is not permanent, right? That there's, that there's possibility for change. But ice, like when you get to the ice, it's as if it's the thing which doesn't even have the possibility for change. It's the thing that doesn't even have. So think of it like what Dante is seeing in hell is people that are burning because their love is in the wrong place and so they're burning from love. Love is making them burn. But because they love the wrong things or they love things in the wrong order, that is why they are burning. Okay, but then if you betray, right, because that's the last circle of hell. Betrayal is acting against love. Itself. So that's why Dante sees it as the ultimate sin. And I think that that's why Dante puts ice down there in the lowest circle of hell because it's actually the absence of love. You know, I think that's what he's trying to show. So, so White Lawrence says, what is the symbolism of synthetic mind altering drugs? Xanax, Adderall, Zoloft, Ritalin, etc, You know, I don't. Man, it's all, it's all, it's all, it's all. I mean it's, it's, it's, it's all Watchmen and Nephilim, you know, it's, it's all moving in that direction. It's all not, it's all. I mean, I'm not saying there's something wrong with taking let's say a, a medicine which will help you, but, but let's say the culture of, of sedation and of transforming your mind through supplement, transforming intelligence through supplement. You know, you could say that the thrust to create mind altering drugs is the same thrust which is bringing us to desire artificial intelligence, you know, and that kind of stuff. So, so Randall B. Said Jesus walked for 40 days in the desert and he walked the earth for 40 days after the resurrection and before his ascension. Are these two walks adjoining, of opposites in some way? I don't know. I mean it has to do with a cycle. It's probably the best way to understand it is like a cycle. 40, 40 days is like a. Just like the 40 years in the, in the desert. So I don't totally understand the numerical aspect of that, but it seems to just be like a, like a section, like a cycle. All right, so Charlie Longoria says hello, Jonathan, I've been inspired to start making short films again after hearing you say that there's a need for better stories. The type of film I made back in the day, and one that I am a fan of, is horror. Being that I'm going to be Christmated into the Orthodox Church soon, is this type of movie something I shouldn't be perusing anymore? Is there a way to use this type of storytelling in a way that points back to Christ? Man, you're putting me on the spot here. I would say, I would say it's probably best not to do that and it's probably best to stay away from that. And when I say that, I actually don't think that horror movies can't bring someone to at least a sensitivity to Christ. But I would say that mostly for your own soul. Let's say, and so, right. There's a man in which even the lowest things can contain something which reveals some mystery or some aspect. But, you know, it's. It's kind of like I talked about the idea of sinning and opportunity. And so it's like even when you sin, there is a moment of, of opportunity there, but I'm not going to tell you to sin. And I think it's the same with horror movies. And so I. I think that to spend so much time as a. As a writer, as a producer, as a. As a director in a story of, of extreme violence and horror is something that might not be super good for your. For your soul, but I mean, I have to be careful. You know, I'm not saying there isn't absolutely a way to do it, but I think that it would be very dangerous. And, you know, make sure that you have someone you trust, a good spiritual father that could kind of help you through that, if that's something that you feel that you really have to. To do. So. So Harold Gonzalez says, as a software engineer who has learned a lot from your videos, I've been thinking lately about suggestion algorithms, recommendation feeds, et cetera, and the often destructive effect they can have on human community. Yeah. As these algorithms develop in sophistication, can we begin to think about them as powers and principalities? If so, they are some new form of principalities, or are. Or are they a new digital means of embodying principalities that already exist? Thanks. Okay, so let's say suggestion algorithm and recommendation feeds. I would say the best way to understand them. And I'm gonna say something, you guys, something you're gonna think is crazy. Oh, man. All right. Okay, so I'm still gonna do this. All right, so the way to understand them is something like, like a trap for an aspect of you. Think about it like you have these potential ways of manifesting yourself, you know, and so for the suggestion feed to work, it has to connect to you or else it's not going to work, or else you're not going to follow the suggestion. For it to work, it has to be something which connects your will to that which is you're trying to do. Now, what's dangerous about it is that it can frame that, it can act like, it can twist it, it can turn it towards something which is almost what you would have done, but not completely what you'd have done. And so it becomes a way, it comes a very subtle way to control your embodiment would be the best way to understand it, right, to control the way in which you will embody your logos. So those things exist. They exist already in culture. That is, we have ways to embody our intentions that are ritually bound, right? So you know, when you meet someone, you say, hello, and there's variability in there, right? But they'll probably say something like, how are you doing? And then you answer, I'm doing well. What about you? You know, and it doesn't have to be exactly those words, but there's a, there's a framing of the embodiment, right, which happens in these cultural traditional rituals, right? Now, the difficulty that we have, the difficulty of these suggestion algorithms is that one, they are meticulously invading every aspect of your expression. Like it's on Google, on Gmail, you're writing a sentence and it suggests you the end of a sentence. So it's entering in a very hyper way into every way you're communicating. And we also don't trust the people behind it. We also don't trust the intentions of those that hold the keys to those algorithms and recommendations. Because, you know, and so it's like, let's say the, the process by which. Hello, how are you doing? I'm doing well. Manifested itself is a very ancient, ancient, ancient thing that, that just organically manifested itself to embody your intentions. But this thing, you know, it's owned by a company. Companies that have shown that they have ideological leanings. And so it's super scary. You know, it's scary stuff because it's just at the beginning, you know, it's like just a very, a very subtle nudging of you towards certain possibilities. And as that gets more subtle, you're basically going, you can be brainwashed by Google and by these suggestion things. And you can see it like, you know, everybody knows, right, that if you go on Google and even in terms of algorithms and stuff, right, you can go on Google and there's certain things that if you start to write in Google, they won't finish for you because they know where you're going, but they don't want you to go there. And there's certain things that even if you type it up and you search it, they're not going to show you what you've typed. They're going to show you an ideological version of that which you put in. And so all this stuff is just, just. All right. So Lynn Holland says, I feel like what differs now from previous patterns of communism is that humanity is much more mobile for those in areas where you're deemed sick. Until proven healthy, does it make more sense to move to an area where freedom and human faces are welcome, as opposed to staying in a place where you approach. Your approach to life leaves you facing scorn. So it's like, I agree with you, but you have to understand also that Marx was right in a certain way. Is that that Marx's theory was that communism would appear after a form of world capitalism. Communism can only really work as a kind of world system. And so as we're kind of moving in this weird. This mobility of people, it's not necessarily going to do what you think. Maybe in the short term, where people that are similar to each other can meet in some places and create little bastions of resistance, it's actually going to manifest. Ultimately, it's going to probably go the other way, where this mobility is going to create a need for a world pattern and a world authority? And we're already seeing it. It's already there. My goodness. It's like all these Covid measures, they're already showing us that even if officially there's no world authority, it's all playing out that way. So. All right, so Arie Fisher says hi, Jonathan, I've been very interested in hearing you speak here and there about eschatology. And I want to see the understanding I've pieced together is on the mark. The eschaton is like an eternal moment where everything that has occurred in time is revealed in a simultaneity. And also the spiritual principles behind all occurrences are revealed. Thus, we'll be able to see the truth of all things and what principles our actions were acting as bodies. So even if taking a certain action in the present wouldn't technically be the full equivalent of, say, accepting the mark, the beast, the eschaton, would be revealed to have been participating in the pattern and thus part of its body. Am I confusing some things? Would this be more like the Last Judgment than the resurrection? So I can see. I can see what you. What you're getting to. I mean, I think that the first part of what you're saying. Hey, I'm seeing your mate Tom is in the. In the chat. Nice to see you. You guys need to check out the interview I did with your mate Tom, by the way, one of the craziest interviews that I've done, and people are really liking it because he really pushed me in a direction, in directions and talking about things in ways that I haven't before. And we ended up talking about everything, you know, aliens, UFOs, you know, clockwork elves, all that stuff. So, so check that out. And sorry to interrupt your question, Eric. So I'm really wary about this idea, you know, that would be revealed as have been participating in the pattern and thus part of the body. I think, I think it's. It's a dangerous way to. It's a dangerous way to look at it. And it's a. It's too much of a technical way to look at this type of thing. And so, you know, so let's say it this way. Let me. Let me say it this way for you to understand that what you're saying is true to a certain extent. But you could say that all acts of civilization right from the first city that Cain founded, even from the first mark that Cain received through the entire city, through the. All the manifestations of civilization until the end are going to be part of the body of the beast. And so if you're able to see it that way, then that's fine. But if you're trying to use this to decide whether or not what's going on right now is the mark of the Beast, I think that your logic is not going to. Is not going to totally hold. So El Dorado says, I remember you talking about making a video on Attack on Titan. Are you waiting for the show to end? Also, what is the symbolism of Elon Musk? I just haven't watched the whole show. It's like I don't, you know. Yeah, I don't. I don't watch a lot of it. I. I think I haven't watched an episode in months now. And so, yeah, it's just because I don't watch it. I've been watching a few more movies than before. Like I watched Green Knight. I ended up watching the. This Hidden. The. This Hidden Life by Terence Malik, which I thought was really beautiful and amazing. And thanks for all of you that have suggested that I watch it. But. But I haven't finished Attack on Titan. So, you know. All right, so, Anders Ralstad. Hi, Jonathan. What is the symbolism of loud church bells heard from far away? Is there an order to. When they ring, should ring? Yes, of course there's an order. They never ring. Church bells never ring randomly. At least they shouldn't. If they do, it's silly. You know, they ring to mark something. And so that's what it has to do with. It has to do with memory and has to do with hearing, let's say, the music from far away so that you remember that you're connected to that. And so church bells ring in a Catholic setting. They'll ring when there are services. They'll ring at a certain time. But those certain times are not just times. They're prayers. Right. People do the Angelus at 12. They would hear the church bells ring and then they would stop what they're doing and they would pray the Angelus. And there are different moments in the day when the church bells would ring and then people would do certain prayers. And they also mark events, right, like marriages and deaths and, and people that are important in the community. So that, you know, we have this, this connection, even if it's somewhat unconsciously, to the center of our, of our community. Right. Amy? Hi, Jonathan. Would you be able to expand on the back and forth you had with John Verveki on Twitter the other day about kenosis and totality? Is the kenotic, Kenotic fullness in Christ story the key apologetic for Christianity above other religions and is looking for an intellectual reason for certainty, a trap form of idolatry when it comes to faith. Thanks. And so I don't know if it's necessarily the apologetic for Christianity, but it's definitely that which Christianity is showing in a kind of fullness with the cross. And it's interesting because when I did it, when I talked about it with John, which is basically the idea that as you reach identity, you know, the highest aspect of identity is sacrifice. It's actually sacrifice of identity. So the ultimate, the highest part of identity is negation of identity. So you can imagine it, there's a kind of breakdown of identity at the bottom, where you lose your identity and in dispersion and fragmentation and chaos. But there's a kind of negation of identity which happens at the top, which is you giving yourself up to that which is above you and then also giving yourself down to that which is below. And so I think that that really is the ultimate pattern. That's why if you look at my image of the image of everything, that's why the cross is in the holy of holies. Right? That's why the cross is the tree of life. That's the mystery. Right. And so I'm going to talk about this a little more. Like the next video I have is going to talk a little bit about that in terms of kind of apophatic and cataphatic. And also I talk about it in this video I did for the Jung Society, which Jordan Peterson will be putting up on his channel. So if you're interested in that, you'll have more of that. And it, and it's interesting. I mean, it's important That I talk about it more as people kind of get to understand the pattern. Because there is a danger in thinking of these identities as solid right of these. Of a chair as a solid thing that totally exists in the world. It only exists to the extent that it gives itself to us. Right. It doesn't exist in itself. And we only exist to the extent that we give ourselves to that which is above us. You know, and so you could say the chair sacrifices itself to us and then we sacrifice ourselves to God, you know, Anyways, so, hey, you'll see more of this in the next few months. All right, Kent. And Hari says, on the surface, it seems like you and Father Andrew, Stephen Damick are doing something quite different, where you're indicating patterns which are supposed to be observable at every level. Experience seems to me that he's trying to recover a particular narrative as it was understood in a particular space and time. Can you share some reflection on what you see as the overlap? And so I think the difference between what Father Andrew and Father Stephen are doing and the Lord of Spirits and the different endeavors they're doing is they're trying to really recover the pattern and the story from the inside. You know, I kind of play both sides. You know, I. I tell people that you have to be inside the pattern, that you have to be inside the story. But then I still play a game where I explain it and then I try to go back in, and then I explain it and I try to go back in. And there's something about that which is useful, but there's something about that which is also a consequence of the breakdown of meaning. Whereas what Father Andrew's doing is just saying you are in this story, right? You're in the same story as Enoch. You have to deal with demons and you have to deal with angels, and you have to deal with all this stuff. And that's actually the first place more than the kind of desire to explicate the patterns at every level of reality. But I think that Andrew. Father Andrew does think that, but he's actually trying to embody it more also because he's. He's a priest and Father Stephen a priest. And so they. That's their job, right? To embody it in the world through the sacraments and through, you know, through their pastoral work. So. And so Jan Peter Jager is the middle between opposites, always a paradox. And so, I mean, not necessarily. You know, it can be, especially in the. In the sense of Christ, but it can all. It's. It's. It can Just be a. It's a resolution, right? It's just. It can also be just a resolution of opposites. But that's interesting, right, because there is an aspect which is paradoxical and there's an aspect of it which is solid. And so that might have something to do with what I talked about in terms of some of the aspects of the mystery of Christ, right? You know, the king and the sacrifice, you know, something like that. All right. Isaac says how symbolism can give to our petty lives at least some meaning. How can we participate in that meaning? Go to church, dude. Sorry. Go to church is the best way. Just is the best way to say it, you know, at least as an. At the outset, it'll play itself out in other aspects of your world. You know, sit around the table with your family, have a meal together, you know, take the social rituals we have and that have been handed to us seriously. Don't see them as arbitrary, you know, don't. Don't engage with them as if they're arbitrary, etc. All right, so Miro Hamad Ali says, bonsoir. What is the symbolism of fear? Is it related to being possessed by a demonic entity? Most times we don't take risks because of fear and allow that to hold us back. Thank you. Merci. And so there's a good part, there's a good aspect of fear and there's a bad aspect of fear. So think about it in the garden where after Adam and Eve, you know, after Adam and Eve ate the fruit and they covered themselves and then they were afraid and they hid themselves out of fear and out of shame. And then it also says that fear of the Lord is the beginning of wisdom. And so this is. It's a mysterious aspect because there's an aspect of fear which is a kind of awe, you know, which makes you want to. Which makes you want to. Not improperly address, let's say, engage with the thing in front of you. Think of it that way. Not improperly address it, because you feel like you're not in control of it, you know, so that's the sense in which fear can be good in terms of God, but it can also be paralyzing because it just stops you and it separates you from others as well. And so you can understand it. Like, an interesting way to see it would be to, you know, all these stories of how the angel or Christ himself, right, Christ himself coming down the mountain, you know, walking on the waters, and then the disciples are afraid, and then Christ says, do not fear. Or, you know, Gabriel presenting Himself to. To the mother of God, you know, and then do not be afraid. Right? The angel that said do not be afraid and so that there's something in there. But yeah, yeah. So I can also kind of feel like I'm getting tired. I'm happy that I stopped the the. I'm happy that I stopped the. The super chats this month. Sorry guys. For those who were counting on that Channel Journey says, what is the symbolism of the so called anti hero? This is a trope you see all over the place in contemporary culture. And I see it being praised as more realistic than the standard hero. Also recently discovered how hybrids might be implicated in the origin of the pandemic in the form of humanized mice. All right, so dude, those two things have nothing to do with each other. I was like, I thought this was one thing. All right, so I'm not going to deal with the humanized mice thing. Then I see it being praised as more realistic than the standard hero. And so it would make sense because we live in an upside down world. You know, the anti hero as this. This kind of. This flip side to. To the heroes willing to sacrifice himself. You know, the selfish character, the. But if you look at the stories of antiheroes that. If you look at stories of antiheroes that succeed that are good stories of anti heroes that the ones that people really like are always the story of the person who is selfish, self absorbed and is all. And is out of control. He's a drunk, he's a womanizer, he's all these things. But then despite himself, maybe he ends up doing the right thing. You know, that's the story of the antihero that, that connects with people. And it's interesting because it's actually the pattern of the antihero itself, which is that in manifesting the upside down of heroism, it's a. It's also the. The pattern of Antichrist. It's like in manifesting the upside down of Christ and the opposite of Christ, they're secretly, without even knowing it, without even realizing it, they're secretly pointing us back to the real hero and pointing us back to Christ. Because we recognize the antihero as exactly that as an anti hero. And so the hero always is the reference. And it's the same with Antichrist. You know, Christ will always be the reference of Antichrist and a hero would always be the. Will always be the reference of Christ. And so that's why it plays that out that way in the successful versions of the stories. And it's. It's the, it's the symbolism of the antihero itself. All right, all right. So Shane McCooster says. Hey, Jonathan, I was wondering if you could help me make sense of the role that the Protestant church might play in the narrative. God's church is often portrayed as a place for the unchurched, over churched and de. Churched. However, these accommodations make me feel uneasy. I'm a Protestant. For what that is worth, thanks for your time and thank God for your symbolic gift. Yeah, so, I mean, I think that I don't want to, I don't want to justify, let's say, what happened in the, in the breakdown of Protestantism, but I think that there's a mystery in that as well. And I've talked about that also. I think we've even talked about it today, which is that there's a mystery in this fire, this breakdown, you could say. And so the separation of the churches, which are a scandal nonetheless, but end up filling up every little nook and cranny of reality. And so despite even themselves, end up bringing Christ into the, the ends of the earth, but also diluting like the waters of paradise, right? They get further and further away, diluting the message as they split and diluting the fullness of, of the mystical part, the ontological, the cosmic aspect of Christianity, diluting it as they move out, but nonetheless moving out and nonetheless filling reality. So, and then I think there'll be a surprise in the end. There'll be a surprise where all of this is going to, you know, somehow come together. Right. I don't know how and I don't, you know, I'm, I, I'm, I'm not, I'm not an ecumenist in the, in the basics, like in the vulgar sense of that. I don't think people should just forget the divisions and pretend and just come together and in Kumbaya, you know, but, but I do think that nonetheless there's going to be a surprise and there's going to be a way in which this is going to play out like, just like in the story of, just like in every time Christ acts this transformation of scandal into, into, into glory somehow. All right, so Joe Kelly O' Neill says, hey, Jonathan, I'm about 150 pages into the ethics of beauty. It's confirming a new way that I should pursue beauty first. It hasn't defined beauty or the sub. Aspects of beauty in a way I understand quite yet. What should I read to understand the aspects of beauty better and especially in an orthodox way in order to Know what to aim at. Put simpler, how should I define beauty? And so think of beauty as. Think of the. Think of beauty as the pattern, okay? But the pattern in the way in which it draws things together. So it's important to understand that when I talk about patterns, it's that patterns draws multiplicity into itself. And so there's something. There's something about the pattern which is. Which is. Which could be said to be something like erotic. That is, the pattern calls being into its pattern. And so that is. That is beauty. And so you could say that this. It's like this. This calling into. And this drawing together. And then it's in this drawing together. So think of it. So the multiplicity gets drawn together by the beauty, by this, the seductive pattern that. That brings you together. That's the only way that you can then see the truth of that pattern. But the first reaction we have to it is. Is a kind of attraction. It's a kind of being pulled. That's the best way to explain that. Timothy, for Petitas has a wonderful way of describing that. You know, basically saying beauty first, then truth, you know, and it's like beauty towards the good and then truth. So beauty draws you towards the good. So think. Think about it. Think about it as, right, The. The. The beauty of the pattern of the chair, right, Draws. Draws its elements into it through us, but also draws us to it to sit on it, right? And then if you sit on it and you're drawn into that pattern, like, you. You see the good, but then ultimately that can lead you to the telos, like, you can then see the reason for the chair, but the process happens kind of intuitively and more. I don't know. I mean, I hope I'm making it sense here. I feel like during this whole Q and A, I've been saying things that are way more difficult than usual. Sorry. Sorry if that's happening, guys. I hope not. I hope I'm not being too esoteric in this thing. I tried to be as grounded as possible when I say things. So. All right. So Scotty Thorpe says, how familiar are you with Chris Gabriel? Meme analysis. What are your thoughts about his content? Would you be willing to make a video with him? I don't know. I'm not. I'm actually not very familiar with him at all. I think I maybe have seen a video by him, but. But, yeah, I don't. I don't. I don't know him very much. I'd have to check out his channel. Stephen Bishop says, hi, Jonathan at the Winning of Khanna. What is the significance of there being seven jars of water? Is this related to the margin 777? Also, does it connect with. To the symbolism of fermentation and change mentioned in Matthew's book? Yeah, dude, you pretty. That not good. I mean, I know that the 777, but is this an image of Christ filling, renewing the hierarchy as he begins his ministry? And so it is an image of death. Death in the sense of moving into fermentation. Fermentation is controlled death. Right. Fermentation is a form of Sabbath. It's a form of rest. It's a form of death turning against itself. So Christ turning water into wine. It's basically starting with the beginning of Genesis and then moving all the way to the end of his. The highest point, you know, of, of this, of death moving down into, into death itself. But you know, transforming it, you could say, into the celebration of the making, showing us that that's the meeting of heaven and earth, what it brings about. Right? The, the wedding feast is about filling all of this with the Logos. And so yeah, man, that story is, just has so much. And the seven obviously has to do with the seven days of, of creation itself, right? So you have the waters, the beginning, and then you have the, the whole, you have this idea that the whole process of creation and then you have wine. And so like, I'm going to say something that's gonna sound totally crazy to you guys, but some people, people who have listened to my talk would understand it. So you can imagine that, you know, something like the first jar of water would be filled with, you know, extremes, and then the second jar of water, it would kind of move towards six. And the sixth jar of water would be, it would be the balance. And then the seventh jar of water would be the wine. So something like that. But obviously that's not exactly what. That's not what the text says. But if you understand symbolism, you'll see what I'm talking about. All right. Okay. So do you think non believing people. So Matthew asked, do you think non believing people utter the words Jesus Christ or my God in response to something as an inner testament to what they claim to not believe? Or you think it's just a matter of people picking up the expressions of judo, Christian culture they grew up in? So you should look it up. I've already talked about this. I talked about it in the last Q A. The symbolism of blaspheming, the symbolism of swearing. So check it out. There's actually a clip on the Clips channel. You can find a clip of that. All right. And so I'm gonna go. There's one question on subscribestar, if my memory serves me correctly, one question on subscribe. Scar. So Big Lasagna asks, why did the symbol of the Christian night fall somewhat out of fashion, the Don Quixote? It already parodied the idea of it. Yeah. Do you have an idea when it did start and why? And so, yes, your intuition about Don Quixote is exactly. You're exactly right. And so Don Quixote manifests. Don Quixote is the beginning of the modern world, guys. Don Quixote is the beginning of the impossibility of embodying ideals. And how the notion, it's like nominalism in a story is Don Quixote. And the idea that the desire to embody ideals, you know, leads you to madness, leads you to impossibility. And so Don Quixote is all about the impossibility of something like the incarnation. But it's very. It's at the beginning of that process. It's at the beginning of these ideas. But that's ultimately what Don Quixote kind of sets the stage for, you know? And so by the time that Don Quixote appears, the ideal of the Christian night and the notion of embodying ideals in the world itself was already on the out and out. And it's also about desaturalization, Don Quixote. It's also about disenchantment, right? And so you realize that the giants are just a bunch of windmills, dude, you know, don't you understand that? It's not. Giants don't exist. Right. Santa Claus doesn't exist. It's all a guy. It's just a guy in a red suit, people. And so this is. This is what you're seeing. And how can I say this? People that understood that those wind. There's something in those windmills of the giants back in the time of Don Quixote. If people had been wise enough to understand that, then. Then maybe we wouldn't have something as insane as in artificial intelligence today. And so I'm sure Cervantes doesn't even know. Doesn't even know that Don Quixote was right in a symbolic sense. So that's my take on that. All right, so. So let me say. Let me check it out. I said I was going to do the. The super chats, and so we're gonna do the super chats. Logan Williams in the chat says. She says Don Quixote truth bombs are making Me real sad. Oh, man. Yeah. Don Quixote. Black pill is what I drop. You know, that's my job, is to just. Sorry, guys. Okay, so. All right, so let's see. So let's see. So. So. So. Wow. This new guy, there. There's. There's like so many questions in. In the super chats by the new guy. So the new guy for 4.99 most of the time, and then 9.99 for one of these questions says, what would you say to someone who says praying to the saints is idolatry? Heresy. Where does scripture validate this practice? Thanks for all you do. And so I would say that the saints tell us to pray for each other all the time and that since in Christ we are alive, we are not dead, and that there's only one body. There aren't two bodies. There isn't like one body that's out there and one body that is in here. There's one God, one son, one church, one body. And we all pray for each other in that body. And just like asking for your pastor or your friend to pray for you in the same way we ask for the saints to pray for us. So the new guy again, he says, why does Richard Rowland say that Wichita is the fourth Rome? Is this an inside joke? He's saying that because seven, with his eighth day. Oh, I'm gonna get eighth day books is there. And he loves eighth day books. And because it's a. It's a wonderful. Like, it's a wonderful bookstore and publishing that is kind of a kind of bastion for classical thinking and literature and all of that. And so that's why he says that, you know, so. So the new guy for 999 says, again, what in your eyes, would be the best depiction of a Christian warrior, especially the one who suffers from past sin? I'm an aspiring author, and I want to perfect this idea. Does Solomon Cain come to mind? So a Christian warrior who suffers from past sin. I don't know about the suffering from past sin. I mean, except for Gawain himself, you know, you see that in the story of Gawain. You see it also in Lancelot. Like, Lancelot is like a very high Christian warrior who suffers. Who suffers interiorly and then ultimately also becomes a stumbling stone, you know, for the. For the. Because he. He has an affair with Arthur's wife, with Guinevere, and it ends with him joining a monastery. So, you know, so maybe those are good, two good examples of Christian warriors who suffer from sin. All right? And so 499. If we're all a part of saintly priesthood, why pray to only certain saints? If we are all saints, what warrants their elevation over the rest of us? And the answer is hierarchy. I mean, there's just a hierarchy, you know, and so it's the same like that question, right, is the same idea that, you know, that, that certain branches of Christianity will say things like it says in scripture that we're a nation of priests and so we shouldn't have any priests. And it's the same people who say something like it says in scripture that in Christ there's neither man nor woman, so we shouldn't have men, male priests, and we should not have gender roles. And it's just people who don't understand hierarchy. They just don't understand hierarchy. What can I tell you? And so, you know, when it says that we're a nation of priests in scripture, it said that in the Old Testament too. You know, it said that Israel were a nation of priests, but not everybody in Israel was a priest. You know, Israel acted like the people of Israel acted like priests of the world. And then within Israel, fractals, like pattern priests acted upon them. And then in God all these distinctions go away, you know, all of these decisions. The hierarchy is not for God, right? The hierarchy is for us in the lower aspects of the hierarchy. And so for the same reason that you would ask your friend in church to pray for you and you wouldn't ask Nicki Minaj to pray for you is the same reason that you would then also ask the pastor to pray for you, maybe more. You might also ask a saint to pray for you even more because they have shown that they embody Christ at different levels of the hierarchy, so of a hierarchy of participation in the life of God. So hopefully that makes sense. Dude. All right, so talambada, last one. 5. Sadi, if we escape the tyranny that we are headed towards, are you optimistic for a mass self reflection of what happened or what will fill the vacuum after? Sorry to black pill you guys. We're not, we're not escaping the oncoming tyranny. So I don't know what to tell you. It's gonna get worse before it gets better, guys. Sorry. All right, and so, so yeah, so I think, I think we're done, guys. And yeah, so I think we're going to continue with the no super chats people. Just because. Just because I think this is about as much as I can handle. We'll see. Like, and, and also I'll try to we'll also try to eliminate the questions that are asked. There are some questions that are almost, that are asked almost at every super, at every Q and A, which I get it. I mean, not everybody watches all the Q&As, but you know, maybe also if you have a question, go to the Clips channel, subscribe to the Clips Channel and check out on the Clips Channel if that, that question has already been answered. Because the, the Clips channel will often take one question in this, in the, in the Q&As, one that has been important or comes up a lot. And then we'll just have a video of that. And so that might help to avoid these repetitions. So. All right, guys, so thanks, thank you for your attention and thanks to people who are supporting me as well, all the patrons. And yeah, so check out what's coming. Like this video on the Jordan Peterson these two videos that are coming out on Jordan Peterson channel are pretty exciting. And as you've seen, I'm kind of ramping up the amount of videos that I'm putting out every month, as you've noticed. If you're supporting me, you've noticed that there hasn't been a supporter only video yet this month. And it's the last day, but it will be there tomorrow, I hope. And if not tomorrow, then then on Monday. And so apologies for that, but it's coming. I will not, I will not GPU and, and you will have a patron only video this month. So thanks for everybody and, and I appreciate your, your attention and I wish you the best in these dark times. And I would say, you know, I, I know that I, I know that I, a lot of the questions kind of forced me to go into, into the dark places, but there's a lot of hope as well. And the hope comes out of the darkness. You know, the more I hear about what's going, like I'm hearing all these, these chatting, all these rumors of catechumens appearing in the Orthodox churches. So I don't know what's going on in the, in the other, in the other churches, in the Catholic Church or in the Protestant churches, but at least in America and the Orthodox churches, there's a lot of noise about how this year there are more catechumens than they have ever seen. And so these difficulties that we're going through are going to wake up a lot of people to what's happening and to the acceleration of the meaning crisis. And though it's going to be painful, no doubt I like myself. So two days ago or Was it yesterday? Yesterday evening I went to. To celebrate Readers Only vespers at a. At a new friend of mine's place. He himself is a catechumen coming from Byzantine Catholicism. And I was there. We had 10 young. There was. There was one, there was one woman and nine. There was like. I guess I was there too. So I should count myself. So eight young men, most of them catechumen. A few of them had been baptized who wanted to learn to do vespers at home and to kind of to. To also commune together and eat together and, and exchange. And so I think those little things that are. They're not much. They kind of. They give me hope. And so, so, so don't lose hope, guys. You know, there's. There's light on the end of the tunnel. It's. But there's a dark tunnel before it. So. So thanks everybody for your attention and. And I'll see you very soon. Bye bye. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon, the Pageau videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
