{"episode_id":"SW - #002 - 2018-05-21 - Sacred Symbol, Sacred Art","start":0.72,"end":71.71,"speaker":"Jonathan Pageau","text":"I'd like to welcome you to the second episode of the Symbolic World podcast. What you're about to hear is one of the first talks I gave, one of the first public talks I gave on art and symbolism. The discussion looks at the difference between traditional art and postmodern art. It looks at the structures that are within traditional art, but also the purpose of traditional art itself. I do reference to some images of postmodern art, but I think that most people who are listening will be able to make sense of what I'm talking about, despite not looking at images themselves, because I do talk in general terms about certain structures that appear in the images. And so if you are struggling to follow, you will can always find this on my YouTube channel, where the full talk is posted with all the images as well. This is Jonathan Peugeot. Welcome to the Symbolic World."}
{"episode_id":"SW - #002 - 2018-05-21 - Sacred Symbol, Sacred Art","start":100.92,"end":2760.28,"speaker":"Jonathan Pageau","text":"Well, first of all, I want to thank. Thank you all for the opportunity to talk to you about the subject that I love, which is Christian art. And I'd like to thank especially Father Michael, who seems to do all kinds of things to encourage me in my work. And so tonight I'm going to talk about sacred symbols, sacred art, how sacred art, what sacred art looks like, what makes it different from regular art, from contemporary art, from modern art. So 800 years ago, a thousand years ago, if you'd walked into a church, any church, whether a church in Jerusalem, in Constantinople, in Rome, Alexandria or Kiev, you might have felt an eerie connection. Entering the nave from the narthex, walking in and peering in, east toward the sanctuary, then looking up at the walls, at the holy people depicted there, and mostly upon gazing on that universal image of Christ, you would be connecting to a common sacred language of art. True, you might not be able to read every single inscription. You might not recognize everybody, but most of those images would be familiar to you. A cloud of witnesses present with you in prayer. It's difficult to know how this common art developed. There are actually very few official pronouncements of the church on what should be in images or what should be, how our vestments should look like, what the architecture is. And so this art developed in quiet and mysterious ways. And no matter how it happened, the grammar, the language of Christian art spread itself from Syria to Spain, creating a common experience, a common experience that was not an identical experience, but unity in a variety, as the common core of imagery was adapted to local customs and culture. All right, we are far from that time now. We have since seen a cascade of conflicts and changes so profound as to grab on to the Very core of faith itself, thoroughly shaking it, until at the end of the 19th century, we were left with almost nothing but a bit of contempt for that ancient, common Christian art. It's difficult to overemphasize the depth of the changes that have occurred in the past 500 years. Change is so fundamental than when most people look today at the ancient art, at the early Christian art, they're simply bewildered that they don't know what they're looking at. We live surrounded by this floating idea that all of early Christianity until the Renaissance was a dark age out of which we have evolved, progressed from a time of superstition and ignorance, a violent and ugly time. Yes, ugly. The idea that the Middle Ages were ugly has waxed and waned. But I remember 20 years ago, in my first art history class, I remember being told how the artists in the Middle Ages had forgot, forgotten in their dark ignorance, you know, the classical proportions of antiquity. And so the Renaissance saved Christian art. That's what we learned, and maybe not as much today, but I know that's what I learned in my art history classes. And since then, the revolutions seen in the modern age have been so profound that meaning itself, the way we understand the world, the way we see, has changed. This dramatically affects art, what its use is, what it represents, how and where it represents it. So most of us today don't see the world in the same way as the ancient Christians do. And yet. And yet so many of us, though we don't see the world as the ancients, when we look around us today, we feel a sense of loss, a loss of cohesion, a loss of community, a loss of meaning. When we look at what calls itself art today, many of us are also bewildered. We are bewildered because we wish we could find in that art meaning. We are looking for a sense of coming together, of a stable and common language, but it's just not there. Don't get me wrong. What calls itself art today still contains the grammar of our world. But it is a fragmented language, a hermetic, ironic and chaotic language. And to most people, this language is simply unintelligible. And so, for those of us today who still have this strange sense that human activity, that human making, is important, yet feel some uneasiness with what we see in the contemporary art, it might be useful to ponder the wisdom of the ancients. This is what I want to do with you today. I want to look at how the ancient Christian world was framed, how its elements of meaning were brought together to make sense. To do this, we need to look at the ancient view of simple symbolism, what we could call a symbolic vision of reality itself. But before we go on this trip, there are all kinds of ideas about symbolism, about what it is and what it isn't. And even some Christians, especially certain types of Christians, are suspicious about the word symbolism. In symbolism, they see a kind of flight of the mind, a kind of anything goes, where arbitrary meanings are pasted on top of things. And we hear this all the time, right? Even. Even I, coming from an orthodox perspective, we hear this even with icons, right? What does red mean? What does it mean, right? We'll say red means blood, right? Red is blood and it's earth. So it represents humanity, the human aspect of Christ. But then maybe red is fire, right? So it represents divinity. Or maybe red is fire, but maybe it's that other fire, right? And so we're always facing that kind of thing where we feel like meanings are pasted on top of things. And it gets especially frustrating when we can smell the ideology in someone's interpretation of something, something. Anybody who's read Da Vinci Code will know what I mean, right? Look, can't you see that Christ and Mary Magdalene were married? Isn't it obvious? Or else sometimes we get this sense that symbolism is this phantasmagorical language, right? Where impossible things need to be there, right? So the clocks are melting, so it must mean something, right? Because usually clocks don't melt. And of course, psychoanalytical ideas have not helped us either. Everybody has heard this. What do you see? Right? What does it mean to you? No one's answering, so. But there is another, maybe even more pernicious objection to symbolism. This is when symbolism is seen as a denial of what is there, right? A denial of the truth of something. I'm sure we've all encountered this. It's actually fascinating because in this view of symbolism, where meaning is a denial of factual truth, we will find the most conservative, you know, Bible belt type person and the most progressive, post Christian type, acting like two sides of a single coin. And so let's flip the coin tails, right? Fundamentalist. The story of Moses is the story of Moses, right? It talks about what Moses did, what God did. Don't tell me that Moses in the basket on the river means something, right? It can't mean something or else it wouldn't be true, right? It wouldn't have happened. If you turn the coin again, heads progressive. We can see in the story of Moses that there are structures, right? We know that Sargon of Akkad, Cyrus the Great, even Romulus were put in a basket on water to later become the leader of their people. So, right, it can't be true, right? It's a myth. It can't be true because it has meaning. And of course, I'm presenting the extremes to make a point, but I'm sure everybody here has met them. Grizzled fighters from both side of this meaning war. And it seems like in the media we always hear these two extremes, sadly. But these two positions, one denying symbolic meaning in the name of truth or factuality, and another denying all factuality in the name of structure and symbolism that we see in the stories are really essentially the same. They are both a dividing of fact and meaning, a split of mind and body, heads and tails, art versus science. But the problem is that factuality, the world out there, is a funny thing. The world is composed of an infinity of details, a stream of flowing events. In some ways, Heraclitus was right. The world around us is a flowing river. So what makes us cut into that? What makes us cut into the flow and pick out a few specifics out of the myriad of floating factoids around us? I could write a hundred page essay on my big toe, right? I could describe every crease, every point, every hair, and then I could describe every single change of my big toe from my birth until today. So in fact, I could write a 1000 page book on my big toe. But I don't do that. I don't do that because it's meaningless, because it doesn't matter. As human beings, we separate out and pull together elements from the fleeting world and engage with them to the extent that they are meaningful, to the extent that they express at least something in common with other images, other stories that are important. It is in fact pure madness to suggest a story would not be true because we see in it some structure, something in common, some contrast with other stories, right? That commonality with other stories is the very reason we noticed it in the first place, right? Why we noticed a particular person rather than all the cloud of people next to him, doing a million things and having nothing noticeable about them. And so just before I continue on this, I want to give. I want to give everybody a permission tonight. This is especially true for people who are still in college, because we get a lot of this. Next time someone tells you that Christ's life resembles some story, a Greek myth or a Hindu myth or a Syrian myth, or that Christ's life is just a collage of every other story in the Old Testament, right? Just say yes, yes, he is. Yes, it is. In fact, that's why Christ is the focus of millions of people's lives. That's why I'm talking about Christ and not about this guy, right, who's at Tim Hortons playing Minecraft on his phone, Right? That's. And when I talk about Christ, I talk about it in a way that emphasizes that meaning, right? I am not interested in a book detailing the length of his tunic or discussions among the apostles about who was going to carry who while they're walking. St. John said that if all the things that Christ had done in his life had been written down, the world itself could not contain the books that would be written. So in this light, look at this icon, right? Look at this icon in which all the elements of the story of the Crucifixion are put together even across time. So the story is not a snapshot of a moment, right? But it's a gathering of all the substantial elements from within the whole story itself. Now notice the difference between this icon and this painting by the Dutch painter Karl van Mander. The Crucifixion is a small detail in a complicated composition. The central, most visible space is held by a vendor. The modern world, starting at the end of the Middle Ages, but ramping up the stakes until the 18th, 19th century, has increasingly separated body and mind, fact and meaning. Signifier. Signifier. But if we look back, if we look back at the ancients, we will find something much different. Interestingly enough, the word symbol itself, the Greek word from which it is derived, means a coming together. Literally, it means to throw together. Right? But that's just Greeks being dramatic, so don't worry about that. In the Bible, the word symbol is often used to describe the meeting of people. Two people meeting on a road or a discussion, a conferring together. And so this coming together can also be a type of laboratory, a place where these diverse things are looking to sort things out, to find the heart of the matter. But we still use that meaning today. For example, what we call the symbol of the apostles. What is that? It's the creed in which all the basic elements of the Christian faith, faith are pointed out. They're pointed out from the thousands of things that Christian can and do believe. And they're pulled into one place in an image, in a token of our faith and of the church. And so the symbol in a traditional vision is a sign, right? That's how we're used to thinking of symbols, right? We're used to thinking of symbols and signs. The green light, the little figure on the lavatory door. But in this sense, the symbol is a sign only in that it is an actual manifestation of what the sign points to. And that is what I am suggesting to you today, that this type of symbolism is really the ancient vision of symbol symbolism, the ancient vision of how meaning exists in the world. In the Bible, there is a very beautiful use of the word symbol, right? It's in a text in The Gospel of St. Luke, Luke 2:19, after all the events of the birth of Christ, it says, upon hearing the stories of the shepherds, Mary gathered all these things, bringing them. Sorry, gathered all these things, pondering them in her heart. So the word ponder that we translate ponder is symbol. It's actually symbolo. It's the verb form. So she is gathering and bringing together, symbolizing in her heart, in her center, all of these things. And so, really, if I was going to give you one definition of what Christian symbolism is, that would be it, right there. Gathering what is around us, picking out what is meaningful, right? Taking from the matter, the facts, the raw events, separating out and picking out from all that potential what is meaningful, and bringing all together within the heart to create coherence, to create a story or an image. There are some Church fathers really starting in the Gospel of St. John itself, where beyond storytelling and commentary gives us the view of reality itself, right? Not in a scientific vision, but in a metaphysical one, how man, language, creation, all come together in relating to the divine right. One of these church fathers is called Saint Maximus the Confessor. He's a bit less known in the west, but in the Orthodox Church. He is one of the main proponents. He's one of the main thinkers about what it is, what does the Christian world look like. And for anybody here who's interested in art or symbolism or meaning, I would urge you to look into Saint Maximus writings. They're really some of the most profound things written in the history of Christianity, right? Saint Maximos, in his writings, expands greatly on the notion of Logos, the word at the beginning of St. John's Gospel, in the beginning was the Word, and the word was with God, and the Word was God. That notion of logos before St. John used it, had a very, very charged meaning. It had a long history with the Greek philosophers, with the Roman philosophers. It meant spoken word, of course, in the most common sense, in the sense of God said, let there be light, like just spoken word. But it also meant reason. Reason in both the ways we use the word today. That is reason as the origin, the purpose and the goal, right? The reason I cut my hair is my new job. But I don't have to do that because I'm an artist. So the Logos is the origin, the purpose and the goal of all things, right? That's what we believe as Christians. We can say that Christ is the origin, the purpose and the goal of all things. But in the ancient meaning of Logos, it also contained the other way. We use the word reason, that is reason as the source of logic, right? Reason as the source of reasoning. We still see the word Logos in our word logic, but here we have to see it in the sense of the middle, right? Imagine reason as a balance, Logos as the mediator of divisions, the mediator of opposites. That which brings together, but also also that which separates, right? This might seem like a paradox, right? That which brings together, but also that which separates. But really it's not complicated. It's actually quite obvious. Think about a mediator in the strict sense, in the most common sense. Imagine a fight in a couple, right? What does a mediator do? The mediator stands between both, to separate so they don't rip each other's faces off, but also to bring them together to ultimately find a common ground. And for Christians, in the case of Christ, the Mediator himself is the common ground. To understand that the Logos, the word of God, that which separated heaven and earth in the beginning, is also that which united heaven and earth in Christ, is crucial to all of Christian symbolism and to a vision of Christian, a Christian vision of reality itself. That is why St. Paul can tell us that God was in Christ, reconciling the world to himself, right? Uniting on a vertical level and on the horizontal level. There are countless examples of Christ uniting. One of the examples is in the conflict between the Jews and the gentiles, for example. St. Paul tells us that he is our peace who has made the two groups one, the Jews and the Gentiles brought together to be one. His purpose was to create in himself one new humanity out of the two, thus making peace and in one body to reconcile both of them to God through the cross. So we can see both movements in that verse, right? Uniting the Jews and the Gentiles and then reconciling up to God the vertical and the horizontal, that is the cross. So Christ is peace, but the same Logos, the same word of God is said in the Epistle of the Hebrews to be sharper than a two edged sword. It penetrates even to dividing soul and spirit, joint and marrow. Christ said, I have not come to bring peace, but the sword. The mediator is also a judge. And no one likes that image of Christ anymore. We're not actually supposed to talk about it. But beyond the sentimentality, right, of wanting this, of wanting our buddy Christ, we need to have a deeper vision, right? If we want to see in the Bible, in the Fathers and in Christian art, what meaning is, how meaning comes about, how the world was made, and how we in God's image are makers of things, we need to have a deeper vision. So coming back to St. Maximos in his cosmic vision, everything has a Logos. So Christ is the Logos, but everything in the world has a Logos. For something to even exist, right, for it to be pulled out of the void, it must have some reason. It has been named, it has been called out. There must be a let there be food or let there be Father Michael. There has to be a calling out. So St. Maximus would tell us that one does not consider anything of what is visible in the world as impure, because he does not find any irreconcilable contradiction with the ideas of things. So what he means idea of things, Read Logos, the purpose of things. So nothing in the world is impure when it is seen through its purpose, through its reason, through its Logos. All right, so St. Maximus tells us. This is going to be the most complicated quote. I promise. After that it'll get easier. You need to lay the base first. St. Maximus tells us that everything in the universe is separated from one another in an orderly manner, accordance with the logo. Logo is just plural for Logos. So the many reasons, the many purposes in which each thing consists by the ineffable One who holds and protects everything in accordance with unity. Right? So I'm gonna unpack this notice in this quote, the double movement, right, I talked about the Mediator as being as both separating and uniting. St. Maximus tells us that everything is separated according to Logo, according to the multiplicity of reasons they have for existing, the multiplicity of purposes. This is a chair. This is the color blue. This is joy. And all of this diversity consists of by the ineffable One, the ultimate Logos, the capital L. Logos, the uncreated second person of the Trinity, who holds everything in accordance with unity and gives it its ultimate sense. And that double movement, right, the uniting and the separating, the push, the pushing away and the. Not the pushing away, but the uniting and the separating. When those are done both simultaneously, when there is both division and bringing together. For St. Maximus, that is love. Love is when I give myself to another completely, utterly, without dissolving into that other, without the other dissolving into me. But by being united with you, I let you be completely other from me. Now that is love and that is the very life of God, the very life of the Divine Trinity. It is the highest image of the infinite, absolute one, absolute many, completely united, completely divided being and non being together in love. So everything leads to that. All our vision of what and how things are meaningful as Christians originate in that love. Alright, I've gone as high as I'm going to go, right? I'm not going higher than the Trinity. So we're going to come back down now. We need to land on both feet. Okay? We started this with art, and so we're going to come back to art. I want to talk about art and I want to talk about it using an icon, the icon of Christ. Looking at this icon will help us see the process of symbolism more closely. It will show us by an example how it works and how meaning appears. This is, of course, a famous image of Christ. It's probably the most famous image of Christ in the world right now. It is one of the first panel icons we have from the 6th century and it's in Egypt at the Monastery of St Catherine's right? It's an image of Christ as pentokrator, which means Christ as the ruler of all things. It's Christ at the end, right? It's Christ as he is returning when all things are resolved, when everything has come to its end. Right. I'm sure that everybody has noticed something off about this icon. Look at the eyes. Christ right eye is looking straight and his left eye is looking away and down. Some people think this is a mistake, right? And sometimes you see, artists reproduce this image and they fix it. But although these different eyes is not in every single icon. I want to show you something. Here's a mosaic from Constantinople from the 13th century, 700 years later. Look at the eyes. And here, this is the drawing for a dome that was done last year in California. There's an ancient tradition, according to Evagrio, so early, which says that the right eye is for contemplating God and the left eye is for contemplating creation. In the Sinai image, the left eye of Christ is also severe, right? The eyebrow is coming down. And so the traditional interpretation is that the right eye of Christ is the eye of mercy, the eye of peace, and the left eye of Christ is the eye of rigor, the sword. In the Gospel of Matthew we read, when the Son of man shall come in his glory and all the holy angels with him, then he shall sit upon his throne of Glory. And before him shall be gathered all the nations, and he shall separate them one from another, as a shepherd divides his sheep from the goats. And he shall set the sheep on his right and the goats on his left. Then the king shall say unto them on the right hand, come, ye blessed of my Father. And he shall say to them, come, the left hand depart from me. This gathering together of everything is referenced many places in the Gospel. Christ also says it in regards to the harvest, where the wheat and the chaff are all brought together and then they are separated. The wheat is gathered in to the barn and the chaff is cast away into the fire. I hope some of you are seeing where I'm going with this. Notice the two movements I've been alluding to from the beginning of my talk. Gathering, Separating, the very manner in which I suggested the world exists. This is what the Logos does both in creating the world and in resolving the finality of the world. In the Sinai image, we can see how the artist participated in this structure. He participated in this structure by painting it into the image itself. And so this image, this image of the Pantokrator, this image of the final Christ, of the returning Christ, will become also the image in the Last Judgment, where is made explicit this process of gathering in and raising up with the right and pushing away and down with the left. I notice in this image it is no longer his eyes, but his hands which suggest the two movements. It shows us what the prophet Simeon said about Christ. Behold, this child is destined for the fall and the rising of many in Israel. So if we look at how it appears in the Gospel and in the icons, the opposition of left and right in the image and the symbolism it evokes are not arbitrary. This is not creative or innovative. Right. In the special sense we've given to those words today, it is anchored in the reality that all humans have a strong definition, dexterous hand and a weaker, awkward one. And in 95% of people, the right hand is the strong hand and the left hand is the weak hand, is the wayward one. So before I go too far with this, I just want to tell you that I am left handed. So anything I say from now on applies to me. But I have a surprise for the lefties in the audience. Just pay attention. It's coming. This has created certain universal and inevitable social structures. For example, in almost all traditional cultures, one eats with the right hand and one washes with the left. So one gathers to oneself with the right and one separates and pushes away from oneself with the left so right will come to mean straight. I dare all the right handed people to try to write with their left hand. It won't be straight. Right. Right will come to mean straight. Right, that's the ortho. The ortho of orthodoxy, or orthodontist, right, making teeth straight. In French, it's very explicit. Droit means both right and straight. And so left will mean crooked, also multiple in the sense of divided. Right will be wise and left will be foolish. In the Bible, in the book of Ecclesiastes, it says, the heart of the wise inclines to the right, but the heart of the fool to the left. But Christ, right, Christ the Logos is the mediator of opposites, right? So where is his heart? Look again at the eyes. Now being in the middle, Christ has both the straight and the crooked. This will go further than you can imagine. There is a much later tradition which says that when Christ was on the cross, his left foot was twisted when it was nailed down. And you can see that in some icons. Look at the knee, look at how the knees face to the right, but the foot is twisted to the left. This is one of my carvings, but it's based on ancient models. So this structure of left and right will multiply itself in traditional Christian imagery. It will form a part of the worldview, the underlying mesh, the web which holds meaning together, right? And so in the Crucifixion, the good thief who recognized Christ will be placed on the right. The bad thief who mocked him will be placed on the left. And this will become the most widely accepted explanation for the Russian three barred cross, the cross where the foot rest is slanted. You can see that in this image, like a balance with the right side going up and the left going down. But as we move deeper into this symbolism, we will see that because gathering in and pushing away are not necessarily good and bad, right, the meaning will become far more encompassing. And this will elevate Christian symbolism beyond moral duality. So, for example, St. Peter will come to represent the right, right? He is the fisherman who gathers the fish at the miraculous catch. In the gospel of St. John, Christ says to Peter, put your net on the right side, from which he gathers the abundance of fish. St. Peter is the first apostle, the first to recognize Christ as the Messiah. He is an image of the foundation. And he is also the apostle to the Jews, God's first chosen people. So you can imagine then that St. Paul will be associated to the left. He is a Roman citizen, he's the apostle to the Gentiles to The foreigners, those that are far away. He is the last of the apostles. He's the 13th apostle coming after the fact. And in his own words he boasts of his weakness. He says he is the least of the apostles. He talks about the folly of Christ. But now in his writings, this folly, this being last, is transformed and becomes the highest attainment of a Christian right. I mentioned briefly that the left will come to mean drunkenness. But look at the wine on the left here. Right, Is it for drunkenness or is it for the highest mystery? Continuing the pattern, we will find the Mother of God on the right of Christ, both St. John the Baptist and St. John the Apostle on the left of Christ, Adam on the right, Eve on the left. Now let's look at that again. The church fathers often say that Eve at the fall broke the unity of the nature of humanity and separated the one nature into a myriad of individuals. And now the Mother of God united all that humanity, brought it together in her womb, in the person of Christ. And now look down at the balance, at the scale on the same axis as Christ and the Cross, the mediator of opposites. And it is extremely important to understand that this structure is not just a good, bad structure. Saint Maximus, who we've been looking at, he'll be our guide through this, talks about the sins of the right hand. Now, what do you think those are? He tells us that the passions of the flesh may be described as belonging to the left self, conceit as belonging to the right hand. So now we can see this gathering in to oneself. We can see how this can become dangerous as well. So if in St. Paul we saw the positive aspect of the left side, the foolishness, the being last, as something positive, in St. Peter, we might be able to see the opposite, the negative aspects of the right hand. Right? What is it that St. Peter said that made Christ rebuke him, that made Christ tell him, get behind me, Satan. St. Peter said that Christ would not die. St. Peter said he would never deny Christ. Right. Those are the sins of the right hand. Saint Maximus tells us that the demons that combat us by the lack of virtue are those that teach us prostitution and drunkenness, greed and jealousy. The demons that combat us with excess of virtue are those that teach us presumption, vainglory, and, and who by the vices of the right, secretly place in us the vices of the left. So actually the sin of the right is the first sin. It's the sin of Adam, it's the sin of the evil one. So that's My revenge of the lefty, by the way. But Christ would go to the end of the right and. And to the left, and He Himself would reach down to the lowest and rise up to the highest on the cross. That is Christian symbolism. So if we look at our buddy Christ image again, what do we see? With his right eye shut and his big silly grin, Christ is in the middle. This is not an image of Christ. It's just a fool. Once you begin to look at this structure, this particular structure of left and right, or the numerous other structures which create the symbolic web of sacred stories, there are many, many other of these. This is just one. You can spend your entire life meditating on the subtlety and the complexity and the reversions in this. But coming to this symbolism is coming to the structure of reality itself, right? It is not literary. It is not a type of flight of the mind. Right? It is not the anything goes which critics of symbolism will evoke. There is no copyright on this symbolism. Nobody can claim it. And if it is somehow constructed in the images and the art, it is only so that we can dive deeper into the mysteries of creation and the mysteries of God. How, as St. Paul tells us, God's invisible attributes are clearly seen being understood by the things that are made, even his eternal power. Godhead. So what is Christian art? I would like to suggest."}
{"episode_id":"SW - #002 - 2018-05-21 - Sacred Symbol, Sacred Art","start":2762.76,"end":2763.2,"speaker":"Jonathan Pageau","text":"That if."}
{"episode_id":"SW - #002 - 2018-05-21 - Sacred Symbol, Sacred Art","start":2763.2,"end":3082.34,"speaker":"Jonathan Pageau","text":"We are going to speak of a truly Christian art, it is not just art with religious subjects. Christian art is not only art made by people who call themselves Christian. Christian art is that art which imitates and participates in the Logos, in the separating and orderly gathering of elements and gathering towards a purpose. Christian art does not just point to a polemical moral meaning, but is embedded with a rich, complex and powerful structure which lead us deeper into the mysteries of God. And I am a liturgical artist in the Orthodox tradition and in an orthodox frame of worship. The paintings, the architecture, the music, the vestments, everything refers to each other. They explain and exemplify each other, their shapes, their forms, their narratives, their structures. And it creates a cosmic web of analogies. And that web culminates into Christ in the dome. They culminate into that moment of communion, into the very reason why we are there in that church. And I know this is painful for artists often to hear, but the language of contemporary art and of contemporary culture is there to do the very opposite of this. Contemporary art is an explosion of thousands of personal artistic processes in languages, each more broken and hermetic than the other. Where is the symbol? Where is the Coming together. Gone is the mysterious unity that I spoke of at the outset of an art that connects Syria to Russia to Italy to Spain. You see, the language of contemporary art has its own logos in a way, right? Maybe it's more of an anti logo something, but still there is an ironic coherence in the language used. So it has a force by which the content and the intent in the art are united to the language used to express them. All right? In early modern art, we had a language that was revolutionary, that was there to break the old traditions, that was there to destroy the Christian heritage that had been there before, right? It was an art coming at the beginning of the century where Europe was poised on two world wars. And contemporary art in the wake of that revolution is no longer revolutionary. It is rather decomposing, fragmenting. Contemporary art from the highest gallery art to the blockbuster Hollywood movie, is interested in the banal, the contradictory, the grotesque, the transgressive. It is full of irony and deflation, sentimentality, exaggeration, and at this point I am not even criticizing it. It that is what contemporary art is, right? What I'm showing you, these are the top artists of our world, and I am not picking and choosing these. If you read an art magazine, these are the people that they're talking about. So that is contemporary art. And those that understand this, they do it wonderfully. And no Christian on earth could ever come close to Jeff Koons, Plato sculptor at the in New York at the Getty, or to Quentin Tarantino or Frank Gehry. And even in the most popular cultural manifestations, really, who would rather listen to some derivative Christian rock band rather than listen to the Beatles or to Nirvana? When artists who are Christian take up the language of contemporary art, of high art or popular music and music, they often do it in a naive and not so thought out desire to be with the times. They seem to rarely understand the ramifications, the art they make and the languages they employ. Languages of disjunction and provocation and entertainment, right? This crucifix is in a church. It's made with coat hangers. So there's a pun, right? Hanging on the cross."}
{"episode_id":"SW - #002 - 2018-05-21 - Sacred Symbol, Sacred Art","start":3083.62,"end":3084.18,"speaker":"Jonathan Pageau","text":"Sorry."}
{"episode_id":"SW - #002 - 2018-05-21 - Sacred Symbol, Sacred Art","start":3084.66,"end":3744.9,"speaker":"Jonathan Pageau","text":"So what is the solution? What is the solution for someone with faith who wants to make things, who doesn't want to be mindlessly conservative, for that matter, mindlessly innovative, who wants to act with coherence, with a coherent language, with a coherent purpose? I believe the solution is in something akin to symbolism. The solution is what I have described as the process of symbolism to be. Since the Beginning of this talk, the ancient notion of art. The word art itself means fitting together. That's what it means. In the Middle Ages, there was no difference between high art and low art. There was no difference between craft and art. The word in Greek for art is techne. Techne. We have, in our word, technology. So in the ancient sense, there was not this high art. There was as much an art of painting as an art of poetry, architecture, making, beer, anything that was pulling things together and making. You see, as the modern world separated body and mind, it also separated art and technology, high art and low art. And by attempting to create a fine art, an art which elevates itself to the highest and purest language we can see, we can chart it, we can chart modern art becoming more and more elitist, esoteric and disassociated to any kind of participation in society. Art objects became simply things to look at with no use whatsoever, right? We say that today, visual arts making things to look at, so we put them in galleries and museums, because unless you're very rich, there's no other way to see these things. And in contrast, an icon, for example, is a visual object, but it is fully integrated into the life of the church. It's part of the liturgy, a tool of prayer, an instrument of teaching. It's not just a decoration or just there to be art, but this idea that we can create pure beauty, pure art, art for art's sake, it has that side effect separating itself. And so the lower part becomes technology, it becomes the product and more and more of that lower part of the art, of the ancient art became objects for use and consuming that have no transcendence. Beauty and transcendence aren't part of it. And if we try to make them beautiful, it's only so that people will buy them and consume them. But Christian art should be incarnational, that is, uniting the highest with the lowest, uniting the purposes, the logoi of things with the things in the world, not useless objects of aesthetic pleasure. It does not mean that an integrated art will not be beautiful or will not bring pleasure, but it is anchored in the purposeful. It is the difference between eating a good meal with your family and friends and binging on chocolate cake at one o' clock in the morning. If we can recapture this ancient vision of art, an art that is purposeful, the first thing it'll do is give us artists a bit more humility, right? It will pull us in from our sins of the right hand, and we can no longer be the genius artists that all adore. It also means that we will act with purpose, and these purposes will reign in our wild left hand. So we will avoid the excesses of unbridled expression and provocation and irony. All right, let's be careful, though. When I say purpose, I don't mean purpose in convincing. You know, like an advertisement or some bad Christian movie. Right? What do I mean by purpose? Right. My last point. Let's look at this. Is it possible to find the purpose of modern art? Is it possible to convert it, say Maximus tells us, that's do this way. In modern and contemporary art, we have two extremes. There's many extremes, but we can frame it this way. One of the extremes is simplifying, abstracting, let's say the right hand, right? And on the other hand, there's an extreme in multiplying, in mixing in irony. Let's call that the left hand. What if we ask ourselves, what is the purpose of these two tendencies? If we believe what St. Maximus said? But if we believe that, as he says, many things which are good in themselves are not good because of the motive for which they are done, so can we find the original purpose? Why would we simplify things? Is it not to emphasize the purity, the simplicity, the oneness? We could say that in reducing the noise, simplicity wants to get to the essence, right? It is that gathering in of the right hand. We can use this as artists trying to cut to the basics, right? It can warn us of the dangers when meanings are lost in excess of ornament, excess of color, excess of composition. And I think this is something which exists today as a movement in many contemporary liturgical artists that I know. Ultimately, the desire towards simplicity is to be an image of the unity of God and the unity of the person of Jesus Christ. It's only when it's taken to unbalanced extremes, where multiplicity is forgotten, that this desire for purity will give birth to the modern monsters that we saw in the 20th and 21st century, like religious extremism or even Nazism. What is Nazism but the desire for purity to cut off the margins? It's only that in this case, we're talking about people. And in art, this extreme purification will lead to minimalism. We just saw that in the. In the black square on the wall in which the art is so simplified that there's nothing human left about it. There's no place to breathe. All right, so back to the left hand. What is the purpose of multiply and showing diversity? Is it not to show complexity, abundance and movement? Is it not to show the dynamics of change. Or we can also use that as artists, be sensitive to it and avoid a frozen, monolithic art, and to make sure that art is integrated into the specifics and locale of different cultures. It could even show us the mystical possibilities of the limit, the mystical possibilities of the Holy Fool. But this can be done only in balance with unity. This understanding of multiplicity and complexity is also a movement in many contemporary liturgical artists I know. And ultimately, this desire towards complexity is anchored in the diversity of persons in God, the duality of the natures of Christ. It is only when taken to extremes and forgetting unity that it becomes the fragmented, highly confused and individualistic democracies we live in, or the mad desire, the consumerism, the irony and the excess of so much contemporary culture. So maybe the question asked by artists, musicians, writers, should no longer be how, as Christians, we can make art or music or literature that is more in step with the modern world, right? How we can attract modern people by being modern, but rather without falling into blind conservativism. We should once again look and try to express, look for and try to express the Logos in all we do, the hidden purposes, whether it is in liturgical art or in more secular art, we need to ask ourselves how the use of what we are making, how the materials, the forms, the subjects and the styles all fit with each other and participate in the Logos and so become, even if indirectly, a place where God's invisible attributes are clearly seen, being understood by the things that are made. This means that we will anchor ourselves in our traditions, in those patterns and structures I've alluded to from the beginning, and those will be our guide, and ultimately Christ will be our guide to pull out of contemporary art, to pull out of contemporary culture, the things which fit. And so that's my vision for you today. That is the path that I have set for myself in my own art. And so I hope, if it might seem too extreme, too crazy to some, or maybe too conservative to others, I will have provoked a process of thought which hopefully will bring a balance of how the Church of Christ relates to art, the art we make and the art we see. Thank you."}
