{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":12.56,"end":16,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":26.25,"end":36.41,"speaker":"Carl Benjamin","text":"Hi, folks. I'm having a conversation with Jonathan Peugeot. He's an artist and a public speaker who I suppose rose to prominence through his work with Jordan Peterson. Jonathan, how are you?"}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":36.97,"end":46.97,"speaker":"Jonathan Pageau","text":"Been great. It's good to meet you. I've been following your work, I guess, since Jordan Peterson appeared online and he was on your channel, I started to pay attention a little bit to you. And so it's nice to talk to you."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":47.45,"end":71.85,"speaker":"Carl Benjamin","text":"Thank you. Right, so I guess the best place for us to start would probably be about 10 or 20 years ago with the sort of rise of the New Atheists. I think this is the sort of foundation of the root of one of the problems that we found ourselves in. Would you like to tell me what your opinion of the New Atheists is and how you feel that their movement has developed and what's happened to it?"}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":72.33,"end":173.41,"speaker":"Jonathan Pageau","text":"I would say on the one hand, when the New Atheists kind of appeared on the scene, I was very aggravated with the way they spoke and their arguments, but I also felt like people couldn't understand the counter argument. It's very strange. People, people were struggling to understand how to frame the counter argument. And I've been kind of developing my ideas for years, not just about that, but partly about how to answer this kind of argument. And then Jordan Peterson appeared, and we realized when he discovered my work as well, that we were on the same page. And I feel like he broke through the wall in trying to explain the problem of the New Atheist movement and bringing back the notion of consciousness, the problem of framing and of the question of how phenomena manifest itself and patterns. All of this stuff which the New Atheists just ignored because they were so focused on kind of scientific questions, they didn't realize the problem of the viewer and the problem of consciousness in the whole, let's say, in the pattern of all of this together. So I feel like that has been kind of broken. And also we're seeing more and more as we watched our society break down. We watch how everything is fragmenting and people are at each other's throats, that the glue that unites us together, it's slipping, and it's not based on facts. It's something more. It's something like identity or something that brings us together. And the question is, what is the foundation of that unity? And I think that that's also a place where a lot of people who were interested in the New Atheist argument are wondering, okay, so, okay, so if we agree with this kind of argumentation, then why do we exist as societies? Like what binds us together?"}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":174.69,"end":248.39,"speaker":"Carl Benjamin","text":"Yeah, I've got a very similar view. I don't know whether you know about my personal history, but I mean, I was always a huge fan of Christopher Hitchens, being somewhat of a contrarian myself. And it's only as I have matured out of my 20s and 30s now into my 40s, that I realize how shortsighted the New Atheists seems to have been. Because I mean, it's very easy to break apart the dogmatism that comes from a 2000 year old book. Obviously it's not going to be consistent or scientific or rational. Obviously it vastly predates that era. But that's kind of missing the point of it, isn't it? Because really the point, I think, is to provide sort of moral direction. And I think that without this, when you take this away, you kind of leave people in a bit of a fog not knowing what they should be doing with their lives. And we're kind of left in this very sort of hedonistic, utilitarian period where almost anything seems to go now. There's no particular boundaries anymore other than direct physical harm. And so if you're not directly harming someone or it's not obvious that someone's in pain, then pretty much anything goes, doesn't it?"}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":248.71,"end":343.85,"speaker":"Jonathan Pageau","text":"Yeah. And my argument, I would say, starts a little bit before that, in the sense that I think that religion is not really about morality at first glance, it's about morality downstream, but at the first level it's about creating a pattern of being, a pattern of how the world exists. And so it's very imagistic. It ends up being an imagistic pattern, a story pattern, also a architectural pattern. You can imagine, like a pattern in space, how space manifests itself. And then from there there will be some moral questions which will come down. But once you look at the sacred text in terms of a story, in terms of imagistic, really almost like if you're reading Lord of the Rings and you want to understand Lord of the Rings, if you read the Bible that way, you'll understand it a lot better than if you try to nitpick at it and try to find how it's scientifically not accurate. But if you look at it as a kind of grand story and a grand narrative in which we frame our existence, then not only is it actually quite coherent, but you realize that the categories that are used in scripture, let's say, are actually the categories that, although not scientific, are the categories that we live in. Right. And you could Say something like, you know, the sun doesn't turn around the Earth. And then you could make all these arguments to say how stupid people who thought that in the past were. But you still get up in the morning and you still go to bed at night and the sun still goes down over the horizon. And so phenomenologically, it's still an experience that manages our life."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":344.33,"end":467.44,"speaker":"Carl Benjamin","text":"Yeah, the way I've been viewing this is essentially separating the two thought processes out into scientific thinking and what I guess I'll just call mythological thinking. And both have predictive power. And this is something that I think that people who are entirely bound up with scientific thinking can't bring themselves to admit. It doesn't matter if Helios isn't really pushing the chariot of the sun around the Earth every day. The point is, you know, an ancient Greek pagan knows that the sun's going to rise in the morning, the next day, and he knows he's going to get a procession of seasons, so he knows when to plant scorn. And so even though, you know, it might not technically be correct, it still has predictive power and it's woven into a larger scheme of meaning for that person and allows them to kind of identify their place in the world relative to others and things like this. And this is what I think the ball I think the new atheists dropped with the deconstruction of Christianity and other religions, of course, is that it's. Most people's daily life is actually a lot more mythological than it is scientific. You know, most people don't really understand why a lot of the things that happen around them happen. It's on a technical level. But they do have the kind of superstitious sort of view of the world. And this, I just think, is just normal. This is most people's lives, and this is how people, I think, think of themselves as well. You know, you are your own story in which you are a hero, you know, you are the protagonist, and, you know, there are villains, the people who bullied you at school, or, you know, whatever it is, you know, there are the villains of this story. And so I don't think it's illegitimate to think of ourselves in a less scientific way. And in fact, I've been thinking about this a lot. Like, it seems actually to encompass the kind of spark of the. The precious nature of a human life can actually be very easily dismissed. As soon as you abandon the kind of religious worldview or the mythological worldview, it seems very easy to justify killing a lot of people which happened all through the 20th century."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":467.44,"end":501.02,"speaker":"Jonathan Pageau","text":"Yeah. And not only that, but if you look at people today and who, let's say, who think that religion is superfluous and think that that, say just secular culture is fine, there's still on the horizon antinatalist and anti human sentiment. Even in the ecological movement, there's massive anti human sentiment in that. And people don't realize how far that can go and what that can lead to. But they take up the arguments. In everyday life you'll meet someone who will say how we're parasites on the earth and how we're destroying everything. And it's like, man, there's some scary stuff down the line from that type of argumentation that you don't understand."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":501.75,"end":535.49,"speaker":"Carl Benjamin","text":"Oh, totally. I mean, I remember seeing an argument that we shouldn't mine asteroids and that we should leave them for the universe. And it's like, why? And again, like, even though they end up in this kind of, you know, like you say anti human sort of view, I mean, there's something kind of mythological about the way they're conceiving of the universe there as a kind of holistic, divine whole that mankind is sullying or profaning in some way by mining these asteroids or whatever it is. I just find this to be a ridiculous sentiment."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":535.97,"end":598.41,"speaker":"Jonathan Pageau","text":"Yeah, well, I think that one of my arguments has really been that if you don't take care of the mythological in an explicit manner, if you don't have rituals, if you don't have sacred spaces, if you don't have the structures that, let's say, manifest this aspect of the human person, then it's going to be there anyways. You can't get rid of it. It's going to come back in all kinds of insane, crazy ways like we saw in the US with all the George Floyd protests. They were religious in nature. Everything they were doing, the self flagellation, the kneeling, the iconography, all of it. Yeah, you had these images of him as like a saint or even as Christ sometimes. And so the idea is if you try to say that this is irrelevant, it's going to creep back and it's going to show itself in monstrous manner. So it's better to deal with it explicitly and to have, you know, to have rituals, to have sacred spaces, to have this as part of what a culture is, rather than leave it up to the chaos to kind of manifest these, these passions, let's say."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":598.65,"end":728.21,"speaker":"Carl Benjamin","text":"Oh, I totally agree with you. And it does seem to be just an innate characteristic of like humans being able to kind of heuristically guide themselves through the world, you know, and have a general understanding of things. It seems like it's inevitable and innate and inescapable. And I think this is kind of the. The great conceit of the Enlightenment is that we can become these scientific, rational beings. It's like, well, maybe we can, but for about 100,000 years we weren't. And I think it's a bit arrogant to suggest that suddenly we just flip the table and suddenly everything will be different. Everyone would be perfectly rational. And the thing is, as soon as you enter into that mind space, you realize that you're being entirely materialistic. And one of the things that I really kind of despise, actually I'm beginning to really despise about Enlightenment thought generally, is the interchangeability of everything. This is a really real concern for me. I mean, it's fine when you're talking about material products, but even then, the commodification of everything, even human beings, means you have to reduce everything to its most basic parts. And so there's nothing special or unique or artistic anymore. But then essentially you as an individual have no special value. You're not mythic. And I've had a lot of people asking me recently for some, because I've been talking about the subject and the way that I've been trying to explain is, look like if I found the sword of Alexander the Great, you know, you might be able to, you know, if I. And I could guarantee I broke into his tomb or something, you know, and in his coffin I pull out his sword. That sword has got like mythical significance to the people who know who Alexander the Great is and think of him in good manner. You know, you can make all the replicas of this you want. You could set up a factory line producing replicas of Alexander the Great sword, but they will never be under the Great Sword. You know, I'll have the only one. And it's the same thing with, you know, every. And this is the kind of. It's like an overlay that goes over the world. You know, the sort of mythical narrative, you know, it's like the Spear of Longinus, you know, the piece of the true cross. All of these things are totally irreplaceable. And they are beyond the concept of value. You know, they are priceless."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":728.69,"end":841.65,"speaker":"Jonathan Pageau","text":"So they're inevitable. And it's actually the world manifests itself. Even our own categories, even all the categories we use, even the scientific categories we use to define the world, are value laden. Because let's say all phenomena has an indefinite amount of ways you could describe it. It has an indefinite amount of possibilities of existing, let's say. And so the categories we use are always categories which take into account the importance that humans have for it. Even, like I said in scientific research, even in research, the funding that goes into research will be based on values that will dec what is important to research and what is important to understand. So even though it's objective in terms of the facts that they find, the reason why we're even looking at those facts is based on value. And that's been, I would say one of the main things that I've been trying to do for the past four years is to help people understand hierarchy, is to help people understand how hierarchy lays itself out, how these, all the images we have from scripture, the temple, the tabernacle, the mountain, heaven and earth, you know, the garden with the central tree, all of these images are there to help us understand what hierarchy is. But. And once you understand that, you also can understand what's happening to us now. Because understanding hierarchy also means understanding how that breaks down. And the image of how hierarchy breaks down is a way to understand what is happening to us. Right? And so this idea from the ancient world that you had your umphalos, right, you had your navel of the world, and on the edge of the world you had all these monsters with like strange heads and mixtures of different animals. It's like you can think that that's mythical, but when you see the crazy, tattooed, pierced person with pink hair, you're like, it's not. It's happening to you right now. These monsters are coming out of the dark and they're coming out into the street. So don't tell me it's just a, it's just a story because it's happening to us."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":841.89,"end":876.87,"speaker":"Carl Benjamin","text":"No, no, I totally agree. Again, it has predictive value. If you go far enough away from the familiar, you're going to come into a realm of essentially monsters. You know, it's going to be exactly as you say, it's going to be strange, can be dangerous. You're not going to know what's happening. And it's going to be an adventure that in the, you know, the hero's journey of it, you get back and you're going to explain to everyone, look, I saw some crazy stuff out there. And this happens everywhere. You know, this, this happens when I went over to LA for the first time. You know, I had to explain to my, like my wife and my family, you know, people over there are very different, you know, it's a strange world, you know, compared to. Compared to my nice house in England."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":878.61,"end":953.79,"speaker":"Jonathan Pageau","text":"This is true about everything. Not just like, let's say, human interaction stories, but even normal categories of being. Like, I always use the example of a cup. So there's an identity of a cup. Like, there's an invisible pattern of a cup. And then there are examples of cups in the world. And there are some examples that are like, is it a cup? Is it a glass? It's in between. It's kind of on the fringe of what a cup can be. And that's totally fine. As long as you can see that it's kind of a monster cup, then it has its role in the world. It's fine for it to be there. Like, it's also fine for the monsters to exist. They're inevitable in how the world lays itself out. The problem is when the monster tries to take the throne, right? The problem is when the monster tries to get into the altar. That's the problem. It's not that there are monsters out there and that there are things that don't fit into categories those are normally there and that you can't get rid of them. The problem we have now is that it's like we're in. The monsters have come into the. They're coming in and they're trying to take the throne. And that's. It's not good for the monsters either, which is something that a lot of the monsters don't understand because you're. You. You're not gonna like it there. It's because your whole idea is to not be normative. If you're not normative, why would you want to take the normality and then not be good to you?"}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":954.35,"end":1028.51,"speaker":"Carl Benjamin","text":"I find that really interesting, actually. That's a really good way of framing it because. And you're essentially setting the entire hierarchy on its head and putting the thing that should be the furthest from being in charge in charge. And so that's going to change the nature of everything. Any justifying or legitimating structures that you had are going to suddenly have to change. They're going to become illegitimate. Things are going to be completely different. And not only that, but you take away the meaning of the people who are already invested in this hierarchy. And I don't know, whenever you say the word hierarchy, it sounds like there's implicitly a form of oppression tied up in it, but that's not the case. And I mean, some hierarchies, of course, are oppressive naturally, but others are not oppressive and in fact are conducive to liberty, conducive to freedom and security and happiness and prosperity. Without a state, we don't have property rights. And therefore we need this kind of hierarchy in order to make sure that the contract for this office is enforced so the landlord doesn't just turf me out and take my money. There's all sorts of reasons that we have these things. And you're right, putting the unknown monsters in charge of the hierarchy is bad for everyone. It's a great way to."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":1029.31,"end":1083.43,"speaker":"Jonathan Pageau","text":"Hierarchy is both at the same time. It's a method of exclusion and a method of participation. It also shows you how to participate in the pattern. Because without a hierarchy, you have no way of knowing, right? You have no way of knowing who's the best runner if you don't have a hierarchy of runners. And so once you have a hierarchy of runner, it's like, okay, here's the best runner. I'm not that good. And now I know what access I have. Like, where am I on the, on the ladder. And I can have to reach, I can reach up, I can try to get better in my hierarchy. But without the hierarchy, if you just, let's say you have a race and then for slower people, you let them start first because they're slower, then all of a sudden everything just breaks down because you don't even know what excellence is. And you don't even, even if you win, there's no value in the winning. It just become a blood."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":1083.67,"end":1102.05,"speaker":"Carl Benjamin","text":"The only point to do that would be to avoid the concept of a winner or a loser, wouldn't it? If you're trying to sort of equalize these things, you're saying there's actually something wrong with being a winner and a loser. And I like the way you frame that as well, the sort of inclusive nature of it. If there is no hierarchy, what are you trying to be included in?"}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":1103.25,"end":1197.68,"speaker":"Jonathan Pageau","text":"And that's why one of the, like, I've been talking about this recently, I've been pushing it and I made a video recently on parasitic storytelling, you know, with like all the crazy stuff we're seeing in the franchises. And my point at the, in the end was that because the weird kind of parasitic storytelling of like, you know, the woman beating up the men and all of this stuff that we're seeing in these stories, it always has to reestablish the hierarchy because it has to be the victim of it. And so in the end, in the very pattern of this weird upside down world is the key to bringing it Right side up, because the position of the center is always open because they have to restate it all the time. And so what ends up the key now to storytelling, I think, and I'm telling people this, is keep an eye out for these types of stories are kind of Return of the King stories, right? Where the world becomes upside down, Robin Hood style. You know, an illegitimate kind of horrible prince takes over, and then the good guy has to act like a robber and has to be like a trickster. And then it flips back when the lionheart comes back, and then we reestablish a normal order. And I think that that's also. It's also one of the reasons why people like you, for example, and other people who were there, you know, several years ago appeared at first as kind of weird trickster, kind of, let's say troll type figures, and then slowly shifted towards people who kind of saw the pattern and saw the importance of social hierarchies and stories and all of this. And so it's like these weird upside down figures who are kind of now are ending up bringing back a kind of order. You know, this is the Robin Hood figure, I would say."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":1197.84,"end":1253.59,"speaker":"Carl Benjamin","text":"I totally agree. And I like the use of the Robin Hood metaphor that you're using here, because the entire sort of arc of Robin Hood really does come back around to the king reintegrating Robin into. To his court. So I think the earliest stories, he wasn't actually a noble, but like in later tellings, he was. But the point is, Robin Hood represents an aspect of the culture that is responding to something that is fundamentally wrong, something that is unjust, something is not being dealt with as is proper. And as you say, the return of the king, the legitimate king. The legitimate king recognizes what Robin Hood is doing and why he's doing it. And that's an important, important thing. And you're right. I mean, I think that people like myself, the sort of, you know, dissident outlaw types. I agree. I think that's the reason we're doing anything that we're doing, to be honest."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":1253.59,"end":1300.05,"speaker":"Jonathan Pageau","text":"There's something wrong and it's very fast. I talked about this, like in 2017. I was talking about you and Milo and all these weird figures that kind of appeared online and talking about how when the world is upside down, then the fool is going to turn it right side up. And so one of the hashtags I put out is called Watch the fools. And like, Kanye west is playing that role right now. Kanye is totally playing that role where he is a crazy Guy, like, he's still wild and crazy and does weird stuff, but then he says things that no one is allowed to say because he's seen as this kind of fool character. And he says things that no one's allowed to say, and it's actually just normal common sense. Like, the most common sense thing he ends up saying, but no one else is, because it's like. Because the world is upside down. Normal things aren't. We can't even say normal things."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":1300.92,"end":1348.57,"speaker":"Carl Benjamin","text":"No, I totally agree. And one of the things I found interesting is that Kanye did an interview with tmz, sort of celebrity news outlet. And in the studio, he was getting a lot of grief from other black people who worked at the thing. But he didn't approach this. You could see it in his face. He wasn't offended. He just had a very determined look on his face. As in, right, I know I'm right. I know I can see something true. How can I project this across? And the problem was getting his message across, not the fact that he wasn't sure about his message. And I was like, I've been following Kanye's sort of political activism in the same way, because I really think that what he did was very brave. When in 2018, he was wearing the MAGA hat and went to the White House. I think that's tremendously brave."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":1349.61,"end":1389.68,"speaker":"Jonathan Pageau","text":"And he's doing it out of almost like a. There's a weird kind. I think there's an impulse in these kinds of characters, the kind of trickster characters. And it's a. And it's really a pattern of being where, you know, you have these kind of holy fool characters or these traditional characters in ancient societies, like the Jester or the Heyoka in Native American cultures, where their whole role is to point out, you know, the foibles of the system, Right? And so they're there to point out how the system is limited. But the question is, when the whole system is corrupt, and what does the fool have to do? If they're gonna point out something, they're gonna actually point out the need for the system. It's gonna be. It's just. It's like an impulse. It's just gonna happen."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":1390.23,"end":1441.17,"speaker":"Carl Benjamin","text":"Yeah. No, I totally agree. I think that the fool plays the role of testing the legitimacy of the system, because the system has got to be able to endure the fool, and that shows that it's being run correctly. And if the fool. It's like when the king kills the fool, you know, you are dealing with the tyrannical king because the fool is meant to be able to say anything and everyone should be able to laugh at him. And then everyone's in their right place. That's where the fool wanted to be. That's where the king wants the fool to be, theoretically. And that there is like an understanding, an implicit understanding that this is the. And I think again, this is just an expression of natural human consciousness and different personality types working together. Because honestly, I was always the class clown when I was in school. You know, I was, I'm happy to play. I like, you know, I have great, great mirth in provoking serious reactions from people who should know better than to react to what I'm doing, you know."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":1441.17,"end":1521.77,"speaker":"Jonathan Pageau","text":"And so ancient, like medieval culture, they every year they had, they had different fool festivals. They had a festival called the Feast of Fools. They had a feast of the ass where they would bring a donkey into the church and like bring it up the altar and people would bray like donkeys and stuff like. So part of medieval culture was always to integrate this aspect of reality. That's why medieval churches are built the way they do. And why on the outside of churches there are gargoyles and monsters. And why in the margin of medieval manuscripts they have marginalia where they have all this crazy stuff going on and like weird upside down mix of animals and humans. Just like the cosmic vision, the world. How on the edge of the world there are all these monsters. Well, on the edge of the manuscript there are monsters and on the edge of the church there are monsters. And so my, my basic argument about people understanding religious patterns is that they're fractal in nature, right? They, they have a pattern of being and then they manifest those patterns at all levels of reality. So the cosmic, the, the social and then the personal. Because on your fringe you also have weird like undealt with stuff that is not totally in line with what you would want or what you would want your line to be. So even the human person is made like a. And the church is made like the cosmos. And that's basically the mythic structure of the, let's say the Christian mythological structure, which as you said, as we're getting rid of it, then the world becomes topsy turvy and upside down."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":1522.09,"end":1536.09,"speaker":"Carl Benjamin","text":"Yeah. And I really think that is the case. This is the thing that, I think. Didn't Richard Dawkins actually say something to this effect as well recently? That there may have been something about Christianity that was actually worth preserving."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":1538.19,"end":1539.63,"speaker":"Jonathan Pageau","text":"Thank you, Richard. Thank you."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":1541.55,"end":1567.28,"speaker":"Carl Benjamin","text":"Yeah, but the thing that the, I mean it's all well and Good. It's very easy to deconstruct someone else's positive vision of the world. But if you're not going to replace it with something, then it's going to be replaced by anything. And it seems to be this sort of like, drive towards absolute freedom or autonomy. That is where we're heading. And I don't think that's going to be a very healthy thing for people generally."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":1567.68,"end":1572.08,"speaker":"Jonathan Pageau","text":"Yeah. And so then the question is, what do we do?"}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":1572.32,"end":1572.88,"speaker":"Carl Benjamin","text":"Yeah."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":1573.36,"end":1597.42,"speaker":"Jonathan Pageau","text":"And my call, like, to people, and this is hard. This is, let's say it's hard a lot for a lot of people to get there is that it has to be real. Like, you have to get involved, you have to get engaged. And so we have a lot of people that are theoretically there, but there are not a lot of people that are willing to dive back in, like, to actually go to church. Like, not a lot of people are willing go to church."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":1598.3,"end":1631.21,"speaker":"Carl Benjamin","text":"I've got to be honest, I'm one of these people. I'm not going to go to a church. Well, actually, that's not true. I go to lots of churches just as a tourist. I don't do it for religious reasons. And so. Okay, yeah, so let's. What are the options then? To the ex new atheist who is finding themselves a bit adrift in a sea of chaos, they don't have any particular purpose in their life, but they can't find themselves believing in a religion. Where can they go?"}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":1632.73,"end":1800.83,"speaker":"Jonathan Pageau","text":"I don't know if there's a solution in the sense that my solution has rather been to reinvigorate Christianity and to give it its original. Because one of the things that has to break in our mind is to think that all these people before us were idiots. Once you break that, then when you read the Church Fathers, when you read Augustine or you read I have my own favorite Church Fathers, you realize they knew exactly what they were talking about and they did it very deliberately. And so it also helps you to kind of reinvigorate Christianity in a manner in which then the intellectually honest person is actually able to engage. And that's, let's say, the people around me. I would say that that's what's happening with them, is that they actually understand what this is about. Like, when they go to church, they see that the space of the church is organized in a cosmic pattern. They realize that the year of the liturgical year, let's say, follows a pattern of storytelling and a cosmic pattern. And they realize that the story of Christ and death and resurrection, that's the story of everything. Like, it's actually the pattern of reality which is showing itself to you. And once you kind of are able to get back the depth of the message, then you're able to engage. And then there are thousands of people that have been following me that are just. They're going back to church, usually a traditional church, not like a kind of pop Protestant type church, but rather really the liturgical churches. Because liturgy is really a cosmic. Has a cosmic pattern. The way that the actual ritual of the church is set up and the way you have this hierarchy of space and this hierarchy in time and everything kind of flows out into. Into the world. It's a completely. Once you get it, then it's not. It doesn't bother you so much. Like you're participating in the giant dance and you get involved. So that's what I've been seeing. I've actually. I've been seeing a lot of people who are. Who are going back. One of the alternatives is people who make up these new religions. A lot of people are there a lot of new pagans and stuff. People who want to make up because they. They don't like Christianity. They want to recapture some. Some idea of like pagan gods or whatever. I've seen that stuff. People have a union, want to have, like a more psychological approach, which I understand. I have sympathy for that too, because it's true. The problem about that is that you have to realize that it stacks up. If this is really the pattern of reality and then you go into like a psychological version of the religious pattern, it's like it's going to work because it's true. But how does it stack up in terms of the other higher beings? Like, how does it stack up in terms of your community, your family, you know, your nation, and it's a Europe in general? Like, how does it has to stack up in reality?"}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":1801.15,"end":1879.69,"speaker":"Carl Benjamin","text":"Yeah. What is the predictive power of it? You know, will it be able to tell you? You know, will it be able to predict your wife's reaction to a thing or your children's reaction to a thing, or, you know, your neighbors, your friends, you know, will you be a better person by the end of it? All of these sort of considerations that have just gone by the wayside. Like the very. I find it strange that the word virtue is so unfashionable because everyone demonstrates virtues all the time. Everyone respects virtues when they see them. And they revile vices and say by the same capacity. And you can't help yourself but to do it. And yet we're still not allowed to talk about virtue. You know, the question is never asked, you know, is it good or bad? Well, you know, but is it virtuous? You know, should you be doing it? Because it implies that there is a set of sort of overarching prescriptions that maybe you should be following even if, you know, in the immediate, there's no particular harm from having that extra cookie and that extra cookie after five years of eating extra cookies, you know, the harm, you know, you know, and so there is definitely advice and you know, you shouldn't be doing it. And we've, we've kind of moved away from the, I guess, autocratic deity telling you that's the case through the priest. Now it seems that people have been left in a position where they've kind of got to figure this out on their own. And that seems one of the things."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":1879.69,"end":1969.13,"speaker":"Jonathan Pageau","text":"Too, that is harder, I'd say, in terms of the religious question. A lot of people, what's hard, and I can probably see it in your vision, is that one of the things that religion does is that it appeals to every level of reality. It appeals to every type of person as well. And so because it is a vector of unity, it's the way in which we bind ourselves together, then it has to appeal to the illiterate, dumbest person in society. And so one of the things that people struggle to do is that if they encounter that the place where it deals with, let's say, the most illiterate person and they get turned off by that rather than understand that this aspect is actually necessary. And then there are higher levels that you can attain without necessarily having to care or to be involved in the more, let's say, superstitious or lower parts. Like, you know, if you go to church and it's annoying because you'll meet someone who's a super zealot and is a super, like is fundamentalist or is kind of has weird superstitious ideas. But it's like those people are part of the world. You're not going to get rid of them. So how do you deal with it? You have to deal with it. And if you disengage and you say, well, it's for them, but it's not for me, then who is going to be the elite of this thing that is going to help those people understand and live with it in the way that they can? Because there has to be an elite that has to be an intellectual elite that is giving the information. Or else it gets weird when it comes to the Bottom."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":1969.45,"end":2031.64,"speaker":"Carl Benjamin","text":"I always felt that this was really where the new atheists dropped the ball the most. And I didn't realize it at the time, but what the new atheists kind of were expressing was a kind of cognitive privilege. It's very easy for them to say, well, I'm 150 IQ, Sam Harris, and I've worked out that all of religion is nonsense. And let me explain to you my meditative secular meditations or whatever it does. But, you know, my cousin isn't 150 IQ and he's been in and out of jail. He needs moral guidance in his life. He's not religious. But, you know, I mean, it doesn't have to be religion. I got him to read Plato and Aristotle and he was like, I only read half of it. It changed my life, you know, and it's like, yes, it will. You know, it doesn't like this, this the thing. I think there's got to be a secular replacement for it because I think that unless you're inculcated into religion as a child with a genuine sort of spiritual belief in God, unless you're lucky enough to develop that, I think it's. I mean, I don't ever see myself having that."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":2031.64,"end":2035.08,"speaker":"Jonathan Pageau","text":"Right, so you don't see yourself what, you don't see yourself believing God?"}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":2035.24,"end":2193.53,"speaker":"Carl Benjamin","text":"No, no. Not having. Having like genuine religious beliefs or anything like that. I just, I. Whatever, whatever is in a person that they're feeling with that I just, just don't have. I understand, like the desire for it. I understand that, you know, the. I mean, I went to a mass in a Catholic church in Italy when I was visiting the ruins. Pompeii. Visiting the ruins of Pompeii. And in the city they've got this lovely church. Me and my wife went in just to, you know, see what it was like. And the sense of community was very, very evident. You know, there was something more going on here than merely singing Christian hymns or Catholic hymns. You know, there was something binding about it. You can see the appeal of the thing. I just, I really do think, though, we're kind of, at least in Britain, at the very least, we're kind of post Christian at this point. And I think you're going to find yourself very, very hard pressed to get people back into the churches. But I think that you could present a worldview that is secular, that still has a kind of meaning. I mean, I personally have been promoting Aristotle a lot just because he doesn't ever appeal to deities. And it's quite a holistic view of A human that he has, you know, he seems to have got all the pieces, you know, fairly in line, actually. First time, frankly. And I mean, I've been approaching the world with an Aristotelian view to, you know, try and be virtuous. And I've lost loads of weight. I'm a lot more healthy and fit than I am now. My kids are happy and I'm happy and, you know, I just feel better for at least being. Trying to do something. And moreover, I'm not. I don't. I mean, I personally have never felt that I've not had any sense of meaning. But my view of what the good life is has changed because I, in my 20s and, like, mid-30s, I was like, you know, the consumer. You know, I would just play video games, I'd eat junk food, I drink bottles of Coke, blah, blah, blah. And now I look back and think, wow, I'm annoyed that I was allowed to do that. I am annoyed that I essentially wasted 10, 15 years of my life just existing, you know, not building anything, not improving myself, not learning anything. Well, I didn't learn, but like, you know, not anything that I think maybe I should have learned in retrospect. And like, you know, I was into history, so I'm quite lucky, you know, I'd actually learned something of some relevance. But there are lots of people who aren't learning anything of any relevance and they're just sat in this sort of kuma mindset. And now I'm not in that. Now I'm in the sort of, like, let's. Right. No, you know, a man's job is to build things."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":2194.73,"end":2205.69,"speaker":"Jonathan Pageau","text":"So how, let's say, in your idea. And I. And I think you're right. I think that at least for your experience, I'm sure that it's true. The question is, what's the binding agent?"}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":2205.85,"end":2206.33,"speaker":"Carl Benjamin","text":"Yes."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":2206.57,"end":2241.52,"speaker":"Jonathan Pageau","text":"How did it stack up? Like. So Aristotle offers a way of being. What Christianity offered was taking Aristotle and Plato and Plotinus and the, let's say, Hellenistic thinkers and putting that in a story and a sacred space and a sacred timeline, which would. Which would bind people together in terms of identity, like I said, in terms of space. And then in terms of how they participate in time, it would qualify. Time, you would say, and I don't see how you're like, what, What. What would bind your community. Right."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":2241.52,"end":2297.27,"speaker":"Carl Benjamin","text":"Yeah, you're right. You're absolutely right. I can only be speaking from my own personal perspective, because that's Aristotle's perspective. That's where he's. He's that's where he's originating from. And that's probably why so many of the church fathers, the thought leaders of the Catholic Church just called him the philosopher. You know, he's, he's the guy you start with. I mean, you know, he's. It's a great start. But as you say, I'm never going to end up with that Catholic Church experience in Italy where you've got a community that is genuinely bound by some kind of glue at the moment. I've actually been doing a lot of research in sort of like English folklore and the sort of, the moral lessons from that, because I'm an Englishman, you know, it seems that a sort of national identity might be something that could be a binding agent there. You know, a bit of patriotism or something like that. But, but I mean, you are right, it would be easier if this was religion. But I think one of the things."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":2297.67,"end":2301.27,"speaker":"Jonathan Pageau","text":"We saw that, the nationalism, we saw it happen, that was the 20th century."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":2301.35,"end":2343.2,"speaker":"Carl Benjamin","text":"Yeah, I don't want to call it nationalism because I agree with George Orwell's definition on nationalism. And that's a power game, that's what you're aiming for there. But a patriotism, I think again, by Orwell's definition, it's a love of the place rather than a desire for power. And I think that's a more wholesome way of approaching it. And I think that a love of the place can also be a binding agent. So I'm hoping that I can discover something in there that might be useful. But it's all still, you know, I haven't smoothed it out yet. I'm not writing a manifesto yet or anything. You know, just trying to, trying to live a better life, to show people, look, it is possible. It's not even very hard. It's just like your decision making, you know, you just have to make the right decisions."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":2344.89,"end":2448.42,"speaker":"Jonathan Pageau","text":"I mean, I'm interested in exploring though, like, I'm interested in exploring like at this point, let's say, you know, you were, you were like a kind of new atheist type, you know, several years ago. And though at this point the notion that consciousness is part of reality, like let's say that way, right, that the human, the conscious perspective is part of how reality unfolds and you can't avoid it. Like it just. Categories are part of. Or else it's like a quantum field of possibility. But you need intelligence or pattern to kind of, to bring things together in terms of actual phenomena. And so once you kind of see that, you see that we can call it Intelligence, right. So intelligence is the manner in which the world reveals itself. To a certain extent, it participates in reality. And so the traditional view is that those intelligences, they don't stop at you and me. Intelligence is actually a part of reality. It's a pattern of reality. So those intelligences stack up. And so you'll say something like, there's an angel of London, right? And so London, because it has an identity, like, how can you define the city? Like, it's not like an apple. It's really hard to say what. Like it's a million billion phenomena and then. But nonetheless, we perceive unity in it. And that unity is real. It's not just subjective, it's a real unity. And so there's an angel of London, and that intelligence is the principality which manifests the unity of the city. And then that intelligence scales up and it continues to scale until you reach an infinite intelligence. And that infinite intelligence is the pattern of all patterns."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":2448.98,"end":2454.46,"speaker":"Carl Benjamin","text":"So I think that, again, I'm going to have to be one of those annoying secularists about this."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":2454.46,"end":2455.06,"speaker":"Jonathan Pageau","text":"Go for it."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":2455.06,"end":2522.22,"speaker":"Carl Benjamin","text":"I have to. I think that the best way I would describe that is I think you're talking to sort of the essence or the character of the thing. But I agree with you that there is something that you could describe as the angel of London, like the spirit of it, the spirit of the thing. There absolutely is. And this is, I think, a part of human cognition. The way we. Again, the sort of mythological thinking. We don't know all the details, but we know that when you go to X country, you're going to have a kind of experience there that you're not going to get in Y country. You know, these things. True. So, you know, the sort of character or the essence of the spirit, whatever we would call it. Spirit's not a secular word. But anyway, you know what I mean. I agree. But how are you going to protect your narrative from the deconstructionists? Because I'm actually fully on board with this kind of mythological heuristic. But the deconstructionist will come along and say, well, now you've got to prove it. So what do you say to that?"}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":2523.66,"end":2549.01,"speaker":"Jonathan Pageau","text":"So you have to ride the deconstruction thing until the end. You have to just ride it all the way to the end. Right? And you have to write it until you realize. The argument goes something like this. The argument goes something like, I talk about the reality, the essence of the cup. And then they say, yeah, but there's no essence of the cup. Like, what are you Talking about, right? It's just a bunch of stuff."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":2549.01,"end":2550.73,"speaker":"Carl Benjamin","text":"Show me the essence. Exactly."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":2550.73,"end":2569.81,"speaker":"Jonathan Pageau","text":"You can't find the essence. It's just a bunch of stuff, Right? And so then you ride that until the end. You say, yeah, you're right. And then they'll say, the cup is just a human category. And you'll say, all right, yeah. And so what is it? If it's not a human category, then it's just a bunch of stuff. And atom, just material."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":2569.81,"end":2570.61,"speaker":"Carl Benjamin","text":"Yeah, exactly."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":2570.61,"end":2573.41,"speaker":"Jonathan Pageau","text":"And so it doesn't matter. Doesn't matter."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":2573.49,"end":2575.09,"speaker":"Carl Benjamin","text":"And so now I don't even have a drink."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":2575.25,"end":2643.75,"speaker":"Jonathan Pageau","text":"You don't care. And so the idea is the things we care about, the cup, that's part of how it manifests its essence. We are, let's say. So Saint Maximus the Confessor, who is one of my favorite church fathers, he talks about how the human being is a laboratory for the essences of the world, and so the essences of reality, the human person acts as the gardener. So Adam in the Garden of Eden is a gardener. And the human categories, the categories of the world go through the consciousness of human beings and manifest their reality through our consciousness. But the thing is that that's not an illusion, or it's as real as anything is real. There's nothing else that you have access to. You only have access to that reality. There is no other reality you have access to. You can posit an imaginary reality where those categories don't exist, but you don't have access to it. And so that's real. And once that's real, then the higher categories are as real as that one. And then it continues to scale up. There's no way to. To me, it's like there's no way to avoid that."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":2644.38,"end":2701.5,"speaker":"Carl Benjamin","text":"You've really got to get to the very bedrock where nothing exists. And one thing I noticed is the deconstructionists will often make exemptions for other civilizations or other cultures, other peoples. They'll sit there and go, well, you have nothing. But they. Look at them. How does the shaman call the lightning and things like this? Well, that's a big question. But by the same standard that they would say, well, they're allowed, or full value is subjective. And let's just say that. That it is for the sake of argument. All values subjective, all beliefs are arbitrary or the product of an imperfect process. Then can I not just appeal to the very same method of validating that culture for my own and just say, well, this isn't. This isn't universal. This is not, you know, interchangeable this is actually something unique and particular and special and not shared by, you know, the tribe over there or whatever it is. And if you're going to validate them, then you have to validate me on that standard."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":2702.61,"end":2757.97,"speaker":"Jonathan Pageau","text":"That's been the surprise of postmodernism. Like the surprise of postmodernism has been to open up a space for us to revalue our culture. Because in saying. Because for a while it was like these European ideals, they're universal. And so now we judge all these other tribes and we see them as being no good and they're barbarians, whatever, whatever. And then we start to say, no, how can we say that? It's horrible, right? Like, those other cultures are just as good or good or they're okay and they're fine. And then we start to real. But we don't realize that we're still in that position where we're using European culture as a universal view. Then it starts to turn and say, well, what are these universal values that you think are supposedly there to judge everybody else? Bring that down. And then now we. Now all of a sudden, European culture, we can look at it and say, hey, that has value. Like, look at that. Look at that thing. Look at, look at this."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":2758.4,"end":2758.6,"speaker":"Carl Benjamin","text":"This."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":2758.6,"end":2785.21,"speaker":"Jonathan Pageau","text":"This whole culture that we had. We can see it now because they've told us we can't just stand in it invisibly. So we stand in it visibly and we consciously embrace our European tradition and the Christian history and, you know, the. Also the testimony of the ancients in terms of Greece, in terms of Rome, in terms of our connection with Mesopotamia, all of that. We're like, all right, then, then if all of. If it's all these tribes and everything that I can see because it's mine, so I can love it."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":2785.21,"end":2796.81,"speaker":"Carl Benjamin","text":"And I know if all value is subjective, then they have literally no grounds to say, you can't have it either. Because you can say, but it's just my choice. It's just my choice. And that's the ultimate defense."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":2798.89,"end":2823.18,"speaker":"Jonathan Pageau","text":"They end up actually, in doing that, they end up actually putting your position in the supreme powerful position. They end up actually inadvertently elevating the kind of rationalistic European point of view as being universal. They do it inevitably. And so it's like, I'm actually more a post modern than you are because I would just want to love my culture and love my tradition and participate in and be involved in it."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":2823.66,"end":2831.18,"speaker":"Carl Benjamin","text":"And as I said, from their point of view, they literally can't tell you you're wrong because it's just, well, it's my subjective judgment that's enough."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":2831.82,"end":2918.03,"speaker":"Jonathan Pageau","text":"But then the next step though is to still see, is to still be capable of seeing that the patterns are true, the pattern is true. Even though there's difference, let's say, between different cultures. The pattern, let's say of center and periphery, the pattern of hierarchy, of up and down. This is a universal thing, like it's everywhere. And in our culture we have a particular manifestation of that. And I would argue that in the story of Christianity, I think we have a very, very particular and I would say powerful vision of what that means ultimately. Because what we offer at the top of the hierarchy is self sacrifice, which is not there. They don't find that very much. You find little hints of it in other cultures. You have sacrifice others. But the idea that because sacrifice is a necessary part of reality, then the key that Christianity offers is the key is self sacrifice. So once the people at the top are there to love those at the bottom and those at the bottom submit to those at the top, because those at the top are there to care for them. Like that's the pattern that Christianity offers, which, which obviously doesn't derails all the time. Like it's an ideal pattern, it goes off the rails all the time. But it's something that we need to understand. Without that even the social justice woke culture can't hold because it's actually based in a weird perversion of that idea. You know, it's not a full one, it's. It's a kind of inverted, weird perverted one. But it needs Christianity for it to hold."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":2919.56,"end":2960.52,"speaker":"Carl Benjamin","text":"I think you're right about the self sacrifice. In fact, the Robinhood sales are in fact a great example of this Robinhood being a product of the failing of the system and the fact that the top is not considerate of the bottom and understanding of the proper place that they have, it's a very bold way of showing it, I think. No, no, I really think it is. I think it's excellent. You know, the, and the fact that it all rights itself when the, when the proper king returns, that's. I think it's a fantastic story and I think it's a fantastic moral in that. That's the thing, you know this."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":2960.52,"end":3053.43,"speaker":"Jonathan Pageau","text":"Yeah. And one of the, one of my main points has been that the modern world, let's say from the Enlightenment, has been a kind of weird deincarnation where in Christianity we offer demystifying things. We offer, like in Christianity we offer this idea that this, this vision of the hierarchy which is that you have, you do opposite something above in the hierarchy, which is, which is, has to be respected and, and let's say submitted to. But it's there to love and to care for that which is below. That which is below also has its function because without it, it's the body of the head, let's say, right, the body of Christ. And so what the modern world seems to be is like a weird deincarnation where the body now wants to have a revolution against the head and the hierarchical part wants to separate from the body and to just be this elite that doesn't actually care or that just presses down and pushes down on those that are below. And so people take one side or the other and they fight the other side. People who want absolute order, let's say the Nazis are the greatest example, want to cut off the margin, get rid of everything exceptional, anything that doesn't fit in the categories, we need to cut it off, burn it. And the others are saying no, the exceptions are the rule. Like all this, all the people at the bottom need to rise up and take what the king has illegitimately. And so it's a weird deformation of the Christian story. It's a weird, it's like an Antichrist. I guess that's how the Christian way of talking about it, where it's like these two extremes are happening and they're supposed to be together, like that's how they're supposed to go."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":3053.8,"end":3169.91,"speaker":"Carl Benjamin","text":"But I agree with you completely when you say this has real world effects. This manifests in the real world. And I mean it's everywhere. Like the traditional Christian Protestant culture of the English speaking world has produced the most enviable cultures in the world. The political cultures, as in everyone wants to live in an English speaking country. Everyone is desperate to get into an English speaking country because of the rule of law, property rights and limited government. These are the one thing that England really got right is good governance. And this has taken a long time. And it's because of, in my opinion, geographic convenience, the fact that we were an island and there weren't any major threats on this island. So we had the space to be able to suddenly order the world and get an understanding with the people at the top that look, we're not just here for your pleasure. We are actually people on our own rights. And then this, you know, you get this great agreement and when you remove all of this, the understanding that there is a hierarchy to the world, there will inevitably be a hierarchy to the world. Not just that there should be a hierarchy to the world when you get rid of all that. Look at what we have now. You know, we've got people who have, you know, delinquents who are depressed are intellectuals that hate our own countries. They hate the countries they were born and bred in, the kids in some communities, ridiculous amounts of crime and suffering that is caused by the breakdown of these traditional hierarchical structures. And so we can actually point to the effect of getting rid of this sort of pattern of life and say, this isn't good. You're not going to choose that for yourself. Who is going to choose to be some, you know, an inner city kid who's now in a gang and has to carry a knife around like it happens in London all the time because of the breakdown of the family. There's no father figures, et cetera, et cetera. Who's choosing that? You know, no one wants that. That's awful. It's a trap."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":3170.39,"end":3236.74,"speaker":"Jonathan Pageau","text":"And it's actually, we're actually in a good place. You know, this idea that, you know, you need to reach rock bottom before you can look up. Because 100 years ago or 150 years ago, the project, like the, this kind of enlightenment project was still like in the 19th century. This kind of rationalistic project was like. Because they didn't, they didn't have the. It was in the future still. They were saying, we're gonna do this, it's gonna be great. We're gonna have beautiful Star Trek type societies where everybody is just scientifically super advanced and also everybody cares for each other and also loves each other. And now we've come to the fruits of that way of thinking and now we can point to them and say, okay, so this is what you said 100 years ago. Are you, do you still think you can hold this discourse now that we see the consequence, you know, and you can know now we're. I would say that people want to. Exactly. And so we. If you want to advocate for a mythological point of view as being legitimate, now's the time. Because it's like, look at us. Like, I don't know my third neighbor. I don't know them. What happened. I don't live in this. Even live in the city, you know, I live in a suburb, but I don't know my third neighbor. Like, how is that possible?"}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":3237.14,"end":3292.49,"speaker":"Carl Benjamin","text":"It's crazy, isn't it? It's crazy. The atomization of people. I don't think, I think that it's been vastly understated just how social human beings are and how necessary. But this is why I've. I'VE gone straight back to Aristotle because he deliberately said includes, no, you need a social life. You are a man of the polis, you're political, you are familial. You have to incorporate all of this. So in a world where there's no obvious direction, that seems to be a good start, I've found. And especially as an atheist who just can't get to religion. I'm sorry, there's a part of me that would. That wishes I was religious because I've seen the comfort that religious people have taken from their faith, you know, and I can see that it helps them, it makes them feel better about bad things that happen in the world. But I just know that it's not for me."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":3292.73,"end":3366.94,"speaker":"Jonathan Pageau","text":"Yeah, well, I think maybe one of the things also that is that you might also have some idols. Like, you might have your perception of what God is. Like, you think God is this. And so you're like, I can't believe in this. Like, I can't believe in some guy in the sky who tells me what to do. It's like, that's your. Okay, so your aunt maybe believed that, who dropped out of school. But, you know, Thomas Aquinas never believed that. And the church fathers never believed that. And San Gregorio of Nisa and Saint Maximus the Confessor, they talked about the infinite, and they used ontological categories to talk about God, to talk about this idea of that which is beyond being and manifest itself in being. And these are the categories that the high theologians use. And so sometimes we also, we all, like I said, we have to always remember that there's an imagistic aspect of the story which is necessary and is important and has to reach all the way down to the most uneducated person. But that's something that maybe that's a work that can be done in each of us to break that down, to break down those idols that we've accepted. Like, we've been told that this is what God is, but that's. That's not what the great theologian thought God was."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":3367.34,"end":3398.26,"speaker":"Carl Benjamin","text":"So I totally agree with you that now is the time to start pushing a mythological understanding of what a person is, not just the world, but what a human being is. And a human being is a collection of stories. But the most difficult bit is going to, I think, be getting past the Marxists, the materialists, who say, well, you're just a science denier. You're making up things that have no bearing on reality and things like that. How are we going to address that?"}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":3398.98,"end":3588.85,"speaker":"Jonathan Pageau","text":"Well, one of the things that I've been doing is try to get down to the basics, like, really basics. And so I've made a video, for example, called the Inevitability of Ritual. And I tried to show people that if you look at the Catholic Mass, or you look at. I'm Orthodox myself, if you look at it at an Orthodox Mass, Orthodox liturgy, and you think it's stupid because there's all of these people processing and bowing in front of each other and, you know, lifting up books, and it's like, what is going on? Right? What is this, like, kind of nonsense thing that's going on? But what I like to try to point to people is that we engage in those types of acts all the time, every day, right? A handshake is no less a ritual act than a procession. And there are rules to how we engage with human beings. We. We face them. You don't talk to the back of the head of someone. And I tell people, if you want to know that you are constantly engaged in ritual, then try to do the opposite just once and see what happens. Try to pick your nose in front of the person you're talking to. Try to not let them speak at all, let's say, because there's a normal rhythm of speaking where it's like, there's a pressure when you're speaking at some point, there's a normal pressure to kind of stop and let the other person speak. And those rhythms are liturgical rhythms or ritual rhythms between people. And like I said, handshake, saying hello, it's nonstop. Our whole world is even not letting the toilet seat up. We have all these ritual behaviors that are just part of our everyday life. And so I've been tending to just point to the lowest ones, the ones that people can't avoid, and say. So if you say, like, shaking hands, you think that's real? Do you think that that's just a convention? Because if it's just a convention, are you going to get rid of it and then what are you going to replace it with? Because you need a way to greet someone, and shaking hands is actually a really good way to greet somebody. It has all the. It's. It has all the symbolism in it. You're reaching out with your hand. You're showing you don't have anything to hurt the other person. You're having a physical contact with that person. And it's not too close, not too far. It's like a nice distance where you. You're not like, going up to strangers and hugging them or something strange like that. And so it actually is manifesting ritually what you're doing, which is an encounter with a person. And then that scales up every single thing in a liturgy or in a Mass is like that. It's just that you don't have the capacity of seeing it. But all of those things are completely logical and are completely reasonable in the notion that in order for society to exist, you need patterns. And those scale up to something like a sacred space. Right. And so people who don't understand the church, for example, I tell them your house is made like a church. Your house has to be made like a church. You have a porch on the outside which is the northeast of the church, which is an in between space. And then you have like a place where you gather, your living room. Then you have a more intimate space around your table. And then you have your bedroom where you don't invite strangers into your bedroom and it's only you and your spouse to go into your bedroom. And that's the same structure as a church. You have the altar where it's just the priest. You have the place where it's all the people greeting. And then you have the narthex where it's more open and less holy of holies is."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":3588.85,"end":3709.42,"speaker":"Carl Benjamin","text":"And yeah, absolutely. And I think, I think I've been reading a philosopher called John Mackey, Australian liberal philosopher, and I really like his conception of institutions, institutions, which is essentially what you're describing as rituals. Institutions have a often influence formal set of rules that everyone understands. Like the game of chess is an institution. I don't even have to be able to speak another language. Like, you know, I could sit down with a Russian guy and bring out a chessboard and I know that he's going to move a pawn first. And if he doesn't, you know, I'll be able to point for that and he'll know why I've taken exception to him moving, you know, the queen or something, you know, without moving a pawn, whatever it is. You know, there's a set of rules that may be formal, maybe informal, but everyone understands and agrees to. And that's how we can join together in activities by these shared rules. So like you say, you know, the liturgical Mass might look silly where they've got the incense sensors and all this sort of stuff, but it's only silly if you don't accept that people are bound together by these rituals. It's only silly like that. And again, the thing that drives me crazy is the very same people say, well, that's silly. Will see, like Zulu warriors jumping up and down in the air and say, oh, isn't this a beautiful expression of a native culture? Well, so is this. Whatever we've been doing for the past thousand years is also our native culture that binds us all together. Come on, give us a break. And moreover, what do you want to replace it with? This sort of like, oh, well, we're universalist now. There's no such thing as, like, Western culture now. We're all universal. It's like, okay, but I don't want to be, you know, I actually want to be a particular thing that I can take pride in and I can work towards. If I do the rituals, then I build the thing. Because a thing is defined by what it is as much as what it's not. And so, you know, if I can't put those building blocks down, then I can't build on top of them. And we never have the great church. I suppose you could describe it as that we're building in our own lives."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":3710.7,"end":3739.35,"speaker":"Jonathan Pageau","text":"If you don't have any identity at all and you just have a weird universal mush, then you become potential for another identity. And it's really like. It's a. This is the idea. It's almost in evolutionary terms. It's like if you are too generalist in terms of your evolutionary practice, then. Then a specialist is going to come in like a knife and is going to slice your thing up and you're going to take it from you. And that's just how it just. That's just a pattern of reality. It's not a. It's not a. It's not something I want or not want. It's just. That's just how it works."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":3739.59,"end":3773.29,"speaker":"Carl Benjamin","text":"Well, any. Anyone with a strong normative view of the world that can just reject, you know, our universalist enlightenment view that we've been reduced to will look appealing as well. They'll look strong. I can build something. I can bring people together. You know, you will salaam five times a day to Allah or whatever it is, you know, whatever. Whatever alien identity has arrived, it'll be attractive because what's the alternative? We're offering you sludge. We're offering you no progress. We're offering you nothing. You know, any. Anyone else will come in boldly and view this as ripe for the taking."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":3774.21,"end":3824.49,"speaker":"Jonathan Pageau","text":"And the thing about. You mentioned Marxist materialist before. Marxist materialists are actually extremely religious. Yes, their storytelling is very religious. The only difference is that it's upside down. I was talking about this recently. I did a video on monsters where I was Showing how Karl Marx talks about these like kind of Earth monsters, right? The Pucks and the Robin Goodfellows and all these kind of earth monsters. And he sees them as like agents in his revolution. He's like, he understands that the ghouls and the demons and these kind of monsters of the edge, they're actually images of what he wants to accomplish and bringing those and having those take over the world. Karl Marx was a very, very mythological writer completely. It's just that it was a satanic, like a satanic vision. It was an upside down vision and."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":3824.49,"end":3911.62,"speaker":"Carl Benjamin","text":"It was totally false. I mean, just the very nature of all of human history being the story of class conflict, that's a mythos right there. And it's not a true one either, which is really interesting. It's not like that, you know, and then you get the sort of like almost. Well, not even almost the religious veneration of Lenin and the way that Lenin developed the sort of first sort of Marxist cult of personality that Lenin could do no wrong. He became. And he, I mean, Lenin himself hated this cult of personality. This was not. I've just finished a biography on him, actually, which says, good timing, actually. But, you know, he hated this cult of personality, but he couldn't escape it because it's everywhere. It's just part of human nature. And one of the things that I've noticed, again, I've been reading a lot about 20th century dictators in the last month or two, and every single one of them, you get the same pattern in Lenin or Stalin or Mao, and then you can match this same pattern back through the centuries. You know, you go, you know, right back to like the Persian Empire where there's this common view where, okay, we're all suffering now, but if only Stalin knew, if only Mao knew, if only Lenin knew, if only the king of kings knew, he would come and help us with our suffering. This assumption that the guy at the top is looking out for you is a very natural thing for the people at the bottom. And it's really sad in the case of the 20th century communist dictators, because they did not care about you at all. They had no thought to you at all."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":3912.01,"end":3986.78,"speaker":"Jonathan Pageau","text":"And it was really a failure of hierarchy because hierarchy is layered. The idea that, because we have this idea that we were talking about how negative people view hierarchy. We had this idea that hierarchy is like this horrible dictator at the top and then everybody at the bottom. But that's a modern vision. The idea of a leader above and everybody else below. That's a total modern Vision. A normal hierarchy has levels of management at all these different levels. And so let's say in a normal world, even if there's a king, the king can't do without his aristocracy and his aristocracy can't do without their, like knights that they've, that they. That are vassals to them and those knights can't do without the peasants that are, that are subject to them. And so the king has to be careful. He's always playing a line where if he alienates his aristocracy too much, they'll kill him. They'll just kill him. Or they'll, or they'll, or they'll, they'll start to fight, you know, with him or they'll fight amongst themselves or whatever. So hierarchy actually is always both separation and the means of unity. And that's what people struggle. So sometimes it can be. It can become more a means of separation, but then there usually tends to be. If you do that too much, it's normally going to come back where it's going to then start to act as a unifying principle because. Or else it's going to shatter."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":3987.5,"end":4033.68,"speaker":"Carl Benjamin","text":"I really like. It's also like a method of definition as well. You know, it defines things into existence that give people meaning and inclusion. But I find the way that you put that the aristocrats will kill them. That's exactly true. I mean, that's what happened in the English Civil War. And people now find it strange that we would want that we. That, you know, the English of the time would bring in Charles's son, Charles ii, to be king again. You know, that seems strange. Well, you've just had a revolution. You've just got rid of the king. Why are you installing a new king? It's like, well, there should be a king. That's why, you know, that's what they thought, you know, in the 17th century. You know, the idea that you could, you know, go without the king, that's very alien idea. That's a very modern idea, you know, that just wouldn't apply back then."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":4034.88,"end":4113.09,"speaker":"Jonathan Pageau","text":"And also the king, like the king acted as a transnational person. Like that's also the emperor, like the idea of the Byzantine emperor, for example, he acted as a transnational figure because it's difficult to have different nations or different tribes or different groups be together. And it's difficult when it's just like one tribe that say, that is. That always has leaders. But in the notion of the Byzantine emperor, for example, the Byzantine emperor was sometimes Armenian, sometimes Greek, would have, you know, different people could access. It was Messy and violent. And obviously there was a lot of backstabbing happening. But once the emperor was there, then he acted, like I said, as someone who was beyond the different national identities and everybody could kind of identify with. And I feel like that, let's say the royalty in England, in the uk, has played that role to a certain extent, where it's like, okay, you know, the Scots and the Irish, like, we all disagree, but we still like the monarchy because the monarchy is actually none of us. It's actually a mix of all of us. It's like a joining of all these different identities because they all have these bloodlines that are. That have kind of joined together. And so they're not one or the other. They're like these. Something above the national identities. And so we can pledge allegiance to them. Still kind of not like each other, but it's still acting as a binding agent for all of us at the same time."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":4113.25,"end":4127.65,"speaker":"Carl Benjamin","text":"Yeah, it gives us a sort of unifying moral groundwork to stay on, you know, but. Right. Jonathan, this has been an amazing conversation. I've really enjoyed it. Yeah, I'd really like to do this again sometime, if that's all right."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":4127.97,"end":4128.81,"speaker":"Jonathan Pageau","text":"Yeah, anytime."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":4128.81,"end":4161.57,"speaker":"Carl Benjamin","text":"No, fantastic. Because I'm still like, developing this sort of, like, secular view of the mythological, because, like you say, it's a part of reality, it's a part of the human condition. There's no questioning. It's got to be established. And this is the thing I think the Enlightenment was wrong about. Humans are not. They can't purely be rational. They can't pretend like they have a universal understanding of the world and everything around them. It's, you know, we've got to accept our limitations as people. But anyway, thank you again so much for joining me. Really appreciate it."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":4161.57,"end":4175.49,"speaker":"Jonathan Pageau","text":"So if you. If you want, like, you can check. I did quite a few videos on my channel that talk about this particular video called Secular Sacred Art in secular terms, you know, and talking about trying to help secular people understand it. So if you have time, check it out and thanks."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":4175.81,"end":4177.81,"speaker":"Carl Benjamin","text":"Where can people find your channel? Is it just under your name?"}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":4177.81,"end":4180.45,"speaker":"Jonathan Pageau","text":"Just Jonathan Pageau on YouTube. You'll find my channel."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":4180.77,"end":4182.14,"speaker":"Carl Benjamin","text":"Great. Thank you very much."}
{"episode_id":"SW - #132 - 2020-12-28 - Sargon of Akkad - New Atheist Failure","start":4182.3,"end":4249.03,"speaker":"Jonathan Pageau","text":"All right, I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward, and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
