{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":0.48,"end":101.9,"speaker":"Jonathan Pageau","text":"So hello everybody. I am sitting here with Ben Hatke. Ben is a best selling author artist. He is mostly known for his series Zita the Space Girl and also Mighty Jack. I was introduced to his work by Andrew Gould, whose opinion is always unfailing to me. Whatever he suggests to me, I immediately look at it. And I found in his stories with my kids as well. Just a wonderful boisterous storytelling, deep understanding of storytelling and of. And of myth and a fairy tale, but also connection to science fiction, just very well rounded storytelling. So if you have kids, even as adults, I enjoyed them reading them as adults myself. And so I'm really happy to be able to talk to him. He has a new book coming out next month called Julia's House Goes Home, which is a third part of a series of picture books. So you can also check that out and make sure to get that as the month's coming along. So I'm looking forward to this conversation. This is Jonathan Peugeot. Welcome to the symbolic world. So, Ben, thanks for, thanks for agreeing to talk to me. I was a little surprised that you agreed because, you know, you're kind of a big shot, I guess, in the, in the art world. But I was really. And I found out that your wife, at least you and your wife have watched from my videos. And that wife kind of follows me. So that was a very interesting connection for me."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":102.06,"end":110.84,"speaker":"Ben Hatke","text":"Yes, you were a big shot in our household, apparently. Well, I'm saying apparently. No, but I mean, like, I've often walked into the kitchen and been like, oh, it's Jonathan, but Joe's voice again."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":111.16,"end":124.6,"speaker":"Jonathan Pageau","text":"Yeah, it's funny how these things work. Cause it's the same. When I got the Zita and Mighty Jack books, then my kids just loved them, like devoured them. And then the same thing, when I told them that I was gonna talk to you, they were like, oh, my dad's a big shot because he gets to talk."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":126.44,"end":127.32,"speaker":"Ben Hatke","text":"Comic books."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":127.32,"end":136.12,"speaker":"Jonathan Pageau","text":"Yeah, it's just funny how it works. And so, I mean, tell us a little bit about yourself, how you kind of fell into this world and then we'll just jump in."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":137.89,"end":148.37,"speaker":"Ben Hatke","text":"You know, I was thinking about. Well, not that I'm thinking about this all the time, but I was actually thinking about it yesterday because I was making a. My dad has a YouTube account now."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":148.53,"end":148.93,"speaker":"Jonathan Pageau","text":"Really?"}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":149.33,"end":298.55,"speaker":"Ben Hatke","text":"Yes. He is an architect and he just. And he's an architect that. Oh boy, if he listens to this. He's tried to retire a few times, but it never sticks. Right. He's always doing. He's always doing stuff and he's started a little YouTube account, the Frog Pond School of Design, which has its own backstory, but it's interesting architectural tidbits. All the videos are like three minutes. And be like, what is an Inglenook? How do we control sway in very tall buildings? Right? Just really like stuff like that. And then stories from the Renaissance. But I've been trying to promote these. Cause I really like him doing these videos. And I was thinking, like. And I was writing a little bit about it, and I was like. And my dad, being an architect, is the first person who. Because I deal in story storytelling, but I think a lot about words and pictures and how they dance or work together or move together, tell stories. And so, like, you know, my own legend that I tell myself about this is. Was with my mom, who would always bring me the library because she would always. She had a big cloth bag that she would always fill up the week's reading. Had a lot of stories read to me as a child. A lot of Roald Dahl, a lot of the Narnia Chronicles. But the BFG was huge in our house. And I'm now reading it to my daughter. But my dad always. When I would ask him a question, he was always much more inclined to pull. He had always would have pens and note cards in the breast pocket of his shirt, and he would always, like, pull one out. He was more comfortable explaining something through drawings. As comfortable as with word. And so that I feel like in my deep, deep recesses of my brain, that's where I realized, like. Like, drawing is not only something that you do for fun, but it's like this incredibly powerful form of communication. And then, you know, obviously, like so many of us, I would read the Sunday funnies in the morning or like, no, the comic strips every morning. Right. Like. And, you know, Garfield moved to Calvin and Hobbes, which was. Which was brilliant. Calvin and Hobbes moved to a lot of the Marvel stuff. I found Spider man comics, got really into that. But another big one was ElfQuest by Wendy and Richard Pini. And I had the great memories of writing my bike up to the used bookstore when I was like 10, 11, 12, and looking through the stacks, trying to find. Cause I didn't have the collections. I would have to find."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":298.55,"end":300.47,"speaker":"Jonathan Pageau","text":"Oh, you'd have to find the actual comics back then."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":300.47,"end":315.81,"speaker":"Ben Hatke","text":"I found the Marvel reprints. And like. So there were always gaps in my knowledge of what that part of the story. And so also. And it was the first thing that really showed me, like, long form. That was my first experience with like long form storytelling in comics."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":317.33,"end":317.81,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":317.97,"end":350.05,"speaker":"Ben Hatke","text":"So, you know, comics ended up always being something that I could. I don't know, as you grow up, you get positive reinforcement with certain things. Whenever I made comics, people enjoyed them, so I made more comics. And like, even in college, like, one thing I did quite a bit was I would always tape a sheet of 11 by 17 paper up in our bathroom and like our shared dorm bathroom. And I had this ridiculous comic that I would just keep adding to. And that's positive reinforcement too, because I would hear people laughing from the bathroom."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":350.05,"end":350.65,"speaker":"Jonathan Pageau","text":"Yeah, yeah."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":350.65,"end":423.53,"speaker":"Ben Hatke","text":"Yes. Now I'm going to put more into this comic in our bathroom. Like other people would come use it just kind of for that. Yeah. And then. Yeah. And so. Yeah. So there's like the sort and sort of like, I'm thinking a lot about influence and stuff and there's definitely just a thread of story that runs through, I don't know, runs through my life. Even though I didn't, like, I didn't do art school, I studied history. But then, you know, when I was doing freelance art and design after I was married and just starting out, I was doing just a lot of like design work, like Photoshop work and illustrations for textbooks, things like that. And then got to this point where I wasn't getting any better. But at that point I had met a group of artists online, the Flight guys. So I kind of got my break. There was an anthology called Flight, where a bunch of artists of different. We all seem to have like a similar. We all grown up loving the studio Ghibli movies and we all kind of had a similar sensibility. And at that point there wasn't much in the way of middle grade comics, like young people's comics. This was. And so this is like all these guys are. There's Kazu Kidoishi who went on to do the Amulet series, like Reina who does Smile and all these things."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":423.61,"end":424.33,"speaker":"Jonathan Pageau","text":"Oh, okay."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":424.8,"end":541,"speaker":"Ben Hatke","text":"So the whole kind of movement came out of these message board that Kazu started and this anthology of comics that we all put short stories into simultaneously. Around that time, we spent a year in Italy in my wife's grandmother's house, which is like she had passed away, but we kind of were restoring that house in the mountains. And so I spent some time during that time in Florence. So the other side of that coin is I was spending a lot of time learning to paint like, like portrait and figure painting. Sort of a school that was, you know, connected to the lineage of John Singer Sargent and stuff. Like this. So, yeah, there's. Those are the kind of the two sides of that coin. And then in comics, just to round out kind of a story that I've let go in comics, you know, the manga comics kind of were coming in and becoming very popular. And Jeff Smith's Bone I don't know if you're familiar with. Yeah, yeah, yeah, yeah. Okay. Bonus was getting big, too. But it was over. Like, it had ended. And Scholastic picked it up, and there just wasn't a lot else. And there were, like, mostly comics were still like, superhero comics, and they have their own distributor, like the diamond distributor. But mainstream book publishers were, like, seeing the Scholastic get the money from Bone and the manga stuff coming over, and they're like, wow, there's. There's money in these comics. And we just thought, like, all the flight people happened to be in that. In the right space to sign up these books, really. On a song. Like, what had I done? I had done a few short stories. I had done Zeta the Space Girl as a webcomic, but, like, not a reliably updating webcomic. Like, there wasn't a ton. But they signed me up for a book because they wanted books. And. Yeah. And from there, I just. I was able to keep doing it and. Yeah. So now I'm making comics and picture books and prose stories and other stuff."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":541,"end":642.26,"speaker":"Jonathan Pageau","text":"Yeah. Well, it's interesting because hearing you mention your influences and just the kind of zeitgeist around what you were doing, all of a sudden, it just makes so much sense, you know, in terms of Bone and all this imagery. Like, even when you talk about Miyazaki, I mean, I realize how. Then all of a sudden it hit me that Zeta is really the kind of feminine character that you find in a Miyazaki movie. This kind of just boisterous, joyful someone who influences others too, like, who has this kind of magnetism that is able to. To kind of attract others to. To her cause, you know, and she. Anyway, so. So it makes a lot of sense. I really. It really. And ElfQuest as well, in this kind of long form. There's something about your work, really, when you. Even when you talk about your father and this architecture side to it. I really feel that even in the page compositions, you really have a sense of flow in terms of storytelling, but also in terms of general composition for the pages. You can see that the pages are composed as standalone images. You could almost think of them that way, which is something that not a lot of comic artists are able to pull off very well. The architectural element is there. It's present in the sense that even the comic pages, the way that you compose them, there's a sense of unity in the page itself. And so there's this flow of movement because a lot of them, like I was looking at them, I was reading again the Mighty Jack series yesterday, there's a flow of movement, constant movement. And especially in the Jack story where it's just this, it's almost like a chase story. Right. It just kind of moves the whole time. But then this ends up being composed within the pages and you feel this flow of the story in the, in the composition of the, the panel, but also the pages themselves. So that's a, it's. It bring. Makes it very compelling to read."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":642.76,"end":669.16,"speaker":"Ben Hatke","text":"Oh, I'm glad you find that because like I put. That's something I think about a lot. Composition is just like, is something. It grabs the hold of that geeky fine tuning part of your brain where you're like, I can do this right? I can do this better. And I think a lot about the, in the flow. I think a lot about the flow of an eye through the page. Like you say. I think a lot about the top left hand panel. I design my pages as spreads."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":669.57,"end":669.89,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":669.97,"end":829.63,"speaker":"Ben Hatke","text":"I don't do individual pages. When I do my thumbnails, I'm looking at an open page every time. And I think a lot about the top left hand panel. Whatever's going on at the top left and whatever's going on at the bottom right. And then wiggle you across the whole spread that way. And also just keeping like it's interesting to me. I don't know if it's interesting. Like, I really do. Like there's so much you can do with composition and there's so much you can do that can make it even more as with prose, you can have difficult to access prose, which is also very rich. Right. Or you can have like. I always admire authors like Neil Gaiman and C.S. lewis and stuff like that who write richly but with simple, accessible prose. The Hobbit is an example. The difference between the Hobbit and. Oh gosh, what's another example? I like the Ryan Jacques Redwall books, but I found them really difficult to read aloud. But then like the Hobbit, like, even when I'm tired, if, if I got. If I'm going to read a lot of chapter of the Hobbit, I'm like, yeah, I'm in. It's fine. I can. It kind of. It flows, it's beautiful. But it's, it's got. It's not overly complicated. Yeah, that's what I think. I want my comics to be accessible to non comics readers. Right. I've noticed, like, and this is a real aside, but it kind of ties in. I'm very excited for the. Marvel is doing a short series of Hawkeye for Disney, and they seem to be using a lot of the Matt Fraction David Aja series run on Hawkeye to influence this show, which is one of my favorite superhero comics of all. And because it is minimalist in its drawings, but, like, super rich and interesting in what it's doing with composition. And there's one specific one where the dog solves a murder mystery. And you're getting everything from the dog's perspective. And so it's all symbols of what he's smelling. And it's very close to black and white. Like, it's. The color palette's way down. When people are talking, it's all scribbled out except for words that the dog would pick up on. Go, yes, Clint, whatever it is. And it's a miracle that it's legible. It's a miracle that you can read it. It's also kind of like it's hard to read. I think it's not beginning comics readers reading, but it's so interesting. And I read that when I was like, oh, wow, I didn't know you could do that. It's pretty brilliant."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":831.55,"end":887.88,"speaker":"Jonathan Pageau","text":"Yeah. There's something about when I think about your pieces, too. I mean, when I think about bone, it just makes a lot of sense. There's a sparsity of words and a lot of emphasis on character. Making the drawings also not kind of like the Marvel chiseled type of drawing makes the characters more accessible immediately because you're able to tap into caricature and to just having the shape of the character be related to their personality. So you don't have to explain it a lot. You just see them and then they catch you, and then they can enter into the action right away without having to give backstory or to talk about or try to show their motivations. You almost get it from the drawing itself. So it creates this varsity that you're able to keep the action moving the whole time with very few words. Not a few, but, like, very sparse words. But you follow the story completely."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":888.28,"end":969.63,"speaker":"Ben Hatke","text":"Like, how much story can I tell before I get to the words? Because one of the, you know, like the other. Other concept I think about a lot is, you know, art is. Is usually defined by its. Its limitations. Right. And wonder is When. When you create something within those limitations that seems impossible. So when. That's why we're. That's why we get obsessive about the soft drapery and flesh in marble sculptures. Right? It's. It's. It's crystal, it's marble, but. But somehow they're pulling softness out of the hardness. And that's why. That's why everybody geeked out about perspective when they finally cracked perspective in Renaissance painting, like, because, like, it's like, now we've got. It's a flat thing, but it's got depth. Oh, my gosh. You know, like, that's magic there. And with comics, it's, like, one of the challenges is that, you know, you've got a page and you're pressed for space, and the words will crowd very, very easily. Right. Crowd out what? And so the words and the images have to be working together. And one of the ways I. One of the things I think about a lot is gesture, like. Like the way we read each other's gestures and body language. Right. Body language. How much. How much can I tell you about what's going on with the character? They don't have to say, I'm angry. If they say that, then I'm not doing my job."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":969.63,"end":1040.21,"speaker":"Jonathan Pageau","text":"You're not making a comic. Right. Well, at least it's reduced from what it could be. One of the things that really impressed me that I enjoyed seeing in both stories, both the Zita and the Jack stories, is the manner in which you play with the relationship between adventure and risk or danger and possibility. In the Mighty Jack story, one of the main trope is that they grow this garden, and this garden is like an alien garden, and it is murderous. Like, it's super dangerous, and it could kill them. But then out of this kind of murderous, dangerous, wild garden, they're able to gather power. Let's say they're able to kind of get both power and then, let's say, test themselves in a way that refines their character. And so, I mean, I think it's important to understand that. To me, it's something that I found very beautiful, at least for a kid's story, especially in a world where kids are just inside all the time. This is our world. We have a world of safety, let's say, where people are obsessed with safety. But you seem to explore this danger as also possibility for development, let's say. I don't know if you want to talk about that a little bit. Yeah."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":1042.45,"end":1097.55,"speaker":"Ben Hatke","text":"And also, it's like expanding their world. The garden ends up being A gateway to another world. And, and it's just making these kids world larger. And yeah, I mean that was, that was the kind of the crux of that book. And especially also Jack's also essentially a caretaker. Right. So like, he's also got this question of like, it's not just me. Maybe he, on his own as a 14 year old kid would be like, sure, let's, let's, let's go crazy. It's just me on the line. Right. But he's got Maddie to look after. And so to me, that was an interesting question. Like, where does your responsibility, like that fuzzy space between responsibility and I don't know, engagement with the world. Right. And it is a good question. I think it's a good question for all times. Yeah."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":1097.55,"end":1140.29,"speaker":"Jonathan Pageau","text":"Because even with his sister Maddie, who, for people who don't know, is autistic, it kind of needs to be. She needs to be watched and she needs to be taken care of. You know, the garden, this dangerous space even for her, ends up also being the place where she increases her. She has a moment where she speaks because of this garden. Like she has these little moments where she seems to kind of increase herself and even discover this kind of secret power, secret language that she has, you know, to talk with the dragon. There are all these little moments with Maddie where you see her kind of become more, as you said, even though she's someone who's fragile and is maybe more in danger. Jack letting her go into this dangerous world is also what makes her more, more as a person."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":1140.77,"end":1142.13,"speaker":"Ben Hatke","text":"And I don't think there's an answer."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":1142.37,"end":1160.89,"speaker":"Jonathan Pageau","text":"Yeah, exactly. Where the balance is and the book you have, you really do. It's wonderful because you play with that. Because the garden at some point does become so dangerous that it could basically seems like it could just destroy everything. So Jack has to like burn it down. But then there's also a sadness which is that, okay, now this possibility that we had given ourselves and Lily is."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":1160.89,"end":1162.41,"speaker":"Ben Hatke","text":"Furious with him for burning it down."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":1162.41,"end":1167.77,"speaker":"Jonathan Pageau","text":"Exactly. Even though it's obviously murderous, when you see it like this, this monster come out of the ground, like, okay, this."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":1167.77,"end":1196.88,"speaker":"Ben Hatke","text":"Is also, it's also obvious that it's like, it's a magical thing that is beyond like anything that they'll ever come across probably in their lives again. So it's also like they're both, they're both right. They're both, I don't know, at least they're both acting, they're both answering that question and neither of them completely wrong, I guess. I don't know. Although Lily's like. Lily is a little bit sneaky. Like, she has been stealing seeds from the garden and growing her own in her basement, which is funny to me."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":1197.04,"end":1288.99,"speaker":"Jonathan Pageau","text":"Yeah, exactly. But so there's all of that in the story because there's this play also. This is something that I explore a lot in my channel, where you have these kind of dangerous monsters, but then some of the monsters are, you could say, on our side, and then some of the monsters are on the other side. And so there's this interplay, for example, with the image of the dragon, who is obviously extremely dangerous, but then also ends up being an ally against the giants. And the same with the goblins, where the goblins are obviously very dangerous and the Goblin King is a very scary character, but then they're able to kind of turn the goblins around and they become, like, a tool to stop the giants from. The giants from taking over. And then these demons, whatever. Like, it just increases. Right. It's like these. You have these. I often talk about layers of monsters in the world where you have your monsters and then scary monsters and then cosmic monsters that are further up. And you need to kind of be attentive to the monsters that are on your side because sometimes they're annoying and they can be a little dangerous, but if you just get rid of them, you're basically removing a veil. And then the bigger monsters are coming for you. And it's hard to. It's hard for people to think that way because we tend to. How can I say this? Like, it's easy to. It's easy to see how people that are sometimes on the margin, on. On, in many ways are annoying, you know? And so we want to kind of cut them off, but we don't realize that there. There's more. There's more on the other side. Like, there's bigger. Bigger things and stranger things, let's say."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":1288.99,"end":1296.87,"speaker":"Ben Hatke","text":"Yeah. And I like that. I like to play with the idea that just because something looks monstrous doesn't make it a monster. Right. Like, it doesn't make it evil."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":1296.87,"end":1336.99,"speaker":"Jonathan Pageau","text":"Doesn't make it evil. Yeah. Yeah. For me, monsters are never evil. Like. Well, not never. I mean, they're not. The idea of a monster is just something wild or something undefined or something that is beyond your understanding in the way you mentioned it. And so it's not necessarily like the cherub, for me in scripture is a monster, like the cherub that guards the Ark of the Covenant, you know, and we have the Saint. Saint Christopher, who's this dog headed Saint who's like, obviously a monster. So we have these like holy monsters. And then gargoyles are a good example of kind of monsters on our side are holy monsters that are not evil. They're just monsters. You know, they're there to stop the. They're there to stop evil things that are bigger. Monsters that would want to invade, let's say space."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":1337.39,"end":1355.08,"speaker":"Ben Hatke","text":"Yeah, no, I do. I like. I like my saints wild. That's cool. I did a. If you poke around. I forget where I posted it, but if you poke around, I did a St. Nicholas once. Cause he's archers, sailors, thieves and prostitutes. Right?"}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":1355.08,"end":1355.56,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":1355.8,"end":1368.04,"speaker":"Ben Hatke","text":"And I'm like, oh, that's a. That's a. That's a great combination. Like, who is this guy? Who would this guy be if. If I was making the character right? Like. And I gave him like a wizard staff and a huge sword and big old coat."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":1368.12,"end":1398.43,"speaker":"Jonathan Pageau","text":"Yeah. Well, there's this. The image of. You see this image of St. Nicholas, right. That slaps. Arius is one of the favorite memes to come out during Christmas time. You have a sense that St. Nicholas is something of a. He's something of a defender. Yeah. That's why he defends kids and he defends the marginal, let's say. Yeah. And so tell us a little bit about what the inspiration is behind some of your stories. Because obviously you have this interesting mix of fairy tale kind of myth making with science fiction. It all kind of comes together in a very seamless way."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":1398.75,"end":1508.4,"speaker":"Ben Hatke","text":"Yeah, that's the soup. Right. The thing about that a lot, because the story I'm working on now is an underworld story. And it's a little bit structurally. I had a big meeting about it and like everybody wanted kind of latched on to this element where it's structurally like they were like, this isn't the kind of story where you examine the plot or the structure very closely because it's very Alice in Wonderland. It's very dream. Like, it's not like a three act structure kind of story. But visually, like I'm like doubling. It's visually going to be pretty dense. And like in that way I was like doubling down on what. Where does all this come from? And like, visually it's truly the furniture of my brain. And a lot of these things, he's kind of actually. This kid is traveling down into this underworld and he actually ends up traveling back kind of through art history, in a way through human history, but kind of through art. So. So anyway, it was on my mind, like where some of this stuff comes from. Or what kind of furniture is in my brain. And it's. It's like in storytelling, I like to keep a lot of things kind of subconscious. And then once you get the story down, you're like, oh, that's where that comes from. So a lot of it's just like. But I think part of the job of the storyteller is always is living right. You can't just hole up and make stories. You have to live and experience and take in and take in, and you're kind of a conduit, always taking in and then kind of weeding out and seeing what sticks in your own mind and then kind of digesting all of that and then telling your story with the voice that only you have. But, like, a lot of what informs your voice is the things that have stuck, that have managed to stick in there and hold dear."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":1508.4,"end":1606.49,"speaker":"Jonathan Pageau","text":"Yeah. One of the things I tried to explain is that storytelling, let's say the patterns of storytelling just come from attention. You can understand the ancient myths or the myths that have come down to us, or the Bible stories or these ancient stories. The reason why we have them is because they grab people's attention. And then as they were transmitted, that attention was maintained. That is that there's a capacity to pay attention. And so you can imagine how stories refine themselves with attention. That is, those stories that are able to keep our attention will survive the generations, and those that aren't will just kind of fade away. And then even the stories themselves will end up being refined because as they kind of progress in time, some things become idiosyncrasies and you have to modify them so that the story can be remembered. So you end up having these really pure stories with time that just kind of happen on their own almost through a process of natural selection, you could call it, but that you also have that in yourself, which is that the things that you remember, there's a reason why you remember them. They're not just for sentimental reasons. There's. There's something about them which we're able to grab and keep your attention. And so. And in that laboratory, in your brain or in your. In your experience, you know, to gather that together and to bring out stories without doing it too deliberately, you know. And so let's say the hero's like. The hero's journey comes out without having to plan it. Like where people say, oh, how does this fit with the hero's journey? Let's say. But if you're an intuitive storyteller, then that pattern will just appear almost out of it just makes sense because it's just the things that made you care about stories in the first place."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":1607.05,"end":1668.26,"speaker":"Ben Hatke","text":"Yeah. Yeah. So there are a couple of threads, I guess, to that, and I'm not trying to decide which one to go with first. One of the things, the hero's journey stuff is interesting, but. But just evolution of story is to go to the earlier point. Evolution of story is something. Because stories. Stories live and they are passed down. And there's an interesting way that they evolve through time based on. Because stories gain power as they're retold, but they also gain, like, they're also plastic. Right. They're shaped and they move as they're retold. And one of the things I take issue with when I sometimes I hear, like, you know, like, you know, like, corporations are owning, like, the stories now, but it's not entirely true because there's so much cosplay and fanfic and freedom of people taking these stories and making them their own."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":1668.26,"end":1668.62,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":1669.1,"end":1771.35,"speaker":"Ben Hatke","text":"Like, I'm doing my version of Captain America. And like, one of my favorite. One of my favorite fan fiction comics that I've run across is. And it's gone now because the person stopped making it. And then it got old enough that it's now on the Wayback Machine. I think you can still find it. But it was called Steve Rogers, American Captain. And it was his. It was the. So because in the. In the early comics, he is an art student before he gets the super soldier serum. And so. And even they kind of referenced that. There are a couple scenes in the Marvel movies where he's sketching. And so they kind of call back to that. But there's this one where there's this comic, and it's like a journal comic. It's like a diary comic. And it's. Steve Rogers is woken up in the modern age. He thought he was going to die in that plane crash. He was like, this is my death. And so it picks him up and it's like, okay, he's this powerful guy, but he also got PTSD from war, and he's also catching up on art. So he's like, I'm gonna make a journal comic about my experiences. And it's just the most touc thing where somebody latched onto this character and humanized him so much, like, as a person. And there's a. There's one thread where he goes to a gallery show with Pepper Potts and they sit outside, talk. It's very human. It's like, there's no battles or anything. In it, they just sit outside talking about their lives. And at one point, he gets. He gets kind of worked up about something, and she's like, that's really scary because. And you realize he's realizing in his mind he's still. There's part of his mind that's still £95. Right. He doesn't realize that sitting next to Pepper, if he's like. And then that she's gonna be like, you can kill him with Iron Man."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":1771.43,"end":1771.91,"speaker":"Jonathan Pageau","text":"Yes."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":1773.43,"end":1828.44,"speaker":"Ben Hatke","text":"So there's a lot of people doing that and just taking these stories and making them their own. But then with the Hero's Journey, I got into this once, a discussion about this kind of With. With like a group of onlookers about the hero's journey and stuff like that. And like, I don't. I feel like I never quite made. I feel like I have since kind of refined my point about it. I think that some of the story structure stuff that works time and again, there are valid points that, like, a lot of the. Some of the Hero's Journey stuff can carry some cultural baggage. Right. That, you know, every new time can re. Examine and say how much of this we want to keep. But I think at a base level, this idea of the structure of the hero's journey and the way Star wars plugs into it, stuff like this, I feel like that is a little bit like. I feel like it exists the way rhyme scheme exists."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":1828.44,"end":1829,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":1829.32,"end":1894.71,"speaker":"Ben Hatke","text":"Outside of us. Right. You can have all these discussions about poetry, but you have to admit, like a, B, B. A rhyme scheme is a thing. It's just. It's just a. It's a. It exists whether you want it to or not. And so, you know, all the. All the cultural stuff around it aside, the idea of the hero starts out, takes one step back, takes two steps forward. Big thing, new status quo. Right. Like, you move from status quo, like, to. We see. We see how what the status quo is there is the call to do something different. There's the refusal of the call, there's the acceptance of the call. Things get worse and worse and worse until they reach a breaking point. Now we're in a new status quo. Like, that's the hero's journey at its most baseline level. So I feel like that's just there. And it is exciting to me to look at that as a basic rhyme scheme for storytelling and realize that you don't have to tell stories that way, but it's a super basic rhyme scheme that you can know. And also now that you know it, what interesting Things can you do with it?"}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":1894.87,"end":1992.28,"speaker":"Jonathan Pageau","text":"Yeah. And a lot of the stories, like, a lot of the edgy stories, or let's say the experimental stories or the more modern stories, what they're doing is that they're not doing that basic story on purpose to make you notice that they're not doing the basic thing. So even when you kind of go away from this, you know, like, let's say, like you said, like situation problem resolution or return to another situation, sometimes it doesn't mean that there's an actual resolution of the problem problem, but a transformation and then to another state. And then if you look at crazy Dada type storytelling or people try to break that structure, you notice, oh, you're trying to break that structure. And then the structure still continues to exist because you keep trying to break it. So any experimental story ends up, in a way, even reinforcing that pattern because you notice it as an exception. You see it as something which is trying to be different. And so it just comes back to. It just becomes, like you said, almost like. It's almost like the pattern of breathing. It's just like how you even recognize that something is a story is because there's. I keep telling people that the world is full of facts, right? The world has a million amounts of facts. So if you string them together and for people to remember it, it's not arbitrary the way you do that. It has to have a certain pattern or else people won't even be able to recognize it as a unit. Won't you be able to say, that's a story. It's framed with the beginning and an end, right? It has characters that have some kind of continuation inside or at least some theme or something which holds it together. Or else. Then it looks fragmented and we struggle to even remember it, let's say."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":1992.76,"end":2139.38,"speaker":"Ben Hatke","text":"Sure, sure. But I do think they're like. I do think there are multiple. There are many stories, right? And so I do think, like. I do think that, you know, like these stories that I think of as rhyme schemes, I still have to admit that there's jazz, right? Like, there's still. And those kinds of experiments, you know, breaking out of. You know, I'm not a musical expert, but breaking out whatever came before is what leads us to jazz, which brings in its own richness in finding, I don't know, in, like, new patterns, new ways of doing things. Like, feel like the same thing happens in mathematics and in, you know, physics and stuff like this. The other thing, though, that called to mind with what you were saying was another Thing I've been thinking about a lot is stories as survival information, coded survival information. This is something that I don't know if you're familiar with Brian McDonald and he's written a book called Invisible Inc. He's got a podcast called the you are a storyteller podcast. Really good. And he's like a master. He's masterful at talking about stories. A great screenwriter and storyteller. But he talks about stories as sort of at their root at a fundamental, almost evolutionary level, it's coded survival information. You've got the La Brea tar pits. You can find a saber toothed tiger in the tar pits. Or no, you find a mammoth in the tar pits. You can find a saber tooth tiger on top of the mammoth in the tar pits. You don't find a person on top, top of the saber tooth tiger on top of. Because they had a story about the tar pits. I saw this thing go in there, it didn't come out right. Story as simple as that. And then like. And then there are certain stories like another proof of it or like example, I guess of this would be like I can say the tortoise and the hare and you're like slow and steady wins the race, right? That like it like. And if I had, if I sit down a child and I say now if you go. Sometimes the slower route is the better route to win the like. They're not going to remember that. If you tell to the hair, it's in there, right? And it's in there. And now that you say it. And they immediately are thinking. But anyway, so I do like to think about that and I think about living stories as the ones that contain, I don't know, not fact but truth or like useful information. Useful."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2139.38,"end":2140.7,"speaker":"Jonathan Pageau","text":"What do you mean by living stories?"}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2141.42,"end":2152.97,"speaker":"Ben Hatke","text":"I mean the stories that make it. The stories that like, like from a. Like. I don't know if I've never thought about like, like the Darwinism of storytelling, but I mean like, I don't know the ones that. The ones that keep."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2152.97,"end":2250.18,"speaker":"Jonathan Pageau","text":"The ones that survive. Yeah, there's like a meta process that you talked about where it's like the story is about survival, but then the fact that stories survive is also like a meta version of that. Like this is what I was trying to point to before, the idea of attention, which is that these stories survive because we tell them. Basically that's what it is. Like we, we transmit them to the next generation and that's why they survive. But there are, there are implicit reasons why we do that. That it's not arbitrary. You know, the. You know, the horrible sitcom, you know, that in the 90s, that we don't even remember the name of that. We don't remember it, and we won't pass it on because it was just. It just didn't keep our attention. It wasn't good enough. Right. It just didn't have what it takes to kind of survive, whereas other stories do survive. So my question is, one of the things that I've been thinking about a lot is the difference between our world, which is full of entertainment stories, which I appreciate, obviously, I like them. I live in this world. But there's also a way in which this is much different from ancient cultures that had participative story. That is, let's say the ancient Greeks, when they told the stories of the heroes and the gods, that was their heroes. It was their gods. It was their story. So by telling the story, they were kind of participating in the story. And so one of the issues I've had right now is that we've kind of moved away from participative storytelling. You know, like the way that you would tell the Iliad or the gospel stories or the story of George Washington or these types of stories that are part of us and the superhero stories, which are completely fictional and that you can't. Like, you can cosplay, but you never really enter into the world of Superman."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2250.18,"end":2254.7,"speaker":"Ben Hatke","text":"Right, right. But you never enter into the world of Zeus either."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2254.7,"end":2261.85,"speaker":"Jonathan Pageau","text":"I mean, like, if you were Greek, then Zeus is your God. You go to the temple, you give sacrifice. Like, you know, there's a sense in which you're. You're actually."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2262.73,"end":2281.53,"speaker":"Ben Hatke","text":"If you're. If you're a modern person, you go to, you know, San Diego Comic Con. Right. Like, it's like those two things don't seem that far apart to me. Like, the idea that, like, you are participating in those. In the story of the Greek gods, but Zeus is not going to turn into a bull and impregnate you."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2282.97,"end":2283.53,"speaker":"Jonathan Pageau","text":"I mean, like."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2283.53,"end":2283.85,"speaker":"Ben Hatke","text":"Right."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2284.01,"end":2286.89,"speaker":"Jonathan Pageau","text":"Well, not you, but your ancestors. Your ancestors."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2288.25,"end":2321.57,"speaker":"Ben Hatke","text":"Me, the ancient Greek person is not going to, like, encounter Zeus as a bull. Right. And then, like me as a modern person, I can. Like. Adam Savage has just made a tremendous mark, one Iron man suit and walked around one of the cons in it. Right. It's just. It's glorious. And it's just like. Yeah, but he's not bulletproof. Right. It's not a working. He doesn't have an actual arc reactor, but he's celebrating that. And they were celebrating that I'm not sure that the distinction is that different."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2321.97,"end":2429.3,"speaker":"Jonathan Pageau","text":"Well, I would say the distinction is binding of community. And so let's say you take Zeus. So Zeus, we celebrate Zeus, right? We. We worship Zeus, and then Zeus binds us together. So we. And so when we exist together, right, we know that we're all looking towards Zeus as the thing which holds us, let's say. It's usually not Zeus. Let's say Athena is better because Zeus is a little far off there, let's say. So Athena binds us together, and so we worship Athena. You know, we propitiate and we do all these things. We sing to her. But then she's also is the guarantor of our community functioning. So one of the reasons why we exist as a community because we have the same God. So in the. In the fictional world, it's more complicated because we don't have these. So we kind of celebrate, so we sell it. Let's say. Here's a good example. So let's say we go to Comic Con or we go to Harry Potter event, and we put on the thing and we do the thing and everything, and then we go back to our normal life. And those are disconnected in terms of causality. Whereas in a traditional culture, let's say the influence of Athena will be felt all the way into the home when the woman walks in and she lights a candle or whatever they were doing, like she burned some incense or something, which would connect all these levels of reality together all the way down to, you know, like whatever ritual they were using to include an infant into society, whatever. So it was like it was a binding of an actual society together where these. These stories are more. They're like. You can kind of participate them in a very particular thing, and then you kind of go back to your mundane reality. I think about maybe you have a solution to this or another way of seeing it. But that's something that."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2429.3,"end":2451.95,"speaker":"Ben Hatke","text":"I don't know. I feel like that's not. I don't know. Like, one of the things I think about a lot is that, like, how my lived experience is not always the same as everybody. Like, I see that this could be a thing, but in my experience, I just feel like. I see. I feel like those parallels are so close that it's not. It's tough because I feel like."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2451.95,"end":2459.59,"speaker":"Jonathan Pageau","text":"So let's. Let's take the he man story. Like, let's say you had this he man experience. You, like, dressed up as he man, and you wore it under your clothes as a kind of card."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2459.59,"end":2460.51,"speaker":"Ben Hatke","text":"Myself, yeah."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2460.51,"end":2472.23,"speaker":"Jonathan Pageau","text":"And so. So you had this, like, he man talisman. The. The he man vestment would remind you of the values that he man proposed. Because he did. Like, there was more. There were morals at the end of every show. Like, it was like, you know, you should act like this and that."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2472.23,"end":2475.23,"speaker":"Ben Hatke","text":"Oh, gosh, he man. Those guys knew what they were doing."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2475.71,"end":2522.78,"speaker":"Jonathan Pageau","text":"I think it's great. Like, I think it has and it works with you. Like, it actually had almost like a liturgical effect on you. Like a. Like, people are going to think I'm being heretic, but almost like a sacramental effect on you. Like, you wore the thing, it formed your values and made you part of the person you are, etc. Etc. And so. But now. And so the question is, does it scale? Like, to me, that's the question. Like, this is why I struggle with these fictional stories. And so it works to a certain extent. But does it scale? Like, can it bind your family together? Like, can he man bind your family together? Can he man bind a community together? Like, hold it in a. Like, is there. Like, would you initiate your children into He Man? I would walk. Maybe you would. I don't know. Like, I don't know."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2523.18,"end":2548.99,"speaker":"Ben Hatke","text":"I just. I feel like one of my friends who loves he man more than I do went to powercon, right? This is a huge he man gathering. He went to powercon and he met the guy who voiced man at Arms. And man at Arms said, like, he said something very beautiful to him in the man at Arms voice. And the guy, like, my friend was like, you know, tears were in my eyes. It's amazing."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2548.99,"end":2551.23,"speaker":"Jonathan Pageau","text":"It's like a revelation, like a little apocalyptic."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2551.23,"end":2660.12,"speaker":"Ben Hatke","text":"But I see this. I see this with stories. I feel like to say that these stories are, I don't know, lesser or silly or not as important makes me nervous. Like, I, like, yeah, because in my life, I have seen people so affected by story and so able to come together with. I owe my whole life to it, honestly. Like, finding my group online, these flight artists who we all ended up going on and telling the same kinds of stories, like, diving into to this. That shaped and formed my life. And, like, I treasure the moments that we get to see each other in events and things and I see other people doing this, whether it's the cosplay community or. And like, I can only see the parallels, honestly, because, like, you go to New York Comic Con and they are selling you things, right? Like, and that's gross, maybe, but maybe it's not. Maybe, but, I mean, they were selling you stuff at temples Too. Like they were selling those doves that you sacrifice. Right. There's always people making a buck off it. So I don't know. And like now I see my youngest daughter Ronia. She really latched onto the Mandalorian series. And that's a whole other. It was really beautiful. It was really good. And it was like, that's a whole nother one for me. The. I kind of wish he never took off the helmet. The mask too, because it allows you. Spider man is like this, which I cry at the end of spider verse at every time. Because they've taken all the responsibility lessons and all the self sacrificial lessons from Spider man and finally said you could be under the mask. It could be."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2660.12,"end":2687.35,"speaker":"Jonathan Pageau","text":"Yeah, I've talked about that before, which I talked about it in the sense that it's like, it really is the desire for religion. But it's like a weird version of it. Like it's a. It's like it's basically saying you could be, you know, you can, you can kind of live in Christ or you could live, you know, you can manifest this in the world. But it's, but it's, it's weird because it's like. No, I mean, not really. Right. I mean you can't, you're not Spider Man."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2687.83,"end":2688.55,"speaker":"Ben Hatke","text":"Right, But."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2691.03,"end":2694.63,"speaker":"Jonathan Pageau","text":"Or you can't. Like, can you? I don't know. Like, I mean, flip the question."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2694.71,"end":2698.46,"speaker":"Ben Hatke","text":"I'm struggling to see how, how, how that works the other direction."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2698.54,"end":2710.22,"speaker":"Jonathan Pageau","text":"Like how it works. So the way it works the other direction is that for example, you can imitate or you can, you can imitate Christ because Christ basically self sacrificed himself and that."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2710.38,"end":2711.86,"speaker":"Ben Hatke","text":"You can imitate Spider man the same."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2711.86,"end":2713.74,"speaker":"Jonathan Pageau","text":"Way though by sacrificing yourself."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2714.06,"end":2725.64,"speaker":"Ben Hatke","text":"Yeah. What Aunt May tell Spider man, he's like sometimes like a hero. What did she say? She's like heroes I believe in. There's a hero in all of us. This like something that makes us noble, keeps us brave."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2725.8,"end":2727.32,"speaker":"Jonathan Pageau","text":"Yeah, I think it's true for sure."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2727.56,"end":2740.36,"speaker":"Ben Hatke","text":"Sacrifices. And then it says. And sometimes it means giving up the thing you want most, even your dreams. And I'm still a real sucker for defining a hero by what he wants and then not giving it to him."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2740.44,"end":2754.77,"speaker":"Jonathan Pageau","text":"Yeah, yeah, that's. I mean I think that for sure in Spider man that's definitely a powerful thing about him, which is that Spider man is always sacrificing. That's his story. He's always not getting what he would like to have and he has to sacrifice that to a higher order."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2755.25,"end":2759.81,"speaker":"Ben Hatke","text":"Right. And that's where that. Yeah, I just. I don't see."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2760.93,"end":2762.05,"speaker":"Jonathan Pageau","text":"You don't see the difference?"}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2762.21,"end":2781.18,"speaker":"Ben Hatke","text":"I don't see the difference completely. No. I mean, I see how it's beautifully human and I see that Spider man is a person given great power, but we all are in some sense. I find those. I find that. I find those stories honestly also a lot about. About puberty, really? Like."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2781.58,"end":2782.78,"speaker":"Jonathan Pageau","text":"Yeah, for sure. Yeah."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2782.86,"end":2796.46,"speaker":"Ben Hatke","text":"Times when. When you change and you become stronger, men and women happens in different ways and same ways in some ways, but because you. You just physically get larger, you get to the point where you, whoever you."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2796.46,"end":2797.9,"speaker":"Jonathan Pageau","text":"Are, you kind of explore that in."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2798.7,"end":2800.38,"speaker":"Ben Hatke","text":"Now you are a danger to your parents."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2800.38,"end":2809.32,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah. You explore that a little bit in the Jack series. You get a sense that that's kind of what's going on with Jack as well. Like that he. In that transition spot there and he."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2809.32,"end":2826.92,"speaker":"Ben Hatke","text":"Has that, like, he has that. I feel like Zita, like, I like to have characters who like, have flaws, but they're always going to be part. They can control them, right. They learn to control their flaws, but they're not like over it. Right. Like, Zita's whole deal is like her stories start because she has a little bit of an impulse control problem."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2826.92,"end":2827.28,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2827.28,"end":2887.2,"speaker":"Ben Hatke","text":"Like if you give her a button, she's gonna push it. She can't not. And she probably gets that under control. But it's still her first impulse. Right. One of Jack's impulses is to control the situation. When I'm gonna do this, he's like, I'm going to force you not to. And that's one of the points where things kind of go bad for him. And he does it in the next book too. It's like he doesn't quite get over that. But I just like all those values. I guess I feel like this idea that, like, oh, some of the Christian values are of sacrifice and all these things are bubbling up in main current stories. Right. Currently told stories. But I also feel like I don't know what's specifically Christian about those values because I found them in Superman and he man and Spider man, and they just seem like human values. Right. They don't know how the other story is. How is it fundamentally different?"}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2887.68,"end":2915.93,"speaker":"Jonathan Pageau","text":"Well, if you look at. I mean, if you look at ancient epics, for example, like the theme of self sacrifice, at least the way that it's presented in the Christian story is not really there. It's maybe hinted at sometimes there's something which could maybe be around it. But if you think of Achilles, for example, I Always give this example. Achilles in the Iliad is brooding in his tent and doesn't want to participate in the battle because they took his sex slave away from him."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2916.25,"end":2916.65,"speaker":"Ben Hatke","text":"Sure."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2917.13,"end":2962.17,"speaker":"Jonathan Pageau","text":"And he goes back into battle when they kill his friend, and it's like, all right, now it's time to have revenge over my friend because he was killed. He goes overboard and there's all this going on. And you see, the same with Hercules is a hero, but he also slaughters his children. Like, there's a sense in which the heroes of the ancient world are these terrible kind of figures that are extremely powerful and that you have to fear and kind of, you know, you kind of have to be careful of. Whereas the hero, the Christian hero, which becomes exemplified in the night, is the hero that has power, which he gives to those that don't have power. And that's basically the basic structure of the hero since the advent of the Christian story. And it's."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2962.17,"end":2963.57,"speaker":"Ben Hatke","text":"So serve the less powerful."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":2963.57,"end":3028.88,"speaker":"Jonathan Pageau","text":"Yeah, exactly. And so that becomes like just a trope. And then. So you see it in he man, you see it in Superman, you see it in every. Basically every popular story because it has. It's been a major transformation. Like, it's a major transformation in the way we understand what even hierarchy is. Like, what the purpose of having these people above us is, is that they're there to love that which is below. Right. The purpose of the leaders is not to just clamp down on us and control us, but is to give back and to kind of give themselves for those that follow them. So that's. That to me, that's like the major Christian difference between ancient stories and stories. Even you find hints of that in Buddhism. Like, there isn't a sense in the idea of the bodhisattvas who refuse nirvana in order to help those that are still in the world. And so it's like, yeah, that's actually. That's quite close to the Christian story. But it's something which is not. It's not an obvious story. It's obvious to us because we've been living in it for 2,000 years. But it's not that obvious in terms of ancient myth for sure."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3029.04,"end":3043.32,"speaker":"Ben Hatke","text":"Okay, yes, I will grant you that. Definitely. Well, no, I mean, like, a lot of the ancient myths is like a lot of the Christian story is the flipping of might makes right to the flipping of that power structure. Right."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3043.32,"end":3043.68,"speaker":"Jonathan Pageau","text":"The."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3044.07,"end":3066.71,"speaker":"Ben Hatke","text":"The mighty are there to serve the weak. Right. Or that. That is maybe just our human calling, like to serve those below us. But I am still struggling to See why there's only one story to tell that really well, no, there is. And it's fractally wrong with telling it with Spider Man."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3066.79,"end":3067.99,"speaker":"Jonathan Pageau","text":"No, there's nothing wrong with it."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3067.99,"end":3071.66,"speaker":"Ben Hatke","text":"Lesser about telling it with Spider Man, I think."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3071.9,"end":3072.38,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3073.34,"end":3137.52,"speaker":"Ben Hatke","text":"Once we say, like, well, Spider Man's the one that said, with great power comes great responsibility, so. But why can't I make a character who also lives the value of. With great power comes great responsibility. And just like Spider Man's awesome. You can go to Spider man if you want. But there are many stories, and the best stories, like the tortoise and the hare are true. Right. But not factual, I guess, is the deal you learn from the tortoise and the hare. That very often taking the slower, methodical route gets you to the end first. Or if it's a race or whatever. But then there are times in life when you want to sprint or where that's the correct call is to just go sprint. But if that story becomes too crystallized and too formalized and too. And that there's a. There's an act, and if we look back in history, there's an actual turtle that tells you you've got to take the slow and steady rate. That's. Otherwise, it's a sin. Right?"}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3137.52,"end":3138,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3138.64,"end":3144.4,"speaker":"Ben Hatke","text":"Okay. That's the story that's taking the story as true and then conflating it with fact."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3144.72,"end":3148.32,"speaker":"Jonathan Pageau","text":"Yeah. Yeah. Well, for sure that these ancient stories are."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3149.17,"end":3149.53,"speaker":"Ben Hatke","text":"They're."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3149.53,"end":3163.89,"speaker":"Jonathan Pageau","text":"How can I say this? They're more organic than that. Like, they don't. They don't. Like you said. That's why in a lot of these ancient tropes, ancient stories, sometimes you'll find, like, adages that are actually the opposite of each other."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3164.21,"end":3164.57,"speaker":"Ben Hatke","text":"Sure."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3164.57,"end":3177.34,"speaker":"Jonathan Pageau","text":"And those. It coexist together. Right. Because it's like, you know, you say, is it far from. I get. Sorry, I'm French, so it's like, I don't have the adages in English. So it's far from heart, far from mind. Is that a. Is that an adage in English?"}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3177.9,"end":3180.02,"speaker":"Ben Hatke","text":"Oh, okay. I can see that."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3180.02,"end":3185.02,"speaker":"Jonathan Pageau","text":"Right. So you can say absence makes the heart grow fonder. Then you say, far from hard, far from mine."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3185.02,"end":3186.06,"speaker":"Ben Hatke","text":"Yeah, they're different. Yeah."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3186.06,"end":3194.38,"speaker":"Jonathan Pageau","text":"Right. Okay. So it's like it's actually two opposites. So it's like if you're far away from something, it makes you forget it. If you're far away from it, it makes your heart grow fonder for it."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3194.54,"end":3194.9,"speaker":"Ben Hatke","text":"Right."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3194.9,"end":3200.54,"speaker":"Jonathan Pageau","text":"They're actually both true, but they. But like you said, you don't want like, it. To turn into a rule system."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3200.62,"end":3202.1,"speaker":"Ben Hatke","text":"Oh. Out of sight, out of mind."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3202.1,"end":3205.82,"speaker":"Jonathan Pageau","text":"Out of sight, out of mind. Sorry. Like. Sorry. I just. I don't. I'm friends."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3206.06,"end":3207.34,"speaker":"Ben Hatke","text":"I was like, I know it's in there."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3207.42,"end":3238.14,"speaker":"Jonathan Pageau","text":"Yeah. Yeah. Anyways. But to come back to the idea of. To me, it's all about participation. Like I said. That's why I don't see it. Like, you don't have to see it. As opposed. I think that there's a way in which these. Let's say the Christian story bubbles down. Like, bubbles up and kind of fills up and manifests itself in all these. These different stories. And that's great. It's actually wonderful that that happens. But there's also a way in which. Like I said, I mean, I see when you say go to Comic Con and everything, I get it. Like, there's something. It's not nothing, but it's not."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3238.14,"end":3241.18,"speaker":"Ben Hatke","text":"It's not the Mandalorian. I don't mean to interrupt you, but."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3241.18,"end":3241.82,"speaker":"Jonathan Pageau","text":"Yeah, go ahead."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3241.82,"end":3286.02,"speaker":"Ben Hatke","text":"But I feel like I'm gonna forget this. I feel like watching my daughter, my little daughter, she's 10, and she latched on the Mandalorian, and now she's got a helmet, and we're, like, making her some beskar armor. And we all, as a family, enjoyed watching this series together, like. Like, as a. As an event. And then now she plays Mandalorian in. In the yard with her friend. And, you know, like, they've got. And they build it out of Legos. They build little world. Little mando worlds out of Legos. And then also when we. If you play that opening theme, that music that goes along with it, like, it's just one of those things where we're all there, Right. You can blast that through the house, and it's just like. It's not."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3286.5,"end":3287.3,"speaker":"Jonathan Pageau","text":"It's real. Like."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3287.3,"end":3287.54,"speaker":"Ben Hatke","text":"Yeah."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3287.54,"end":3288.54,"speaker":"Jonathan Pageau","text":"I'm not questioning it."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3288.54,"end":3294.62,"speaker":"Ben Hatke","text":"It's not quite as formally ritualized. But on the other hand, it's young. Yeah."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3294.62,"end":3397.28,"speaker":"Jonathan Pageau","text":"But it's also not like. I think that it's the. To me, it's the, like. So let me paint you the other portrait, right? Which is a village that has a church in the middle of the village, and the building is actually higher than all the other buildings. So when you look out your window, when you're walking around, you can always see the steeple above as the point of reference for all the people in the village. And then, you know, like, in the Catholic village, let's say at 12, the bell rings, and then we're all at the same time in the village, praying together. We know we can't see people doing it, but we know that the entire village is praying together at the same time, kind of looking towards this central space. And then on Sundays, we kind of go into the church. Everybody kind of goes into the church together. Then people celebrate the same thing. And then we move out and we go back into our homes, and we. And we have a fractal version of that, which is that it meals. And like I said, when the bell rings, then we'll have this celebration we do together. So what it does is it creates. So the community is bound together by this common celebration. And so in these fictional world, which, like I said, it works like in the Mandalorian, what happens is you have these little things that pop up, but it's ultimately you. We could. We're watching society kind of fragment. So, like, our suburbs are just, you know, suburbs have no center. Suburbs have no place of communion. Right. Suburbs have no common goal or common project. And so it's like this breakdown, which. And it's manifesting itself in all these little. Little smaller versions of liturgy. Like, you said, the Mandalorian or Marvel or Star wars and all these. Or manga or whatever. But ultimately, it's. You can feel this breakdown."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3397.36,"end":3400.96,"speaker":"Ben Hatke","text":"Yeah, okay. No, I mean, I've lived there, so I will."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3401.84,"end":3402.64,"speaker":"Jonathan Pageau","text":"That village."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3402.96,"end":3465.39,"speaker":"Ben Hatke","text":"Yeah, totally. Totally. We've spent, you know, all put together. You know, we'd go to the Gravagne Montala in Italy. This is where my wife's family is from. And it's a little village, like. Like, I think at its height, maybe like 300 people lived there. Now it's more like 60. Less than that now because it's very old. In the middle of it is, you know, the church. Highest point, more or less. It's on a mountain slope, so it's. Bell rings. San Bartolomeo is the church. I've marched with San Bartolomeo in his plaid skin in the procession around the town. And it's beautiful. Right. Like, I totally grant that it's beautiful, but. And it's binding. True. Right. And I can see that that is healthy, particularly for small communities to have. But I don't know. And I also will, like, I don't know how to solve the suburb problem. I get that. That's a. And I apologize for this guy out here."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3465.39,"end":3465.99,"speaker":"Jonathan Pageau","text":"No worries."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3466.31,"end":3476.41,"speaker":"Ben Hatke","text":"He's having crazy time. But I guess my thing is, like, would you say, like, the ancient communities with, like, the Greek communities had something similar?"}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3477.13,"end":3545.65,"speaker":"Jonathan Pageau","text":"Yeah, they definitely did. Yeah, they definitely did. And I mean, I think that it's a traditional trope. I think for sure the difference is that let's say in a Roman or Greek community you had that pattern, but it was, it didn't have the, it didn't necessarily have the love part as this aspect that we talked about, which is that at least ideally there's a sense in which the father is also there to help his children. Right. It's like it was a more hierarchical thing where the household would just submit to the father. And it was. Which is something which exists in the traditional Christian world as well. But at least in the story and in the ideal, there's a sense in which there's a top down thing kind of coming down as well. And so I think it's a totally. It's a universally traditional system. It's just the difference is, in my opinion, in the Christian story you have a balance between this kind of top down structure and the idea of how the lesser all the smaller people are the hero image that we talked about, the idea of the person above giving themselves for that, for those that follow him and all that kind of stuff. But it is a universal pattern. It's not just a Christian one that's."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3545.65,"end":3548.45,"speaker":"Ben Hatke","text":"100% sure which part's a universal pattern."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3549.09,"end":3563.89,"speaker":"Jonathan Pageau","text":"The idea of binding ritual, like the idea of ritual of celebrating, you know, of sacrificing, you know, all of these gestures that we pose to kind of connect ourselves with something higher and then bind ourselves to those that are around us."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3564.21,"end":3574.45,"speaker":"Ben Hatke","text":"Okay, so were the Greeks in their rituals, were they more closer to what you'd say like the Mandalorian or Marvel Cinematic Universe or something like that?"}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3574.77,"end":3575.57,"speaker":"Jonathan Pageau","text":"What do you mean?"}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3575.89,"end":3579.37,"speaker":"Ben Hatke","text":"Well, he keeps saying like. Well, it's different with these fictional stories."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3579.37,"end":3579.97,"speaker":"Jonathan Pageau","text":"Yeah, right."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3580.22,"end":3582.14,"speaker":"Ben Hatke","text":"Were the Greeks operating under a fictional story?"}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3582.46,"end":3587.5,"speaker":"Jonathan Pageau","text":"No, I don't think so. Okay, so I asked you if I think the gods exist. Yes, I think the gods exist."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3588.22,"end":3589.82,"speaker":"Ben Hatke","text":"And Zeus. And Zeus included."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3589.82,"end":3598.22,"speaker":"Jonathan Pageau","text":"I think Zeus exists. Of course the gods. I think I'm on a Neil Gaiman side with that. I think all the gods exist. Sorry, I guess you didn't expect that one."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3598.38,"end":3611.54,"speaker":"Ben Hatke","text":"No, this is super interesting. Like, how do. Like how. In what way? Maybe we're not understanding this. Maybe we don't know the. Maybe we're not using the same exist in the same way."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3611.86,"end":3613.62,"speaker":"Jonathan Pageau","text":"I don't know. How do you use the word exist?"}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3615.14,"end":3619.62,"speaker":"Ben Hatke","text":"Well, I mean, are you saying they exist in the way that an idea exists?"}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3620.34,"end":3634.63,"speaker":"Jonathan Pageau","text":"They exist in a way multiplicity becomes one. Like they exist in a way that they are principalities that manage bodies that manage. That manage aspects of reality."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3636.79,"end":3646.31,"speaker":"Ben Hatke","text":"You're a little bit beyond me. I'm not exactly sure what you're saying, so I'm totally interested, though. I am interested. I'm struggling."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3647.59,"end":3653.35,"speaker":"Jonathan Pageau","text":"So think of it like, let's say a city. Right, Right. And so does a city exist?"}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3653.83,"end":3654.23,"speaker":"Ben Hatke","text":"Sure."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3654.47,"end":3660.79,"speaker":"Jonathan Pageau","text":"Right. But it's also. I mean, where. Like, it's a very fluid thing. Like, it's a body. Right."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3661.19,"end":3663.99,"speaker":"Ben Hatke","text":"It exists materially. It exists as an event as well."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3664.36,"end":3748.22,"speaker":"Jonathan Pageau","text":"Right. But it's. So you can be at. You can, for example, be a New Yorker, but still, like, be in Miami, for example. Like, you could. You could. You could participate in New York, but while physically being in Miami. Yeah. Yeah. All right. So it exists. So the way it exists is complicated. It's not a simple thing. And so it exists under something like a principality. Right. In scripture, there's that. It's like the angel. There's an angel of a city. And it's a. And it's a. It's a. It's. It's a being. Just like you have a bunch of stuff in you, like your body. And your body extends even into your books and into your. The things you say online and the. You know, the notes that you've written. Right. It's like your body is a lot bigger than what we think. When we think of you just as this guy that is there. Let's say that I could, you know, that I could touch or. That's right in front of me. Your being extends beyond that. It's not as contained as sometimes we think. And so the way that you. That there's a part of you or an aspect of you which is one. It's like your spirit, your soul, like whatever word you want to use. The pattern which unites all this multiplicity that makes it recognizable, that exists at different levels of reality. It just. Just doesn't exist for people. It exists for. For cities, for. It exists for passions. Which is why we say there are demons. Like the demon of lust or the demon of this. Like, it's. It's a coherent body which is managed by a pattern, which is."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3748.38,"end":3749.02,"speaker":"Ben Hatke","text":"What do you mean?"}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3749.42,"end":3751.98,"speaker":"Jonathan Pageau","text":"Which makes you recognize. It is a way to understand that."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3752.14,"end":3754.54,"speaker":"Ben Hatke","text":"Can a demon affect the material world?"}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3755.1,"end":3757.1,"speaker":"Jonathan Pageau","text":"Of course. But not. Not materially."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3757.66,"end":3759.26,"speaker":"Ben Hatke","text":"Not materially. Not directly."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3759.34,"end":3782.18,"speaker":"Jonathan Pageau","text":"Yeah. Just like your thoughts can affect the material world, too. Not purely. Like your will can affect. Can affect the world. You just. Just not materially. Your will doesn't affect it directly. So you. You can. So you can you can have spiritual action at a distance, right? You can ask your wife to bring you a cup of coffee. And if she does, then you're affecting physical world through meaning, through spirit. Right?"}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3784.18,"end":3798.18,"speaker":"Ben Hatke","text":"That's a lot. That's a lot to chew on. All right, sorry, can I ask another question? Like, what about, like, so, okay, so Zeus in some sense exists. Could there be a new one? Could there be new gods that will exist?"}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3798.42,"end":3804.65,"speaker":"Jonathan Pageau","text":"Well, they wouldn't be new. They Would they? Would they? Would they? Could they could. Their bodies could appear in time, that's for sure."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3805.13,"end":3809.21,"speaker":"Ben Hatke","text":"So, like, oh, so we discover new gods that always did exist."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3809.61,"end":3856.14,"speaker":"Jonathan Pageau","text":"Well, that not always. The word always is complicated because it implies. How can I say this? It's like you could say that all things exist eternally in the mind of God is the best way to understand that. And then they manifest themselves in time and space, but that they, they obviously all of them have an eternal, like a non space, non time existence. So of course they could be. But I would say it may be yes and no. Like it's complicated. Like, of course all. So there's a theory, like a Thomistic theory, and it's a theory that a lot of ancient Christians accepted, which is that it's. Every time there's a communion between beings, there's an angel. So there's myriads and myriads of angels. Like, you know, every time, like, there's an angel for our conversation, because our conversation is more than the sum of its parts."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3856.54,"end":3858.38,"speaker":"Ben Hatke","text":"Are there angels for our tangents?"}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3858.7,"end":3860.06,"speaker":"Jonathan Pageau","text":"What do you mean by our tangents?"}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3860.62,"end":3864.14,"speaker":"Ben Hatke","text":"Is there an angel for the he man part of our conversation and an angel for the."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3866.62,"end":3868.14,"speaker":"Jonathan Pageau","text":"Like, is there an angel of he man?"}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3868.54,"end":3873.54,"speaker":"Ben Hatke","text":"No, no. You say there is an angel for our conversation, for the communion, for the."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3873.54,"end":3881.62,"speaker":"Jonathan Pageau","text":"Fact that we're coming together, like the union of multiplicity into one. So as soon as multiplicity kind of joins and you can recognize something."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3882.02,"end":3883.22,"speaker":"Ben Hatke","text":"Are they distinct angels?"}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3883.22,"end":3886.9,"speaker":"Jonathan Pageau","text":"Yeah, they're distinct angels. They don't necessarily have another podcast."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3886.9,"end":3894.42,"speaker":"Ben Hatke","text":"Is that a different angel or is that the same angel coming back for the next podcast, the next conversation where we double down on all this stuff?"}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3895.3,"end":3898.34,"speaker":"Jonathan Pageau","text":"It'd be interesting. It'd be interesting to think about where's the."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3898.42,"end":3901.54,"speaker":"Ben Hatke","text":"That's a. That's a. That's an idea that doesn't really have an end."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3901.78,"end":3921.61,"speaker":"Jonathan Pageau","text":"No, it doesn't. I mean, that's why it's like there's. That's why. I'm not saying that this is necessarily the best way to kind of understand reality, but it's Definitely a one which ancient Christians have. Have, Have. Have accepted. Not just ancient Christians, like even, you know, like, it's. It's a. Even in Hinduism you have this kind of idea, right, that there are myriads and myriads of principalities."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3922.17,"end":3922.77,"speaker":"Ben Hatke","text":"Okay?"}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3922.77,"end":3961.91,"speaker":"Jonathan Pageau","text":"But it's the problem. It's a problem of complexity. Like, it's, it's not a. It's not a religious problem. It's a. It's a problem of how we're able to perceive unity in multiplicity. Because it's like, you think it's obvious that you have a bunch of stuff in front of you, and all of a sudden you see it as one thing. It's like, why are you seeing it as one thing? Not one thing. It's a bunch of things. And that bunch of things also has another bunch of things at a lower level. It's a stacking up a bunch of things, but then somehow you're able to perceive one. So how is it that you're this one? Where is it? So that's the ontological problem that these questions are trying to pose. It's not a. It's not a. It's not a new."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3961.91,"end":3984.67,"speaker":"Ben Hatke","text":"It's not a new philosophical or physics problem. Right. Where does one thing end, the other thing begin? Like, but I mean, like, I don't know. I've been reading a ton of physics, and it gets slippery and slipperier the more you look at stuff. And that I can. That I can get on board with. And I do like. Like the idea that the edges of things, that reality is granular and the edges of things are kind of fuzzy."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3984.75,"end":3996.26,"speaker":"Jonathan Pageau","text":"Yeah. They have margins and they're. They're like the corners of the fields. Right. That you need to leave until they're the fringe on the vestment, the fringe of the garment. There's a messiness on the border."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":3996.66,"end":4016.62,"speaker":"Ben Hatke","text":"Sure, sure, sure. But I'm. I don't know, I just. I struggle with. With talking about principalities and angels as in that sense, as being useful for understanding it. Like, at least it's not the most useful thing in my toolbox. Currently. Mental toolbox."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4016.62,"end":4019.26,"speaker":"Jonathan Pageau","text":"I guess I'll say that I'm not going there."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4019.34,"end":4023.58,"speaker":"Ben Hatke","text":"Like, you're coming up with some interesting stuff, but I'm struggling to get it, I guess."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4023.74,"end":4079.5,"speaker":"Jonathan Pageau","text":"Yeah, that's okay. I mean, it's not. I didn't expect us to go in this direction anyways. In this conversation, I'm like, I kind of pulled you into a world of. A world that's difficult. It's not the way that modern people think, let's say. But it's definitely. It's something that. It's coming up in the problem of complexity and the problem of. Problem of emergence. Like, how is it that these. How do these phenomena coagulate into one? Right. How is it that quantum fields stack up so that you can say, you know, it's like. You can say, that's Ben. It's like, that's a pretty intense. A pretty intense thing that I can notice you. That you have unity because you're a bunch of stuff. Not just a bunch of stuff in space, but a bunch of stuff in time. And the fact that these join together into one being, it's something which is difficult to account for unless you have something like a Platonic structure."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4079.5,"end":4085.3,"speaker":"Ben Hatke","text":"Like it doesn't exist outside of everything. The one true apple."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4085.86,"end":4125.98,"speaker":"Jonathan Pageau","text":"Right. But it's not. That's why in the Christian vision, or at least in the orthodox vision, it's not that simple. It's like. It's not just that the apple, the form of the apple, exists outside the apples. It's that it exists within all the apples. The apples exist within it. It's not disincarnated. It's an incarnated metaphysics, you could say. But it's not like there's a world of the forms of apples and then there are the particular apples. It's that this is actually. It's an incarnate reality. The form of the apples are, you could say, hiding in the apples, and the apples are in the form so that you're able to perceive the apples as a discrete thing."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4125.98,"end":4126.46,"speaker":"Ben Hatke","text":"It's like."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4126.46,"end":4131.14,"speaker":"Jonathan Pageau","text":"Sorry, I feel like. I feel like this is going, like, way off to the ten of things."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4131.62,"end":4134.34,"speaker":"Ben Hatke","text":"But let me kind of. Let me rope it back into the."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4134.34,"end":4136.26,"speaker":"Jonathan Pageau","text":"Yeah, all right. Talk about the storytelling."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4136.26,"end":4162.35,"speaker":"Ben Hatke","text":"Well, I'm talking about. I'm thinking like the one. I guess I get nervous when. When all of it leads to there being one true story, which is also definitively historical and therefore has primacy over every other story, like the story of Jesus that relegates all the other stories to being glimmers of the one true story. And that is an idea that I have grown uncomfortable with."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4162.43,"end":4177.07,"speaker":"Jonathan Pageau","text":"Yeah, yeah. But there's another way to present it, which is not necessarily the idea that they're just glimmers, but that there's a. How can I say this? There's like a fractal reality, which is that reality is full of, let's say, the story of logos."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4177.07,"end":4182.14,"speaker":"Ben Hatke","text":"Right, right. But that's the logos. Logos. The Whole thing, you're giving a fractal reality a center."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4182.3,"end":4187.78,"speaker":"Jonathan Pageau","text":"Yeah. You mean the fact that the story of Jesus like encapsulates, let's say, all."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4187.78,"end":4198.46,"speaker":"Ben Hatke","text":"These stories together and then by definition has to be factual in a way that the story of Zeus is not historical? I mean, was."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4198.46,"end":4201.58,"speaker":"Jonathan Pageau","text":"You mean. You mean that it's that. Well, Zeus is not embodied."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4201.98,"end":4220.06,"speaker":"Ben Hatke","text":"And the swan, did that happen? Sorry, Letta. Is it Leda? Letta and the swan. I don't know. Take it. Why am I on a Zeus kick today? That's so weird. Any one of the people who was who Zeus dressed like turned into animal Zeus and got pregnant."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4220.06,"end":4225.3,"speaker":"Jonathan Pageau","text":"Yeah. Why are we talking about all of Zeus's rapes? Is that what you're wondering?"}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4225.3,"end":4230.96,"speaker":"Ben Hatke","text":"Yeah, yeah, yeah. That's interesting psychological question going on here. But did that happen? Like is."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4231.36,"end":4234.36,"speaker":"Jonathan Pageau","text":"You could say that it didn't happen in the same way that we say."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4234.36,"end":4239.8,"speaker":"Ben Hatke","text":"That the story George Washington crosses the Delaware wake. What's signing of Declaration of Independence."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4239.8,"end":4268.47,"speaker":"Jonathan Pageau","text":"Right. And so. So there's a hierarchy of events in the world and they don't necessarily happen at the same level, you know, and some of them have more intensity and more brightness and some of them are less incarnate also, as well, you could say. And so for sure, the way that. The way that Zeus impregnated his different ladies is not the same way that we talk about the resurrection, let's say, or that we talk about the story of Christ. But to say that it didn't happen, I think is."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4269.51,"end":4273.59,"speaker":"Ben Hatke","text":"Do we talk about the resurrection of Christ in a similar way to the signing of the."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4273.83,"end":4282.47,"speaker":"Jonathan Pageau","text":"No, I hope not. I hope nobody does that because it's obviously not at the same level. It's a different level. It's hinted at in the scripture closer."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4282.47,"end":4284.63,"speaker":"Ben Hatke","text":"To the Zeus level than to the."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4284.87,"end":4333.31,"speaker":"Jonathan Pageau","text":"I mean, the idea would be that it's a. It's a kind of. It's a place where it all comes together. And so in a way it is something that happened, but something which is beyond description at the same time. But it's not a. It's not a. It's not a fable. At least no Christians believe that it was a fable like that it was something that happened in a more subtle way, let's say. So a lot of the. A lot of the old stories are more subtle. Like they have. They don't have. They seem to be happening at the psychic level or seem to be happening at the, like the psychic level of the version of a community. Like something like that. Like, you know how you have ideas and imaginations and so that their community can have that as well. And so a lot of these stories seem to happen at that level. And so they're not exactly the same as. As, let's say, the stories about Jesus."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4333.47,"end":4351.93,"speaker":"Ben Hatke","text":"Okay, so. But story. Okay, so, yeah, those stories are happening at more of a psychic level, which is different from the story of Jesus. Was it happening at a more psychic level than, say, Ford making the first T Model T? I don't know."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4352.41,"end":4354.89,"speaker":"Jonathan Pageau","text":"Yeah. You're trying to find something that is historical."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4355.21,"end":4360.09,"speaker":"Ben Hatke","text":"Well, we're on a. We're on a. We're on a. We seem to be on a. There seems to be like a."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4360.98,"end":4362.94,"speaker":"Jonathan Pageau","text":"What do you call it, a continuum."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4362.94,"end":4382.82,"speaker":"Ben Hatke","text":"Of some kind of types of events. Yes. They're like. You have the more psychic events, which are, like Zeus. We have more historical events, like the first light bulb, things that you can point to. You have. And then we have. Where on this continuum is, say, the resurrection."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4383.86,"end":4426.72,"speaker":"Jonathan Pageau","text":"The resurrection is very singular because it's presented as both an event which obviously happened in a way that people could recognize it as happening, like it's happening in the world. But it also points. It's difficult to contain because the disciples don't recognize Jesus. They don't recognize him, and then they do when he reveals himself. And so it's very mysterious. I think it's made to be mysterious. It's made to be mysterious on purpose so that you don't think that it's as mundane as, you know, you cutting your fingernails, but that it's also not something which is imaginary or a fable, but that it somehow is a place where all of this kind of comes."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4426.72,"end":4431.2,"speaker":"Ben Hatke","text":"Together, and that's why it's got primacy. And we can toss out Zeus, but."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4431.2,"end":4437,"speaker":"Jonathan Pageau","text":"Not that we don't have to toss out Zeus. Like, I mean, we don't worship Zeus, but people remember the story of Zeus. Right."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4437,"end":4442.12,"speaker":"Ben Hatke","text":"About things that bring communities together. It does not have to be. It does not have to be Athena."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4442.35,"end":4467.23,"speaker":"Jonathan Pageau","text":"Yeah. Well, the. The stories of the Greek gods ended up participating in the margins of Christian civilization. Like, they were remembered, and they were. They were remembered and copied and celebrated as lower on the hierarchy of things, let's say, to remember. But they weren't forgotten. Like, there were statues of the Greek heroes in Constantinople, of the Roman heroes and Greek heroes in Constantinople. Like, they were, you know, they were just part of society."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4467.8,"end":4475.2,"speaker":"Ben Hatke","text":"But then the Norse myths are alive and well now with Thor being in the Marvel Universe. Yeah. So it's like. So I get."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4475.2,"end":4475.48,"speaker":"Jonathan Pageau","text":"Like."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4475.56,"end":4489.08,"speaker":"Ben Hatke","text":"But that's that's more of the evolution of story. Like, that's, that's an organic, I don't know, like stories in time, growing, changing, being adopted by different people for different reasons in different ways."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4489.72,"end":4574.17,"speaker":"Jonathan Pageau","text":"Yeah, but there are ways, like, I mean, be interesting to look at it, because there are ways in which the story of Jesus, let's say just the actual story of Jesus, that it takes storytelling to its limit. And so it's very difficult. It's very difficult sometimes to go. To think, imagine how you could go beyond some of the stories that are told but say in his story. So like the story of the descendant to the underworld, a good example that I like to use, which is that the descent into the underworld is like a universal story. You see it in every culture. It's always there. Like there are versions of it, different aspects of it. And you go down to visit to get some wisdom. You go down to save someone. You succeed or you don't succeed. And so you see it in all the, in the epics and you see it in the different myths. And so now Jesus has a version which is to go down into the underworld, and then he goes down into death, and then he takes everybody out and then he destroys death. And so that's like, that's the end of that story. So it's not like, I mean, you can participate, you can have other versions of it still, like, it's still kind of fractally will continue to manifest itself, but it's reached the limit of storytelling, which is that that story of the descent into the underworld has kind of reached its. Yeah, like their death is abolished. So I mean, it's like you could say, why is it that they're the ones who thought of telling that version? Like, I mean, you could kind of."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4574.25,"end":4595.14,"speaker":"Ben Hatke","text":"Find if that's the one true, best, ultimate version of that story, the fullness of the underworld story. As me sitting here, I have two questions. So first, question number one, with that being the fullness of the underworld story, I sit here today with the book on my desk, is writing an underworld story."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4595.46,"end":4595.94,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4596.82,"end":4606.58,"speaker":"Ben Hatke","text":"I feel that that marginalizes my underworld story a little bit. But why would I? The best has already been done. All I can do is be a glimmer or a fractal reflection of that story."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4607.48,"end":4683.29,"speaker":"Jonathan Pageau","text":"Right. But that's not like the idea of being a fractal reflection of the ultimate story is something that. That's always what we've been doing. It's not like, it's not like this is. This was always what's been going on, like, it's always been a fractal reflection of some story which we recognize. And then we're kind of participating in and we're showing different sides of. And. And so. And then everybody can kind of see that this is. This is connecting us to something which we can't totally describe or that stirs us in a way that we can't completely exhaust. But that continues to be true because the point, let's say, where that story comes together has happened. It doesn't mean that there isn't this joy of participating in it. I don't know. I mean, it doesn't affect me. I would still tell an underworld story because Dante still told an underworld story and it was one of the best underworld stories to ever happen, but it didn't reach the limit, let's say, of the. Of the. Of the story of Christ. Like, it didn't. It actually participates in it because it. Even in Dante's story, you. You get this sense of how all of this is going, has been transformed by that event and how. It's also even more interesting. Hints about how. Yeah, anyways, I won't go into that, but. Yeah, sorry."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4683.61,"end":4757.74,"speaker":"Ben Hatke","text":"Okay, so what about this island? Since you. Like. I'm having a hard time figuring out where the line is between and the way we're talking about now takes a lot of thought. But I have this idea, like, do you think if you could see the historical Christ Jesus of Nazareth, we'll say and find that this is a historical person and could view that history or travel back to that history and say, would you think he would be disappointed? Because the reason I'm asking. Can I just flesh out that question? My other totem that I have here with me, so I had Prince Adam. I also have Robin Hood, who I love, and my daughter Angelica gave me this plastic Disney Robin Hood, because I love Disney's Robin Hood, but Robin Hood's. Hard to figure out where it all came from. But it's possible that there are a couple early, early medieval contenders for maybe the origin of the Robin Hood story. I feel like if I went back and met one of those guys with Disney's beautiful fox, Robin Hood with Errol Flynn, with the many other versions, in my mind, it would be nothing short of a disappointment."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4757.82,"end":4792.9,"speaker":"Jonathan Pageau","text":"Yeah, I think you're right, but I think that's part of the story. It's actually in the Jesus story. What you're saying in the Jesus story is people being disappointed in Jesus and not him not seeming to be what they expected him to be. And so the way you think about it is completely right, but it's contained in the story. So there's a sense in which the Logos is hidden in his manifestation, and the fruits of that, of his hiddenness appear as the story continues to unfurl. And so when Christ resurrects or."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4796.26,"end":4796.54,"speaker":"Ben Hatke","text":"When."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4796.54,"end":4824.87,"speaker":"Jonathan Pageau","text":"They receive the Holy Spirit, you get a sense that all of a sudden, now they see all these little aspects of his story, and they're able to connect them in a way that at the time, they were too blind to kind of see. But I think you're right. I think that probably if I was there, especially without the knowledge that I have now, I would probably be one of those people that didn't recognize the Messiah, because, yeah, that's exactly how the story is actually told."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4825.51,"end":4829.6,"speaker":"Ben Hatke","text":"Interesting. That's good. This is all very interesting stuff."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4830.96,"end":4833.52,"speaker":"Jonathan Pageau","text":"We should probably go. I mean, it'd be nice to have another conversation."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4833.68,"end":4834.72,"speaker":"Ben Hatke","text":"I have run out of questions."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4834.72,"end":4870.04,"speaker":"Jonathan Pageau","text":"You run out of questions? Well, listen, I'm sorry I kind of took you on this crazy. I didn't expect it to kind of go in this direction. It was wild ride. So thank you. Thank you for your time, and thank you especially for your books. And once again, I want to encourage people, especially if you have kids that are, you know, kind of middle school age, even from, like, I mean, younger is fine too. And even in your. For adults as well. Like, they're just really great stories and very positive and very boisterous. Great characters. So I really appreciate what you've done, and I'm happy to. I'm happy that you were willing to talk to me."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4870.28,"end":4872.76,"speaker":"Ben Hatke","text":"Oh, thank you so much. It was a pleasure."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4873,"end":4876.16,"speaker":"Jonathan Pageau","text":"All right. And also maybe remind people of the."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4876.16,"end":4889.94,"speaker":"Ben Hatke","text":"Upcoming book, Julia's House Goes Home. I had a blast particularly illustrating this one with my watercolors. So I'm happy with the story, and it's a. I feel like it. It ended well enough, so."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4890.18,"end":4905.34,"speaker":"Jonathan Pageau","text":"And. And. And Ben, think about all the things you talked about. Let it mull over. I'll also think you really provoke me more than a lot of people in terms of the picture story. And it's like, I've been just saying this, and now you're like, oh, pushing here. So I'll think about it as well, and maybe we'll have another conversation at some point."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4905.34,"end":4907.23,"speaker":"Ben Hatke","text":"Maybe we will. Thank you so much."}
{"episode_id":"SW - #199 - 2021-11-15 - Ben Hatke - The New gods of Modern Storytelling","start":4907.23,"end":5140.64,"speaker":"Jonathan Pageau","text":"All right. It was good to meet you. I want to present you a new series of graphic novels called God's Dog. God's Dog is a very loose and epic exploration of the legend of the dog headed warrior St. Christopher. One of the most surprising and peculiar traditions of the ancient medieval world. It was written as a screenplay by myself and my brother Mathieu over 10 years ago. And the story story was taken up and even recommended by script scouting agency. It was requested by several Hollywood studios. But this story was of course too big, too strange, too surprising for Hollywood. And so now with all the control of its potential, we bring you this groundbreaking story in full color as a series of graphic novels. The story is set in a Tolkien style mythical version of the biblical world. Filled with hidden codes, ancient relics, angels, giants, dragons and populated with fictional versions of mysterious monks, warrior saints and more symbolism than you can imagine. God's Dog contains all the intensity and subtlety of our symbolic thinking. The world class layout and artwork of Cord Nielsen. All of this bound in a mysterious and powerful story arc which is available to all from wide eyed 10 year olds to the most seasoned of readers. The entire story with all its action and complexity is already completely worked out and the first book is near completion. Now all we need to do is deliver it to you. We're crowdfunding this because it is only the first step. We already been contacted by even international publishers for this. But we want to knock this out of the park so that our artists can do this full time and deliver the oncoming books at a regular and steady pace under our control. I myself will personally not be taking any profit from this first book, but rather I want to use this to build what we need to tell this full epic with all its cosmic proportions. So along with the graphic novel, we are also producing a crowdfunding only Add on the Secrets of God's Dog Sourcebook. A beautiful volume in which you will find my original drawings from more than 10 years ago, an exploration of the symbolism of St. Christopher and an exclusive text by Matthieu Pageau on the symbolism of the biblical Samson. This is the first thing that Met has published since his groundbreaking book the Language of Creation. So jump into the margins with us, be part of this shift in storytelling where the end becomes the beginning and where the monster carries the king into a new world. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon, the pageau videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
