{"episode_id":"SW - #386 - 2025-04-07 - Snow White (2025) Is a Disaster, But","start":0.16,"end":62.13,"speaker":"Laura Diaz","text":"Tucson, the weight is over Mediweight loss. They're officially open on North Oracle road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks at mediweight loss. I got the same medication but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com hello everyone."}
{"episode_id":"SW - #386 - 2025-04-07 - Snow White (2025) Is a Disaster, But","start":62.29,"end":1833.95,"speaker":"Jonathan Pageau","text":"I am sitting here in Florida in the house of the legendary degrade family of dirt poor Robin's fame. And last night, yesterday with the degrade family, we went to see Snow White. And we went to see Snow White so that you don't have to see it. You know, I felt like I had to see it. Also, there are several people that have asked me to, to, you know, there's a journalist who wants to talk to me about the movie. So I said, look, you know, there is a relationship between this movie coming out and the books that we tried to put out in the sense that I knew that Disney could not tell this story when I heard about the fact that they were making a new version of it. And so, and they did not disappoint. They really no longer are allowed to tell this story. And so what I'd like to do with you is, you know, this will be full of spoilers. So, you know, obviously it's not like there's anything that magical to spoil, but I'm going to go through the way that they tell the story and then we're going to analyze it in relationship to the original Snow White, to the original movie. And we're going to show why they made certain decisions and what it is that those decisions mean. This is Jonathan Peugeot. Welcome to the symbolic world. And so the first thing to say is I went in there. I'll, I'll be honest with you. I went in there and I said, look, I pretty much know I'm not going to like this movie, but I'm going to be, I'm going to try to be as generous as possible. I'm going to try to, you know, take in what they're giving me and try to give it the most generous possible interpretation. And so the first thing to say about the way that the movie structured is clear that they have fiddled with this movie over and over and over. So what it feels like when you're watching it is that there are actually two movies, at least two movies that are smashed together in ways that don't completely make sense. There is what looks like the original version that they tried to retell, which is more political, which is more revolutionary in its structure, and then they tried to overlay or to make it fit with a more nostalgic reinterpretation of the original Disney story. And so because of that, it feels very disjuncted. Disjuncted. And it's hard to completely understand sometimes what it is that the signs are pointing to. Like the, some of the images that are used, they don't fit together. There's a sense that it, it, it unravels. It is not the worst movie that I've ever seen. You know, I mean, there, there are worse movies than that, but it is definitely doesn't look like a movie that is worth the hundreds and hundreds of millions of dollars that ultimately the budget brought about. And so let's go into the story and compare it with the original Snow White, with the original Disney version, and see what it looks like. You know, the original Disney. Snow White is the very first long animated movie ever made. When it came out, it was legendary. You know, people could not stop raving about it. In some ways, it's what really launched Disney to be a world class studio that was making things that nobody had dared to make before. And there's also an important thing to understand about the original Snow White movie is that it was happening in a time in the 1930s where there was a lot of tropes that were similar to the ones that we have now. There were very cynical, kind of, you wouldn't say postmodern now, but there was a kind of cynical deconstructive aspect to culture. You know, also a kind of degenerate club jazz culture. You have this image of the flappers and this, you know, this kind of club culture and Snow White and Disney seems to Be a reaction to that, in some ways a reaction to modernism, where they are bringing back the old fairy tales in a world of modern kind of deconstructive thinking, they're bringing back also a medieval aesthetic. If you think of the fairy tale book at the beginning of the. Of the movie, you know, they're bringing in that kind of medieval gothic illumination, that scent of the old fairy tales. And so there is a deliberate desire in the original Snow White movie to make the movie remind you of a time before that is meaningful and that is beautiful. You know, in a world where, don't forget, like the artists that were popular at the time that the movie was made, you know, were Picasso, the expressionist, the German expressionist. Even in theater, you had German expressionist theater and modern theater, where there was this obsession with darker desires. And all of that was in the air at the time that Snow White was made. And so what happens in the movie is that they try to capture some of that in some of the aesthetic. And so, for example, at the beginning of the movie, there is a fairy tale book and there is this medieval style illustration. Inside. They have a castle. They have a kind of aesthetic of the medieval world with a king and a queen and a princess. But then what happens through the story is that everything they do that changes it from the original movie is going against the. The story. It's going against the aesthetic that they're choosing for the movie. It's going against the. The world in which that is set. And so that is already part of the disjunct. So the movie starts with Snow White. You know, obviously there's an issue with the. With the movie already, because, of course, in the original fairy tale, they say that Snow White is called Snow White because her skin was white as snow. You know, her hair was black as. As. As coal, you know, and her lips were red. And that was the imagery of Snow White. Now, of course, because they chose a Latino, a Latina woman, now they have a problem already right at the outset with the signifiers. And so, you know, because of political correctness, you know, that they couldn't do it. They couldn't have the actress, you know, have her skin as white as snow because of all the political illusions that it brings. Of course, in the original fairy tale, that has nothing to do with our modern politics. It's kind of ridiculous to put in your modern politics into these ancient fairy tales. But because of this kind of ideological infection, they couldn't make Snow White even in her name, connected to the reason in the story Of. Of why she. Of who she is and this relationship between the idea of being fair and being pale and being beautiful, you know, those connections are sums that you cannot make anymore because racism, you know, which is too bad. The idea of celebrating the beauty of fairness and of this image of Snow White doesn't have to contradict also the beauty of, let's say, the darker woman. You see that in the Bible. Like, you have the image of this image of the Shulamite and this idea of the darker woman as being this beautiful woman. But it's also okay to celebrate the idea of the fairness and the idea of pale skin as representing light and all of this type of symbolism. It's complicated to talk about this in this world, but this is already a problem that. Because they're not willing to go, to lean into what the original story is right at the outset with her name, we have a problem because now they're saying that the reason why she's named Snow White is because she was born during a snowstorm. But then what the hell does that mean? So she survived a snowstorm, I guess. I guess so. It's like she survived adversity. Not really sure what the connection is. What does it have to do with fairness? What does it have to do with her name? You know, why is she named that? None of it is completely clear, you know, so it's. It feels forced right at the outset. And so in the story, of course, her mother passes away, her father is seduced by the Evil Queen. All that is completely is normal and makes sense. The Evil Queen is narcissistic, you know, she's obsessed with herself. She's obsessed with power. That portrayal is quite good. Although Man Gal Gadot is just such a bad actress in this movie, it's. Both of them are not very good actors, you know, So I shouldn't be commenting on that too much. I'd want to focus on the symbolism of the story. And so you have. You have this. The husband who is seduced by this beautiful woman. And this beautiful woman is obsessed with riches, is obsessed with the external trappings of beauty. And it's not. There's a way in which things become a little confused, because the entire movie is trying to play between the notion of fairness as beauty and the notion of fairness in the more political way, which is the idea of being fair. And so the word play through the movie, that's what it is during the whole time. But the problem is that maybe they could have done it right, but in this case, sadly, they don't do it right, it doesn't land because it ends up being confused. And so she sends the. The father away and he dies. Of course, later you find out that she had him killed so that she could take over the kingdom. And so now she becomes the illegitimate royal who is now taking everything from the people and is militarizing the kingdom. There are interesting allusions to Robin Hood in the story, which I think could have helped the story if they had been brought together properly. Sadly, because the movie is so awkward, things don't come together. But the insight of trying to connect it to Robin Hood in order to bring in some political elements into the story is something that is interesting, could have been done better. But then she starts to basically militarize the kingdom and to take from the poor. And so they're going to have this problem in the story because, like I said, they're crossing the notion of beauty as fairness and then fairness in the sense of political fairness. And so, you know, right at the outset that you don't know how it is that they're going to play off the final part of the movie when the witch goes to Snow White with the apple and proposes, at least in the early Disney movie proposes, that this is a way that she could seduce the prince, Right. You know, by. By using this apple. And like, the young men, they like apple pies, but in this movie, what they do is that they have the king and the queen bake apple pies for the people in the kingdom and, like, go out and, like, serve them these apple pies. And it's an image of their fairness and the fact that they're connected to the people. And so that's how they kind of try to bring it together for the question of the apple. And when the queen militarizes and starts to take everything from the people, you know, then they become poor. You know, they're struggling, they're starving, very much like in the Robin Hood type story. And Snow White is a slave. She's washing the castle very much like in the original story. But then she meets her love interest, who is not a prince, who is a thief. And I think this is really where they're trying to get the Robin Hood imagery, you know, kind of a little bit of the King David imagery of this character who is a thief and is trying to steal food from the castle. The queen catches him, and then she starts to condemn him, to put him in the dungeon. Snow White defends the boy. His name is Jonathan. Defends Jonathan. The queen ties him to the gate of the castle in order to let him die there. And then Snow White goes, of course, she frees Jonathan, and the queen sees that she's freeing Jonathan, and then she immediately goes to the magic mirror. And she asked the magic mirror a question that we've seen her already ask in the movie, which is, of course, magic mirror on the wall, who is the fairest of them all? And what is the answer? The answer is, there is one that's fairer than you. And it is. It's Snow White. And you can. And you can see that all of a sudden, now you have an issue. Like, you have a problem because she's looking at herself in the mirror, and what she's asking is, you know, obviously, if you look yourself in the mirror, you're asking, who's the most beaut? And so now the mirror is answering, the fairest is Snow White. But the reason why she's the fairest isn't because she's beautiful. It's because she's helping the poor. It's because she is trying to be a fair ruler. But, like, you see, it's like the hairs are getting crossed, and they're gonna get even more confused as the movie progresses. And so this, of course, prompts the queen to want to get rid of. Get rid of Snow White. Just like in the original movie, she has the hunter go out, bring Snow White into the forest, abandoning her in the forest, telling her to run away. You know, the queen is after you. All of that same. The scene in the forest is actually the most interesting. You know, she goes into the forest, and the forest is very frightening and is kind of monstrous. It plays off a little weird because in the original movie, it's all in her perception. Like she's seeing the forest as being a dangerous thing. And the way they do it in this particular scene, you know, they. They kind of show as if the force really is this monstrous thing. It's hard to tell. So but it is visually interesting. And then for some reason that's very odd, like, a trap opens in the ground and she falls into water. And then there's a little illusion to puberty. You know, she has a red ribbon in her hair, and the red ribbon falls off of her. And as she's kind of floating through the water, you can see this red ribbon behind her, kind of floating. And so there is this. This allusion to puberty into transformation, but because the whole movie is not really about her finding love, really, or maybe there is an aspect of the movie that's about that, but it really is mostly about her, you know, becoming the ruler of the kingdom. It does, like I said, it doesn't play out very well. With all this attention on Snow White right now, we want to make sure that we're mostly celebrating this powerful story in our culture. So to do so, we are offering, for the very last time, a very special box set edition of our version of Snow White, Snow White and the Widow Queen. It is set in a beautifully bejeweled box, and you also get a free bookmark and a sticker with this leather bound edition of Snow White. The whole thing is signed by me. And this is the very last time that we are going to offer this to you. And so please go ahead and get that. While the stocks last. We are also offering 10% on specific Snow White products. And if you enter Snow 25 all caps at the end and checkout, you will get 10% on specific Snow White products. That is Snow 25 in all caps when you check out. Snow White is a classic fairy tale and an important part of our culture. Beautiful renditions, celebratory renditions of these stories. It's exactly what we're trying to do with Symbolic World Press. And of course, we already have published two of these books and several of them are coming downstream. So please continue to pay attention. In the meantime, yeah, it's time to celebrate Snow White together. I'll talk to you very soon. So the first thing you need to notice is that, of course, for the. For the ending of the movie to be able to happen in this Disney movie, for the prince to be able to wake her up when she's sleeping, she now Snow White has to save the prince because it can't play out in a politically correct movie unless she saves him. And so she'll save him like three times in the movie. She's already saved him at the beginning from the Evil Queen. And she is now going to continue to. She's going to. She's going to save him several times during the movie, you know, so that it is overwhelmingly her that's saving him, and only slightly the prince that saves her at the end, you know, which is already annoying. And through the whole movie, what's playing out is basically the idea that Snow White has to become the monarch. And that's really what the story is about. There is a trope in the movie where she basically finds out that her father might be being held in another kingdom. And then. And she's hoping that they can go save him, that the king can return. And, you know, this Thief. He has a band of thieves in the wood, and they say that they serve the real king, kind of like Robin Hood, and they're waiting for the king to return. But ultimately what this is about is that, yeah, you shouldn't wait for the king to return, and you should become the monarch that you can be. And so there's a phrase in the sentence which keeps coming back, which is something like, it's no longer time to be led, but to lead. And that is what the movie is about. The usual trope of the female becoming the leader. It's there all through the story, and every single change that they make is about Snow White, you know, becoming the leader in the kingdom and making sure that she's always kind of reaching towards that masculine role and is feminized as little as possible. It's made feminine as little as possible. You know, she ends up with the Dwarves. The Dwarves are in the movie. It feels like. It's hard to know, but it feels like in the original script, maybe the Dwarves were not even in the movie, but then they added them later because they. They were trying to save face and they were trying to make it work because there are these two ban. There's the Dwarves and there's the band of thieves that is related to Jonathan that are these thieves, these kind of multicultural, you know, band of thieves in the wood. But she does meet with the Dwarves. And, oh, my goodness, the Dwarves are just nightmare fuel. Like, Uncanny Valley. You've seen the videos. It is really scary. And of course, every single decision, every single trope is there to play out the kind of revolutionary structure or to. To downplay the. I don't know how to say it, like the way that the original Snow White structured the relationships and so example in the Dwarves, Dopey is really embarrassing for the politically correct version, you know. How do you represent Dopey? So basically, you represent Dopey as the guy who's being teased by the other Dwarves. And, you know, and because of that, he doesn't speak, but really he can speak. And then he learns to whistle and shows all the other Dwarves how to whistle. And by the end of the movie, really, by the end of the movie, Dopey has become the leader of the Dwarves. And there's a scene where you see him standing in front of all the other Dwarves and all the other Dwarves are behind him. And so they're trying to show this weird, like I said, like this just basically the revolutionary structure all through the movie. And because the movie ends up taking up all of These political tropes, you know, that plays itself out all through the movie. You know, ultimately Snow White identifies with the band of thieves in the woods, joins with them, which again, could have been interesting. See, it's not completely ridiculous. It could have been interesting, you know, had they played this, this Jonathan David role. And I think they were thinking about that, you know, because the name of the, of the thief in the wood is Jonathan. And Snow White, you know, becomes. Is in a relationship with, with Jonathan and they're thieves in the woods. And you know, King David was associated with these band of thieves that were band of debtors and band of miscreants that were living in the woods. So there could have been some interesting ways to play it out, but sadly, like I said, it doesn't play out particularly well. There were some insights that weren't that bad, but it doesn't play out really well. Again, you know, when Snow White comes into the Dwarves house, obviously in the original story and in the original movie she cleans the house and prepares a meal for the dwarves, but you know, in this particular version she tells the dwarves how to clean, like she's teaching them how to clean. And so she's kind of becoming the leader of the Dwarves, which is just the weirdest thing ever. You know, in, in the Disney movie, there's a beautiful scene where through her kind of generous and, and influence and a little bit of a mother role, she gets the Dwarves to become better, to like to clean themselves and to not come to, to dinner dirty. But in this one, it really is, you know, like Snow White is. She's basically like, all right now I'm gonna, I'm gonna, I'm going to make you clean your house. You know, Anyways, it goes through the entire movie, all of these types of tropes where, you know, in some ways the culmination of all of these images that we've seen in, in Disney now for, for decades at this point are kind of. You can feel like in this movie it's kind of crashing, but they're also trying to fix it. And so that's why it looks like two movies. And the hope is that the fact that it looks like two movies where they're both, they both seem to have reached the top of the kind of political revolutionary, you know, kind of political correct way of thinking and the kind of woman replacing the male type of thinking. But also they realize of what a train wreck it is and are also trying to fix it. And so everything, nothing fits and the pieces don't come Together, the thing we can hope for is that in some ways it is the sign that this is over, right? And that we will see something a little more normal come in the future. That's the hope. I don't know if it's going to play out. But then the problem of the fairness then becomes more and more acute, which is Snow White is called the most fair because she's fair politically. But then when the Queen, you know, kills Snow White, then she goes to the mirror and she asks the mirror who's the fairest of them all? And the mirror says that it's the Queen again, but the queen is not fair. The queen has a horrible song, which he's saying, because I'm the fairest, then everything I do is fair. And so what? What? So she's saying something like, it's power, right? I'm. Because I'm beautiful and because I have the power, I can decide what's right and wrong, you know? But then why does the mirror recognize that? I don't even know. Like, why does the mirror think she's the fairest when the mirror will ultimately say that the reason why he said Snow White was the fairest is because in her heart, she's the fairest. But then why was the Queen the fairest anyways? Like, it doesn't make any sense. They're completely confusing these lair. They don't understand how in the Snow White story, there is this sense that the beauty, the external beauty, you know, can either be a manifestation of inner truth and inner beauty, or it can be a manifestation of outward beauty and inner poison, you know, but the mirror only sees the outside. That's what a mirror is. And so the Queen is making a mistake, you know, in the original story by only judging what the mirror is telling her, you know, but now in this, it's all muddled and it's all confused and it doesn't make sense at all in the story, you know, how it is that they get there and then finally, you know, the movie ends with a kind of political retaking of the kingdom. And because they do it that way, again, they miss the entire point in the Ereali Disney movie of when the Queen transforms into the old hag. You know, the whole idea of the story is that she's sacrificing. She's willing to even destroy her own beauty out of her animosity and jealousy of the Snow White, who's more beautiful than her. And so she's so obsessed and so possessed by beauty that she's willing to Sacrifice the things she wants just to prevent the other woman from having it. I mean, it's a powerful reflection of human psychology. But now, in this version, she becomes the old hag, and then she becomes the beautiful queen again. And so all of that is lost. Like, why does she even become the old hag? It doesn't make sense. Then she goes and she gives her the apple, but the apple is what now? The apple is an image of the fairness of the kingdom that her father had. And so what is the trick? And also, what is the purpose of the trick? She gives her the apple, and she reminds her about how she remembers that her father was fair and that, you know, he was giving apples to people. And then Snow White eats the apple, and then she dies. But in the original story, there's a sense in which it is her temptation, like she's tempted to beauty. In the Disney version, she's tempted to act, you know, in order to seduce the prince, which is what the queen wants also, is that she on purpose does these gestures to seduce the prince, and not just in the way that the prince is attracted to her at the outset because of her innocence and her beauty. And that is the trick. And that's why she's poisoned and dies. Now, in this version, what does it even mean? It doesn't mean anything. And that is really the best way to understand the problem with the entire movie is that because they are trying to put ideology in the movie, because they're trying to push it in, the signs don't connect. You know, symbolism is not arbitrary. There is an organic reality to symbolic relations. And if you try to force something in there, what happens is, at some point you end up with empty signs. And so the apple, the dwarves, the kiss waking her up, all of these now, in this version, become empty signifiers that are there only as nostalgia for the early Disney movie and are there to basically, like, just be in the way for this new version that they're trying to tell of this queen that has to become a leader and has to, you know, to not be led and to lead others. And so none of it works. And it ends up being a hodgepodge of ideas that do not fit together. And. But like I said, I think this is a good sign. And why do I think it's a good sign, think it's a good sign? Because movies like Moana, some of the other versions of the Disney stories that have been told over the last few decades have been extremely deliberately and coherently pushing in one direction, and all the symbolism aligned in a very coherent way in that direction. And so what happened is when you're watching it, you feel a kind of deep coherence to the worldview that it's trying to promote. But I think in pushing that so far that it became completely absurd and ridiculous, right? In pushing the girl boss ideal and a kind of extreme vision of how the feminine rises up and takes over the masculine, at some point, it becomes so absurd. And when they did it with the very first Disney movie, when they tried to go back to their own beginning and to infect Disney's own beginning with those tropes, it's beautifully symbolic to see that that is where it fails miserably. And that is where they start to scramble to fix their own mistakes. And they start to scramble to reintegrate tropes from the early movie and to reintegrate signs that they can't make fit, but they're still trying to reintegrate them into the story. And so the best thing I can say about the Disney Snow White movie is that it is possibly an image of hope for us that the true stories are coming back, you know, and there it's happening in this weird, alchemical way in this movie. But then in the future, what we're going to see are pure seeds being planted in the world. And do not forget that really doing that is what motivates me the most. That is why that I have started to write these new versions of the fairy tales. That's why we've already have a version of Snow White called Snow White and the Widow Queen. We have a version of Jack the Beanstalk, and our version of Rapunzel is coming very soon, where we are trying to go back into these stories to celebrate them, to take home with as much beauty. And, you know, in a kind of reverence to the original story, while still trying to insert some symbolic insights for those who have the eyes to see. So I hope you enjoyed this video. You do not have to go watch the Snow White movie. Seriously. I did it so you don't have to. And so please enjoy the rest of your day and thanks for your attention. Bye bye, Tucson."}
{"episode_id":"SW - #386 - 2025-04-07 - Snow White (2025) Is a Disaster, But","start":1833.95,"end":1894.44,"speaker":"Laura Diaz","text":"The weight is over. Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iHeartRadio. And you can trust me, this isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication, but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better, and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com."}
