{"episode_id":"SW - #341 - 2024-05-24 - The Last Judgement - The Culmination of Christian Symbolism","start":0.08,"end":43.19,"speaker":"Jonathan Pageau","text":"The Last Judgment is not just something that happens at the end, but it is a perpetual reality. It is basically an image of how reality functions. And it's not arbitrary to think that that would be the case because it is an image of the end. And you have to remember how the ancients thought of the end of something. It's not just the moment when the time runs out, but it is the moment that shows you the reason for everything that came before. This is Jonathan Pedro. Welcome to the symbolic world."}
{"episode_id":"SW - #341 - 2024-05-24 - The Last Judgement - The Culmination of Christian Symbolism","start":56.24,"end":297.52,"speaker":"Stephen Blackwood","text":"I'm very glad that you've all decided to join us for what I know is going to be a very special evening. And I want to make a few introductory remarks about our speaker, though I know he's already well known to many of you. Mr. Jonathan Pagod, who has emerged as a truly powerful and prophetic voice in the last years, speaking deeply to our culture's longing for meaning and coherence, both at the individual level and at the level of our shared corporate existence. He has been identified, I think not playfully, alongside of Jordan Peterson, John Vervaeke, and Bishop Robert Barron, as one of the four horsemen of meaning. And I know that many of you have benefited from his gifts as an interpreter. A couple of years ago, I had the privilege of sitting next to Jonathan in a seminar on Exodus with Jordan Peterson and other friends. And that was an example for me of the kind of thing that Jonathan does so very well, this opening up of the texts and the images of the symbols, of the structures of meaning and narrative of the past here in the present. A few months ago, our students had the pleasure of seeing Jonathan in Greece, where our program begins. And I had the great pleasure of going to Meteora, that one of the oldest sites, monastic sites, in the Orthodox world, where Jonathan gave a wonderful talk about how what monks do is they look up and they show others the way of looking up. Jonathan Pigeot is of course, not a monk, and I think it is true to say that his own life and witness has been dedicated to teaching others to look up. Though he's known broadly as a commentator, his metier, you might say his vocation is as a carver, as an artist, as a carver of icons in particular. And these are found in churches around the world. He Jonathan has spoken about how the icon works by compression. That is to say, it draws together different times, elements and ways of thinking and understanding into a fundamental relationship such that all these can shine forth in this compressed form. It kind of unfolds. I think something very similar to that is true of Jonathan's work as a commentator that he draws diverse aspects of our world, our culture, our history, everything from comic books to movie scenes to postmodernism, through to the images of the deep symbolic past into relationship with one another, such that their meaning can shine forth for and in us. This evening, Jonathan will bring his considerable interpretive talents to bear upon the topic of the medieval cosmos. Yet in speaking to us of the shape of the medieval world, he is not only speaking of the past. With his iconographic sensibility, he will help us to locate our present in this time and place. Ralston College was founded, you might say, on a kind of double conviction. If we're going to speak about directionality, both of the need to look up and in the conviction that in order to look forward, we need to look back. By allowing our present moment to be illuminated by the past, we are better able to understand who and what we are and what is the work we must undertake. I can think of no better guide for us on this particular journey than Mr. Pajo, and I hope you will join me in giving him a warm welcome now."}
{"episode_id":"SW - #341 - 2024-05-24 - The Last Judgement - The Culmination of Christian Symbolism","start":306.56,"end":1689.66,"speaker":"Jonathan Pageau","text":"So, first off, I obviously want to thank Steven, thank Ralston. As someone who went to university in a very postmodern world, I studied fine art, and so that the way of thinking was very strong even in the 90s. This kind of very critical and cynical approach to art, to the stories, to the great stories that make us who we are. Encountering Ralston and the type of work they do and also the level of students that we've met at Ralston has been inspiring for us and gives me personally hope for the future, but hope for my own children who are coming close to that age where they will also have to enter the world. And the type of vision that Ralston is able to give the students this love of these ancient stories. But like Stephen said in his introduction, this is not about just analyzing the past in order to accumulate knowledge, but it really is finding the light in the past, but shining towards the future. And so what I want to talk about tonight is a specific image in the medieval world that is called the Last Judgment. It is one of the most complicated images in the canon of iconography. And I thought it would be interesting to look at that image, especially in the wake of the students having just read Dante's Commedia. And so, of course, Dante goes down into hell, ascends purgatory, ascends the heavens, all up into the prime mobile and into the presence of God. And, you know, of course, Dante wasn't making up the things that he wrote, he was synthesizing, he was bringing together a cosmological vision that the ancients had, that the medievals had in common. You know, that's why his poem was accepted so readily, because he was able to just pull these things in together so beautifully. And the icon of the Last Judgment does that also. That is, it is a kind of synthesis of Christian imagery and it pulls everything together into one image. This particular version of the Last Judgment is in a church near Venice on an island called Torcello. It is a 6th century church, but the mosaics were made in the 12th century. And so they have this kind of high medieval, Byzantine Venice approach. Some of the images in Venice would have been in the same style as well. Some of the images that you find in Sicily also, for example, would be similar in style. And the thing about this image that I like, particularly this one version of the Last Judgment, is that it contains three images, let's say, stuck together. So in the middle tier, you'll see it on the left there is the image of the Last Judgment itself. You can see is the Crucifixion. And then below the crucifixion is an image called the Anastasis, or the descent into Hades. And these three images are kind of stacked on top of each other as we look at it. I think there's a very particular reason why this is the case. And those three together will help us understand what it is that this image, this image of the Last Judgment, what can it tell us today? Right? Is it just this very strange, weird images of people getting devoured by worms? And everybody loves to look at the devils, especially, you know, all these kind of strange figures of angels and demons. And, you know, what is going on in this? Or does it have something to tell us? And I do believe that it does. I believe that the image of the Last Judgment is actually a way to understand how identity formation functions. And I would even go a little further. But looking at this image and kind of understanding this image can help us understand how thought functions. That is, how it is that we come to bring things together and how it is that they break apart this problem of attention. How it is that we're capable of having attention and how it is that our attention dissipates, is contained in this structure and all the weird things about it. Once we understand that, we can see how the Last Judgment is not just something that happens at the end, but it is a perpetual reality. It is basically an image of how reality functions. And it's not arbitrary to Think that that would be the case because it is an image of the end. And you have to remember how the ancients thought of the end of something is not just the moment when the time runs out, but it is the moment that shows you the reason for everything that came before. Right? We still use that way of speaking today. What is our end? That is, what is the purpose? What are the reason why we're doing things? And so the ancients would have understood the Last Judgment as being a culmination, right, As a kind of synthesis of all things. Towards their purpose, you could say. Towards their purpose, you could say towards their identity, towards what it is that they are and how it is that we discern what things are. It sounds very abstract at the outset, but you'll see that once we get into it, it's not so difficult. Now, one of the things to understand is that in church architecture in the Middle Ages, the images were placed very deliberately. It wasn't accidental. The reason why we put certain images in certain places, and in this case, it's quite simple. The church is a basilica, it's a long church, and in what we would call the east side of the church, that when you enter into a church, you look towards the end, you see where what's called the apse, which is the place where the priest is, you know, and it has a little half dome on top of it. And so in the apse is this image, which is an image of the Virgin with the child in her arms. And then on the western wall, which is the last part of the church, is the Last Judgment. So it's quite simple. There's nothing subtle about it. It's the beginning and the end. It's the child and the fulfillment. It's the rising and setting of the sun, right? There's this saying that the Son of Man will come like a. Like a lightning bolt from the east to the west, and that's why churches are directed eastwards, is that there is this movement. I mean, it's a cosmic movement. I mean, everything moves from east to west. The stars, the sun, the moon. There's this motion that the ancients understood as defining the beginning and the end. And so the way the church is structured is that you have this image of the beginning, and that's the image from which revelation comes, right? The priest is there, the Eucharist is being celebrated there. That's the source of identity. And especially in this particular church, which is a cathedral. A cathedral means that it's the seat of the bishop. It's the most important church in an area that is recognized as the cathedra, which is the throne of the bishop. The throne of the bishop is underneath, below here, and is down at the bottom there. And that is the source of authority. And it moves west towards the end. So the whole church is structured in that. That way which brings you up and down the register. Now, what's interesting about this image is that now the end is represented in three ways. It's represented as the end of Christ. That is the end in the sense of the crucifixion, Right? It's represented as the end in a different way, which is what we call the harrowing of Hades, where Christ goes down into death and saves the people that are caught there. And it's, of course, represented as the last judgment itself, which is now the finality of all things. And this is also a way to help understand how the medieval cosmos, or how medieval people thought about the world, they all fit into each other. That is, what's happening in one image is repeated in the other. And what's happening in one image is contained in the other image. It's like a little fractal bundle where things are just inserted into each other so that you get this unfurling of reality in this way. A little example to start with. You'll start to get used to it as we move into the image, is that the crucifixion is, of course, Christ dying on the cross, his mother on his right side, St. John the Evangelist on his left side, and then underneath him, there's this weird little image. If you look at underneath his feet. So that's a skull, and it's the skull of Adam. So you can see the blood of Jesus is coming down his feet and coming down his body and is dripping down onto the skull of Adam. So there's a whole legendary mechanism to understand why the skull of Adam was there and everything. That's not that important. What's most important is to understand the relationship that is happening there, which is that Christ on the cross is redeeming Adam. He is the new Adam. When we see the blood and water coming from his side, it's often described as the new creation, as the birth of the church, as Eve taken from the side of Adam. All of these analogies which are found in the liturgical text. But what's going on down here, right? That is what this image is about. And so the descent into Hades is the secret of what's happening on the cross. That's the way to understand it. So you have the cross, you have the crucifixion. And then what's secretly happening on the cross is represented in this image, which is Christ coming down into death. And now the cross doesn't hold him. He holds the cross as a standard, you know, almost like as a weapon, as this thing that he's conquered, actually. And he is going down into death and he is grabbing Adam and Eve. That's who he's going to get. So the two old people that you see are Adam and Eve. And then there are different people represented in different ways, the kings, King David and King Solomon and then St. John the Baptist, who is pointing to him. And who is. It was just there before. And then what you see are the dead, right? All these dead people in their tombs that are rising up, that they're coming into this moment where Christ is bringing everybody out of death. But that, like I said, is basically contained in this little image. So the, the Anastasis is contained in the crucifixion. Okay, we'll get back to these images later. But I just want you to start to think the way that the medievals thought and in a very similar manner, the whole Last Judgment is contained in the other images as well. The Last Judgment is a very complicated image. But let me point you to a few things right at the outset, just for you to understand how all of this comes together. Is that right here, right? This is again Adam and Eve. So Adam and Eve are now in the Last Judgment. The skull of Adam is in, is at the crucifixion. Adam and Eve are being taken out of death. And now they're being brought to the final end, the end of all things, where everything is being revealed and the judgment is, is happening. All through these images you have this same pattern where things enter into each other, where things kind of fit into each other and there's this reflection in different ways of the images above and below. And so as we move forward, I'm going to show you a few of these. But the first thing to understand is what is the Last Judgment? What is going on in this image? And so this is the first image that we know of, of the Last Judgment. This is a 6th century image from Ravenna. And so now we have Christ in the center and he has his hand out. He is pointing to the sheep, and on his left hand you have the goats. And so that is where the whole idea of the Last Judgment comes from, is Christ saying, on that day, on that final day, I will say to the sheep, come, enter into my kingdom. And I will say to the goats, leave away. Far away from me, right? And so that's the way to understand the basic idea of what the last judgment is. It's there are some things which are brought inside the sheep, and there are some things that are excluded, which are the goats. And so on the right hand of Christ, on his right hand you have the sheep. And on his left hand, that's what it said in the text. It says, he'll say to the sheep on his right, enter to the goats on his left, go away. Obviously, it's not the kind of thinking that we like to have today, but what I'd like to propose to you is that that is actually how all identity formation works. That is, anything that exists is necessarily a judge. Anything that has identity, right? Anything. I mean, anything like a cup, pencil, a baseball club, like anything that has identity is necessarily a judge because it is a specific identity. It necessarily has two things. It has an inside and it has an outside. It has things that belong to it and has things that don't belong to it. And sometimes there's a hierarchy of that type of participation. It's always often not necessarily a clear demarcation, but there is a type of hierarchy of participation in something, and then there is an outside. And so all things that have identity necessarily function as judges. And that's why in the ancient world, you know, for example, a very. A saint that I love very much, Saint Maximus the Confessor, he talks about the divine Logos, like in the Gospel. But he says, all things have a Logos. All things that exist have a name, a reason, a purpose. And actually all of those are the same. The name of something, the reason, the purpose for it. It's the reason why you see it in the first place. Why do I identify something as having identity, as having being, is because I can see its purpose. Even if it's unconscious, it didn't have to be conscious. It's like, if I know that if I have a name for something, it's because there's a reason why there's a name for it. I know what a bottle is because I drink water out of it, and it's a judge because. And I participate in that judgment because I don't want to get wet. So if there's a hole in the bottle, it's a bad water bottle, and I will exclude it from its participation in the identity of bottle. This is just how things work, and you just can't avoid it. Like, it just. This is just how reality functions. Whether it's your family Whether it's the school, all of these things all have this structure. And the Last Judgment. The way to understand it is it's the most extreme version of that. It's the one that takes it to the very limit of what you can almost tolerate in terms of understanding what identity formation is. Think of it like it's a cosmic version of every time I recognize something as having identity, but it's this massive, massive version of it. So what do we have in the image? We have Christ in glory at the center of the image. This is the Son of man, right? This is the prophetic image of the perfect man. So if you're not a Christian, in some ways, it doesn't totally matter for this conversation. Just think of it like it's the ideal person, right? As Christians, we believe that that's this person, but just as a structure. Think of it like it's the ideal of a person. It's the human, the highest human that you can imagine. The one that contains all that which is human in it. And that is basically the source of why we know that there's humanity. It's the culmination of all that is good about what human is. And that's here. And that's the judge. And why is it the judge? Because that is it. That's how we understand the good. It's like if we know what a good person is, then we inevitably know what aligns with it, what comes towards it and what is moving away from it. You can think about it in a. A sports team is always the easiest one because it's amoral, so it doesn't rub people wrong. You know what a good player, a good basketball player is. And that good basketball player becomes a standard by which we measure other basketball players. It just happens. And if you have one that rises up really high, then that standard gets higher. And all of a sudden the judgment becomes stronger, right? If I go to a basketball game for kids that are 13, 14, or if I go to a professional basketball game, I do not judge the same way because the standard of the participation is not the same. If I go to professional game, the standards have been lifted so high that I'm like, well, that's not Michael Jordan, right? There's always this judging, and this is something that happens inevitably. So imagine this is the perfect man who is there, and now he is signifying that he is judging the world. He is showing the right hand and the left hand and he is saying, to those on the right, come in. And to those on the left, move away. Those that don't fit with the ideal or aren't moving towards the ideal are pushed out. And those that fit with the ideal or moving towards the ideal are gathered in. So the structure of the image, this image of the heavenly man. And that's how to understand it, right? It's like, why is it a heavenly man? It's because he's the ideal. He's just higher than us. And it's a metaphor, but it's not. And that's how we think of things that are above us, that are more than us, that are higher than us. And so they appear in heaven, they come down from above. And that's how we recognize that they are the model by which we measure other things. And it's a very practical thing. There's nothing. It's not magical in any way. You know, if I am here and I'm in front of you and I'm above you right now, then I am the one who gives the standard of what is happening now, right? I am the measure of this event at this moment. And that's how this is how it works. If you have someone who rises above, even physically above everybody else, then everybody can see him, but not all of you can see each other. And so I can judge all of you, right? But you can't all judge each other. You can judge me. In this case, though, it's a little different. But just to understand that this idea of the heavenly man, right? And so the image is very ancient. From the very beginning of Christianity. We have these images that represent this relationship between heaven and earth. And they're not actually stories like this image. You see Christ above as the heavenly man, as the Son of man. And then you have the church which is below, and you have two apostles. You have St. Peter and St. Paul that are like two pillars of the church. That, again, is a very simple structure of reality. What is church, if you know what church means? It means not the word church, but what it translates. It means ecclesia. It means the gathering, okay? And that's how. That's how it works. That's how a body works. A body is a gathering of identities that fit with a higher identity. It's a gathering of things that are brought together into a higher participation. That's what a body is. Anybody like, anybody that you can imagine, whether it's a body of literary work or whether it's a tire or whatever, anything you can imagine as having identity. That's how it works. It gathers the things together into its head, and then it has to align with what the head is offering for it to be part of that body. Anything you can imagine always functions that way. That's why we talk about the church as being a body, as being a gathering, right? Things together that are then seen in light of the reason why they exist. And of course, now we're talking about a giant cosmic image. But that's just how things work. That's how all things work. It's a fractal idea. It's like once you kind of see the final judgment, the end of all things, in this image of the Last Judgment, you get a glimpse of how it reflects in little ways in everything that we do. Okay? And so there are different ways of representing it. This is one way. And the Ascension is also another image that has the same structure as the Last Judgment, in part because in Scripture, when Christ goes up, the angel says the way that he went up, he's going to return. But if you understand it that this is what this basic image, it's a head, something above, an image, reference, and then a gathering below of people that are looking up and that are pointing at it, they're saying, oh, it's that. That's the thing that makes us together. That's the person. That's the principle. That's the top that makes us understand that we are together. And then the virgin becomes an image of that body herself, because she is that for Christ. She's the one who gathered his body in her womb. It's pretty simple. She gathered the body in her womb. She becomes an image for the body itself. So different ways you can represent it. This is ascension. Sometimes it's just an ontological relationship. It's actually not seen at all. It's not representing anything. It's just the relationship between Christ above the virgin below, and the disciples gather together in the body. And it's analogous to a person with the head and the body. The head is the place where meaning comes from."}
{"episode_id":"SW - #341 - 2024-05-24 - The Last Judgement - The Culmination of Christian Symbolism","start":1689.9,"end":1690.18,"speaker":"Stephen Blackwood","text":"Right?"}
{"episode_id":"SW - #341 - 2024-05-24 - The Last Judgement - The Culmination of Christian Symbolism","start":1690.18,"end":2644.52,"speaker":"Jonathan Pageau","text":"The head is the place that we recognize somebody by. I don't usually recognize somebody by their shoulder. I tend to recognize them by their eyes, by their expression. So the head is the place of meaning. It's the place of purpose. It's the place where we recognize identity. And so it's normal to use that type of imagery together. Now, the one thing I want to say, and it's important to say this because it's already. It's. It's already kind of frightening to talk about the Last Judgment this way, is that there is a way to understand the idea of the right hand and the left hand of Christ as not just being good, bad, because that's how we tend to think about it. It's like, you know, though that which comes towards the inside is good, that which moves towards the outside is bad. But in the very structure of this image, you'll see that that is not the case, that moving out from the identity is not always bad. Because obviously we don't believe in the Monad like we believe that multiplicity is necessary and that is good. And so there's a sense in which that which appears on the left hand of Christ will often represent change, will represent, let's say, a kind of wildness to it or a kind of difference. And that which is on his right hand will represent unity, will represent identity, because it's that which comes towards identity, right? So it's all not always negative, not always positive. A good example is in this case here. This is an image. It's a deisis, which is again, the Son of Man in the middle and two people on the side. And now on his right hand he has the Virgin, and on his left side he has John the Baptist. Now, comparing those two is useful to understand the difference between the right hand and the left hand. One is secret, one is covered, one is quiet. And it's kind of like this inner reality, this mystery of the inside. And then the other one, he's out in the desert, he's wearing animal skins, he's got crazy hair, and he's screaming to everybody to repent. So that's a good, like a basic way to think of it. If you look a little bit again to the right, you'll see St. Peter, who's here, and then you'll see St. Paul, who is a little bit further down. They are again, the same that are here, the two pillars of the church. St Peter and St Paul. They are again here, which is. You have St Peter and St Paul. This is the most interesting one, because St Paul was not at the Ascension. So why is he there? Why is he in the image of the Ascension? And it's because it's representing a structure of reality for you. It's not just saying this is not just an event, this is like a pattern or this is like a. It's a way for you to see reality through these images rather than just a kind of didactic thing. And so who's St. Peter? Right? St. Peter. He's the rock, he's the foundation. He's the apostle to the inside, right? He's the apostle to the Jews. In that case. And who's St. Paul? St. Paul is the apostle to the Gentiles. But he's not just that. He's also like the 13th apostle, like semi legitimate, like I'm a Christian and everything. But, you know, it's like he kind of self justifies his existence as an apostle. Like, he's interesting. If you look at him and thinking about him as the left hand, you could say of Christ. He talks about himself. He says that he is a shape shifter. He says that I'm all things to all men. So he actually says I do not have a specific identity, right? I am in some ways shifty in my existence. He calls himself the aborted apostle. He uses all these really strong terms. He says he's a fool. I'm the fool for Christ. Okay? So he is the opposite of reason. He's the opposite of. He has that. And in this case, it's not bad at all. It's actually wonderful. It's actually great. It actually is the fullness of being to understand that this movement towards the inside and this movement towards the outside is this breathing in and breathing out of being. That is just a normal part of how existence functions. Okay? And I think that's important to say because we always sometimes get too caught up in the moral question and thinking that it's just good, bad. But clearly in this image of the Last Judgment, that is not the case. And the importance of having St. Peter and St. Paul, like I said, not just in the Last Judgment, but in all these other Christian images is there to help us see this relationship, right? And if you think about the two apostles, you'll start to see interesting images of what it is that they represent. So what is St. Peter's sin? Pride. Right? What is pride? Pride is excess of identity. That's what pride is. So you can see like. And what is St. Paul's sin? Right? It's the thorn in the flesh, okay? And so you can see in their character how they, you know, both in their good side and their bad side, they really represent these two aspects of reality. This idea of gathering in the multiplicity, gathering in the identities towards purpose, but also loosening the identity and kind of letting things have their own particular existence, right? And that's necessary in everything we do. It's necessary in any team, any family. You have to find that balance between breathing in and breathing out, right? You can't always be moving towards unity, or else you cripple, or else you become fragile. And you can't obviously always be moving towards multiplicity. Because at some point, your identity stops to exist. That's called decomposition. And when things decompose, then they cease to be the thing that they were. The idea of the Last Judgment is that it is this moment where the ideal man is judging all of humankind, is judging all of what it is that is good and bad about humanity and is showing the consequences of what that does, of what that is. And he's calling everybody towards the resurrection. And you can understand the resurrection again as this finality, as this. This is all that you are. So you're a person. The resurrection is everything that you are is now gathered into something. It's. It's gathered into the end, is gathered into the finality. And that includes body, it includes your soul, it includes all the aspects of you. But now all of them kind of in this moment that is not chronological anymore. That is like the end of time and that the end of all things. And so it shows what things are. And so what we see in the image is you're seeing the angels calling all the dead out of their abode. And so the animals are regurgitating the people, regurgitating their prey. And on the other side, then you have again the monsters, the sea monsters, regurgitating their prey as the angels are calling, right? They're calling us all to be gathered back into the unity. And so this is, of course, an image of the movement of multiplicity into unity, right? It is the movement of that which is fragmented, that which is broken, and that which has been eaten by animals. And so for those that have read Dante will know that the animals represent that which is not human. Sometimes it can represent aspects of humanity. It can represent the passions. Often it represents an excess of an aspect of us. And so those excesses, you could say, or those broken aspects of humanity are being given up, right? And they're being gathered back together to form a single body. Right? To form a body again. Right? And that is represented in another way next to the angels calling the dead out of the earth. As the angel that is scrolling all the stars back together, right, he's scrolling the heavens. You can see he's got the scroll of the stars, and he is basically wrapping them back together into a single roll, this gathering of multiplicity back into one. There's just different ways of representing it, represented as the bodies, represented as the stars, but it's this gathering of all things back into their center, okay? Back into the one. This is a very interesting image. So this image is so you can see. I'll show you where it is in the image, it's down here, right? So it's here. This is called the hemasia. I don't know if I'm pronouncing it right. I'm with a bunch of Greek speakers. Makes me feel a little embarrassed, but that's how I say it. And what the hetimasiyah is, it's the prepared throne. It's a very interesting idea. It's the idea that the throne is prepared for the return of the heavenly man. And so the ideal is coming, right? The reason for things is coming, but in order for it to connect, you have to get things ready. You have to prepare the throne for the arrival of the king. And now you see again Adam and Eve being brought to the foot of the throne, you know, because in many ways they are the throne, right? They are the body that is gathered. They're an image you can take. You take the first man and first woman. It's a good way to get everybody in an image without having to make billions of people. It's a good way to do it. Take the first ones, put them there and say these. All of humanity is gathered together as the throne. You can imagine it as a throne. You can imagine it as a city. Imagine as a bride. That's often how it's represented in, In. In scripture. And it's. And this union of heaven and earth and of the head and the body and of the. The. The heaven and earth are represented as a sexual union. All of these different images are appropriate to understand the idea of gathering things together so that that which is above can come and encounter it, right? It reproduces the text in Genesis 2, where God gathers the dust together and he blows air into it. He takes heaven, puts it inside, like gathers a bunch of stuff, and then puts heaven inside. And that's how things exist. That's how everything exists. Everything exists as a gathering of body that has purpose inside it. You need a reason, or else you cannot recognize things as having identity. They have to have something which brings multiplicity into one. Now, one of the aspects of the Last Judgment, and, you know, you see it of course, here quite a bit, is so now you have the devils that are here, and you have the devils that are here, and you have the angel that is here, and. And what are they doing? They're weighing the soul, right? And so they're actually deciding, right? They're basically judging. They're participating in the judgment. They're judging which side you're going to go. Are you going to go on this side? Of the right hand, which is the one that gathers, are you going to go on the side of the left hand, which is the dispersal and the breakdown and the decomposition? And so this idea, right, it's one which is so universal, it's everywhere in culture. And so it's just this. It's exactly this. And everybody experiences this all the time, right? It's like there is something in you, a wild part, a part that is going to break everything or however else you want to think of it. But there's a part in you that is pulling you towards dissolution. And there's an aspect of you that is pulling you towards one, that's putting you towards unity, towards good things. St. Gregory of Nyssa, for example, you know, he's early church father, fourth century. He said, at birth, all men are given an angel and a demon. And this is not just Homer Simpson, this is very old, like, all men are given an angel and a demon. And that's what we now call. Come to call a guardian angel. But, you know, we've forgotten about the guardian demon. We don't like that one. But basically think about it as the aspect of you which is pulling you up, the best aspect of you, because you can see it, right? Everybody can see it inside them. It's like St. Paul would say, christ in me. What is Christ in me? It is the aspect of me that I can recognize as moving towards that which I know to be good and that I know to be the truth and that which gives life. But then there's also, of course, the flesh. That's the way St. Paul talks about it, right? That I do the things that I do not want to do, that the flesh pulls me away from that. So you can understand it as above. And below is a good way to understand it, right? Because it's a very simple way to represent it. Because above are the patterns and the lights. And you don't hurt yourself much with what is above. Although, yeah, it's true that there are storms, let's say higher up from that you have the stars, you have the patterns, you have the patterns of reality. You have the light which comes up and shines, makes everything visible. And then below you've got things that die in darkness and decompose. And so the idea that hell is below is a very, very intuitive reality. Like, it's very simple. You don't have to actually work too hard to understand that things decompose down here, right? And the specific and the particular is down here, and the universal and the one is up here. And you can do it if you want. Like, go into a field and put your face on the ground and you'll see that you see very few things, right? You just see a bunch of grass and maybe a few bugs, you know? But if you go up a mountain, then all of a sudden all that multiplicity gets gathered and gathered and gathered into one until you can see the pattern and you can kind of see the layout, okay? So this idea that heaven is above and that hell is below is very reasonable. Everybody should believe that it's not a. Okay, so, so below, down here, now you have the two. Like the two sides, which is. You have the gathering here and then you have the dispersal here. And the gathering is represented as paradise. Now, paradise is not heaven. It's really important to understand the difference. Paradise is not up there. Paradise is the gathering down here, right? It's the garden. Paradise is Eden. It's the good which is manifested and gathered in the world. So what you have is you have the image of the cherub that is on the door of the garden. And it's usually. I don't know if you can see it here. It's holding a lance. Often it's holding a sword, like a flaming sword. We see St. Peter, who's opening the door right, to paradise. And then in paradise, there are three people. Abraham, the virgin, and. Who can guess who the third one is? This guy. So I'll tell you, it's a. It's a good thief, okay? But Abraham and the Virgin, they like. It's really important to understand they're not metaphors for paradise. They are paradise."}
{"episode_id":"SW - #341 - 2024-05-24 - The Last Judgement - The Culmination of Christian Symbolism","start":2645.32,"end":2645.8,"speaker":"Stephen Blackwood","text":"Okay?"}
{"episode_id":"SW - #341 - 2024-05-24 - The Last Judgement - The Culmination of Christian Symbolism","start":2645.8,"end":3265.36,"speaker":"Jonathan Pageau","text":"When Christ talks about the vision of Lazarus and the rich man, he says Lazarus is gathered into the bosom of Abraham. That is what paradise is. It is to be gathered in the thing from which your multiplicity originates, right? To be gathered to your fathers is to return back to the place where you were one with that which is around you. That's what the Garden of Eden is, the top of the mountain. It's the place where all multiplicity comes together into one. And Abraham for the Jews is paradise because he is the source of unity for their nation. He is the place where they recognize each other as being one. Okay? That's important to understand. And the Virgin is of course, the same for us. She is that which gathered the body together. She represents the gathering of the body. She represents the throne. She represents the land. She is the mountain. She has all that type of imagery around her because she gathered the Logos into her womb. The thief is There to remind you what I told you at the beginning. Beginning, which is that all of these image go together. Because what's happening in this image is already happening in this image. It's all already in that image. Because we forget there isn't one cross. There are three crosses, right? And there's Christ in the center. And there is one who recognizes him as the source of value, as the source of virtue, as the source of innocence. And there is one who does not recognize him and mocks him and derides him. And so the Last Judgment is already happening on the cross. It's already there. It's all encapsulated into that one image. Not just that, but this also. What is Christ doing? Why are these characters there? He's saying, this is your mother, this is your son. He's saying, this is how you're together. This is why, this is your relationship. This is what makes you not two, but one is, I am giving you an identity right now. So Christ on the cross does everything that the image of the Last Judgment does already. And that's why this image is so astounding, right? This image, it's like all of this is gathered together into that one image at the top. And it's just this unfurling of the consequences of one action. Now why does it matter? Why, why, why the cross? What? You know, it's like, okay, so I can, I can understand this, right? I understand the idea of the ideal man. I understand the idea of the, the, the top of the pyramid, you know, the head honcho, the president, the, the top guy, the captain of the team. I get that. That's easy to understand. We all know we look up to these characters that are heroic, that kind of have that brightness to them, and they kind of gather us into their leadership, right? So why this? Why, why this? Right? And that is the. That is, the mystery of identity is captured in that image. And that's what all of you that have read Dante have discovered, is that identity doesn't just hold together. That's pride. That's no good. Identity is always self giving. It always empties itself necessarily. And there's nothing magical about it. It's a very. It's almost a technical description of how things work. So for my steering wheel to have its identity, it has to offer itself to the car. It has to, or else. Who cares about a steering wheel? If I just have a fetishized steering wheel hung on my wall, it's irrelevant. All things give themselves to their higher participation. The world is made of sacrifice. And this is what's so fascinating about understanding. And this is also why, you know, you hear all this talk about Christian nationalism, like you've probably heard all this, this kind of rumble about it. But there's something about Christian identity which is very particular, which is understanding that. Which is understanding that identity always gives itself. And it gives itself in two directions. It gives itself up necessarily, like I said, the steering wheel has to give itself to the car. And the car has to give itself to the fact of driving. And the fact of driving has to give itself to the existence of towns and of people living together. All of these things have to stack up, all these goods to give themselves up always. And that's what you see in Dante is that ultimately that leads to something that is beyond, beyond the world. But identity also has to give itself down, right? It has to have compassion. Is the best way to understand it is that for there to not just be one car, there has to be flexibility in how car exists. It has to give itself to some extent, has to loosen itself so that you can recognize multiplicity as well. So identity always gives itself up, but also always gives itself down. And that's what's amazing about this particular image of the last Chajima. It's the only one that. That I know that has this structure where they take these three images and stack them together in a way that you see how they kind of fit into each other. But that is what is so, to me, astounding about this particular structure. So we'll save the worst part for the last. So we have to talk about hell, obviously, a little bit. The way to understand the bottom of the left hand register, the way to understand hell is. Is exactly the problem of fragmentation. And in some ways, the problem of identities and love and desire that are out of control and what. And what they do is they're not sufficient, right? And so sin, that's what sin is. It's like the thing that you aim towards. If it's the wrong thing, it's not sufficient. If it doesn't give itself up towards other identities, then it becomes insufficient. It eats you, devours you, it burns you, right? It destroys you. This is not something that happens at the end of the world. It's something that you can experience every single day, right? It's like if you give yourself to something so exclusively, or if you let something take over your life so exclusively, and you don't let it open up and participate in the other goods that are available to you, then it will eat you, right? It'll Be like worms that are constantly eating your body. It'll be like fire that is burning. Or it'll be like the cold that freezes you and makes you impossible. Impossible for you to go forward, right? We know that it's easier to see that with people that are addicted. When you know people that are addicted to something, you see it clearly, right? It's like this thing, this drug, this alcohol, this whatever has now taken over your life and is destroying you, but you persist in it and is basically devouring you. But the truth is that that can be true anything. It's not just can be true about work, it can be true about the love of a person, right? You can idolize someone and love them so much that it will destroy you. We've met people, everybody's met someone that has let that happen to them. So it's actually like a coherent description of how reality works, which is that if you are captured by things and you don't participate in these higher goods that lead up to the heavenly man, then you will burn, right? It will happen inevitably. And so. But the one thing that I want to show you that's actually I like about this particular image of hell is that all the people of hell are all the elites. It's like monks and emperors and bishops, you know, regular people don't go to hell, just important people. I kind of like that. And this can be represented as an upside down gathering, right? As a fetishized gathering, like a. Like a parody of the right hand, you could say. And so this is the Antichrist who is on the lap of the devil, as if he was Christ. He looks like Jesus, actually. He's made to look exactly like the way that you would represent the child, Christ in the hands of the mother. This is exactly what I tried to tell you. It's like if you are captured by something that completely takes you, it's almost like an inverse. It's a parody of the right hand. It's like this, this concentration of identity in the wrong place that then devours you. But what's beautiful about this is that you have these three. So if you look at, you have the Antichrist on the devil's lap, and on the other side you have probably Lazarus. It's not 100% clear who it is, but it's probably Lazarus. It is a. A soul that is saved and is in the bosom of Abraham. So think about it, like, show you the full image again. Okay? So it's actually quite beautiful because down here, right, you have Lazarus. That is that is contained in the Abraham. Here you have the Antichrist that is on the devil. And think of it that across from that, if you were here and you turned around, then you would see Christ on the virgin's lab. So this is what you would see. So you have this beautiful kind of structure of meaning where all of the things kind of come together in the beginning and the end. And so, I mean, that is what I wanted to kind of help you see is to maybe look at these types of images again with fresh eyes, understand that the medieval, how they understood reality and the way that these images function as a kind of map of reality, the same way the gospel stories, the Bible stories, or the ancient myths function. And if we see them that way, we can get quite a bit of insight into how the world works. So thank you for your attention."}
{"episode_id":"SW - #341 - 2024-05-24 - The Last Judgement - The Culmination of Christian Symbolism","start":3274,"end":3287.37,"speaker":"Stephen Blackwood","text":"Question I have for you is beautifully showed in this image. How things stack up from. From the. From the many to the one. How do we find our way from division back to unity?"}
{"episode_id":"SW - #341 - 2024-05-24 - The Last Judgement - The Culmination of Christian Symbolism","start":3288.25,"end":3451.44,"speaker":"Jonathan Pageau","text":"I mean, start with yourself. You know, that's probably the best thing to do. This whole image could be described as an image of the soul, right? And so you could actually understand that, you know, this. Sometimes it's not there in this one, but sometimes there's actually a person here in between the devil and the angel that's being weighed. And so inside you, right, you are. All of us are made of multiplicities. Just like together, we make multiplicities with others. And so the best way to come back towards unity in the world is to come back towards unity in yourself, you know, and so Jordan Peterson talks about cleaning a room. It's actually a great. It's a great simple thing is to say that if actually it can scale from the ground up, and that a person that is transformed and that is moving in truth towards virtue and beauty will have reverberations around them. And then the world can start to clump again. And I think, for example, what Ralston's doing is a great example because they're saying, we're not here to. This is not about partners policy. Like, we're not going to change the entirety of America. What we're going to do is we're going to create a paradise, and we're going to pull in the people that are capable and willing to enter into the right relationship with the vision. And that is something which will then reverberate into the future in ways that is far more real than if we just changed the law. Because when you change a law, you don't change anybody's heart. If people think that this, whatever culture war thing is going to be won by putting the right number of people on the Supreme Court from whatever side you are, that's absolutely ridiculous. You'll just increase polarity and division and fight. But transformed people, that's real and that is undeniable when you meet someone that is transformed. Stephen and I had the chance to go to Mount Athos together, and we were able to meet the abbot of one of the monasteries. And the man was just. I don't know what to say. I mean, he was glowing. Not physically glowing, but he was clearly a transformed person. And it hushed everybody. You know, it's like everybody was reduced to silence. And I think that, you know, we don't often meet people like that, but we meet little versions of it, whereas we. We encounter people that have that light and that spark and are glowing, and we have to. That's the way transformation happens. I believe it."}
{"episode_id":"SW - #341 - 2024-05-24 - The Last Judgement - The Culmination of Christian Symbolism","start":3451.84,"end":3466.76,"speaker":"Stephen Blackwood","text":"Some of what you said reminded me of Plato, both in terms of. Especially in his metaphysics, but to a lesser extent the politics that he describes in the Republic. Is that just a coincidence or is."}
{"episode_id":"SW - #341 - 2024-05-24 - The Last Judgement - The Culmination of Christian Symbolism","start":3466.76,"end":3550.87,"speaker":"Jonathan Pageau","text":"There any kind of direct influence there? No, I mean, I think that Plato is definitely part of the. The. The canon of the. Of the West. And all of you know, I'm very in line with Justin Martyr, that is, that I believe that all things that are good are from God, that is that, you know, Justin Martyr talks about those that were Christian before Christ even, and he talked about the philosophers as being images of that. And that's the way that I see it. I think that Plato, like. Like all the ancient thinkers is. Is someone that. How can I say this? That we have to kind of go through with a. The certain amount of discernment and wisdom. But definitely the basic description of reality is quite. Is quite powerful. But I would say that one of the things that I love about the image that I'm showing you is there is this aspect that you find, this kenotic aspect that you find in Christian metaphysics, which I think is also very powerful. This idea of this emptying and the trinitarian language of the person's emptying themselves into each other is a very powerful way to avoid the problem of the tyrant, you know, and of the. Of empire in the negative sense, because sometimes Plato's ideas can seem to lead to that. You talked about identity as this exclusion of something and inclusion of something."}
{"episode_id":"SW - #341 - 2024-05-24 - The Last Judgement - The Culmination of Christian Symbolism","start":3550.87,"end":3553.39,"speaker":"Student","text":"It was a really interesting way to think about it."}
{"episode_id":"SW - #341 - 2024-05-24 - The Last Judgement - The Culmination of Christian Symbolism","start":3553.39,"end":3777.75,"speaker":"Jonathan Pageau","text":"And you mentioned pride as an excess of identity. Right. Do you mean excluding more or including more? When you say excess, you said that pride is an excess of identity. So is it that inclusion or that exclusion? It can actually be both. It can be a desire to make everything the difference between unity and uniformity, for example, is a good example. It's like unity is not uniformity. Unity is actually a variation that comes together towards unity. So pride can be the desire to make all things uniform in a way that is absolute. But pride can also be the desire to include things that you think you can include, but that you can't, and that you thought you could, but then it rips you apart, you know? So those are so, like, you can be prideful and take on too much. Right. And you can. There are different ways, but it can be either. I think I just had a question about the image there of Christ on the throne, and I noticed there's two wheels below at his feet, and then there's something that looks like a rope or a tail. Yeah, yeah. Let me find a better picture down to, I guess, to help. Yeah. So could you. So when it is. Yeah. So this is the image of the Son of Man. And one of the things it's trying to do is to. Trying is to gather in all the images that are there in the Bible. And so in the book of Ezekiel, there is this description of. Of the heavenly figure, the heavenly man, that. That descends onto a throne, a chariot made of angels, okay? And so made of cherubs. And so that is what you're seeing there. So you see, you see the. The cherubs, right? These two. These angels with four wings. And then you see these wheels that are described by Ezekiel that have eyes all around them, right? And this is what is being represented, by the way, this is also represented at the Ascension. Okay. This one is even clearer because you see the. The wings have all these eyes on them. And you see the four. The four faces, right? You see the four figures of the lion, the man, the eagle, and the ark. And then you see the wheels next to them. And see what. If you. Once you start to see it, you'll start to see it everywhere, right? Here are the four figures. Here are the wheels, okay? This is from Egypt. The other one is from Syria. The other one is from Italy. This is a unit. It's a kind of universal language. This that's coming from Christ's feet is the river of fire. A river of fire that descends all the way into. Into Gehenna, right? So see it. That. That river, interestingly enough, is an Image I didn't show you, but it is interesting. In Russian iconography, that river of Fire becomes a snake, interestingly enough. And then the snake, he is this. So he bites the heel of Adam, and then the snake comes all the way down into hell. But that snake now is both going up and going down. It's not just going down into hell, it's like the ladder of ascent at the same time, this idea that there's motion between the different aspects. And so as you move up in the virtues, you're moving up the snake, and as you go down with the vices, then you're going down. It's like Snakes and Ladders. You know that game. It's like that in those images."}
{"episode_id":"SW - #341 - 2024-05-24 - The Last Judgement - The Culmination of Christian Symbolism","start":3777.75,"end":3782.15,"speaker":"Audience Member","text":"How do you know that? It's Peter and Paul in various places. Adam and Eve."}
{"episode_id":"SW - #341 - 2024-05-24 - The Last Judgement - The Culmination of Christian Symbolism","start":3782.71,"end":3819.93,"speaker":"Jonathan Pageau","text":"Well, Peter and Paul, they're easy to recognize. The Peter has a white beard and he often has curly hair. Paul is bald and he's got a long kind of dark beard. So he's actually easy to recognize. And also because in some versions, although not in the east, for example, we actually write the names. So you actually have the names written next to all the characters. So it's a good way to know that that's the character. But we can still transpose it into the west, where that tradition of marking the names was not really maintained. But you can know that that's who it is, because in other versions, it's literally written their name underneath them."}
{"episode_id":"SW - #341 - 2024-05-24 - The Last Judgement - The Culmination of Christian Symbolism","start":3820.41,"end":3831.8,"speaker":"Student","text":"When you mentioned that Jesus is the perfect man, and you say that all of us are tending to him, is he then the man by which all men shall be judged?"}
{"episode_id":"SW - #341 - 2024-05-24 - The Last Judgement - The Culmination of Christian Symbolism","start":3832.04,"end":3859.3,"speaker":"Jonathan Pageau","text":"Well, that's what the implication of the image is for sure. Clearly the implication of the image is that that man who sacrificed himself is the one that judges all things, and in some ways can judge all things because he did not take glory for himself. That's the difference between just the emperor or the judge, in the simple sense, and this image of the man who has given himself and therefore is allowed to be the heavenly man."}
{"episode_id":"SW - #341 - 2024-05-24 - The Last Judgement - The Culmination of Christian Symbolism","start":3859.62,"end":3872.5,"speaker":"Student","text":"So you said something about St. Paul on the left hand side, our right hand, and it was a little confusing. I don't think you meant to say that he was with those that are cast into hell. No, because he's on the left hand."}
{"episode_id":"SW - #341 - 2024-05-24 - The Last Judgement - The Culmination of Christian Symbolism","start":3872.5,"end":3877.95,"speaker":"Jonathan Pageau","text":"No, I was trying to show that the left hand has multiple aspects. And it's not just good, bad."}
{"episode_id":"SW - #341 - 2024-05-24 - The Last Judgement - The Culmination of Christian Symbolism","start":3878.03,"end":3878.43,"speaker":"Student","text":"Right."}
{"episode_id":"SW - #341 - 2024-05-24 - The Last Judgement - The Culmination of Christian Symbolism","start":3878.59,"end":3898.91,"speaker":"Jonathan Pageau","text":"That's important because we can tend to think that. And it's okay in, like, a basic idea, the way Christ talks about the sheep and the goats. But in the iconography and in the way that the language started to develop, then the idea of the left hand of Christ having also a useful positive side, you know, which is multiplication and division and difference."}
{"episode_id":"SW - #341 - 2024-05-24 - The Last Judgement - The Culmination of Christian Symbolism","start":3899.23,"end":3909.58,"speaker":"Student","text":"That level where you have Peter on the right hand and then Paul on the left, would that then be like all the saints called with Jesus to sit in judgment?"}
{"episode_id":"SW - #341 - 2024-05-24 - The Last Judgement - The Culmination of Christian Symbolism","start":3909.58,"end":3910.1,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #341 - 2024-05-24 - The Last Judgement - The Culmination of Christian Symbolism","start":3910.1,"end":3910.66,"speaker":"Student","text":"Okay."}
{"episode_id":"SW - #341 - 2024-05-24 - The Last Judgement - The Culmination of Christian Symbolism","start":3910.74,"end":4081.07,"speaker":"Jonathan Pageau","text":"That's what it is. And it is this idea. And, you know, and I think to me, this is actually a very useful. You know, it's a useful way to deal with the problem of Plato, for example, right? Because this idea of the forms, you know, it's like, okay, so where are these forms? You know, they. They just exist completely independently of man. And the. The Christian answer is no. The Christian answer is they exist in him, right? They exist in the one that is the. Is the source of reality. So, so then you get these weird things in medieval iconography, which is that when they show the creation of the world, they show Jesus Christ creating the world, which is kind of just, okay, well, that's not possible, right, because he comes 2,000 years later. But it's really understanding the idea that this is the world of meaning exists through man, that you don't need to just posit forms outside of consciousness. But it also doesn't mean that it's idiosyncratic and it's like anything goes, but that. That consciousness is a way by which human. The world exists. It is in some ways the filter to which whatever the forms are, are made subject to. And so the idea of. So it actually, to me, it solves a lot of problems, like metaphysical problems, but also, even in terms of science and a lot of the questions we ask now, so the idea that now we, all of us are called to enter into that, like, we can become principalities. We can become like the gods of the Greeks, right? You can become gods and you will sit in judgment with. With the, the. The heavenly man over reality. And it's like. It sounds weird, but like, it just. It's. It just means that you can become a standard, right, which others live their life, right? You can become an image. You can become something, a star by which other people judge their own actions, right? And that's actually just true. It's just how it works. It's how humanity functions. Like, we have things, people that shine for us and that become the standard, the judge. And so this is. This is a cosmic version of that, which is that, you know, in the end, all of this will be judged by the heavenly man and his. Those that he has gathered in with him? You want to think about it that way. But that's already why we have things like patron saints. You know, we have all this. That's why we name cities after people. That's why we named. That's why we named roads after people, because they become like principalities that give identities to things. And we want to live in their example by remembering them and by giving and by putting their name into the landscape even."}
{"episode_id":"SW - #341 - 2024-05-24 - The Last Judgement - The Culmination of Christian Symbolism","start":4082.59,"end":4104.99,"speaker":"Student","text":"I really enjoyed your talk, and I've been enjoying following you on YouTube and stuff. And I'm kind of curious. Is there any good resources or is it possible to kind of discover, like, a unity from the symbolic way of talking and like, the Thomistic, Aristotelian way of talking, since Plato's come up twice like Aristotle? Is it possible?"}
{"episode_id":"SW - #341 - 2024-05-24 - The Last Judgement - The Culmination of Christian Symbolism","start":4105.71,"end":4147.12,"speaker":"Jonathan Pageau","text":"I mean, I'm not. It's complicated. I'm not. I definitely am an Eastern Orthodox person. I have my line, you know, and the saints that I love. I don't know Thomas well enough, and I don't know his work. And I also am careful because I know that Thomas and the Thomas are not the same. And so I don't. I try to be. To be careful, but I would. I do believe that in some ways, Christianity is a. Is. Is a synthesis between something like Plato and Aristotle. And it's very right in the. In the image of the incarnation. It kind of plays that role and it seems to play itself out in the. In the story itself. So I would say probably, yes, but I'd be careful myself to talk about that."}
{"episode_id":"SW - #341 - 2024-05-24 - The Last Judgement - The Culmination of Christian Symbolism","start":4147.52,"end":4226.13,"speaker":"Audience Member","text":"Thank you again for such a stirring talk and for guiding us through this mysterious image. And I was particularly struck by the throne and this. That makes up the cathedral that is the symbol of the giving of the self to another. So either we have these figures becoming as children sitting on the laps of Mother Mary, or Father Abraham, and then we have others becoming as father, as mother in giving up their own bodies for the glory of another. And yet, all throughout these images, and all throughout, especially religious art and iconography, we have these male and female symbols that make up the one that represent this sublime unity and this ideal. And I'm curious to hear your thoughts on how we can translate the masculine and feminine symbols as we, as males and females, respectively, try to make sense of our own inner world, to order our own identities, to which are, of course, multiplicities of both."}
{"episode_id":"SW - #341 - 2024-05-24 - The Last Judgement - The Culmination of Christian Symbolism","start":4226.69,"end":4457.7,"speaker":"Jonathan Pageau","text":"So the structure, like the basic structure, is there. It's there in Genesis 1. That's how the Bible starts, God makes heaven and earth. And this heaven and earth, this duality, this original duality then gets reproduced all through the Genesis narrative and gets repeated all the way down to then man separating, separated into male and female. And so it's like. It is basically the structure. It's just the structure all through the text of Genesis 1. And it happens all through. And like you and like you said, in the images that we find, we find this relationship. I like this Coptic image a lot, right? This basic structure, right, of the head or the masculine above in heaven, and then the mother below with the. The child as the hidden aspect of heaven in the world, right? The spark is kind of hidden in things, but also the one that gathers together, right? That gathers together the multiplicity into herself. You could say, if you've ever seen this image, it's a beautiful Catholic image. You see the Virgin in statues and she has her cape open. And then in the cape you have all these people that are kind of in her cape. That's a beautiful image of that kind of gathering. So the first thing to say that's important to say is that we have to be careful not to reduce a person to their gender. That's the first thing. That we're all people made in the image of God. And that we are all called to be in the image of Christ and to be like Christ. And that in Christ there is no male, there is no female, there's no Greek, there's no Jew, right? That we have this idea that in the unity there's a way in which we can all participate into the story. But there is also a manner in which we do play those roles in society, because then there we do also. We all also are male and female. And that has a reality that we have to account for. If we pretend like it doesn't exist, then the world stops to exist. It's actually quite simple. If we pretend that male and female aren't different and that they don't have complementary roles, then there's no more generation. Basically, things, the being ceases, right? It's pretty. It's like that's why it's described that way in Genesis 1. And that's just how the world functions. And so we have to take that seriously. But there's also a way in which we can all play the different roles in different perspectives, right? And so that's also important to understand is that there's a manner in which we are all, let's say as Christians, I am the bride of Christ. Like we are all the Bride of Christ. We all have a feminine aspect to us in which we are called to give ourselves to higher purposes and to higher things. And there's also a way in which we, all of us, whether it's male, female, whatever, sometimes we play leadership roles where we have to guide multiplicities towards purposes, and then we play roles that are masculine, that are heavenly roles in that sense. And so it's important to understand it fractally and to not ignore the different levels. To me, that's the key, is that there are moments in history where we try to reduce the person to their gender, and then everything becomes solidified like that. And there are moments where we do the opposite. Now, we mostly do the opposite, where we just kind of collapse everything. So I think the way to understand it and the best way to participate in it is to see it fractally. It's like I play this role in this context, and then there's this an understanding, the difference between that which guides and gives purpose, and, let's say, gives direction, and that which gathers and gives itself up to that purpose. So let me just."}
{"episode_id":"SW - #341 - 2024-05-24 - The Last Judgement - The Culmination of Christian Symbolism","start":4458.1,"end":4521.32,"speaker":"Stephen Blackwood","text":"One final question, Jonathan. After your masterful explication of this image from the church in Torcello, I actually had the great privilege of going to that church. It's just in the sort of. It was the beginning, really, of what we now call Venice, but they moved to what we now see as the main town. So you've got to take a boat to get over there. And I had the great privilege of seeing this image, and it was very moving to me. But I have to. To be honest, when I was looking at this, I couldn't see a tenth of the things that you have explicated for us. I don't have the knowledge of symbolism, of iconography and so on. And so the question I want to ask you is really, how do you learn to read? And I mean, of course, you know, how do you learn to get better at reading images? Our students are reading some very difficult books. We're hoping to teach them something about how to read difficult literature and philosophy. But that's not just a skill for this, but it's in a way, a way of learning to read reality."}
{"episode_id":"SW - #341 - 2024-05-24 - The Last Judgement - The Culmination of Christian Symbolism","start":4521.56,"end":4648.88,"speaker":"Jonathan Pageau","text":"Analogy is the key, in my perception, is that when you're interpreting images, for example, it's very dangerous to get caught into the one image, because one of the things that happens in language and in iconography, for example, is that the images exist together, right? They rhyme. They're like a. They're kind of. Kind of massive poetry. And so if you can be able to look across from the different things that you're learning, then you start to see the rhyming. And once you start to see the rhyming, then first of all, there's a joy in, like, just. In just kind of playing into that rhyme. But then there's also a kind of coherence that appears. That is wonderful, because all of a sudden, you have the capacity to read something that you've never seen before, because you know the pattern so well. You know that this is how this is. These are the basic patterns of icon, of Christian iconography, for example. And so often I can see an image that I've never seen in my life, and I know what it is, because I just know that if that image were represented, it would have to have these elements in this. In this structure. And if, like, if there's something above or there's something below, you know, how are they interacting, what type of relationship you can see? And so I would say that that can be true, you know, for image interpretation, but it also has to be true for culture in general. This is also one of the things that I think Ralston Wit's doing is amazing, is that you need a certain breath to some extent. These are a lot of the stories that say, the ancient myths or the Bible stories or the fairy tales, they used to be so part of people's lives that everybody just knew them, didn't even remember how they knew them. They just did. But now we have to be more deliberate about it because we're so assaulted with all kinds of insane, you know, ridiculous stories that are trying to get our attention, that we have to be more deliberate about, you know, going back into the ancient text, going back into the myths, into the. Into the stories, and then starting to look across and to see the patterns and how they relate to each other. So that's, at least that's the way that I read."}
{"episode_id":"SW - #341 - 2024-05-24 - The Last Judgement - The Culmination of Christian Symbolism","start":4648.96,"end":4665.04,"speaker":"Stephen Blackwood","text":"Well, I know I'm speaking for many of us. Thank you, Jonathan, for the ways that you open up those patterns, open up the horizon, open up our understanding both here tonight and in your work on your podcast and beyond. Join me in thanking Jonathan for a wonderful evening."}
{"episode_id":"SW - #341 - 2024-05-24 - The Last Judgement - The Culmination of Christian Symbolism","start":4669.61,"end":4669.85,"speaker":"Jonathan Pageau","text":"There."}
