{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":0.56,"end":77.84,"speaker":"Jonathan Pageau","text":"Hello, everybody. I am with Dr. Paula Boddington. Dr. Paula is a moral philosopher. You have seen her on my channel before. We talked about AI and we had such a great conversation. We thought it would definitely be worth to continue thinking about AI, but she's also an expert on the ethical quandaries relating to medicine and in terms of biological issues. Let's say right now, with all these things going on, I posted about this monkey man. And then there's also the. The whole thing about AI which is swirling and Covid, of course. So we thought that we would talk about this in relation to storytelling and the kind of stories we tell about the things we do in the world as humans. This is Jonathan Peugeot. Welcome to the symbolic world. So, Dr. Paula, thank you for coming again. I'm really happy. I know a lot of people really enjoyed our first conversation and so you had something you wanted to start with. So let's go with that and then we'll see where it leads us."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":78.08,"end":87.2,"speaker":"Dr. Paula Boddington","text":"Yeah. Hi. It's really good to talk to you again. So, yes. So yesterday. Yesterday also I should maybe start off by saying, Happy St. George's Day today."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":87.28,"end":89.45,"speaker":"Jonathan Pageau","text":"Okay, great. Yes, wonderful."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":89.61,"end":98.97,"speaker":"Dr. Paula Boddington","text":"Yeah. So yesterday on Twitter, I saw that somebody had put up that meme from conference of the Vatican using the kind of creation of Adam meme."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":99.21,"end":104.01,"speaker":"Jonathan Pageau","text":"I wish it was a meme. It was an advertisement. Like, if it had only been a meme, it would have been better."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":104.97,"end":112.05,"speaker":"Dr. Paula Boddington","text":"An advert for two hands touching, like, and even one had. Even one side had even got the kind of like, you know how Adam's really limp wristed."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":112.05,"end":112.49,"speaker":"Jonathan Pageau","text":"Yep."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":114.09,"end":120.25,"speaker":"Dr. Paula Boddington","text":"And in surgical gloves touching. And you reacted quite strongly to that."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":120.89,"end":146.26,"speaker":"Jonathan Pageau","text":"Well, it just shows you just how clueless people are about what things refer to. The fact that they would put out an image like that is so problematic on so many levels. And it's such a misunderstanding of what things like I said what things refer to. And so I just couldn't believe that they used this as an advertisement for a conference about. About medicine and Covid and all of this. It's quite mad."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":146.58,"end":203.96,"speaker":"Dr. Paula Boddington","text":"Yeah. Yeah. So I'd be really interested to talk to you about when you said it's so wrong on so many levels what those levels are. But also because it's such a common meme in AI, it's used so often to illustrate, you know, illustrate AI in various ways. And if you put AI creation meme into a search engine, you'll get. You'll get dozens and dozens and dozens of image on images on different themes. So sometimes it's like a robot hand. Sometimes it's like a kind of digital hand. Sometimes there's colors and quite often actually there's a little spark, like an electric spark between the fingers that's as if instead of being God breathed life into Adam. It's a spark of electricity. Yeah. There's so many images like that. And I just think it's really interesting how. Well, there's so much possibility. There's so much possibility in terms of how the hands are transposed, the way it makes it really easy to swap one to the other."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":204.2,"end":421.12,"speaker":"Jonathan Pageau","text":"Yeah, I mean, it's really in terms of. Maybe I just want to. Because I said that on Twitter, maybe I could. I should help people understand why it's such a problem, first of all. Then we can see why the AI mean would appear as well. There are many reasons why it's a problem. And there was, there were so many. First of all, that image is problematic in the first sense because theologically already there's a difficulty in that image because it, because of the whole bearded God figure and then Adam and you know, the touching of the fingers, which is just a very strange way of creation in scripture is manifested through breath. And so, you know, the image, it's through meaning and breath. And so it's words speaking the word creation into the world and then also breathing, but it's also light as well. So the, I mean, actually gets it better probably with that little spark that you said in the middle. Because there's also this sense that creation happens through light because light reveals form to us, reveals the unity of things to us. But in that, in that meme, they, in that advertising, they put gloves on the two, which even if you understand that this like the touching is what created Adam, it's a. I always, I was thinking like, what if God used contraceptives? Is basically what they're trying to suggest to us. It's like, okay, what a strange idea. And then all these funny things started going through my mind. It's like, oh, so they, they basically want to reintroduce veils in the, in the tradition. Like, what are they doing? Are they putting a separation, like an absolute separation between God and man? So just this misunderstanding. And there's also the strange thing which is that, you know, they wanted to be multi ethnic, but they didn't really realize that they had like a white man with, with the hand of God and then would look like a black woman with like the hand of Adam being limp. And then the other one, you know, they don't. It's like they so don't understand their. The. The things they're referencing to that it's exploding all these directions that they obviously didn't intend. But it's also because they don't understand the. They don't understand the problem of the moment, which is why they're even daring to go in this direction. They don't understand how it is that the COVID and the separation of people and this idea of separating yourselves from others, what it means, and especially what it means in church. All of these things we are things we're struggling with. And so you can try to. Just like you can try to gloss over it and pretend it's not there, but then it ends up coming back even in your own advertisements, you know, even if. Even as you're trying to advertise the COVID measures, you end up suggesting this separation and this impossibility of life which exists in the COVID world. You know, it's like if you. If you. If God and Adam have gloves on, then there's no creation happening. And so that was the problem with. With the. Let's say that meme. But in terms of the AI Meme, it's fascinating because it has to do with some of the things that I've been talking about in terms of the system of the beast, where in the totalizing system, in the desire to be at the top and not have anything above us, right? In the desire to kind of have this revolt against. Against the divine or revolt against the spiritual world. There is. It's. There's a. There's a story which makes it inevitable that at some point we're going to want to create life because we have to claim for ourselves all the things that were above us. We have to take the crown for ourselves, put it on our head. And so there's like an inevitable story which will happen. And it is this, you know, the metropolis. This whole idea of the creation of an artificial being. It's just something that was there and was there in the fiction from the very beginning of the modern age. And it's. It just kind of carries through until today. So."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":421.52,"end":428.56,"speaker":"Dr. Paula Boddington","text":"Yeah, well, isn't it. Isn't it also there in Genesis when Eve gives birth to Cain and says, I have created a man?"}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":429.44,"end":464.73,"speaker":"Jonathan Pageau","text":"I think. No, she says, God has given me. God has given me a man. I think is what she is, what she says. It's more. It's more. It's more like. It's more the story of these artificial beings in the sense of making these idols that in the Scripture, that's what will become this image of creating an artificial being which then becomes the center of a community. So it's like a statue of a God or of a person, and we breathe. We breathe in its nostrils, and then it becomes. It becomes like the vehicle for the God, let's say the shell in which the God inhabits."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":465.13,"end":475.17,"speaker":"Dr. Paula Boddington","text":"Yes, yes. Yeah, Actually. Actually I was just listening to a podcast, but suggested that actually that wasn't what Hebrew means. But that's a, That's a. That's another discussion."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":475.17,"end":476.17,"speaker":"Jonathan Pageau","text":"What do you mean? Sorry?"}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":477.21,"end":481.85,"speaker":"Dr. Paula Boddington","text":"That said that actually the Hebrew should really be translated so that Eve was making that claim."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":482.09,"end":554.17,"speaker":"Jonathan Pageau","text":"Oh, really? Interesting. Yeah, interesting. I mean, that, that, that, that. Then, I mean, it would be interesting to think about the differences for sure, because, like, a good example would be Lilith. So let's say the, the mythological. The mythology around Lilith has to do with this. So Lilith actually spawns children from herself without the seed of Adam, and so she ends up spawning these different monsters. And so there is this desire to, let's say, contain not being, not have this normal, complementary union between heaven and earth, but try to kind of contain wherever you are as a totality and then try to spawn children out of that totality. And so the legend of Lilith certainly has that imagery, and that's why what she ends up creating are monsters. And so the image of, like, of Lilith producing monsters is the same story as Frankenstein. It's the. It's the problem of the pride of Frankenstein, who wants to take the crown of God on himself and then ends up making a monster. And so you see that there are a lot of tropes. There are a lot of those tropes, like the Matrix, all of these stories end up falling into this kind of pattern almost inevitably."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":554.41,"end":591.46,"speaker":"Dr. Paula Boddington","text":"Yes. Yeah. Yes. So would that be something like the difference between whether or not. So there's a debate in AI around about whether or not we're creating something which is a tool but we'll be using with us, or whether we're going to be creating something that's going to be completely autonomous to us and maybe be equal to us. Or actually, this is one of the things where in the AI meme, it's quite often swapped from one side to the other so that it's easy to replace one to the other. So in the AI, in the AI world, there's, of course, lots of debate and speculation about whether or not AI is going to be superior to us in lots of ways."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":591.54,"end":667.2,"speaker":"Jonathan Pageau","text":"Yeah, that'll definitely happen. And then this is what we Talked about before, this idea of creating the body for a God. And it seems like that seems to be mostly what's happening. And it's also one of the things, is that it all makes sense in terms of understanding the scientific approach to reality. Because let's say in the kind of materialist approach to reality, we value quantification, right? We value quantity, we value quantity of information. We think that quantity of information and let's say quantifiable phenomena is actually superior or the origin of spiritual truth or of patterns. And so because of that, then it ends up. It's almost like if, because we notice that AI will have more power in terms of capacity to calculate, capacity to gather information, then because our value system is already upside down, then we will necessarily see that AI as a king, because we already think that that's where reality is. And so if we have a being that can calculate faster than us and that can gather more information than us, then we will ultimately think that that's what superiority is."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":667.68,"end":692.48,"speaker":"Dr. Paula Boddington","text":"Yeah, because I think one of the things that one of the things we have to be really careful with technology over and over and over again, and especially actually when you examine it a lot, but we end up being kind of entranced by the technology, by what it can do. But then we start thinking about what its goals are and also what its strengths are. And then when we look back at humans, we measure humans by the same goals and strengths. So what you said in terms of like quantity and quantification."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":693.59,"end":787.35,"speaker":"Jonathan Pageau","text":"Exactly. And I mean, the modern world has basically, it really is this upside down thing. Where we wanted, if you look at the development of industrial civilization, there really was the desire to transform humans into machines. We wanted the factory workers. The ultimate example of that, where we just want human machines, right? We want humans that can just do things repetitively and like machines do. And then when we can get rid of the humans, we will. Right? As soon as we can get rid of the human, we will get rid of them, because that's what we, we value. We value this capacity to be efficient, this capacity to produce things, you know, and it's a misunderstanding of what, first of all, the human is, and it's a misunderstanding of the normal hierarchy of values. But this is another thing we talked about last time, which is important to understand, is that there are a few people, there are some people that know that, or at least it seems like they know that. And so there's a trick being played, there's like a car behind their back where the AI will be infused with Values will be infused with an ideology, but it'll be presented just as this powerful computer, but it will have. And you can see it right now, we see it with Google, how they're framing reality, how they're giving precedent to certain search terms and they're controlling the search. You can see that it's actually a value laden phenomena, but that they tried to hide it. Almost as if they, they know that we think the quantification is the real, is the most important thing. So let's hide the value so that people can't see what we're doing. It's like, it is like a card trick."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":787.51,"end":876.84,"speaker":"Dr. Paula Boddington","text":"Yes, yes it is. And those notions of efficiency and speed, I mean, so the way in which, I mean I have another whole, another whole topic but the discussion goes all over the place. So maybe just not go down. There's more maybe we can say about the memes. But the way in which intelligence is thought of in relation to AI is such a narrow way of thinking about it. But also part and parcel of intelligence is speed. So like when you IQ test, part and parcel of it is how quickly you do it and how efficiently you are and whether or not you're exactly the same, exactly the same answer which comes in factory working. So if you go, going back to the use of the Vatican, using these kinds of means in relation to a health conference and of course in a sense of like if you're in a hospital, you want things to be efficient to a certain degree. But so many problems get caused by the goals of efficiency, efficiency in health. Trying to, trying to do things really, really, really, really quickly and speedily. It's not necessarily a way in which to sort of, to heal people. I mean going back to the Vatican meme about wearing those gloves, you would ordinarily the first thing you would think of, the first thing you'd think of in terms of health, in terms of two hands touching, would you be the healing power of touch. And if you're wearing rubber gloves, you can't, you're not touching the person, are you? But like, you know, like, you know, premature babies will thrive if they need skin to skin contact. But you know, it happens throughout whole life. You need the healing power of touch."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":877.38,"end":936.04,"speaker":"Jonathan Pageau","text":"Yeah, well, it's contraceptive culture. We, we, we think we don't realize because we, let's say we've reduced, we've reduced reality to very, very specific thing and we don't realize that what the, even the, even the notion of contraceptive as a, as a, let's say a Factor in society. Right. As a part of the story, what it does in terms of understanding what productive human relationships are, you know, that it's not you. It never. It won't end up being just about sex. It'll end up flowing out into. Because sexuality is such a. Is such a deep part of our narrative. Like, it's such a deep part of understanding who we are and how bonds are created in society that when you fiddle with that, you're going to end up. Yeah, you're going to end up with an image of God and man wearing rubber gloves and not. And not seeing what's going on. Like, not understanding why it's actually. It's actually preventing contact. It's actually preventing real productive relationships. So."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":936.36,"end":970.45,"speaker":"Dr. Paula Boddington","text":"Yeah, yeah. I mean, it's interesting in relation to responses for pandemic, this notion of hygiene and the idea that we've got to have completely separate ourselves off and have all these boundaries around ourselves. So I think that maybe this is a really complex topic, but I think that might be related to where there's been such a push towards vaccines rather than. Rather than thinking about. Rather than thinking about treatments. The vaccine seems to be pushed far, far more. As if the idea is that the vaccine is shielding us and the germs will never end, never enter us. We've got to keep up absolute purity."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":970.77,"end":993.25,"speaker":"Jonathan Pageau","text":"Yeah, well, also because they figured out a way, because they used to. They made before you would have a vaccine and then that was it. And that's no good. Like, that's no good for the business. So now they found a way to have vaccines that you have to take again. So it's like, okay, well now vaccines are great because you have to update your vaccine every like six months or whatever. So it's perfect. Right? So it's a good solution now."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":993.49,"end":994.57,"speaker":"Dr. Paula Boddington","text":"Yeah, yeah, yeah."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":994.57,"end":1054.55,"speaker":"Jonathan Pageau","text":"And now you don't have to. Now everybody has to take it. So everybody has to take the vaccine and everybody has to update it every several months. And so it ends up being this interesting. It also ends up being this strange communal thing. The, the. The whole aesthetics around the vaccine are so fascinating, you know, because they end up almost being like. All because it's painful. I think that's part of why there's something religious about the vaccine which is coming up. And the way people talk about it as almost this. This initiation ritual, I guess, I don't know how else to say it, where they show pictures of themselves with like a band aid and there's this whole kind of celebration of, of getting the jab and the pain. It's almost like a little sacrifice that you have to make for all of society, where you get the jab and then you. You're actually doing it not just for yourself but for everybody else. And so there's definitely like a religious undertone to this whole. The whole aesthetic of the vaccine, which is not so surprising, but slightly disturbing, I would say."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":1054.87,"end":1089.22,"speaker":"Dr. Paula Boddington","text":"Yeah, it is, because there so many people are posting on social media that they've had it and so on. But there's also. I mean, I've also noticed something else in relation to how people talk about the vaccine here. I don't know if it's the same in Canada. It's talked in terms of when they've had the vaccine, how efficient it was and how clean it was. They went into the centre and they were out again five minutes later. So in terms of it, like, this drive for efficiency is literally like a production machine of people just walking in and getting jabbed and walking out again. So it kind of also suggests that they didn't read the patient information leaflet or maybe weren't even given one."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":1089.46,"end":1145.53,"speaker":"Jonathan Pageau","text":"I'm sure they didn't. I'm sure no one has, you know, because this has been the big thing from the beginning. I've been also trying to help people understand that ultimately it's about trust. All of this is about trust. It's not about a vaccine, it's not about what's. It's about whether or not we trust the authorities, whether or not we trust what's going on, whether or not we trust the reason why things are happening. And so it's not about science. It's very little about science. Let's say people who are doubtful, suspicious, and then the way that those who are kind of on board then treat those that are doubtful and suspicious, it's mostly about trust and about a vision of what it means to be together. And so this vaccine has become the means by which we show that we're part of society, whether or not it ends up leading to an explicit kind of tracing mechanism. But even in the narrative that you see, it's about showing that you're part of society by getting this. This thing."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":1145.85,"end":1161.77,"speaker":"Dr. Paula Boddington","text":"Yeah, but I just. I just had the thought. I wonder, because we've been so isolated for the last year, more than a year now, isn't it? Maybe we're so. So craving some kind of connection and some kind of way of showing that we're connected to people, but maybe that's one of the factors behind."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":1161.85,"end":1245.28,"speaker":"Jonathan Pageau","text":"Oh, for sure, that's for certain, for certain. And well, it's also that it's a longer story than that. It's the story of running out of reasons why we are together. And that's part of why the world is kind of breaking down. You know, look, we need reasons to know that we're, that we're a society. So. But those. You used to have celebrations, we used to have, you know, religious unity or religious ways of understanding that we're together under God or different ways of stating that. But now we're running out of those. And so. And in a world where they're trying to create post national identities, then we also have a problem, which is that how do we. So they tried things like, you know, the environment. We're going to fight, you know, we're all going to join together and like fight against environmental problems. But it's not working, like, because it's so abstract and it's so. It does involve sacrifice. It makes you sacrifice things. And you know, you have your bins so you can, you can kind of have this liturgical practice of like separating the trash. But it's not enough. I don't think it's an. I don't think the vaccine is enough either. But it's like they're looking for ways to unite people like racism and now this is the medical one. What's great about is that it's trying to portray itself as non ideological. So you can't, you're not supposed to be able to argue against it because it's really is this kind of objective thing where we all unite and show that we're together by participating in the story."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":1245.44,"end":1290.93,"speaker":"Dr. Paula Boddington","text":"So yeah, you've talked again, this is going, this is going in a different direction as well because you've talked before about problems with culture and lack of participation, like losing, losing things. So I mean, lots of things have been happening, have lost in my lifetime. So there used to be, when I was at school, we used to do country dance festivals and that's all gone. And to be May carnivals, I don't know where that's gone. They used to be carnivals all the time. They've kind of vanished. But I also think one of the reasons. So you've talked about this is going off at a tangent. Does it matter? I've heard you talk before about say like going along to a music concert and just sitting there as an audience and that kind of being a problem because it's not really. I see this kind of related to the question you just had."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":1291.17,"end":1384.55,"speaker":"Jonathan Pageau","text":"You're totally right because One of the things that they've tried to do, especially in the United States, I don't know in Europe, but in the United States for sure, in the, like, 70s, 80s, all of this, they tried to unite people under entertainment. And so there was this idea in the water cooler conversation, I don't know if you remember when people were talking about that, where this idea that you watch a show in the evening and then the next day you go to work, then everybody gets together during break and talks about what happened on the show, like Seinfeld was one of those things where people had this sense that it was somehow uniting society together because it was creating this common story that we could all attend to and then talk about the next day. But it's not enough. It's not enough because it's not participative. So we need participative stories. And that's why what's coming up now is more the whole question of racism is like. Because that's a story you can be a character in and you can play a role in. And then also then again now. And now this whole medical question and getting the jab and doing these measures, washing your. Putting on the purell when you go into the store, all of these kind of liturgical means, measures are there to have a more participative narrative. And I don't. And I'm not saying that everybody's. It's like, you don't necessarily even have to think of it in terms of conspiratorial behavior where there's someone controlling this and forcing it to happen this way. It's just people need this. And so when it appears in front of them, like when it. When it manifests itself, they're naturally going to gravitate towards it. Because. Because we need this type of participation."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":1384.71,"end":1402.22,"speaker":"Dr. Paula Boddington","text":"Yes, yes. Yes. Yeah. And I suppose racism, one has got a bit of a problem in terms of participation because people are assigned roles against their. Often against their will. Yeah. So that a lot of people are getting, you know, getting really annoyed about being told because of. Because of something extraneous about you. You therefore think this or."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":1402.46,"end":1430.88,"speaker":"Jonathan Pageau","text":"Yeah, it's a dangerous. It's a dangerous game to play. You know, it's definitely a dangerous game to play because it's actually separating us into clans again. And so that's a scary thing. You know, it seems like it's possible that it's separating us into clans in order for something else to come in the whole divide and conquer strategy, where something else will come and then unite. And the medical. The Medical one is, like I said, it's perfect because it's supposed to be not non ideological."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":1431.12,"end":1501.34,"speaker":"Dr. Paula Boddington","text":"Yes, yeah, yes. So one of the many problems with the racism one is that the people who are most liable to be attacked, the very people who are. So for example, I won't give any details but I mean a friend of a friend was telling me a something that happened to a friend of hers recently. And the sort of people who are getting into trouble are precisely the kind of people who are maybe working with diverse groups, trying to promote equity, trying to do social work amongst certain people and so on and then maybe just accused of not using the right word. And so, so for people who are getting into trouble, for people who actually have spent all their lives trying to improve equality, those kinds of things. So I just think, but that's suppose that they know for a fact that they're not there, that they're trying to do something to help. And everyone's of course who are then getting into trouble because they have to, you know, so recently about, I think about two or three weeks ago in Britain we were told that the acronym that had been used was bame Black and Asian Minority ethnic. I think we've been told we're not allowed to use that anymore. It's unclear as to what we are supposed to say. So those kinds of things are happening with such rapidity, but it's really quickly breaking down and just making lots of people get."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":1502.06,"end":1580.74,"speaker":"Jonathan Pageau","text":"Yeah, it's funny because it's one of those things where if we only had a normal acknowledgment of reality, which is that a good example is, let's say we use one where it's like if you have a physical handicap, if you have a physical handicap, then you are necessarily going to be a marginal part of society and that has negative aspects and positive aspects. And so it's. If you try to, if you realize that a word is, you're using and that it's referring to the negative aspects and then you change the word to something else, you're going to have a problem because the negative aspects are going to come back because the negative aspects are there. And it's the same with being a minority in general. When you're a minority in a group, it doesn't matter what it's not, had nothing to do with race or whatever. If you're a minority in a group, then you are necessarily going to struggle to find your place in that group, whether it's any type of group. And so instead of just realizing that this is A normal thing. And we need to try to palliate for it and try to make it as good as we can and try to help people integrate as much as possible. If we keep just playing this weird semantic game, then whatever word you use to talk about a minority is going to have negative undertones because it's hard to be a minority and so you can't avoid it. It's going to keep coming back."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":1581.3,"end":1582.98,"speaker":"Dr. Paula Boddington","text":"Yes, yes, yes, yes, yes."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":1583.7,"end":1596.18,"speaker":"Jonathan Pageau","text":"It's just this ignoring of how reality works, I think, and a desire to kind of impose this weird. This weird system which actually doesn't pan out in the world."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":1596.74,"end":1660.43,"speaker":"Dr. Paula Boddington","text":"Yeah. So one of the things I think that's really need to stress in thinking about what technology is doing is that it's never just the technology. It's never just the technology, it's always the culture behind it. And they're often working in synergy, or the technology then is helping to shape the culture. And there's like a really complex interaction between the two. And that happens in relation to how we think about health, for example, about the ways in which technology might open up possibilities with health, and that changes how we think of it. So, actually, so, for example, I mean, in relation to the pandemic, the expectation, the expectation for how long we should live has changed so rapidly. So I looked up some charts just last week. Life expectancy of a developed world, or life expectancy in general, has shifted, but life expectancy in the uk, which I presume is similar to Canada, has increased by nearly three years in the last decade. It's just astonishing. And so our expectations of what we expect out of health, it's."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":1660.99,"end":1724.32,"speaker":"Jonathan Pageau","text":"No, it's changed everything. And like you said, and so even this might be very controversial, but I get a sense that, for example, when you look at COVID deaths in different countries and everything, I always wonder if it's more a comment on the state, let's say, of the society itself, pre pandemic, rather than about the disease. And so if there was a country where the population was extremely old and that the systems to deal or to live with these elderly people was not healthy, then I think that's what happened here in Quebec. Like, we have the highest, one of the highest rates of death in Canada and almost in the world in terms of percentage, and people are like, oh, we're hit hard, we're hit hard. But I'm like, I'm not sure we're hit hard. I think there's something else going on. It's more a story about how the elderly Exist and how, like you said, the expectations we've had, which is that the idea of dying at 70 when I was young was like, hey, it's not bad. But now dying at 70 is almost like a scandal. Like, you can't die at 70."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":1724.88,"end":1727.84,"speaker":"Dr. Paula Boddington","text":"Yes, yes, yes. Yeah. Yes. It's really interesting."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":1728.8,"end":1745.11,"speaker":"Jonathan Pageau","text":"It's actually changed the story. Maybe you can talk a little bit about that, because I know you were thinking about the idea of how one of the things it does, like technology, offers up these possibilities and then that possibility will affect the. The way the story lays itself out."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":1745.27,"end":1791.64,"speaker":"Dr. Paula Boddington","text":"Yes, yeah, yeah, it really does. So I listened to your monkey, your monkey man video last week, the Monkey Man. I was just so interested in that. I looked at the actual paper. I didn't read all of it because it's like pages and pages of really technical stuff, but it's got something in it that you see over and over and over again. So in the summary, it talks about interspecies chimera formation. I've got it here. With human pluripotent stem cells, this represents a necessary alternative. It's presented as being necessary, so it's research as being presented as necessary. Necessary to what? So it's an instrumental rationality. It's necessary to certain aims that you have. So, you know, what did they say?"}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":1791.64,"end":1793.92,"speaker":"Jonathan Pageau","text":"Do they tell us what the aims are? Do they mention them?"}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":1793.92,"end":2067.26,"speaker":"Dr. Paula Boddington","text":"You know, so there are various regenerative medicine applications. So, for example, including the generation of organs and tissues for transplantation, and also just understanding early human development and early embryo development in humans, and also evolution, evolution of humans and of primates. So one sort of fairly abstract knowledge. I mean, the abstract knowledge, to be perfectly fair, a lot of knowledge, which is called, like blue skies research, ends up being really useful, but also just fascinating. I mean, like stories about human evolution. Finding out about human evolution is just really. It's just really interesting. But it's always presented as being necessary. If there's a way of finding something out, the only way you can do it is in this kind of way. But I mean, so. But if you'd murdered somebody, for example, it would be necessary to find a way to dispose of a body to make certain you would be available, wouldn't it? But you probably shouldn't have murdered them. So it depends what. It depends what the goals is. But that word necessary is just so often slipped in as something that we just have to do. And it also describes it as fundamental research. So talking about it as fundamental research again emphasizes the notion that it's just really, really important to do. But I was fascinated in terms of how. So there's ways in which this idea of necessity has opened up in terms of the possibilities that created so that it's trying to think up or trying to produce like maybe organs and tissues for transplant. So we already actually pig valves are often used in transplant for heart valve operations. So humans often have pig valves planted into them. So there's a possibility that you might be maybe able to grow organs in other species or somehow use cross species organs. So in research they've tried to do, so basically in the research they took human stem cells. So just to remind everybody, a stem cell, it will come from a stem cell line grown in a lab. A stem cell is a stem that's got the capacity to become any different type of cell. So it could be placed in the body and they've managed to get got these monkey embryos. So in terms of getting the monkey embryos, that means that they've had to get the egg and the sperm from the monkeys, which means that the female monkey has had to super ovulate and have the eggs harvested. Which is, I mean it's quite a burden on the monkey actually because the women who've gone through that for ivf, it's quite a burdensome procedure actually. So then they fertilize the monkey embryos and then inject a stem cell. Yeah, they got a human stem cell and put it into the monkey embryo to see how many days it can survive. And then they haven't transplanted it into an animal. But if they were to do so, it would remain an open question as to what would happen to the human stem cells. What would it do? Would it develop into a particular organ? So I suppose a worse nightmare would be but like it's a monkey body in a human brain, so there's that kind of problem. But the idea that it's necessary because we need it for organs for transplant, it's really interesting how that kind of necessity starts to develop. So the first organ transplant patient was somebody who happened to have an identical twin. So whose kidneys had packed in and needed a kidney transplant. Well, needed a kidney transplant, that was the only possibility. And he had an identical twin. So you can transplant from identical twin because there's not going to be any organ projection exactly the same. So from then organs then spread out to close relatives as long as they're a match and then to finding searches with strangers. And then it's also spread out more to sort of black markets in organs actually and people Being accounts of people being kidnapped and youth and then the search. So what happens is the class of patients who could benefit from an organ transplant is vastly greater than the supply of organs. That's already set up a kind of shortfall. So you've created a possibility. You create a possibility. In medicine, we think we can do this. And then lots of people could benefit from this very vaguely described possibility. And then because it's a medical need. So it's also really important to understand. You could think of it in terms of the mad scientist in a lab, like some crazy scientists doing this stuff. You can easily imagine the scientists doing this must be kind of really crazy, mad type, driven by lust for power. Yeah. Medicine, it's also really important for one of them. Major factors behind this is compassion. Yeah. Who's sick? Yeah."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":2067.26,"end":2088.38,"speaker":"Jonathan Pageau","text":"And the one thing you always have to remember in this story is that you're gonna die. Like, I'm gonna die, you're gonna die, we're all gonna die. Okay. So that's. That's. That's gonna happen. So like you said. So now the problem is that is rather, when am I gonna die and what is the net. What is the limit that I'm. Which. That I'm willing to accept that. That death is reasonable."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":2088.77,"end":2089.01,"speaker":"Dr. Paula Boddington","text":"Right."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":2089.01,"end":2130.89,"speaker":"Jonathan Pageau","text":"And so with medicine, what's happened is that we've. Without necessarily understanding the ramifications of that, we push the limit of what is reasonable reason to die further and further to a point where, like you said, they're doing these things and they're saying it's necessary because you've already accepted a limit, what it means for a death to be reasonable. And that limit is. Is so far that we're willing to do other things which can be questionable in order to satisfy that. That limit. And it has a great. It has a great application to Covid, which is that we know we can. Let's say they think that medically we can contain this thing somehow."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":2131.21,"end":2131.69,"speaker":"Dr. Paula Boddington","text":"Yes."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":2131.77,"end":2164.32,"speaker":"Jonathan Pageau","text":"Because it's possible. We think it's possible. And because technology makes it possible, then it's there no even question whether we should do it or not, whether we should. How far we should go. There's no limit to how far we should go. Because once you've created that possibility and because, like you said, it's motivated by compassion, then it's like this strange parasitic story comes in and people just stop thinking and stop asking that, stop noticing that there's actually a competing set of values that have to be thought of. They just see the possibility and they just embody it kind of jump into it."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":2164.48,"end":2313.75,"speaker":"Dr. Paula Boddington","text":"Yeah, this happens all the time with technology, but certain values come to the foreign and it tends to be values that you can count. So but in terms of health, of course you can count the number of years and how you know how long you are alive, the things that you can more easily account. I mean it happens within the healthcare system in terms of like efficiency, of goals, of target. Because of course one of the other terrible things that's happening is that people are living longer and longer and longer, but the quality of care for elderly people is absolutely atrocious. It's just absolutely, absolutely abysmal. So that's, it's really interesting how I think one of the things we're faced with, I've got lots and lots of examples of this, but one of the things that we're faced with is how the technology is making different values kind of like clash with each other or produce paradoxes. So I mean here's one whole set of paradoxes in. I don't know if paradox is the right word, but certainly. So one of the ways in which medicine has gone down the route actually I want to get back to talking about the monkey embryos in a minute. But one of the ways in which it produces a kind of clash, a sort of a clash, but you tell me whether it's the right word would be through genetic technology which is developed techniques for screening before either within testing embryos in the womb and maybe having selective termination of pregnancy for various damaged ones or pre implantation diagnosis severe tubers for lots and lots of different diseases. Really commonly as for many pregnant women will be screened for down syndrome at the same time there are other people putting in lots and lots of work to treat the very same diseases. So cystic fibrosis for example, which is quite a common genetic disease among certain populations, it's quite a pretty serious disease but the treatment for that is improving really, really, really, really quite well. And down syndrome I think is a really important example because at the same time as screening for down syndrome is being pushed, so I believe that Iceland is hoping to have like zero down syndrome births. At the same time people with down syndrome are living longer and longer and longer. They're going to school, they're going to university, they're holding down jobs, they're getting married. The possibilities of the life of somebody with down syndrome is increasing really quite significantly. People with down syndrome are being used in adverts. So there's different strands."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":2313.75,"end":2324.47,"speaker":"Jonathan Pageau","text":"Yeah, there's a major clash. Like there's basically A inclusion versus eugenics clash, which is quite insane when you realize just how extreme those two things are."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":2324.71,"end":2361.49,"speaker":"Dr. Paula Boddington","text":"Yeah, yeah. Yes. And yeah. And also, I mean, so much of this, again, is also driven by. Driven by compassion, by, you know, feeling that parents would feel they wouldn't be able to cope with certain things. So again, I want to stress, it's really, really easy when you're talking about these things to make it sound as if you're being really judgmental of. So that's not what I'm talking about. I'm not everyone, sort of. It's partly because we have such a legalistic way of thinking about ethics that you think if you're trying to look at the subtlety or nuances behind things, that means you think you're going to try. And what you're intending to do is to stop people from doing things."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":2361.65,"end":2437.28,"speaker":"Jonathan Pageau","text":"Yeah, but we need to be, we need to be attentive to this because let's say, let's take the monkey man story and so this drive to create hybrids, right? This drive to. And it really is a weird drive. Like, it's like it's a narrative drive, this drive to create hybrids for medical reasons. But at the same time, there is a narrative in society. There's a story. And one of those stories is the revolutionary story. And so if you have a revolutionary pattern in your culture and you create AI, that revolutionary pattern is going to find its place in AI. So we're going to have a sense that the robots need to free themselves from us. So if you do the same with the hybrid, you have the same problem. The recent, the recent line of Planet of the Apes movies has the apes as the good guys and the humans as the bad guys. Please remember that, people, because as you're creating these hybrids and you have a revolutionary pattern in your culture, you're setting up something that you're not, you're not going to. You're setting up a situation where you're going to have compassion for these hybrids and, and, and an upside down compassion even where you're going to want to make them into your king, which is just a scary stuff."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":2437.52,"end":2543.05,"speaker":"Dr. Paula Boddington","text":"Yeah. Yes. So one of the things that I've noticed going back to the AI creation meme with the spark of electricity, as you said. I mean, you pointed out that if it was light, then that would fit it more with the Genesis story. But if we're thinking about it in terms of electricity, and we're thinking that. And of course, we are made of electricity, our brains run on electricity. But that's One of the ways in which humans can be seen to be inferior to AI because one of the ways in which we're often talked of dismissively is that because our brains are running in. We're trapped, if you like. It's not a good way of putting it, but we are biological beings. And a lot of people saying, well, a way in which we think. If our brains are like computers, we're tracked by what's called wetware. Have you ever come across that term, like wetware? So then the AI isn't. It can run much faster. It's in silicon. You can have quantum computing. You can do stuff far faster. So again, that's an example of how we think what we've created is going to be better than us. We're just trapped in wetware. Or the way in which our thought processes are hampered, if you like, by our emotions, our desires, or by the ways in which actually we've stemmed from evolution. So another way in which we're seen as being potentially inferior to AI is because a phrase. I hadn't actually heard it until recently, but we're just kind of like trapped in monkey suits because of the ways in which we're. The ways in which we have, you know, factors about how we behave, driven by our evolutionary past, for example. Yeah, this is like a really good example about how we're kind of seem to be. We've progressed beyond the monkey, but we're kind of like trapped. Trapped by, like, taints of our monkey ness. If only we could get away from the monkey ness, we could then go on to the next step."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":2543.21,"end":2552.6,"speaker":"Jonathan Pageau","text":"Yeah, and that's where we. That's where you see this, like, hint of Gnosticism in the modern thinking. No, the idea that evolution is progress."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":2552.68,"end":2553.08,"speaker":"Dr. Paula Boddington","text":"Right."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":2553.4,"end":2595.66,"speaker":"Jonathan Pageau","text":"First of all, is very. It's supposedly deeply unscientific, but it seems to be a trope that people cannot get rid of. They just keep Even the most. Even the most, like, evolutionist. If you listen to an evolution, like an evolutionary biologist for long enough, you're going to see. You're going to find them falling right in that trope. Even if. Even if he'll say, no, no, no, evolution is in progress. They just end up getting into that trope, no matter how they. How they do it. And so the image of moving from the monkey to the computer is definitely something which has a deep story. A deep story version. Like, you see it in all kinds of very even popular culture type of thinking, where you have this idea of the robot as being a superior form."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":2595.9,"end":2745.26,"speaker":"Dr. Paula Boddington","text":"Yeah. Yeah, yeah, yeah, yes. So, yes. So in doing these monkey experiments, we have. This is one of the ways in which there's a form of hybridity in terms of ways which we flip from one way of thinking about ourselves to another way of thinking about ourselves. So in order to do the experiments, in order for it to work, we had to pick a monkey because they're closer to us in evolutionary terms. We only diverge from them, I don't know, 70 million years old. So we're quite close to. Quite close to them. So that's why it works. So we have to see ourselves as like biological beings who are fairly closely related to monkeys. But then in order to justify doing the research on these monkeys, who are after all quite really complex beings, in order to justify like taking. It's worse for the female monk, I mean, it is actually worse for female monkey because of. Collecting eggs is so much more onerous. In order to justify doing it, we've got to think of ourselves as being superior to the monkeys because we're not. We're not trying to create organs in order to save monkey lives. We're using monkeys to try to save human lives. We wouldn't sacrifice a human to try to save a monkey. We just wouldn't do it because we think of ourselves. But it's really interesting. So only like about 20 years ago, when we managed a sequence of a human genome, everybody was really excited and saying, at last we found the essence of man. As if our genomic code was going to be like the book of life. People talked about that for various reasons. We don't do talk about that anymore. One of the reasons being that when we sequenced all the genes, it turned out that really embarrassingly, humans didn't have many genes compared to other animals. We got genes as really simple worms and other animals have got far more than us. So that like was. It's really strange how that's kind of like a bit embarrassing. And then it turns out that genes are much more complex than we thought. But a lot of stuff is actually really environment and that lots of diseases we thought we were going to be able to cure is actually much more complex. So that's all faded. But this, one of the things that technology does is like, it exposes and puts pressure, pressure on the contradictory ways in which we think about ourselves and evolution. I mean, evolution is evolution. The point that you're making about evolution is completely right. It's really hard to find anybody talking about evolution and not see it in terms of progress. And it's like, so I think evolution has done this really cunning bait and switch on us. So it came along in the 19th century, and despite what anybody says, it was used to say that, oh, we're really. We're just like. We're nothing but monkeys."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":2745.26,"end":2745.66,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":2745.9,"end":2770.5,"speaker":"Dr. Paula Boddington","text":"All those cartoons of Charles Darwin being like a monkey. We're nothing like monkeys. So therefore religion is a load of rubbish. We just evolved and it's random. It's interesting in terms of how it's now seen in terms of progress. It's just as completely random, completely meaningless. These random mutations happened and some of them worked and some of them didn't. And by this accidental progress. Accidental. I said progress by mistake."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":2770.58,"end":2771.54,"speaker":"Jonathan Pageau","text":"Yeah, yeah."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":2772.34,"end":2832.9,"speaker":"Dr. Paula Boddington","text":"Process. We've just ended with humans as being like the latest thing. But then having got rid of religion, more or less amongst people thinking really scientifically, it's like they have to get some kind of meaning and progress from somewhere. So the meaning and the progress comes from evolution. And so now. So the interesting, really interesting thing is instead of having a picture before whereby there were animals lower down and then man in the middle, and then angels and then God, you know, like, I mean, one of my. Actually my favorite. I love Psalm 8, you know, the man. You have made us man a little lower than the angels. What is man that thou art mindful of him a little lower. The angels dominion over the animals. So there's a huge amount of fuss. People saying this religious view is awful. How dare you think you've got dominion over the animals? Yeah, how dare you think so? And what that's been replaced by. It's by. I blame it all on John Lennon, actually. His song Imagine."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":2833.14,"end":2834.58,"speaker":"Jonathan Pageau","text":"Yeah, horrible song."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":2834.74,"end":2839.86,"speaker":"Dr. Paula Boddington","text":"There's no heaven above us, only sky. So that if above us is only sky, that means that we're at the top."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":2840.18,"end":2899.42,"speaker":"Jonathan Pageau","text":"That's right. Yeah. We're at the top. And it plays out in so many interesting and let's say, like you said, kind of these contradictory way, but end up showing the same reality, which is that even the idea of environmentalism is so powerful because it's. The environmentalists say, how arrogant. You know, man is so arrogant because he places himself above. Above nature and tries to control nature. It's like, would you tell an ant that. Like, would you tell an ant that it's tried to control nature? No. The only reason why you say that, because you do believe that you are above nature and you do believe that you're going to save the environment and that by acting like a human does, you're going to undo the Bad things that other humans did. And so you can't get out of it. Even in those that are the most anti human kind of pro environment thinking, they end up putting human beings at the top. It just happens on its own. It's actually quite funny to pay attention to."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":2899.66,"end":2917.66,"speaker":"Dr. Paula Boddington","text":"Yes, yeah. Because in terms of environmentalism, if you just see us as organisms, part of a planet, if you take something like the Gaia hypothesis, then if, for example, we do stuff that leads to human extinction through climate change or whatever we're doing, but we'll just die out and the cockroaches will take over and stuff."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":2917.98,"end":2987.74,"speaker":"Jonathan Pageau","text":"That's right. Is there morality to the meteorite that destroyed the dinosaurs? Why would there be more morality in human extinction? Or not just human extinction, all the other races that are being extinct, like if a, like if a, if a certain predator like eats away, eats all its prey and then it does it to an extent that it can't survive itself, that's no moral question. It just happened. And then other beings will take its place and just keep going. And so nobody believes that. Like nobody, everybody believes that we are like little gods, you know, on the, in the world. It's just that whether or not this little God has ultimate power or whether or not it should be submitted to a higher, a higher truth, that's. That ends up being the question. And there's a kind of unconsciousness about so many of these, of these movements and these especially environmentalism is the one that is the most to me contradict. It's like, I agree that we should take care of the world around us. I don't think we, I think what we're doing is abusive, but I think that there's a blindness which means that you're going to struggle to get there because you don't see what's really happening."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":2988.7,"end":2991.02,"speaker":"Dr. Paula Boddington","text":"Oh, right, right. Yes, yes. Okay."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":2992.14,"end":3013.66,"speaker":"Jonathan Pageau","text":"And so the monkey man is definitely something that we, we need to pay attention to in terms of the question of hybridity. And the idea of the human computer hybrid is also something which is definitely at the same time on the, on the fore, let's say with Elon Musk and his microchips in the brain. So I don't know if you've thought a little bit about that and the stories that are surrounding that kind of thinking."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":3013.9,"end":3263.04,"speaker":"Dr. Paula Boddington","text":"Right, yes, yes, yes. Well, because that's linked to a notion of progress. So if we're. So if you take the view that like some ways of thinking about now, humans are the pinnacle of evolution. Of course the problem with matters if you're thinking that evolution is a prime mover. You just wait and see what evolves next. But actually, people are not really satisfied with that. So there's kind of, if you like, well, a number of different strands forward, but you could divide them into two. One is a kind of strand of. Humans need to use machinery to try to improve ourselves. So we have the Elon Musk type of wanting to have the neuralink implant in the brain. So one of the reasons why he wants to do that is to make us able to keep up with AI, because thinking that AI is going to be basically thinking so fast that we won't be able to understand it. So we need to be able to. To be able to link with AI, to understand it. So merge having these plates in your brain. I mean, I don't think I would volunteer. But actually, that's also really interesting because it's also really interesting. It actually relates again, back to that question of medicine in terms of developing it, because a proposed use for it would be for people who are maybe completely paralyzed, who've been paralyzed in some terrible accident, who might be actually quite grateful for an implant in their brain so that they can maybe directly move the world so that you could maybe get your thoughts translated and so on. So, but actually, you could then actually really start to understand why, if you'd had this, if you were suddenly paralyzed or you'd know some catastrophic medical disaster and you were given the option that it might be pretty dangerous. But would you like an implant in your head so that you can then communicate what not in Syndrome, you can actually understand why somebody might think that would be a really good progress for somebody. But in terms of understanding, in terms of taking upon that risk in order to communicate with AI, one of the things that's happening is that it's thinking of progress in terms of something really quite specific, so that people who talk about progress in this way. There are people who. So Max Tegmark, for example, who's. He's a cosmologist. I think he's at mit. And he was one of the people who's. He's one of the founders of the Future of Life Institute. And he wrote a book about three years ago, I think, called. I think it's. I think it's called Human 3.0 sometimes. Yeah, it's Human 3.0. I suggested you read it, but I know you have enough time to read it. So he talks about evolution. He's an example of people talking about evolution, but seeing evolution in terms of making the Universe aware of itself and having knowledge and understanding and seeing it in terms of that's a good thing. So he said, before that happened, before the universe woke up, there was no value in the world. You have to wake up in order. You have consciousness of yourself and that would create knowledge and value. But then humans are at the pinnacle of that. But we've reached the end of more or less the end of it. In terms of biological evolution, it's going to be too slow. Stephen Hawking talks about that as well. He said human biological evolution is so slow, so we're going to get overtaken by machines. So you might worry that machines are overtaking us, or you might be pleased because you might think what we can do is invent machines and they'll be more intelligent and we'll create more and more and more intelligence in the universe. And that's where the future is. The future is not human. So one future is humans. We need to enhance ourselves to survive or to develop. And yava is. But bye bye little human. You were just like a monkey ancestor. You were just like the Neanderthal to the, to the AI. And the future descendants are going to be AI. But of course, in order to paint that picture, you have to decide what out of what's happening in evolution is progress. Progress constitutes intelligence. And that's. Yeah, so like, you know, so if we go back to the creation of Adam meme, if you think of it, man is made in the image of, in the image of God. You then have to think about, well, what aspects of, you know, what aspects of us are in the image of God. It can't be every little tiny detail. What is it? So the answer these people are giving is that it's intelligence, a particular form of intelligence which you think a machine can exemplify."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":3263.28,"end":3390.68,"speaker":"Jonathan Pageau","text":"Yeah, exactly. And I think that one of the issues that happens is of course, understanding yourself as the summit of, as the human person that's at the summit of this capacity to value. It's already the problem. It's already the problem because the mechanism of valuing, or the capacity to notice the good is something which, at least in every other culture in the whole history of the universe, has helped people understand that there's actually a hierarchy that goes up above us, that this valuing actually leads up to goods which are beyond just the individual person, whether it be communal bodies, you know, in terms of beings that come together in systems that point to something above it, and then continuing on into seeing these values embodied in different images of gods or angels. All the way up to the infinite. But as soon as you see the human person as this only valuing thing in reality, then it leads to this problem of, the solipsistic problem of this kind of like. Because then it comes self valuing, like this weird self valuing. And then it creates these strange aberrations which are both extremes in a way that are kind of two extremes in terms of, like you said, seeing ourselves as these all powerful gods that can do whatever, or seeing ourselves as these future ants which will spawn something above us, which will be something that is more reasonable, that is faster, that is more in terms of quantifiable qualities, has more in terms of these kind of quantifiable qualities. But valuing is not quantifiable. That's what valuing is. Value is quality. It's something which jumps above this quantifiable or this speed or all of this type of thing that people think is what intelligence is. And so there's an internal problem even in the way that they, that they understand what intelligence is, what the purpose, what the purpose of consciousness is. All of this is deeply problematic."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":3391.8,"end":3468.98,"speaker":"Dr. Paula Boddington","text":"Yes, yes. Yeah, I think you're right. But there are more problems still. So I think one of the problems, I think one of the things we as humans always have to do in terms of thinking about value is always be aware that we might be wrong and to, and to ask ourselves a question. And so that's why it's dangerous just to do it on your own. That's why you might, you need feedback from other people. That's why you always have to ask yourself whether you know, whether or not you're biased in some way or ask yourself whether or not you're being selfish. Actually, I did my. I mean, this is something else I've always been really interested in. I did my PhD on self deception. So you always have to be aware of the fact that we might be, you know, but we might be deluding ourselves in some kind of way. So we need, we need to have some, a certain sort of humility. But you just don't, you just don't see that in these grand, in these grand visions. And something else also that's happening is that there's so much focus on the individual self. There's so much focus on being on the individual. So of course the individual is really important, but you can focus on it, on it too much, but there's focus on the individual at the same time. And so absolute certainty that these people are absolutely certain that they know how to solve problems. So like, so for example, in terms of like the environment of climate change, the hubris of people who think, okay, we're going to block out the sun."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":3468.98,"end":3488.03,"speaker":"Jonathan Pageau","text":"Now that's insane. When I see that, I think I'm in a science fiction movie. These people are not. They don't exist like this. There's no way that someone is actually saying that. It's like a, like in the Simpsons. They had that idea, like blocking off the sun some point. The Mr. Burns wanted to block off the sun like crazy. I know, I know."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":3488.03,"end":3604.79,"speaker":"Dr. Paula Boddington","text":"It's not even like a science fiction movie, like a bad Austin powers movies like Dr. Evil. It's just insane. So the level of humorism, but the certainty about the individual is right when they're focusing so much on this narrow goal. But the individual self is being sort of emphasized so much at a time when actually in so many ways the technology that we're using, it's destroying the individual self. It's creating so much uncertainty. There are so many ways in which human beings are constructed in complex and where in a sense, inherently provoked. We've got parts of us which are prone to divide in various ways. So we can have emotions which can be at odds with what we know about things. We've got different aspects to ourselves. We've got an inner subjective part. We've got an outer objective part. Our emotions can be desires which can be in conflict. And I think one of the things that the technology we have is doing at the moment is in so many different instances over and over and over again, it's emphasizing certain aspects of ourselves and it's manipulating us in ways that creates division within ourselves, which is manipulating our desires and it's manipulating our relationships with ourselves and relationships with other people. So it's checked. So for example, we talked before last time about online meetings and talking over Zoom. It changes how we see ourselves because we're looking at. We can see an image of ourselves all the time. So it's changing our self perception, it's changing how we relate to other people. Oh, actually, actually I should just mention in relation to, since we talked last time about how odd it is relating to somebody over zoom. And because you're just relating really remotely. I've got a new strategy for my Zoom meetings, which is that I'm in the same room as I was last time, but I've turned the table around because now I've turned it so that I'm facing the person. So my computer is. I'm facing Montreal. So I looked it up on a Map."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":3605.75,"end":3610.63,"speaker":"Jonathan Pageau","text":"It's a little gesture to remind yourself that I'm an embodied person somewhere in Europe."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":3610.95,"end":3617.19,"speaker":"Dr. Paula Boddington","text":"Yeah, I'm talking to some friends in Australia tomorrow, so I've got to face in that direction. So that's my little rebellion."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":3617.91,"end":3693.45,"speaker":"Jonathan Pageau","text":"But it could seem like it's not much, but it's a little. Just even the ide of attending and having something in memory like this, a gesture to just turn your table is recognizing something and recognizing the difficulty of the situation, let's say. And so it's not a bad idea because the person isn't in your screen. Right. And that's something that we tend to default to even if we don't think of it rationally, but we tend to act that way and think that way. So. So, yeah, listen, Paula, we've been going for a while, and I think that we could probably just keep talking forever. And so I think this is definitely going to ask for another conversation sooner than later. And a lot of people are interested in understanding what's going on and understanding the stories that go with the technology and the contradictions and these competing narratives in terms of who we are and what we're doing in the time of COVID and with all these new technologies on the horizon as well. So I really appreciate you taking the time with us to work through this and be willing to put yourself out on a limb to talk about difficult things that have a lot of implications. So thanks a lot."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":3693.69,"end":3701.57,"speaker":"Dr. Paula Boddington","text":"Well, thank you. Thank you. I really enjoyed it. And as you said, yeah, there's loads more that we could talk about, definitely."}
{"episode_id":"SW - #163 - 2021-06-20 - Dr. Paula Boddington - Biotech Creation Myths","start":3701.57,"end":3804.22,"speaker":"Jonathan Pageau","text":"And we will, that's for sure. So, everybody, thank you for your attention. We really appreciate it. Of course, we touched on so many things. So definitely go at it in the comment section and get involved in discussion there. You know, we talk, you know, we just like Paula and I just like you. We're overwhelmed by what we're seeing and we're overwhelmed by noticing what's happening. And so we need to be, all of us kind of working together and seeing how we can find little solutions and bigger solutions to the difficulties that. That this situation is bringing to us. So thanks for your attention, everybody, and I'll talk to you very soon. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well, and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
