{"episode_id":"SW - #178 - 2021-10-06 - July 2021 Q&A","start":12.56,"end":7923.47,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. All right, so here we go. And so I wanted to start out by saying that some of you might have noticed, some of you might have not noticed we've been having serious problems with the website. And I'm not totally sure what exactly is going on with the, with the website. I've been in discussion with the people who are managing it in terms of technical stuff, and they don't totally seem to know what's going on either yet. And so what that means is that some of people, like, I know some people have been kind of cut out of the website. Like some people that have been supporting me or have been subscribed to the website can't access the content. Some people that have been supporting me are being, their support is being canceled automatically. And I don't know why, maybe some people are canceling on purpose, but some people I know have been cut out because they've written me and said, like, what's going on? It says that my payment is going through or that my subscription is canceled. So, so sorry about that. I don't know what to say. All I know is that I put in the chat the email for Mark Ramer. He is the person who is running the, who's running the technical part of the website. So look, in the chat, it's not very far. You can find his email and you can email him to tell him that it's not working and he will, he will fix the problem. He's been able to, he's been, been able to fix the problem individually for people, but we haven't totally found, like, let's say the big problem. Like, what exactly is doing this? If it's a plug in, who knows? I don't know. I'm not a technical person. So, so, yeah, so sorry about that. For those who have been suffering that it's really from the website, those who are supporting me through Patreon seem to, seem to be, seem to be going fine. So, so, all right, all right. So I, I, as I look at the questions, I'm realizing, like, this is just becoming so completely unmanageable. Unmanageable. There, there's like 75 questions or like 80 questions. So look, I'm just going to go through and I'm going to start and when I totally run out of steam, I'm just gonna have to stop. And so, so, so sorry for those that I, if I don't get to your question, I apologize for that. And yeah, and so we'll do what we Can. So thanks everybody for your support though. I really appreciate it and sorry that you're trying to support me and it's so complicated. I really appreciate it. You know, it's, it's, it's, it's very touching that you, that you're willing to, to support me to do this. So. All right, so let's go. I will start with the, with the website. Even though it is not. It is, it is diff. I know that not everybody who wanted to ask a question was maybe able to, but there's already so many questions. Anyways, is there other announcements? Yes, the other announcement is as I. Next week I'm going to be in Denmark for the manifesto, which is it European Men's Gathering. It's going to be very intense because it is really like, it's going to be like kind of diving into the fire, at least for me, because be all kinds of people there, all kinds of different thinkers, different opinions, you know, everything from kind of, kind of more New age thinking to atheists to kind of Nietzschean thinkers, all kinds of stuff. And so, so for me it'll really be a great, I think it'll be a great experience to kind of, to see, you know, to what extent I can speak into that world. But it's a pretty, it's a pretty exciting group. I, you know, I enjoy their, their energy and their, their willingness to. For all the things they're willing they're going to do. There will be an Orthodox priest there as well, which is one of the things that is making me want to participate. And so. All right, so let's go. So I'm hoping to see some of you there. It's like a three day thing and I'm hoping that I can meet some of you there. That'd be great. It'd be nice to travel. I haven't traveled since the beginning of COVID and get a feeling like this is a very small window to travel in and that this window is going to shut down pretty soon. If you see what's going on like in Australia and places like that, and you know, these new shutdowns and these variants and you know, the infinite variants that are popping up and. Yeah, all right, so. And the COVID passport, which is coming here in Quebec is also going to be a little bit of an issue, let's say, as we watch these measures kind of take take root. Another thing that should happen, and I'm hoping will happen, is that I'm supposed to be speaking in October at the, the oca, the Orthodox Church of America's Diocese of the south annual their die season meeting. That's where the last time I spoke there as the keynote speaker, that's where I, I put together the Pentecost for the zombie apocalypse talk. And so, so I'm excited to go there again to speak there. I'm a little worried because that talk was like, it was so intense for me. Like, there was so much that I put in there. I'm. I'm thinking, can I pull it off again? Something that is as you know, that is as composed and as relevant. So I'm a little nervous about that, but also excited at the same time. So those are the things that are happening. Last thing that's going, coming again, another travel. I need to put these all on the website on my calendar is I'm going to be in Chicago probably I'm going to speak in Chicago also in October at the Catholic Arts Guild. They're having a conference there. I'll be posting the details of that very soon. But if you're, if you're in the area of Chicago in kind of try to keep that on your horizon, that in October I will be there speaking at a conference and spending a few days there in Chicago. So. All right, so that is enough announcements for now. Things have been kind of slower a little bit in the summer I've been taking. I took a few weeks vacation, which is really nice with my family. But yeah, I'm ready to dive back in. So here we go. So first question from the website, David Flores says, what is the relationship between time and truth? It seems like in the current breakdown, many revelations concerning corruption and illicit actions in media and politics are coming to light. Is revelation part of fragmentation? And he says, I'm also having login issues through symbolic world. Yeah, David, I. Man, I'm gonna see. This is gonna, this is gonna be a theme, I think in this Q and A. So. So yes, there's a mystery. There's definitely a mystery. And you can see it in some of the words that Christ talks about. There's something, I think I mentioned this before, which is that Christ seems to have been speaking of what he was bringing about. Let's say the kingdom that he was bringing about was one which was going to lead toward the end of things. It would lead towards the great judgment. Okay. And. And in that movement, it's like a movement of revelation. And so you can understand it as like kind of Christ filling up the world. But the way he fills up the world is not necessarily the way that we might Expect it. Just like people didn't expect the Messiah to come in the way that he did. It seems to be, part of, it seems to be through scandal as well, that is that everything is being revealed. And so some of the things that are being revealed are also the dark sides of things. And the corruption, the scandals, the, that Christ said must happen are also being revealed. And that seems to be part of what Christ is doing, let's say cosmically is revealing everything. But part of that means also it doesn't excuse all the insanity that we're seeing, all the corruption, all this kind of degeneracy that is coming up, you know, just this kind of moral chaos and you know, and the, the tyrannical aspects of power. All of these things are kind of being revealed in, in this moment. And like I said, it doesn't justify them, but it seems to be part of what the work of Christ is. And so, you know, I've even gone as far, and this is going to maybe scandalize some people, but I think that even the kind of, this kind of like this pornography making culture, like this culture that has become pornographic seems to be, let's say, an effect of Christ in the world. That is every single dark thing is coming to light. Every single perversion, every, single, you know, every single dark aspect of what humans are capable of is, is, is becoming visible. And so, and so you could imagine it really like this idea that Christ talks about gathering the wheat and the, the snares together in the end. And then the judgment comes when all of it is revealed, when everything is revealed. And so until then, things continue to, to, to, to appear. And so you imagine it. Usually we think about it like the revelation of the saints. You hear people say things like, you know, that, that you know, the world will continue until all the saints are revealed, let's say. And I think that's true, but I think there's also a darker side to that, which is the world is also revealing all, all of its, all the scum is also coming to light. You know, so imagine it's, it's, it's really like, you know, the light coming down the mountain all the way down into the lower waters and revealing everything. And some of that stuff isn't, isn't pretty. All right, so M.J. villa, M.J. villam. Look at these people. Like, you guys are wonderful. You're actually solving the issue, he says, for login issues. When I eventually noticed the box at the bottom of the screen asking me to accept cookies, and I did, so I was finally logged in before it was an infinite loop of logging in and being told I needed to log in to view patron only content. So maybe that's what's happening. I don't know. I can't know that right now. But maybe that's the pro. Maybe that's the solution. And I'm sorry if that. If that. That's it. Well, may. If that's it, then that's an easy solution to the problem. My question is, what is the symbol of the honeydew list? Is there an expression of such a thing in French? Does it have both a positive and negative aspect? There must not be such an expression in French, because I have no idea what that is. What's a honeydew list? Is it like a meme? I don't know. You guys. You guys are. You guys are just exposing my boomer status here. Honeydew list. Oh, is this like something that. Oh, is it like the idea of a wife who. A wife who posts problems in the house and then asks her husband to do it? Yeah, I think that that's what it looks like. All right, so if that's what it is, if that's my understanding, then what's the symbolism of it? I mean, I've talked about this before, which is, you know, obviously we need to be careful when I talk about masculine and feminine. Obviously these exist at every level of reality, and so a person also has a negative masculine and feminine aspect in them. But let's say, nonetheless, women usually manifest more the feminine, let's say, in the world. And so the idea that I've talked about is how one of the aspects of the feminine is to pose the question is to frame the problem or to. Or to create the frame in which an answer must be given. And so just like the mother of God comes to Christ and poses the problem, you can imagine, like, this is horrible that I'm seeing it this way. But, like, know the mother of God comes to Christ and gives him his. Her. To her to do list. She says, there's a problem with the wine. There's not enough wine. What are you going to do about it? And. And that's it. Like, that's this framing of the problem. And then the masculine will then come and give the. Give the answer, let's say, to that question or to that problem. So that's. That's what. That's where I see it, unless I misunderstand what it is, but that seems to be what it is. All right, so, C.S. streetsel, ask what is the symbolism of Miscarriage. And so this is a really important symbolism. There are several aspects to it. But if we think about the miscarriage as the child that doesn't reach life and the idea of aborted fetus, or a fetus that doesn't come to life, there's a very rich symbolism related to that. And it has to do with the idea of something which is not fully formed. And so there's a reason also why, you know, let's say the unborn fetus appears to us in a monstrous way. It is ill formed. And so there's a relationship between, like in this, in scripture, the word, sometimes the word that talks about the idea of fallenness or the fallen, this idea of angels falling or this type of language about these things that fall. They are related to miscarriages. They are related to the two beings that are, that aren't completely formed or that, that don't. That haven't connected heaven and earth together. So you can imagine the giants, for example, as a kind of cosmic miscarriage, you know, as these not fully, not properly formed beings that exist on the margin of reality. And so, and so that's really the, that's really the symbolism of, of miscarriage. It has to do with the fall, for sure. You can understand how, you know that miscarriage is a consequence of the fall because it is the improper or the, the, the myths of heaven and earth, right? The, the myths of the, of how these things come together and, and then manifest a living being. And so it's also, there's also a relationship, direct relationship between monstrosity and miscarriage in a more explicit way, which is that often the children, often babies that were born dead, let's say, that are born without life. The visual aspect that we have of monsters will come from that. And so you've probably seen some of these, let's say deformed children have been kept. You can find images of them and that they've been preserved. And sometimes, you know, they'll, they'll have all the deformities that we recognize as monstrous. Like just one eye in the middle or you know, feet that look like animals or you know, like legs that look like, like, like serpents or, you know, that this, that the way that we kind of project our imagination into these ill formed, uh, human, humans ends up being part of what feeds our vision of the cosmic miscarriage or the, these cosmic monsters that exist on the, on the outside of reality. You know, the gog and Magog that are kind of held out of the world by the, you know, by the gates of Alexander, that type of stuff. And, and you'll also see that often there's a relationship even between monsters and the eating of aborted babies. You know, we talked about this. Richard Rowland brought it up slightly in our discussion about the apocalypse of Pseudo Methodius. But there's this whole, this whole tradition of these monstrous creatures on the edge of the world that one of the things they do is that they eat aborted fetuses. And so this relationship between that is their food. Like this unformed being, this like not totally formed beings. Are there, are there food? All right, all right. So people in the que. You guys are awesome. In the comment section, someone says you need to email Matthew Ramer. And so it's like he dealt with it. So yes, please email Matthew Ramer if you can't get into the website or try the trick that, that, that was mentioned earlier. All right. So Samuel asked what. How can we see the difference between spiritual development and pre list? Saint Paisos rebuffed a potential vision of Christ when he noticed himself feeling honored to see him. Whereas St. Paul on the road to Damascus falls down automatically before Christ without knowing even who he is. What role does the submitter have to play in these kind of situation? Is part of a vision? Insight, falseness, how we receive it? Well, definitely this is a kind of universal thing. And you'll read in the Hesychastic Fathers, which is that, you know, just like Saint Paisio said that if, if a vision or a spiritual experience causes you to have pride and to lord it over others, then it's already problematic, it's already a problem. And so definitely this is one of the reasons, this kind of stuff is one of the reasons why in the church spiritually you're supposed to have some kind of a spiritual father. You have someone that you are supposed to help you discern. And, and that's, that's part of the, that's part of how you can tell the difference is by sharing it into the church so that you know the, the person who has direct authority over you can help you judge. And it's not just like, it's not just about following rules and following. It's also because the. Your spiritual father or your confessor or the, or a priest will say things to you and, and as. And will. Will prod you and will ask questions and we'll try to see what, what's going on. And you can also judge in yourself how you react to that. If you get offended, if you're annoyed, if you, if you feel like your pride is being bothered, then already you can have a sense of what's going on. So it's not just about just like the authority kind of deciding, it's about this interaction with authority which is also showing you what your attitude is in your spiritual development. So yeah. So, Mark, greetings from Tbilisi, Georgia. I'm new here and enjoying this exploration of the space while learning this new language. Assuming Covid is a hybrid, a mixture of different viruses, how does this fit in in our Euro symbolic worldview? I mean, let's say that's what it is, especially in, in the theory that it was made in a lab, then it fits very well with our worldview, doesn't it? Right. The idea of, of, of these, of this desire to create these hybrid creatures and that how these hybrid creatures are unleashed on us willingly or unwillingly and cause a kind of chaos. And so, you know, if Covid is, is also a kind of man made hybrid, then it totally participates in the, let's say in the narrative of hybridity which is assaulting us more and more. I mean, I'm sure you guys have seen people have been tweeting at, tweeting, tweeting this at me for a while. The, the, the whole. This new movie by A24 about this hybrid lamb child. I forget what it's called. I think it's called Just the Lamb or something. You know, you're gonna see a lot more of this. You're gonna see so much of it, you have no idea. You know, at least it's a horror movie. Which, which, which is. This is like a 24 has had some interesting things. Like I ended up, ended up, finally did watch what's it called, Midsummer, which people, everybody was telling me watch Midsummer. Midsummer. And the fact that it was framed as a horror movie, this kind of rise of paganism, I thought, and this return to kind of scapegoat mechanism and everything I thought was appropriate actually for what it is. And what's going on in this return to a scapegoat mechanism and the return to psychedelics too. It's like I was surprising how it was presented in, in Midsummer. So, so Worm Hatcher asks. Hi, Jonathan. I spent many years involved in cartooning, especially in drawing comics that had a kind of 90th of ethic. Since coming into the church and observing creation from a different expanded vantage point, I've not been able to engage with that kind of creativity as I used to. I still have impulses, desires to create in that mode. It feels unresolved. I got a sense that I need to understand it slower quality before I could possibly recapture, recapitulate it. Is there a right or good use of this kind of energy? What is the symbolism of cartooning? Thank you. And so I think that cartooning is actually a very appropriate mode of expression. And of course, there are different uses for it, but I think it can be very powerful for someone who wields it well, because it is like icons, right? It is an image with text, just like comic books in general. And. And so it has a great potential to kind of reach heights that people might not totally understand. And the fact that cartooning or cartoons and comic books and all of this is seen as a very low art form, as a kind of popular, almost trashy art form is even better. It's even better in terms of the surprise that it can bring in. There's a reason why Scripture was written in kind of popular Greek in Koine. And there's a reason also why Dante wrote in Italian rather than Latin, because there's a relationship between the highest thing kind of hiding in the lowest place. Let's say this is something Christ talks about in terms of the fish and that type of symbolism and even just the whole aesthetic of. Of the idea of the poor and how Christ manifests himself in the littlest of these. And so this can be. This is not just a moral question, but it's an ontological question. You know, it's like the waters below sometimes can reflect that which is above. Sometimes it's trash, like you say, most of cartooning in comic books is trash, but it has a possibility. And so I would say not to give up on that. Like, not to give that up. To continue to try to explore how it is that you can create visual images with text that can speak to higher things. But there's also a place for social criticism, which some cartoons can also do, kind of caricature. All of that, I think, has a purpose in terms of the fool aesthetic, the holy fool idea of, you know, how the. The holy fool is also there to poke at the system. And so I think all of that is. Is totally appropriate. All right, all right. So. So Christian asks, what is the difference between the hybrid and the character of the margins? And so they aren't different. The hybrid is a character of the margin. There are different characters in the margin, but the hybrid is one of the characters of the margin. So you always have to be careful. You always have to remember, like, when I talk about things, I. I talk about them in. In an ontological way. And so in their place in the cosmic, let's say, pattern, that there is nothing wrong with hybrids, per se. The hybrids are a necessary characteristic of. They're kind of a necessary characteristic of the fallen world, let's say. But not just the but. But there's something mysterious about them, which means that they also act as guardians of identities, which is why we have hybrids. That's why cherubs are represented as hybrids, where we have sphinx type characters that guard holy places and you have gargoyles on the outside of churches. This kind of liminal space between identities has a function, and it has a sacred function. And so you have to be careful. When I talk about hybrids and the fact that I talk about, let's say now, the assault of hybrids, it shows you where you are in the pattern. Right? But there is. There is a holy hybrid. Right? That's why I love St. Christopher so much. And so it's not. It's. So it's not about seeing that all hybridity is bad or that all hybridity is good. You know, there definitely is a. A problem right now, which is this kind of. This story of hybridity as, let's say, kind of seeping in and taking over the narrative. And also the hybrid ring represented as the central character, as the. As a, you know, as the savior, let's say this is the problem, you know, but the. The fact of hybrids is not a problem in the. In itself. So hope that makes sense. So Shay shay or say McKenna asks. Hey, Jonathan, I'm struggling to find a church to get involved in. I honestly don't even know what denomination I subscribe to anymore. I feel I'm stuck and I end up not going to any. At all. Any advice for a step toward grounding? I mean, I'm sorry, I know that's a struggle. It's a struggle because we are in a time when Christianity is somewhat dilapidated, and so it's difficult to find. And so this is my advice to you, is definitely to look towards liturgical, to liturgical church. You know, obviously I think Orthodoxy has the most of that, but there are other, you know, the Catholic Church is somewhat liturgical, traditional Catholicism especially. And if you can't even find that, let's say, you know, there are some Anglican churches that are still somewhat liturgical. The reason why I'm saying that is because one of the problems with churches, or the problem with churches that are very informal is that everything rests on the pastor or everything rests on what is being said at the pulpit. And so you're. You. Sometimes you get Stuck because it's like if you have a good pastor, then you want to go to church. You have a bad pastor, then you don't want to go to church. But if you find a liturgical church, then even if the pastor says crazy things or is not amazing or is off, then the liturgy itself can carry you because it has its own power. It's a witness to an entire tradition of people who brought it together and recognize it as manifesting the pattern of worship and the pattern of Christ. And so that's what I would suggest, you know, But I, I, I suffer with you. I understand that that's difficult. So. All right, so Kelly Madden says, what is the meaning of the number five, specifically? The story of David and Goliath specified that David took five smooth stones from the brook for his sling when he went out to face the giant, but he only used one. And so obviously the, the symbolism of five is multiple. But to me, at least the best way to understand the symbolism of 5. I've talked about this in the, I did a video on the symbolism of the pentagram. I think it was, I think it was a subscriber only video though. Sorry. It's four plus one is the best way to understand five, in my opinion. So it's like, so it's like four corners and a center and so like a pyramid with four corners and a center or kind of like a pentagram with four corners and a, and a top, like the head and the four arms. So you can imagine it something like he took five stones like this, the, the two arms and the two legs and the head, and he took the stone for the head is the one that hit Goliath in the head and knocked him out. You know, so there's an analogy between, between let's say the human person and the fifth stone, which is the one which, which it's funny enough because it's like, let's say the top head, it hits him in the, in the forehead. So it's like, it's like you can understand that that's what a giant is lacking in spirit, let's say too much body. And so it's like by, by taking the stone which is like the head and then hitting him in the forehead. That's how you knock him out. Right? A seed, A seed to the forehead makes the giant cease to exist. Giving meaning to, to chaos is what makes the giant cease to exist. So anyways, that's one interpretation that's probably the best way. At least that's the way I tend to understand Five, almost always as that. Four and one. All right, Josh the mover says, why is there such an emphasis on repentance right before death? Even if the proper Christian has regularly repented and descended in virtues all his life long? If God stands outside of time, what makes the span of time between repentance and death so important? So this is going to be. So, for example, in the Orthodox tradition, there are different strains, let's say, but one of the strains is that there is no repentance after death. And it's like, I'm not so sure about. About all of that. Like, I'm not so sure about all that. But the idea is that the, the. You're, you're. What happens after death. Your life is now. And, and, and this is, this is what will. This is the body which will, let's say, inform what, what is after death. And so I think that's why repentance before death has become so important, because there's a sense in which, you know, you kind of have to consume everything, right? You, you know, the way you die has import in. In your eternal self or your immortal self, you know, which is why martyrdom is important, you know, and so it reveals something about you. How about that? Like, the way something ends reveals a great deal about that being, because the end of something is its finality. And it's like it's the final fruits of that person. And so you can understand it that way. And so the idea is you would want to repent before you die so that, you know, the idea is that you end in. In Christ, that your ending is good. But I, but obviously I don't think that if you don't. If you know, for something happens to you and you don't, you're not. You die in a car crash or something, and you're not able to repent before you d. I, I would. I would struggle to see that as an absolute thing. I'd rather. I'd rather see it more liturgically as this kind of participation. We all kind of go through this kind of. This poetic participation, you could say. So Fred C. Says. Could you. Can you explain the symbol, symbolic relationship between head and the heart? In the head body symbolism, the head represents the highest point and center. But in plenty of mystical writings, the heart is also considered the highest point and center of the person. And so that's probably. That's probably you kind of. You grasp at it in your text, which is that it's not a. There's. How can I say this? It's like It's a. It's a polyvalent symbolism. So sometimes this. That which will represent the head is the same thing which will represent the heart, like the center. And if you understand it in a hierarchy. And so you can understand that in the sense of when we talk about Christ as the head of the body, you know, it's similar to the heart, but not completely. And so if you want to understand the difference between the head and the heart, for example, is an image to look at would be an image of the Ascension or an image of a church. So you can imagine, let's say you look at a church and you have an arch, right? Let's say the apps of the church, if you look at it as a cut section, it's like an arch. So you have heaven above, and then you have the square, the earth below, and then in the middle, you have the altar, and you have the place where heaven and earth meet. So you can understand that. So in that sense, that's when, if there's a difference between the head and the heart, that's how you need to understand it. That is, the head is something like heaven, the body is something like earth, and the heart is the place in which that, let's say the abstract, or let's say abstracts, maybe not the invisible patterns meet with the body and then create this unity of action. So that's the best way, I think, to understand that, like I said. So the church, heaven above, earth below, and then a meeting place, the tabernacle in the middle, something like that. But it's tricky because the symbolism of the head can sometimes be the same as the symbolism of the heart. It just depends on how symbolism is. Also. It also, it always also depends at how granular you go in terms of the symbolism. And so, yeah, so if you, if you have an image of the head and body, then the head is closer to the image of the heart in the sense that it's the seed, you know, it's the. The point. It's all of that, like a pyramid. But if you have a relationship between, let's say, like if you see in the image of the Nativity, for example, you have an image of the pattern, the mountain of God, and then you have the glory of God above, and then there's like a cave in the middle, and then there's the incarnation in the center. And so in that sense, it then becomes like the secret place in the middle where heaven and earth meet. Right? So hopefully that's helpful. All right, so Dhumayesh asks, what is the Symbolism of the prohibition against boiling a kid in his mother's milk. On one level, it's taking something that's supposed to be nurturing but then using it for death. But it might also be related to wisdom. Like when Paul talks about the Corinthians only being able to drink milk rather than eat meat. In my, my estimation, this has more to do with a, with a confusion of causality. It's something like, like incest, where you, it's related to what you said. Like, it. And so you, you, you actually, like you said, like the thing that nurtures the child becomes. It's the, the thing that you, you're going to eat it in a confused way. So it's like you have something that is the, the milk of the mother and then that which eats the milk, and then you put them together in a confused manner, and then you, you end up eating it. So I think it has more to do with that and more to do with confusion of causality. Like, you know, that's the way that I understand that. Yeah. And so you can see it like if you look at Jewish kosher law, you can kind of understand, you can understand it a little more because for them, it's all about keeping things separate. It's all about, you know, they push this very far, but you can, you can still help you understand what it's about. You know, it's like they completely separate the milk and the meat. And so it's like it's a different levels of reality that you have to keep separate and that you don't want to, you don't want to mix together, or else it, it creates confusion. But I think the way St. Paul talks about the difference between drinking milk and eating meat, it has something to do with that. Maybe not exactly, but has something to do with showing you two different levels of ontological reality, one higher, one lower. And you don't want to confuse them. Right. That's how you make giants. And you confuse them when they're not joined properly together. Yeah. Like in an opposite way, the way that you're supposed to be joined together. Because you do end up, let's say, eating the milk of the mother because the child will drink the milk. That's the way you're supposed to consume that properly. But now it's like a, like a weird confusion of categories. All right, I need to go faster through these or else I'll never make it. All right, so. All right. So Kingsley asked, many evangelicals stress the importance of sharing the gospel. This often gets condensed down to God is good and loving our sins separated from God. So Christ died and he resurrected to united us. So receive Christ through faith. Can a simplified gospel message ever be helpful to share? Or is it more often than not a form of propaganda that diminishes the Christian story? I mean, I think that it's fine, like it's fine to, to say those things because they're not completely false. I think the problem with the way that it's presented today, it's like this weird formula, right? This like, weird formula that's like, here's something like here's your state. If you do this, if you believe this, then you're, you're saved. And that's definitely not the gospel. Like, that's definitely not the gospel. You know, the gospel is not about, about how to get saved in that sense. It's really about, you know, about the, the good news is Christ. Like the good news is the incarnation of God in the world and the transformation that that brings, the revelation of the true nature of reality and how we can participate in that and how that brings us up into God. But, but yeah, so I, I, I'm not a big fan of the, of that kind of reductive thing, which is why you'll probably never hear me say something like that. Although, like I said, I'm not saying that, that it's not this, it's not completely false. Like, it's not completely false. All right, so, all right, so we're done with the website. And there are far fewer questions on the website, probably because nobody could log into the website. So man a of lot live. All right, so sorry about that. I, I will stop apologizing about that because it's gonna get enough. Okay, so let's, let me just load all the comments on Patreon. So let's go to Patreon. Oh, we're looking at like 40, 40 something questions on Patreon. All right, so R. Murray says please comment on the symbolism of homeschooling both historically and in today's society. So we homeschooled like not. Our kids are in school now mostly because of the flood that happened in our house and because of, of COVID strangely enough. You think maybe the opposite. But I think that the, the, the desire to homeschool now is the witness to the corruption of the system. Mostly it's mostly because people notice that the system has become ideological, that the system has become know is making factory children, that the system is confusing wisdom and, and, and just information. All of that is what I Think, at least in my case, brings the desire to homeschool your children. It, it doesn't, it's, it has its, it's not com. It's not completely positive. Like it's a sign that society isn't doing super well. When you feel like you have to homeschool, but you also should. If, if you're noticing that, you know, the, the school system in which your, your children are going to go is going to, is completely corrupt and completely immoral, then, then I think homeschooling is definitely a thing to do. But there is a manner in which homeschooling can also be a, a kind of refusing to participate in society. But sometimes you have to do that. You know, you have to do that when society is completely corrupt. But, but, but you have to balance it out. You know, it's like to be honest, like if I, if I lived in a place where I had a good access to a school that I could trust, you know, with teachers that were, you know, were Christian or at least had sound thinking, classical thinking, classical values, then I probably, I don't think we would have homeschooled. But, but that was not the case. So. GR. Ask. Hi Jonathan, Hope this is not too long. I wanted to ask if evil could be understood as the contour of reality or of God's extension. Therefore being being like a fractal Mandelbrot set which is infinite while also being differentiated from a non intelligible outside. This would make evil non existence necessary to define good. Hell being the fractal on the margin, eternally infinitely dispersed towards nothingness. Thank you. So I think that. No, I don't think, I don't think that's the best way to understand it. Because evil is present at every step of the hierarchy of being. When that aspect of reality, how can I say this? When that aspect of reality ignores where it's from. When that aspect of reality sees itself as all encompassing or as have value in itself. And so that's to me when something like evil appears and so you, so pride, for example, is an, is a, is the first evil, but it's an evil which is, is like at the top of the hierarchy. You know, it's like when you, as you ascend the hierarchy, you get closer to something which could become pride. And, and then that is actually what can cause you to fall. And so you, you see it if you look at the image of the ladder of divine ascent, for example, you see a good example of that which is that everywhere on the, on the ladder of Divine ascent, you can fall. And there's even a very good tradition which is that not only can you fall, but the higher you go, the more. The more you fall. Like, the higher you go, the more in danger you are to fall in a way that could lose you for a longer time. And so the monk who falls into pray less, then goes up the mountain and then becomes full of himself, that monk is in more spiritual danger. Then, you know, the prostitute who feels bad about what she's doing and wants to change and is asking for forgiveness. That's the reality. And it's a tough one, but it's one which we see in the things Christ says all the time. It's like the Pharisees are in far more danger spiritually than the tax collectors and the prostitutes. All right, so Ron Wood says, are secular spaces even a possibility? It seems as if, where I am now, that there are mainly a buffer space between the lens of Christianity and the lens of modernity. Yeah, good call. I understand the narthex is a secular space of sorts, but of course, even it is a symbolically significant buffer within the symbolic language, its secularity in the common tongue, and as Tom Holland uses it, a concept of modern, postmodern area Christianity. The earth is the Lord's and fullness thereof. Yes, I totally agree with you. I think the way to understand it is to understand it fractally, as usual. Right. Like you said. So you can understand that the church is. Has a special microcosmic function, like as an anchor of reality. And so it has everything in it. And it also has the breakdown and the. The hybridity on the edge. But then that represent. Then that manifests itself in a social level as well. And so in the social, in the secular space, or in the. The space, the political space or the social space, then that reality is. Is there as well. And so every. Every aspect of life can become sacred. Every aspect of, you know, every aspect of your life, if it's properly oriented, can become a little tabernacle, a little. A little revelation if it is properly oriented, you know, and so. So I think your intuition is completely right. You could say relatively secular in the sense of this kind of. This kind of, let's say, this idea that the narthex is a. Is a buffer space. But you can. So you can see that there's a sec. There's a movement towards the secular in the sense of where the sacred diminishes, at least in its appearance. But then that. That pattern is there everywhere. It's there in your heart, right? You could say that you have secular aspects of you, you know, like when you're putting your socks on. That's a second, that's a far more secular activity than, than if you know when you're praying or you know, when you're, you're, you know, when you're hugging your child or something like that. But nonetheless, the idea, it would be that for a saint they could find God in, in all the little aspects. Like they could encounter the divine spark even in the smallest act or in the, the, you know, in the littlest thing. So, yeah, so White Lawrence asked me, how should I understand theosis? Is it to become godlike? Is it to become a copy of God? In the orthodox tradition, is theosis understood as something with a reachable end, or is it understood as an eternal process, appreciate work. And so it's theosis is participation in God. It's to become a God, it's to become a Christian, a little Christ. It's to be transformed as much as that's possible. Like, that's what Saint Maximus always says that, he always uses that phrase where it's like to the extent that that's possible. And then he doesn't totally say what that means. And the idea is, especially in St. Gregory of Nyssa, we find that he, he, he managed, he shows it as a, as a dynamic thing, which is that it doesn't have finitude. You don't reach, you don't just reach theosis in a static sense, but that theosis, although you, you do reach a level where we, that we call theosis, like we talk about the Mother of God ascending, you know, that we say that she's achieved theosis, but we also see it, at least San Gregory Nietzsche talks about it as this, this constant kind of infinite ascent which has no end. And so that's the best way, the best way that I can explain it for someone who, who, who hasn't reached theosis. You can look at, you can read the, the writings of the saints of those that, that are recognized to have reach high spiritual states and probably find a better, a better example of that. So Chase and Lindsay says, hey Jonathan, in the Lord of Spirits podcast, they bring up the notion that the giants could be transformed into Israelites and vice versa. Does this process extend to all manner of monstrous and hybrid being, for example, mermaids and centaurs? I see hints of this in St. Christopher. Yes. And dog headed men. And I'm wondering if this is perhaps a solution to the problem of hybridity, that horrifying and wild beings like mermaids and centaurs could somehow become part of the center in a way that's not destructive. Thank you for your insight. And so, yes, so the story of St. Christopher is the best story to understand that because it shows you St. Christopher is like a narthex. He acts like a narthex, he stands on the border on the side of the river. And his function in the cosmic pattern is because he's on the side of the river, he can carry Christ further out into the darkness. And so that is kind of the role of the hybrid and the role of the, of the marginal beings, you know, but we have margin, we have these saints, there's a, there's a mermaid saint in the, in the ancient church. Like I don't know what that means exactly. Phenomenon like in terms of, like a scientific understanding of what that is. But those exist, you know, and St. Christopher is, is part of that. So, so, so yeah, you know, but you see, like you see in the story of St. Anthony, like he, he encounters hybrids when he goes into the desert, he encounters a centaur and he encounters a satyr. And those encounters really seem to be more like encountering the monster in, in the, more in the negative sense of encountering a passionate kind of ill formed being in his himself kind of. But, but in a, this, I don't know exactly what it is that he encountered, but that, that's, that's the story of he encountered a centaur and solder. Here I am trying to be a modern all the time. He encountered a Saturn, he counted a centaur. So Micah Mueller asked in St. Paul a dragon, what role does he play in Christianity? And so I mean, I don't know if he's a dragon, but he's definitely the left hand. Like that's for sure. In, in so many ways he's a shapeshifter, he's, he's all of that stuff. And so he definitely understand the symbolism of the fool and of the marginal, the marginal as being something like there's a mystery in that role. And for sure St. Paul seems to want to play that role at least in some parts of his writing. Maybe not in all, but at least in some. But I wouldn't go so far to say that he's a dragon. That might be pushing it a little bit. So Dan Diego de la Vega asked what is the symbolism of Constantine's battle of the Milvian Bridge? The key role in the shield is dream and the vision of armies seas. My kid loves Constantine's story. So I want to tell it. In the right way without fudging the meaning. And so the symbolism of Constantine is a symbolism of a change of world. That's what's going on there. And you know, so he, he has, he has a vision of, of, of the cross. He has a vision of the name of Christ. And in that vision he's able to cross the waters. That's why the battle happens on a bridge. And if you read Eusebius, you'll see that he, that he talks about it as, he talks about it as, as this crossing of the waters, like the flood and all this imagery of the, of the, you know, of the Israelites crossing the waters. And so that's what's going on there. It's a change of worlds. That's what, that's what happens. And you can understand it like, even, like crossing from the old Rome to the new Rome, from Rome to Constantinople, from the pagan city to the Christian city. That's the symbolism of the battle on the Malvian Bridge. And you can also understand it, like, if you want to understand it politically, it's also the breakdown of the tetrarchy. And so, you know that there was, at the time of Constantine, there was this idea of like the three emperors. And so you could see it expressed in the story of Constantine. The, the notion that this was seen also as a kind of breakdown and, and the civil war that it caused. There were other civil wars. Obviously it was a, it was a rough time, but that these civil wars that occurred in the empire were, let's say, brought together into one in the vision of the cross and the vision of Christ. And so it's also kind of reunification of the empire that's going on there, as well as a crossing of the river. Some people are going to hate me for saying that, but that's, that's, that's the symbolism. You can see it as. Some people might just see it as propaganda, but it's using the proper. It's using the proper imagery no matter what. So Dorothea asked, why do millennials hate their lives? Is it because millennials are born into the edge of time? Any advice? There's definitely that, you know, and it's like a lot of people have criticized me recently for, for being kind of apocalyptic in the way I talk. But it. Do you think your kids don't get that in school? Like, my kids now, My kids didn't go to school for the whole time, but since they go to school, like, they're far more depressed and hate their lives. Why? Because all they're being told is how the world is falling apart because of ecological reason, because of racism, because of all of these things. And so the very school system is giving them a sense that they're basically the last. Right? They're Gen Z, they're the last generation. That's how it's being presented to them. So, so, so it's understandable that they struggle because, you know, they're being presented with an apocalyptic narrative on all sides. So I don't know what to say. I feel bad for them. I think for sure. I think for sure that symbolic world, at least I've seen in the younger people that it's. And they're the. This idea of. This idea of understanding. So we have an opportunity right now, and it's a very interesting opportunity. And you can see that I'm trying to use that opportunity as much as possible, which is that there's a trope in stories of the old forgotten world, right? This. This old. These old legends that we've forgotten. And, you know, and that are these hidden gems that you have to discover and. And they can kind of reinform the world. You know, this ancient kingdom which is lost, this ancient civilization which is lost. Right? The secrets of Atlantis, the secrets of the Egyptians, all of this kind of desire to rediscover this ancient lost lore and world. It's like we're in a very interesting situation right now because Christianity itself is that. And so you can actually present Christianity as this ancient line of kings in Lord of the Rings that has been lost and will be reforged. You know, the sword that will be reforged for the. For. For. For the final battle or whatever. That type of trope is one that we can do. So, like what we're doing with Richard. Richard Roland, the universal history is exactly that. It's like saying there are all these hidden secrets and mysteries, which they're not. They're not secrets in a negative sense. It's just that people have totally forgotten them. And everybody used to know these stories. Everybody used to know this universal history. Now it's gone. And so we can rediscover it. Like excited children that are finding, you know, like that are. That. That are finding a secret, hidden treasure or something. And so I would say that's my advice that. That it's a. It's actually an opportunity to. To help. To help them rediscover this stuff. So, you know. All right, so Drew McMahon asked. Brave new World seems to come to mind every day. Yeah. Is there a bookstore or movie that you feel best described Symbolizes, represents the times we are in. Also, did you see Alex Jones recently say that the number one thing he's certain is real and most ominous conspiracy are human animal hybrids? And so, I mean, it's not a conspiracy. They are telling us that they're doing it. There's no conspiracy. It's like, I mean, it was before Alex Jones was right, and so now they're actually telling us that they're doing it. There have been several articles that have been published about, you know, how they. They put humans, Human genes for intelligence in monkeys. How they, you know, they. They're doing all these weird hybrids and the fact. And they're saying that they destroyed the fetuses. But it's like, if those articles are coming out publicly, it means that there's a lot of stuff that has been done that was not that we were not told. And so. And so I think he's right, you know. And so what is the story movie that best describes. I think that in terms of understanding the kind of. You've probably seen the meme. I've talked about it before, you know, that meme where it's like Fahrenheit and then Brave new world in 1984, like as these three circles and it says, you are here. Like, that's pretty much it. Which is odd to think that. But it's hard. It's so hard to. I could never have thought that 1984 and brand new World could come together into a dystopian reality. But it seems like. It seems like it's happening, you know, so this kind of weird control of information, but also in a society, a kind of degenerate society of pleasure. And so, yeah, it's weird. So. So Charles Harrow says, at the end of Second Samuel, in Chapter 24, King David takes a census of Israel and Judah. This is considered a sin for which him and his people are punished. Why was this a bad thing for him to have done? When Moses did a census of Israel during their exodus, was it because David was the king while Moses was a judge? I. I talk about this in. In my video on 666 on the symbolism. 666. I think that's the video where I talk about it. In that case. In the case of David, the. The problem, there's something about. You're supposed to like, offer a sacrifice in kind of as a compensation for the census. Because there's a problem with accounting for everything. I've talked about this before. There's a difficulty accounting for everything brings about the end of A world because you need to leave a buffer on the edge, you need to leave the fringe, you need to leave the corners of the field untouched. And so there's something in this idea of a sense is bringing about a plague, which very much has to do with our reality now. So you can think about it, even just biologically. And so think about people who are trying to, let's say, this idea of putting in check all diseases, of accounting for all the diseases and, and getting it all under control. Right? And so, and then what happens with that is that the diseases accumulate on the border. Let's say they accumulate in the. In. You think you've covered it all, but it actually brings about like a flood. So it's like the Tower of Babel brings about the multiplicity of language, you know, and the census brings about a plague, brings about a breakdown because you're trying to kind of contain everything in a system. And, and then because you do that, the, the, the, the side effect of that is actually the breakdown. It's actually the opposite, which happens. The, the idea of like antibiotics and this, this, this desire to kind of stop all diseases is a good example of that. And it's going to bring about stronger and stronger diseases and going to get wiped out by a real plague at some point. Not this little, this, this small. I mean, I don't want to downplay it, but it's, it's. This is not the plague. What we're going through, there's nothing to do with, with the real plagues that happened, you know, where the, you know, the Black Death or, or those types of plagues. So those are possible. Those can happen, by the way. You know, that can definitely happen. All right, Anne Herrera says, what is prayer? What is happening when we pray? Man, you guys, how can you ask a question like that? Sorry, Anne, what is prayer? I mean, so it depends. It depends. I mean, prayer is talking to God. And so there are different aspects of prayer. There's. There, there are aspects of prayer which are meant to worship and there are acts. So that means attending to the highest thing, right? And putting it in its place. So it's like lifting up God. You hear that in churches all the time. We lift up God because we want to recognize the source of reality and we want to all be turned, our whole being turn towards this higher thing. Attending to the highest thing. I say thing, it's obviously God's not a thing, but attending to the highest, that's one aspect. Then there's another aspect which is asking. And so asking has More to do with creating the question, creating the space, creating the, the opening in which the divine will manifest itself, you know, in which God will answer. So you ask a question and then God answers. And so you have to you, that's also how reality works, right? I've talked about this several times. Reality works with questions and answer frames and discourse, you know, potentiality and actuality coming to manifest the union of the two. And so that's another aspect of prayer which is, and then there's a third aspect of prayer which is, let's say, praying for each other. It's related to asking. But praying for each other is more complicated because it's not more complicated. But it has to do with this idea of recognizing each other as being in this relationship, facing that which we worship. And so we pray for our brothers and sisters and we gather them into us and they gather us into them in love and in compassion. And then that is what forms the body as we do it, directed towards the infinite and the source of everything. So hopefully that's, that's a good, I mean it's like that's a tough question because it's a, it's a big question, but hopefully that's a little hint that can maybe help you understand why we pray and, and what, what the point is. All right, so Lynn Holland says, can you talk about how your experience of life has changed since you adopted the orthodox frame and begin to view life through a more of a symbolic lens? What are some of the bigger shifts you have experienced on a day to day basis in terms of how reality reveals itself to you? I mean, one is, is just a kind of wonder, you know, a sense of wonder and a sense of excitement and a sense of being part of a story. And that I would say is the biggest thing. And it's like I'm excited about reality. Even though, even, even the darker aspect, like, even as I watch, even as I watch kind of things break down and I kind of see these, the symbolism of the end kind of manifest itself. There's nonetheless a kind of excitement in the sense that it's not a nihilism. It's like I can see that it's part of the story and I can understand it. So it's like it's a way to deal with that too. Causes less suffering, even if you cause less suffering when you understand that the suffering you're going through is part of the, is part of the story. And so I would say that's the biggest thing. And then of course for me it was A way to unite a lot of the disparate elements of my experience. You know, my. My intellectual life, my spiritual life, in terms of prayer, in terms of. Of spiritual discipline. And then my art, artwork, the. You know, the. My work in art, all of that was able to come together in Orthodoxy. So Andy Crawford asks, what do you think of the Enneagram? Thanks. I have to tell you that I have not really studied the Enneagram very much, just like I've not really studied Jung. And a lot of people, I think, don't believe me when I tell them that I haven't studied Jung, but I just haven't. So sorry. All right. So Bjorn Olson says hello, Jonathan, I'm an organist, and I wonder if you have anything interesting to say about the symbolism of the pipe organ. An interesting thing of note is that the organ is usually placed in the back of the church, but it's still often beautifully made and almost demands your attention. Ultimately, its role is to lead the congregation in song. Well, for sure. The organ, wind instruments in particular are very powerful because they're. They're really. They're very symbolic in the sense that they're very symbolic of how reality works, which is that the spirit, the air, goes through a pipe and then turns it into a pattern. And so you have a body, like a periphery. You know, you have a circle. Right. I can't do it in 3D. And then you have the air which blows through the middle of it, and then the circle vibrates and then creates a sound. And then when all of these different peripheries, all these different rings have air, have spirit which flows through them, then those sounds come together into. Into a. A pattern, into the music of the spheres, you know. And so that's why. That's why I think the pipe organ ended up being the main. The main musical instrument for. For Catholicism in the. You know, in the kind of. In the. I think it probably started in the late Middle Ages. I'm not sure exactly when, but when they stop just using voice, because the voice is that already. Right. Voice is already something like that, right? You. You have vocal pipes and you. You project air through them, and then they vibrate and they create a sound. And so it's. It's just that it's a. It's a. It's a related symbolism to just singing itself, but it's just now happening in a. In an object or through an object, let's say. So I both understand why the Orthodox Church won't. Doesn't go there, because it's it's like a kind of, like a garment of skin. But I also understand why the Catholic Church adopted it and why it's such a powerful image of how reality can, can manifest pattern. All right, so Garth Natwick asks. I recently started looking into Paul Tillich after learning about him from John Vervake. When I understand, it seems that Paul Tillich's theology tends to be labeled as radical theology. John Vervecki has also classified you as a radical Christian in your presentation of Christianity. You know Paul Tillich and you consider yourself a radical Christian to be accurate. So I don't know a lot about, I've read a little bit of Paul Tillich, but I'm not, I don't know enough about, about him. And I would, I know, I heard John talk about that in his discussion with Jordan Peterson, and I'm curious, I'm curious to what he means. Like, I'm like, I hope he doesn't mean it in a kind of fundy way, a kind of fundamentalist way, but I don't think that's what he means. I think he means something else. So I, maybe I'll ask John to tell me what he means. And so if he, what he means by a radical Christian is that I see Christianity or the Christian revelation as, as a, as the very metaphysics by which I look at the world, I would say, yeah, I hope so. Like, I hope that's what I'm doing or I trying to do that. If that's what he means, then I'm like, I'm on board with that. But I, I'm not sure. I, I, he. I think there was something so mischievous about that conversation all around between Jordan and, and John Revake. It was something, man, you guys know that I, maybe I didn't announce it yet, but I'm supposed to have a discussion in September between Jordan, John and I in like the same discussion. And so I'm super nervous about that because their discussion was very intense. Was, was odd. Like, just very. Jordan was being very, I don't know how to explain, like, almost frantic or manic in, in his, in, in his approach to the discussion. So anyway, we'll see how that goes. I'm a little nervous about it. Let's, let's see. So. Anonymous says, hi, Jonathan. Do you believe that simulation theory represents a swell in the postmodern desire to believe that the reality we exist in within is inconsequential while also acknowledging the existence of a creator? Do you think it's a secular mask on biblical stories in some way? Thank you for all you do. I think it's. I think it's. I think simulation theory, at least like the vulgar versions of it. You know, I'm sure there are more subtle versions of it, but I think the vulgar versions of it is basically just a denial of understanding symbolism. It's like a. It's like they can perceive. People perceive patterns, and people perceive places where patterns break down. And so they see that we do that. So it's like we also create patterned worlds, but they see that as somewhat artificial, as not just a representation of our reality lays itself out. And so they end up having to posit a kind of a simulated world in which we live. And I always joke about that. I think I mentioned that before, which is that, yeah, we do live in a simulated world in the sense that there are different levels of simulation or of representations, and those are just language languages. That's just how it works. But what it's pointing to, these different, These different, let's say, embodiments or systems, right, that. That manifest something aren't pointing to some alien creature millions of years ago who created a simulation or whatever. Like, it's pointing to the. In. In the unfathomable of reality. It's pointing towards the something which is beyond word, the mystery which is beyond name. You know, the logos hiding in. In. In creation. And so the logos is a hidden, invisible thing. And the, the sim, the. The str. The symbolic structures, they, they. They point to it, but they never get to it. They always, they're always kind of pointing to it. You know, the, the symbol, this invisible mystery. So that's what I see. I, I always find it funny when I hear people talk about that. And yes, I do think it's. It's almost like. It's almost like a secular giving in to religion without wanting to acknowledge that that's what they're doing. And so it's very odd. So Marcus David says, which gods are behind the COVID lockdown? Is it the Cancel Culture God? The deaf? The Oedipal, Devouring, Mother Man? They're not very good gods, that's for sure. They're definitely. Yeah, we're definitely falling under. Under very strange principalities. Like, I don't know exactly how to name them, but it seems like the best way to understand that is that the world seems to be falling back under the principalities that were there in the time of. Of Enoch. Is what I. In the time of the book. The description, the Book of Enoch, you know, this, These. These moves between this kind of degeneracy and tyranny is, is very disturbing and very scary. And also the, the whole technological aspect of the lockdowns, you know, the whole tracking, identification, you know, police state. Like, I don't know if you guys saw some of the videos that have been coming out of Australia right now, man. It's like you feel like you're watching a movie, you're watching a movie. They've got police on the street going door to door checking in on people. And they had two people die of COVID In the entire country. Two people died and now they have police in the street, man. I don't know. It just seems. It's all out of whack. In my opinion. Desire to account for everything doesn't, Doesn't. Doesn't end well. So Anders Ralstad says, what is the role of Scandinavian northern countries in Universal Story? Is it recommended to see oneself as an actor in the Universal story? I think so. I think that. I think so. I think that the way that at least I see the Scandinavian northern countries has something to do with the symbolism of the north itself. It's. It's almost like a window, like a kind of a wild wind that comes down from the north and can be very dangerous unless it embodies itself. And so it, it. And so it's not just the Scandinavians, but like all the, even like the nomadic. The nomadic tribe that came down from the north, like the Huns or the, or the Mongolians coming down from the steps, let's say, into the world. There's like this wind that passes through and is very destructive. And. But then if it embodies itself, then it creates a very sturdy civilization. And so you can understand it also that the Middle Ages are basically, if you want to understand the Middle Ages, they're basically the conversion of the Scandinavians. And so both in the west, you know, the King of England, the kings of England, the kings of Normandy, you know, and so these strong principalities of the Middle Ages in the, in the west, the whole development of, of the night and the, the. The joining of a kind of heroic vision and with the Christian desire to serve the weak. Like, that's really the joining of those two together. And you see the same in the east because Russia was also. Russia is a joining of the Scandinavians with the Slavs. And that's how, that's how that whole world came about. So that's the way that I see that the, the. That's. That's the way that I see the participation of the northern story. And so we should bear, we should be very afraid of, of the northern people when they, when they move away from Christianity. We already saw what that looks like not so long ago. And as we see it kind of happen again. For now, they're very. For now, it seems like the Scandinavian countries are excessively kind of. How can I say this? They're compensating for what happened, you know, let's say last century. But it can flip because an excess of, of one leads to an excess of the other. And you can kind of get it. You can feel a little bit of that in the, in the air, let's say. So G. Garcia says you said in a video something like, I used to be a Christian Platonist. I don't know. Did I say that? Can you go into the nuance between Christian Platonism and having an incarnational view of reality? I don't know. Did I say that? I don't think I said that. You'd have to find. I don't think, I don't think I was ever a Christian Platonist. I mean, I'm a Christian Platonist in the sense that I think that I, I prefer Plato to the kind of materialism. I think, I think that I'm closer to Plato than I am to, to maybe to Aristotle. And so. And I think that St. Maximus has the best of Plato in him. And so in that sense, there's some value there. And so, yeah, so I think that kind of St. Maximus's synthesis, let's say, is the best one, right? Where he's taken the best elements of Platonism in the sense of the logi or these forms. But these forms only exist in their incarnational reality. And so to me, that is the best balance of the, you know, of Christianity and Platonism. All right, so Walrus King 14 says, hi, Jonathan. Would you say that there's a hierarchy of physicality? Symbols come from the unit of heaven and earth and meaning an earthly body, when not the purest form of a symbol contain actual physicality. For example, I know you've said in the past that you believe that the entire earthly ministry of Christ happened physically, that Christ had to physically exist first pattern to have real power. How can one apply this logic to the story of Genesis? If we don't believe that the Genesis narrative happened physically, but rather were the best means to describe them in human terms, does that not weaken the symbolic power of those patterns? How can we be, how can we be so sure that these patterns are as described in Genesis will physically manifest themselves? Now, if we can't say they physically manifested themselves in creation. Does this not make the Genesis narrative a lesser form of physicality than the life of Christ? I think you're just seeing it completely in the wrong frame. Like, I just think you're just seeing it in the wrong. In the wrong. Can I say this with the. Wrong, with the wrong lens? Let's say, and so this physically happened. I'm not sure exactly what it is that you. That you're referring to. I use the word event. I prefer the word event than the word physically happen. Because if you're me. Because the problem with, like, physicality is that it's been so corrupted by scientific description that as soon as someone kind of says that, it implies this kind of weird, historical, neutral, physicalist reality. And so I think that. I think that everything in Scripture describes events, but they just do so in different ways, and they do it for different reasons. And I've talked about that before. The reason why Genesis describes the world the way it does is because it compresses so much into it that the categories it uses are the best categories all brought together. They're categories of being, categories of existence, categories of meaning. So, for example, like, when you say that, let's look at what you said. Like, if you say something like, the stories of Genesis have physically happened, and so what exactly does it mean for the Spirit of God to hover above the waters physically? Like, what are, what is that? What are we talking about? Like, what are we talking about? If, if we're thinking of it in kind of these immediate kind of materialist categories, it's like, it's completely meaningless. The Spirit of God hovered above the waters. Like, I, I. You have to understand it as these universal categories of meaning which are brought into a story that really happened. And there's no other way to describe it than, than, than the way that it's described there. But you can't get under it. And there's no point of trying to get under it and trying to kind of see what's there. And so, so I don't know. So I don't really see that big of a difference between, between when I say that the story in Genesis happened and the story of Christ happened, obviously they're described in different ways. There's more in the story of Christ. We're talking. There's more. There's more giving in to individuality, right? There's more. There's more place for the person. The way that we kind of understand that today, there's more flavor, there's More spice. And so, but that's also because Christ is incarnational and Christ tries to gather all of this into, into God. I don't know how else to say it. I, I, I, I hope I'm being, I hope I'm not confusing people the way that I'm talking about it. Yeah. All right. So El Dorado says, what is the symbolism of kink and fetishes? I'm not going to read your whole, your whole question. And so what is a symbol of kink and fetishes? I mean, it has to do with the fact that the capacity for humans to have desires is unlimited. And it's also not only unlimited, but it's also imprisoning. So one of the reasons, let's say, why in the Christian church sexuality is tried, is they, there's an attempt to bring sexuality into marriage because it's a constraining of sexuality in a place where it can reach its fullest, its fullest realization, like its fullest totality, which is that there's an aspect of love, there's an aspect of pleasure, there's an aspect of also continuing the species. And it's done in a way which represents the relationship between God and the soul. Now, the difficulty with fetishes is that what happens with fetishes is people's desires go into a queer direction, in a strange direction, and then fall on strange things and then rest there and become obsessions. They become not just obsessions, but they become to a certain point, if you go too far in that direction, you will not be able to find satisfaction and reality in the normal relationship with a woman which produces a child. But you will be drawn out of that, into the strangeness of, of, of, of, of your kink, of your fetish. And so anybody, if you look at the specific kinks and fetishes, like a lot of them, they manifest what they are. They manifest extremes. Whether it has to do with, with using toys, with using exterior objects to participate in your sexuality. Whether it has to do with, with, with, with. With reducing your attraction to certain parts of the body. Whether it has to do with, with going towards violence. Whether it has to do with like, whatever it is. They're not arbitrary, they're completely meaningful. But the meaning that they're showing you is, is this kind of breakdown of sexuality into all its kind of weird possibilities and the trap that, that does, like, it can trap you in that desire. So, so, yeah, so I don't know. So, so I don't know what to say, you know, and so, but, but it's like, you have to understand that. That Christianity understands that marriage is like a cross, it's like a sacrifice. That marriage is a form of asceticism to a certain extent, that it's a form of constraining sexuality so that it doesn't get out of control and drag you down into itself. So, so that's the way that. That's the best way to. To understand that. Hopefully that makes sense to you guys. So, Jason. Jason Schweitzer asked if you've read lilith by George McDonald. I thought the book was quite amazing and feel like you might enjoy it, so I'll check it out. I know I've not read that book. Artemis Karnok says. Hey, Jonathan, thanks a lot for your work. If you had a talk with a New Age type regarding reincarnation, what your line of argumentation against it would be like. By reincarnation, I mean this idea of having different experiences in different bodies in different contexts and historical periods, the idea of soulmates and all that kind of New Age stuff, it's all hogwash. It's all bull. It's all. It's. It's. I mean, it's like. I don't know what to tell you. It's like that type of reincarnation thinking, like, the idea that, like, I was some other person in another time and now I'm this person. It's. It's vulgar. Like, it's vulgar even in terms of people, like, let's say, proper traditions that have, like, a vision of metempsychosis. It's like, it's a, you know, this, this idea, let's say, of passing through different bodies. That's not. This kind of vulgar version of reincarnation isn't even true in Buddhism. It isn't even true in Buddhism, and he isn't even true in, In Hinduism. It's like, it's a. It's a weird, modern, materialistic way of seeing the world. So I really don't have a lot of patience for it, for that kind of stuff. I always wonder, like, I remember, I, like, I have a friend that I love very much who's like a modern Buddhist, you know, like a kind of secular Buddhist, I guess. And I remember asking him, it's like, okay, so you believe in incarnation. And I am like, what is it exactly that gets reincarnated like, you believe in. You believe in. Let's say you believe that all is Buddha, that all is one, or that all is. Is ended. So it's like, what is it that's Being reincarnated. And I don't think they really. That that type of person don't really have an answer. Which is sufficient. Which is. Which is sufficient metaphysically. So do you mean that like the discrete. These discrete souls. I don't know. I just. It. It just doesn't. A lot of it. I don't. I'm not a big fan of that stuff. Sorry. So Norm Ghon says, hi, Jonathan. Are sneezing and coughing fractal relatives of exorcism? That's a good. That's a good statement. I kind of like that. Yeah, I think that's something like that. But like, let's say a physical version of what exorcism is, you know, this kind of casting out of the bad, let's say. All right. Okay. So how many questions do I have left? Probably a lot. I probably shouldn't even look at how many questions I have left. All right, so Dusan Babik, baby. Sorry, sorry, I didn't pronounce your name right there. Dusan Douche. Yeah. So what is the meaning of the two censuses in the Book of Numbers? Is there a symbolism in census figures themselves? I don't. I don't know what the. The. The. I don't know. Like, I talked about the idea of taking a census before, so I have to look at it specifically. I don't think I remember the context of that. I have to admit that the Book of Numbers isn't my favorite book. I should. I should have the patience to get through it. And I. I have. I've several times. But it's one of those things where it's like. I know genealogies have a lot in them, but they really require quite a bit of attention and capacity to attend to detail, to understand them. So Brett says, did Jesus Christ pass away because he broke sacrilege laws when he took the world's sin upon his holy body, the Ark of the Covenant? Or. Haven't been watching too many of your videos. I don't think. I think. I think. I don't think how you could get to that. That. I don't think you could get to that conclusion by watching my videos. I hope you're not getting to that conclusion. So the idea is that Christ gave himself. Like Christ died on purpose. He knew that he was going to die, and he says it right. So it's like. It's there in the story. Christ says, I'm going to Jerusalem. I'm going to die. He knows and he does it. And so it's not like Something that happened to him completely. Yes, it happened to him, but he was fully participant in what he did. And so it was an entering into death to kind of. To fill up death with God. So that's what he was doing. And in doing that, yes, he did become sin, take the sin on himself in the sense that he went all the way down and kind of emptied himself in that manner. But it's not as simple as the idea that he broke sacrilege laws. So Kevin Patterson says, watching the Olympic soccer, I notice each player acting as a head to possess the massive body of the ball. The players submit themselves as body for their team's head. Then, acting as a single entity, they go inside the opposing team and turn them into potential. An opening appears and they square the circle, goal frame, the ball. The soccer field Earth is held suspended in space by every player, communing with rivals and conforming to the soccer tradition. If sports can express the pattern of logos, should we all become athletes? And so I think your intuition about the sport is right. You know, it's like that's with the way you describe it, is very much what sport is. And I think that there's definitely a place for sport in understanding kind of the symbolic pattern, you know, and even St. Paul uses the image of. Of the athlete as an image of, Of. Of the spiritual journey. But there's. It's a little limited in the sense that it views reality basically as irreducible opposites. And so it has a function, but it's not. It doesn't show the fullness of the truth because it frames reality as two opposites, that one has to conquer the other kind of these two opposing opposites that have to conquer each other. And so it's more like war is what. So it's not like there isn't a symbolism of war, definitely. And so it participates in the symbolism of war. So Jan Peter Jager says, Would. Would you. Or do you use inspiration regarding your icon carving if it comes to you in a dream, or would you reject it since it comes from an evil principalities? It is hard to discern. I mean, not for icon carving like I. My icon carving is really based in tradition. I don't. I wouldn't like. I wouldn't base my icon carving on a dream. I think that in the peripheral aspects of an icon carving, there is room, there is flexibility, let's say. And so I can have. Sometimes I can introduce idiosyncrasies into my carvings, but it usually ends up being, like I said, peripheral to the main Character. The main image always has to be something which participates in tradition, unless it's an icon of something that's never been done before or icons that I can't find examples of. And then I'll. Usually it'll be more of a meditative practice where it's. Where it's like, I read the story or I look at the life of the saint, and it's more of a. It's more of a kind of meditative approach than giving into dreams. I'm not a big fan of giving authority to dreams, to be honest. I don't tend to do that in my life. Sometimes I wake up and I can interpret my dreams, but I'm always, always very careful not to make that a central aspect of my life. So Dionysus says, after a recent experience on a Christian discord server that focuses on debating Orthodox theology with Muslims, it became quite clear to me that a lot of theological discourse tends to become the breeding ground for harmful aspects of the soul. I believe that concentrating on symbolism and the practical work of developing the higher qualities of the soul is a much better idea. What do you think is the role of theological discourse in relation to different levels of spiritual development, and how should it be engaged with, especially at lower levels? Yeah, I mean, you've noticed that I'm not a big fan of the debate mode. I think it has its usefulness, and I think it's also. It's also a function of. Of different roles in the church and different roles in Christianity. And. And I think that, you know, there are saints that have been polemicists, you know, all through the history of Christianity. And so I don't. I don't think that there's anything wrong with it in itself. But I do agree with you that I think it's a dangerous space for the passions. And I think I agree with you that I've seen in some of the debate space, people who give in that they don't shine in their brightest light in those moments. But I don't think that it's necessarily that there's anything wrong with debating in itself. I think that I. There's a weird thing on the Internet, and I don't. I mean, I guess I understand it. I. I guess I understand it, which is the idea that it's like. Like a lot of the people that are debating are catechumen, or they're not even Orthodox, or they're not. They're barely Christian. They just converted, or they converted two months ago or. And there's something about that which makes Sense, which is almost like the guard dog, right? It's like, you know, it's almost like the, like I've talked about this before, where it's like the prison guard shares very much the same nature as the prisoner and has to, because he's the limit. He's the edge between the order of the prison and the chaos of the criminal. But they have something, they have to have something in common. And so, and so I think that there's something about that too, which is it like the new convert or the not even yet converted has a kind of guard dog mentality where they want to, like, they want to define the limit. And so they engage in this kind of, this kind of almost warrior like attitude where they wanted, like they want to find the limit, they want to define it and they want to make sure they're on this side and that, you know, the bad guys and the others are on the other side. And so I think it's almost like, it's probably like an inevitable aspect of this process of the Church. But like you said, there are dangers to it as well. But there are also dangers. There are dangers in not doing it. There are dangers in not engaging at least in some aspects of the Church in debate and confrontation to what's false and what's not true. Because then you get, then the Church into the Church will seep in all of this nonsense and all of this chaos and all of this, all of this kind of, you know, all these bad ideas. So, you know, I, I understand it, but you're not going to see me do that. It's just, just not gonna happen. It's not in my nature. So. Hi, Bishop. So Stephen Bishop says. Hi, Jonathan. Can you talk about the symbolism of the double headed eagle, especially as it relates to empire? Thank you. And so I talk, if you want to read about that, I talk a little bit about that in my articles on the orthodox art journal on the symbolism of the left and the right hand. And it has to do with something like authority and power. It has to do with something like the two keys of St. Peter of, let's say, the Church and the state. You know, you can understand it that way. The Church as spiritual authority without physical power and the State as temporal power. Physical power, whose authority isn't in itself has to come from the other side. So you can understand it as this, this motor of reality, which is the notion of, yeah, spiritual authority and temporal power, at least that's the way that I understand that. And those two are joined in Christ in different Ways and in his icon you actually see this manifested in the icon of Christ himself as the blessing hand as, as Christ, you know, as Christ blesses he, he manifests this kind of direct authority and then usually in his left hand he'll have a book which is this indirect, this indirect or secondary aspect. So like you have direct language, then you have written language which is like the law or the, you know, the, the, this kind of materialized authority. And so that's what, that's, that's the relationship between the spiritual and the temporal and the relationship between the church and the state, let's say in the kind of Byzantine understanding and then later in this idea of the Holy Roman Empire in general because the two headed eagle ends up, you know, finding itself in, not just in the Byzantine Empire but you know, in the Austro Hungarian Empire and then in Russia and all these other places. So. All right, so Hayden Este says. Hi Jonathan, can you elaborate more on the symbolism of arcs? Discussion, identity and relation of this to the flood has made me think about how it seems the identities of people as individuals are being washed away by modernity. The solution that immediately comes to mind of course is an ark. But A, I do not fully understand the symbolism of arcs in general. Do they relate to crucibles or the ouroboros? And B, it seems to me that since the issue of, is the erosion of individual identity, the solution would be an individual arc. Does this make sense? And if it does, how could one go about to building such an ark for oneself and for others? Thank you for everything you do. I've learned so much from your work and it's changed my life for the better. Well, thank you, Hayden. So you can understand it fractally is always the best way to understand it. The church itself is an ark. You've heard that probably before. And the ark isn't always what we think. We tend to think of the ark. At least now we're not talking about the ark of the, of the, of the, of the covenant, let's say. Although the Ark of the Covenant has some of that too. But like I said, the ark of Noah, the idea of creating the ark, the ark in that sense, it's a, it's a microcosm. So the ark, the ark isn't just about containing that which is pure. People tend to think that. But it also has the animals in there. It's like it has, it has the bird, it has the man and it, and it has the animals in there. And it's also, it's also a techne it's also, it's a, It's a garment. It's a. It's a constructed thing. It's like a temple. It, it has an aspect of it which is also a kind of artificial thing. And so the church has all that already. So that really should be the ark. But if you're thinking about, let's say, building an ark, so you could say that one of the things that I'm doing is trying to build an arc. That's maybe a good way to understand what I'm trying to do, which is that I'm trying to create a way of speaking about things that contains both. That contains the pattern in a way that can be held together, let's say. And so I think that that's one of the things that I'm trying to do. There are arcs you can find. I've talked about how Dante's comedy, I think, is. Is a kind of arc because it, it has all of that in it. So I mean, my answer is the answer that I've been. That I tell. They say all the time, it's basically, go to church. That's the answer. Sorry, man. So Josh says hello, Jonathan. First, I wanted to say that thank you for all the amazing work you have been doing. It has a real impact on my life, and I feel like I'm revisiting a language I've not gotten to. To use. Use in some time. All right, my question has possibly been asked already. All right, let's see. What is the symbol of wisdom being represented as a woman in the Bible? I have some thoughts in terms of wisdom as a vessel for the promises of God, but would love a broader understanding. Yes. And so why is wisdom represented as, As a, As a woman? And so it's, you have to understand it at least in the, the kind of the Solomonic tradition, like in this, this Solomonic text that it has to do with. Wisdom has to do with, with a kind of incarnation. It has to do with applicability. And so you have, you have wisdom and you have, let's say you have understanding and you have wisdom. So you have a kind of abstract theoretical understanding. And then you have wisdom, which is the applicability or the, the ink. The, the, the. That's why wisdom is always like advice. Wisdom is like, do you know if you do this, this will happen. If you do that, this will happen. So wisdom incarnates an abstract pattern. And so that's why wisdom. So you can understand, like in the, in this, the. In these Solomonic texts, you can under it's like it's understanding, calling to wisdom. And it seem seen as like a kind of sexual union. And so you have, let's say, the higher aspect and this kind of applied aspect. And so that's why, like in the Scripture, wisdom is referred to as feminine, but in the tradition, wisdom is referred to as Christ. So it's like Christ is wisdom because Christ is incarnate. And so the way that it ends up being solved, in my opinion, the most appropriately is not in the theology, but is in the art that the image of Christ sitting on the Virgin's lap, the throne of wisdom that it's called, that is the true understanding of the solution to wisdom, which is the idea or the totality of this problem of the masculine and feminine in this calling, calling that we see in Scripture. And so you have the Mother of God as the frame, the Mother of God as the seat, as the place in which the divine Logos enters. But she's also a throne. So she creates the frame. She legitimizes to a certain extent, legitimizes, makes earthly, this divine Logos that comes into her. And so Christ sitting on his mother together, to me, that is the best image of wisdom, like the best image of wisdom, you know, if you want to totally understand it. But what's there in the Old Testament is totally appropriate. And I think that it's taken, it's taken in problematic areas. Everybody who's orthodox knows about the kind of, the problem of sophiology that has appeared in the 20th century. And I think that it becomes problematic. And, and there's a reason why we, we tend to always want to show the Mother of God with Christ, because that's the proper way to perceive wisdom, is that as this, the actual incarnation, which has a physical, bodily aspect and a seed aspect to it, at least that's my, that's the best that I can do with that. But it's a, it's a tricky subject. The whole wisdom thing, the whole Sophia thing is tricky because it's so controversial in the church right now. All right, so Romer asks. Hi, Jonathan, could you share some thoughts on the differences and similarities between the symbolism of the hand, the eye, the foot in terms of the right and left example, left eye versus symbolism versus left hand symbolism or right hand symbolism versus right foot symbolism? So I'm still thinking about that. I keep telling you guys, I'm promising you a very complete version of left and right symbolism. But I think that that a good way to understand it has to do with this crossing over of the left and the right that we see. And so I think that when you see a text that talks about just the left hand, let's say, then it's usually, then it's not differentiated, but sometimes you'll get a sense that it's differentiated. Like, for example, in the image of the transfiguration, you really get that in the image of the transfiguration because you see Christ above with, with Elijah and, and Moses. And then you see St. Peter, who is usually like ahead, like across from, from Moses, and then St. Andrew who's like across from Elijah. And so there's this crisscross thing that happens. And, and I think that that's what's going on with the left hand and like the, the relationship between the left above and the left below, let's say. And so, but I don't want to go into that too much because every time I start talking about that, it, it becomes very complicated. But you can find, you can find a few videos where I, where I try to explain it more fully, but I. It's coming. I will, I will definitely make, try to write something or make something which is which. Which brings it all together. So, Joe Kelly o', Neill, what symbol would you focus on first when beginning to apply symbolism to your life, especially when trying to understand your own story? I mean, you should obviously focus on the symbol of Christ in the sense, not of thinking that you're Christ, but as the ideal or as the model, because Christ is the symbol. Like Christ is the ultimate symbol. Like all symbolism points and is resolved in Christ. So you've already got it, You've already got the place to look. It's. When you talk about other stuff, it's always to kind of help people understand why this, this story is not arbitrary, the story of Christ. All right, so Amy says, I hope I don't sound super woke here. Oh boy. So what are you going to say, Amy? I'd love to see you talk more about late capitalism and neoliberalism's role in pattern inversion. As I've seen, you have a lot of knowledge on the subject when. Push another conversation. For example, when speaking of male and female pattern versions in movies, I think there's a huge part missing about capitalism in which the same patterns are used because they are proven to make money. Therefore women just replace men in roles instead of women actually having their own movies. I think viewing that from a lens of women being ignored because they're not guaranteed to be profitable is a part of why we're seeing this pattern inversion. Yeah, definitely. That's for sure. I'm just using gender moves as an example, but I'd be interested to appreciate to hear your perspective and if possible, would love to hear you speak more on the topic in the future. I mean, I'm not a big fan of. Of capitalism, neoliberalism, just like I'm not a big fan of socialism either. I'm not a. I find. I find. I find the modern situation problematic. And that's why I don't talk about politics too much, because I don't really see an easy solution within this kind of weird. This weird setup that we've got, like this kind of modern state, you know, materialist culture. And so to me, the capitalism and. And communism are just two. Two sides of the same evil coin, which is to believe that. To believe that. That. To believe that realization comes from material gain, comes from material comfort, you know, it just doesn't. So, you know, but what you're saying. But sometimes the money thing or the commercial thing can be helpful. It can help you see certain types of patterns because let's say the market has its own type of hierarchy of attention. It can help you understand the hierarchy of attention or sometimes like an inverse hierarchy of attention too, sometimes because it's kind of like desire let loose and then the market trying to fill up desire, which is why it ends up, in a way being destructive because it's like. It's just whatever you want. You can just get whatever you want. But I agree that I think that. That. That in this kind of weird thing they're doing in movies, they're trying to. They're trying to. To kind of use something which they know gets people's attention and then trying to. Trying to kind of play a strange trick in it, you know, to. To. To. To have us still pay attention using the same trope, but then replacing the. The main kind of character of a very successful movie that makes a lot of money and then putting a. A woman in that. In that role. But you probably heard people use the. The expression get woke. Go broke, right? And so there's also reality to that, which is you try to push that too much, then people stop caring. You know, if it becomes too explicit, then people stop caring. And that's going to happen. It's already happened. It would happen in a. Last In. In many of the. Of these. These kind of movies where they push that too far. All right, so Angel Terpstra says, what is the symbol, Significance. Significance of the bush and the burning bush? What makes it different from a Burning tree, does it relate to hiddenness? Or does it maybe weave a symbolic threat to other instances, a thread to other instances of bushes in the Bible? I think it does. I think it does. I think it's a thorn bush. And St. Gregory of Nyssa, if I remember correctly, says that it's a thorn bush. And if it's a thorn bush, and it really has to do with the Incarnation, it has to do with the idea of filling up the entire world with God's presence. So it's like the thorns are the consequence of the fall. And so having a thorn bush be a bush that burns and is not consumed, it really is kind of all of this fallen reality which is contained in this image and is. Is being filled up with God. And so because it is this kind of total. This total material reality. That's why if you look at icons, you'll often see that the bush is the mother of God, the bush is Mary, and then Christ is the fire that is burning and not consuming the bush. And it has to do with the virginity of the mother of God and a lot of the symbolism. So Chandler Turner says, I know you won't have much time when you read this because you see that toward the end of the questions. Do you. But I would appreciate some quick remarks on Joan of Arc. I've learned more about her story recently and found it rich with symbolic content. I bet it would make a great video. I think I mentioned her before. You might not have seen that video. But I talk about Joan of Varrock almost like us, like saving the Amazons. It's like a Christian version of the Amazons where you have a warrior virgin who now serves the king. And so that would be something like the saving of the Amazons, where the Amazons are brought into the Christian story in a way that can participate in the Christian narrative. Yeah. And it also has to do with. With something like the incapacity to recognize that as well, or to. The people in the story of Joan of Arc were not capable of seeing this exception of understanding Joan of Arc as an exception, but as an exception which was kind of filled with God. And that's why they. They basically betrayed her, you know, And. And she was betrayed because Joan of. In the story of Joan of Arc, you have all kinds of stuff going on. You've got cross dressing, you've got this refusal to be married, and you've got a warrior woman. You've got all that going on. But she doesn't do it out of a desire to change the structure of reality. Or to take over or to invade, but she does it to serve God and serve the king, and she does it in a vision. And so it can probably be a very powerful way of understanding how some of the stuff we're seeing, it's kind of like a St. Christopher symbolism, how some of the stuff on the edge can actually flip and participate. Because I keep saying Christianity is a non dual proposition. Things like Joan of Arc are going to be part of the story. They just have to be in their proper place and looking in the proper direction. So. All right, so Enrico says, hope you are. Well, you have alluded at times that death of Christianity or decline is in fact part of the Christian story. Do you mind expanding on that? What is pointing to it and describing that or how should one understand it? And what is supposed to happen after this period? I mean, the, the, the, the proposition is simple. The proposition is that the story of Christ is being repeated at different levels and it's being repeated in different bodies that are growing, you could say. And so there are several ways of seeing it. You could probably see different. Several versions of that, but you could almost understand it. Like Christ dies, and then that death becomes the seed of this transformation and the seed which becomes the body of the, of the Church. The church as a body which joins the body together. It's resurrection, of course, obviously, too. And then the martyrs die, and then that repeats that pattern and creates converts Rome. Right. So the Martins martyrs die at the hand of Rome and they convert Rome and then there's another layer. And that layer is like a bigger layer, like a cosmic layer, you could say. So, you know. Yeah. All right. So Ari Fisher says what. Hi, Jonathan. What would, what would be your main critique of Revake's option? What do you think of his critique of theism? I think I've, I've said this very many times. I like. I love John. I think he's. He's a very sincere and authentic person. I think, like, my difficulty with the option is that is that it is fragile. You could say it that way in the sense that it's idiosyncratic. And so because it's idiosyncratic, it can maybe help people on an individual level, but it continues to participate in the breakdown because it's like everybody has their own little practices and everybody has their practices and their kind of idiosyncratic practices, and those aren't submitted to something. And also the problem of New Ageism in general, which is that if you're not part of a body that has some authority Then you end up just doing the things you want to do and you have nothing to confront you with the disciplines or the practices or the transformations that you don't want to, that you don't want to, that you don't want to have. And so that would be it. I don't know how it happened, but in several years. It took several years for this to actually manifest itself. But it seems like I found the secret of infinite Q and A energy at first, in the first times. After like, like after an hour I was like exhausted and now it's been two hours and I still feel like I've got, I've got some, some energy. All right. And so. All right. So yeah, so I'm going to go into the super chats and see what's there. So I hope everything is okay. And, and I'm sorry to Lisa and Brad, because when I make these Q and A's last forever, I basically, I basically make them suffer very much because it's very late for Lisa. You know, I, I would totally forgive you if you went to bed. Lisa and, and Brad, if you guys, if you guys checked out and. All right. Okay, so here we go. Okay, so the Grubmeister for five Australian. I think what is this symbolism of tickling? I mean, it has to do with the symbolism of losing control, right? You know, we talk about, I've talked about how, you know, this tradition that Christ never laughed probably has to do with this idea that Christ never lost control of himself. And so tickling is such a beautiful image of that because it's basically, it's like, it's like I'm stroke, I stroke your skin and you laugh, right? It's like I, I, I, I stroke your edges and that's what makes you, makes you lose control of your, of your consciousness. And so it's a pretty, yeah, it's, it's pretty simple, I would say so. The ABC 123-45-6399 for 50 USD says Marsoian Times Pejoan gangland. I have no idea what that means. The abc, but thank you for that very generous super chat. All right, numero for 549. How does a proper relationship to anger look like practically in Christian terms? What is the symbolism of anger? Keep up the great work. And so anger, anger is, anger can have, it has its, its proper place. And anger usually has to do with the reestablishing of sacred space, you could say, or the re. Establishing of social space. And so, you know, to see Christ, how Christ turns the tables, you know, of the, the money changers is the ultimate example of anger, the ultimate example of righteous anger, which is putting things back in their place. A re. A purifying of the, the chaos of a space in order to make it proper, you know, and so that's the proper use of anger, let's say. But it's, it's tricky, right? Where St. Paul says, get angry, but do not sin, it's tricky because. Because anger is a passion. It's, it's a dangerous game to play. Like, you really have to be a holy person to be able to, let's say, manifest holy anger. So Sarah Senzig for 10 USD says. Thanks for your vids, Jonathan. Thank you. Thanks to you. I'm thinking of taking the leap from Lutheranism to Greek Orthodoxy. Well, thank you. Thank you. It's good to. I'm happy if I can play a part in your story. So, David Furtado for two brl. I don't know what that is. Is not caring for your health is sin. It can be. It depends. It can be. If you do it out of, out of pride, then it can definitely be a sin, you know, and you people can definitely do that out of pride, not take care of their health. You know, this kind of desire to punish yourself could, is. Can also be a kind of sin if you're doing it, you know, out of pride, all of this stuff. Yeah, but I, I would say that there are definitely saints that did not take care of their health, but they did it for the right reason, I would say, because they were completely focused on, on God. I mean, there are some crazy stories, man. You read the story of, of Saint Simeon the stylite, man. There are some nutty stories that I don't know if you've seen some of these legends of Saint Simeon, you know, the idea. They found Saint Simeon, you know,' standing before. He was on his pillar. He was just standing and, and he was, he was so inattentive to his body that he had maggots, like, growing on him. Like he had maggots falling from wounds in his flesh. And the maggots would like, turn to gold, things like that. Like crazy, crazy stuff, crazy stuff. But take care of your health. You know, you're not, you're not a monk, you're not a, you're not a, an ascetic who stands on a pole when you are. Maybe, you know, it'd be justified that you not take care of your health. So Michael for 5 CAD says, notwithstanding whatever their efficacy, what is the symbolic nature of mandatory forced coerced vaccinations. I mean, it's very odd. It's all very odd. It really has to do with a desire to control everything or to account for everything. And especially the desire to have everybody vaccinated. There's this push to say everybody has to get vaccinated. And it's like, it's ideological, it's not even medical anymore. Like, why would you have your little kids vaccinated for Covid? And so there's this like super, this really, this push and it, and it really has to do with, with the desire to control, but it also has to do with a kind of weird sacramentality. You know, it's like there's a quote, I think it was, it was Jacob Russell who posted a quote by Chesterton in which he said, you know, that the, the secular state is completely offended at the idea of child baptism but is completely okay with vaccinating all the children, you know, because it, it also ends up being a way to show that you participate in society. And a lot of it, a lot of it seems to be that right now. And so this kind of weird scapegoating of the non vaccinated and this desire for, this desire to kind of show that everybody who doesn't get vaccinated is somehow not a good citizen and all that, it's just very disturbing. All right, so paradox for 199usd asks the same question. What's your opinion on the COVID 19 vaccine? So, I mean, I'm going to be talking about, I know you guys are waiting for, and I haven't done it yet. I keep saying I'm going to make a video on the Mark of the beast and I'm going to deal with the pronunciations of St. Paisios on the vaccines. But I'm careful. Like, I'm careful just because as soon as I announced I was going to do that, I received some emails from people that I trust who knew paisios and new people who knew paisios very well. And they warned me to be a little careful on that. So I am being careful, but I will do it. I'm going to talk about it. I'm just going to try to do it in a way that is, that is responsible and not, you know, but I'm not going to compromise on what I'm going to say, that's for sure. All right, so Grubmeister for five Australian, what is the symbolism of the Jews? Why did Christians variously restrict you socially or geographically during the first millennium? And medieval period. It's a, it's a very difficult subject, obviously because it's very fraught and it's very, it's very political, you know, and it has, it's difficult to talk about that without people getting into weird ideas or, or falling into certain strange narratives. But a way, like I, let me give you a little hint of how I see this. It has to do with the fact that out of all the religions that existed at the conversion of the Roman Empire, the Jews were the only ones that, that were accepted to continue to exist, let's say. And that created a dual relationship between Christians and Jews, which is that on the one hand Christians preserved Judaism and on the other hand the Jews became the, the, the remainder of an old world for the Christians. And in that imagery of the remainder and the outsider, the only accepted outsider, let's say, permitted outsider to coexist. Then the Jews also took on all the negative aspects of that like in terms of narrative. And so they became marginal, they became, you know, all of that. And so. Yeah, and so that's how it works. And it also, the Jews themselves also wanted to remain separate from, from Christians. And so you ended up having a story of something which replaced something else. And then that thing that was replaced continued to exist. And so it becomes very complicated in terms of what it manifests, let's say in terms of this remainder and outsider who's not completely outside. Right. He's like the, he's kind of like the, the, the, this idea of the, the two brothers, let's say that are, are together but are in conflict. A constant kind of low key conflict. Yeah. And so that's as much as I'm going to say about that. All right, Diego D' Souza for 10 BRL. I don't know what the, all these, these currencies are. Sorry. Is there an essential separation between Christian union and perennial school perspectives on symbolism and how it can affect our lives? I mean, yeah, I think there's a, there's definitely a difference. And I mean, I think that Jungian, let's start like there's a difference between Jungian and perennial school symbolism because the Jungian sees it as a first, as a modality of the psyche, whereas the perennial school is probably closer to the way that I talk about it, which is that it's, that it's actually the way reality works. Like it's actually reality itself has a symbolic pattern and it's not just like the psyche or projections of the psyche, but the difference between Christian and perennial school symbolism. Which is the reason why I completely embrace Christian symbolism rather than perennial symbolism is that I think that the perennial symbolists, they end up being, having a kind of weird modern abstraction in the way they do things because they, they separate themselves, even though they don't. If you ask them, they'll say that's not what they're doing, but that's what they end up doing. They separate themselves from traditions, kind of stand above them and then look at all the symbolism and then talk about it, you know, And I think that that's, that's not good. I, I think it can be a little useful. But I think that the wonderful thing about, about Christ and Christian symbolism is that it contains, it's all there. And so I, I, I have, I live in the Christian story and I am a disciple of Christ. And once in a while you'll hear me point to things that I've seen in other areas or even in other religions or an ancient myth or in fairy tales or whatever, and I'm fine to do that, but I don't, I never, I really, really avoid trying to speak as if I'm kind of standing above everything and, and interpreting it. So, so, yeah. So you'll probably notice a lot of the moves that I make have to do with that. A lot of the types of things that I say and the way that I speak about things. Kimberly Bolger says, does your wife study symbolism too? Curious about how other women are connecting to the Bible. Thanks for your work, Jonathan. No, my wife doesn't study symbolism. She's very little, she's not that in. She says sometimes that she's interested in what I'm doing, but it's not, it's not. You know, I love her very much. I love my wife, but, but it's not her thing. Like, she's, she, she's, she's a, she's very good for me because she is very intuitive and very, like, embodied. And she actually has more, more what you would call something like mystical visions. Like she has these types of experiences. And so, and so, so we, we don't totally, we don't meet in our theology, let's say, but I love her very much. But it's not, we, yeah, it's, it's interesting. It's probably good for me to, to that. It's like my wife is not my fan. Like, let's just say it that way. All right. Okay. So Andrew Mansour, for $5, says you mentioned Oriental versus Eastern Orthodoxy. Do you consider misfa zitism heretical? Agree on uniting, man, It's. I, I don't like, let's say as an Orthodox Christian, I have to say, yes, I think that it's heretical and agree on uniting. I'm not. I'm not a priest. I'm not a bishop. I'll let them deal with that. I'll let the authorities deal with that. I think for sure that I find great interest in, in Coptic Christianity and Ethiopian Christianity, in Syrian Christianity, in. In all the ancient branches of Christianity, I found great resource. But, you know, I, I don't. I also don't. I don't agree. I don't like just trying to bowl over the differences and to try to. To just. To just pretend like the scandals which happened in the church didn't happen. They did. And we're where we are. It's part of the story. But nonetheless, that's. That's. That's the story. All right? So Mashkowski for Maskovshi. Sorry for 10 Pennsylvania pen. Hey, you. Hey. You ever heard of puddle analogy? Is the theory that any idea of design we see around us is just the product of chance and we force meeting on it. Does that devalue the symbolic. I mean, it's just. Yeah, whatever. You know, let's, let's, let's, let's, let's. Let's break that down like maybe once and for all. Like, in terms of. That this idea of any idea of design we see around us is just the product of chance and we force a meaning onto it. All right, so let's break that down in terms of this kind of atheistic way of seeing things. And so you, therefore, you're also a product of chance and your capacity to see design is also a product of chance. And so what are we even talking about anymore? Like, what are we even talking about anymore? Like, the processes that made the patterns you see in the world are the same processes, whether you even believe in God or not, that made you. And so if we force a meaning on it, where does this capacity to force a meaning on something come from? Are we standing outside the world? Are we like these aliens standing outside the world, forcing meaning on reality, that it totally breaks down? Like, once you take the whole thing seriously, like, once you go to the end of materialism, even it breaks down because you have to reconsider consciousness as part of the system. You have to reconsider your experience as part of the system. And people who can say that, like, so, so, so, so who is the person who's perceiving the puddle? Like, where who are they and how do they perceive the puddle? And then all of us other idiots are those that perceive the meaning in the world and are imposing meaning. And there are these secret mystics, scientist mystics that are, are able to perceive the puddle. Like, I don't even know what they're talking about anymore. When we get there, it's like, ah, man. Yeah, there's. There's such an extreme duality in the way that there's like Descartes just ruin people's thinking. And not just ruined it, but made people blind. Like people are blind to their own experience of the world. And it's like. Yeah, so. Yeah, sorry. So Matt for 499 USD says, what is the symbolism of Simeon Biles of the US Gymnastic for going the gold medal for mental health? Seems like a sign of the end of the world. I don't know. Who cares? Oh man. My capacity to pay attention is, you know, reaches its limit in terms of like the little idiosyncratic stories of Olympic gymnasts. I'm sorry. You know, whatever. Sorry. All right, so Vidu Zui for 5CHF says, what does Christ mean by the road, by the Broadway and the narrow way when most people really go to hell? Or is there another interpretation to that passage? Oh man, will most people go to hell? You have to. You. Okay, so you have to understand it. You have to understand it like a mountain is the best way to understand it. You have to understand it like the world is made of a thread, a golden thread. Right? And the golden thread is that which connects God to reality. And so it's like so hidden in the multiplicity, hidden in the idiosyncrasy of the world is a golden thread. Now you can understand the golden thread like a thread, or you can understand it like a hidden pearl. You can understand it like a fish that is hidden in the chaos that you can fish out of the water. It's all the kind of same symbolism. And so the idea is that, is that most people get lost in the chaos, get lost in the distraction of the world and they're not able to, to, to find and to walk on that ontological thread which connects reality to God. And so it has way more to do with that then. Then it has to do with a description of who is going to hell and who's not going to hell. So yeah, so that's my answer to that. All right, let's see. So I think we're done. Let's just see. Let me reload this and see what happens. All right, we got a few more. All right, I'm totally have energy. If you guys are still willing to go, I'll keep going. I don't know where I get it from and I used to check out. It's much faster. All right. Okay. So not. Scotty's for five USD says, what is the mirror by which we see ourselves? Or the. Wait, what is the. Sorry, where's the mirror by which we see ourselves? Or the mechanism of self reflection? I, I don't totally understand that question. Maybe it's because my mind is turning into mulch right now. I mean I, I kind of understand it, but I don't totally understand it. Charlie Longoria for 5 USD, what does it mean that Lot's wife turned into a pillar of salt? What is the significance that it was salt that she turned into in that case, in the case of Lot, I think it has to do with something like, like, it has to do something like the ocean, like a weird, like a crystallization of the ocean. Like it also has to do with something like, like flavor or like spice. I've talked about spice before as, as a, as a kind of something which is added and so something which is outside and added to the world. And so I think it has something to do with that. But I, this is speculation on my part. I, I feel it's speculation as I'm saying it. So don't take that to the bank. As we say. So the ABC went to Z456399 for 50 USD again, my goodness. But thank you. Bodybuilding, lifting. What? I don't know. I don't do lifting. I'm not, I'm not super. I'm not very good at the whole exercise thing which, which I should probably solve very soon because like I'm get. I'm like. When I'm 46 now and I've got that little belly that won't go away. So I need to, I keep telling myself I need to get to it, but I just. Man, I'm just too much. That's where I'm still a little bit of a, A little bit of a gnostic in the sense that I struggle to, to, to care about my health the way that you asked. Someone asked me before. You know, my wife gets so angry with me sometimes because like I, when if I get sick, I just act as if I'm not sick. I try to act as if I'm not sick all the time. If something's wrong with me, I just try to pretend that it's not there. I think that's also, like, a weird masculine trait as well. And I also hate exercising because I feel like I'm wasting my time every time I'm exercising. All right, okay. So Samuel Ramalaire for 10 BRL says, hi, Jonathan, I've read the Hindu story of Narasimha that really talks about the power of margin and middle identities you've been talking about. Can we read our tradition with. Read our traditions with our symbolism. So I don't know. I, I don't think I, if I, I, if I've read that story, I don't remember the name. So I don't. I don't know. So sorry. So sorry about that. All right, so I think we're done, guys. And I think with this, some of the crazy stuff going on in the chat, I think. So I'm gonna go, guys. All right, so thanks, everybody, and sorry to Lisa and Brad, who are up very, very late. And so I will see you. I'll see you next month, everybody. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pajot videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
