{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":0.64,"end":106.06,"speaker":"Jonathan Pageau","text":"Hello, everybody. I'm here with Dr. Mario Bagos. Some of you who are following all of this exciting universal history that I've been doing on my channel have seen my discussion with him on the mythical aspect of Constantinople. Mario is the author of a very interesting book on the symbolism of kings and emperors from the near east all the way to Byzantium. And so he's really bringing to light the things that we want to talk about in terms of the, let's say, the more legendary aspect of these civilizational motifs. And so today, what we want to talk about together is this image of the immortal emperor, the image of the marble emperor, and the notion of this emperor that kind of goes to sleep or vanishes and then comes back at the end that we see in the Byzantine tradition, but also we see in the Western tradition and all kinds of motifs. And we're going to dovetail that into a discussion about apocalyptic motif in Byzantine thinking. So I'm very excited to continue the discussion on Universal History with Dr. Mario Bagos. This is Jonathan Peugeot. Welcome to the symbolic world. So, Dr. Mario, thank you. Thank you for joining me a second time. I know that the reaction to our first discussion was really, really exciting, and people were very fascinated by the things we're talking about. So I'm looking forward to our discussion today."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":106.38,"end":113.98,"speaker":"Dr. Mario Bagos","text":"Likewise, Jonathan. I'm very much honored to be here again and I thank you for inviting me again. It's a great blessing."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":114.86,"end":126.3,"speaker":"Jonathan Pageau","text":"So tell us a little bit. So I think we just need to dive right into it. So tell us a little bit about the legends of the Marble emperor and the different versions of it and how this kind of ties into to universal history."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":126.7,"end":510.85,"speaker":"Dr. Mario Bagos","text":"Okay. Well, I was thinking of the best possible segue into such a vast topic because it's a big topic and before the recording, we're talking about the various avenues that we could take in approaching it. But in the 1970s, and your Greek viewers and listeners will know about this, the. The singer George Dallaras and Harris Alexio, they released an album called Asia Minor Mikrasia. And on this album. So this is 50 years ago, 60 years ago, there was a song called the Marble King or Marmaromenos Vasilias. And it talks about. Well, Hardis is singing. So it's a female singer speaking about sending two birds to the red apple Tree to hear about news concerning the Marble King. The red apple tree is a motif that appears constantly in the later Byzantine apocalyptic literature. It's either the place where the Arabs or the Turks originated from, or on the borders between Byzantium and Islamic territories. And this red apple tree is in a region where those things that are written about us. So the prophecies and everything else, Tagramena and those birds, one is killed, the other is wounded and they never return. Concerning the Marble King, there has been no word. The song goes on to say only he's only talked about in the fairy tales that grandma sings to young children. So the motif of the Marble King is very much still in the popular consciousness of the Greek people. In 1998, Stamatis Panudakis, who is a. A Greek composer, actually he composed a song with a choir called he will Come like Lightning or you will come like Lightning. And this song puts together a lot of the motifs concerning the Marble King, Constantine Dragash Paliolovos, or Constantine xi, the final emperor of Byzantium, who died defending the city from the final onslaught of the Ottomans in 1453. The city of Constantinop that we spoke about in the last video fell on May 29, 1453. And so, because of the circumstances surrounding his death, which we will discuss perhaps a little bit later, there are various, let's say, I don't know, notions attributed to him. The most famous one is that he was plucked from the a point in which he was defending the city against the Turks near the Saint Romanos Gate, one of the many gates in the Theodosian walls that were on the landward side of Constantinople and that hadn't been breached up until that point. The Crusaders during the Fourth Crusade managed to get over them, but they were breached for the first time with cannon fire. We discussed that in the last video. And so he was plucked from that spot instead of dying and. And was taken to the Golden Gate, Theodosius Golden Gate, which was the main triumphal entrance into the city. And there he was turned into marble by an angel and placed in a subterranean cavern where he sleeps in this state of marble until such a time that he will rise and sort of take back the city and all these sorts of things. This song by Spanoudakis brings to the fore all of the motifs that are associated with Constantine Paliologos King of kings Help the King Vasilef Vasileon Vasilevoeti, which are the four beaters that appear on Constantine Paliologos flag, which you've probably seen, it's red and yellow. Mercy, Mercy. Heavenly God Constant Constantinos Dragatis Paleologos by the grace of God, Emperor of the Romans. Which is the way that he would sign off his correspondences at the gate of Saint Romanos writing his white legged beast steed story, 4 Betas, which refers to the flag, Mercy, mercy, Marble, Bosphorus and Black Tuesday. So it's not really a narrative, they're just various kind of images and vignettes taken and thrown together in this song that was just in 1998. But you got me thinking. In preparation for this podcast, what would, let's say, compel a Christian civilization? Of course, not all Orthodox were expecting the return of the Marble King immediately after the fall of Constantinople. It's more of, let's say, superstition on a folkloric sort of level, like a popular thing. It's not something that either the saints of the Church would really speak about, or fathers or literati or anything like that. So what would make them desire the return of the last emperor, Byzantium, when the king had come already, and has come already, and will come again, as we recite in every Divine liturgy in the Nicene Creed that we expect the resurrection of the dead and the life age to come. The second coming of our Lord Jesus Christ. And he's already come. So why the need to think about or to desire to expect a terrestrial ruler to set everything straight for us when the terrestrial ruler might be fixing the, let's say, sociopolitical circumstances or something like that, restoring a worldly kingdom, irrespective of what that kingdom was. Constantinople, of course, was endowed with much spirituality too, and so was the Byzantine Empire. But why expect a king to restore a worldly kingdom when you have the ruler of the kings of the earth, our Lord Jesus Christ? That's the way he's referred to in the Book of Revelation, who's defeated death itself in his person, with his resurrection on the third day and within the framework of the Church. The Orthodox Church, we believe, endows us with the, let's say, the grace to participate in his victory over death. So if I can go to my local Orthodox Church and participate in its rhythms and its sacraments and have a foretaste, however sinful I am, of the resurrection of life, that Christ the King of kings, the ruler of the kings of the earth, gives to each and every member of his body, the Church, why will I need a terrestrial ruler to come back? So that's what I've been wrestling with."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":511.73,"end":546.96,"speaker":"Jonathan Pageau","text":"And mostly because that motif is not just there in Constantinople, because there are legends. Now I'm learning there are legends in almost every single Christian nation that has this idea, whether it's Charlemagne or the. And I think it's Barbarossa and Like all these different kings, or our King Arthur that is also kind of waiting in Avalon to return. So it seems like this motif is one which is all over the Christian civilization. And the example in Constantinople is just one kind of shining example of that legend or that motif, let's say."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":547.36,"end":696.94,"speaker":"Dr. Mario Bagos","text":"That's right. It's a shining example. It's a very fascinating example. I'll tell you, I'm bored to tears nearly every time I return to. To reading about the circumstances that led to the fall of the city and the death of its final emperor. He was truly a heroic figure. He's not a saint, but he's a heroic figure. And we can maybe discuss that a little bit later. He's not considered a saint, but if we look at this motif, there must be something abiding because we're talking about universal history, and we can also do universal history, which is what you do. So, you know, contemplating this approach, I was led to. I had read them in the past, the analysis stories, the French historians Jacques Le Goff and Georges Dubit, who speak about the structures, mental and psychological structures that change only very gradually over long periods of time. La Longue durer. And this motif of the final king, the final emperor is one of the. Of those. Richard, you know, who is doing great work in this, in this area with you. In the previous podcast, he basically narrowed everything down to, you know, this, this book here, the Apocalypse of Pseudo Methodius as being that watershed text that standardizes the Byzantine and let's say, Western medieval image of the. The last king, the king who will return to put things right just before the second coming of Christ. If we're going to just hone in a little bit more in terms of the definition. So he's absolutely correct. I've been returning to this material and trying to trace the various trajectories that it leads to, both in the east and in the West. But today, with you, I think we can go a step further back in time before we move forward in time, because a lot of this has to do with the way time functions and is perceived of and experienced in the Middle Ages and in the ancient world. And we should look at the ruler cult, which is, let's say something. It's a phenomenon that is associated with the rise of civilization, at least in recorded history, in relation to recorded history, the propensity to venerate and even worship the ruler, the king, the emperor, the pharaoh, whatever you want to call him as a God, as a deity. Shall we go down that path?"}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":696.94,"end":735.48,"speaker":"Jonathan Pageau","text":"Yeah, I mean, I think that that's important, mostly because. How can I say this? Mostly because the king. Because first of all, the image of Christ is an image of kingship. You know, this descendant of David, the image of King David is also an image of the kind of high point of Israel, you know, even though it has its faults to it. David and Solomon are the high point in the story of Israel. You know, the building of the temple, all that is related also to kingship. And so I think it's important to see how, let's say how it existed. It's been existed for millennia, and then also how it was transformed in the Christian story, let's say. I think that's definitely important."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":735.88,"end":756.3,"speaker":"Dr. Mario Bagos","text":"Well, I'm so glad you mentioned King David and the history of Israel, because that's precisely where things change. You know, he's not a God. I mean, it's palpable. It's clear that he has weaknesses, he has faults. He's a servant of the most high God, and so are his successors meant to be. He's distinguished by his repentance, of course, but."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":756.7,"end":779.26,"speaker":"Jonathan Pageau","text":"And he's also. His glory is in. In whatever aspect of him is servant of God. That's where his glory is. And then in all those aspects where he is acting like almost he's acting like any other king would have, let's say, just by doing his own thing and taking women and doing all that, then he is seen as being faithful and needs to repent on that. On that front, let's say."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":779.5,"end":1042.27,"speaker":"Dr. Mario Bagos","text":"Well, that's right. That's so important for the whole penitential tradition and Christian worship and experience, isn't it? I mean, and it's all refracted through Christ, who David anticipates according to the flesh. So all of this is. That's where we're headed. But we'll go back, let's say, to, okay, Sumeria or Mesopotamia. I mean, that harkens to some of the material that I address in my book. And I also address King David in the historical record. It's in the 2400 BC around there where we have two rulers of Agade, which is a Mesopotamian city, a civilization that flourished there, Sargon and Naram Sin, who were seen as representatives of Ishtar, the goddess. And Ishtar was supposed to hold in her hands the principles of being for all of creation, the me or the mez in plural, something like the Logos and the Logos, but not articulated in such a philosophical or even in such an existentially meaningful way. Not as yet. They were Participants in this, what we could call demiurgic activity of Ishtar. So by demiurge, creator deity, false deities, considered demons from the perspective of the church. Okay, so we acknowledge all of that, but we're just looking at the trend of thinking here. It's the earliest example that we have of the ruler, cult, of the ruler being worshiped as a God, either because they represent the goddess in this case, or they participate in the God or goddess's world shaping activity. And this is reflected primarily in architecture, ziggurats, you know, that represent the cosmic mountain. So what the ruler kind of does is he reinitiates the cosmogony, the creation of the world. I spoke about this last time, and this is even clearer in Egypt, which is almost simultaneously, if not a couple hundred years later, you have the pharaohs recapitulating the cosmos within their temples and acting as servants, participants and embodiments of the demiurge in this process. The most emphatic example is, you know, the constant experience of the Egyptians was when the Nile floods, everything is chaos. So chaos and cosmos come into this. The king generates cosmos to stave off chaos. And there are deities that are agents of cosmos, the demiurge being the principal one. There are also deities that are agents of chaos. So when the flood waters recede, little hillocks were seen throughout the course of the Nile. And the Egyptians transposed this experience onto their creation myths and said, well, at the beginning, there was the formless expanse, the waters of chaos, the nun, those receded and a hill emerged which represents order. The demiurge simultaneously emerged posterior to matter and creation. That's an important point to make because the Christian God, the Trinitarian God, is anterior to matter and creation because he creates the world out of nothing. It's a massive revolution in terms of the history of religions and the way God is perceived of and experienced, how God reveals himself to the world. But anyway, the demiurge is posterior. He does his shaping and ordering. And the pharaoh participates in that in various ways, whether he's building a temple, whether he's holding a ceremony or a festival. He's also fighting off the agents of chaos. But all of this is a retrospective return to the time of creation, the way that they perceive creation. This is also the case to an extent with Israel, the people of Israel, except as the name of the Russian author that you had with you recently, but Alaskan. Yes. He speaks about the Judeo Christian inaugurating a linear view of time in the video. And that's true. It's not exclusive to Judeo Christianity. And Judeo Christianity is in fact multi layered because although you see a linear view of time manifested, there's in time moving forward towards an expected outcome, transformation of the world or something like that. The heavenly kingdom in Christianity can be participated in, which is the eternal kingdom at each and every divine service. So eternity and the linear, let's say duration of time and space intersect. Okay."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":1042.27,"end":1059.53,"speaker":"Jonathan Pageau","text":"We talked about it as being kind of like a spiral. Like it's not, it's, it's, it's, it's kind of the joining of a circular in the sense of. There's a sense in which the, the eschaton is a return to paradise, but it's also above, it's also above paradise. There's a, there's, there is the circularity in even."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":1060.17,"end":1061.65,"speaker":"Dr. Mario Bagos","text":"That's what you did, you did talk about that."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":1061.65,"end":1071.05,"speaker":"Jonathan Pageau","text":"Yeah, there is a circularity, but it's not a, it's not his eternal return. It really is like a, let's say an upward spiral of movement. So. Yeah, anyways, continue."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":1071.45,"end":1275.96,"speaker":"Dr. Mario Bagos","text":"Perfect. That's right. It's not an eternal return. The myth of the eternal return is what Mirceliade used to describe the sort of phenomena. I was just talking about Egypt and Mesopotamia. But in. Although you have it in Israel, for instance, the temple in Jerusalem. The temple is a recapitulation of Eden in the Genesis narrative. So the monumental pillars Jachin and Boaz represent the tree of life and the tree of the knowledge of good and evil and so on and so forth. You have this recapitulation of that sacred pastime in the present. But there's this linear trajectory and that's reflected throughout the text. That linear trajectory is there in Greece too, the dawning of more, let's say, historical consciousness. Right. But you know, you have a change in kingship providentially in both Israel and Greece. But the Greeks, even though they were cynical towards their kings, let's say at the beginning of Greek civilization, classical Greek civilization in the 800s, before that you have the, the Mycenaeans and then before that the Minoans. So although they're cynical towards their kings, the previous civilizations, you see some cynicism with Mycenae and that's reflected in Homer because, you know, they're all battling each other and feuding and all sorts of things. Alexander ruins it all for them or makes it better, whichever interpretation you want to take, because he represents himself as a God and as a divine world shaping agent and combines that with the notion of the philosopher King coming from Plato, who was the master of his teacher, Aristotle. So with the Greeks, that ends, but with the Jews, it's persistent. The king is a mortal agent who serves the only true God, who discloses his will to the prophets and the king, the two branches, let's say, of Jewish civilization in order to draw the people to God. And you have, from a Christian point of view, the disclosure of God as father and a hinting towards the coming of his Son. And David is the paragon there, as you mentioned. David is the one who unites the 12 tribes of Israel. David is the one who conceives of the idea of the temple which is built by Solomon to house the Ark of the Covenant, which is where God resides. David has his failures, which we just mentioned, and he repents. But he becomes the paradigmatic king to such an extent that it was always expected that kingship in subsequent generations would imitate the Davidic model, okay, until the 6th century when the Babylonian exile happens and the Davidic line is severed forever. Kingship is then rethought of then in order to project it into the future as a son of David, who would come to restore Israel back to this immediate relationship with God where everything was peaceful, where he would execute judgment. And before he could, let's say, create this just and peaceful civilization with the temple and God residing within it in its center, he had to fight off Israel's enemies and liberate them from bondage. And you find this motif, motif in Ezekiel, in Isaiah, in all of the."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":1275.96,"end":1323.99,"speaker":"Jonathan Pageau","text":"Old Testament, there already is a hint, at least of something, a pattern which is similar to this pattern of the returning king or the, you know, the idea of the. The broken line which will be restored or however you want to. To phrase it, whether it's the actual king or his line that will sprout, you know, the surprising sprout of the king which appears. So it seems like there's already a. The motif is there even in the image of the Messiah as the son of David. It's there. So it's even before these medieval versions of this tradition in the Messiah himself, there's something of that trope, let's say, of the king that fell, that died, that disappeared, and now will return at some point to restore things."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":1325.27,"end":1566.95,"speaker":"Dr. Mario Bagos","text":"I couldn't agree with you more. It's there. It's there. The king's line is broken. The king will come as son of David, will be raised by God in order to restore the kingdom of. To Israel firstly and reinitiate this communion with God. But something Else sneaks into the prophecies there, and that's disclosed by God providentially. It's the fact that the virgin shall conceive and bear a son, and he shall be called Emmanuel. Okay, what's happening there? What version? I mean, this is in Isaiah, right? And then you have Micah speaking about Bethlehem as a place where this future figure will be born. Then you have the suffering servant motif, which contrasts to the idea of a warrior king, the one who will take the iniquities of Israel upon himself and who, as a lamb before his shearers, remain silent, you know, he's beaten and afflicted for the people. The Son of Man motif is then made very explicit in the Book of Daniel, chapter seven, where the Son of Man, and that's the suffering servant figure, they can be conflated, is not going to reign over one particular people, as you see in Isaiah and various other prophecies, but is given authority by the Ancient of Days, interpreted by Christians as God the Father, to reign over all peoples and all nations, and that's Christ. Because Christ identifies himself as the Son of Man, he's also identifying Himself throughout his ministry as the Son of God and as the Son of David. So Son of God, Son of Man, Son of David. All of these motifs then are transferred to Christ in various ways. We see that in the New Testament, he self identifies as the Son of Man continuously in order to show that he's precisely this figure. And as his ministry unfolds and widens, let's say even after his ascension into heaven, you see that he's the one gathering all people into his new community, which is the Church. Initially a refounding of Israel through the 12 apostles, who are like the 12 tribes of Israel, reconstituted. But what kind of a king is he? The Master of the cosmos, the Pandokrator, as we spoke about in the last talk, the Son of God, the Father, the Logos, through whom all things came into being, who empties himself canonically and assumes human nature as Christ, Right? The humble king, utterly humble. There's no the depths of humility are penetrated and encompassed by Christ. And that's dramatically reflected in the final week of his life before his crucifixion and thereafter his resurrection. So riding into Israel on a donkey, which is a despised creature, so on and so forth. My kingdom is not of this world, he's saying to Pilate. And what does this king, well, what does he endow us with? Material goods and glory and no, actually he endows us with the conquest of Death itself and sin and devil that had the power and the devil that had the power over both through his resurrection on the third day. So different kind of king, the everlasting king. What happens thereafter is something that we were talking about before Jonathan, is that the Church, which is the body of Christ as it goes out into the world, as it goes on, let's say, its journey to witness to Christ and to the fact that he's inaugurated eternal life in his person. He himself gives the mandate, go forth and baptize all nations in the name of the Father and the Son and the Holy Spirit, and I'll be with you until the end of the age. As the Church does this, it encounters hostility and opposition from worldly powers, worldly kingdoms, one kingdom in particular, Rome. And if we speak about Rome, we have to speak about Augustus, of course, who is the first Roman emperor in the same way that Alexander was the first Greek king to initiate the ruler cult, to call himself sacred in perpetuity in his lifetime. At least his uncle had the, you know, the good sense to be made of God after he died by the Senate."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":1567.19,"end":1632.08,"speaker":"Jonathan Pageau","text":"Exactly. Yeah. That's. I always. But there's an interesting. There's an interesting moment because there's also an interesting moment in the sense that. To understand that Christ was. Was alive during the time of Augustus, that there is almost these two narratives being set up or these two stories of a divine king that are, let's say, put in parallel, because it says also that Christ was born, like in the Bible, it's made explicit that he was born during the time of Augustus. So there seems to be. Right there in Scripture, there seems to be laying up these two images of a divine king, let's say, you know, one which is truly the divine king and is hidden in the world, almost like. Almost like King David was hidden when Saul was king. So Saul is this king, and King David is a hidden king that no one knows about until his fruits are revealed later. But you get it. You get this. So you do get this. You do get this image of these two divine kings, let's say, the contrast between these two images."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":1632.64,"end":1854.03,"speaker":"Dr. Mario Bagos","text":"You get a contrasting image which for apologetic purposes, the Church will try to temper. And that's reflected as early as the New testament. You know, St. Paul appeals to his Roman citizenship. Christ says, render unto Caesar what he sees is unto God. What is God's. You know, Saint Paul says elsewhere, pray for your rulers. At the same time, these rulers are presenting themselves as divine. And when Christians refuse to take that extra step, which is to worship them as gods, to pour libations on their statues and light incense to them. They're murdered, they're killed. These are the martyrs who die as intercessors to Christ, as you know, and reign with him forever. But the, the interesting thing is now you have two trajectories set up a kind of more conciliatory approach towards the world, because after all, the world has to be baptized for Christ. Right. And one which is a bit more perceptive of the underlying reality behind the world outside the Church, which is, let's say, in its fallen state, a satanic or demonic one. And this is reflected in the book of Revelation which you've discussed before. Now we're going to talk about the scholars and I don't know whether, but the scholars like to say that the two beasts, one that comes out of the sea and one comes out of the earth in the book of Revelation, that are raised by the devil, which is the other beast, many beasts, and who can keep track of how many heads they have and horns and everything else. Right. But the one that comes out of the sea is the Roman imperial cult and the emperors generally who demand to be worshiped as gods. And the one that comes out of the earth is the priesthood encouraging people, because that's what the second beast does, it encourages people to worship the beast. Yeah, that's right. So, and then the two witnesses there, Enoch and Elijah, they're interpreted as Enoch and Elijah and as the martyrs generally simultaneously. So what you have is a possession of the Roman ruler cult is evil. And Rome is identified with Babylon and all these sorts of things. And this came directly out of the Christians experience. They were being massacred. We know that Nero, in order to find a scapegoat for the fire that he himself lit and burned down much of Rome, put Christians on spikes and burnt, burnt them alive. So we know that there was this kind of hostility towards what had come into the world, the light that had come into the world with Christ and which was being disseminated through his apostles and the churches that they established, the apostles. Eleven of the twelve are martyred, of course, the exception of St. John. Saints Peter and Paul are martyred in Rome, famously during the reign of the emperor Nero. And so we have all of this happening and martyrdom is a paradoxical phenomenon. We lament the deaths of the martyrs, but they participate immediately in the kingdom of Christ and the eternal kingdom. So they are translated to paradise forever. Now all of this is happening, but you know, the church will still in the intervening, let's say, decades and centuries be declaiming the Romans for unlawfully putting them to death and casting aspersions about, you know, their behavior and, you know, the sacraments and all these sorts of things which the Romans had misinterpreted. And at the same time, they're trying to encourage them to, you know, we pray for you, you know, we wish you all the best, but we're not going to worship you. And it's this back and forth. And you find that in the apologetic literature, Minutius Felix in the, in the west and St. Justin Martyr, famously."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":1855.55,"end":1953.24,"speaker":"Jonathan Pageau","text":"That's really important to me. This point that you made is very important because there's a sense, let's say in popular understanding and in, I would say, in kind of modern understanding that these things are in opposition, that there's a sense in which people, they tend to decry Rome or decry the emperor, decry the king. In modern thinking, kind of modern democratic thinking as being opposed to God, necessarily, the very idea of kingship or the very idea of authority is somehow wrong. And we need to worship God and then be suspicious of authorities. Right? Especially in American culture, you kind of have that sense. But the Christians, even the early Christians, even though they were martyred, even though they were persecuted, they would still say, obey the rule. But this, except for this, they were seen as model citizens, except for the fact that they refused to participate in pagan cults and worship the emperor, but for all Roman laws, they would tell Christians to obey the laws, obey the rules, follow what these authorities are given to you by God. But we will not participate in the aspects of them which are sacrilegious and which are demonic. But we still recognize them as being given to us by God. And so there's a key in there where it is that when suddenly the authorities become Christian, then suddenly there is no reason to continue to oppose the rulers because they were already subject to them and already obeying their rules."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":1953.64,"end":2088.42,"speaker":"Dr. Mario Bagos","text":"This is a fascinating point. And actually the providential arrangement of all things. If we believe that Providence, grace and God's presence is there in all events and all factors in life, I mean, that doesn't make him a causal agent in all of them. So people don't associate God's presence in all things with him causing people to die or something like that, we need to be careful. And that's actually another topic, theodicy. But because Providence arranges things to bring about ultimately a good end for as many people that choose to respond freely to this providential, let's say, outreach that God does for each and every one of us, right? Then he permits the circumstances, including the governments and kingships of the past. And because of our fallen state, because we, you know, we have our passions and our sins and we don't want to repent and turn to God, he permits even the martyrdoms that took place there, because without those martyrdoms, I mean, we can decry them. And, you know, it's a horrible thing that the apostles were killed. From their point of view, perhaps it's not as bad. St. Paul says, I can't wait, you know, I'd rather be with Christ and to suffer here in the body. Not that the martyrs. And see, it's all very slippery slopey because the martyrs were discouraged from actively seeking martyrdom, right, when these one or two examples came up later on. But because God discloses even to the martyrs, that they will die as martyrs. This creates an incredible testimony. Martyrs is witness. A witness which brings more and more people to the gospel and initiates them into the life of Christ. So the martyrs, as they die, go from this world to the next and live forever. Those who they bring with them at the moment of their martyrdom live forever with them. And this in the early days included pagans who converted on the spot, you know, and the testimony kind of extends beyond that to people who read the martyrologies, who venerate them in church. And then we have this panoply, this great cloud of witnesses, if you like, that intercede for us. So even the Roman Empire persecuting the saints from a certain point of view was good for the church. But don't misinterpret me. I'm saying this more to the listeners, you know, I mean."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":2089.46,"end":2107.14,"speaker":"Jonathan Pageau","text":"Yeah, well, it's like Christ says, scandal must happen, but woe to those by whom it happens. It's not a praise of scandal, but there's an understanding in which these events and these. These deaths act as seeds for the future world. But it doesn't justify those that killed the martyrs and those that did those horrible things."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":2107.3,"end":2124.53,"speaker":"Dr. Mario Bagos","text":"It doesn't. Thank you for pointing that out. But then what happens after that? That period of, let's say, intermittent persecution up until our favorite person comes along, Saint Constantine the Grave. Richard was here. What did he say? That we're the three people who still love Constantine."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":2124.53,"end":2126.17,"speaker":"Jonathan Pageau","text":"Still love Constantine. Yeah, exactly."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":2126.17,"end":2176.12,"speaker":"Dr. Mario Bagos","text":"Yeah, that's right. But look, I'll tell you what, Jonathan. I really do believe that the moment in 315 A.D. so he'd been a Christian officially for three years, you know, after seeing the Ntutonica by this time conquering the sky and defeating Maxentius. And you know, he's in Rome and they're erecting that triumphal arch to him next to the Coliseum, the amphitheater of Flavian. And Constantine refuses to participate in the sacrifices to Jupiter. That is a fulcrum point in world history right there. And there are a lot of moments like that in the reign of Constantine. So, you know, I mean, for a Roman emperor to go no, you know, to be disgusted with this kind of behavior, idolatrous behavior, you know, it's just. It's a changing point."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":2176.12,"end":2204.08,"speaker":"Jonathan Pageau","text":"Anyway, I'm curious. One question I have is also about the art, about the emperor worship him itself. And so was there a change during the time of Constantine? Because we know that from the time of Augustus, it seems like the emperor seemed to have that almost inevitably have this title as God himself or Son of God or some kind of divine title. And so is there something to help us understand how Constantine reacted to that tradition?"}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":2204.56,"end":2258.68,"speaker":"Dr. Mario Bagos","text":"Well, look, some people say that he might have committed sacrifices to be done in his image in various territories in the empire, but there's no way that that would have happened in those territories in which he was erecting Christian churches almost everywhere in and around Rome, Constantinople, the Holy Land. So he's a transitionary figure, which means that he needed to placate the pagans while at the same time Christianizing the topography. He retained the title Pontifex Maximus, the greatest bridge between heaven and earth, which was not relinquished by emperors until either Gratian or Theodosius gave it to Pope. Really? Was it the masses? Yes, and I'm pretty sure it's Theodosius because he was incredibly pious. He gave over the title of Pontifex Maximus. It's not befitting the emperor."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":2258.68,"end":2259.24,"speaker":"Jonathan Pageau","text":"Interesting."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":2259.72,"end":2393.89,"speaker":"Dr. Mario Bagos","text":"Yeah, yeah. So Constantine still had it, but you know, you need to put the man in his context. It would be unfair to say, just because he still had it, that he demanded to be worshiped in the same way that Caligula did, or something like that. You know, these two things do not stand together, especially in light of all of the other pro church things he did that we discussed last time. So there's no sense, I think, in dwelling on those. But Constantine changed the game. And then in the 4th century, immediately after his reign, we get the first apocalyptic text, which was already mentioned by Richard, that speaks about a final king, and that's the Tiburtine Sybil, if I'm pronouncing it right, the symbols being the oracles, the Roman oracles, who spoke about future events. And you've already addressed them at length. But this is the interesting bit. I've got the quote here that refers to the name, and it's the only text in late antiquity and in the Byzantine period that refers to this final king, a final emperor by name. And it goes like this. Then will arise a king of the Greeks at the end times. And always the end times are preceded by devastation, destruction, and all these sorts of things that lead to a final renewal. Christ says this about the end times as well. But what we need to. Before I read this, it's important to mention what we need to articulate in relation to the Christian experience is that Christ has already within Himself, objectively accomplished everything that will unilaterally and universally happen at the end, which is the transformation of the universe in light of his kingdom, the final judgment of the righteous and the unrighteous, the defeat of the devil and sin and death. They've already happened in his person, with his resurrection, ascension into heaven. And while it's happened in him objectively, all these things have happened in him objectively. They unfold subjectively within his body, the Church. When people participate in the sacred rhythms of the Church through repentance, participation in the sacraments, prayer, and the proof of this we have are the saints who are able to do by Christ's grace what he did and does, but not to the same extent that he did."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":2393.89,"end":2456.54,"speaker":"Jonathan Pageau","text":"Well, I think that for a lot of people watching this, that watch my channel, understand this fractal pattern, which is that Christ first of all plants a seed which contains the pattern in itself, and then also has the cosmic pattern in the end, which will be kind of the totality of the Incarnation playing itself out cosmically. And then it plays out at different levels, whether it is in the lives of the saints and whether it is in the liturgical year. It is our own participation in the liturgy. And then also, even historically, plays out in these mini cycles where you see little images of the kingdom of God appearing in different places in the world, where there are moments where things seem to come together. And we see, like in the example of Constantinople, where Constantinople is a little image of the new Jerusalem. It's not a complete image. It still has its fault, it still has its difficulties, but it nonetheless is a little glimpse and a little fractal version of the giant cosmic one that we see in Revelation."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":2457.02,"end":2718.18,"speaker":"Dr. Mario Bagos","text":"That's a beautiful way to put it. I mean, that's the standard now. And so everything that we're Looking at from this point onwards in relation to the final emperor is a deviation from that standard. It can be a benign deviation, right, because the final king is not Christ. Therefore, you know, it's something that Christians, from a liturgical perspective, from the point of view of the, the essence of the life of the Church, they don't expect it, but it comes up in popular culture. It comes up in times of stress and anxiety and desperation and, and this is why it's important to, to understand it so that, you know, when we do endure difficult circumstances, we don't, we aren't beguiled necessarily into thinking that the solution is in, you know, many false Christs and antichrists have indeed come is what St. John says in the, in his Epistles. And that plays out throughout history, especially around the time of the Reformation. But we might talk about that later. So turning back to the Tiburtine Sybil then will arise a king of the Greeks. His name is Constans. He will be king of the Romans and the Greeks and he will be tall of stature, of handsome appearance and shining face, et cetera. So it describes his physique, it describes the fact that he's king of the Romans and the Greeks. Greco Roman civilization. Rome encompassed Greece. But why, Constance, you know, I couldn't get past it because I looked through this book by Paul J. Alexander, the Byzantine apocalyptic tradition that analyzes this text briefly and I couldn't find a solution. We do have a Constanz in the fourth century immediately what happened after the death of Constantine? And let's, let's, to answer this question, we have to look a little bit at the end of his reign. So Constantine did a lot of good stuff for the Church. He's a saint of the Church. I accept that, you know, venerate him because of, of all that he accomplished and you know, the inner life of a person, no one can know. So let's just accept tradition and not the 8 million other constantines in scholarship that we get, right? And he described in his war with Licinius, his final rival emperor, because he basically demolished the Tetrarchy, the rule of the four emperors that was set up by Diocletian, the persecuting emperor, the one who initiated the great persecution just before Constantine's reign. And Licinius was one of the last to go. He refers to him in his letters O Draco and Licinios the dragon Licinius assimilating him to the dragon, which is the chaos entity, the monster, the devil in this sense. And according to Eusebius's Life of the Emperor and Eusebius Caesarea. I love Eusebius, he's very important. But he's also incredibly problematic because he does all of that pagan panagyrizing of the emperor, which gives the emperor bad name. Actually, it's part of the reason why Eusebius had a mixed reception in Byzantium. But everybody read his history. His history is one of the most important works, works of late antiquity. So in his Life of Constantine, which goes well beyond the norms of panegurizing Constantine, he describes a panel set above the entrance to Constantine's palace in Constantinople, which had on it the Christogram, the Cairo, a lance. So the Cairo was on top of a javelin, and on the lance was like a crossbar with a portrait of Constantine and his three sons. And this lance was driving the serpent into the abyss. So you can interpret this as spiritually, you know, through the reign of the Christian emperor, evil is being. Or spiritual, evil is being kept at bay through the churches he built, all these sorts of things. And that's fine. But there's also a historicist way of interpreting this as the emperor defeating his terrestrial enemies, and they are the actual evil ones, not the evil behind them. And all of us, that tempts us to sin, which is the devil, the only real enemy of the Christian people, along with death. So, you know, this particular image, what is it? Well, what do we do with it?"}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":2718.18,"end":2849.94,"speaker":"Jonathan Pageau","text":"Yeah, well, the interesting thing about it is that it seems at least the image, like, let's say, if you take the symbolism, the very symbolism of the image, image itself, and we don't try to give it, we don't try to interpret it historically like what the dragon is. It's a dragon, let's say, it's just a dragon. There's a sense in which this could be an image of the proper emperor. Right. So you have above, at the top, you have this image of Christ as the, really as the Son of God, as the Son of Man, as this cosmic virgin of the king. And then below, then you have a. An image of the actual king and his descendants who are below the image of Christ that are kind of, let's say, being a tool or an image of Christ and then they becoming a tool for Christ in the world to vanquish evil or to push away the evil aspects of reality. So that's one way. Then the other way, the cynical way, is of course, to see the emperor as using Christ to justify whatever that they want to do politically, which is those are the two images of civilization, let's say. And you always hear one version, you hear the version that, especially in modern times, we hear the cynical version that let's say kings and the church or whatever use the excuse of God or Christ to then do whatever it is they wanted to do and to defeat their enemies. But I think that we always need to be able to understand the two interpretations, because it is also true that God uses our civil authorities, uses the powers of the world to hold chaos at bay, because without civilization we would be eaten. I know, because I've lived in places where civilization was breaking down and where states were fallen. And it doesn't look like a nice happy world where people hold hands. It looks like a bunch of warlords that will come and take whatever they want and you have no way of stopping them. And so there is the reality of civilization can really be a tool for God to bring about a kind of peace in the world."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":2850.74,"end":3336.2,"speaker":"Dr. Mario Bagos","text":"I agree with you. I agree with you 100%. And actually, what you mentioned about the way civilization is used to generate order out of chaos is another apologetic motif that's used by Minutius, Felix and others that providentially, Christ is born. Actually, we chant this, and I don't remember in which, in which service Christ is providentially born during the reign of Augustus, the one who united the disparate king. And this is Augustus, who's, let's face it, idolatrous, right? You know, so he's. He calls himself Sacrosanctus esse imperpetuum, I am holy perpetually in his res gestaia divi augusti, the epigram that was distributed throughout the empire. He intended it for being distributed after he died in Greek and Latin, but anyway. But even under him, right? Because he manages to unite all of the warring and disparate factions. This multiplicity and divisive multiplicity seen as diabolical, his unifying agency is in the background, behind the scenes, engendered by God, so that. Not directly, not as if, you know, like, so that we don't confuse Christ, Augustus, but behind the scenes, God allows this unification to happen so that Christ, the one true king of everybody, can be born within a relatively peaceful context. So that's an apologetic motif, and it's recurrent in the early period and still in the church. But look, the fact that the lavaro, the lavarum, that's what this image is in Constantine's palace of the spear, javelin, the snake or the dragon. The lavaro is still used in orthodox services, points to the fact that it is the spiritual interpretation, because we have the lavaro, not necessarily with Constantine, with the resurrected Christ on it. We have at my parish at St. Catherine's St. Catherine on the lavaro, and so on and so forth. And we process it. It's a spiritual tool. It's the Roman, let's say standard, spiritualized. And that's fine because the Church did that with a lot of things. But what we have with happening in the 4th century thereafter is precisely the cynical approach that you mentioned, picked up by Constantine's successor, one of his sons. And that cynical approach inaugurates a trajectory whereby the ruler cult is rehabilitated under the Arian kings that govern intermittently throughout the 4th century until Theodosius the Great, another awesome emperor. If we're going to be extolling Constantine, we have to extol Theodosius as well. Okay? They're both saints of the Church. In any case, Theodosius comes along and he puts an end to all of this. But that's in 381. Constantine dies in 337. And in the internecine period, 325 is the Council of Nicaea, 2381, the second ecumenical council in Constantinople. It's like all hell broke loose against the Council of Nicaea that affirmed that Christ is omosio stopatri of one essence, one with the Father, fully God. Because if he's not fully God and thus and eternal in such a way, he cannot save us, liberate us from the opposite of eternity, which is death. Okay, so the Church had already experienced and always experienced Christ as fully God and eternal, but it articulated this in a specific way. At the Council of Nicaea, all hell breaks loose against his council. And Saint Athanasius, the Bishop of Alexandria, Athanasius the Great is the locus of a lot of this antagonism because he's the great champion of Nicaea in this period. Again, he's misinterpreted by scholars. They've done a lot of damage to Athanasius reputation. But on my academia page, you can find a chapter and an article that rehabilitates the traditional approach to Athanasius. And it's more sound than what scholars come up with. Why am I talking about Athanasius, who is exiled five times in the three hundreds by Arian kings, who in fact points out their. Their use of the ruler cult. Because Arianism is more palatable to the ruler cult if Christ is made the highest of all created beings, because that's what Arianism posits, that he's a creature. He's not of one essence with the Father, and thus eternal and God in the same way that God the Father is God. But if he's a creature, albeit the highest creature, nevertheless, he's a bit closer to the emperor, don't you think? Because he's on this side of the ontological gap between the uncreated and. And the created. If he's of one essence with the Father, he's uncreated in the way that the Father is uncreated, eternal, divine. What is distinct is his personhood. But he shares the same nature and essence with the Father, and the Spirit does the same. But if he's on this side of the created order, well, the emperor can still go about masquerading as divine. And he does that. Constantius, Constantine, Son. Because three sons take over various parts of the empire. And to make things even more confusing, they're all named in some ways a variation after Constantine. So there's Constantine ii, there's Constans, who's mentioned in the Tiburtine Sibyl. I believe it's him. And there's Constantius ii, not the first. That was Constantine's father. Constantius II is the Arian. He kills off Constantine II and he fights with Constans. Athanasius accuses Constantius II and a couple of bishops around him, Arian bishops. And he says concerning these two bishops, Ursakis and Valens, they dare to call the emperor eternal, while at the same token they belittle the Son of God and call him a creature. So they continue to refer to the emperor as eternal. Anyway, Constans protects Athanasius and he even threatens to go to war with Constantius over the protection of Athanasius because Constantius wanted him dead. So is it this Constantius? He's gotten a mixed reception in scholarship. And again, you've always got to put the question mark up in relation to the scholars because you don't know what hermeneutical lens they're using to interpret figures. But he was, according to the traditional sources, the ancient sources, an orthodox king who protected Athanasius. And he went down in history that way. Why mention Athanasius? He dominates the literature in the 4th century. Sozoman's history, Socrates history, Theodorus history written in the 400s. They're all talking about Athanasius, so could be him. Anyway, this emperor's reign is characterized. Now we're going back to the Tiburtine Sibyl by great wealth and victory over the foes of Christianity. An end of paganism and the conversion of the Jews. So what we have here, the antagonistic forces to, let's say, emergent Christendom in this context in the fourth century are the pagans and Jews. And that should not be interpreted because people are quick to jump on the vilification bandwagon. There was conflict going on between these three groups for centuries up until this point. You know, the first Christians were Jews, and then pagans were bought into that. Jews persecuted Christians, then pagans persecuted Christians. So don't read more into it. I'm saying this more for listeners and viewers than what's there. Okay, so Christianization of the empire is what will happen. And he will vanquish. The emperor will vanquish. Gog and Magog mentioned in Ezekiel. Richard spoke about them. You both spoke about Gog and Magog, the unclean, cannibalistic, worse than the Haradrim, you know, driven by Alexander the Great the Great beyond the gates of the north. He seals them in that later text, the apocalypse of Pseudo Methodius. After defeating these unclean nations, the emperor goes to Jerusalem, puts off his diadem from his head, lays aside his imperial garb and hands over the empire of the Christians to God the Father and to Jesus Christ his son."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":3336.28,"end":3342.36,"speaker":"Jonathan Pageau","text":"And this is still in the Sybil now. Wow. So it's all there, right there in the fourth century."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":3342.52,"end":3418.73,"speaker":"Dr. Mario Bagos","text":"It's all right there in the fourth century. This anticipates the apocalypse of Pseudo Methodius, which takes up all of these motifs except, and you know, it's the same kind of trajectory with the Sybil. You have Constans defeating the enemies of Christianity. And then later on, the future emperor in Pseudo Methodius and other texts defeats the Ishmaelites with the Arabs. And then after that, Gog and Magog appear on the scene. After defeating them or before facing off against them, he defeats them, he defeats Gog and Magog, and then he goes and gives up his scepter and his crown at Golgotha, dies. And then the Antichrist comes and, you know, the second coming happens just after that. There are variations of this kind of model and the antecedents are there in the Tiburtine symbol. The surprising thing is that a lot of these motifs are going to appear again with the final king of Constantinople, the Eastern Roman Empire founded by Constantine in Thrace shores of the Bosphorus. We spoke about it last time and that's what we're going to move to. How are we going with time, Jonathan?"}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":3418.89,"end":3485.65,"speaker":"Jonathan Pageau","text":"I mean, I'm fine to Keep going. I think it's important. So I'm not. We can just continue, if you're okay. I mean, I would say we can maybe kind of move towards the. Towards the. Towards the different legends, but I think this is important to set the base, you know, of where this kind of tradition comes from, let's say, in terms of the Sybil and also. But yeah, so. But we can slowly kind of move towards also why there's a sense of this. This. This emperor that is potent in potential or sleeping. Why, like, if you have a sense of why that is, why that happens. And then maybe the difference. Because there is a difference between, let's say, the divine emperor and the emperor that. That gives over his. His. His diadem to Christ. You know, that it might seem. For some people, it might seem like a. Like they may be cynical about it, but there is, in terms of narrative, there is a difference between the cult of the emperor and the emperor who ultimately gives up his power to Christ even in his own victory."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":3486.45,"end":4038.62,"speaker":"Dr. Mario Bagos","text":"Yes, you're right. And in fact, that's something that I argue towards the end of my book that often the Byzantines, Eastern Christian Romans and generally Christendom is accused of Caesar of Papism, but especially Byzantium, the fact that the emperor was both priest and king in the way that made him kind of semi or quasi divine, notwithstanding the fact that Paniuri, even up until Justinian's time, use that kind of rhetorical language about the emperor, quasi divine language, and in spite of the fact that the emperor would kind of represent himself with a halo, nevertheless, Caesar of Papism did not necessarily apply, because the more suitable model, in an environment which is conditioned by Christ and his saints through the church and its shepherds and teachers, the bishops, is the Old Testament model. It's not the pagan model. The pagan model dissipates and every time you have an imposition of the state because the state lapses into this hubris. Several times in Byzantium, the most emphatic example, we just mentioned the Arian controversy in relation to Constantius ii, but later on, the most emphatic example is iconoclasm, where they begin to break the icons and they begin to. The emperors begin to act in a way which kind of gives the impression that they are in charge of the Church. But at that time, God raises up. He raises up saints, shepherds of the Church, usually bishops, but also monks and nuns and lay heroes to tell the emperor, you know, take care of the world outside the church and leave the church to its shepherds and teachers. In fact, the Church is never under the empire in Byzantium, which is a mistake that many scholars again make in relation to assessments of this empire. Even when the Church works with the state, and Constantine initiates this when he convokes the Council of Nicaea, they are working together, but he's not presiding at the Council, it's a bishop of the Church who's presiding at the council. Saint Ostriches of Cordova. So we need to make this very clear that the Church is one thing, the State is another. When the State, in spite of its ostensible Christianity, would exert itself against the Church, impose heretical doctrines, or behave in a way which was scandalous, the Church very often accused it of such and castigated it. And if it was persecuted, then subsequent emperors would have to learn from the disciples of the martyrs of the previous generation, whose boss. And this happened back and forth throughout the history of this empire. It's remarkable, one of the reasons why the empire is considered as falling. And again, things are nuanced and complicated. It's not just a matter of the empire compromising at the end, although it did, on an imperial level, have all this great spirituality. We spoke about it last time. One of the reasons why it's interpreted as ending is because of the imperial courts questioning acceptance to come under the Roman Catholic Church of the time in order to solicit imperial support. And he didn't listen to the Church. So, you know, so we need. We need to. That's the broader. The broader, let's say, framework, but let's, let's delve into it then. Talk about the sleeping king. You're right. The sleeping king who wakes up, rouses off his drowsiness and goes to fight the enemy, let's say, clearing the path for the second coming of Christ. It's not, let's say, doctrinal eschatology. It's a variant. It can even be a dangerous one. But it's nothing like the divine kings of the past. He's a servant still, this king, irrespective of how good he might be. But where the motif of him slumbering and waking up comes from is actually from the Syriac Pseudo Methodius, just to recapitulate, it's attributed to Saint Methodius of Olympus in the Syriac text, or of Patara in the Greek text, 4th century. This was a 4th century figure, but again, this text was composed in the seventh century, after the Islamic conquests of Syria, Palestine and Egypt. So, you know, it comes from a different Context we saw with the Tibetan symbol that if it's Constance that it's talking about, there's a lot of sociopolitical and religious chaos in the 4th century. We have the same circumstances happening in the 7th century. So these prophecies arise whenever civilization is destabilized. Okay? And so definitely that was fertile ground, the 600s, for the rising up of this particular kind of apocalyptic anxiety. So the manuscript, again, it speaks about, it starts with the history of the world. So it's part chronicle, part apocalypse. So chronicles were, at least in the Christian context, initiated by Julius Africanus, the apologist, and later Eusebius of Caesarea, just tables and dates really, of the reigns of kings, cross reference with the Olympiads, because at that time, at least before Dionysius Exiguus came up with the anno Domini dating system and various other chronographers and computational thinkers, let's say, came up with the anno mundi dating system, it's reflected in this text to some extent because it goes by, oh, gosh, more and more stuff is coming to mind. It goes through the unfolding of time from the creation of the world, Adam and Eve, through thousands of years leading to the year 7000, right, which is modeled upon the recurrent week of time that we see in Genesis and that we in fact experience a seven day weekly cycle, the end of the seventh, the end of the 6,000th year, beginning the 7,000th year, inaugurating that apocalyptic time. And this is known as millenarianism, that thousand year reign of Christ with his saints. And there are many people in the Middle Ages trying to figure out and in the Dark Ages trying to figure out whether or not Christ comes before the beginning of the 7,000th year or just after it. When will Antichrist come just before the inauguration of the year 7000 or just after it? Or when did Christ come at the beginning of the year 6000? And does this represent the millennium up until the beginning of the year 7000 where everything will end? You know, so this can all get pretty messy, but it's the backdrop from a chronological perspective to this text. And that factors in later on when we talk about Constantinople. So this text goes for a history of the world. And you've spoken about it with Richard already, you know, the various important junctures that it talks about, talks about, again, the rise of the sons of Ishmael. And, you know, again, many people would interpret this as, you know, the Muslims taking over Christian territory. And they're seen in a very antagonistic Sense. Well, they are, because people who are conquered are seeing them this way. And Pseudo Methodius sees them this way. But the reason why these conquests happen is because of the sins of the Christian people. That's what he says. That's also reflected in later recensions of this text in the Slavonic Daniel, it's called, which is written in the circumstances, the Arab conquest of Sicily from the Byzantines. So again, a different same, yet different kind of text. But the accusation is never against the terrestrial enemies. Well, it's a description of what they do, let's say, in times of conquest. But it's a reflexive accusation that's meant to lead to repentance. It's because of the sins of the Christian people that these things happen. And that's there in Constantinople, with the fall of the city in 1453, Gennadios Scolarios, the first Ecumenical Patriarch after the. The fall of the city, before he becomes patriarch, he's still a monk at the time. He basically says, you know, Romans, you are losing your city because instead of putting your faith in God, you put your faith in the Italians, you know, so in terms of coming under Roman Catholicism. So there's all of that, right. Apocalyptic anxiety, kind of introspection concerning why these things might be happening and the references to after the sleeping emperor rises and defeats the Ishmaelites, Gog and Magog and all of that. But here is where the text, the Syriac text, describes the sleeping emperor for the first time. This last Roman emperor will go forth and will be awakened or aroused against them. That's the Arabs, like a man who shakes off wine, one who plots against them as if they were dead. So something about, you know, amidst the sins of the Christian people, he's kind of like neutralized until this shocks him into action. Okay. Yeah."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":4038.62,"end":4068.15,"speaker":"Jonathan Pageau","text":"There's a sense in which, like even the idea of shaking off wine in the sense of being asleep, not just being asleep, in terms of attention too, in the sense of being distracted, being. Being, you know, falling into conflagration and being just this. This kind of dissipated king, let's say, that wakes up from. From his drunkenness. So it's a. It's. It's. It's a little different from the idea of the marble king. But it definitely. Those two images together are very interesting. If you. If you actually kind of join them together."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":4068.71,"end":4071.11,"speaker":"Dr. Mario Bagos","text":"It's like Theoden almost. That's where my mind."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":4071.11,"end":4081.75,"speaker":"Jonathan Pageau","text":"Yeah, exactly. Yeah. Very much like the image of Theoden. Yeah, that's a good. That's a That's actually a good. In terms of waking up from being drunk or asleep, in that sense, yeah, that's a good image."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":4082.79,"end":4135.36,"speaker":"Dr. Mario Bagos","text":"That's right. But that actual description. This is strange because the author of Pseudoma Thodius is not going back to the book of Revelation necessarily because of all of the anti Roman imagery in that text. Right. He's got to look elsewhere. Revelation is the backdrop to some of it, of course, but this depiction of the sleeping king actually appears originally in relation to the Lord, to God in the Psalms. And in Psalm 78, verses 65 to 66 we read then the Lord awoke us from sleep as a warrior wakes from the stupor of wine. He beat back his enemies, he put them to everlasting shame. It's basically transposing a role that belongs to God, to this last emperor of the Romans, the Lord waking up, which is strange for us to really, you know, it's a very anthropomorphic way of describing God waking up."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":4135.76,"end":4159.26,"speaker":"Jonathan Pageau","text":"Yeah, but you could also see it because it says that it's the emperor that shakes himself off like someone from wine. So you could see it as if it's God waking him up, like he's the warrior being being awoken, being woken up in the Psalms, like it says in the Psalms that God will wake up the warriors. And so maybe it's the king that is being made awake, that is being woken up by God as someone who was drunk and kind of dissipated, let's say."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":4159.42,"end":4280.66,"speaker":"Dr. Mario Bagos","text":"Well, that's a reading of it. I mean, that's the way that they would have read it, I think the Apocalypse, you know, God waking up the sleeping king. But in the Psalm it's a simile in relation to God. I mean, it's an interesting nuance, but the Greek translation changes things a bit, which will. I mean, tell me what you think of this. So the Greek translation of Pseudo Methodius says, and I've taken this, not from this version, the Demartinoaks version, translated by Benjamin Gastad. I've taken it from Paul J. Alexander's translation. In the Byzantine apocalyptic tradition, the Greek translation of the text says, then there will suddenly arise against them the Ishmaelites with great fury and emperor of the Greeks or Romans, he will awaken from his sleep like a man who had drunk wine. Up to this point it's the same, but he's added great fury. Okay, who men considered like one, dead and utterly useless. In the previous texts, they are the ones with the enemies of the ones who are dead. In this text, it becomes reflexive it's the king who was like one who was dead and utterly useless. So I mean this fits into the image that you were drawing. Actually recently I thought of that when I was reading this and I can't wait to see how that that ends up. But another interesting motif that's very important in the apocalypse of Pseudo Methodius is the connection between. And this is more rigid stuff, but I just want to mention it very briefly because it comes up in later apocalypses. Okay. Alexander is the one who chases the unclean nations to the north and puts up a gate with a special kind of material on it that actually has no correspondence in reality or whatever magic, whatever it is to keep them at bay. Right. And then after that we read about the marriage of Bezos and Khusaf. I didn't see the Ethiopia video yet, so I don't know. Did Richard discuss the marriage of Beezus."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":4280.66,"end":4300.94,"speaker":"Jonathan Pageau","text":"And who said a little bit. We're going to talk about it more in the next one. But we mentioned a little bit how the importance of, of Ethiopia appears in Byzantine apocalypticism. Right. And it's the place where out of which let's say the, the emperor will. The hidden emperor kind of is coming out of Ethiopia, let's say at the end."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":4300.94,"end":4544.78,"speaker":"Dr. Mario Bagos","text":"Yeah, yeah. I mean, I'll touch upon it briefly now because I don't want to kind of, you know, impose upon what comes up next with you and Richard. But the Beezas of course is Beezas of Megara who founded Byzantium, the Greek polis later turned into Constantinople by Constantine. Husseth is the daughter of the Ethiopian king. So Greece and Ethiopia are connected. They have a daughter named Byzantia who is married to Rome to Romulus Amelaus and then Romulus Amelios gives her Rome as a dowry. So that's, that's interesting because there's a whole shift in politically speaking from the old Rome to the new. That's manifested in 381 with the Second Ecumenical Council. That makes New Rome, Constantinople second to the Old Rome in terms of the, let's say the Taxis, the order of the ancient seas of Christendom. And by the time you get to the 500s in Justinian's time, that becomes the pentarchy, the five main sees of Christendom. Rome first among equals, later then Constantinople, Alexandria, Antioch, Jerusalem. After the Great Schism it becomes Constantinople, Alexandria, Antioch, Jerusalem. So that's interesting, I think. And then, you know, it follows the same kind of trajectory that the king of the Romans after being Awakened, defeats the Ishmaelites. And then there's an invasion of the unclean nations. Who are Gog and Magog, defeated by the king. And then he goes to Golgotha, lays down his crown and his scepter dies. The cross goes up to heaven because it's meant to go before Christ when he comes again. Then you have the revelation of Antichrist, the son of perdition, which is the way St. Paul refers to him in Thessalonians. Once he appears and kills Enoch in Elijah, you have the second coming. And nothing is said about what happens after of the second coming. And that's basically the apocalypse of Pseudo Methodius, following to some extent the Tiburtine Sibyl. Except it doesn't give a name for the king. It mentions in more detail, based on the Psalms, this notion of the king being asleep and waking up, being aroused from drunkenness. The Greek text adds being as one who was dead, and then he springs into action. I mentioned earlier that later ON in the 9th century, we get a further reduction of this text, but all of the chronographical and chronological material leading up to the rise of the last Roman emperor is omitted. It's all gone. You get the same stuff happening later. Ishmaelites, Gog and Magog, goes to Jerusalem, gives up all worldly authority, Antichrist comes, and then the second coming happens. But instead of being given to Methodius of Olympus or Patara, this revelation is disclosed to the prophet Daniel by the archangel Gabriel. And it's being written in the 9th century. It's been dated to around the early 800s. So the second wave of iconoclasm has affected the Byzantine Empire. Theophilus, the emperor, was probably on the throne at the time, and Iconoclast. And that's actually reflected within the text because the archangel Gabriel says to the prophet Daniel, four beasts come out of the sea. And that's harkening back to Daniel. And the first one is the Isaurian dynasty, which was the dynasty that initiated the first wave of iconoclasm in the 7 hundreds. That's a beast. So you see, it's not just a matter of criticizing the Ishmaelites or those outside. It's also a matter of criticizing the imperial court which had betrayed the ordinances of God, let's say the tradition of the Church, in this case being the Isaurians."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":4546.94,"end":4678.24,"speaker":"Jonathan Pageau","text":"I think one of the things that's important for people to notice here also is how, let's say the apocalyptic motif, it really not only. It's ultimately not just Talking about something like this cosmic end of time, but seems to be brought back and reused as a kind of pattern of manifestation which, which appears in these moments of difficulty. And so we could, we can, we can. I think that if we're a little perceptive, we can pull back and notice how it's acting as a. As a kind of a lattice or a narrative lattice to help people gauge and help people see how difficulty happens and how we kind of come out of difficulty. Like the image, for example, of the emperor, which either falls into drunkenness, Theoden style, right, and kind of is gone, or goes into hiding and becomes a hidden seed, Aragon style, Aragorn style, right. So you have these two images of the. Of the lost king, let's say, one which is fallen into dissipation and one which is kind of this hidden seed which you can't see yet. But you know that at the final moment, when it becomes important, the sprout is going to come out and going to recapture the world, let's say. Like, that's actually a pattern of any moment that you break down, right? Like any breakdown that exists in any society or even at a personal level, when you fall into dissipation, but then your attention goes into hiding, let's say. And when you come out of sin or when you come out of any kind of difficulty that you have, those motifs will play out, right? They will play themselves out in yourself. And so I think, like, I just want to kind of help people see that the reason why we're talking about this does have a cosmic and historical aspect, but it also has even an aspect in yourself that you can understand as a pattern of manifestation of how things fall down, come back up, fall down, come back up and keep happening all through history. And there is a kind of cosmic version of that. So anyway, so continue on."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":4678.4,"end":4711.65,"speaker":"Dr. Mario Bagos","text":"No, no, you just did a remarkable kind of philochalic, internalized reading of the text, which is fascinating, because in that time of crisis, hope arises in the form of this last Roman emperor, let's say. And that can be interiorized. Perhaps this is an externalization of something, as you mentioned, that's being experienced internally, intra mentally. And, you know, you're reading of it in relation to Theoden and Aragorn. I mean, come on, this is how you interpret Tolkien? What? Tolkien Society. This is it, you know, where's Richard? Love it."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":4711.65,"end":4721.21,"speaker":"Jonathan Pageau","text":"Yeah, especially, especially these days with the whole. This whole scandal around the Tolkien society. It's like, we need more. We need more. We need more. A little more pseudo methodius than our."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":4721.21,"end":4924.97,"speaker":"Dr. Mario Bagos","text":"Tolkien look 100% because this is existentially meaningful. Whereas, you know, anyway, let's not go down that road. No, no, that's. That's really interesting. And I guess the same kind of distress and desire for renewal comes up again in the west whenever this motif appears. Because you don't. You have in the Dark Ages, a lot of obsessive computation to work out when Antichrist is going to return. Beatus of Modena and Lotharios of Saint Amand and others. And the years 500 and 800 are identified as the beginning of the year 6000, which some people were expecting to inaugurate. It's known as amillennialism. So that reign of Christ with his saints leading up until the final judgment. But of course, this was shifted to the year 1000, when DNA C6 secrets came up with the Anno Domini system. And he had a lot of expectation precisely because of the Dark Ages, because people were experiencing least on the continent. And I know that they've been exaggerated, the Dark Ages. My brother reminds me of this a lot, actually, because his field of research is Celtic and Welsh hagiography around this period. And so because, you know, the Church was there in the West, I'm like, of course I know, you know, but at the same time, on the continent you had the Dark Ages. So that's notwithstanding Gregory the Dialogist and all these other great figures, but definitely because of this experience of devastation, lack of civilization brought upon by the Visigoths and the Vandals and those who destroyed the Western Roman empire throughout the 400s, they actually want Christ to return imminently to alleviate them of their suffering. But that's problematic because Christ Himself says, and perhaps it's a good juncture to bring this into it, concerning the last things, what we call the Apocalypse or the eschaton or the second coming, he says in Matthew, no one knows the day or the hour, not even the Son, but only the Father. So if He Himself says that, then why is it that, you know, we obsess about when he will come back to transform the cosmos universally, when he can be experienced at each and every divine liturgy. And the saints already experience him in anticipation of that final resurrection. So if we have confidence in the Church. Look, ultimately, if we have confidence in the Church, there's no need for these. But that being said, I've never been through a famine or, you know, the collapse of society, so I don't know how I'll react. You know, I'll probably be running in the first to. To write a. You know, scribble on something. You know, he'll be back, you know, next week at a certain time of the day, because I want it all to end, the misery to end. But that's, that's basically where all of this. What gives rise to this desperate hope for it to be pinpointed. It's a hope, but it's a beautiful hope that one day he will come. We expect that he will come, but there's a desperation behind trying to calculate when and how and where and in what circumstances, because he himself does not disclose that. So, you know, getting back to the Slavonic Daniel again, written in Palermo. Oh, sorry, yes."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":4925.45,"end":5126.23,"speaker":"Jonathan Pageau","text":"Sorry, I'm muted. That's why. Let me just bring in one image, I think, in terms of. Because one of the things we're showing, we're talking about this idea, this image of an emperor, let's say, that is bringing back order in Christ's name. But there's also this image of Antichrist which is there in Revelation, which strangely comes right after or right before, or you're not sure. So it's very disturbing because you have an image of a worldly power which is supposedly restoring order in the name of Christ. And then you have an image of a worldly power, power which is taking power and in storing a kind of order in an anti Christian way. And so it's like, which one is it? And it's not that simple because you have a sense in which Antichrist is parodying Christ and that even the, you know, even the faithful can be deceived. So it's like, how do we recognize the difference between Christ between, let's say, a holy emperor and Antichrist, between the holiness, something which would be kind of a holy order and Antichrist? And anyways, the way that I see it, because it seems like even in the imagery of Rome that you see in Revelation, you have a sense in which. I've talked about this in my Q and A recently, where there's an image of the beast and the prostitute. And a prostitute is basically a place where all the nations trade, where all the. There's this confusion of identity, where all the wasted seed goes into this one place, let's say. So it becomes like a place of mixture of confusion and all of that, but that's what a prostitute is. Then you have this image of the new Jerusalem, and it says in the image of the new Jerusalem that the glories of all the nations will be gathered into the city. So what's the difference between A prostitute where all this wasted stuff goes into, and then a city where all the glory gets gathered into one place. And so it seems like that's the mystery or that's the difference. And one of them, in the image of Alexander, for example, the good version of Alexander, where Alexander rises up with his Griffins and then reaches up to. He comes close to the prime mobile, then hears a voice which tells Alexander, enough, go back. You've gone high enough. You can't go higher than this. And then go back down. It seems like there's a key in there. There's a sense in which the emperor that gives his diadem up to Christ, in the difference of the emperor or the ruler who wants to gather all authority to himself and wants to be, to act as a God in the world. Now, what does that look like in practical terms? Because sometimes you could imagine an emperor pretending, let's say, or politically using that image of himself. Because I'm thinking about, let's say, even what's going on in Russia, let's say the vision of Putin, for example. So there's a cynical vision of Putin, which is that Putin is using the church to reach his political goal. And there's a less cynical version of Putin, which is Putin is genuinely wanting to incorporate Christian value and Christian, let's say, rule in Russia. So it's like, is it both? Is it one, is it the other? It's hard to discern that."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":5126.79,"end":5374.97,"speaker":"Dr. Mario Bagos","text":"It's hard to discern that. But I think in relation to the Church, and this goes not just for the circumstances that you mentioned in Russia, but throughout Orthodox countries and extending back to the Byzantine period, the Church is meant to witness to Christ in the world, for the salvation of the world. It is beyond the world. We have no lasting city here, but our citizenship is in heaven. That's both in the Epistle to Diagnitus and harkens back to St. Paul. Nevertheless, within this world, there has to be an engagement with it. And that can take political, artistic, philosophical, literary, whatever means in order to accomplish this drawing of people to Christ. I think when one sees, let's say, an explicit testimony to Christ in the world that draws people within or into the sacred space of the church to participate in its rhythms and the sacraments, because the Church is the body of Christ, then that's a good thing. Even if someone is doing it cynically and it leads to that outcome, God brings about that outcome, that is still a good thing. And that kind of harkens back to what we were talking about in relation to the martyrs, from a certain point of view, it's horrible because they're massacred. From another point of view, they become intercessors to Christ for each and every one of us, and they reign with him forever and ever. So from their point of view, Saint Euphemia actually said this to Saint Paisios because she appeared to him 30, 40, how long ago? 50 years ago, she appeared to him after he was entreating her. Do you know the story? So he had been entreating Saint Euphemia because he wanted to know how it was that she solved the impasse in relation to the fourth Ecumenical Council, in relation to the condemnation of mere physitism or Monophysitism. So Christ only has one nature, which would have subsumed his human nature. Now, in the Council of Chalcedon in 451, the church affirmed that Christ has two natures. He's fully divine and fully human in one person, in the officious, one person into natures and the officious in means, in two natures, divine and human. As he's fully God, and in that way he's able to save us from death and he's fully human, so that we might participate in his victory over death. If he wasn't fully human, we couldn't participate in anyway. Saint Euphemia performed a miracle. He had been praying to her. He heard a knock on his door and the door of his cell. He ignored it because there was no one else around. And then he turned around and he saw her standing inside his cell. And in order to test her, he asked her to venerate the Trinity with him. And she did that. And then in the course of their conversation, he asked her, how did you enjoy your martyrdom? And she said to him something like, if I knew all the glories that came afterwards, I would have allowed that martyrdom to last a lifetime or something. This is a communique, let's say, from a third century saint, because she died during Diocletian's persecution to a modern saint. So, you know, bad circumstances, good end. Again, if the circumstances initiated by a ruler lead to participation in the life of the Church, ultimately that's a good thing. That's whether you're talking about Constantine or anybody else. There's a cynicism in relation to that that comes up again and again, especially when people are, let's say, preoccupied with the sins of a particular people or group in the world. There are certain junctures at which the Church cannot compromise doctrinally in relation to morals. And it should prophetically castigate the world when it behaves in an evil manner. But ultimately, if people come to the Church to venerate the icons and to be conditioned by the life of the Church, if it leads to their undertaking, introspection and repentance and all of the things that we experience as Orthodox Christians, then that's a good. Isn't it? That's my only answer. I don't know if we can dwell upon that."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":5375.53,"end":5463.35,"speaker":"Jonathan Pageau","text":"No, I think so. I think so. I think what fascinates me, like in terms of the image of, let's say, the sleeping emperor and this idea of a return of an emperor which will serve Christ as it's collated like that is right next to the image of anti. Antichrist or a kind of Antichrist vision of an emperor. To me, there's something. To me, there's something in this duality which fascinates me, which sometimes I wonder if it has something to do with the very ambiguity of Rome itself in the history of Christianity or the idea that Rome is both the beast, the whore, but also then the conversion of Rome ends up being an image of the new Jerusalem. Whether or not there's a sense in which. Like when Christ talks about how the wheat and the tares are growing together, right, where there's something of that. Where there's something of civilization which becomes a vehicle for the glory of God, but nonetheless contains in itself always the problematic. Problematic aspect of the lineage of Cain, let's say, right. The dark aspect of civilization, that those two kind of continue on until the eschaton to exist together, until they're finally solved in a cosmic way. I'm not sure it helps in terms of practical. I'm not sure it helps in terms of sometimes knowing what to do in a practical sense. But I think that at least conceptually, it helps me to understand why these images seem to always kind of be next to each other, let's say, in the imagination of people."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":5463.75,"end":5554.1,"speaker":"Dr. Mario Bagos","text":"Yeah, Rome is multivalent. In other words, civilized. I mean, St. Augustine might anticipate the difficulty because he says something like this in his City of God. The Church is in the world and the world is in the Church, and they will be intertwined until the eschaton, which is the wheat and the tears example being interpreted there. So how this relates in a spiritual sense to the. To the Christ Antichrist dialectic, let's say, and how that's transposed civilizationally. Well, the Church is always above each and every respective culture and civilization because it is ultimately Christ's transcendent kingdom, which takes on the forms and modes and modalities of the world to a degree. You know, we enter physical buildings that are built by people, icons are painted by people, but God's providence is always active there. And through tradition passes down the Holy Spirit, passes down the way things are done in the church in a very secure manner from generation to generation. So the church is one thing, it engages with the world constantly, but the world is another thing. And the church can take the good from the world and interpret it in a positive way and use it, but it also has to reject the bad in the world and even prophetically denounce it. And that's a complicated thing that I think can only be judged, as you mentioned, on a case by case scenario by those who have discernment, namely the saints. And I'm not one of them, so I don't know. I mean, you know, at least it's."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":5554.1,"end":5604.71,"speaker":"Jonathan Pageau","text":"A call for us to stay vigilant in terms of, to kind of have us a certain vigilance. And also it's almost like there's a sense in which sometimes we're overly cynical of the reality of the state or the reality of how Christ can manifest themselves through authority, and then sometimes we're overly enthusiastic about that. And so it seems like those two people seem to slip into those two extremes constantly in the history of, of Christianity, and that ultimately what we would need is more is a kind of balanced vision where we are capable of seeing Christ, the fruits of Christ in manifest themselves through authority, but also be cynical enough to not confuse the emperor and Christ himself, let's say something like that, or not confuse the state with God himself."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":5604.95,"end":5692.72,"speaker":"Dr. Mario Bagos","text":"Look, I agree with that. I think you've nuanced it there because it's like, be enthusiastic about Christ, but know that in the worldly circumstances, you know, he might permit certain circumstances to be that way for a reason. And what we might perceive as good might be genuinely, genuinely good and intended as good, or it might be bad, but he might bring it about to a good that we don't know about yet. So it's good to almost even. You need discernment, and that's hard. That's what the saints have. Like, I can't, I can't even begin to, to understand what they see in worldly circumstance where they say, for instance, you know, something that looks terrible, just wait and you'll see how it'll turn out down the track. You know, that's, that's a charism, I think that the saints are endowed with, in relation to the final emperor motif. And it is a deviation. It's not eschatology, which is, you know, the, the way that we formally define the study of the end times from Ta eskata, which in Greek is a plural noun meaning the last things. It's not. The last emperor motif is relegated to a subdivision. We don't expect as Christians a final emperor to come. We don't. We expect the king to return, the Lord Jesus Christ. But you know, in times of distress, this motif appeared again and again and there was perhaps nothing more distressing than the fall of the city of Constantinople, the queen of cities. So mate, do you want to jump to Constantine Palaiologos?"}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":5692.72,"end":5705.83,"speaker":"Jonathan Pageau","text":"I think so. I think like we've been going for almost two hours so maybe we can go to, to Constantine and then, and then, and call it, call it after that. So maybe talk a little bit about, about this kind of final image that appears at the fall of Constantinople and, and we'll."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":5705.83,"end":5708.91,"speaker":"Dr. Mario Bagos","text":"Yeah, okay, Jonathan."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":5709.07,"end":5711.79,"speaker":"Jonathan Pageau","text":"Well, there's a lot to say. I know, sorry."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":5711.79,"end":6271.3,"speaker":"Dr. Mario Bagos","text":"There's a lot to say. So, you know, because it goes back to, let's say, the circumstances that are conditioning the empire from the 1200s, you know, after the Constantinople is sacked by the Crusaders in 1204, three kingdoms spring up in Nicaea, in Epirus and in Trebizond. Of those three, it's the empire of Nicaea that makes it back into Constantinople and initiates the Paleologos dynasty which rules until the fall of the city in 1453. Before that, during the empire of Nicaea, within the empire of Nicaea, which is in Asia Minor, just before the Laskarid dynasty, there was an emperor called St. John Vatatis and St. John Vatasis who was known as St. John the Merciful. He's the saint in the church. After the city was reconquered in 1261 by the Byzantines, it was Michael Palaiologos, after the Laskarids, who went in there and took the city. The relics of Saint John Vatatis were taken into the city, the incorrupt body of the saint. And it was believed that he was sleeping and that one day after the fall of the city that he would also wake up to reconquer the city. So the motif of the sleeping emperor appears also in relation to this king, but it's crystallized with Constantine Palaiologos. Now Constantine Palaiologos was dealt a pretty poor hand in relation to when he was born. In other circumstances, maybe he would have done wonders because. Because he was a brilliant tactician, a great leader. His older brother was John VIII palaiologos who in 1438-39 went over to Ferrara, Florence to broke up the union with the Roman Catholic Church which was militant at the time, as we know. And this was done in order to bring back support for the Byzantines who had now been encompassed by this stage by the Ottomans. The Ottomans had taken Thrace. Murad II, the father of Mehmed II, who conquered Constantinople in 1421, he took Adrianople, which he renamed Idirne, which is in Thrace and made that his capital. So a stone's throw away from Constantinople. So it was surrounded. All that was left to the empire was the city itself and the Peloponnese in Greece, in southern Greece, the Morea. And Constantine in fact kicks off his career in the Morea in the Peloponnese. He becomes the despot of Mistra, which is Nispata. And it is there within that framework, which was a place of letters of erudition, the seeds of the Renaissance were there that he first shone as a leader. And in the early 1440s, so after the failed reunion council of Ferrara, Florence, because when John VIII came back, St. Mark of Ephesus refused to sign the documents of the council, refused to accept it because it was a unilateral imposition of Roman Catholic doctrine which considered heretical onto the Orthodox Church without discussion, without. So the people rejected it. And that caused a lot of tension in the city which plays out up until the fall of the city. Plays out up until the fall of the city. Constantine then, you know, he. He doesn't make his, let's say view of the Union of Ferrara Florence known. He gives a lot of time to the anti unionists which prompted the later historian to say that he was only pretending to go along with it. What's interesting is this. They did manage to get the initiative for another crusade comprised of Poles, Transylvanians and Burgundians to attack the Ottomans. As that crusade was moving through Eastern Europe, Constantine as the despot of the Peloponnese in Mistra takes his chance to extend the boundaries of Mistra into mainland Greece and to take back little principalities that since the fourth crusade belonged to the Italians. But there was a prophecy in relation to the border between the Peloponnese and Attica in Corinth. Separating the Gulf of Corinth from mid and northern mainland Greece is a six mile wall known as the Hexameleon. And there was a prophecy that said that this six mile wall, the Hexamelion, would be built four times and the fourth and final time that it would be built, it would last forever. You know, the first time was during Xerxes. The second time, you know, the battle of the Persians in ancient times. Second time was during Justinian's reign. It was rebuilt then. The third time was during Constantine's father, Manuel Palaiologos, he rebuilt it, but each time it was demolished. Constantine rebuilt it in the 1440s and that was seen as a fulfillment of a prophecy. That's his first foray into prophecy. And then he extended himself beyond the Morea when the Ottoman Sultan Murad, after he defeated that fourth Crusade and discovered what Constantine was doing, he came back, smashed the Hexamelion and basically undid all of his work. It was very tragic. Constantine was appointed emperor after John the 8th died and basically had to oversee, you know, the empire in times when, which would lead to the ultimate conquest of the city in 1453, on May 29. Let's jump to the final months of the city because that's when we get a lot of apocalyptic imagery emerging. So there is a desire on the part of Constantine to get Western help. So he actually performs, he allows for the performance of a uni at liturgy. Catholics and Orthodox together in Hagia Sophia in the cathedral church, believing that that will, well, that was the term set upon them by Rome, that if they showed that they had accepted the union between the Roman Catholic Church and the Orthodox Church, that they would send over a crusade. What they did get was a former Byzantine Byzantine bishop who became a Roman Catholic cardinal at the Council for Arabic Florence, Isidore of Kiev rock up with 300 archers for Constantine at the time was better than nothing. Further help does arrive from the west, not in the form of the Crusade. A mercenary named Giustiniani Longo. Genoese mercenary Giovanni Giustiniani longo arrives with 700 soldiers. So that encourages the emperor even more. All the while the correspondence with Mehmet ii who wants to take the city, is floundering. And we don't have to go into the reasons why that's the case. In the spring of 1453, Mehmed's forces, between 60 and 80,000 strong, marched from Idirne towards Constantinople. And on April 11, the Ottomans attacked the city walls with cannon fire. In mid April, an attack on the landward walls was thwarted by the Romans and the Genoese working in concert, compelling Mehmed to turn to a naval strategy. And that's when, if you Imagine Constantinople as a peninsula, a promontory surrounded by three sides of water with landwood walls on its western side. They got the Ottoman ships which were in the Bosphorus, across the northern tip, across the Golden Horn from Constantinople, there was a piece of land known as Pera or Galata. They managed to get 70 vessels over land and put them into the Golden Horn, which was just off the northward walls of the city. And that happened around the 18th of April to the 22nd of April. So beginning of the end, let's say, for the city, on the 16th of May. On the landward side of the city, sappers were creating underground trenches to reach the outer walls, and these were discovered and destroyed by the byzantines. And on 19 May, a Turkish siege tower was repelled. And then there are the portents. Now, I don't know what to make. We have to. Might have to discuss these, because these are very interesting. On 22 May, the moon was eclipsed. And on the following day at midday on the 23rd, the icon of the Mother of God, or the Yitria, she who Leads the Way, was processed around the city for the latter's protection. But a terrible thunderstorm broke out and the icon slipped and fell from the frame on which it was mounted, and the procession was then immediately abandoned. In fact, the sources say that they couldn't lift the icon up, that an invisible force was keeping it pressed to the ground. On the 24th of May, that's the next day after the procession, the city was enveloped by a thick fog until the evening when a red glow was seen on the dome of Hagia Sophia, the main cathedral of the city. We've discussed it before. And this glow rose to the peak of the dome of Iosofia and disappeared. And this is recorded in both the Byzantine and Ottoman sources. What do we make of this?"}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":6271.94,"end":6275.78,"speaker":"Jonathan Pageau","text":"What do I make of what? Of portents in general or of those portents?"}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":6275.94,"end":6277.9,"speaker":"Dr. Mario Bagos","text":"Of these portents? Of these portents."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":6277.9,"end":6358.43,"speaker":"Jonathan Pageau","text":"I mean, they're pretty. They're pretty. They're pretty obvious. I don't see, like, the idea of the. Of the sky becoming red or the moon becoming red or the idea that this is related to death somehow. You know, you hear that in Lord of the Rings once again, where it says, you know, the sky is red means that blood was shed today or whatever. I mean, I think that these porns are very intuitive. You know, the idea of the icon that falls and cannot be. Cannot be lifted. You know, it's not that there's nothing mysterious about the portents, in terms of what they signify, you know, we saw there have been recent portents like that that have been pretty astounding. If you think of, for example, Pope Francis trying to release two doves for the peace between Russia and Ukraine, and then one dove and both dove being attacked in the sky by a blackbird and a white bird. You can find their pictures of it there. He releases these two doves by a young girl and a young boy dressed in blue and red. It's almost like this image. And he releases the doves, and then one bird gets attacked by, like a crow, and then the other dove gets attacked by, like a seagull. And, and. And it's like, yeah, there's not going to be peace between Russia and Ukraine. It's like, it's one of those. It's one of those things. Portents happen. I don't know what to say happened."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":6358.91,"end":6659.35,"speaker":"Dr. Mario Bagos","text":"This is the thing. This is the thing. Because, you know, while I, I ask you to provoke conversation, you know, I'm not trying to put you on the spot, but yeah, because while, of course, I don't believe in the myth or the legend of the final Roman emperor, I believe everything that we've discussed about Christ and the saints. But, you know, here I have no trouble accepting these portents because this city was so inundated by relics, the presence of holy figures. We know that, you know, what if there were unnamed saints in the city? And this is what we know happens in such circumstances when God's beloved are under threat. It happened in relation to St. John Chrysostom. When St. John Chrysostom was exiled from Constantinople on two occasions. The first time, an earthquake occurred during his first exile. During the second exile, Aelia of Doxia, again, ruler, cult stuff, but in relation to the female empress, she died. And I think the evil church mysteriously was set ablaze. So, you know, these things happened in relation to Constantinople. And the fact that these signs were corroborated by both sides, that's very interesting. Anyway, and on the 28th of May, so after the portents, and again, you know, you can understand this, given the. What was taking place, everybody gathered in Hagia Sophia and put aside their differences and they celebrated the liturgy together. And when Constantine communed and asked forgiveness for his sins from the people and left to do a final inspection of the walls, terrible moaning and wailing was heard. It's very, very moving stuff. When you read the accounts. The final Siege began on May 29 at 1:30am There were three waves of attacks on the landward walls with cannon fire as well. The Turkish cannon bombardment began at the St. Romanos Gate, which is basically in the middle of the landward walls. You can find a gate, a map of Constantinople and you will see in any good map where the Saint Romanos Gate is. The Sultan sends his irregular troops to attack the land with walls. But they were cut down by the byzantines and after two and a half hours of slaughter, Mehmet calls them back. At 4am a second wave of troops and Anatolian army, many of whom were former Christians, were attacked and also repelled. And at 5am the third wave, Janissaries, made up of former Christian boys converted to Islam. These were the janissaries and trained as the Sultan's elite guard, were sent to attack. And these were basically the hard hitters. The Emperor Constantine led the defense which seemed to be holding ground at this point. One of two things happens, one before the other. There is towards the north of the landward walls, a gate known as the Circus Gate Iker Koporta, where some of the Genoese soldiers under Giovanni Longo, the Bocchiati brothers, were undertaking skirmishes outside of the walls and back in and they had forgotten to close the door. So some of the Ottoman soldiers rushed in and were able to put up flags on the ramparts at the northern side of the Theodosian walls. At around the same time, Giustiniani Longo, who's fighting with Constantine around the St. Romanos Gate, he's mortally wounded and he's been wounded a few times. These people were fighting sleeplessly for days. And he asks Constantine for the keys to the gate behind them because it's a three tiered wall, Theodosian walls, so that he can go back into the city in order to get mended. And Constantine gives him the keys and his soldiers, the Genoese, they take him away. But then other Genoese were there, think that he's retreating, right? Think that their people are retreating. So they leave and they leave the Romans alone to fight at this spot on the St. Romanos Gate. And here the accounts vary. We don't know what happened to Constantine Paliolo. Some people say that he threw off his regalia at this moment, knowing that all was lost, and threw himself into the fray. Others say that he was trampled by the onrush of Ottoman soldiers. Some say that he, you know, had a few duels with some Ottoman soldiers and was killed in that way. That he was decapitated during, during the jewel or that his body was discovered afterwards and decapitated or that he was buried in a mass grave. And the way that people identified him, one or two people identified him, was because they saw the purple boots that the Roman Emperor would wear. We. We don't know what the reality is here."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":6659.83,"end":6662.47,"speaker":"Jonathan Pageau","text":"So they don't have. There is. People don't have his body."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":6662.95,"end":6779.61,"speaker":"Dr. Mario Bagos","text":"No, no, his body does. Even though there were many people who believed that he was buried in various places. So some people later on said that he was buried in the Gul Jami, which was once the Church of St. Theodosia, which the feast day of which is the 29th of May. So it's one of the later ecumenical patriarchs who refers to the belief. So not necessarily that he himself believed it, but the belief, this is in the 1800s, that Constantine is buried in the Gul Jami because there were certain Turks and Romans would go there, Greeks would go there and venerate his tomb. There's a belief that a small, nondescript grave in one of the regions in Istanbul is described as being his grave, as believed as being his grave again, so the people who are writing about it, they don't actually believe it. By Edwin Augustus Grosvenor, who was a American historian and tutor in Constantinople for a while. Renowned figure, was a pastor in one of the Protestant churches. And while he was tutoring in Constantinople in the 1800s, he would see Greeks going to a grave in a district known as. Where is it? Abu Vefa in Constantinople. And this was put to an end by the Ottoman authorities. And he himself says in the description that this was not his grave. The Turkish accounts all have him, let's say, being presented in one way or another to the sultan. Like he's being decapitated, he said, taken to the sultan or something after his death, but we don't know. The legend quickly arose, however, that he's not dead, that he was plucked from the spot by an angel and taken to the Golden Gate, but he was put in a subterranean cave."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":6780.17,"end":6800.25,"speaker":"Jonathan Pageau","text":"The subterranean cave is important in terms of the seed that I talked about before. The idea of the emperor ship moving down into a seed form where the king vanishes, but like I said, vanishes in invisibility, but then is hidden in the earth like a treasure or a seed that it will sprout again later."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":6801.64,"end":7004.33,"speaker":"Dr. Mario Bagos","text":"Yeah, that's analogous in terms of the symbolism. That's right. I mean, and this image emerges within the next century in laments that are written about Constantinople and the final king. So these laments form part of the popular folklore and literature, but there's A few interesting things that are recounted about him in relation to. They look exactly like some of the motifs that we discussed earlier. Just to bring everything full circle in relation to the Tibetan serial Pseudo Methodius and the Slavonic Daniel. It's called the Slavonic Daniel. I didn't mention it before because that rendition of the Pseudo Methodius, which is transferred to Daniel the Prophet, only exists in a Slavonic version. That's why it's called the Slavonic Daniel. But there's this one lament that talks about Constantine just before the city of Falling, seeing a queen entering a church of the Virgin. Now, Constantinople was considered protected by the Virgin Mary the invincible champion Ti Permajo Stratego from around the 7th century onwards. And he follows her into the church. And she sat on the bishop's throne and looked very mournful. Then she opened her holy mouth and addressed the emperor. This unhappy city was dedicated to me. And many a time I've saved it from wrath. Now too, I have entreated my son and my God. But alas, he has decreed that this time you should be consigned to the hands of your enemies because the sins of your people. See, it's the same kind of reflexive and introspective way of viewing things, blaming oneself for the calamity instead of one's external enemies, which is the Christian thing to do. We're meant to love our neighbor, so we're meant to love the Turk and the Italian and the Roman Catholic and everyone else. So I say that to mitigate any possible invective that will might come up in the comments. It just happens. So I've treated my son, my God. But alas, he has decreed this time you should be consigned to the hands of your enemies because the sins of your people have inflamed the anger of God. So leave your imperial crown here for me. This like 1400s, 1500s, 700 years after Slavonic Daniel, you know. And it's come up again in the Byzantine context. Leave your crown here for me to look after until such a time as God will permit another to come and take it. When the emperor heard this, he became very sad. He took his crown and scepter left by the last Roman king who was asleep and woke up after his defeat of Gog and Magog and the Ishmaelites at the foot of Golgotha. He leaves his crown and scepter at the feet of the Virgin, lays them on the altar. Sorry. And he stood in tears and said, my lady, since for my sins I've been bereft of my imperial majesty, I resign also my soul into your hands, along with my crown. So he's relinquishing his life to her the way that the last Roman emperor would relinquish his life at Golgotha. In the previous text, the lady of the angels replied, may the Lord God rest your soul in peace in the company of his saints. The emperor made obeisance and went to kiss her knee. And she vanished. And her eunuchs, who are angels, vanished with the her. But neither the crown nor the scepter were found where they had been left for the Lady. The Mother of God took them with her to keep until such a time as there would be mercy for the wretched race of Christians. How epic is that? Definitely."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":7004.41,"end":7005.21,"speaker":"Jonathan Pageau","text":"That's amazing."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":7005.61,"end":7068.76,"speaker":"Dr. Mario Bagos","text":"That brings it all together. And you know what's very interesting, Donald M. Nichol, who translated the text that I just read to you, he goes, okay, so that was in this book, the Immortal Emperor, which is the book on the legends of the last king of the Romans, Constantine Palaiologus. The lady, he says, takes the crown and the scepter born of his sword of Constantine by little of his sword. Well, a 19th century Italian ambassador to Constantinople named Teco claimed to have it in his private collection of arms and to have taken it from the tomb of Mehmet II. In 1866, a delegation of the Greek or Roman the Romi community from Constantinople presented a ceremonial sword to the Danish Prince Constantine, heir to the throne of the Hellenes because the Greeks were ruled by German and later kings from Denmark. And you know, and on the occasion of his coming of age, claiming that it had belonged to Constantine xiiloros, they even referred to this new Constantine as Constantine xii. So this had."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":7070.39,"end":7073.03,"speaker":"Jonathan Pageau","text":"I never heard any of that. That's mad."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":7073.43,"end":7164.27,"speaker":"Dr. Mario Bagos","text":"It's all in here actually. When the new Greek state was founded after the hellenic independence in 1821, in the 1800s and it's the 200 year anniversary of that this year. So that's also very interesting because the modern Greek nation was founded by people who cannot say it's heroes, but they were very much interested in the celebration of Orthodoxy publicly. And so that's all very interesting. But you know, they went looking, according to a reference in this book, they went looking for an heir. I don't know who went looking, some of the representatives of the newly formed government for an heir of Constantine Palilogos in the west, but couldn't find one. And there were many people who claimed to be heirs in the west and in the East. And there's a whole trajectory outlined in this book. But I think that's very interesting concerning the sword and concerning the kind of afterlife of this belief in the final king, which we saw was popularized in the folk songs that we mentioned at the beginning of our talk. Omar Marumenos Vasilias, the Marble King by Haris Alexio and also Stamatis Panudakis. You will come like lightning. And that's actually very. In that particular song, which is a beautiful song, and I can send you the links, maybe you can put them for people to listen to. He conflates imagery that's associated with Christ, with the emperor. So you will come like lightning, you know, you will bring light and all these sorts of things. It's just. It's very interesting. Do we have time for."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":7165.55,"end":7167.07,"speaker":"Jonathan Pageau","text":"I. Sorry, if we have time for what?"}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":7167.23,"end":7168.59,"speaker":"Dr. Mario Bagos","text":"For one more reflection."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":7168.75,"end":7170.75,"speaker":"Jonathan Pageau","text":"Let's have one more reflection. All right, go for it."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":7170.99,"end":7173.47,"speaker":"Dr. Mario Bagos","text":"Okay, thanks. Sorry we've gone for such a long time."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":7173.47,"end":7176.75,"speaker":"Jonathan Pageau","text":"It's really fascinating stuff, but. So. But yeah, go for it."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":7176.83,"end":7277.89,"speaker":"Dr. Mario Bagos","text":"It is. Thanks, Jonathan, and thank you for your. Your patience with this. The historian Dukas relates the following in relation to Constantine's column, and this again harkens back to the apocalyptic literature from earlier centuries. Because the Slavonic Daniel speaks about the last emperor. Yes, he's roused from sleep and everything else. Or not roused from sleep. He's discovered. Sorry, through divine revelation. Divine revelation discloses him in the Slavonic Daniel in the text written in the 8 hundreds in. In Sicily. So he wasn't sleeping, but he's poor. He's like a pauper king. Now, Doukas says the following concerning the fall of Constantinople, when the Turks broke in. This is a historian writing. In the 1400s, the Christians rushed to Hagia Sophia, the great church. And that's what happened. Monks and nuns, men and women, carrying their babies and abandoning their homes. The street was packed with people making for the church. The reason for their stampede was this. There was an ancient and false prophecy that the city was destined to be violently captured by the Turks who would slaughter the Christians as far as the Column of Constantine. This brings it back to our talk from last time, from the point from which Constantine began construction on his city. As we saw at that point, however, an angel bearing a sword would come down and hand over the sword to an unknown man, a very plain and poor man standing beside column. The angel would say to him, take this sword and avenge the Lord's People, that's this pauper king manifesting now from the 9th century transposed into the 1400s. So this literature was alive and well, and Constantinople."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":7278.37,"end":7293.93,"speaker":"Jonathan Pageau","text":"That's amazing because that's so close to the image of Arthur who takes the sword from the stone without knowing what's going on. And nobody knows. And he brings the sword. Anybody's like, what is this child have this sword. And he's revealing secretly that he is the future king."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":7294.73,"end":7301.85,"speaker":"Dr. Mario Bagos","text":"That's right. The symbol of the power and might of the sword. Well, this is something that of course it bifurcates. It kind of goes east and west like this, you know."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":7301.85,"end":7303.05,"speaker":"Jonathan Pageau","text":"Yeah, yeah."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":7303.05,"end":7304.53,"speaker":"Dr. Mario Bagos","text":"I mean, that's another topic in itself."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":7304.53,"end":7309.81,"speaker":"Jonathan Pageau","text":"And so this pauper who receives the sword next to the. Ends up being the hidden emperor."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":7309.81,"end":7343.47,"speaker":"Dr. Mario Bagos","text":"Let's say that's the implication because he will then chase them to Monodendrion, which is where the red apple tree is. Was which we talked about at the beginning of the talk, either at the borderlands between Byzantium and the Ottoman Empire or where the Turks came from or the Arabs, depending on when you which text and when it was written. So, yeah, that's then the new final emperor, let's say these pauper kings. So, you know, they had a long lifespan, these myths and legends of the final emperor."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":7344.34,"end":7490.69,"speaker":"Jonathan Pageau","text":"Well, thank you so much. I think that maybe I want to add one last thing before we end. It's mostly for people to be able to pull back from all these stories and to, on the one hand, understand that we don't always have. We don't have to see these stories, these tropes, these patterns as happening explicitly in the way that some people might expect them to happen or not happen. But we need to be able to understand them as valuable even in their most. Even in the most folkloric way that they appear. We need to be able to understand them as valuable as manifesting patterns of how things happen. And the way in which they are captured mythologically and in legends can help us nonetheless have insight on how things go away and how they come back. For example, the image of the idea that hidden in a pauper is the king. It's something you see in fairy tales all the time, that you have this imagery of the golden ball which falls to the bottom of the pond, or all these imagery of value being hidden in the field and then being found in a surprising way hidden in something. And so all of these images can help us understand how reality works, even if we have to be careful not to become too enamored by them. So that we start to become obsessed. Because you see that, right? You see people become obsessed and start to see, like, what the signs and the signs and the signs. The world will manifest itself in signs, and we will see the signs of the times. But we have to be careful not to become too literal in the bad sense. And remember, for example, I keep wanting to remind people that when it says in the Old Testament that Elijah will return before will come before the Messiah, that. That Elijah was John the Baptist, and that really is how that pattern ended up manifesting itself. Now, for a literalist at the time, it would have been very frustrating for them to hear Christ say, well, yeah, Elijah did come. It's John the Baptist. And it would have been very frustrating for them to see that. But for someone who's able to kind of pull back and understand these as these kind of the way in which the world kind of lays itself out in these patterns, it becomes at once less dangerous and more insightful for you to be able to see how it is that reality unfolds. So that's my last. I don't know if there's a last thing you want to say on top of that."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":7491.57,"end":7637.92,"speaker":"Dr. Mario Bagos","text":"I agree with everything you just said. And the stories themselves are tragic, too, and they give some sense of hope to people who were suffering. I mean, this is what we see unfolding in each of those contexts. And this, you know, it's these. These stories because they gave comfort to a subdued and subjugated people in the 7th century, in the 9th century, and in the 15th century. They're benign, more or less, unless we become literalistic and, you know, preoccupied with them. And to avenge ourselves on our. We're meant to love our neighbor, love our enemies in imitation of Christ, and we can take the good from these stories as well. So, you know, you've got even deeper by saying that, you know, the expected outcome might not be in the literal sense, you know, the final king or of the Antichrist, or whatever motif that we touched upon tonight. It might come in a way that we don't expect. And that's a very deep way of reflecting upon that. And I appreciate that the symmetry is interesting. This is a last. Just because I forgot to mention it, some of the writers around this period, they say two things. They say that the city itself, its fall, actually saved Orthodoxy because of the fact that the imperial court that had gone under Rome dissipated, and the paradoxical putting of all of the Orthodox nations under the Ecumenical Patriarchate, which was considered a millet, kind of like a Ethnarchy that had contained within itself all of those people that ascribed to the same religion through which the patriarch would be responsible to the sultan and vice versa, that providentially preserved Orthodoxy because the Serbs and the Bulgarians also were going over, were tempted to go over in previous centuries to Catholicism to get military help. So that's that aspect that the fall of the city had a positive outcome for the Church. There's another aspect that there's a symmetry between the founding of Constantinople and its fall in terms of the fact that it was founded by Constantine who had a mother named Helen, and it fell with a Constantine whose mother was named Helen. She changed her name to Hippomone when she became a monk, Saint Ipomoni. But that symmetry is eerily mirrored by the old Rome, which was founded by Romulus and ended with Romulus or Castalis. So there's a pattern there that was made manifested twice. And that confirms, I think, what you just said, Jonathan."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":7638.79,"end":7665.03,"speaker":"Jonathan Pageau","text":"All right, everybody. Well, thank you for your attention. And I hope this will be. This is food for thought. And, you know, we'll put in the resources, more resources, obviously, in the links for people to look into this. And yeah, and symbolism happens even in the most historical, sometimes tellings of the story. And, you know, it's like to remember that the city falls through the circus gate is something that we all need to remember right now in our world of dilapidation."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":7665.74,"end":7666.3,"speaker":"Dr. Mario Bagos","text":"That's great."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":7666.86,"end":7668.94,"speaker":"Jonathan Pageau","text":"So thanks, Mario. Thanks for your time."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":7669.18,"end":7670.42,"speaker":"Dr. Mario Bagos","text":"A pleasure. Pleasure."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":7670.42,"end":7670.94,"speaker":"Jonathan Pageau","text":"Really, thank you."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":7670.94,"end":7671.34,"speaker":"Dr. Mario Bagos","text":"All right."}
{"episode_id":"SW - #179 - 2021-10-15 - Dr. Mario Baghos - The Immortal Emperor","start":7672.54,"end":7737.53,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward, and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
