{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":0.16,"end":87.07,"speaker":"Jonathan Pageau","text":"The thing the whole evolution narrative is the most is just so hilarious because the evolution narrative has to be ends up being teleological. They can't avoid it. Every time they try to make it non teleological, they fail. So and so it always ends up having to be teleological. And so then it becomes non scientific immediately. It just becomes a kind of a mythological pattern. And it's like, well, if it's, it's mythological story, my mythological story is much better. Like the creation narrative in Genesis accounts way in a better manner for the ontological hierarchy of your experience of the world than the way that evolution talks about reality. And you can see, like, I mean, when I talk to Brett Weinstein, it's always the same issue. And you see the same with all the evolutionary theorists. They're basically saying what evolutionary want evolution really wants you to do is to basically kill and compete and take and just get your seat out there, get your genes to the next generation. But of course, we shouldn't do that, right? It's like, okay, well where do you get the we shouldn't do that from? That's actually what interests me because that's a lot closer to what I care about. And then maybe you can find that in the Genesis story, but the other, you can't find it anywhere else in your little pattern, like in your little worldview. This is Jonathan Peugeot. Welcome to the Symbolic World."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":97.21,"end":119.85,"speaker":"Nate","text":"So I have a couple of special guests with me today on Grill Country. I have Michael Martin, who's kind of a regular and a friend of the channel. Dr. Michael Martin you can find on his own podcast these days, Regeneration Podcasts, where he has very interesting guests and a guest who will need no introduction for most of my audience. Jonathan Pageau of the Symbolic World."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":120.33,"end":125.37,"speaker":"Jonathan Pageau","text":"That's great. It's great to finally meet both of you in person. I've had contacts with Michael for a long time."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":125.53,"end":127.93,"speaker":"Michael Martin","text":"Really? At least 10 years, I bet. Exactly."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":128.25,"end":134.89,"speaker":"Jonathan Pageau","text":"I sent in a piece of art for his magazine Ones, and we met through a common, common friend. And so it's great to see you in person."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":134.89,"end":135.85,"speaker":"Michael Martin","text":"Yeah, it is nice."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":136.57,"end":137.37,"speaker":"Nate","text":"Well, that's great to learn."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":137.37,"end":139.21,"speaker":"Michael Martin","text":"I feel like I've known you for a long time, you know."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":139.61,"end":142.41,"speaker":"Jonathan Pageau","text":"Yeah, that's what it feels like too, but we've never actually spoken, so."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":142.41,"end":190.87,"speaker":"Nate","text":"Yeah, that's actually, that's very interesting because like when I first started reading Michael's books, it's like, that's immediately. It's like, oh, I need, I need to have him talk to Peugeot at some point somehow that's got to happen. It's like, they've got to talk. So here we are. So I might do more listening than talking today because I'm excited to hear the two of you talk. I just kind of dive in. Like, one thing that we can, like, kind of the thing we're going to talk about today is kind of like Christian esotericism, mysticism, that kind of thing. And I. And we've been doing this series on Tomberg's meditation of the tarot on the Tarot on Grill Country. Michael has taught the book and read it several times, and he's been a guest on some of her episodes. And you've started reading it recently, too. So I thought we could just maybe dive into that and tell us about what your impressions have been of the book so far."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":192.15,"end":268.51,"speaker":"Jonathan Pageau","text":"I think it's wonderful. There are obviously a few caveats. I was really surprised about the reincarnation bit. I was like, really? That sounds a little surprising. And I know where he gets it. I mean, obviously he's a kabbalist, so he gets it from the whole cycle of souls things. That's probably where. Because a lot of his stuff seems to refer to Kabbalah, so. But besides that, I think his cosmic vision is very much aligned with mine. And the way that he understands what he calls vertical causality. He's also adding some vocabulary for me that I'll be able to use, I think, in the future, because it's definitely connected directly to, you know. And I think the richness of the book is also that. I mean, this is what we'll get into later, probably in our discussion, even with you, Michael, is that I think one of the reasons why I've defecated from kind of Christian esotericism and kind of step back from it is that I felt like the way that it was presenting itself to me, especially in the recent. Let's say, in the last. I mean, I guess more like at least 100 years, has been almost as a challenge to Christianity and has been presented almost as something which was. Which was subversive to Christianity. And I think that when reading Tom Bird's book, I think that he's really trying to reconcile, you know, the esoteric traditions in the west with, you know, real, real Christianity. And. And so I was really appreciative of that. Yeah."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":268.51,"end":275.59,"speaker":"Nate","text":"In a lot of ways, it seems like what he's doing is almost. It's almost a plea with esotericists to cooperate with the Church. It's kind of the tone of, like."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":275.59,"end":302.51,"speaker":"Jonathan Pageau","text":"A lot of the book, definitely. I mean, I haven't. I've read about maybe a third of the books. I'm not. I'm not where near from done, but for sure. Everything I'm seeing, like I said, except for the weird reincarnation. Reincarnation thing, everything else I feel is he's really. I think that someone would read. If someone read that book and then watch my videos, they would immediately understand what I'm talking about and probably vice versa. Like, if people watch my videos and then read that book, they would. They would immediately understand. So that's great."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":302.59,"end":302.99,"speaker":"Nate","text":"Yeah."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":302.99,"end":386.4,"speaker":"Michael Martin","text":"I think what Tomberg's. What I think he's doing, and it resonates with a lot of people is there's a kind of traditionalism to him. It's a kind of not only appreciation but devotion to traditional sacramental forms of Christianity. He's a Russian writing in French about. About Western esotericism. And it's very different. You know, I don't know. Maybe I don't know enough about it. But from what I know, especially the east and especially in Russia, the esoteric traditions, if you want to call them that there were actually borrowed from the west from Jacob Burma and even the Philadelphia and society and people like that. And then it. So start with the Protestants moved to the Russians came back. At least part of it came back to the west. But. But in the West, I mean, you know, part of what I think Tomberg's doing, part. A lot of what he draws on is not what I would even call like kind of a traditional. Kind of hesitate to use the word. Well, Christian hermeticism. The word he uses. Yeah, because his Christian hermeticism is. Is grounded more in the 19th century. And he went. When he quotes all these authors like Elifis Levy and Papua."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":386.4,"end":391.84,"speaker":"Jonathan Pageau","text":"Yeah. Most of his sources seem to be like late 19th and early 20th century. He has Peladan and."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":393.36,"end":481.16,"speaker":"Michael Martin","text":"Which are all. I mean, they're all interesting. Peladan in particular, kind of fascinating to me. But Tom Ber. I mean, so. So my doctorate is in 16th and 17th century English or English literature, religious literature, where. When hermeticism was hermeticism. So it's a very different. It's very different, you know, that. That strain of hermeticism. So when people talk about Rosicrucianism or hermeticism and they think it's like being a Freemason, I'm like, well, no, no, that's These. Those kind of people can say colonial guys. Well, the thing is, what happened is after the 17th century when there was a kind of a revive revival of that stuff and was connected to masonry in the 18th century, 19th century, they kind of just borrowed the vernacular and appropriated it. And it really doesn't have a lot to do with what this kind of. Because if you look at like traditional figures from the hermetic period in 17th century England, like Robert Flood and Thomas and Henry Vaughn and Jacob, they were. If you would have. We would have talked to them and right now they would have described themselves as kind of traditional Christians. Yeah. What they were rejecting was the scientific revolution and its base materialism and which if you can do science without the realm of the spirit, they thought that was. That was crazy. Right. And so they were. They were kind of traditionalists. They were kind of."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":481.66,"end":529.94,"speaker":"Jonathan Pageau","text":"You're right. There's a way in which it seems like the Freemasons, they seem to have just. They basically just want to aggregate all the esotericism they seemed, at least at some moment, maybe not so much now, but at least in the 19th century, they seem to want to just kind of pull everything into their sphere and so started using all this imagery from the different esoteric traditions. And so that's why I think today people also conflate it all together and because of also the. The strangeness of the Luciferian hoax that happened with the Mason, that all got weirdly kind of brought into modern occultism and then taken up by the Satanists, basically using the tax seals host hoax as a template for their Satanism. It's just so. All of it just so weird that it's also one of the reasons why I kind of tend to stay away."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":529.94,"end":531.06,"speaker":"Michael Martin","text":"Yeah, no kidding. I would too."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":531.06,"end":557.37,"speaker":"Jonathan Pageau","text":"Yeah. Because it just like. It's also hard for people to be able to differentiate and I often feel like I don't have to, like, I don't need it. You know, I feel like I have in St. Gregory of Nyssa and in St. Maximus and in, you know, a good cosmic understanding of the liturgy. It's like I have everything I need and if I'm going to pull from other sources, I can do it once in a while. But I tend not to do it too much because if I do, then people get confused. That's my feeling at least."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":558.17,"end":563.46,"speaker":"Michael Martin","text":"You ever read the book Foucault's Pendulum? Yeah, that's a. That's a hilarious book."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":563.46,"end":568.94,"speaker":"Jonathan Pageau","text":"Yeah, it's hilarious. I really enjoyed it. I thought I read it, the whole thing as a giant, like kind of joke on it."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":568.94,"end":588.34,"speaker":"Michael Martin","text":"It is, it is, it's. It's it's set up. It's like a 400 page setup to a joke, you know, because what he does, because all the, the so called occultists, you know, they, they get talked in to thinking they're members of a, of an occult group they didn't know existed, but they're sure they're initiates into it."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":588.74,"end":624.56,"speaker":"Jonathan Pageau","text":"And they basically, basically invent an esoteric SoC. And it's basically saying like. Because it's the idea of the. Because the idea of the secret is what rules a lot of these players. Then if we create another secret, it's almost like creating a body to be. It's like a little vacuum for which people to kind of step into. I mean, you have people today, all these people saying they're Rosicrucians. Like you've got these Rosicrucian churches in Africa. There was a lot of them. Oh yeah, Rosicrucian churches. And you have all these, and all these people who think they're Templars and the same with the Freemasons who think they're Templars and stuff. A lot of it, I feel is, is so fantastical that I tend to."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":624.56,"end":629.92,"speaker":"Michael Martin","text":"No, no, you're right. I mean, they're just appropriating ideas. Like, I don't think there's any substance there."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":630.24,"end":645.16,"speaker":"Jonathan Pageau","text":"Yeah, but see, Rene Guenant had, I don't know how serious it was, but with Papu they had the idea of creating a kind of Christian esoteric thing using Freemasonry, the Martinism. I think it still exists today."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":645.16,"end":649.2,"speaker":"Michael Martin","text":"There are still Martinists today and Arthur Edward Waite was another one."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":649.56,"end":650.04,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":650.36,"end":662.68,"speaker":"Michael Martin","text":"And there's some of those people in the occult revival of the late 19th and early 20th century. I mean, some of them, not everybody, but some of them tried to Christianize it or tried to."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":662.68,"end":662.96,"speaker":"Nate","text":"Yeah."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":662.96,"end":664.24,"speaker":"Michael Martin","text":"Wade was a member of the golden."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":664.24,"end":666.12,"speaker":"Nate","text":"Dawn at the same time as Charles Williams."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":666.28,"end":702.32,"speaker":"Michael Martin","text":"Yeah. But they both bailed on it. Right. And, and so, but I, but I think, you know, it's actually because I was puzzling over this whole phenomenon in anticipation of our talk and thinking about, you know, now I'm technically an Eastern Rite Catholic and Jonathan is orthodox, so it's pretty much the same thing. But there's no tradition like that, as far as I know, in those Romans. I mean, they certainly picked. The Russians, for instance, would pick up on Freemasonry and all that stuff after the fact. But there's no homegrown version."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":702.32,"end":743.25,"speaker":"Jonathan Pageau","text":"Right, But I think that the reason why we don't see a homegrown version is that we don't see what we could call the. We don't see the split because one of the problems is, is that there's a problem with high theory in the world of esotericism, which is that I think that when people start to create explicit systems and try to create things that are very, very. That are very explicit systems of causality and higher beings and all this stuff, I think that that's one of the issues that happens in Western esotericism. There's almost like a split between popular religion that is. That becomes more sentimental and more morality based. And then you have this thing that splits out and becomes very high minded and intellectual and esoteric."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":743.25,"end":744.17,"speaker":"Michael Martin","text":"Intellectual, yeah."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":744.25,"end":766.17,"speaker":"Jonathan Pageau","text":"But I can find, I can find everything in the icon of the Last Judgment that you could find in any esoteric system that, that you could develop, you know, in the, in the, say that the layout of a church and the way that it's all set up, it's all there, but it's not necessarily, it's not necessarily theorized is what. The way that I would say it. I don't know if that makes sense."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":766.45,"end":841.04,"speaker":"Michael Martin","text":"No, it does. But where I was heading, pardon me, is so I'm preparing for. I have to get this lecture in September on Pavel Florensky. Yeah. The Russian sociologist, priest and martyr. And so I was reading some of his earlier articles. He was only in his early 20s, and a phrase that comes up at least twice, maybe more in those articles is the salt has lost its savor. And he was concerned, and I think he was already ordained by this point. He was concerned that the experience of Christianity in Russia at the time, that for a lot of people the salt had lost its savor. There was no flavor to it. And I think, and looking around now, and I can imagine what drew Tomberg, for instance, because he grew up in Russia, or drew people like Arthur Edward Wade or whoever it happens to be toward that stuff, I think. Blavatsky. Blavatsky. She's kind of. She's Russian too. Yeah. What's with the Russian? That's why I mention her. Yeah. But my point is that in fact, if you read the notes of Bulgakov and Florensky and Florensky's book, the Pillar and the. What's it called?"}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":841.04,"end":842.96,"speaker":"Jonathan Pageau","text":"Yeah, isn't it Pillar and Ground of Truth or something?"}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":842.96,"end":896.97,"speaker":"Michael Martin","text":"Yes, the Pillar and Ground of Truth is that they were reading a lot of people like Rudolf Steiner and Leadbeater. I don't know if they were quote Blavatsky, but they do those Other people, and John Portage, Jacob Burma. So they were. They were definitely aware of that stuff. And I think the reason being. And let me hear what you guys think about this, is that, like, we see right now with a lot of kids who grow up, or even adults who grew up in a Christian tradition, and somehow the salt loses its savor for them. And then they. Whether they're. They're drawn to Buddhism or something very exotic or. I see a lot of kids being drawn toward neo paganism, for instance, and I'm wondering if this is the same kind of thing that Florensky was seeing in 1903 and that maybe was impacting those people in like, the occult revival of the 19th century."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":897.13,"end":944.92,"speaker":"Jonathan Pageau","text":"That's a good. That's a good theory. I think it's an interesting theory. And I think it also, you could say something like it connects to my own experience, which is that for me, my, My. I never stopped being a Christian. I always really stayed a Christian. But let's say there was a detour and then a return where it's like I was reading more Exotic things and Stranger Things, and then I was able to then look back at, you know, traditional Christianity and. And find in it, you know, the fullness that I. That I had been missing. But when I did, though, I also left to the side a lot of the weird stuff that. That I might have been interested because I felt like there was something about it which was, like I said, there's something about it that was deincarnation, like, that was like, too high. And so it tended to suck. It tended to suck the world towards a kind of."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":945.32,"end":947.72,"speaker":"Michael Martin","text":"It's a head trip. Yeah, yeah."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":948.28,"end":1015.23,"speaker":"Jonathan Pageau","text":"And it's not. I think it's also because a lot of people I met, they would tend to use esoteric ideas to relativize existence constantly, to constantly relativize forms. And so they're constantly criticizing any form and everything, as if, you know, it's all about this high, high. And it's like Einsopp, as if it's like Einsopp will destroy the world. It's not supposed to be in the world. And so you have to be careful with. Even with non dualists, you see it all the time. When non dualists are out of control, they tend to want it. They have this like, weird potion inside them to destroy the world and to kind of relativize everything to the point that it. That it actually. And so I think that that's why I tend to come back and I think incarnational thinking and that's why, like, to a certain extent, hermeticism has something, I think, possibly to offer. And interestingly enough, if, according to the information that I have, like, whatever remaining hermeticists that seem to still exist, I mean, they just do the Jesus prayer now. Like, that's the thing that maybe they think that that's all that's really left of what, hermeticism. And so they get together and they do the Jesus prayer and they don't. They're not initiating anybody else. It's like the doors."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":1015.47,"end":1016.11,"speaker":"Michael Martin","text":"Oh, yeah."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":1016.35,"end":1020.91,"speaker":"Jonathan Pageau","text":"There's no one else coming in. They're just gonna die with the. With whatever it is that they have."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":1021.07,"end":1106.8,"speaker":"Michael Martin","text":"Let me initiate you. I will be your master. Yeah. My trajectory is kind of very similar to yours. And I got to the point I was like, no, how about I just bloom where I was planted? I'll try that. Right. Which, I mean, it's good. And, you know, sometimes it's good, sometimes it's not so good, but. And this is what drew me towards sophiology, you know, because I. I saw in sophiology, you know, this very, very much an ecumenical thing, right, because there's a. There were Russians who were. Who were doing it, attracted to it. Vladimir Slovie of Bulgakov, Lorensky, Bergaev. But there were also Protestants who kind of started it off in modern times. Jacob Burma, the Philadelphian Society, Thomas and Henry Vaughan, for sure. And then a little bit later, it hit the west, in the Catholic west, with Louis Boyer and Thomas Merton and people like this. Right. So. So to me, it seemed the appeal with that was not that it was fit material for some kind of esoteric construct, but that it was just very simple in having the idea that if. If we're in a right relationship with God and creation, we're in a right relationship. That's. That's what sophiology is. That. That's enough for me. I don't need. I don't need all these elaborate systems and explanations and wheels within wheels to figure it out."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":1107.12,"end":1124.84,"speaker":"Nate","text":"I was just going to say it was interesting that you mentioned the ecumenical piece because Bulgakov was particularly committed to those kind of ecumenical efforts when he was in England. He tried to bring his Anglican community that he was associated with, in communion with the Orthodox Church. So he was deeply committed to that kind of vision."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":1125.16,"end":1162.38,"speaker":"Jonathan Pageau","text":"So I think, to me, that the whole. You could say that. Let's say that the hyper ecumenical part, I do see how it is related to sociology, and that's one of the reasons why maybe I I am careful about. So I tend to, if you listen to my talks, you'll notice I talk about the idea of the secret feminine, for example, like I will use, I'm afraid of the explicitation of the mystery, let's say of the feminine in the Christian, the Christian story. I'm very scared of that. And I feel like those that have gone too far in that they tend to fall into a strange relativization again of forms and so."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":1162.7,"end":1164.06,"speaker":"Michael Martin","text":"And they get flaky, right?"}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":1164.06,"end":1222.67,"speaker":"Jonathan Pageau","text":"And they get flaky in this. But they move like, it's like. I'll give you an example, very practical example. My own, My own brother went to a Trappist monastery to search for his own vocation. Spent a month there and met with all these Thomas Merton monks. And he said every single day he would speak to his, the supervisor there. He would come to talk to him, spiritual advisor and all the guy would do is talk about Buddhism. Really, that's all he would talk about. My own brother was like, well what about Jesus? He's like, yeah, of course he'd talk about Jesus for about two minutes and then he'd go right back to Buddhism. And it's like, it's that there's something about that when I notice like I've seen with a lot of the non dualists and, and I'm seeing that with like someone that like I admire David Bentley Hart very much so. But I'm seeing some of that even in. Sometimes I see him almost have a disdain for Christianity and disdain for orthodoxy. Sometimes when he's speaking it's like, it's trite, you know, let's talk about Shankara and let's talk about all these other non dual systems. And I'm like, I don't know how helpful this is especially in the public, in a public discussion."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":1222.91,"end":1251.77,"speaker":"Michael Martin","text":"And that's what, actually that's what bothers me about perennialism and those kinds of traditionalism is, which is, well, if everybody's right, what am I doing this for? Why am I looking? You know, but because I don't buy it, right? Because you know, I figured for me he's like, well, the incarnation, the Crucifixion and the Resurrection, that's. But that's what I need right there and I get it, right? And that's, I'm sticking with that guy, right? That's the God I'm going to stick with. You know what I mean?"}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":1251.93,"end":1254.29,"speaker":"Jonathan Pageau","text":"No, I of course, totally agree with you."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":1254.29,"end":1254.73,"speaker":"Michael Martin","text":"Yeah."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":1254.73,"end":1262.75,"speaker":"Jonathan Pageau","text":"No, and I think objectively it's the story of Christ is unsurmounted. Like, there's nothing that beats that story. So it's like, it's."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":1262.9,"end":1274.02,"speaker":"Nate","text":"Well, I would say that even the possibility of perennialism being a view that people hold is only because of Christ. I don't think that there's no way in a pre Christian era you could have that as a thing that anyone would think."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":1274.82,"end":1294.06,"speaker":"Jonathan Pageau","text":"Yeah, well, I think paganism, a lot of paganism, is actually pretty relativistic in that sense, you know, so the ancient pagans usually would. They had like in the back of their minds, a map, a cosmic map. And then they would map on to the different cultures that they would encounter. And so you can read in ancient Greek and Roman texts, like, you know, oh, they worship this God."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":1294.7,"end":1295.42,"speaker":"Nate","text":"Yeah, they would."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":1295.42,"end":1297.34,"speaker":"Jonathan Pageau","text":"Right. They would map on their gods to."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":1297.34,"end":1300.82,"speaker":"Nate","text":"The other gods, map the Romans gods onto the German gods and so on."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":1300.82,"end":1301.1,"speaker":"Michael Martin","text":"Yeah."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":1301.1,"end":1314.46,"speaker":"Jonathan Pageau","text":"And you see the same, like, I think Indian systems like Advaita, they tend to be quite. They tend to be quite relativistic in terms of understanding that this kind of manifests itself everywhere. Like the pattern that they believe in is basically in every culture."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":1314.46,"end":1340.99,"speaker":"Michael Martin","text":"Yeah. On the other hand, I think it is. I mean, not for everybody. I mean, it's not everybody's thing, but. But the study of comparative religion and what's beautiful in other religions is really a worthwhile activity. Right. Which is what I don't know about you, but that's basically what I was doing from the age of 18 till about 28 or so, you know, just checking it out. I mean, I like you, I never didn't feel like I was a Christian, you know. Never. Not ever, you know."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":1340.99,"end":1390.44,"speaker":"Jonathan Pageau","text":"Yeah, I tend. I tend to really see now like, my approach to comparative religion is really like. Well, I guess I like what Nate was saying. It really is Christ centered. That is, I tend to see everything through the lens of the incarnation. And then. Then I'm able to look at other traditions without feeling either overwhelmed or threatened or whatever. I just see it as glimmers and manifestations of the incarnational principle. So in that sense, I never feel like I'm in danger of being overwhelmed by all these other traditions. And I also, like, I would never participate in like, in other religious rituals. You know, I only participate in the Christian tradition, but I can read a Sufi poem and find it beautiful and insightful and extremely connected to something which I see in the church fathers as well."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":1390.44,"end":1436.85,"speaker":"Michael Martin","text":"Right. And it's interesting that, you know, in Topurg, two things he says on this topic, he says, you know, all who came before Me were beggars and thieves. Right. Meaning all the religions that came before were beggars and thieves. And the other thing is, behold, I make all things new. So how those different systems we could say, and this is what I think Tomberg's trying to do in his book, and this is what actually Hans von Balthazar said about Sloviev is that Sloviev took all these, you know, gnostic systems and other things and he ran them through Christ, as in a, through a purifying stream. Right. And I think that's part of what Tomberg's project is in that book, is to clean it up, you know?"}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":1436.85,"end":1441.01,"speaker":"Jonathan Pageau","text":"Yeah, right. Christians did that with, Plato did it with."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":1441.81,"end":1474.79,"speaker":"Michael Martin","text":"And he's giving people of that esoteric bent a way back in. I remember when I read the book, I said, wow, in my father's house there are many mansions. Because what my problem was before that is I thought I had a very limited perception and understanding of what Christianity is. And I read that book, I said, wow, maybe I didn't give this thing enough credit. The Catholic Church, maybe it didn't give it enough credit, maybe I didn't. I was too busy seeing the version I got in the suburbs of Detroit in a, in a second rate Catholic school and not what's really there."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":1474.87,"end":1535.96,"speaker":"Jonathan Pageau","text":"Yeah, but that's actually one of my arguments for Christianity really has been its integrative possibility. Because one of the things that I see also, and that's what I called, I don't know how to call it, like the esoteric split that happened, you know, at the Renaissance or after a bit after the Renaissance, is that you can see how things, how these elaborate and very intellectual systems kind of move up. And then you can notice religion becoming more and more sentimental and moralistic and less and less understood, you could say. And so. But I think that what Christianity ultimately offers is a way, it should be a way all the way through. So it's like when you stand in a church and you have this painted system of images, right. It's connected to a simple person could go in there and be completely touched and, and impressed. But then, you know, a metaphysician will walk in and see the map of the universe in the church. So I think that that's one of the reasons why, that's one of the reasons why I tend to stay within, let's say, the more traditional. Just talk about the church Fathers as much as saying I would choose the Church Fathers."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":1535.96,"end":1536.12,"speaker":"Michael Martin","text":"Right."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":1536.12,"end":1548.74,"speaker":"Jonathan Pageau","text":"It's like it's always the same. Saint Ephraim Saint Gregory, Saint Maximus. So, you know, and they seem to have had all those intuitions that are in the best of the esoteric systems, let's say."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":1549.14,"end":1611.31,"speaker":"Michael Martin","text":"Well, and that, that's. And that's what I think we were talking earlier about why people feel sometimes the salt is lost in savor. And this is my own experience growing up. You know, I was kind of just naturally interested in mysticism. I mean, I went to Catholic school and you know, I wanted to know this person talked to Jesus or the Virgin Mary, what did they say? What was it like? How does that happen? And, and nobody wanted to tell me, you know, because. And I think so what I got instead was, you know, the catechism or kind of a dry intellectual delivery. We had the Baltimore Catechism. It was. I think that's turned more people off the Catholic Church than the sex scandal. But. And so it was for me, certainly, I mean, for, for a lot of people it was an unincarnated experience of Christianity, which is, which is ironic. Right. And how do you return to that? And I actually most of my life has been trying to find a way back into the, to that incarnated experience of Christianity. Yeah."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":1611.31,"end":1623.51,"speaker":"Jonathan Pageau","text":"And I mean I see all your, just your daily practices of being a farmer and doing that. I can see when I, when I kind of follow you and see what you're doing, I can notice that you're really trying to find that. That lived, let's say, incarnational principle."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":1623.51,"end":1672.08,"speaker":"Michael Martin","text":"Yeah, I don't want to read about it. You know what I mean? Well, yeah, you know, because I think what happened after that split you talked about, the renaissance of the Reformation is at least in the West. Not only did religion become more and more sentimental, but the other half of it, it became aridly intellectual. You know, parts of it, I mean, I think. Right. And, and so, and it was in fact I was reading in Florensky, he was talking about the Russian tradition, which is what I love about it is it's both intellectual and anti rational at the same time. You know, it's very intuitive or mystical while it's being intellectual, which is, you know, you see that probably in Slovia more than in anybody. You know, who is the model for both Ivan and Aloysia in the Brothers Karamazzo."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":1672.08,"end":1672.44,"speaker":"Jonathan Pageau","text":"Oh, really?"}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":1672.44,"end":1686.51,"speaker":"Michael Martin","text":"I didn't know that. That's interesting. Yeah, that's it. Actually it's in a book written by his nephew that. Yeah. Because Dostoevsky was good friends with Sloviev. Okay. And he based those two brothers on his two Sides."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":1686.75,"end":1687.55,"speaker":"Jonathan Pageau","text":"That's hilarious."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":1687.63,"end":1692.51,"speaker":"Michael Martin","text":"His totally intellectual side and his deeply intuitive and warm side."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":1692.59,"end":1798.14,"speaker":"Jonathan Pageau","text":"Yeah, that's really fascinating. So what do you think about like, let's say, the basic perception that I have, which is. Let me give you. Let me give you a very practical example about what I'm talking about. And so, you know, especially this is, this is interesting because the Georgia guidestones were destroyed, right. Just a few weeks ago or whatever last week. And so, you know, according to the legend, the person who had it built was named Christian rc. And so you could say in a way it doesn't matter, like whether or not this is related to any group that is actually considering themselves Rosicrucian. There is something about the branding, there's something about the fact that normal Christians wouldn't refer to the Rosicrucians. But right now, something like weird anti human, esoteric, like kind of occultist type thinking will attribute themselves to the Rosicrucians. You could say, like, it's too bad or whatever, but there's something about that which I think is, is important to understand in terms of this split that I talk about where. And the, let's say, the accumulation of this esoteric tendency into, let's say, Freemasonry groups or whatever, like trying to capture. And Blavatsky was also captured, was also kind of trying to pull whatever she could from all that stuff. So this is, I think so. It's like, although I can, for example, in rob someone like Robert Flood, I can see, let's say, the power and the, the good intentions that are there and this desire to keep something magical and, and wonderful about Christianity. It's like by the time you get to Crowley, it's like. And all these people are seeing themselves in line with that same, that same type of thinking. I'm like, something's off. Like something really went off and I need to not be too associated with whatever that is."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":1798.14,"end":1871.69,"speaker":"Michael Martin","text":"No, you're right. And so my doctorate, I did my dissertation. One of the chapters is on. It's kind of, in fact, the title is the Rosicrucian Mysticism of Thomas and Henry Vaughan, because they were part of that initial 17th century movement. But if you. And the original documents of the Rosicrucians were written by a Lutheran pastor. And if you read them, they're as straightforward Christianity as you can get. You know, they were just interested in the rebuilding of society. And some people try to say that they wanted to rebuild society in the scientific way, which is not true at all. What's your name? Frances. Yates wrote a book, the Rosicrucian Enlightenment. I think she totally misunderstood what was going on. It was actually, like I said earlier, a kind of a traditionalist movement that didn't want to lose that traditional Western Christian understanding of the relationship of the microcosm to the macrocosm, about God's presence in the world, about the presence of angels and demons in the world. Right. Is contributing to even weather patterns. Right. Which was all thrown out the window with Rene Descartes. And they were. In fact, they would rip on Descartes in their books. They didn't like him at all."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":1871.69,"end":1875.21,"speaker":"Jonathan Pageau","text":"Didn't Descartes write a public letter trying to be initiated into the Rose?"}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":1875.21,"end":1928.55,"speaker":"Michael Martin","text":"Yes, he did. Yes, he did. Turned him down. Good choice. Yeah. I would have turned him down, too. I'm not answering that call. But it's funny because you read that. And so when I think of Rosicrucianism, I automatically think of that stuff. Yeah. Which is. When you read it, you can't see how anybody could interpret it otherwise. But then you look at the Crowley stuff and the golden dawn, and that came much later, and as we said earlier, these appropriations of the term. In fact, even the idea of the rose cross there. And I think it's a good argument that the rose cross comes from the coat of arms of Martin Luther, which had a cross and a rose on it. So who could be. Some people think the RC means Roman Catholic. There was a lot of discussion in the 17th century about whether this is actually the Jesuits trying to get Protestants to come back into the fold."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":1930.74,"end":1932.1,"speaker":"Jonathan Pageau","text":"You know, it's always the Jesuits. Right."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":1932.5,"end":1941.86,"speaker":"Michael Martin","text":"We're smarter than everybody, but. Yeah. So how does it get from there to what it became in the 19th century? It's just. Or even the 18th century. It's so strange."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":1942.34,"end":2000.36,"speaker":"Jonathan Pageau","text":"But I think it's. I think we really have to understand it as this decarnation. It's like we often think of something which becomes decadent as always going too low, but it actually always starts with going too high. It's like there's pride. Pride is the first sin. And so there's something about trying. And you can see it, like in the very rituals of the early occultists and, you know, the. The early magicians and the demonologists. There's something very powerful pride in that. The very idea of, let's say, weaponizing or capturing these spiritual entities and inquiring from them or using them to manifest their will, it's like that is some. That is definitely something which I think represents that pride, which then maybe you all do it for the good reasons at the beginning. Right. It's like, you know, we're going to do this to help the world. We're going to capture these demons in order to. In order to understand them and then exercise them from society. It's like that leads very quickly, in my opinion, to something."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2000.36,"end":2014.43,"speaker":"Michael Martin","text":"Absolutely. I agree. I totally agree. And that's what I think. Well, like, in fact, in my dissertation, the first chapter is on John Dee, who was doing that. Precisely. And who got played like a game of Yahtzee By. By the spirit."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2014.75,"end":2015.47,"speaker":"Jonathan Pageau","text":"Yeah, by these."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2016.67,"end":2021.87,"speaker":"Michael Martin","text":"They worked him and they. And he. The thing is, he was. He was a good man, I think."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2022.19,"end":2022.59,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2022.59,"end":2049.28,"speaker":"Michael Martin","text":"You know, he was. He's a guy who loved his family, loved his country, was, you know, doing all the right stuff. But as you said, his problem was his pride. You know, I am the one who will bring this to the world. And he thought that he was going to recover the language of Adam and that would heal all the divisions in Christendom, you know. Wrong. Yeah, exactly. And of course, the spirits talk, him and his assistant to swapping their wives. Right."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2049.28,"end":2049.48,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2049.48,"end":2053.72,"speaker":"Michael Martin","text":"Yeah. Which is. You don't get any more mortal sin than that. Right."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2054.52,"end":2056.52,"speaker":"Jonathan Pageau","text":"It doesn't. It doesn't get better after that."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2056.52,"end":2058.44,"speaker":"Michael Martin","text":"Let's just do them all. Yeah, let's just get all this."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2058.44,"end":2059.74,"speaker":"Jonathan Pageau","text":"And it doesn't get better after the."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2059.89,"end":2060.05,"speaker":"Michael Martin","text":"That."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2060.05,"end":2060.61,"speaker":"Jonathan Pageau","text":"It's like."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2061.09,"end":2122.99,"speaker":"Michael Martin","text":"But. But I think. But on the other hand, you look at Henry Vaughn and his. And his brother, and there's a. I mean, especially in Henry, there's such a beautiful practical spirituality in his poetry that's both connected to nature and to God and to Scripture. I mean, it's. I remember when I. When I. So doing a dissertation, you have to read everything the person wrote. So I was reading all this guy wrote and I'm done with. Oh, yeah. This is basically what I am. This is what I am. This is my spirituality right here, which is very simple. It's not complicated and it's not occult in the least, but it's very mystical, I would say, in. In a. In a practical, mystical way. You know, just not, you know, not a pro, hopefully not a prideful one. But you know what's important? God, his creation and community. Right. The church, we call the community of the church. And that, I think, from, you know, if you focus on what's important, then. Then, you know, then you protect yourself, hopefully, from a little bit of evil."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2123.15,"end":2176.65,"speaker":"Jonathan Pageau","text":"Yeah, well, definitely. I think. I mean, I think that that's also. So I don't know if you've noticed, like, there's an interesting moment right now. It's just interesting because it seems like something got broken, I guess, in the past 10 years. I don't know how to say it. Something broke. And all of a sudden, secular atheists and secular people are now able to perceive principalities and they're able to understand at least what it is that we're even talking about when we use the word angel. So it's an interesting moment, but it's also, in some ways a very dangerous moment. And that's something that I sometimes don't emphasize enough, especially with the psychedelics. That is, people taking psychedelics and they indiscriminately encounter beings, and then they're all excited about whatever it is that they encounter. And so I don't know if you've noticed that. It seems like there's a. We're at a. At a. Like a moment where magic seems to be seeping back into the world, but it's not all positive."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2176.65,"end":2187.61,"speaker":"Michael Martin","text":"Like, it's amazing, which is weird because that's seeping in while at the same time where everything's becoming disenchanted through the Internet. Right. So there's this weird polarity going on. Right."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2188.09,"end":2257,"speaker":"Jonathan Pageau","text":"It's almost as if a natural movement of moving so far into darkness that all of a sudden these small lights start to be visible and people start to see. Also because we're noticing. I think one of the things that's doing it is actually the Internet, because the Internet is based on attention, and it's actually bringing to the fore the function of attention in the way the world lays itself out. And so it's like there's not much more. That's what magic is. Magic is about that. And so if you understand that. And now people have that experience where they're noticing how everything is vying for their attention. And that attention is actually creating bodies of interest and is actually kind of transforming reality. And because it's accelerated online, right. It's usually these cycles of interest are long and they don't last, like two days or one week or sometimes one day. This idea of something trending. And so I think that there's something about that which is making people notice something like the vertical causality that Tomberg talks about that is that there's a relationship between. Yeah. That there's race between, like, common attention and then things manifesting themselves, I'd say."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2257,"end":2260.16,"speaker":"Michael Martin","text":"Yeah. Egregore. Yeah."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2260.16,"end":2290.64,"speaker":"Jonathan Pageau","text":"Well, yeah, that's what a lot of us are trying to, like, Talk about and try to help people differentiate the different. But I'm even. Even as I'm doing that, I'm worried because I meet people that are all excited. They're like. Like, you talk about these angels. I want to meet them. Like, what? No, no, it's not what. That's not why we're doing this. Like, we're doing this so that people can see through, let's say, at least understand this. This hierarchy of principality. So they can see incarnationally. But it's not about, like, having it try to have encounters with angels. It's usually not. The good angels. They don't want to talk to you that way."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2290.72,"end":2331.85,"speaker":"Michael Martin","text":"That's right. I always tell people, way back in the day, my students would say, I'm going to. Mr. Martin, I'm going to use the Ouija board. Like, no, no, no, no. Why? Because it's like dialing seven numbers and saying, can I talk to Jesus? And the demon says, he thinks it's Jesus. Jesus speaking. You know what I mean? You're asking for trouble because they're smarter than you and they're. And they'll, like. With John Dee, they'll play you like a game of Yahtzee. You know what I mean? They'll just ridicule you. Tottenberg actually talks about that. How they lead people along. Yeah. You're special. Come on. And we'll give you all this information, which is all just ends up being gobbledygook. Yeah."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2331.85,"end":2346.09,"speaker":"Jonathan Pageau","text":"And you see it like, you. If you've known. Like, I usually see it a lot in the people that I around me that are interested in kind of New Age stuff and get sucked into that. Then they all have their weird guardian angels and their weird guides and stuff, and it's usually never ends well. Like, it just never doesn't go well."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2346.41,"end":2347.21,"speaker":"Michael Martin","text":"Never ever."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2348.49,"end":2353.13,"speaker":"Jonathan Pageau","text":"Oh, man. So, Nate, so what is it that you wanted us to talk about besides the thing we talked about already?"}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2353.85,"end":2355.45,"speaker":"Nate","text":"You guys seem to have no problem."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2356.6,"end":2360.44,"speaker":"Jonathan Pageau","text":"There's things that you're curious about because I. Because I also wanted this to be."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2361,"end":2374.76,"speaker":"Nate","text":"There's one. One thing you said early on. I just. It's interesting the way Tomberg actually approaches the subject of reincarnation. Because he just says, either you've experienced it or you haven't. And he doesn't argue. He doesn't. He doesn't argue for it. In fact, he argues."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2374.84,"end":2375.64,"speaker":"Jonathan Pageau","text":"He can't argue."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2375.72,"end":2433.2,"speaker":"Nate","text":"Right, exactly. And he doesn't. And he doesn't make any argument for it being a meaningful part of a spiritual system of any kind. It's just kind of like. And then he drops it after that. So the way he presents it as weird. So I wonder what you thought of that. And then in letters, I don't. I don't know if you got into letter six yet. But this idea of. Of evolution being like, on the horizontal plane under the guise of the serpent, that was very interesting to me because I can remember when I. I was raised Pentecostal and I can remember when I was going through my catechism, when I was converting to category Catholicism, I still, like, had some misgivings about evolution. And I thought. And I made argument to my priest about how you really can't. If evolution is absolutely true without any qualification, there's no resolution to the problem of evil possible because you can't really. There's no way of dealing with the physical evil. Yeah. So I thought the way that Tomberg talks about evolution as being this groping trial of the serpent offers a way to do that."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2433.53,"end":2456.97,"speaker":"Jonathan Pageau","text":"I tend to like the way that I. I presented before and the way I present it now is that I think natural selection is. Is a pattern in the world. It's a true pattern, and it's a pattern that can help you understand things. But I think the narrative evolution is just useless and not interesting. And, and it doesn't help you do anything. Like it's a. It always ends up having to be represented mythologically, despite the scientists pretending that it's not."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2458.49,"end":2473.92,"speaker":"Nate","text":"Says too, though, because he says. He says it's a fact. Right. So it's a fact on the horizontal plane. It's a fact, but it's a fact only. It's a fact only on the horizontal plane. And that because it's on the horizontal plane, its origin is the serpent."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2474.16,"end":2532.25,"speaker":"Michael Martin","text":"But, you know, I think part, you know, Tomberg was a man of his. Of his time, and that was the language. That was the language of evolution was. Which was appropriated by Blavatsky and the early Steiner also picked up on it. And they were speaking in these kinds of terms. Now it's spiritual evolution, Right? Now, my friend Guido Preparata, he's a blunt and funny guy, and he thinks Darwin's whole project was just a project to prove British imperialism. It was social Darwinism, what we call Social Darwinism now. Yeah. That's what it is. Their survival of the fittest. The British are the fittest. End of story. Right. So I don't buy. I mean, personally, I don't know what to think of the evolution narrative. I mean, I'm sure things do. I'm a farmer, I know how things work. But of course we have a society that believes in evolution but doesn't believe in gender. I can't figure it out."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2534.17,"end":2591.67,"speaker":"Jonathan Pageau","text":"It's also the thing, the whole evolution narrative is the most. It's just so hilarious because the evolution narrative has to be. Ends up being teleological. They can't avoid it. Every time they try to make it non teleological, they fail. And so it always ends up having to be teleological. And so then it becomes non scientific immediately. It just becomes a kind of a mythological pattern. It's like, well, if it's, it's mythological story, my mythological story is much better. Like the creation narrative in Genesis accounts way in a better manner for the ontological hierarchy of your experience of the world than the way that evolution talks about reality. And it's. And you can see like, I mean, when I talked about Weinstein, it's always the same issue. And you, you see the same with all the evolutionary theorists. They're basically saying what evolutionary want, evolution really wants you to do is to basically kill and compete and take and just get your seed out there, get your genes to the next generation. But of course, we shouldn't do that."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2591.75,"end":2592.07,"speaker":"Michael Martin","text":"Right?"}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2592.07,"end":2606.74,"speaker":"Jonathan Pageau","text":"It's like, okay, well where do you get the we shouldn't do that from? Yeah, that's actually what interests me because that's a lot closer to what I care about. And then maybe you can find that in the Genesis story, but the other, you can't find it anywhere else in your little pattern, like in your little worldview."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2606.82,"end":2626.47,"speaker":"Michael Martin","text":"Well, you know, who believes in the evolution story? The World Economic Forum, and guess who's at the top of that food chain. But you know, it's interesting because you think about, you mentioned Genesis. Genesis is the opposite of the evolution. It's the fall. Yeah, right. It goes in the opposite direction. Yeah."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2626.47,"end":2682.47,"speaker":"Jonathan Pageau","text":"I mean, and you're right. But you can, you can understand it's. It's so much closer to, even to the way that evolutionists think of their teleological project because there is a hierarchy of being. If you read St. Ephraim, it's, it's beautiful. Like St. Ephraim says that he says things like the animals did not come into the garden. Right. And so the animals were, would come to the foot of the garden. Then Adam would come down the mountain and he would like encounter them and that's when he named them and everything. So there's this sense in which like the type of ontological hierarchy that they tried to create in their evolutionary system. It's there in the more traditional narrative. And it's more. It actually accounts for morality and responsibility and all this stuff that we actually think even now, even all these weird environmentalists, like, super environmentalists, they believe in what Genesis says. Like, they believe that we're the gardeners and we should take care of creation and that we shouldn't abuse it. And it's like, if you're really just an evolutionist, I don't know, you could really believe any of those things."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2682.79,"end":2688.87,"speaker":"Michael Martin","text":"Well, that's what happened with. And I think that explains Tomberg's attraction for Teilhard de Chardin. Right."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2689.27,"end":2689.71,"speaker":"Nate","text":"Yeah."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2689.71,"end":2693.43,"speaker":"Michael Martin","text":"Because that's evolution taken into Catholic theology."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2693.83,"end":2699.63,"speaker":"Jonathan Pageau","text":"Yeah, I haven't gotten there. And so maybe I'll definitely have my beef with him when he gets to Teya Deschande. I don't know yet."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2699.63,"end":2705.87,"speaker":"Michael Martin","text":"Well, I don't know if you read Teilhard. I mean, he's a beautiful writer. He really. He writes like a poet."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2705.95,"end":2706.51,"speaker":"Nate","text":"Yeah."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2706.59,"end":2723.79,"speaker":"Michael Martin","text":"And it's beautiful writing, and he has a lot of brilliant insights. I think the complete project. I don't have to believe. Agree with. With people about everything that they'd say, you're right. I like them. I'm just. I'm just. I'm cool with the parts I like, you know, I don't have to be all in."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2724.27,"end":2734.24,"speaker":"Jonathan Pageau","text":"Yeah, no, I totally agree with that. I totally agree with that. That's how I approach pretty much everything. I don't. It's like, I don't have to defend everything that this person that I. Yeah. You know, slightly associated with."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2735.28,"end":2745.36,"speaker":"Michael Martin","text":"I don't agree with everything my wife says, you know. Well, what about some guy I never met? Right. You're gonna tag me with everything he ever thought or believed."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2745.44,"end":2746.32,"speaker":"Jonathan Pageau","text":"Yeah, definitely."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2746.32,"end":2748.56,"speaker":"Michael Martin","text":"Definitely. Don't tell her that."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2751.04,"end":2752.72,"speaker":"Jonathan Pageau","text":"I'm sure she knows. I'm sure she knows."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2753.04,"end":2753.68,"speaker":"Michael Martin","text":"She knows."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2753.92,"end":2754.56,"speaker":"Jonathan Pageau","text":"She says."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2754.56,"end":2755.04,"speaker":"Michael Martin","text":"Yeah."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2755.68,"end":2784.3,"speaker":"Jonathan Pageau","text":"And so, I mean, like, for me, I think that the ultimately, for me, the solution that I've been trying to propose has really been taking the traditional forms that are there, taking the liturgical life that has all the potential, like you said, even if it's lost its. If it's lost its salt, it's there. It just has to be kind of recaptured and relived. And so to me, that seems like the only really realistic solution. And in it."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2784.45,"end":2810.13,"speaker":"Michael Martin","text":"Well, one of the things that Florensky mentioned in there, which kind of added savor to it, was those kinds of Folk traditions. Yeah. You know, that are they really Christian? Are they kind of Christian? But yeah, let's keep those in there because those, those make Christianity a way of life and not something you do on Sunday. Right. And try to think, you know, I say a couple prayers during the day, but how do you incorporate that into a lived life? Right."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2810.28,"end":2879.35,"speaker":"Jonathan Pageau","text":"Yeah, definitely. Because we. People tend to think modern people tend to think more monastically. It's like they think that, you know, living a more kind of embodied Christian life would mean to just have, you know, do the hours or whatever, do more, more services. But I think you're right that there's a, there's a more, there's an even more embodied way, which is if you think of the Middle Ages and they had all these associations and clubs and people would, you know, be in the association of this saint and they would have their costumes and they would have all this stuff and they would have, you know, like all these banners and processions and stuff. It's hard for us to even imagine it, but I know it's still with my friend Andrew Gould. I remember he said he went to this little village in Spain and, and he said it was just astounding. They had these four hour, five hour processions of their statue of the, of the Mother of God, you know, all dressed up and, and everybody had these like, particular costumes and they would just kind of walk around and, and, and every. And he said he was so solemn and it lasted forever, but everybody was just, just completely enthralled by these processions. And so. Yeah, it's just hard because we don't. In North America, it always feels like we're. But it's always feels like we lost like so much of it that to bring it back is almost idiosyncratic."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2879.35,"end":2879.71,"speaker":"Michael Martin","text":"Yeah."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2879.71,"end":2902.97,"speaker":"Jonathan Pageau","text":"I mean, and I say that for the Orthodox very much. It's like, it's like people become Orthodox and they think they'll immediately become Russian or it's like that's not going to happen. Right. You have to find some kind of discussion about how to embody folk traditions. Right. So let's say for us on theophany, like, we'll still do like the traditional French epiphany celebration. Right? We have a cake and we bake."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2902.97,"end":2904.25,"speaker":"Michael Martin","text":"A bean in it. Yeah, we do it too."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2904.25,"end":2910.89,"speaker":"Jonathan Pageau","text":"And we have like the king of the day and stuff. And so like, this is not Orthodox, but it's, it's like these are the traditions that we have."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2910.97,"end":2912.09,"speaker":"Michael Martin","text":"But it's French Canadian."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2912.09,"end":2914.17,"speaker":"Jonathan Pageau","text":"Yeah, yeah, it's definitely French Canadian, that's for sure."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2914.17,"end":2914.85,"speaker":"Michael Martin","text":"Yeah, we do it."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2914.85,"end":2921.71,"speaker":"Jonathan Pageau","text":"We need to like, find ways to connect all this in a way that is. That it's going to be messy and organic. But it was so already in the."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2921.71,"end":2929.91,"speaker":"Nate","text":"Folk, isn't that kind of already the norm? Orthodoxy, though, it's a kind of like morph itself somewhat to the culture that. That it's expressed in."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2929.91,"end":2933.03,"speaker":"Jonathan Pageau","text":"It should. Hopefully the Greeks have a lot of."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2933.27,"end":2989.27,"speaker":"Michael Martin","text":"You know, the other thing like, like the. The bean cake and, you know, all that stuff. I also think that's a way to. To have children. This is a way to raise children in a lived experience of Christianity, you know, because they're not gonna. We all remember being in church as little kids listening to a sermon. I mean, not listening to a sermon and wondering how long is this gonna take. Right. But those festivals of conviviality make it for children and for growing people too, a lived experience. And then when people have children, they want. They want that they. You can. People hunger for that. They want an experience of the world that is not only spiritually nourishing, but that nourishes their souls and their relationship with other people. Because you can do it by yourself. Right. There's something different when you do in a community. Yeah. Which is what a church is supposed to be."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":2989.59,"end":3023.07,"speaker":"Jonathan Pageau","text":"And I think so. I think that's why, I mean, I've noticed a lot of, at least Orthodox churches take it seriously, is to realize how the coffee hour in terms of a modern church is absolutely essential. That you actually, you really need to have one or two hours after liturgy or after a service for people to be together. Because we're not in a village anymore. You don't just walk out and then go back to your house and then it's your neighbor that was there in church with you. So we have to create these spaces where we. We can have, you know, a more informal communion. Or else it's just gonna. It's not going to. It's not gonna. It's not gonna."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3023.47,"end":3026.07,"speaker":"Michael Martin","text":"Otherwise it's like punching a clock. Yeah. Okay."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3026.07,"end":3026.35,"speaker":"Nate","text":"Yeah."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3026.35,"end":3028.55,"speaker":"Jonathan Pageau","text":"Going to liturgy. Go communion. Go back home."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3028.55,"end":3028.99,"speaker":"Michael Martin","text":"Okay."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3030.19,"end":3031.79,"speaker":"Nate","text":"Bad coffee is important. Check."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3032.75,"end":3060.52,"speaker":"Jonathan Pageau","text":"But we really noticed, like, we've noticed that at least in my parish, it's been. It's been one of the. Because we are seeing our parents grow quite a bit in the last year. I think a lot of. A lot of parishes are growing because of post Covid people looking for meaning and stuff. And we've noticed that that's been one of the keys has been to have like a place and a time afterwards for people to Sit down. And to connect. And so then it encourages them to call each other during the week and to. To connect in other informal ways."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3060.52,"end":3060.88,"speaker":"Michael Martin","text":"So."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3061.2,"end":3070.4,"speaker":"Jonathan Pageau","text":"Yeah, so you're right. So we need these more embodied. More embodied practices, because liturgy is wonderful, but it has to kind of seep into all of reality."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3070.4,"end":3072.8,"speaker":"Michael Martin","text":"It can't just be. It's got to be everywhere. Yeah."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3073.52,"end":3079.44,"speaker":"Nate","text":"So, I mean, how does that play into. I know. Michael, you've expressed some disappointment with the way that the church handled Covid."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3079.92,"end":3080.48,"speaker":"Michael Martin","text":"I have."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3081.52,"end":3088.14,"speaker":"Nate","text":"I mean, it seems to me that what you guys are talking about right now and the way the church. The churches kind of handled Covid, they're not."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3088.14,"end":3127.17,"speaker":"Jonathan Pageau","text":"I think. I honestly think, like, seriously think that Covid was a litmus test for a lot of churches. And I think that a lot of the churches that didn't. That weren't attentive to what was happening and didn't take into account the primacy of communion, I think a lot of them won't get over this. I really believe that they just won't survive. And I think the opposite is also true. The churches that, you know, were. A lot of them were cautious at the outset, like, you know, obviously, and then slowly started to realize that, okay, wait a minute, there's something else going on, and then started to. To emphasize communion over being strict on the rules and everything. I think those will thrive. And they have thrived."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3127.41,"end":3166.13,"speaker":"Michael Martin","text":"Well, yeah. When. And I just. It was so. For me, it was so profoundly discouraging to see so many, especially in the Catholic Church, when the Pope required all employees of the Vatican to have the vaccination. Like, okay, and now they backed off. They never apologize. When they back off, it's like, oh, yeah, well, we were. You know, it just. It's. It becomes they're slaves to policy. And. And. And if you probably saw, too, there were many churches across North America and Australia, places who would have signs saying fully vaccinated parishioners may come to confession or to communion. Right."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3166.21,"end":3177.01,"speaker":"Jonathan Pageau","text":"Imagine that. I don't know if, you know what happened here in Quebec. Like, it was crazy, because. So we. We had. The church were closed for the longest time, right? And then finally they were open with limited people, whatever, blah, blah, blah, and."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3177.01,"end":3177.89,"speaker":"Michael Martin","text":"All this stuff, right?"}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3177.89,"end":3206.93,"speaker":"Jonathan Pageau","text":"But then came the moment when they were gonna. They were gonna impose the COVID vaccine passport on the churches. That was. To me, that was. I think, with the litmus test and those churches that tried to find solutions to that and not imp. Not impose it, because you would have to have a parishioner standing at the door with their phone, scanning people as they walked into the church. Can you imagine how crazy that is? And so it's like, I think that the doors."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3206.93,"end":3218.01,"speaker":"Michael Martin","text":"The doors. Right. Let us see. That's what that was for. Right. When they say the doors. The doors. It was to keep the, you know, the spies out. Look at the. So they'll come in here and kill us after we say the creed."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3218.54,"end":3253.33,"speaker":"Jonathan Pageau","text":"Yeah, exactly. And so. So I think that I've seen like, the church. Some churches did crazy stuff. Like, they had. It was minus 30. Right. It was like right in the. It was like in December, in January. So some churches just had services outside. You know, people found ways to. To get around it or whatever. But I think the church is. That applied it. There's not a lot of hope for those guys, I'm sorry to say. I mean, maybe they'll survive, like, but I don't think. I think it's going to be a serious. They're going to have to do it with a lot of like, repentance and return and deliberate desire to re. Enter communion because."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3253.33,"end":3257.85,"speaker":"Michael Martin","text":"Yeah. Well. And I think we'll also see a kind of church of the catacombs."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3258.09,"end":3258.89,"speaker":"Jonathan Pageau","text":"Yeah, for sure."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3259.13,"end":3264.97,"speaker":"Michael Martin","text":"You know, kind of a guerrilla church or underground church or something, you know."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3264.97,"end":3276.14,"speaker":"Jonathan Pageau","text":"Yeah. And people love to learn to do. Like, we started to learn to do the reader services, you know, because it's like if we depend on the clergy completely, then we're."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3276.38,"end":3276.78,"speaker":"Nate","text":"We're."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3276.78,"end":3277.66,"speaker":"Jonathan Pageau","text":"We're going to be in trouble."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3278.3,"end":3280.58,"speaker":"Michael Martin","text":"That was. I was up. I don't know how well you brought."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3280.58,"end":3289.58,"speaker":"Nate","text":"Up solo view of several times, Michael. And I can't help but think of tale of the Antichrist. It's not the. It's. The majority of the church goes along."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3289.74,"end":3290.06,"speaker":"Michael Martin","text":"Yeah."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3290.06,"end":3306.32,"speaker":"Nate","text":"With the Antichrist in that story. It's just like the three figures that he has representing the, you know, the Protestant, the Cat, the Catholic and the Orthodox tradition. They're the ones with the courage to stand up. But the vast majority of the clergy in all three go along."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3306.64,"end":3308.08,"speaker":"Michael Martin","text":"Yep. They join the Antichrist."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3308.48,"end":3337.96,"speaker":"Jonathan Pageau","text":"Well, it's not hard to. It's not hard to see it now. Like, it's. There's. There's something wonderful about the moment right now, which is that there's a lot of stuff. There's a lot of, let's say, apocalyptic thinking that I didn't totally understand, let's say 20 years ago. And I'm not saying that this is it, like this is the end of the world or whatever, but I think that there's a Lot of. There's a lot of structure that I can now see. And not only do I understand them, but I can see them burgeoning and kind of see them popping up in the world. And it's like, okay, I understand what it's talking about."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3338.04,"end":3340.96,"speaker":"Michael Martin","text":"Well, it's a revelation. Yeah. Apocalypse in that sense."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3340.96,"end":3341.28,"speaker":"Jonathan Pageau","text":"It's."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3341.28,"end":3345.4,"speaker":"Michael Martin","text":"It's taking. It's tearing the veil open so you can see what's going on."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3345.8,"end":3376.93,"speaker":"Jonathan Pageau","text":"Like, the idea of Antichrist itself, like the idea of something which is a parasite on Christian morality but manifest itself. So it's like. Right. The idea, for example, that we saw, like, the weaponizing of compassion that we saw during the COVID time, it's like, that was like a weird parasite on Christianity. So you can kind of see, like, okay, I can kind of. I mean, I'm not saying this is Antichrist, but I can kind of see the pattern of Antichrist, how it can manifest itself and how it can also delude people, how it can trick people into believing this is true Christianity."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3377.01,"end":3379.1,"speaker":"Michael Martin","text":"And tricking is the right word, right? Yeah."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3379.18,"end":3418.95,"speaker":"Jonathan Pageau","text":"And you can see, like, it's. You can see, like, with. Even with, like, the. Who would have thought that? So, for example, like, it's like in the abortion debate. I'm sorry to become political here, but, like, who would have thought that there would be a common moment when someone would be able to say out loud, publicly, a Christian should be pro abortion. It is the Christian position to have. This is the compassionate Christian position to have the pro abortion. It's like. And you see now people take that position all the time. It's like, really? It's like, who would have thought? But then you can see it. It's a weaponizing of compassion and a weaponizing of the idea that we're in the image of God. Like, all of these Christian ideas are being twisted and contorted to bring about these strange positions."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3419.03,"end":3425.19,"speaker":"Michael Martin","text":"Yeah, that's all. Yeah. Okay, guys, I'm depressed now. That's right."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3429.75,"end":3496.92,"speaker":"Jonathan Pageau","text":"But I think, like, I did, like, I'm a 5050 all the time. Like, this is why I think how I survived kind of 50, 50 all the time. Because on the one hand, I can kind of see. I, like, all of a sudden I see these patterns that are straight up from the book of Revelation kind of come. Come towards me. And at the same time, I'm also seeing the. The candle, like, being lit. I can see, like, the next. I don't know what to say. Like, I can get a glimmer of the Resurrection. It's maybe there's another way to say it. I can see it. Like, I can actually see it and I can notice, you know, I had this talk with someone like Ian McGilchrist that I think I put up today. I had a talk with Don Hoffman. All these, like, cognitive science type people that are total seculars, or even my discussion with John Vervaeke, John Revaeke and them were using the word angel and demon as if this was a totally normal technical word to use to talk about transpirational beings. And I was like, I can't believe that we're. That we've reached this point where a scientist would use that word and not flinch or not feel embarrassed at all about using it. So I think we're going to be surprised. Like there's going to be some wonderful surprises and some dark surprises at the same time."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3497.16,"end":3586.63,"speaker":"Michael Martin","text":"Well, I think so too. And that's, you know, and I kind of saw it coming and wrote about it, you know, because I think, you know, like you're saying that we had the rise of the technocracy or the archons, if you want to call them that. But, you know, there is also, you know, the real possibility to live the kingdom, you know, that the kingdom of heaven is within you. So there's a capacity to realize that. And I think, and if you go back to the early Christians, there were parallel societies there too. Parallel. Polis is right. There was the power structure and there was the kingdom. And I don't think we've had enough awareness of the kingdom for the past couple few generations, you know. And I think part of what I think happened, if you read World War II or post World War II literature, when all the intellectuals were like, what the heck? Just what happened? You know what I mean? They're soul searching. And I think that really destroyed a lot of people as far as religion goes, not just Christianity, you know, that the Holocaust could happen and you could have that much evil and God didn't intervene. Right. And I think we have it at a different, different manifestation of that kind of evil right now. But maybe in a way, this is our opportunity to not despair as happened to those people in the 1940s and 50s. Right. Are they despaired and it's. And it's really easy to despair. Right."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3586.95,"end":3614.79,"speaker":"Nate","text":"Well, from listening to my wife, I would say that like the, the Jewish experience in that post Holocaust is almost like the opposite, though. Like, there was a lot of, like a lot of Jews who weren't really even religious. Like, they returned to Judaism not even out of any real religious Commitment, but just out of the idea that there should be more Jews in the world. Because, like, both her parents, like, were basically atheists, but they made sure that their children were raised with the knowledge of their faith and practiced anyway."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3615.27,"end":3658.7,"speaker":"Jonathan Pageau","text":"Yeah, I mean, I think for sure, like the rise of the Hasidim is based in part in World War II, and, and the return of kind of Orthodox Judaism or the strength of Orthodox Judaism does seem to be. But I think it's not like, I think it's the two extremes, you could say, because also, I mean, the secular Jew is extremely powerful in the world right now as well. Like, you have a lot of that very strong. So I think we're probably going to see something similar in the Christian church. We're going to see a kind of remnant which will consolidate and become, you know, deliberate and authentic. And at the same time, we're going to see the world in general become more and more anti Christian and secular."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3658.86,"end":3660.22,"speaker":"Michael Martin","text":"So I think so."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3660.3,"end":3712,"speaker":"Jonathan Pageau","text":"I mean, especially as the churches, like here in Quebec, like the churches are. At some point they're going to start to demolish the churches, like they have to, because they're trying to send these things out, like they're trying to sell them. But it's like all these old buildings, no one wants to keep up. And so at some point we're going to start to see bulldozers, like, go into these things. It's going to be inevitable. You see it in Europe happening now all the time. And so, and so I think that that'll have, that'll be important. Like, I think it's. It's probably good that that happens because it's going to help people see what's going on in ways that might both increase the secularism but also shock some people into thinking, okay, so what, what is it then? It's like, is it more shopping malls? Is that what we really need? Or is it taller cell towers? Is that, is that going to be like our. That going to be our holy place? Is it going to be really, really tall cell towers? Sorry, Michael, I feel like I'm really not."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3712,"end":3726.84,"speaker":"Michael Martin","text":"Oh, no, no, no. You're not bumming me out. No, no, I agree. And I'm just. In fact, you know, my gosh, my whole project is pretty. It's a pretty hopeful project. Right, but, but knowing you're up against this kind of darkness."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3727.16,"end":3727.72,"speaker":"Nate","text":"Yeah."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3728.12,"end":3742.6,"speaker":"Michael Martin","text":"Which is what surprised me over the last couple years is how effective the mass formation and propaganda project of the bad guys has been. I mean, you got to tip your hat. It was well orchestrated. Yep. That you could."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3742.6,"end":3745.28,"speaker":"Jonathan Pageau","text":"But it's a. But it's, it's. It's amazing. Like here in Canada."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3745.28,"end":3745.92,"speaker":"Michael Martin","text":"It's amazing."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3745.92,"end":3753.24,"speaker":"Jonathan Pageau","text":"Like, it's amazing. I mean, Justin. Justin, you know, is just obviously like a empty, like puppet."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3753.32,"end":3753.76,"speaker":"Michael Martin","text":"Yeah."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3753.76,"end":3758.12,"speaker":"Jonathan Pageau","text":"But it doesn't matter. Like it just doesn't matter. It all, it all works like it all."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3758.28,"end":3760.44,"speaker":"Michael Martin","text":"The whole world is like that right now. The whole West."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3760.93,"end":3771.89,"speaker":"Nate","text":"Well, it's amazing how many sophisticated people show for it. I mean, just fall for it though. I mean, it's really. It's mind boggling. It kind of proves a rule's idea that elites are more prone to propaganda."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3772.69,"end":3790.39,"speaker":"Michael Martin","text":"Oh, yeah, well, no, propaganda is never aimed at, you know, people with a high school education. They always aim propaganda at the middle managers, the teachers, professors, doctors, and people like that who think they're smart. You're smart because you believe. Yes, I'm smart. And I'm doing this to help others."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3791.35,"end":3794.31,"speaker":"Nate","text":"So you're saying it's designed specifically for dumb smart people."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3794.39,"end":3798.39,"speaker":"Jonathan Pageau","text":"Yeah, the midwits. The midwits, they're the problem. They're always a problem."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3799.75,"end":3800.23,"speaker":"Michael Martin","text":"Yeah."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3800.71,"end":3803.43,"speaker":"Nate","text":"Wow. Well, it was really great getting to listen to you guys talk."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3803.51,"end":3806.23,"speaker":"Michael Martin","text":"I'm glad. I'm glad I brought you to have this conversation."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3806.55,"end":3810.55,"speaker":"Nate","text":"Yeah. So you got me to be quiet for the most part, which is not an easy task."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3811.75,"end":3815.94,"speaker":"Michael Martin","text":"It was our plan. We talked ahead of time. Yeah. Well, good."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3816.18,"end":3817.38,"speaker":"Nate","text":"Excellent collusion then."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3817.54,"end":3818.98,"speaker":"Jonathan Pageau","text":"Oh, well, thanks for the conversation."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3819.46,"end":3826.58,"speaker":"Nate","text":"Yeah, thanks for. Thanks for joining me today. I really appreciate the gift of your time. Both of you appreciate this. I'll let you know when I get it posted."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3826.58,"end":3827.46,"speaker":"Michael Martin","text":"All right, great."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3827.46,"end":3827.94,"speaker":"Nate","text":"Wonderful."}
{"episode_id":"SW - #247 - 2022-08-10 - Michael Martin and Nate Hile - Esoteric Christianity","start":3828.82,"end":3890.83,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to, to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially. Going to www.thesymbolicworld.com support or else on Patreon, the Pageau videos as well and on SubscribeStar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
