{"episode_id":"SW - #121 - 2020-10-22 - The Meaning of Prince Ivan and The Gray Wolf","start":0.48,"end":3352.87,"speaker":"Jonathan Pageau","text":"So the story of Prince Ivan and the Gray Wolf is one of the most famous Russian fairy tales around. And just recently, actually just yesterday, Deacon Nicholas Kotar, who many of you have seen on my channel, he's the author of the Raven Son series. He's also been a pretty enthusiastic participant in the Symbolic World blog. Actually, his articles have gotten more views than my article. And so Deacon Nicholas has just started a new podcast called In a Certain Kingdom. And his podcast is going to be looking at different Russian fairy tales, giving a retelling of the fairy tales and then giving some analysis as well. His retellings are very beautiful and succinct. They keep the flavor of the Russian fairy tales with a certain literary tropes that are used that are almost like liturgical in the way that they're used. So I'm pretty excited about it. His first episode was a retelling of Ivan and the Gray Wolf. So myself, I thought it would be a good opportunity to celebrate this new podcast to give my own interpretation of that fairy tale, which, of course is one that I loved for a very long time. This is Jonathan Peugeot. Welcome to the Symbolic World. So in order to give you my interpretation, I'm of course going to give you a summary of the fairy tale, kind of give you the basic elements. Of course, my retelling is going to be just bare bones and has nothing to do with the retelling that Deacon Nicholas gives in his podcast. The. His retelling is beautiful. There's also some compositions that were written, and so there's music in the background. It's very. It's very, very well done, very professional. I once again suggest you check it out. So here are the basic elements of Prince Ivan and the Gray wolf. And so the king has a tree which produces golden apples. And then the king realizes that there's something which is stealing his golden apples at night. There are different versions. Sometimes it is seen that the guards have noticed this firebird which escapes the garden at night. And so the king asks his sons if they would be willing to try to catch the thief of these golden apples. Of course, the king has three sons. His two older sons and the youngest, who is Ivan. So the two oldest agree, and the king doesn't want the youngest to get involved. This will continue on through the fairy tale. So the first son goes in at night and tries to wait for the thief, but he falls asleep and he doesn't catch the firebird. The second son, of course, does the same, falls asleep, can't catch the firebird. So Prince Ivan begs his father, and his father agrees. So Prince Ivan goes in and. And he fights to stay awake, is successful at staying awake, and then sees the firebird come to steal the golden apple. And so Prince Ivan tries to catch it, but he's only able to grab a tail feather of the bird as the bird flies away. So this is successful in chasing the firebird away. The firebird doesn't come to get the apples anymore, but the king regrets the firebird. When he sees the beautiful tail feather of the bird, he regrets it and wants to catch it. And so he tells his sons that whoever catches this firebird will be his inheritor and will also get half the kingdom. So, of course, the same thing. The father sends his two older sons. The younger son begs to be able to go, but the father says he's too young and that he cannot. So the two sons leave to get the firebird, and they come to a fork in the road. And there are three possibilities, three roads ahead of them. There's a sign at the crossroads which says that if you take the first road, you will endure hunger and cold. If you take the second road, your horse will die and you will live. But if you take the third road, you will die and your horse will live. And so the two sons, not being able to choose between the three paths, decide to just give up, hang out there and live an idle life. And so, as the king is waiting for the sons to come back, they don't, of course. And so finally, Ivan begs his father, and the father lets him go to go find the firebird. So Ivan reaches the sign in the road and decides to take the second road, which is the one where his horse will die, but he will survive. So, as he's going, a gray wolf comes and eats his horse, which leaves Ivan lost in the forest, lost in the middle of nowhere, walking for days and days until he's exhausted and can continue. When finally the gray wolf comes back to see him apologizing for eating his horse, and then, of course, offers him to help him. There are some versions where the wolf asks Prince Ivan to. If he. If Prince Ivan would be willing to give him his horse to eat, which is a very interesting take on it as well. And. And Ivan accepts. And then the horse gives his help in return. And so the wolf says to get on his back and that the wolf will bring him to where the firebird is. And so Ivan rides this wolf through the great lands and reaches to another kingdom. And in the Russian fairy tales, it's always amazing. It's always like, you know, the tenth kingdom, or the, you know, the tenth of the third. Ten times three kingdoms, or there's always this kind of way of describing it, which is really wonderful. And so Ivan arrives and the firebird warns him. He says, no, not the firebird. The gray wolf warns him that when he gets the firebird, he's gonna find the firebird in a golden cage, and that he should take the firebird, but not take the golden cage. So Ivan goes out, gets to the firebird, and of course, he cannot resist. And he goes to take the golden cage. And these brass trumpets start to blare. And the king of the kingdom is. Catches him. Ivan tells him his story. And the king says, why didn't you tell me that you wanted the firebird? If you just asked for it, I would have given it to you. But he said, maybe if you do me a favor, I can help you out. So the king says that he really would like to have this horse in another kingdom, this horse with a golden mane. And that if Prince Ivan can get for him this horse with a golden mane, then he will give him the firebird. And so Prince Ivan goes to see the wolf, and the wolf says, don't worry, I will take you to where the horse with the golden man is. So they leave together. And, you know, the. The. The gray wolf brings him to where the horse is. Once again, a similar situation presents itself. Itself. The horse tells Prince Ivan that. Now the horse, I keep confusing the character is not helping you. The gray wolf tells Prince Ivan that he should take the horse, but not take the golden bridle that is holding the horse down. And that, you know. So Prince Ivan goes in, and of course, same situation, he cannot resist. He tries to take the bridle. These brass trumpets blare. And the king comes out. They catch him. And again the prince says, why didn't you tell me that you wanted the horse? If you had just told me, then I would have given it to you. Of course, these kings are recognizing in Prince Ivan that he is the son of a king from another kingdom. And so he said, as the son of. Of a king, if you had asked me for it, I would have given it to you. And so. But now the king has also a favor. He says, if you do this favor for me, then I will let you have the horse with the golden mane. You need to find for me Helen the Beautiful. And if you bring back Helen the Beautiful for me, then I will give you the horse. And so the Prince Ivan goes, sees the wolf of course. And the wolf brings him to where the princess is. But this time the wolf says, look, you know what? I'm going to do it. And you just hang out here. I will get the princess for you. So we avoid getting into more trouble. And so the wolf goes in, he grabs the princess away from his maidserv, her maidservants, and brings the princess to Prince Ivan. He takes the princess on the back of the wolf. And as they're writing, the princess and Prince Ivan fall in love as they're going towards the king, the. The first kingdom. When they arrive at the kingdom where he's supposed to trade her with for the. For the golden horse, Prince Ivan is crying and says, I can't give her up. I love her and she loves me and what are we to do? And so the wolf says, don't worry, I will take care of it. Just go on your way and I will come meet you. So Prince Ivan and the princess go on their way and the wolf goes in and he pretends to be the princess. He turns into the princess, transforms into her. And so he's received by the king. And the king gives. I forget. Obviously the order is wrong. He, Prince Ivan brings the princess to the king. And then the king gives Prince Ivan the horse and he leaves the wolf with the king. So that the wolf says, don't worry. There. That's when he says, I'm going to meet you further down. Sorry, I'm getting the events confused. So Prince Ivan then leaves with the horse and the princess on his way to go exchange the horse for the. The firebird on his. Then when the wolf sees that he has an opportunity, he escapes, meets with Prince Yvonne, and they get to the place where they're supposed to make the trade. But when they get there, Prince Ivan is like, well, I don't want to give up this beautiful horse with its golden mane. What should I do? So the wolf once again says, don't worry, I will take care of it. And so he transforms into the horse with the golden mane. And Prince Ivan brings the horse to the king and gets the firebird. Once again the wolf says, go on your way. I will meet you. And Prince Ivan leaves with the golden horse and the princess. And when the wolf has an opportunity, he escapes, meets with Prince Ivan, and then they get to. To the place where the wolf ate his horse. And this is where the wolf says, look, this is the place where I ate your horse. I don't owe you anything anymore. And so I will let you guys go on your way. So Prince Ivan and the princess on the horse start to return to the kingdom. When they arrive at the place where the three roads met, they settle down and they fall asleep. They that's when the two brothers see Prince Ivan. The horse, the princess and the golden and the firebird. So the two brothers, jealous, decide amongst themselves that they're going to kill Prince Ivan and take his treasure. And so they kill Prince Ivan, they cut him into pieces and they leave with the princess, with the firebird and the horse and go back to the king. When the king is happy to receive his firebird and you know, he gives the different things, the half the kingdom and one of them marries the princess and it doesn't marry, but will be the one to marry the princess. The other person gets the kingdom, etc. Etc. And there is Prince Ivan in. In cut into pieces. And he stays there dead for a month. In the some of the versions, after a month, one day the wolf, catching the princess scent comes upon the dead body, the cut up body. And he sees that these crows, this family of crows is about to come down and to eat and Prince Ivan. And so the wolf catches the baby crows and he tells the mother crow, if you don't go and get for me the Water of Life and the Water of Death, you know, at the edge of the world or whatever, you know, on the 10th of 30th kingdom or whatever, some, some kind of, you know, magical really far away number, then I will devour your children. And so the crow goes away and brings back the Water of Life and the Water of Death to the wolf. So the wolf kills one of the baby crows, kind of cuts it in half or whatever, chops it and he pours on the crow first the Water of Death which brings the crow back to one piece. Then he pours on the baby crow the Water of Life which reanimates it. It. So now the gray wolf knows that he has the right thing, turns towards Prince Ivan and does the same, pours on him the Water of Death by which all his pieces come together and join into one body. And then he pours on him the Water of Life which awakens him and vivifies him. And when Prince Ivan wakes, you know, gets up, he thinks that he's been sleeping and he's waking from a profound sleep. So the wolf tells him about everything that's going on and that his brother stole his bride, stole his horse, stole the bird. And so Prince Ivan and the wolf go to meet with the. The king and you know, tells the whole story to the king. And there are versions where the brothers are killed, where they're eaten by the wolf, and somewhere they're imprisoned. Whatever. That's not a big. That's not the most important. What's important is that Prince Ivan finally marries his princess and also inherits the kingdom and has his horse. So everything and everybody. Well, not everybody, but let's say some people live happily ever after. And so what is going on now? I would really suggest that if, you know, I told you this version very quickly and very summarily, but I would really suggest that you go listen to Deacon Nicholas's retelling, even maybe before I give you this interpretation, you might find it very fascinating. So what I really need you to do, first of all, is to buckle up to a certain extent, because I'm really going to try to give you an interpretation of this fairy tale. One of the things about Russian fairy tales that is amazing is just how cosmic they are. They have not gone through the kind of moralizing lens that many of our fairy tales have gone through during the Enlightenment, where there was this desire to make them into simple morality tales, which are not at their basis. In this fairy tale, we really get a full cosmic vision, a full vision of the cosmic image. And so what I'm going to do is I'm actually going to do something a little fun, is I'm going to use the image of everything that I designed to kind of give you a roadmap to understand this fairy tale. So what it's going to do is it's not only going to give you a. It's not only going to help you understand the fairy tale, but it's also going to help you see how this image, first of all, is not arbitrary, that this image is meant to be a kind of map of the cosmos in a way that you can also use through analogy to then look at the world and see the patterns that appear there. Of course, the image of everything that I designed is not the only image. There are other images of everything. And they could all. They could have different forms. They don't necessarily all have to have the same form. This is one manner in which you can represent the. The cosmic pattern, which is, of course not with the cosmic pattern, is of course, invisible at the outset. All right? And so now the situation starts with the idea that the king has this tree of golden apples. Now, if you notice, everything in the fairy tale is golden. This has happened in a lot of fairy tales. It has to do with the idea of them being special or the Highest version of something. And so the. They shine with light, okay? And so they glow. This is the notion of glowing. You see it also in the firebird. This idea of something which glows is something which is special, which is, like I said, the highest version of it in terms of phenomena. I've mentioned this in terms of the notion of attention and our capacity to attend to things and how this. The way they are special is the manner in which we notice them, right? Is someone you know will glow more than a stranger. And this glow is the glow that is ultimately referred to. Not, of course, not the glow of a friend, but the notion of meaning, of fullness, you know, of the highest version of something in your experience of it. And so the golden tree is, in a way, the highest thing that the king has access to. It is the fruit of, you know, you can imagine it as the center of his garden. And so if you look at the image, you see the notion of this garden, this enclosed space. And then in the center would be the tree which has golden fruits. You know, in this case, the tree is more the tree of the knowledge of good and evil. Maybe not the highest. Highest tree. That is, that is something which comes later in the story. And so this notion of this tree with golden fruit, and this is also where you're going to see. And this might be difficult for some people to deal with, but I've often mentioned that symbolism is not moral and that some stories will take on certain patterns and will manifest them at different. On different sides of the same story. And this is, of course, where you're going to see something similar. You know, the idea that the fruit of the knowledge of good and evil was bad, of course, is not true in the tradition. There's this. The idea that God, if Adam and Eve had been humble, God would have given them the fruit. Okay? So it's a good fruit, and it's also a fruit which leads to higher spiritual knowledge. And so this is the tree that the king has. You could see it as the highest insight that the king has access to in terms of knowledge, in terms of understanding. You can see it that way. You could just see it as the most precious thing that he has. It can apply different levels of reality. And so something is coming to steal his apples. And this happens to be the firebird. Now, the firebird is, of course, in different versions, it's represented not only as a firebird, but as a glowing bird or a bird of light, right? And it is this heavenly influence or this heavenly thing above. And like I Said we tend to think of the heavenly influence as something which is positive, but sometimes it is also negative. It can be negative in the sense that it can pick things, pick seeds and bring them up into the heavens and prevent them from being on the earth. I mentioned this in terms of some ideas sometimes which, you know, they're just floating up in the air and they never seem to land. There's this idea that that which is above can come down and pick that which is below and bring it up to its use. This can be seen in terms of spiritual reality, but it can also be seen in terms of understanding that a king will do the same to his kingdom. So the, the, the firebird comes down, picks the king's apples and brings them up. But the king goes down into his kingdom, picks the best men for his army, picks the best women, you know, like King David for King Solomon for his, for his court. And so this is one of the aspects of heaven, is that it comes down and it takes the best up, right? It takes the first fruits in terms of the sacrifice, it takes the best and brings it up into heaven. Okay? This is how hierarchy works. And so now this thing from heaven comes down, something which is above the king and comes down and takes the golden apples. And of course, the king doesn't want his golden apples to go away, especially if you understand that the golden apples as something like his insight or something like the best that he has. And so he wants to catch the bird. Here is where the story refers even more so towards the idea of knowledge and of insight. Because we see that the reason why the two sons can't catch that which is above is because they fall asleep. They can't be into contact, which that was above because they let themselves fall into death, you could say. And so Prince Ivan stays awake. Remember the story of Christ, who's up on the mountain and who tells the disciples to stay awake at the bottom of the mountain while he prays. So while he is up and communing with the heavens, he asks for the disciples to stay awake so that they can benefit from what is happening at the top of the mountain. This is the similar situation. The prince, the princes have to stay awake, but they don't. They fall asleep, they don't catch the insight, they don't receive the, the positive aspect of the spiritual influence. And Prince Ivan, on, on different from them, is able to remain attentive. He's able to remain awake and attentive. And because of that he's able to catch the insight, but not totally he's not completely capable of catching the insight. He only catches the remainder of the insight. He only catches the feather and brings the feather back to his father. Now, in terms of knowledge, I think pretty much everybody has had that experience where you have an insight, but then when you try to formulate it, you can't formulate it properly. You don't have the words for it. You only have a pale remainder of the insight or the spiritual vision, or the moment of the small connection, spiritual connection that you have. You don't have the capacity to explain it. And that is what Prince Ivan, staying with only the bird's feather, is talking about. Now, of course, I keep. I'm going to keep moving, you know, at different levels of ontological reality to help you understand what this is about. But notice that it's not, of course, just about knowledge. It's about all kinds of other things. But this is the best way to maybe understand it in this case, okay, you can understand it in another way. You could say that, you know, someone who receives an opportunity which comes from above, let's say a favor, a king's favor, and then is not able to make it grow, is not able to. To make it produce more than, you know, very little. And so you get this thing from above, but you're not able to make it worth something. It kind of falls flat, you know, that's. That's one. Another way of explaining the experience of Prince Ivan in this moment. But of course, the king, even the feather for him, is already more than what he has access to, is already more than what he can have. And so he wants to get the bird because he is dazzled by just the feather of the bird. And so he wants it, and so he asks his son to go catch the bird. Now you need to wonder why the king himself isn't going to catch the bird. But in a way, ultimately, you also kind of have to understand that the sons are always also an extension of the father. So you can imagine the father looking at different aspects of his kingdom to see if they can capture this insight, different aspects of himself, different aspects of his kingdom, to see if they have the capacity to host the insight, to catch it. Okay, so the two sons go. Now, the thing about this is that in order, this is now the place where there's actually a form fall. And you might wonder, you know, why. Why is it now that there would be a fall? Why is it that this moment throws the whole situation in a loop? You can understand it, of course, if you want to understand it as the hero's journey, as the call to adventure, which is also this going down into the underworld, going down into death, all of this is what's going on here. But it is also a form of moving into the world of death and of suffering in order to find the body, in order to find the capacity to connect with this. This first event that happened right, this first moment of the. The firebird and leaving of his feather. So in order to do so, you have to go out and you have to kind of go into death. And this is what happens now here. It's not necessarily seen as a fall per se, it's just seen as a going out into adventure. But let's say in the cosmic image that I. That I've drawn, it is represented, of course, also as. It's represented as the Fall. But there are different ways of understanding the Fall. I've noticed. I've mentioned in the past that, for example, Saint Irenaeus talks about Adam and Eve as being children, something like children who. Although the fall was. Was not good, we couldn't say the Fall was good, but it was nonetheless a kind of pedagogical tool to get them to become more than what they. They were. And so this is something that you can see as well. So the king's sons are going out to find the firebird, but in doing so, they're also going to become men. They're also going to show that they're worthy of. Of replacing the king, not just by finding the firebird, but by. By vanquishing. The very. The very challenge that the king is giving them is also going to show how they are the ones who can inherit the kingdom. Okay, so the two go out and they come to the result of death. That is, they leave the. The. The safety of the kingdom and they face multiplicity. They come to the fact that they now have to choose. This is important to understand because Saint Maximus the Confessor, for example, talks about how the idea of choice that we have, the idea that we choose between different paths like this, that is not the highest form of will. The highest form of will is a will which is directly connected to reality, which doesn't choose, but expresses itself in pure conjunction with how the world is laying itself out. And so it actually looks like you're not choosing in the conventional sense, where it's like you have options and you choose the different options. This is of course, the same thing. This is, of course the same thing as Adam and Eve go down the. The hill, go down the. Or change from the garden. They will face a world where they have to choose, where multiplicity will present itself to them as a. As a quandary that they have to solve. Whereas in the garden they didn't have. The multiplicity wasn't a problem for them. It wasn't something which presented suffering, let's say. And here is where the choice, multiplicity and suffering come together in this moment, where the two sons find the sign and the three, the three possibilities of either going on the road which will. Which will bring them cold and suffering. And then you can understand it as three roads. So one in the one, let's say, going down, straight down, and then one going to the right and one going to the left, okay? And one is this road of, let's say, pure suffering, which is just going down into death, okay? And then one of them is the two opposites. So if you look at the image of the cosmic mountain, on the two sides are the two opposites. There, let's say, the going up and going down, okay? You can understand the two opposites in different ways. And here you can see the two opposites. One is that, let's say, death will cause a separation of the body and the soul. So the horse of the rider is an extension of his body. This is something that is maybe difficult for some people to understand, but when every time you hear of a mount in any story, it is an extension of that person, just like a sword or like any. Any supplement that is added to someone is a. Is an extension of themselves. Now, if you haven't noticed, for example, that in the story of how to Train youn Dragon, you see this very clearly where each dragon that is becomes the mount of the different Vikings, is an expression of that person, is like a lower expression of the person who is mounting them. And this is, of course, what amount is. It's like adding body to yourself, okay? So you add animality. It's a garment of skin. You add animality to yourself, and you have more power because you have a mount and you can go faster, you can pull things, you can do all these things because you're adding power to yourself. You know, you can see this going all the way to a car or to, you know, other types of technology which increase your power. But the mount is the most primal, is one of the most primordial ones. And so one of them is that the body and the head will separate, you know, and the head will survive, but the body will die. The other one is the opposite, where the body and the head will separate, but the head will die and the body will survive. And so you have these kind of two opposites which are represented in different ways. If you look at the image, you have the white bird and the black bird. So in one image the head survives, and in the other image the body survives. So it's these two. These two movements, and then down the middle is going down into death. So Prince Ivan chooses. Chooses rightly. He's smart because. I mean, he's smart because he chooses the one in which his horse is going to die. And so he loses his body. And because of that, he loses his power. And he can't get. He can't do what he wanted to do. He loses, you know, he. He sacrificed his. His power. And in a way, there's a manner in which you could. You could see it as a. As a kind of form of asceticism, you could see it as a form of sacrifice as well, that he kind of sacrificed this animal in order to be able to survive. And so he suffers for a while because he kind of wanders and he can't. He can't find. He's like a wandering ghost, let's say, who can't find a body. And so he can't accomplish anything. He can't do anything. And that's when he meets the wolf that ate his horse. And now you need to understand the wolf also as an extension of Ivan. The wolf is his mount as well. But now this is a different kind of mount. It is a wild mount. It is a mount which has something of the trickiness of the snake, the power of the animal. And so it's not a tamed mount like the one he had, but it's a wild mount and it has much more power than what the other mount has, but it also has much more danger. So you can understand it in many ways. You can understand it as this. Let's say. I've mentioned this before. You can imagine it first of all in yourself, as a more wild aspect of yourself, as your more irascible nature, your more passionate nature. You can understand it in times of a person. You can understand it in terms of a country where, you know, there's so many examples where the king will get a personal guard of barbarians to protect him because he's taking this foreign, strange power to himself. And it's. It's adding more power than if he took his own people because of this kind of foreign element to it, this strange element, this wild element. If you're able to mount it, it will give you way more power. But it also has more danger. That is another part of it. And it's the same, you know, in yourself. If you're. If you need to tap into anger, if you need to tap into those more irascible passions that you have, you will see that it'll give you extreme power. And it's a. It's a power that can make you drunk. It's a dangerous power, but it is power nonetheless. And if you have holy anger, for example, you can accomplish pretty much anything. And so here the wolf now brings him to the first place, of course, in the cosmic image. You can understand this as increasing the layers, the different layers that cover Adam and Eve, increasing the animality in which Adam and Eve are plunged. You can see it as this putting on of the garments of skin down at the bottom of the image, moving from the lighter covering, which is the. The leaf covering, to the animal covering below. But here it's more the idea of moving from the tame animal to the wild animal. It's too much to go into here. But you see that distinction in the creation narrative as well, where there's a. When he talks about the different animals, it talks about, let's say, domesticated animals and wild animals as these two opposites or two aspects of reality. And so because Prince Ivan could not catch the bird which was coming from above, he has to free it from, and are already from a cage. He has to find it in the world, and he has to be able to. To get it from there. Now, there are many ways to understand this. You can understand it in terms of knowledge. Understanding in terms of knowledge, at least in my sense, seems to be a good way to understand it. But you can understand that if you have an insight and you can't, let's say you lose it or you lose the capacity to embody it properly. The best way then to recapture that insight is to look at the analogies, is to look back into the world and to see if you can't perceive a glimmer of that spiritual insight that you had. You look in Scripture, you look in the tradition, you look in, depending on what the insight is that you have, you will look in the world and try to free it from another body, try to free it from another place where you find it, so that you can kind of pick it out, right? And then see it once again, okay? And this is what is. Is happening. But the. Here you have this opposite being set up. The wolf says, attend to the inside, but don't take the outside. Don't take the thing tying it Down. If you want the insight, take the bird, but don't take the body. If you want the insight, you need to be able to see the insight in the world. But if you need to be able to also be careful not to confuse or to take just the. Take the body as well if you want that insight, you know, so if I'm looking for analogies, I need to not get too attached to those analogies, not get too attached to the examples, but be able to weed the insight out of the cage. Okay? So even if the cage is precious and the cage is nice, you need to leave the cage. Don't take the cage. And so because Prince Ivan takes the cage, then he's thrown into another loop, another loop of having to now go find something else. Okay? And the, the. And of course, Prince Ivan now is also in the world of death. He's in the world of the stranger. And he's using the tricks of this. Of that world. He's using thievery. He's using. He's using, let's say, things that aren't good to. Now try to find that insight. Now, like I said, symbolism is not moral. And there's plenty of examples where you see this happen. I talked about Jack and the Beanstalk. There are different stories where you can see the use of thievery and trickery to try to get the insight, you know, and sometimes it can be justified. In the story of Jacob, you see that that's what he does. The. The story of Jacob is very similar to these types of stories where Jacob goes to Laban and in order to get his wife, he. He tricks Laban, but he also ends up taking his. His livestock. And he ends up, you know, he. He's also tricked as well. This is something that would happen to Prince Ivan also. But he's engaging in that kind of behavior where he's. Where he's stealing the thing. And it's funny because the king says, if you had used logos, like, if you, if you had used the tools of meaning to get this insight, then you. I would have given it to you. But instead you're not. You're not. I mean, you. It's going to work in the end, but it's going to be very painful. The whole process is like a fall. All of it's going to be very painful. And the king is saying, if you had only used the tools of light, you could say, then you would have gotten it. But no, you need to go the hard way. You need to go all the way around. You need to Suffer. And you need to. To. To go through the hard part. And so, okay, fine, you try to steal it, you try to get the cage. And now you have to go on another loop and you have to go get now the horse with the golden mane. So Prince Ivan, now you had. He had to get something above, right? And now he has to get something below. So it. It. It is. He's going down, okay, he has to get something below, which is another mount now this golden mount, which is related to his horse, which is related to the idea of that which is above to the mount. And so he goes. And the same thing happens again. There is something about the. The. There's something that's not. It's similar to the. The. The bird where he also is trying to get some kind of insight in the mound. He's trying to get. It's not the same high insight as the firebird, but there's also some insight because the. The horse has a golden mane. And once again, he's told, take the horse, but don't take that which ties it down. Don't take that which is holding it to the world, right? If you want to get the most of it, don't be attached to that which is around it, right? To its covering, to its shell. Of course, Prince Ivan makes the same mistake. Same thing happens. The king says, if you'd only use the tools of light, if you'd only use logos, then you would have gotten it, I would have given it to you, but instead you go the hard way. So now, third way you go. Now the third one is to get Helen the Beautiful. This is now becomes very interesting because all of a sudden, you know, I don't know if in the Russian it's meant to be that, but at least for an English speaker, when you see Helen the Beautiful, you, of course, think of the story of the Trojan War, and you remember that in the story of the Trojan War, there is also a story of golden apples. And the whole conflict starts with a problem about wanting a golden apple and a, you know, this competition to seduce Paris between the goddesses. And then, you know, the prince chooses to get Helen of Troy. And this is what kind of sends the whole thing into a loop as well. So that's just fascinating to mention. Seems like it's referencing that as well. But here the idea. And this is going to sound strange to some, but now he's actually getting the lowest thing. And now the lowest thing appears not as something negative in the sense of bad, but lowest in the sense of the grail. In the sense of the. The pristine cup in the sense of the virgin. That is his last quest. So he's moving down from the, from the, from the high insight down. But then this is the kind of the trick or the mystery, which is that one of the highest insights actually is in the grail once at one. Once one of the highest insights is in this pure container, which is the pure beauty or, you know, unadulterated beauty, the idea of the virgin, the idea of the mother of God, of course, ultimately. And so this is, this is now the. Let's say this is in his quest. He's going to now try to get that, get the grail. And so this is also fascinating because until now, the Prince Ivan doesn't really care about the things that he's getting. He doesn't care about the firebird. He didn't care about the golden apples, he didn't care about the horse with the golden mane. He's just kind of. He just kind of wants to please his father. And this is, in a way, as he goes down and he goes out into adventure and he goes down into death is the place where he will then discover in a certain manner, his own being in his own agency, you could say, where he. And this is, like I said, it's neither negative or positive, but he's going to start to experience attachment and desire in his own sense. And here in the story, it's not seen as bad. In other stories it could be seen as bad. In this story, it's not seen as bad where Prince Ivan, you know, when the wolf brings him the princess, now he falls in love with the princess. And the falling in love with the princess also makes him care about the other things. He also wants the horse and he also wants, you know, he wants the different things because he, he. He now is in love with this princess. He now is attached to the world, you could say. But this is also the place where the effect of death, where the use of trickery will become more and more apparent. And now the. The thing that he desires, the. His irascible quality, his desiring quality, his mount, right? The thing which drives him forward, the thing which supports him and his power is going to take the shape of the things that he desires, and that is going to make him have access to those things, right? And so this is what's going on. The wolf takes on the shape of that which he desires and then he is able to get it, and in a manner also through an act of trickery. This is, of course, in the world of death is where you start to see these loops of trickery. So he tricks once, tricks twice, but that, of course, it's not a way to live. It's. You can't. You can't continue that way. He's entered into the place of multiplicity, and this is where you see what the place of multiplicity is. Because when Ivan gets back to the place where he discovered multiplicity, the place where the paths split into three, that's the place where he also dies. Because that's what it's been from the beginning. It's been death from the beginning, from the beginning of the story. This whole process has been a process of death. And you see it in the story. You see it in the story because it's about the water of life and the water of death. But this whole loop has been Prince Ivan going down into death. And it manifests itself completely when he kind of comes back to this point. You've seen this loop in death, but now you see the. You see it again, you could say. But to help you understand what this whole thing was from the beginning, which is this relationship between desire and death and multiplicity and the desire for multiple things, all of this stuff. Now it, let's say, happens to him where he is killed by. By his brothers and he's chopped into pieces. That is, of course, the ultimate representation of the fragmentation of the breaking apart of the body, which happens at the bottom of the mountain until Prince Ivan is killed and is broken apart and everything that he loved is taken away from him. And so this is where, let's say, the mystery of the transformation finally completely occurs. Now Prince Ivan is about to be baptized. And this is, of course, like I said, it's not a Christian story, and so you can't totally see the Christian elements in it. But nonetheless, the place where he is right now in the story is akin to the place where he is about to be baptized. And so the. You have to see the. You have to see. Now the. The wolf comes and he tells the birds that he takes the baby birds. Now you have to. To see the black bird and the white bird as related in the story. You have the. The bird of light, the firebird, and you have the bird of death, which is the blackbird. And the bird of light is picking the fruits from the tree and bringing them up above. And now this wolf who's at the bottom. And this relationship with the bird of death is rather this pulling down. Or you can say, right, so you have these birds that are coming to Eat the carcass, not take the seeds. You know, the difference between a bird that eats the seeds in the tree and a bird like a crow that eats the dead bodies on the ground. Okay, so you. This opposite in the story, these two sides. If you look at the image again of the cosmos, you see the white bird and the black bird. The bird that Noah sent out and came back, and the bird that Noah sent out and now ended up feeding on dead bodies in the water, according to some of the. The artistic tradition. So the wall. And so now you're at the bottom of the mountain. You could say, in a way, you've kind of been at the bottom of the mountain the whole time. This whole thing has been kind of a cycle of going down the mountain and showing what the bottom of the mountain is in terms of multiple simplicity, desire, you know, attachment to things. And also. But ultimately, the mystery of the Grail, which is a transformative mystery, which is also at the bottom of the world, you could say. But all of this is kind of. This is what's great about stories, is that you can show the story, and it's because it's. It shows you the positive and the negative aspects of this process that is happening. So he tells the blackbird to bring him the water of life and the water of death. You can imagine it as the water which is coming down from the garden, right? That's flowing down, which is the source, which is the water of life. It's the water that Christ talks about, the water that. The living water, the fountain of youth, all this image of the fountain which brings life in, let's say, in Christian tradition, but in all kinds of traditions, you find this idea of the water of life, which comes down from above, and then the water of death, which is represented, let's say, as the ocean or the salt water, which is below and which you can't drink. And so the bird brings the two waters together, and this is where he will be baptized. Now, baptism, it's interesting because you do have these two, like, competing narratives about baptism, where you have this sense that baptism is a descent into death. And so you put someone down in the water, and then there's another version, which is the sprinkling from above, which you see mostly in Catholic baptism, where they sprinkle the person with water on top. If you look at early images of baptism, you see that it's both together. You see Christ is in the water, and then you see St. John the Baptist pour water on top of his head. And this, you see it in old baptisteries where you would have water below and then there would be a fountain in the middle which would come down on the person and as they're also being baptized. And it's really is the joining of the two waters. Baptism isn't just one, it's a. It's both at the same time. It's both going into the water of death. But somehow this water of death also joining or getting the, the. Getting the, the. The positive aspect of the water of life and the water of death is there to bring things together into one. Now what. Why, why is it. And this has to do. It's difficult because we, we don't tend to think that way. But it has to do, of course, with the. The purifying effect of water. It has to do with the idea of you have a lot of stuff on your hands and then you wash your hands and so. And then you remove all that is, you remove the multiplicity. And now here it's not so much that removes the multiplicity, but that it kind of fixes them together. This, of course, intuitively, you know, in certain arts you can understand that water also does that. It fixes things sometimes especially cold water. If you imagine, imagine metallurgy, where they heat the flame, they heat the sword so that it becomes malleable, and then they put it down into the water to fix it. And so this is what's going on in the water of death, where the body kind of finds itself, just the body. And so remember, this whole thing from the beginning has been about the body and the soul and the body or the above and the below, the separation of the head and the body. All of this has been there from the beginning. But now you can see the two coming together where there is a, let's say, a bringing together of the body and then a pouring of the water of life which vivifies the body. Now, there could be different ways of representing it. In Scripture, it's represented as the gathering of the dust of Adam into a body and then the blowing of the spirit into the nostrils of Adam. Now, let's say, though, going down into the fixing waters to kind of fix the shape, and then having living water pour down upon it is of course, a very similar pattern. Understanding that in many ancient mythologies as well, the relationship between heaven and earth are above and below was represented by the intertwining of fresh water and salt water. For example, in the story of Tiamat, for example, which is this, there's a joining of heaven and earth as the fresh water and the salt water. And so this is the resurrection of Ivan. So Ivan resurrects. He's gone through the adventure, he's gone through death, he has died to himself. And now he's back. He has, let's say, become more than what he was before. And now he is ready, you could say, to claim the kingdom. And that's what happens. He goes, finds his father and he's able to reclaim the kingdom. But in order to do so, he had to go through this reawakening from sleep, right? And you can understand his death when he's cut apart and his sleep with the princess and the horse all being the same thing. And now he does finally awake. You see it, of course, in the story, when he. He comes back from death, he's also sees himself as awakening. And so you could understand. There's so many ways you can understand it. You can understand the whole loop of him going down as a kind of dream, or the whole loop of him going down as this, like I said, when going down into death, going down into forgetting, going down into desire, all of these things going down into his passions. All of these things make sense because the story is so versatile that it can be applied at different ways, to different things. And then finally, Prince Ivan comes back, inherits the kingdom from, replaces the king, ultimately becomes the new king and inherits the kingdom. And so I hope that this was helpful. And the image, of course, the final image, and I know some people will might be a little bit annoyed that I point, of course, this story is not the story of Christ. It is not comparable to the story of Christ. The story of Christ is much bigger, much wider, much broader than all of this. But nonetheless, the story, because it is so cosmic, cannot help but point to the story of Christ in different ways, some of them more broken than others. But in the end, what you see is the image of Christ crucified at the top of the hill, which is that you can imagine, not just crucified, but also, let's say, if you can imagine the image of the crucifixion and the resurrection at the same time, or the descent into Hades at this, all of this at the same time, this is the final image where, for having died, for having gone through this, Prince Ivan, you know, his kingship is higher than what it would have been if he didn't go through that, if he hadn't gone through death. In my brother's book, he talks about the idea of space crowned with time, that to receive the crown is also to have integrated some aspects of death or to have used death against death. And this is something which the whole time Prince Ivan is dealing with. And so there could be so many more things to say. But I just wanted to give you a little hint of how much there is in these fairy tales, just how much depth there is in these stories. And so that is one of the reasons why I'm extremely excited to see Deacon Nicholas go on this journey into Russian fairy tales. Slavic fairy tales are amazing. I also love Czech fairy tales, for example. My wife is from Slovakia and the fairy tales from that area are wonderful as well. So I'm really looking forward to hear Deacon Nicholas talk about Baba Yaga and about all the very fascinating characters in Russian fairy tales and give us a little hint of their meaning. So everybody, I hope this has been useful to you and I thank you for your attention. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description and so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
