{"episode_id":"SW - #188 - 2021-10-27 - The Theology Behind the Culture War","start":0.32,"end":1565.62,"speaker":"Jonathan Pageau","text":"One of the big problems people face today regarding religion or regarding the notion of God is a problem that I would call something like the reality of God versus the reality of the world. And it might seem like an abstract problem, which matters only to theologians, but it actually ends up manifesting itself in everybody's life, actually, whether you are religious or not. And it ends up manifesting itself in opposites. So it manifests itself in things like, for example, in scripture you have Christ who says something like, call no one on earth father, because God in heaven is your father, or Christ saying things like, no one is good but God. And you'll find many places in Scripture where Christ seems to bring everything to God and to reduce the world to almost nothing. And then there are other places in Scripture, for example, where we have the law of God, where we have the prescription of God, where we have Christ saying, do this in remembrance of me, where on the other hand, he seems to be saying that these things are really important. And so how do we bring this together? How do we make sense of this? And how does it help us understand some of the discourse that people are using and how we often feel trapped in opposites sometimes and struggle to find a way out? So we're going to look at some of this and, and see how it relates to your everyday life. This is Jonathan Peugeot. Welcome to the symbolic world. So this question is very important today, especially in the kind of cultural battle, you know, in the culture war, we can call them. Let me give you a few examples once again, and you'll see what I'm talking about. So, for example, a famous verse that is being used very often today is the verse where it says, there's neither Jew nor Greek, slave, nor free, male nor female, for you are all one in Christ Jesus. And so many people will use that verse to argue for things like the abolition of gender roles, for having women priests, or also for other, even more kind of notions of fluid identity and certain woke values, let's say, will be hiding. People will use this verse to argue for those types of positions. So what's interesting is that if you look at that from that side, you'll notice that this is something which is absolutely there in Scripture. Christ does it all the time. Like I mentioned before, Christ says, none is good but God. Christ says, don't call anyone on earth your Father. There are so many places where Christ seems to say that, even places, for example, when he says that, talks about the person who sells the field in order to get the person or to rip your eye out if it causes you to fall. All of this type of thinking moves towards the idea that the world itself is dangerous. The world is dangerous in the sense that it can become idolatry. And this is, of course, something which we find in certain strains of Christianity today where all forms are seen as suspicious. We want to remove liturgy, we want to remove ritual because we feel like ritual is suspicious. It can be idolatrous, we can be attached to it, and it can actually turn us away from God. And there is actually position for that in Scripture. I mentioned some verses, but there are many other verses which will go in that direction. Now, this is, of course, the problem. The problem of so many types of interpretation is when we take one, we take a line and we draw through Scripture and we find all the verses that kind of agree with the position, and we just argue from that. Now, what's fascinating, for example, is that for every verse that I've mentioned in Scripture, there is a counter example. And so, for example, it says, there's neither Jew nor Greek, slave nor free, male nor female for you all one in Christ Jesus. And then Christ will then in other places say that. And even St. Paul will talk about the Gospel going out to. To the Jew first and then to the pagan, or then to the Gentile. There's other places where, for example, St. Paul talks about gender roles and talks about the role of the man, the role of the father, the role of the wife, the role of the woman in church. And you think, well, how does this jive? So what happens is people will tend to create a false hierarchy. They'll try to say, well, this verse here, the one where it says, there are no divisions, there's no separation, there's no particularity. We're all one. There's. That is really. That's the real truth. And the other one, that's just kind of detail. It's not really important. But if you follow the line, you'll see that this happens all the time. For example, when it says. When Christ himself says, you know, none is good but God, you have to realize that there is an aporia in what he's saying, because in the very creation of the world, God creates the world. And, you know, at almost every day of creation, he says, and he saw that it was good. And so what is going on here? How is it that we can have saying this in one place and the other. The other example that I gave, which is, do not call anyone on earth your father. There's another place in scripture where St. Paul says to the Corinthians, that he became their spiritual father, that he is their Father in Christ. So once again, what is going on here now? What's going on here is something about the very nature of reality and the very nature of God, which is that in the modern world, the modern world has taken up this kind of dialectical thinking, this kind of oppositional thinking, and we tend to frame it in a certain way. So, for example, we talk about nominalism and univocalism. Now, these are fancy terms, but what it means is that in the late Middle Ages, there are some thinkers we talk about, you know, about Occam or Duns Scotus. Occam is associated with nominalism, and Scotus is associated with univocalism. Now, people will argue, for example, that it's not totally there in their thinking, that it's later people that interpreted it and made it more radical. It doesn't matter. It doesn't matter. For our purpose. Our purpose is that this is how the world started to frame itself as these kind of two opposites. One was that God is so high above reality that nothing you can say can touch God. Like, you know that God is beyond everything. And that reality, nothing in reality is connected to God. So when you say that God is good, we don't mean it in the same way that we say other things are good. When we say that God is love, we don't mean it in the same way that we mean. Talk about the secular love. There's a radical disjunct between God and all the rest of reality. Now, this is what we call nominalism. On the other hand, there's something we call univocalism, which is that. No, that everything, that God, because God is the source of reality, then God necessarily has to be related to the things we say. So when we say. When we talk about love in the world, it's. It has to be the same as the love that God has, because or else what would it even mean to talk about love in the world? And so God is love, but supreme love, like the being of supreme supreme love. So we have the same type of love that we have. It's just more than we have and bigger. And so God is. In that sense, God is like the super everything. So everything that you think about God is the super everything. And so what? So what the nominalists will say of the univocalist is that you're trapping God in creation. You're making God part of creation, and that is a mistake. You're making him into kind of A pagan God. God is beyond creation. He's the source of creation. And so what the univocalists will accuse the nominalists of is saying you're putting God so high above the world that he's completely disjunct. And you're making the world arbitrary. You're making all of reality arbitrary, because there's no connection between the source of reality and reality itself. And so everything here is just arbitrary because there's no connection to. Or at least God's will is arbitrary. God acts arbitrarily in the world like some divine tyrant that just kind of acts without. No, Without. Without. Without no connection to how the world lays itself out. Now, this, like I said, this might seem like something which isn't that important, but it ends up playing itself, playing its out very importantly in the world. And it looks like, for example, it can look like something like a kind of bare evangelical service where everything is. We attempt to strip everything down because we find the world to be suspicious. Now, that is. Would be the extreme of. Kind of, you could say, of a nominalism. And then you have the other side, like an extreme univocalism, which is to think that every little detail of, for example, the liturgy is supremely important. And we have to. We have to practice it exactly the way it's written, and we have to do things. Things exactly the way it is because all of these things in the world are actually manifesting God. They are a little body of God, you could say. And so how do we deal with it? And it's really important to deal with this because it will lead to several conclusions that you see in the world today and arguments that people will use. You will find people who. Who, for example, refuse to participate in religion because they'll say things like, multiplicity is an illusion. You know, it's all. Maya, it's all an illusion. You know, all forms are relative. And therefore, you know, I'm a universalist, which means that I just see the transcendent absolute. But I don't want to get dirtied up in these particular forms. But the same type of argument can lead to another excess, you know, which is that you hate all forms. And so the universalist loves all forms. And because he kind of loves all forms and sees them only at these kind of relative, illusory representations of God, he's like, you know, I'm not gonna do any of this. And then the other one, hate all forms and see them all as idols and thinks all creation is suspect. This also leads to the kind of conspiracy Theory, symbolism, which is that as soon as you see meaning in the world, because you don't believe the world is actually kind of full of the manifestation of God, then you immediately see ill will. And all ritual is satanic. And you see that. And the saddest part is really to see even Catholics and Orthodox Christians embark in this. As soon as they see a ritual that isn't their own liturgy, they immediately think it's satanic. It's like just because something is ritualized doesn't mean it's satanic, just because it is anyway. So there are different versions of that, of course. It leads also, like I said, it leads to, like the New Age mush as well, to this kind of. It's like it's the opposite. But you can see how it all leads to the same type of thinking, which is that, you know, I can just pick and choose all the forms that I want, you know, and all these forms are good, so I can just kind of navigate through any of them. It doesn't matter. None of this matters, right? It's all. It's all. It's all Maya anyways, or it's all kind of bodies of God. And there isn't any form of balance, you know, and it's very difficult to buy. To find balance now. The balance has to be found in the aporia. When I use the word aporia, I know some people might not know what it means. It means like a contradiction which points. A contradiction which is held and which points to something which is beyond reason, which is beyond something that you can totally capture in words. And so the absolute transcendence of God and the absolute immanence of God are actually related to each other, but you can't formulate them at the same time. It's very difficult. You can't find an image in which you formulate both the absolute transcendence of God and the absolute immanence of God at the same time. So what you'll see in Scripture is you'll see moves. You'll see moves towards absolute transcendence, which we could call them ascetic moves, where the desire is to kind of clear out all the forms, to show that they're not enough, that they're not sufficient, that God is always above them. So these are the places where Christ says things like, none is good but God. You know, where St. Paul will say, all these multiplicities, they're not real. What's real is our unity in Christ. And so you'll find moves like that. And then you'll find other moves in Scripture where the opposite is happening, where Christ or St. Paul, or in general just the law or the temple or the rituals which are given are given as things you need to participate in things that are real, things that are actually manifesting God, that they are remembrance of God in a real way, not in just some kind of secondary illusory way, but that they participate in the life of God. And so we. When Christ gives baptism and communion as a ritual, when St. Paul talks about the different roles for different genders, when St. Paul kind of tells people how to act, these are relative goods, but they are goods that we need to embark in. They are not relative in the sense that they can just be discounted and ignored. They are the manner in which kind of God fills up the world. But they can be dangerous because if we think that they're absolute, then we're missing the point. The point is obviously that they're pointing towards God. But it's the same thing. If we only kind of focus on the absolute of God's transcendence, then we miss something important as well, which is that because he is transcendent, he actually fills all of reality with his being. And so what I'm going to do for you is I usually don't read texts directly from the Church Fathers, but I want to read from you a text from, from Saint Dynasty Areopagite. I've mentioned him several times on this channel. He is one of the most important saints in terms of mysticism and in terms of understanding this symbolic world and how it is that the symbolic world is both the reality of how God manifests Himself in all of creation, but how all of creation has and must point towards God, who is also completely above and completely transcendent and completely infinite above all things. And so you'll see, if you watch my videos, you'll see that I sometimes make these two moves and like I said, you can make them at the same time. But sometimes I'll say things like, God is beyond being, God is beyond all name, God is beyond all definition. Then you'll find me in another place arguing for how this manifests Christ and how these all these different little elements of reality are manifesting God in reality. So let me read a little text from you from Saint Dionysus from the Divine Names, and I'll read it and maybe I'll make a few comments. I'll skip some parts as well. You can find it yourself, you know, just by Google, searching some of the words I'm using. So Saint Dionysus says with regard to the super essential being of God, transcendent goodness. Transcendently, there no lover of the truth, which is above all truth, will seek to praise it as word or power or mind or life or being. No, it is at a total remove from every condition, movement, life, imagination, conjecture, name, discourse, thought, conception, being, rest, dwelling, unity, limit, infinity, the totality of existence. And so he, yeah, Saint Dionysus loves to string those words together. But what he's doing is he's saying, it's like if you love, if you understand the super essential identity being of God, that is that God is beyond being, actually beyond all thought, all of the things that he mentioned, you will never think that you can praise him as one of these things. And then you think, oh, here we are. Like, here it is in this kind of transcendent moment where he's saying God is beyond all things, and so we can't recognize him in anything that exists, right? But then Saint Dionysus continues, and now he goes to this, to the other move, right after what I just read when he says that he is beyond everything, beyond the totality of existence. And yet, since it is the underpinning of goodness, and by merely being there is the cause of everything, to praise this divinely beneficent providence, you must turn to all of creation. It is there at the center of everything, and everything has it for a destiny. When we talk about Theosis, I've mentioned this a few times before. I mentioned this with Jedi, for example, when I was talking to him. It's not just humans that are meant to be deified. It's everything that is meant to be deified. Everything has as its destiny God. Okay, so it is there before all things, and in all things. It is before all things, and in it all things hold together. This description, citing Colossians, because it is there. The world has come to be and exists. All things long for it. The intelligent and rational long for it by way of knowledge, the lower strata by way of perception, the remainder by way of the stirrings of being, the stirrings of being alive and in whatever fashion befits their condition. So what it's saying is that all things that exist long to. To move into this transcendence. And they do it by the means that they have at whatever level of being. They exist because they are connected to this transcendent. God fills the world with himself, but the world is not himself. But it's called to kind of move into God. And so all things at their level can participate in the life of God by whatever it is that they have. And so, like you said, the higher beings, because we're intelligence, this is how we are the image of God. That's not the only way. The idea of even perceiving is something which is in the image of God. And then just the stirrings of being alive, even the desires, even these passions, even these raw passions are ways in which we can participate in the life of God. And so realizing this, the theologians praise it by every name and as the nameless one, for they call it nameless when they speak of. So I'm not going to go into this, but he talks about how God is nameless. And he talks about how when God, you know, doesn't really want to reveal his name to Moses and basically says, I am the one who is, he's in a way rebuking Moses, that Moses is asking him for a proper name. And he's saying, I don't have a. A proper name, right? My name is beyond all names. But then he says at the same time, then we also praise him with all these other names that God has. And then he just lists them, you know, being life, light, the truth. He talks about the beautiful, the wise, the beloved, the God of God, Lord of lords, holy of holies, you know, the cause of ages. And just goes on and on and on. Just all these terms for God, righteousness, sanctification, etc. Etc. You can go through it yourself, all the list of the names of God and all the images that are used to talk about God. So here he comes to his kind of conclusion, you could say. And so it is the cause of all and as transcending all. He is rightly nameless and yet has the names of everything that is truly, he has dominion over all, and all things revolve around him, for he is their cause, their source, and their destiny. He is all in all, as Scripture affirms. And certainly he is to be praised as being for all things, the creator and originator, the one who brings them, the power which returns them to itself, and all this in the one single, irrepressible and supreme act. So what he means is that this is eternally true, that the supreme eternal act, you could say, makes all of this true in simultaneity, that is both this kind of moving out of God into creation and the bringing back of God into himself. You know, this is very mysterious, but it can help you understand a lot of things about how things that happen in Scripture, even the incarnation, the crucifixion, the resurrection, of are eternally true in God. They are eternal realities in God. Like I said, this is mysterious, but it's important. If you don't have that, at some point you're going to run into some serious problems in terms of your theology. Now, once again, for many people this might seem still a little bit abstract, and I thank you for following me all the way here, if you've had the courage to do so. But this truth that we just talked about is true at every level of reality. It is fractally true. It is true of any object you can perceive. And so, you know, let's. What example are we going to use? Let's use a chair because it's an example that I like to use. And so the being of the chair, right? The fact that it's a chair, the chairness of the chair is beyond all the parts of the chair. It has to be. And so it's beyond all the parts of the chair, but it is the source of all the parts of the chair as well. That is, it is the reason why these parts are even perceived as parts of the chair, you know, themselves. And they're not seen as something else like a bit of wood or a bit of paint or, you know, a branch or whatever. That the fact that we see them as legs, as different aspects of the chair is because they are held together by the identity of the chair which is above the chair itself. And so you can't. If you say that the leg of the chair is the chair, you're lying. If you say the back of the chair is the chair, you're lying there. It's not. None of the elements of the chair are the chair. And so to try to name them by their elements is to. Is to miss the major. The basic point that the identity of the chair is beyond it. But at the same time, because the identity of the chair is. Gives reason for these parts of the chair to be parts of the chair. Therefore, it fills the chair with its presence and it makes those parts, let's say little names for the chair. So it is a leg of a chair. It is the back of a chair. It is, you know, the aspects of the chair. And so they become like we have to look to all the parts of the chair and at the same time see that the chair itself is beyond all the parts to be able to get the full movement of reality, right? The movement up and the movement down. This kind of, you know, these two movements that I talk about, for example, with John Vervaeke all the time, it's kind of eminent, this emanation and this emergent reality. This is what Saint Dionysus is talking about. And he is actually giving us a very powerful solution to many of the problems. Whether it is complex systems or just the way in which the church exists, or just in how we can interpret Scripture without falling into these absolutes. The balance is difficult to find. It's very difficult to find the balance between recognizing how all forms are relative to the highest purpose, but also how they're real and without them. You can't sit on the chair without the legs of the chair. It even though the identity of the chair transcends its elements. And so I hope this is a little useful to kind of understand, you know, the problems you ran into. I'm sure if you think about it, you will remember many times where you. You've been kind of trapped in this moment where someone has presented to you or even in your own mind presented to you an argument which wants to make God transcendent or reality transcendent and wants to negate all the particulars. And then on the other side as well, where there's kind of this obsession with the particulars and an incapacity to see how the unity of something transcends its multiplicity. And so, like I said, thank you for your attention as usual. And more videos coming very soon. I'll talk to you very soon. Bye bye. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
