{"episode_id":"SW - #091 - 2020-02-11 - The Fool in Scripture and Culture","start":12.56,"end":4130.61,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. I am really happy to be back in Saskatoon. I was happy to bring my son as well. We had a great week. It's such a great community here, the guys that come to the workshops just to discover these big Catholic families and these very vibrant young men. I was inducted into the Bow Tie Society, as you can see, by these fine young men over here. So we'll see how long that will last. But at least while I'm in Saskatoon, I will wear a bow tie. So last year when I came, I talked about beauty and I talked about the possibility of rest, restoring beauty in a world of ugliness. And so this year, I was given the title of the Fool. How the fool participates in the restoration of culture. And it's something that I've been thinking about for quite a while. And so hopefully it's going to be very different because now we're going to talk about foolish things, but hopefully it will all, in the end, turn back towards this restoration that we hope for. When we look around the world right now, we see some very strange things. If we're attentive, we notice that the world seems to be drowning in folly, drowning in even an aesthetic of a kind of an ongoing carnival this year. Or was it. I think it was last year. Last year, in Norwich Cathedral in England, they put this giant Helter Skelter carnival ride in the nave of the church. Yes. What? That's exactly how you should react to that. And the bishop gave a talk from the top of the Helter Skelter. And at the end of the talk, he slid down the slide and just came down to the end. So another thing that happened this year as well is they put a miniature golf in one of England's fine cathedrals, one medieval cathedrals. And people could come and play miniature golf inside the cathedral. So what is happening? Why are these things happening? And on the other hand, we have something strange happening on the other side. So on the one hand, we have what used to be tradition, what used to be formal culture, politics. It's all becoming very clownesque. And there's this. There's this kind of strange turning that we see. But at the same time, we see people, we see comedians, we see those who usually play the role of the clown now starting to point out and to flip things around for us. So just a few weeks ago, there's a comedian, his name is Ricky Gervais. He is a staunch atheist. He hates Christianity with a passion. He is very aggressive in his atheism he's very mocking of Christianity. But as a comic, as someone who plays the role of poking at the system, what happens when the system is upside down? What do you do? What does the clown do when the whole world is a carnival? How do you make someone laugh when the entire world is a joke? That's the world we're living in. And so what we're starting to see is we're starting to see these comedic characters start to point out. And so just a few weeks ago, he gave a speech at an award show in Hollywood. And in his speech, he just ran through these Hollywood characters. He just kept smashing at them, you know, accusing them of all kinds of crazy things, accusing them of being accomplices to the MeToo movement, with Weinstein accusing them of being accomplices of Epstein and his pedophilia. It's like all of this, he was just going right after them, and it was just astounding to watch. And so now here's this guy, this atheist, who in one day had 500,000 more followers on Twitter, and they were all conservatives and Christians and all these people. And so here in his still, he's still a clown. So he says, you probably can't read it. He says, I've noticed a couple of tweets criticizing me for accepting new followers who are opposite of me. Christian, conservative, pro life, pro gun reactionaries. He says, of course I accept them. To err is human, to forgive, divine. It's what Jesus would do. Then he says, dog, bless all my followers. So still in the fool, in. In the fool's guise, he flips it upside down, right? Because of course, we all know that dog is. Is the upside down of God. But nonetheless, he. Now, this fool, this atheist fool, is the one who is pointing out the failings of this clown, upside down world that we're seeing. Another example that has just happened recently, which is completely crazy. Kanye west, who maybe of you. If you don't know who he is, I'm happy for you. I'm very happy that if you don't know who he is, but if you do, he's a rapper. He's a very famous performer, and he is known for being very extreme in his behavior. He does very wild things. He speaks. He goes up and talks in front of people when he's not supposed to, and he said crazy things on tv and he went insane. He ended up in an asylum. Just a few years ago, all of this is happening. He married Kim Kardashian, who, if you don't know who she is even better. I'm really happy you don't. You probably, sadly, do know who she is. But he married this very. Let's just say, very loose or very whatever. He married someone, a very strange lady. But now all of a sudden, this guy, in his madness almost, he converts to Christianity and he completely flips around. And so he is now trying to create these events that are concerts, but they're not really concerts, almost like church services. It's very strange, but he's saying things that no one else can say. He's criticizing abortion. He's criticizing premarital sex. Like, of all people, he's criticizing. It's like it's completely mad. But here it is. Here it happened. His album is called Jesus is King, and it's basically a gospel album. And he said the reason why he called it Jesus is King is so that now everybody on every TV channel and every. Every one of these liberal media outlets, when they talk about his album, they have to say, Jesus is king. They just can't avoid it. So he's playing a trick. He's still acting in the guise of a fool. He's playing a trick on people, but it's turning in the other direction. So in order. In order to understand. In order to understand folly. In order to understand the fool, we have to. We have an intuitive grasp of the fool, but we have to look at the shape of the world. We have to look at how things are laid out in the world, in the stories to understand what is the position of the fool. Why do we have this? And so to understand it, we have to think about. We have to go back. We always have to go back into the first story. In the first story, everything is packed into that story of creation. In Genesis, everything is there. If we can go back into that story, we find all the keys to understanding it. And so in the first story, we have these people, Adam and Eve, who are in a garden. And traditionally, we have to understand the garden as a mountain. It's very important to understand it as a mountain in scripture. It's actually described as a mountain in Ezekiel. And so here they are in this mountain that's a garden. And they are innocent, and they are nude in their innocence, but they don't know that they're nude. And so the church fathers talk about how they are clothed in glory because of their innocence, in their. In their nudity. Then, of course, they fall. They get chased away from the garden, and they move out. And then they get these garments of skin, right? They get. They get these Things that are added to them and the garments of skin have to be understood as anything that we add to us. I mean, it's not just our clothes, but. But it's all civilization. You know, after that there's Cain builds cities, they develop technology, they develop music. All of these things are all these added things that we added to our natures to compensate for this fall, for this loss of innocence. So now we have this sense that we have this structure, this world that is society, civilization, all of this. And to lose your clothing now, right, is shameful. So to be naked is to be shameful. It's not the same as the nakedness in the garden, right? So you have the nakedness in the garden, which is clothed in glory. Then you have clothing, and then you have this nakedness. That is being ashamed like that. You find yourself in shame. And we see it in the very story of scripture. We, we have Adam and Eve, we have the fall, we have the flood. And right after the flood, if everybody remembers their Bible, what happens right after the flood? So Noah gets drunk, disrobes, and then he is shamed for disrobing in his tent, right? So there's a structure there. It's an actual. It's a narrative structure. So you can see the world like that. And so if you, if you look at the drunkenness of Noah, that's. Drunkenness is a. Is a tag for foolishness. I hope that makes sense. I don't want to explain it too much, but you can understand that just some. When you drink, what do you do? You become foolish, you just act foolish, you start making jokes, you start saying stupid things. You start saying things that don't. They don't make sense. And so the drunkenness and the foolishness are, are together. So we have this structure. Now the structure is not just in. It's not just in time, in sense of a story, but it's also in space. So if you understand the medieval maps, I'm going to show you this medieval map. So at the top of the map, like a mountain, you have the Garden of Eden. I don't know if you can kind of guess where that is. So you see there's a tree and there's Adam and Eve that are there. Can you kind of see it? All right, Everybody can see that. All right. And so then. So that's the top of the world. And you see these four rivers that are coming down, that's the center. Then out of that, there's all civilization, all the world. The world is all there. All the cities, all the countries, all the, all these garments of skin, right? All these cities and civilizations that are added. And then on the fringe of the map, that's where you have all the monsters, all the exceptions, all the things that don't fit, all the freaks, all the things that aren't what you know. And so the monsters are represented in all kinds of ways. Cannibals, men with faces in their chests, you know, men with just one leg, anything, any idiosyncrasy, right? So you can imagine it as the world of idiosyncrasy. So you have an identity in the top of the garden, and then you have. It plays itself out. And on the edge of that, you have the idiosyncrasies. And that's, that's a rule. That's the shape of the world in terms of how the medievals understood the world, but it's the shape of every single identity. So you have. The Greeks had the same vision. They had the idea that they were the Greeks. That's this. They had their identity. And as you moved out from them, you would start to see things that you don't recognize, and you started to see idiosyncrasies, and you start to see things that don't fit. And then finally, on the edge, you. We had the monsters. And so what do idiosyncrasies make us do? Usually now we're not allowed to, but traditionally, idiosyncrasies made people laugh, right? Things that are normal, things that are strange, things that are not usual are one of the aspects of what would make someone laugh. And ultimately too, on the edge of the world, you also have upside down behavior. You have, for example, for the Greeks, you have the Amazons. The Amazons are the upside down world where the women are the warriors and the men are not involved in managing society. So it's like everything is turned upside down and they live on the edge of the world. Can you kind of see it? You have rule, identity plays itself out. And then on the edge you have these idiosyncrasies. Now a lot of you wonder, like, why, what does this have to do with the fool? You'll see. And at the bottom, of course, when we have the very outside of the world, we have dragons. So that's the absolute chaos there on the edge. So you can understand it like this, understand it as a person, not just as a map or as in time. You can understand it as the. The idea that you have a highest aspect to you. You could say Christ in you or you could say your soul or you could say the highest aspect of you, Christ in your heart. You know, like St. Paul talks about this, this notion. And then on the. On the other, as on the outside of that, you have reason and you have logic, you have knowledge. All these other aspects which are, which are, you know, which we engage the world with. And then that breaks down into foolishness. When knowledge breaks down, when wisdom breaks down, we can. We can see it as foolishness. So the same structure in terms of space, in terms of a person, is this idea of an identity, something that makes you you. And then all the things you do, all your activities, all of this. And then on the edge of your being, you have the possibility of this breaking down into a kind of madness or a kind of folly, right? So that's just how. That's just how the world works. And on that. That part that comes right up to madness or to folly is just. It's like right on the edge of death. And it's on the edge of death because if you have any identity, the Greeks, for example, the further you go from the Greeks, the less Greek you see. At some point, there's no Greek left, and then the Greeks are dead. They're dead in space. There's no more Greeks. They're gone. There are more Greeks. And so it's the same for you. You have. You, and then you have the possibility of extending into the world. But at some point there's a limit, and that's your death, and that's all of these images of the garments, of skin, all of these images have to do with this idea of death that is around us. Okay, So I hope that makes sense and it's important to understand. I know it seems very abstract, but as I start to show you the actual foolish things, you're going to start to understand why I'm talking about it this way. So it's the space of a church. It's the same structure as a church. Church has the same structure. We have. The medieval church especially, had the altar in the center where only few could go, only the priests could go. Then you had the nave, where all the faithful would gather and all the different types of people would all interact together. And then you had the narthex, which was like this transition space. And what do you have on the outside? You have the gargoyles, you have the monsters, you have the idiosyncrasies. And a lot of the gargoyles were exactly idiosyncrasies. They were foolish, they were silly, they were upside down there, there's a lot of gargoyles that I probably couldn't even show here because there was actually a lot of lewdness in some of the. In some of these gargoyles. Because that's it. That's the folly that's on the edge. Okay? So the shape of the church itself was like that. So now that can help us to understand the. Already we can start to also see the role of the fool in terms of positive. Usually the fool actually has a very negative role, right? Because the fool bothers. The fool will make you laugh. You can imagine a situation where there's something serious happening. Then there's a fool, someone who makes a joke when they're not supposed to. It distracts you from work, right? It distracts you from what you're supposed to do. That's what laughter does. Laughter is a. Laughter is a loss of control. If you can get someone to laugh, it's usually they didn't plan on doing it. You test them, you surprise them, and then they start laughing and they've lost control, right? It's a loss of your being in a way. But there's a way in which the fool can be very positive. Because sometimes that middle part, that civilization part, sometimes it thinks that it has it, all, right? Tower of Babel style, It thinks that it has the whole thing. It's got it, it's got it. We've got it. We've got the rules, we've got the structures, we've got. This is how it works. And it just plays out, right? But that's not reality. Doesn't work that way, right? That's called pride. And the fool. The positive aspect of the fool is that the fool can disrobe the king. The fool will show you the king's nakedness because the king thinks that his clothing is all powerful. So it is a kind of disrobing. But sometimes the disrobing can be good, sometimes it can be bad. It just depends. And so in our tradition in Christianity, but also in the Bible, there are inversion festivals. Those are the hardest for people to understand. People don't understand. And a lot of times, people really work hard at trying to eliminate them. Even today, there's something about the desire to eliminate them which probably makes. Is part of the bigger story. But the first inversion festival that we see is in the Bible, it's Purim. It's the celebration of the deliverance of the Jews from. In the story of Esther, everybody knows the story of Esther. Esther is hidden. She's secretly A Jew nobody knows. And then she's married to this foreign king, and the foreign king is being influenced to kill the Jews. And then finally, through her revealing herself as being Jewish to the king and telling him about this plot, then the story flips and instead of the Jews being killed, it's the men who were accusing them. So it's a turning, okay? So you have to understand. This is important too. You have to understand this wheel, this world as a giant wheel, and it's also turning and on the edge. Imagine the world as a big wheel with a spoke in the center. And the further you go out towards the edge, the faster it turns. And that's why we'll see, as you notice, carnival, all carnival aesthetic, all that is all about turning. It's all Ferris wheels and clowns doing cartwheels or whatever. It's all about turning, right? The whole thing is about turning. Oh, also, I forgot to tell you that medieval manuscripts also had the exact same structure. So medieval manuscripts had the text in the center, and then on the outside of the text, there was ornamentation and there what's called marginalia, where all the freaky stuff would happen. So in the marginality, you'd have all this stuff. You'd have, you know, like. I don't know, I mean, it's just nonsense stuff. You'd have rabbits on snails with human heads. And these could be gospels, by the way. These could be Book of Hours, it could be prayer books. I saw recently, I was shown like 14th century prayer book. And it was an image in the Annunciation. And in the border there was some wild stuff going on like that, some crazy inversion, okay? And a lot of it has to do with animals. It has to do with animals taking the role of humans. You see that you can understand it in terms of the garments of skin too, in terms of this animality that is on the edge of the Garden of Eden and that we add to our nature right upside down world where the animals are human and the human are seen as animals or below the animals. Okay. I hope you recognize some of these patterns, because if you look around today, it's pretty much all we see. The idea that human beings are lower than the animals, it seems to be something, a trope that is really pervasive in our society. So here's a tradition, here's a contemporary version of Purim. So the Jews still celebrate Purim today. And traditionally there's a saying that on Purim you are supposed to drink so much that you cannot tell the difference between your left hand and your right hand. This is like a traditional practice. And so traditional, practicing Jews who all year are extremely serious and study the Torah on one day a year, will wear costumes, will, you know, disguise themselves, will get drunk in the street, will be merry making, and all this stuff is going on. Let's wait here for now. So in our. In our. In the Catholic tradition, the Western tradition, there used to be a feast called the Feast of Four Fools. And the Feast of Fools was on January 1st in France. And then I was told it was on January 5th in England. Probably it changed in different. Different times. And the Feast of Fools was an upside down feast where they would take a beggar or they would take someone very lowly, and they would. They raise him up and crown him king or make him a bishop. And they would make fun of the liturgy. They would make fun of all these things. And it's like, I hope it's important that you feel. I see some people feeling very uncomfortable when I say that. And you should be. It's okay. It's okay to feel uncomfortable about it. But it's also important to understand that these really were things that were part of the tradition. We still have. People still have that today. We have Mardi Gras. Mardi Gras is very similar. Mardi Gras just before Lent. You know, all over the world, people wear costumes. It's very gaudy. They do all kinds of merry making, noise making. Right. Noise is the same example as. If you want to understand the same structure I gave you, you have the notion of a breakdown of logic or a breakdown of order in terms of speaking. What would that be? The noise? Noise is the breakdown of order. It's another version of the same thing. So you have people ratchets and all kinds of stuff to make a lot of noise. That is also part of the carnival aesthetic. There was also, in the west, there's also something called the Feast of the Ass, which was on January 14th. And it was on the day that they celebrated the. The fleeing to Egypt, when Mary and Joseph flee to Egypt. And in that celebration, they would bring a donkey up to the altar, and the donkey would be up the altar, and at the end of Mass, instead of saying Amen, everybody would bray like a donkey. Right, okay. So this is imagery from the Feast of Fools. If you want to see a really good representation of the Feast of Fools in the movie the Hunchback of Notre Dame, the Disney version, they have a whole scene in it where they have the Feast of Fools there and everything in it is perfect. In terms of. They show these upside down. They show these upside down characters. They show a horse with two rear ends. They show like a joker and a king that are kind of flipping. And the ones. The king, like, one side is the king, one side is the joker. So you have this turning and this turning and this merry making and this noise, this kind of this chaos. And then they take Quasimodo, who is considered to be like a freak in that society, and they elect him King of Fools, King of the Day of the Fools. And so he. He's celebrated, but then. Then he is humiliated and they. They strip him, they humiliate him. And they kind of things. They bring things back to the. To. To. To the order. Now, here's Carnival. Everybody's seen this. Mardi Gras. We still have that today. What's the last Inversion Festival we have? Does anybody. Anybody identify it in our society, you know, you're not allowed. You're my son. You're not allowed to say. Does anybody can recognize the last Inversion Festival that we have? We still celebrate it. Halloween. Halloween is the last one, right? And so it's a world of upside down, where the monsters are out of the streets and the ghosts are out. All of these marginal characters, all these freaks, all these monsters are all out. Everybody's wearing costumes, everybody's in disguise. There's a kind of praise of idiosyncrasy. And it's happening before our very eyes. And so it's the last. It is really the last Inversion Festival. We also have carnivals, traveling fairs, all of this stuff, which, when you have a traveling fair come to your town. Where do they set up? They usually set up in a vague area, like a place that's not. Obviously they have to set up in the vague area, but place that isn't used, that is kind of a useless place or an abandoned place. Not abandoned, but like a place that's not functioning so they can access that place. And all the aesthetics of the carnival are exactly. Everything of the fair, exactly what I'm talking about, right? The merry go round is the best one because you have animals on the outside that are turning, and you have the spoke in the middle and. And you have this music, and it's all gaudy and it's all ornament, all of this. All these ornaments on the outside of the medieval manuscript. Here they are in Glory in the turning carousel with all these animals on the outside, all right? And we're riding it and we're laughing. It's all there. And of course, we have Las Vegas. This town in the middle of nowhere that has no function, that has no purpose except to be a repository for our worst desires, for all our worst passions, all in light and gaudiness. And of course, the giant Ferris wheel has to be there as well. Now, let's go back over those holidays that I just told you, right? I need to go back over them because, like, I could see people kind of going, oh, my goodness, he's so good to talk. This is our world. Like, we're drowning in it. We're so gorged with it. Why is he telling us about these crazy fools? Because our whole world is just like a big fluffy cake that people are gorging on. It's like our entire world. Is that so I understand why it's like, you're like, oh, not again. Why is he talking about that? Well, we have to understand it because that's our world. We have to understand how it plays out, because we are living in a. In a nonstop carnival, right? This is our world. So we need to get it, and we need to understand the relationship between carnival and death, because it's right there in all the holidays that I showed you. When's Mardi Gras? What comes right after Mardi Gras? Next day? Ash Wednesday. What's Ash Wednesday? It's exactly that. It's death, the remembrance of death. The ash from the previous years are brought up and put up on our foreheads, and we remember death. In the Orthodox tradition, our carnival, our meat fair, is on the Sunday of the Last Judgment, same day. So we have this celebration, this kind of celebration of the flesh at the same time, this judgment that comes and cuts it off. Okay, Feast of Fools. You want to know why? Why? The Feast of Fools was January 1st. January 1st is the eighth day of Christmas. What happens on the eighth day of Christmas? Circumcision. So cutting off the flesh, it's the same thing as Mardi Gras. It's the same thing, same pattern, right? And the Feast of the Ass is a little harder to understand, but it's also the same because the Feast of the Ass is the going to Egypt. And you really. It's hard if you don't understand biblical typology. It's going to be harder for you to understand. But going to Egypt is. Is always going into death, right? It's the land of the foreigner. And that's why Esther marries a foreigner. It's also the same story. The idea of marrying a foreigner is losing your identity, right? Your identity is moving out, right? And you're Moving out into to that. And it's neither good nor bad. Sometimes it's good. You see, in the Bible, there are places where it's, you know, Moses, his wife was Ethiopian. Like, it's not a moral question. But we have to understand the. The structure. We have to understand that that's what's going on, right? This idea of moving out of yourself and that's. And that is related to death. All right? And Halloween is exactly the same, right? Halloween. What comes after Halloween? What is Halloween? It's the Eve of All Hallows, and then it's the Eve of All Souls. It's the eve of the celebration and the remembrance of all the dead. So it's all the same pattern. It just always plays itself out the same. Now, the problem today that all those people that are going to Mardi Gras in Brazil or wherever they are, they're probably not fasting after that. And all the people who celebrate Halloween are not doing the other part. And like I said, our world is. Is the carnival is the last celebration we have. But we have to understand what it leads to. It does lead to death. There's no way around it. That's what the carnival leads to. That's it. Even almost its role is to show us the limit and to show us death. Okay? All right. So hopefully now this is making a little bit more sense to you, understanding why I'm talking about this. All right? So this structure is. It's everywhere, okay? It's every once you understand it, once you see it, you're going to start to see it appear in many places, okay. When you start to understand this relationship. So I'm going to give you an example that you maybe never, ever, ever have thought of. And it's the. It's the. It's. It's the last night of Christ. And in the garden of Gethsemane. There's a joke in that story. Do you ever notice there's a joke in that story? Right? So I'll show you the joke. There is a joke there. So we have a mountain, Remember? The paradise is a mountain. We have a mountain. And then the disciples are down below. Christ goes up to pray up the mountain. He goes into the garden of Eden. He's going up to the tree of tree, to the trees. He's going into the garden, right? He's going up to pray. And he leaves the disciples below. And what does he tell the disciples? Wake up. Stay awake. Remember. Right. Remember, as you move, as you're far away from me, and as you're Far away from the center. Remember the center. Remember the garden. Don't forget the garden. But what do they do? They fall asleep. What is falling asleep? It's dying. Falling asleep is always dying. Falling asleep in scripture is always dying. Okay, so they die. Then Christ comes back down, and he's like, wait up, wake up. What are you doing? You have to remember. You have to remember. And then they don't. And it happens three times. And it's already. I mean, it's already calling out to something else. And finally, here comes the foreigners. The foreigners come, the Romans come, and they're going to destroy this thing. Here's Christ, the 12 disciples, they come and they scatter the apostles. Everything's broken. And while they're doing that, what happens? Where's the joke? As one of the disciples is running away, one of the Roman soldiers grabs his clothing and he runs away naked. Right? Okay. Right. That's. That's it. That's the same thing. Everything that I've been telling you, this is the same. Same thing, same. Same structure. Okay? Now, the problem with this, it's not the helter skelter, it's not the church. It's that the helter skelter's in the church. That's the problem. The problem is not the fact that these things on the edge are there. That's part of the structure of reality. The problem is, where do you put them? Where are they? This does not belong. This belongs in a carnival, does not belong in a church. We've lost our capacity to see the hierarchies of things. One of the problems is that because we don't understand, let's say, where this type of thing belongs to, then we don't know how to react when we see it in a church. It's like, well, you know, God wants us to be happy and wants us to laugh, and God wants us to be merry. So why not have a spinning slide down, you know, no snakes and ladders. There's that snake going down. It's basically. There's an image of the Last Judgment in the Orthodox tradition, where there's a snake which goes all the way down from Christ into hell. And there it is right there. It's like sliding down. All right, sorry. I'm going to stop being sarcastic here for a second. All right, so now this is all that's left, right? The carnival is all that's left in our culture. You can understand it that way, too, right? You have white light, and it breaks down to many colors. There are many ways to represent the very same structure. And that's it. That's our world right now. How do we. How does it flip? How does it. How does the fool play the role? Because a lot of you, A lot of you love English. A lot of you have read Shakespeare. We. We were talking about this. And how in Shakespeare plays and a lot of tropes, you have the fool who reveals the truth, the fool who actually reveals the thing, the secret or the thing that other people are hiding. But that only happens. It only happens in an upside down world because the fool is turning. The fool is turning. Then when things are upside down, he's not going to stop turning. So when things are upside down, he's just going to turn them right side up. So we have to watch the fools. Especially right now. I always tell people, watch the fools, because when you see something like Kanye west, what happened there, it's like that's exactly the type of thing that you're going to see happen more and more. These foolish characters that are going to flip and going to bring back kind of this normal order by doing it. So the key to starting to understand this is in the story of King David. King David is one of the clearest places where you see this start to flip. Now, this is the secret, right? This is the secret that Christ is ultimately going to reveal to us. Yeah. Which is that if in the garden, glory was changed into death. Right. The nakedness of Adam and Eve was changed into an image of death, then death can be changed into glory. Right? And that's. You'll see, that's what Christ is doing. Christ is turning the world back, taking the fall, flipping it on its head. Right. Taking everything of the fall and bringing it in a way that actually works towards our salvation. We start to see that a little bit in the story of King David. A lot of people don't know the story of King David because it's so crazy that people actually pretend that they know the story of King David, but it's a crazy story. Read the story of King David. Seriously, it is wild. King David is the fool who became a king. And you see it in his story. There's a scene in his story where he acts insane. There is a scene in his story where. Where he pretends to be working for the foreign army. There's a scene in that story, in his story where also he marries other people's wives, right? All his wives are other people's wives. So he's marrying the foreign woman, the one that Solomon is warning you not to marry, like David marries those women. But for some reason, there's something about his character that is able to flip that into something else. The wildest story of King David is the one where you can almost. You can see at the clearest. And I'm sorry that I'm gonna have to talk about this, but we. You did come to a talk that had the word fool in it, so we're going to have to talk about this. So there is a story where King Saul is going on the road, and he has to stop. He has to stop. He's got to go. And so his men are like, what do you do? And so he goes down into a cave. Now, what is going down into a cave? And, yeah, it's like sleeping. Going down into a cave is dying. It's always dying. Okay? So King Saul goes down into this cave to do his business. In the scripture, they call it covering his feet. That's how they call it. I don't want to think about it too much, but so turns out David is in the cave. David's in the cave. And so he sees the. The king there doing his thing. So he sneaks up behind him, and he cuts a part of his cloth, and he just. He cuts a part of the fringe of his vestment, and he keeps it, right? So then King Saul, you know, gets out of the cave, and then David brandishes the. The fringe of his vestment. Okay? Now, you really have to understand what this is really trying to show you. Like, he's brandishing the fringe. He's brandishing the thing on the edge, and he's showing it to Saul, and he's basically disrobing the king. That's what he's doing, right? He's taking a piece of his clothing. He's showing. He's humiliating the king. He's showing the king's nakedness to everybody. And Saul finally lets him go. Saul lets him go. And ultimately King David will end up replacing the king. He will rise up and become the king. But you see that structure is right there. I hope you can you see it that it's the same. There's the nakedness. There's this. This shame, you would call it, right? There's shame, there's nakedness, and there's this moment where he actually takes it and he shows him. Like he. Here's your thing, right? So, like, sorry, but so we have the poop emoji, which is everywhere. That's our world. The poop emoji is our world. We have to understand it, okay? If you Want to understand the poop emoji, why it would be happening right now and it would be everywhere is because if you understand these stories, you can understand why it's happening. You won't be surprised. You can see it as a problem in our society, but you won't be totally surprised that as you come to the edge of the world, one of the things that's going to happen is going to be scatological references. And those are going to become pervasive in your society. It's just inevitable, right? It's the fringe showing itself. All right, all right, so. All right, so the next story. I'm going to tell you one more story about King David and then we'll get something else. The other story of King David which really, really shows this pattern and how it flips is the story of him and the Ark. Everybody knows the story, right? So David danced before the Lord with all his might. And David was wearing an ephod. Do you know what an ephod is? Right. An ephod is a, is a, is a cloth. And they don't know how exactly it was used. It had stones on it, but it was used for casting. Lots of. It was a tool of divinization, like throwing bones. Like, you see, they throw bones and read the bones. That's what the ephod was for. It was a tool of divination to know the will of God. So he's wearing a. So you have to understand again, one of the things that the breakdown of order looks like is lots, right? Because if you get money, usually it's because you work. There's a way to break that is to use chance. Go to Las Vegas, right? Give yourself into the wheel of fortune, this turning wheel. And then maybe that wheel is going to put you on top. Who knows? You don't know. It's lots. It doesn't make sense. It's not part of the re. It's not part of reason. It's a breakdown of reason, okay? That's what lots are. And so he's wearing this ephod and it seems like he's disrobed somehow. Like he's maybe just wearing the ephod. We don't know. Like, it seems like he's disrobed and he's dancing, he's merry making in front of the ark. Now people will tell you charismatics will use this, you've heard it probably use this verse to, to justify their thing. But if you know the story, you realize that this is very exceptional, that this is Exactly. This weird moment of turning when the fool is going to become the king. And so you have this turning moment where he acts the fool in front of the ark. He's wearing this ephod that's used for casting lots. And so the daughter of Saul says, look, read the language, read the language. So she says, how glorious was the king of Israel today, uncovering himself today in the eyes of the maids and his servants, as one of the base fellows shamelessly uncovers himself. Okay, so she's being ironic. She's saying the opposite of what she's saying. Now that's important because that's a joke, right? That's a clown. That's our world irony. When order breaks down, one of the things that happens is that when you say something, it's the opposite. And there's this strange relationship of meaning which is not direct, this kind of indirect upside down turning of what you're saying. And what is she saying? She's saying, how glorious was the king? Remember what I told you about Adam and Eve in the garden being naked? What was it for them? It was glory. And now she's making fun of him. She's saying, you are making yourself glorious by uncovering yourself. But she's ultimately saying, shame, like a shameless person. You're full of shame by doing this. But here, this is the flip that's happening. Her irony is actually turning back on itself. And it is to his glory. It is to David's glory that he was doing that. So you've got something. She's turning it upside down and it's turning back right side up. Can you see it in the statement? Okay, so this is that. This is it. This is the thing turning upside down. And then the fool can turn it right side up. This is a. This is a perfect example of this. Now, ultimately, this will lead us to this story particular leads us to Christ, because that's exactly what happened to Christ. That's exactly what happened to Christ, right? Christ was disrobed, he was humiliated. He was ironically declared king. But what happened? Turn back, right? That crown of thorns became a crown of glory. Turn back. And you have to understand this is very profound because the crown of thorns, that's the result of the fall. God said to Adam and Eve, if, when you fall, the world will produce thorns, was the very result of their sin, was this hostile exterior, right? This exteriority that has spikes on it that can hurt you. And then Christ turns. That turns the very result of the fall into glory. So everything they said about him when they said hail the King. When they put that sign above his head to say, the King of the Jews, they were. And in the end, they were actually telling the truth. It was turning upside down twice, making it ironic, and then flipping back right side up. And so that's the ultimate fool, the ultimate role of the fool. And we see Christ embodying that role perfectly, where the disrobing of shame gets turned into the glory of paradise. And you have to understand so much of our tradition, so much of Christianity is about that. And if we don't understand it, then we look like at some point we don't know what to say when someone tells us, like, what's great about some guy getting eaten by a lion in a circus in Rome? Like, you think that's great. That's not great. That's stupid. It's horrible. It's horrible that you would get eaten by a lion in Rome and get desecrated and humiliated and all that. If we don't understand how that turn happens, then we're not going to be able to understand our own traditions. Why is it that we think that to be humble and to accept humiliation is good? That's the game that's happening. So when you see characters like St. Francis, and it's interesting because there's a trope right now of people wanting to say that he was the troubadour for Christ, that he was a fool for Christ, and you see the same thing. St. Francis does the same thing. What does St. Francis do with. When he embraces his mission? He disrobes himself. Right. And the thing that's really important to understand, it's really important to understand for us as traditional Christians, is also not to confuse those extremes either. Most people who disrobe themselves in public are not holy fools, okay? And we really have to be able to tell the difference because seriously, we're in a world that is so mad that people might say that a stripper is like our saints. All right? So the world is crazy enough that it can happen. We have to be able to tell the difference between the two. Okay? And so when we look at these figures, like these turns, these fools that are now somehow wanting to show us reality or bring back order, we shouldn't be surprised. It's going to happen more and more, and we need to. As the world devolves more and more into this world of kind of mad carnival, it's actually the fools that are going to turn it back. We need to pay attention to see who are those holy fools and not just Regular fools. So I think I've said enough. I hope that this was food for thought. I think we're going to do like. I think we're going to do dessert first. And then if you have some questions, please write them down on the piece of paper that you have in front of you. You can drop them into this bin over here and hopefully those questions won't be too difficult for me. Talking about fools is very tricky, you know, so. Thank you. All right. And so the first question is, do you intend to wear your bow tie at future speaking engagements? Very curious where that question comes from. I don't know. I would have to. I'm afraid that when I. It's like, you know, things in Saskatoon stay in Saskatoon. I think that's what's going to happen. I think when I go back home, it's kind of like Las Vegas, but it's Saskatoon. All right, okay. So I could be convinced. So we'll see. Who knows. Why do you suggest we should watch for the Fools? So we can leverage their effect, help them flip things upright again or only for our interest and enjoyment? I think that. I mean, the case that I'm talking about, it's really so that we can notice the moments where our culture is turning towards, at least ultimately turning towards Christ, turning right side up. And so that we can also bolster that. We can encourage that and help that. That is my. You know, because the fool can do and can do it on his own. The fool will just. The fool will just operate the flip. But usually the fool is not the one that's going to build things afterwards. There are exceptions, like I said, the greatest fools, that's what they do. King David is exactly that. He was the fool, but he also brought the ark to Jerusalem and then planned the temple. And St. Francis was told to rebuild the church. So there is a possibility. But most of the time we'll need to get things going around the fools. In 2006, there was a film of Russian language called the Island. It was a modern portrayal of the holy fool. What are your thoughts on the Russian tendency to honor holy fools? Have you seen the film? Yes, I have seen the film. I really recommend it. It's a great movie. I think you can even find it for free on YouTube. It's called the island, or Ostrov, I think, in Russian. It is a really wonderful story. And you really do see the role that the fool does in shaming people into, let's say, you know, into repentance, something like that. And it's definitely Worth seeing. There's also a book called Loras that was written recently by a Russian author that deals with the story of a holy fool. And in that story, if you read the story, you'll see that the author is extremely. Understands the tropes himself because he'll talk about these monstrous races on the edge of the world. He talks about Alexander the Great building a wall in the northern world to stop these monsters from coming in. So he seems to really understand the relationship between the fool and these other stories and other tropes that are there. It's called Loris L A U R U S. Do you think that there's hope we will have more Saint fools who will help to turn this crazy world upside down or right side up? I think so. I do think that we're already seeing it happen, and I think it's going to happen more and more as the world becomes more and more mad. Then the fools will be the ones that will kind of show us a way out. So we need to pay attention. We need to be careful because some of the fools are just fools. We have to be really careful because in the world of folly, it is sometimes hard to discern the. The holy fool. But the Holy fool is flipping. That's what he's doing. He is flipping things. He's working to the salvation of others. Do you know if anyone has written a theology of humor? If not, have you considered writing one? I don't know if someone has written a theology of humor. I imagine if they did, it would probably not be very. How can I say this? It would probably be very subversive, honestly, especially in our modern day and age, I don't think I would write a book like that. But if you want, I have several talks that. On my YouTube channel that address that. I have a talk called the End of the World and the Purpose of Laughter where I talk about some of the similar things that I talk about here and expand on different aspects of it. Is there a role for us then in being fools to set the system right or critique it? Or is this a specialist role? I would suggest to not play that role because it's a very dangerous thing to do. It's very dangerous for your soul, and it's very dangerous. It's a very dangerous thing. The Holy fool is a very dangerous character. He is. You know, if you read the book Laris, it's really worth reading because you really do see this holy fool and you see that, no, you don't want that light. Like, you don't want to accept being the butt of the joke because that's the thing. One of the ways maybe you can see the difference between a fool that is useful and a fool that is not useful is the fool that is not useful usually is just making fun of other people. And the fool that is useful usually that turns then back on himself, right? And so the proper clown will tricking be tricking people. But on the end he slips on his own banana peel and he falls like that's the proper clown. That's the clown that actually the full turn clown. Okay. A lot of the foolishness that we see around in the world right now is actually. Is actually extremely kind of like this angry foolishness that is. Wants to accuse the. Wants to accuse the system, you know, of being the oppressor of doing all that and all of this and all this. But the. The real fool or the full fool doesn't do that, doesn't accuse the system. He makes fun of it and then he realizes that he's actually can't avoid being part of it, so it turns back on him. There are several cultures. Like in Native American cultures, they have these fools as part of their actual rituals. Like the fool is actually has a function, especially in the desert. Native Americans in the US the desert, the plain Indians, they had. It's called the Hekoya, which was this character that would in rituals would come to the rituals and would pass gas and would like start saying stupid things just to distract. He was acting in a way to show the limit of the ritual. To say this ritual isn't all encompassing. And so you have that. But they're not there to destroy the ritual. They're just there to show the limit of the ritual. To show that it doesn't encompass everything anyways. Do you have any advice to help us recognize the holy fool versus the regular fool? I think that's a big one in terms of accepting to be humbled is one of the biggest aspects that you'll see in a holy fool. And like I said, it usually ends up turning things. It's hard because you, you. It's so popular right now to criticize authority. Like everybody does it. It's just. It's just. It's become normal. It's become. It's come normal to criticize authority. And so the holy fool would probably end up doing something different. Would criticize criticizing authority or something like that. And then it would turn. So I don't know when I see it, I like when I see one, I can point you to them. Like I think I think Kanye west is playing a role that's coming close to it. Like the way that he's. He's. He's flipping everything and the way he's doing it is very. It's kind of funny also because he's just. The idea of naming his album Jesus is King and knowing what it's going to do and forcing people to say it, and it's kind of humorous, but it does what it does. All right. King Cyrus was not a believer in the God of Israel, yet he was prophesied 200 years before he was instrumental in the return of Israel from captivity. Was he a fool? No, I don't think that. I don't think that in this case he would be considered a fool. There's a figure. There's a figure in storytelling which is kind of the. In a. How can I say this? There are several. There's not just King Cyrus. Even the king in the story of Esther also plays a role similar to the King Cyrus, which is the good. It's like the good foreigner who helps to bring back order, but it's not necessary. He doesn't necessarily act in the same way of a fool. It's not. It's not. It's a little similar because he's a foreign king. So he's not part of us. He's this thing outside and he's saying he's helping to restore that which is inside. In the story of Elijah, you have that quite a bit. Elijah does. Elijah is called the stranger. His name, Elijah the Fizbet, means Elijah the stranger. And he's coming from. And he's coming as a stranger in an upside down world anyways. But it's not exactly like the fool. It is similar, though. It's a good insight that you had. Whoever wrote that in Russia, they used the term holy fool. Wasn't it just a common mentally deranged person who happened to exist in the community that was referred to? How does this relate? No, I don't think so. I don't think that it's just a mentally deranged person that happen to exist. I think that there are tropes about the holy fools that might look like that. You see the stories of people pretending to be crazy in the hagiography where they pretend to be crazy and then someone catches them in their house and they're praying or they're being completely normal. And so you have this idea of pretending and playing. Now, is it possible that someone who is mentally ill could play the same role as a holy fool for A community? I think so. I think so. Because one of the reason why we have exceptional people, people who are mentally ill or people who are handicapped in certain ways or even mentally, mentally handicapped, is also to show us the limit of our reason, to show us that we don't. We don't. We think that being able, being smart, being all this is all. But it's not. And then you see, sometimes you see people who are mentally handicapped help have this beautiful, innocent joy that is just amazing. And they're the ones who are supposed to be lower on the hierarchy, but in the end they have this kind of boyish real life in them. So I think they can play the role and show us the limits of our work, of our structures, because they have this innocence. So I think they can play a similar role, but it's not exactly the same. I don't think so. Is Trump a figure of the fool? This is related. It's definitely related. It's hard not to see that it's related just his name. It's hard not to think that the joker card is the trump card. So it's not completely unrelated. I don't know. It's hard to tell. I say the jury's still out on him, let's say it that way. So where does Satan fit in all of this? I don't know. I mean, I think Satan. Satan is the. I mean, Satan is the one who opposes, is the one who divides. And so you could see Satan as the. One of the causes of this fall, of his breakdown and everything, but. Sorry. Yeah, then it turns back on him. Exactly. Yeah. That's a good call, Father. Yes, that's a good call. So those who didn't hear it, he said Satan, what Satan does is he accuses, but it never turns back on him. And so he does play that role of criticizing the authority, but he's not able to see himself also as the butt of the joke. And so he doesn't end up playing this role of the holy fool. It is not the case that ever since the fall of man, humankind has been in a state of carnival. In what respect are our times different? No, I don't think so. I think that there are cycles and that there, if you read in Scripture, you see that there are these cycles where God reveals himself and God pulls people together, pulls Israel together, and. And creates this image of the glorious city, let's say a little image of this final possibility of all things coming together. So you have these moments where this happens and then it kind of falls apart. So it's like, you see these cycles in the story where it moves from holy times to these kind of broken down times and then these upside down times. And so you see these cycles. And I think that the fact that we integrate the carnival in our. That traditionally you would integrate the carnival in the normal liturgy. And that's something that I maybe didn't explain very well too. It is the fact that we also have the carnival in the pattern of reality is related to Sabbath somewhat. It's related to the idea of work and then a day of rest. And so it's not exactly the same in the sense that, let's say in the holiest version of it, we necessarily have this upside down thing, but Sabbath is a little image of death. We can't avoid it. That's why when we talk about Christ's day in the tomb, we say that it's the great Sabbath. In the Orthodox tradition, we have many hymns that talk about that this is the great Sabbath, that Christ's day in the tomb is the man showing us the glory of the Sabbath. What the Sabbath. Sabbath could be. And so there is a relationship between this day of rest or this, this last day that doesn't. It's not work. This residue, all these images, there's images related to. I always talk about the idea that you have to leave a margin. And you see that in Scripture all over the place where they talk about the fringe of the vestment. You have to have a fringe on the edge of something, have to leave it a little bit wild. You have to leave the corners of your field D Don't plow all the field. You need to leave the corners of your field for the foreigners. And it's all related to this. You have to leave a little bit of space for chaos. And if you don't, if you try to encompass everything, then chaos comes back with a baseball bat and it's like, we're done with this. And then the whole world turns into a carnival. One of the reasons why our world is turned into a carnival is because of modernism. It's because the Enlightenment thought that it could encompass everything, that the world of science thought that it could completely fill up all knowledge and all understanding. But that's not true. There's always a buffer, there's always a margin, there's always a residue, there's always a remainder. You can't get rid of it. And so because they pushed so hard to stop this, it flipped back. And now everything is remainder, everything is residue, everything is carnival, right? And so we need to Be careful. Because as, as traditional Christians, we see, let's say, these images of these chaotic things, and we might feel a little disgusted by it because we're so surrounded by it that we're like, no, we're going to be traditional Christians. We have order, we're going to have prayer, we're going to have. We're going to have these hours and everything. We're going to follow the calendar and all of this. And it's important. But the traditional Christians did celebrate Mardi Gras. The traditional Christians did celebrate these Feast of Fools. Because you need. It's part of reality, right? You just need things to be in the proper place and need in their proper measure. Right? That's how, that's how you know that the world is working. You know, you know, you want ornaments on the outside of the church, but you don't. Or you want ornaments, but you don't. It's like you, you eat something, you can have spice on it, but you don't eat spice, right? So you don't just shovel spice into your mouth. And you also don't do the same with ornaments. You have ornaments that decorate a building, but it's a decoration. The whole building can't be ornament, right. Can't be this fringe. Right. So, yeah, so I think that's done with those questions. I hope this was useful for people. Thanks for coming."}
{"episode_id":"SW - #091 - 2020-02-11 - The Fool in Scripture and Culture","start":4138.54,"end":4203.28,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageot videos as well, and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
