{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":0.96,"end":85.39,"speaker":"Jonathan Pageau","text":"On this episode of the Symbolic World podcast, I am playing for you an interview that I gave at Wycliffe College for a special event. In it, you will find a little bit of my story, a little bit of my opinions about art and about its place in the world, especially in a world of faith. This is actually a podcast exclusive. I've never put this out as a video because I didn't have any images. And so now I just figured that I'll put it out for you guys as a special event on this podcast. As you know, everything I'm doing here online, this podcast, my videos, and everything is possible due to the support that people are giving me. So Please check out www.thesymbolicworld.com to see how you can support this podcast. For those who do, I give some perks, like advanced views of videos, possibility of participating in monthly Q&As. And so please check that out and don't forget to share, to subscribe, and also to leave a review wherever you listen to this podcast. And so please enjoy this discussion I gave. At the University of Toronto, Wycliffe College, this is Jonathan Pageau. Welcome to the Symbolic World."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":95.78,"end":124.27,"speaker":"Jonathan Pageau","text":"Jordan Durstein is associate pastor at the Meeting House downtown and also a student here at Wycliffe College. And I'm really happy tonight that we were able to get Jonathan Pageau. He's an author, speaker, and artist. And. And he'll share a little bit about his life and things that he's really passionate about. And we're really honored to have him here today. And so I'd just like to welcome you to tonight."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":124.75,"end":144.31,"speaker":"Jordan Durstein","text":"Very good. Welcome, everyone again. And a special welcome to Jonathan. So, Jonathan, we're just to put everything in a bit of perspective. Now, you are an orthodox iconographer, but that is not the tradition you grew up in or where you started. So you are Canadian?"}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":144.71,"end":146.07,"speaker":"Jonathan Pageau","text":"Yes, French Canadian."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":146.15,"end":147.35,"speaker":"Jordan Durstein","text":"And you grew up where?"}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":147.67,"end":166.87,"speaker":"Jonathan Pageau","text":"I grew up in the Eastern Townships of Quebec. So Sherbrooke. That's where I grew up. But I also moved around. My father was a Baptist minister, and so I lived in Wheaton because he went to study in Wheaton College. And I also lived in Denver, where he went to Denver Seminary. And so I. Yeah, so I've lived a little bit all around."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":166.87,"end":167.87,"speaker":"Jordan Durstein","text":"Very cool. And there's you."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":167.87,"end":168.71,"speaker":"Jonathan Pageau","text":"Baptist church."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":168.71,"end":170.23,"speaker":"Jordan Durstein","text":"That's where you grew up. That's where you're from."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":171.21,"end":174.37,"speaker":"Jonathan Pageau","text":"And then after that, what happened?"}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":174.37,"end":175.13,"speaker":"Jordan Durstein","text":"What happened?"}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":175.61,"end":179.37,"speaker":"Jonathan Pageau","text":"How do you go from, you know, a Baptist boy, pastor's kid, to being."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":179.69,"end":181.21,"speaker":"Jordan Durstein","text":"So tell us a little about your Story."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":181.29,"end":513.74,"speaker":"Jonathan Pageau","text":"All right. Well, I always want to blame it on my father because my father was actually a very thoughtful person. And, you know, I was. I mean, in the Baptist. In the fellowship Baptist churches where I grew up, it's very conservative. It's very kind of literal. But my father was more. He was very thoughtful, and he brought that culture into our house, and he was always asking questions. And so we grew up in that atmosphere, my two brothers and I. And so I. When I was a teenager, I was in youth groups, and I wrote several plays, which we did, like, these tours around Quebec where we would evangelize with these big plays, like 30 people. Jesus plays? Yeah, like, Jesus plays with music and stuff. But I was. I studied art. I went to school to study painting at Concordia University in Montreal. But the whole time I was at Concordia, it was just a huge struggle for me. I did really well in terms of the academic part. I finished first in my program. But the whole time, I just was struggling to find a way to match my faith tradition or growing up in a kind of Baptist evangelical church, which is. Which is not fully aniconic. You know, they have. You know, they won't, like, they'll have books for children with images of Jesus, but for sure, not in the church. And in general, there wasn't. Imagery was not part of the tradition. And so I was just struggling to find out, how do I match these two things together? And it ended up becoming the subject of my work. So all through my undergrad in painting, I was basically trying to work out what it meant to be a. First of all, a Christian, second of all, a Protestant and an artist, all of those things, a contemporary artist as well, bringing all that together. And so I was just struggling. I came up with all these images that I created, like, this kind of symbolic language where I had different images which would represent different aspects of the tradition or the Bible, and put them next to each other. I had, like, the Tower of Babel and the bronze serpent and all these images of human building, but then also falling down. And so, anyways, it was just a huge mess, really. And in the last year of my time at Concordia, the very last evaluation, my professor sat with me, and she said, first of all, I want to tell you, you've got all A's, like, don't worry about it. You know, you're fine. And then she said, what are you doing here? It's like, I'm finishing my degree. And she's saying to me, what are you doing here? She said, you should go. Go to Seminary or something, because this is just not the place for you. She was right. She ended up being totally right. It's probably the best advice that anybody had ever given me. I tried to be a contemporary artist. I opened a studio with some friends, and we were working and we trying to do that contemporary art thing, but I just couldn't get it to match. And at the same time, I was going through the spiritual crisis of feeling like there was something lacking in the. In what I'd grown up in. You know, in college, I'd read philosophers. I started to look into different mystical traditions of other religions. You know, reading Buddhist texts, reading Gnostic texts, reading Hindu texts, Sufi text, and thinking, wow, this is amazing. Like, you know, this is so beautiful, this whole transformation of the person, this bringing the person into the light of God. I was like, this is just so beautiful. And I thought, why don't we have this? And then I found out that we did actually have that. It's just that I didn't. In my particular context, we just didn't have it in that particular context. And so then I started reading the Church Fathers and just fell in love with St. Gregory of Nyssa especially, but also St. Irenaeus. Just a lot of the. Just the early Fathers, the Cappadocians especially. And all through that, it was all kind of shaking in my mind. All this was shaking in my mind. Finally, I just destroyed all my. And I just stopped making art because I just couldn't. I just couldn't get it to jive. And at the same time, I discovered traditional kind of Christian art, medieval art, I would call it. So if you had gone into a church in the year 1000, if you had gone into a church in Spain or in Armenia or in Syria or in Jerusalem, you would have seen essentially the same thing. You would have not seen exactly the same thing, but you would be able to find your way in the visual representations that you saw there, visually in terms of the paintings or the mosaics, but also in terms of this way the space was laid out, the hierarchical space that the church was made in. And so discovering that language, I felt like, this is what I've been looking for my whole life, this beautiful language that was kind of there, which was a visual semantics. It was like a visual algebra where you had all these images that had been slowly kind of brought up in the church and were put next to each other in different images to create a language, really a visual language for Christianity. And then again, I thought, like, okay, but why doesn't this exist anymore? Like, we don't have that anymore. It's gone. And then I realized that, no, it's. It's still alive in the Orthodox Church. So all of that, the mystical aspect, discovering also hesychasm and the Jesus prayer and just the whole hesychasm, I'm going."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":513.74,"end":519.26,"speaker":"Jordan Durstein","text":"To hold on to some things that some people, like, I don't know. You don't know what hesychism is, so please explain."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":519.82,"end":675.3,"speaker":"Jonathan Pageau","text":"So hesychasm is the mystical tradition in, let's say, the East. And what it is, it's the. It's a process of deification or theosis. Theosis, yeah. And so it's the manner in which the person enters and is united to God, we would even say, becomes God to the extent that that's possible without not being created, without stopping to being a creature. And that process. There's a whole moral aspect to it. There's also a prayer aspect to it. There's repetition of a prayer. There's breathing, there's the heartbeat. There's this whole mystical tradition which was very much alive, you know, in the church up until. In the Orthodox, up until the 19th, you know, 20th century, you know, maybe Communism smacked it a bit around, like all of Christianity, but it's alive now again in Athos and in Russia. And so discovering that traditional. Any of you have heard of the. Of a book called Tale of the Russian Pilgrim or the Pilgrims? Yeah. So that book is a very good introduction, a good introduction to the hesychastic tradition. And so discovering all of that. And then also, just as an artist, seeing not only the painting, not only the icons and the language that was there, but how the visual language of the icons related to the architectural language of the church, related to the liturgy that was performed in that church. And so the whole cycle of feasts during the year, they each have their icon, and those icons are placed strategically in the church according to the directions of the church, according to the hierarchy of the space. So there's this just cosmic language, basically. And what it is, what I discovered that it is. It's really like a laying out of the structure of reality in a phenomenological way, in the way in which we engage in stories, it just lays out this beautiful pattern, just this amazing pattern which goes from the singing to the images to the architecture and all of that. And so to me, discovering that was just. I mean, as an artist, as someone who loved beauty, as someone who was looking for a visual language his whole life, I just said, this is. I'm going to make this mine. And I want this. Like, I just want this. And so then I just started to read and read and read and read Modern Orthodox theologians and then read Church Fathers and just kind of for like."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":675.3,"end":677.7,"speaker":"Jordan Durstein","text":"Two years without a seminary."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":677.7,"end":733.37,"speaker":"Jonathan Pageau","text":"No, but also that's also like. That's such a. I was still very Protestant. It's like, people tell me, like, why don't you just go to an Orthodox church? Like, no, no, I have to read. I have to read all these things. So I just read and read and read and. And then finally I was able to get a contact to some Orthodox church which was in English. And he said, why don't you come? And it was during Lent, and it's what's called a pre sanctified liturgy, and it's an evening liturgy, and it's also. It's a penitential liturgy. And so during the liturgy, you're like. You're like going down to the ground, like your forehead on the ground, you know, so many times during the whole liturgy, and it's dark, and there's just this whole penitential feeling to it. And I thought, like, I just thought, okay, this is it. Like, I'm home. This is just amazing. So experiential, but also so reverent towards God. And so that was it. And then, from then on, it was just like a question of time, was just slowly going through the steps and. Yeah, but when I walked into the church, I kind of."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":733.37,"end":737.45,"speaker":"Jordan Durstein","text":"I just knew, like, the visual language of everything that was there was."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":737.45,"end":839.66,"speaker":"Jonathan Pageau","text":"So it was more than that. It was the integration, really. I think it was the integration which I felt that I had been lacking. There's an arbitrariness to the manner in which things were done in the churches where I grew up. Whereas in the name of freedom and in the name of also connecting to contemporary culture, there's also a banalization of the sacred and a kind of schism between the form and what is said, between the manner in which we worship and the fact that we're worshiping God. All of this, I felt, was finding this beautifully integrated thing. Because what I come to realize is that things actually do have meaning. Things do mean something in our human relation to it. If the pastor in the church is wearing a Roman collar, or if the priest is wearing a Roman collar, that's means something, it's saying something. But if the preacher wears a T shirt and ripped jeans, it's also saying something. And the question is, what are you saying? And you can't avoid that. You're saying Something you just can't. You can't go up in front of people, be the focus of attention of hundreds of people. And the manner in which you comport yourself and the manner in which you look not say anything. It will. And so it's that. All of that kind of realizing, if we're going to do something, can't it be connected? Can't it be connected to Scripture? Can't it be taken from the Psalms? Can't it be brought, bringing all of this together? Some people don't have that experience. I can just say that's what. That was my encounter in the church."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":839.66,"end":845.26,"speaker":"Jordan Durstein","text":"Because I was going to ask you, like, if you hadn't come on this journey, if you had, you know, that experience that you had."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":845.26,"end":845.58,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":845.58,"end":855.61,"speaker":"Jordan Durstein","text":"This crazy Lenten service. There's this very experiential, very physical too, along with the whole artistic surrounding that you're in. If you had had that 10 years."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":855.93,"end":876.01,"speaker":"Jonathan Pageau","text":"No, I wouldn't. I wouldn't have seen it at all. I wouldn't. I wouldn't have been able to encounter it. I think there was just this long process that kind of brought me to that. To that space. But, yeah, I agree, it's not. And liturgy is not. It's not easy. Sometimes there's a different kind of joy which. Which seeps in. Let's talk about art. Yeah."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":876.29,"end":882.45,"speaker":"Jordan Durstein","text":"And the art that you do and how. How that came about. You are an iconographer, sculptor."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":882.53,"end":886.85,"speaker":"Jonathan Pageau","text":"Yeah. Carver. Carver. Carver. So how did that happen?"}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":887.65,"end":889.41,"speaker":"Jordan Durstein","text":"How many of those are there here?"}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":889.49,"end":898.13,"speaker":"Jonathan Pageau","text":"Oh, I am pretty much the only one in North America. I would say not. There's two, I think, in Western Europe."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":898.13,"end":898.57,"speaker":"Jordan Durstein","text":"Okay."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":898.57,"end":898.93,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":899.09,"end":901.49,"speaker":"Jordan Durstein","text":"So this is a very. There's not many things."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":902.05,"end":904.46,"speaker":"Jonathan Pageau","text":"It's a very niche thing. That's right."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":905.58,"end":907.42,"speaker":"Jordan Durstein","text":"Like one of ten in the whole world. Right."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":907.74,"end":913.74,"speaker":"Jonathan Pageau","text":"Well, in Russia and in Greece, for sure. In Serbia, there's a lot more. There's. There are monks. Monks, you know, doing that kind of stuff."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":913.9,"end":915.42,"speaker":"Jordan Durstein","text":"But, yeah, so how did that come about?"}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":915.42,"end":967.2,"speaker":"Jonathan Pageau","text":"How did that come about? So, so, okay, so I thrown away all my art. I just destroyed it. And I'd let go of my studio. And, you know, I had actually told my wife, I said. I said, I'm not ever going to do art ever again. She probably wasn't happy. I'm just going to be like a normal guy. I'm going to go to work in the morning and that's just going to be it. That's going to be my life. And my wife, she just laughed at me. You don't know yourself Jonathan. And so when I discovered iconography, when I discovered the icon and the language, I was like, this is it. I've got it. I found it. This is what I'm going to do. This is what I have to do. But the problem with icon painting is that it's very difficult to learn. It's extremely technical, and it's using egg yolks and raw pigments and. And it's very, very difficult to learn on your own. It's almost impossible. Some people have done it, but it's very, very difficult."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":967.2,"end":968.36,"speaker":"Jordan Durstein","text":"Can we just pause for one second?"}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":968.36,"end":968.72,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":968.72,"end":973.64,"speaker":"Jordan Durstein","text":"For anyone who has no idea of what an icon is, could you give a quick."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":973.64,"end":993.61,"speaker":"Jonathan Pageau","text":"What's an icon? Wow, that's going to be a big loop there. Two sentences. Two sentences. Well, okay, so an icon is a sacred image which participates in the liturgical life and prayer life of the Church. I would say that that would be the best way to describe what an icon. I'll give you a few more seconds. All right."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":993.61,"end":994.05,"speaker":"Jordan Durstein","text":"Okay."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":996.37,"end":1005.49,"speaker":"Jonathan Pageau","text":"So there is. In the history of the Church, you guys are all seminarians. You probably all know this. So in the history of the Church, there was a. Everyone."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":1005.81,"end":1007.33,"speaker":"Jordan Durstein","text":"Not everyone here, not everybody."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":1007.49,"end":1216.87,"speaker":"Jonathan Pageau","text":"Okay. So in the history of the Church, there was a war which was fought, actual physical fighting for images and against images. And so when in the. In the seventh century after Islam kind of exploded and took up, you know, just all of the east and then all North Africa, just in, like, in a hundred years, the Byzantine. The Byzantine Empire started to shake. And one of the reasons, it seems that they thought maybe the reason why they were losing all these wars was because Christians had adopted images and the Muslims didn't have images. Right. They were against all forms of representation, especially at the beginning. And so that became like a theological question. Should Christians have images? And if so, what are they? And how do they function? How do they function theologically? How do they function in the Church? Like, what are they? And so the debate lasted for a century. It was rather bloody, actually. But the end of it, the resolution of it was an incarnational argument, which is that we do not represent God because God is invisible. If God gives us an image, we represent his image. We represent the image that he gives us. If we don't represent the image that God gives us, then we are denying an aspect of the Incarnation. We are, in certain ways, pretending that a very important aspect of the Incarnation, which is that when you see an image, even if you see an image in the child's book, you can say, your child asks you, hey, Daddy, who's that? And you say, oh, that's Jesus. You can do that. And that fact, that ontological fact, which is that the possibility that God gave us an image and restored the image of man which he had created him in his image in the beginning is an aspect of the incarnation. And so it has to participate in our. It has to participate in our life. In a way, it's almost like an answer to the second commandment. It's like God said, you will not make images because first of all, you can't represent God. Second of all, all these gods are false. And the answer to that is like the answer to all the commandments is Christ. Christ is the answer to that commandment. Christ is the image that God gave us which we were not allowed to make. And so that becomes the argument for the icon. And so, because then, because of that, in the Orthodox Church, the icon takes on a theological aspect. The images become typified. They kind of come together, and then they don't change a lot because every aspect in the image has theological import. So it's not arbitrary. It's not whatever the whim of the artist is, but rather it becomes a very precise language which has theological import. So when you become an iconographer, you have to learn that typological language. You have to learn what the images are, what's in them, how much can I push them on this side or this side? How can I change them? How do they need to be the same? So it's all that an icon is."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":1216.95,"end":1217.31,"speaker":"Jordan Durstein","text":"And then."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":1217.31,"end":1220.15,"speaker":"Jonathan Pageau","text":"So you feel like that answers your question. Oh, that's great."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":1221.19,"end":1228.39,"speaker":"Jordan Durstein","text":"And as we mentioned, we chatted at dinner. But you're saying that you'd never have an icon of God."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":1228.63,"end":1378.71,"speaker":"Jonathan Pageau","text":"You're not supposed to, though. People have done it, sadly. Oh, really? Oh, yeah. You think Orthodox people don't get wacky? Yeah, they get wacky. No, human beings. Human beings are just human beings. Things get wacky all over. So in the 14th century, there started to appear on the horizon of art. Even in the Middle Ages, in the Western Middle Ages, you would never see early Middle Ages, you would never see an image of God. You would always see an image of Christ. If you show. If you represented the creation of the world, you represented Christ. Christ is shown represent creating the world. You know, if you. Every time you show a theophany in the Old Testament, it's Christ that you show, okay? Because Christ is the locust of the theophany. He is that toward which all the theophanies is pointing to is towards Christ. And So the incarnational principle makes it so that even when we represent the. The apparitions of God in the Old Testament, we represent them as Christ. Okay? And so if you look at. In the Old Testament, that's in the Old. In the Middle Ages, that's early Middle Ages, what you'll see. But then towards the 13th, 14th century, things start to get weird. And then we start to see this image of this God image. It's like sometimes it's not even clear who it is. Like, who is this God? Like, it's just like a God in the sky. Like, is it God the Father or is it. Is it Christ? Is it God? Like, we don't have God. We have the Holy Trinity. Like, it doesn't work. And so there's this confusion with stuff. And you see the ultimate image of that is in the Sistine Chapel. Like, who is this guy who's pointing at Adam? Is it. It's God? I don't know. Like, what's that? Like, who's that? Who's that? I don't know who that is. And so that happened, and it. Then it seeped into the Orthodox Church as well. And so if you go to. If you go to Greece, if you go to Russia, you go to Serbia, you will see, you know, an old bearded man. You'll see him. But I think that we have. I think that at least now there has been a restoration, let's say, of what I would call the older tradition. And most iconographers today, except for a few fringe exceptions, they don't represent God the Father, and they tend to represent the Holy Spirit only in very specific moments, like, you know, at the baptism of Christ. And, you know, sometimes they'll show the Holy Spirit in other places, but they tried to limit the symbolic representation of the Holy Spirit. So."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":1378.71,"end":1379.15,"speaker":"Jordan Durstein","text":"Cool."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":1379.15,"end":1379.59,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":1380.47,"end":1385.95,"speaker":"Jordan Durstein","text":"For the sake of time, we can talk a little bit about your sculpting if you'd like, or we can move on to YouTube."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":1385.95,"end":1511.1,"speaker":"Jonathan Pageau","text":"Well, I'll just explain how I became a carver, because so I'm wanting to be an icon painter, and I can't find a teacher. I just can't. There's just no teachers, you know, like, what do I do? And how am I doing? I'm going to the library and spending all day at McGill University looking through books and just kind of learning about these images and taking classes on iconology and stuff. And then my parents, they cut a tree in their backyard, this linden tree, and they said, oh, Jonathan, we hear that this wood. Supposedly people carve this wood. So you know, do you want to see pieces of it? And right away I'm thinking, I'm going to make a cross, I'm going to make a blessing cross. And I didn't have any tools. I had basically had x acto knives. And so I'm like, how many did you break? I like, oh my goodness. I'm like carving this cross. Even the actual shape of the cross I carved out with an exacto knife, which now just seems so insane. I still have it. I still have it. I keep it as like a sign of my original shame. And so it's like, it's just, it's so messed up. It's just like, it's all crooked. And I never sanded the back and it's just really horrible. But so I brought it to church and you know, I was a catechumen, I wasn't orthodox yet. And I showed it to the priest and the priest kind of looks at it, you know, and he says, keep going. He's like this severe Russian priest. He's hilarious. So I'm like, okay, all right, all right. So then I get to my parents again, it was my birthday and they like bought me. So I always say it's my father's fault. There you go. So he buys me these tools and these little tools. And so I get a panel and then I carved a really elaborate icon. Like it took me like two months. Just extremely elaborate. It's like Christ in glory in the center sitting on a throne with like a glory of cherub around him and like the four evangelists in the corner. And then there's the mother, the mother of God, Mary on one side and St. John the Baptist on the other. It's like this crazy thing. So it takes me forever to do it. And then I show the priest again and he just looks at it and he goes, keep going. And so that was it. And so then I just kind of slowly developed it. And yeah, there's a lot, there's a lot of detours in there. But finally one day I got an order from my bishop and got orders from people and then it just kind of slowly happened that I became professional icon carver, if there is such a thing, I guess."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":1511.74,"end":1518.78,"speaker":"Jordan Durstein","text":"Well, there's a few of them. There's at least one full time work, eh, in an icon carver. Who would have seen that coming?"}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":1519.42,"end":1522.14,"speaker":"Jonathan Pageau","text":"Certainly not me. Cool."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":1523.5,"end":1535.83,"speaker":"Jordan Durstein","text":"Your YouTube channel has taken off in, in very, you know, maybe in a very similar, very strange way. So when you started this, what, what is your purpose? What is your YouTube channel?"}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":1535.83,"end":1791.84,"speaker":"Jonathan Pageau","text":"What's my YouTube channel. Okay. All right. So. So one of the things that. That I'm telling you about art and I'm telling you about these patterns. And so that became, I would say, even more than icon carving. It became very much like the. The focus of my attention and studying the patterns, story patterns in the Bible, seeing how those story patterns repeat, and then also how, for example, in the architecture of the church and the icons becomes a visual version of the same patterns that are in the Bible. And I was kind of doing this kind of study on my. On my side, and my brother, who was growing up with me and had the same questions I did, he was studying a lot of rabbinical texts, and he was reading Midrash, and he was even reading Zohar. And he. At 16, he had, like, learned Hebrew on his own because he thought, well, if I'm going to be a Christian, I should read the Bible in the original language. There you go. A true Baptist. There you go. They just learn Hebrew. And so we're having these amazing discussions. You know, like, I'm reading St. Gregor of NYSE, and he's reading Rabbi so. And so. And so we're talking about the different patterns in the text. And. And it just kind of grew our understanding of these patterns. And so at some point, what you realize is that this pattern that's in the Bible and that's in the icons and the liturgy really is like the pattern of reality. It's the pattern of our attention. You could say it's the manner by which we engage the world. And so once you see that, then you can actually point that pattern elsewhere. And you can look at anything. You can look at movies, you can look at novels, and then you can show how the patterns that are in Scripture, because they're the actual patterns of creation, they're the actual patterns of reality, then you can just see them manifest themselves in social phenomena. And so my YouTube channel, that's pretty much what I do, is I talk about two things. One side is I talk about popular culture, and I try to show these patterns in movies and popular culture. And then the other side is strictly talking about the patterns themselves and showing, for example, taking an image like the tree and saying, okay, let's look at the tree, and then starting in Genesis with the tree in the garden, and then going all the way to the tree in the New Jerusalem, and then showing how all these images lay themselves out. You know, the staff of Moses and then the cross. So there's all these images in the Bible. And then I can even show people that there are actually traditions, apocryphal traditions, which will literally say that the tree in the garden was taken out of the garden and then was used to make the staff of Moses and. And then was used to make the cross. And so there's these wonderful fantastical stories that trace these patterns. And so we don't have to see them as, you know, we don't have to see them as kind of historical descriptions of what happened. But what they are is they confirm the patterns that are already there by giving us these kind of fantastical stories which link these structures in the text together. And so it's that kind of work that you can do by. That's one of the reasons why I tell people read as much apocryphal stories, as many apocryphal stories as you can. Because what it does is it sometimes points dots together that you hadn't seen, but they're there in the Bible, but you just didn't notice because you're distracted, because you don't have that focus. But if you start to see in these other stories, you're like, oh, okay, you can read midrashic stories. You can read all kinds of stories, and you can see these connections happen because those people thought about what they wrote. These people were soaking in that culture. They were soaking in the Bible, soaking in a worldview that was built by Christianity or Judaism. Anyway, that's what my YouTube channel is about."}
{"episode_id":"SW - #053 - 2019-08-28 - Wycliffe College Interview","start":1793.85,"end":1849.62,"speaker":"Jonathan Pageau","text":"Thank you for listening to the Symbolic World podcast. As you know, this podcast is, for now based mostly on my YouTube videos, which I am transferring into audio format. Please go ahead and visit my YouTube channel. There are more videos there on different subjects that I'm not going to put into audio. And please share this to your friends. I know a lot of people know about the YouTube content, but not so many people know that this is also a podcast. So share it to your friends, share it on social media. And if you can, feel free to support this financially as well by going to my Patreon page, which is Pajo videos, strangely, you can go there and you can support it at any amount that you want. A month for all the patrons. I do a monthly Q and A, live Q and A in which people can ask questions in the chat. And I try to have a more personal connection with people. The YouTube comments have become difficult to follow and to answer. I'll see you soon."}
