{"episode_id":"SW - #371 - 2025-01-05 - The Dark Side of Christmas - The Massacre of the Innocent(s)","start":0.16,"end":62.57,"speaker":"Laura Diaz","text":"Tucson, the Weight is Over Mediweight Loss they're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks at mediweight loss. I got the same medication but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com one of the strangest elements."}
{"episode_id":"SW - #371 - 2025-01-05 - The Dark Side of Christmas - The Massacre of the Innocent(s)","start":62.57,"end":1567.09,"speaker":"Jonathan Pageau","text":"Of the story of Christmas is the massacre of the innocents. That is in the story of Christmas. When King Herod finds out that the wise men are coming to worship the new king, he in order to get rid of this insurgent king, he decides to kill all the children under 2 years old in Bethlehem and the region. Of course, it's a very dark aspect of the story of Christmas and I understand why it's one word that we don't mention as much when we talk about the story. But it is a very important part of the story. And it also happens to be a part of the story where Christ's story manifests a, let's say a coming together of all these ancient stories that were there before. I've often said that. I've often said that Jesus's story is a culmination of all the Old Testament stories, of all the Old Testament prefigurations. And you know, it's easy to say that, but it's also a good idea to be able to show it. And in the case of the story of the massacre of the innocents, we can really see this story. And so we're going to go through what it is that this story is showing us how it's collapsing all these Old Testament stories together. But then also we'll look at what the story means or what it is, you know, why? It is an important aspect of the story. What's it pointing to? And what does it reveal about the very structure of reality, the way that most stories do, and especially the story of Christ. This is Jonathan Pedro. Welcome to the symbolic world. And so the text for the the Mask of the Innocents is very short. You know, Herod finds out about the. The wise men that are coming to worship this new king. And then when the wise men come and find Jesus in the home with Mary, when they leave, Joseph has a dream. He sees an angel. In his dream, he says, an angel of the Lord appeared to Joseph in a dream. Get up, he said. Take the child and his mother and escape to Egypt. Stay there until I tell you. For Herod is going to search for the child to kill him. So he got up, took the child and his mother during the night and left for Egypt, where he stayed until the death of Herod. And so was fulfilled what the Lord had said through the prophet out of Egypt. I called my son. When Herod realized that he had been outwitted by the Magi, he was furious. And he gave orders to kill all the boys in Bethlehem and its vicinity who were two years old and under. In accordance with the time he had learned from the Magi. So basically what you have is the prophecy or the idea that there's a new king coming or someone who is going to be a threat to the authority of the current king. And because of that, the current king decides to slaughter all the children of Israel, of Bethlehem, while his. While his father and his mother flee to Egypt with the sun. Now, what is going on in that story? The first thing to kind of understand is the very funny way in which it plays with the Old Testament stories. You know, the way in which it, like I said, collapses the Old Testament stories together. Now, the first thing your mind goes through to, obviously, is the idea that the Pharaoh wants to kill the children of Israel and he kills all the children. And out of that killing of the children, there is a child that is born, that is saved and becomes the savior of Israel. And that, of course, is Moses. So that is the first thought that comes to you. Like it makes sense to think of that as being the story. And then that child, when he grows up, Moses, he leads the children of Israel out of Israel into the promised land. Now, when you think about it, you realize that it seems to be the opposite of that story. Actually. It seems to be playing with the story, but doing it in a way that makes it almost the opposite of that story. Think about it. In the story of the Exodus, the pharaoh wants to kill the children of Israel, and because of that, he reveals the Messiah, the savior, and then that leads Israel ultimately out of. Out of the. The court. And the child doesn't hide, you know, outside. The child hides in Egypt, but hides with the pharaoh, right? And so the pharaoh threatens the child. Now, the child is saved by being hidden in the house of the pharaoh. So he. He is hidden in Egypt, but he is also fleeing. Like, ultimately, Israel will flee Egypt. So you can see that it's similar, but it's different. And it's very fascinating. And you'll see as we accumulate the stories, it will become actually very difficult to think about the story of Jesus because you'll notice all the images kind of crashing in to the story of Jesus. Okay, now, this is not the only part that relates to this story, because there is another story in which Joseph, the son of Jacob, the son of Israel, is sold by his brothers. He's threatened by his brothers, his brothers want to kill him, and so they put him in a hole, and instead of killing him, they end up selling him to a Midianite or an Edomite. It's not clear in the text. It seems to be both a Midianite, an Edomite, and that way Joseph then ends up, through this transaction, as a slave in Egypt, and ultimately he saved Egypt from a drought. All right, so that's the second image. All right, so try to keep all of that in your mind. Now, in the story of Jesus, you can see that it's similar because it's the King of Judah, right? It's the King of Judah that is going after the Messiah and wants to kill him. And because of that, the Messiah, the chosen one, flees into Egypt and is protected in Egypt. So you can see how. How it's very similar. It's close, but it's playing with these elements in a way that is bringing them together in another way. Now, there is, of course, a third story that we have to consider when we're thinking about the story of Jesus and the mask of the innocents and him going to Egypt. And it is the story of Jacob and Esau. Now, you have to think about the idea that in this case, the king of. It's the King of Judah. Now, the King of Judah is a particular character in this story, because the King of Judah, Herod, is not a descendant of the line of David. He is an Edomite. Now, remember what I said about the. They are the ones that sold Joseph into Egypt. But Edom is Esau. Actually, Edom is another word for Esau. And so you can see that in the story of Esau, Jacob and Esau, you have a similar situation, which is that Esau wants to hurt his brother. Esau wants to kill his brother because his brother has the blessing. And he does it. You could say it in different ways, but in a way, it's because he is the one who will replace Esau. Just like in the story of Herod, Jesus is the. The king that will replace Herod, at least in his perception and at least in the way that the magi seem to come and say, a king is born here. And so because of that, you could say Jesus is the one who has the blessing of heaven. And so Herod is also, you know, chasing him, wanting to kill him. And because of that, he goes and flees into. Into Egypt. And so it's the case of Jacob and Esau. Esau is Edom. It's Edom. He is the ancestor of King Herod. And he wants to kill his brother because he has the blessing. So because of that, his brother has to flee into Lebanon. Right? He has to flee to the. His. To the brother. The brother of his. Is it the brother of his mother, Lebanon? I think that's what it is. And so he has to flee into Lebanon. Now, again, there's another story. Sorry, there's so many stories in order to understand this. And of course, the other story is the story of King Saul and David. Again, now King Saul is the king, and now there's this new king that is rising up, that is coming, you know, up the ranks. And because of that, King Saul wants to kill David and forces David to hide. And forces David to hide. He hides in several ways and can help you kind of understand. He hides among kind of criminals, debtors, people who are miscontents in society. And he also hides among strangers. He spends some time becoming, you know, a secret. He becomes a. He looks like he's fighting for the enemies of Israel. He's not really, but it looks like he's fighting for the enemies. He's helping the enemies of Israel. Now, this is, of course, something that Joseph does, because Joseph goes to Egypt, saves Egypt, who will become the enemy of Israel as well. Okay. All right. So I hope you can kind of see the whole thing in your mind. Hopefully you can hold it together. It's very difficult. And so you can see that in the story of Jesus, all of those things seem to be happening at the same time. That is, Jesus is fleeing his own People, right, He's fleeing the king of Judah in order to go into Egypt to hide. He's fleeing the legitimate king in order to hide with the stranger. But the king of Judah is not. Is his brother, but he's not really his brother, or he is his brother in the sense of the hostile brother that is the king is also Edom. And therefore he is fleeing the Esau in order to hide again with the stranger. Now, like I said, in the story of Moses, Moses ends up hiding with the pharaoh and saves the pharaoh. In the case of the story of Jesus, Jesus also ends up hiding with Egypt and then returning later. Okay, he's leaving the promised land in order to go into Egypt. He's kind of doing the opposite of what Moses did. And so it's like even. Even when I tried to bring all of those stories together, they kind of hurt my head because there's so much going on in this little. In these few little sentences that it's hard to. It's hard to maintain. But you can see exactly what Jesus is doing. Now, what Jesus is doing in the story of the massacre of the innocents is in some ways also a prophecy of what is going to happen later. It's also a prophecy of how Jesus will be hated by his brother and will be put into the ditch, put into the pit by his brothers. Right? He will be killed by his brothers in that case. In the case of Joseph, they don't go all the way. But in the case, they make a scapegoat sacrifice. They kill a goat to replace Joseph and put blood on his garment and then tell their father that it's Joseph that died. But in the story of Jesus, Jesus is the scapegoat sacrifice. And so Jesus now is killed by his brother, his brother Judah in particular, and then he will also be sold into Egypt. But he's not only killed, it's so interesting. He's not only killed by his brother Judah, he's also killed by the stranger, the Edomite. He's killed by Esau. But Esau is also Rome, you know. And so in some ways, more like Egypt or more like really the stranger, the one that has very little to do with, you know, with the story of Israel, although, you know, Jews in the first century and. And many Jews until today call Rome Edom, you know, and call Rome Esau. So the whole symbolism, there's a kind of deep symbolism about understanding what it is that's going to happen. And then it all becomes very strange because there is also a larger massacre of the Innocents, which will happen, which is that Jerusalem will be destroyed and the entire sacrificial system, the entire tradition, you know, that led up to Jesus will be destroyed with the temple being destroyed, you know, not to be rebuilt again, at least not until now. And the, the one that saved, you know, the Moses figure, you know, the Messiah figure, the David figure, The, the. The one that flees will then go into Egypt, will go into Rome, will go. It's weird because it's like he goes into the very people that destroyed the tradition. He goes. He goes along with the very people that destroyed the temple and that destroyed Jerusalem, and then he saves them. So it's almost as if we're going back backwards in time, you know, and if you see the stories together and you don't necessarily look at the causality kind of going backwards, it seems like that Jesus is doing something with that. Because, you know, in the story of Joseph, Joseph saves Egypt. Egypt becomes, you know, the slavery of the. Of the Israelites. And then Moses takes Israel out of Egypt into the promised land. Okay. You know, and then there are the Egyptians trying to, like, kill the Israelites. And then after that, Moses takes them into the promised land. So now it's as if it's going backwards, moving from the promised land. And then the Egyptians or the Romans, the strangers, killing, destroying Israel. And then you could go. You go backwards. That is, the character flees nonetheless into Egypt, becomes friends with the Pharaoh, becomes friends with the Roman emperor, and then saves Rome. Yeah. It's hard to think about all of this, but this is what Jesus does. This is why when I say that, like, when I think about Jesus story, I just. It just shatters my categories. It just blows me away. This is what I mean. It's very difficult to hold all of this in your mind because it's just too much. It's really too much. Jesus is just collapsing all of this together, kind of bringing it in a way that you can see. It just glows. But it's hard to get to the end of. It's hard to totally see completely what it is that Christ is doing. But nonetheless, we can still think a little bit about why is this necessary? Why? Why is it necessary? Why is it part of reality? Why is there this massacre of the innocence of the innocent? And so this is something that now we have to kind of step out of the moral frame to kind of just understand how some of these things work, you know, and understand in some ways what it is that exterior pressure does to something. The way to understand it is that The Egyptians start to kill the children of Israel. Now what that does, just pragmatically, is it of course, makes the children of Israel, for the Israelites, become very precious, more precious than what they were before. And then there's this great effort, right, to protect the children of Israel, to save them, this great effort that requires more energy, you know, more time, more deliberate action in order to preserve the children of Israel. And what happens is that the external pressure creates a form of purification. It creates a form of burning off of the chaff. I'm not saying that the children are chaff, but what I mean is that it kind of reduces things to their essential right. Because if you have external pressure on you, you have to decide what's essential and what isn't. You know, in a time where everything is relaxed and everything is cool and there's nothing you. Dangerous going on, things can kind of get out of control. You know, you can just let things go. You don't have to be extremely deliberate about everything you do. But when all of a sudden there's some kind of external pressure, something that is, you could say, pushing you towards survival, you know, one of the things it does is that it makes you have to choose that which is precious and not only choose, but care about. All of a sudden you become deliberate about preserving that which is essential. Essential to what? It depends, obviously. Essential to the survival of whatever you're part of. Essential to your family identity, to your national identity, to your. To your story, to your company, to. To whatever right, to their, you know, to your government agency. Like, if you cut budgets on people, then, you know, what they have to do is they have to cut the fat and they kind of have to decide what is the most precious and what that can do in the proper context, if you survive it. That is, if you survive an external attack, if you survive a external pressure, something that is trying to eat you and devour you and destroy you, what you develop, what comes out of that is something stronger, something that is refined and purified like gold, something like a seed that can then be planted into a new world and grow again and have fruit. And so that is why that story of the danger, or the, you know, the threat of the brother, the threat of the. The important character is important, you know, and it happens in all kinds of contexts. Of course, I. I showed you different versions of that in the Bible, but in many, many stories, you have the idea of the child, the precious child, you know, the golden child, the one that is prophesied to be king or to Become important, is in danger and is threatened and is put through the wringer. And what that does, the reason why that's there in the story, at least one of the reasons, is in order to show that if. Think about it this way, like if the child survives or if the character survives, or if the. This survives, it is a sign that it is the indestructible thing, that it has something in it that is worthy of attention, worthy of care, and worthy of being brought into the future. And so we can understand this story, the story of this external pressure which comes on peoples. And I don't want to. I want to be careful. I don't want to diminish how serious it is. I'm not trying to, To. To make it trivial. It is not trivial. It is actually, it can be. It is extremely dramatic. Dramatic like the story here. And in some ways, for example, like, dramatic like the story of the Holocaust, you know, this idea that in the 20th century, you know, as the Jewish nation, for example, in the 20th century, went through horrible persecution and horrible threat, out of that, they came out much stronger and much more concentrated. And, and like I said, I don't want to make it trivial. I'm not saying that we should wish this on anyone. That's not, that's not the point. But it is simply a structure of reality. And that is why it happens in the case of the Israelites before they are going to flee Egypt. This type of pressure happens on Jacob from his brother Esau, it happens on David, from. From the. From King Saul. And ultimately it happens on Christ in the story of Christ. And, you know, and also we believe in some ways that it also happened in a bigger way, in a meta way. That is because of the fact that Jerusalem was destroyed in the first century. What came out of that, the seed that emerged from that was so powerful that it could take over and save even those that destroyed it, even those that destroyed Jerusalem. And so that is the power of the story of the Masque of the Innocents. Hopefully this is clear. Hopefully also the examples I gave you in the real world are clear enough, you know, to help you understand how that works and why it is a motif that appears in so many stories because of what the idea that when something goes through fire and survives it, it is the essence of that which was threatened that has to survive. It is that which we kept which is the most important. You know, think about it like. You know, think about it like there's a fire in your house and you only have time and you can Pick which one. But you only have time to take one picture of your family out of the house. And so you will choose a picture and that will gather together all the memories and things that you care about and all the aspects of your family that you remember the most vividly. And that is what you'll take out of the house. You won't take some random out of focus picture, you know, in which some of the members of the family are missing or, you know, it's just a joke or whatever. You'll take, you know, the thing that is the most symbolic in the proper sense of what it is that you're trying to remember and to, to bring with you, you know, and so this is of course the image, for example, of Aeneas who takes his father out of Troy. Anyways, there are plenty, plenty examples. You can, you guys can think of them on your own. Try to find examples. Actually be fun to see that in the comment section. Try to find examples of stories like that where this process of pressure and of the survival of the seed, the survival of the precious thing, through the fire and through the challenge. And so I appreciate your attention. You know, Christmas is coming very soon and if you're interested, there are many Christmas videos on my channel and I find it difficult to talk about things twice. And so go on the channel, find the Christmas video list and then there are plenty of videos talking about all the aspects of Christmas from the Christmas tree, you know, to Santa to Rudolph, to like everything, you know, to the nativity icon. I think, I think I pretty much talked about every single thing that is related to Christmas. Maybe the only thing left was this massacre of the innocent story which I am dealing with now. And so thanks everybody for your attention. Do not forget to sign up for the symbolic world and to join our community. And we'll talk to you very soon. Bye bye."}
{"episode_id":"SW - #371 - 2025-01-05 - The Dark Side of Christmas - The Massacre of the Innocent(s)","start":1567.09,"end":1631.17,"speaker":"Laura Diaz","text":"Tucson the weight is over. Medi Weight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iHeartRadio. And you can trust me, this isn't just another weight loss clinic. I. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks@mediweightloss. I got the same medication but with a customized plan, weekly check ins and a licensed physician guiding me every step of the way and and the cost the same as those risky online options. Tucson your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweightloss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com pack up though, because Chevy."}
{"episode_id":"SW - #371 - 2025-01-05 - The Dark Side of Christmas - The Massacre of the Innocent(s)","start":1631.17,"end":1658.12,"speaker":"Announcer","text":"SUVs have the capability to take you to some incredible places like an adventure in the middle of in the Equinox Active, an SUV that will help you get away with confidence or head off for a night in the in Chevy Traverse with all the tech you need to stay connected. While the undeniable value of Chevy Trax will keep you moving from here to over here to way over here, get to all the places you want to be with Chevy SUV's see Watson or O'Reilly Chevrolet."}
