{"episode_id":"SW - #233 - 2022-05-19 - Why Humans Sacrifice","start":0.08,"end":3510.07,"speaker":"Jonathan Pageau","text":"And it's only weird, like I said, for someone who creates a weird little distinct category called religion, a category that they don't understand, a category that they can just, like, count off as superstitious and stupid and ridiculous, although it's a human universal, and then makes them feel safe that they don't have to understand this. And then it makes them blind to all these other behaviors that human have that are ritualized and that could be really understood if they took a little bit of time. This is Jonathan Peugeot. Welcome to the symbolic world. Two weeks ago now, not even sure time really flies. Some guy that I never heard of who runs a podcast called Decoding the Gurus, I guess, kind of went after me on Twitter. At first he was going after Brett Weinstein, but then decided, I guess, to go after me. And anyways, he. He has the usual kind of, you know, dismissive new atheist tone. And I was gonna ignore the guy, but then David Fuller from Rebel Wisdom and other people that I respect, you know, said that this is important, that I should pay attention to it, but really, I'm not gonna. I'm not gonna answer too much, but one of the things that this guy attacked me on is, here's one of the tweets he said. He's talking to David Fuller, and he says here, Jonathan Peugeot saying Alex Jones intuition are absolutely correct, that abortion is a human sacrifice for power, and that he would not be at all surprised if the elites were engaged in humiliating, in ritual sacrifices. And so this was, of course, his big proof that I am off, that I am off the rails, that I'm some kind of guru or some, you know, that I. That I'm not worth the attention. And so what I thought is, I realized in reading it that of course, this. I don't think this guy could understand what I'm talking about, but I thought it could be a good opportunity to maybe talk about sacrifice and maybe help people understand as much as I can help you understand what sacrifice is, why we sacrifice, and even why human sacrifice exists. And we'll see if in the end that that tweet or these comments that I made about abortion and human sacrifice hold up once we've gone through the basic. The basic ideas. One of the issues that we see with a lot of these kind of new atheist types and this kind of new atheist rhetoric is that they often act as if religion is this thing completely set aside in human behavior. And so they create a box called religion, and then they look at what's going on there and they just see it as some kind of aberration or some kind of strange behavior that humans are having. And because they don't seem to want to connect the ritual, let's say, religious behavior with other types of behavior or other types of regular behavior that humans have, then they find it very strange when other people do that. Let's say. If I try to explain how certain behaviors today are akin to sacrifice, I've done this not only in terms of abortion, but in terms of war, for example. I've talked about how we'll get to it. I've talked about how certain acts in war are very much akin to human sacrifice. And so that's the problem. It makes it very difficult to engage with these types of people because they're not really trying to understand why people would sacrifice in the pillar slate. How did this happen? How did humans start to sacrifice? Once you start to ask those questions, then all of a sudden you get larger categories of human behavior and you're able to understand why it would happen, that sacrifice would be developed and why it is delusional. It really would be a strange delusion to notice that sacrifice is a human universal. But that today, for some reason, we. We don't do that anymore. Nobody does that anymore. Nobody sacrifices and of course, nobody participates in human sacrifice because, you know, we're so evolved that we would never do something like that. But I think that's really the blindness of not understanding what sacrifice is, what it's for. So we're going to look at that and see if we can figure out on our side why it is that sacrifice exists. Now, in order to understand sacrifice, we really need to go back down into very, very primal categories of what humans do. Because sacrifice is a very, very. Is a large and encompassing category. And several thinkers have been poking at it and trying to find solutions at why humans do this. Different anthropologists or religious thinkers have tried to kind of figure out why it is that humans do this. And I'm going to give you my take at it. I don't necessarily think that it's all encompassing, but I do think that it does encompass quite a bit of why it is we could get to this. Now we have to go all the way back, all the way to the very bottom of activity of what, let's say, what being with agency does and why it does what it does. And the way that I try to think about it that brings it all together is to understand that most of what we do, or possibly everything a being with agency does, has two basic goals and it has These goals have to do with identity. They have to do with the notion of being a being rather than not right to just existing as a being is what we have to come down to in order to understand sacrifice. So we understand that when beings act in the world, they act for two major reasons. One is to protect the integrity of my being. And the others is to expand my being. Now, expand my being can be something like adding body, adding potential. But of course, when we get to conscious beings and to higher level beings, we'll see that that also has to do with something like influence. It can also be a more subtle type of expansion. Not necessarily also, if not necessarily just a physical expansion, but a more subtle one. And we also can understand that expansion of being, even as something, as lineage, you know, as something like my children as an extension of my being. And that my children become an extension of me. And so I can act in a manner to, to protect and to expand the things that are related to my being. We'll see how that scales up also rather quickly into higher beings even than humans in terms of families and different higher beings. So we get to this basic idea. So why is it that I engage with the world? You know, I either try to, to stop things from hurting me, to prevent things from destroying the integrity of what I am, or I'm also either expanding myself or taking things from the outside and bringing them inside in order to preserve and to expand what I am. So we get now to. Because we're going to talk about, mostly about sacrifice in terms of killing animals, but there are other types of sacrifice, but we're going to start with there, it makes more sense. So the question is, why do we kill things? You know, why would humans kill things? And when you think about it the way that I explained it, you realize that humans kill things for those reasons. Humans kill things either to protect themselves. So, right, there's a predator, there's something attacking me. You know, there's a. There's a mosquito biting me. There's whatever it is that is attacking me. And so I will kill the thing in order to preserve my body. Or I also kill things in order to integrate them for food and to expand my body. But I could also kill things in order to expand my influence and my presence as well, right? If there's a predator hunting on my land and he's killing the animals that I want to kill, then I might kill that predator in order to have more access and to expand my scope, my influence, my, my capacity to take up, to exist in the World, let's say. So you see that of course, it's not just killing. Anything we do, whether it's the, you know, the grass we pull out of the ground, whether it's the wood we cut, will always be about this as well. And you can then scale that up and you can understand that this is what, this is what happens when you kill people as well. When you kill people, you will do it for those reasons. You will do it either to protect yourself. If there's someone attacking me, there's someone dangerous to me, I feel like I to kill them in order to preserve my being, or I will also kill in order to expand, to take things from others, to invade other lands. You know, if I'm jealous of someone, I want to take what they have or at least want to eliminate them as rivals for what we're both looking for. So you're going to start to see that I think that my theory about sacrifice is ultimately going to be more encompassing even than Gerard's theory, I think. So it might be a little cocky on my end to think say that, but we'll see. You'll see that I think that it, it, it involves, but looking at Rene Girard's theory is of course extremely useful to help you understand. But first we also can also understand that we have to ask ourselves first of all how we engage with things outside, and then also why would we give things to others? So because sacrifice involves those two things. It involves taking things from the outside, taking, you know, either killing things or taking different things that we've gathered and giving them to others. So why would we do that? And my. I surmise that the reason why we do that is the same as why we kill and take things in the first place, is we do it either to, you know, expand ourselves or to protect ourselves. But then the expanding and protecting happens. Humans, one of the things that humans realize is that they also exist at higher levels. They also exist in groups, they exist in higher level beings. Let's say they don't only exist, they exist in families and clans and all of this. They don't only exist on their own. And so they'll realize that as an individual being, it will at some point be worth sacrificing what I have, giving away what I've gathered, giving away what I've killed in order to assure at now a higher level, the same thing, the preservation or expansion of the higher level beings that I participate in, whether it's my clan, my family, whether it's a group, and then ultimately whether It's a nation. We'll also see that that sacrifice will kind of happen in two directions. We could say one going up, or maybe three directions. Let's say one going up, one going down. And then one may be going side to side in terms of gift giving with friends. So the one going up will be something like, you know, something that you see already in the animal world, which is that if a pack of wolves kill, kill something, then the alpha wolf will have first access to the food. So there's a sense in which we understand that when we exist in higher level structures, we have to give a part up into that structure in order to preserve the. Preserve the strength of the common being. And so the king gets a part of what I make. You know, this is what taxes are. Taxes are basically a form of sacrifice where we offer up to the higher being, which is the king or the state or something which is above us, in order to preserve our existence, to expand our influence. Now this, you'll realize that once, once humans realize that this works, that if I give a part of what I have up towards a higher level being, my family, my team, my clan, or whatever, that this can also be ritualized and can be given up to the reason why we exist in the first place. So this is what giving things to a God is. It's actually a more economic way of all of us binding together and giving a part of what we have up towards the ideal of why we exist together, so that that ideal will then come back down and will, let's say, will hold us together in a way that binds us. But we'll see a little more about that as we go. First, I want to look a little more at Girard's theory. Now, Girard's theory is wonderful because he kind of gets what I'm saying, and he realizes that in order for groups to exist together, they have to care for the same things. And this is actually the very existence of a group. I mentioned this before. In order for a group to exist, we have to have one purpose or one ideal. Any group, whether it's, you know, a group of people working on a prototype in a company, whether it's a baseball team or whatever, sports team or there is something, there is something we care about, all of us care about that binds us towards that care binds us to that thing. Now, you can imagine that there are multiple things that can do that, and there can also be a hierarchy of things. So let's say we care about certain things, and then at a lower levels, we also care about secondary goods as well. So we can understand that in a group certain things become valuable, certain resources, you know, women, children, all these things become valuable. And then because we all care for the same things, then it binds us together. But it creates of course, a problem because when we care for the same things, the resources are limited, the possibility of accessing these things that we care about are limited as well. So what will happen is that will create rivalry and competition within the group. And so the very thing that binds us will create competition and rivalry. And so this is a serious problem because what it can do is it can lead to all out conflict where everybody starts ripping each other apart through cycles of revenge. You know, I'm jealous of my neighbor, so I kill him to take his wife or to take his stuff, but then his family notice, see that I did that, then they take revenge on me. And so you have these eternal cycles of revenge. And so we have to find ways to continue to cohere or else groups will just fall apart and cease to exist. And this will happen through ritualized behavior. And so just like, you know, just like a dog will ritualize a conflict in order to avoid killing each other, they will ritualize aggression, ritualize submission, and then they'll create a ritualized encounter in order to avoid the cost of it boiling down all the way into all behavior. For the same reasons humans also do that. There's nothing weird, even for an atheist, to understand that ritualized behavior is a way in which to avoid the cost of a certain social dynamic and to bring it up to its pattern in a manner in which it will then, let's say, order reality and not be as costly in the, at the, at the bottom of things. So what Gerard noticed is that what people would tend to do is that they would take all the problems in the tribe, all of the things that were breaking the tribe apart, and they would end up focusing it finding someone who was weak, who was diseased, or someone who just didn't fit in. Sometimes it would actually be a stranger, like an enemy prisoner, someone who's not part of the group or is almost not part of the group. And then they would say, well, it's because of that person, because of this person that the group isn't going together. Right? It's a scapegoat behavior. So they would, they would put all the blame on the person, the scapegoat. They would say that it's this person's fault that I'm not able, that we are not able to reach who, what it is we care about because they are in the way. They're oddly not. They're not binding the group. They're not participating in the man in which the group binds together. They would put all the blame on that person. They would kill that person, and then it would rebind them towards what it is that they cared about. It would create a kind of ecstasy, and it would create a kind of ecstasy and a kind of moment where the group would feel in acting together, in violence towards the scapegoat, that they recognize each other as one. They recognize each other as being something that exists in the world. This is difficult to understand for people who think that groups just exist. Groups don't just exist. Beings don't just exist. They need something to bind them together for them to exist. And that has a mechanism. And if you don't understand it, then there's a lot of stuff about religion that you will never understand because you somehow think that people just exist together without ways to bind in order for them to move towards common goals and common things that they care about. So what you realize is that this Girard's theory works very perfectly with my idea that basically the way in which a group acts will be a way to act in order to bind themselves has to do with identity, in binding and creating a hierarchy and identifying an outside. Right. We take something on the edge, we take something strange, we kill it, we basically cast it out. And then that ejects that which is not good, that which is outside of us in a ritual way. And it binds us together towards something. And so you can do that. Of course, you can understand that this is already what happens in the very existence of the group, in the patterning of attention. This is what is already happening, that is in order. You know, I've mentioned this before. Let's say in order for a basketball team to exist as a basketball team, it has to be able to sacrifice. It has to be able to focus its attention on a common goal, to identify the things that are the obstacles to reach that goal, and then to eliminate them. And so if there's a bad player on the team, they will get rid of the bad player. If there's bad behavior on the team, then they will eliminate behavior. And so you realize that actually sacrifice is the very way in which things exist. This for anything to exist, it has to sacrifice some aspect of its idiosyncrasy in order for it to exist together. And this is going to sound weird for people to understand, but in order for you to understand the existence of objects, of any being. You realize that the pattern of sacrifice is embedded in the very existence of all objects. Because even though I recognize this as being a cup, it has indefinite idiosyncrasy in it, which is. Which could make it not a cup, that is not participating in its cup ness, you could say. But in order for me to recognize it as a cup, I have to sacrifice the idiosyncrasy even in my attention. I have to not pay attention to the things that are idiosyncratic in the object so that I can experience it and participate in it in a way that is to its purpose, in the way in which it is to the reason why I care about this thing in the first place, which is that I use it to drink out of. Now, of course, there are ways to play with this. This isn't. There are ways in which sometimes a little bit of idiosyncrasy is part of the pattern. We've talked about this in other videos, but I won't go into it right now. But as a basic pattern, we have to understand that that is how things exist through sacrificing idiosyncrasy. And also, let's say, different aspects of the group have to give aspects of themselves up in order to participate in their higher being. All right, so it's a good way to understand emergence in general. So we understand that this is the basic idea of how Gerard works. And you can understand it as a good way of understanding how all things exist. And the idea is that mimetic sacrifice, the way that Girard defines it, is useful. But I think that Girard really focuses on the scapegoat part. But what you realize is that there are many types of sacrifices which will participate in things existing, and they don't all fit with the notion of mimetic sacrifice. You can understand, like I've said, that the idea of giving up, right? The idea of giving up towards our identity is not exactly the same as mimetic sacrifice. Taxes is the best way to understand sacrifice up the hierarchy towards towards higher level beings. But there's also a way in which we sacrifice down, in which the higher level beings will also give part of itself down to the lower beings. I've mentioned this before. You see that of course, in the idea of the emperor giving bread to the masses. You know, you see that also in the sense of, let's say, the state offering services to the people and so taking that which it has received, but also not just using it for its own self existence. It has to give back down towards the group. So imagine a king, for example, that takes taxes, and then the king doesn't do anything for the people. At some point they're going to kill the king. At some point they're going to get rid of him. But if the king offers protection and offers that which I talked about in the outset, which is to maintain the identity of the group, to maintain it towards a purpose that the group cares about, then people will accept to give up to the higher being in order to receive back down a kind of order, a kind of structure and protection from the outside. And so, but the king has to offer that he has to sacrifice back down towards the group in order for the. So that this is the type of exchange that happens. So you can see that often in the ritualized sacrifices, you'll see that this is happening at the same time where someone will take an animal that is usually, you know, a good animal, like the best animal, something unblemished or something, and they will give up towards the God that binds the group together. But then that will already immediately come back down on them, and then they will eat the meat of the sacrifice. And so we give up and then we receive at the same time. And this might seem weird for people because. Because they think, you know, it's like, why are you giving it up to God? Why don't you just eat the animal? But we have to understand that ritual behavior is a way to bind us towards a common purpose and towards a common reason why we exist together. And so when we know that everybody is doing this, everybody is offering up a sacrifice to the thing that binds us together, to the identity that binds us together. And then ritually, we then all engage in the bounty that that offers us, then we are binding together as a community. So this is, this is. I know people are now, I know atheists are going to freak out. They're going to be like, what? This doesn't make any sense. But you have to understand it fractally. You have to understand it. This is what we do all the time, right? Imagine a family. You, you invite your family over for dinner, and then everybody brings a meal, everybody brings some food, everybody brings a dish. And then we all put it together towards the thing that binds us together, which is that we are a family and we exist together with a common care and a common identity and a common purpose. And then as we all put that together and we offer it up to the, to our family, then it comes back down and we sit at a table and then we celebrate what are we celebrating? We're celebrating our family. We're celebrating the thing that binds us together. And so we offer up food, we sit together at a table, and then we eat together. And you say, well, why don't you just sit at home and just eat, Just take food and eat it? You know, why would you do something like that? And this is where people don't. Like I said, people are ignorant of why it is that humans exist together in the first place. And so ritual sacrifice that is offered up to a God is one level higher than the type of behavior that you engage with when you are getting together as a family for Thanksgiving and everybody bringing some food and then eating together. You know, and there's a. And it's, and it's important because if you don't eat the food, then your family is, it's a, it will be an image of your family not being together, by the way. I hope you know that, right? If your aunt brings some food and nobody eats the food that the one aunt brings, then that will reflect the manner in which her sacrifice is not accepted, her sacrifice is rejected, and that she is not, not really bound together in the proper way. And you know that that's true. By the way, if you have a family that you actually care about, you realize that this is something you have to think about. And so, so you can see different versions of this. You can realize that there, there are different types of ways in which this happens. So for example, ritualized manners in which you give towards authorities in order to avoid the problems. The best way to understand it is of course, the tribute. Because you imagine that a king comes into your land, he's not really your king yet, and he basically demands tribute. He says, give me this amount every year. And why is he saying that? It's a racket, right? He's saying that because it's protection money. He's saying, pay me this amount every year, and if you don't, then I will come and I will pillage your land and I will rape your women and I will take your children. And so the ritualization of the behavior will avoid the cost of it at the ground. It will avoid the king having to have his soldiers die. It will avoid the people having their people died and killed and raped. And it will become a ritualized manner in which we sacrifice one part of what we have up to this higher level authority that is coming to us in order to, in order to, to impose its authority on it. So this is not good or bad, guys. This is not about Sacrificing is good, sacrificing is bad. It's just about how the world works. This is how the world works and you can't get away from it. This is just the manner in which it works. So it helps you really see the double sidedness of all of these authorities, of all civilization, of the manner in which authority structures exist are always double sided. You can see the positive aspect in which, you know, the idea that the king will cover you and will protect you, or the state will cover you and will protect you in order to, in order to hold your identity together. But you can also see it, how it can become tyrannical and it can be basically protection money that you have to pay or else they're going to put you in jail. So pay your taxes or else you go to jail. Even if you don't believe. At some point authority becomes inescapable in the world, all right? And so we have to then understand that the direct relationship, if you see that there's a relationship between human sacrifice and war, you know, you can see that when you fight a war. Once again, people think that identities exist. Just, just exist. They don't just exist. I have an identity. I have a city, I have a clan. I have things, a group of people that I identify as having one identity. And now all of a sudden that group that I identify as one is threatened by a group on the outside. Now why do I care? Why don't I just give in and cease to exist and become part of that other group? Because I care about these things. I care because also if I am taken over by another group, I will lose the value of what binds me together. I'll become a slave for the other group. I'll become a lower part of the group that's attacking me. And so I want to preserve my identity. I want to preserve the identity of my group. And so I understand in war that I am willing because I don't know what's going to happen, right? If I am, if I am a group and I'm attacking another group in order to expand my identity, expand my power, expand my influence, expand my glory, I don't even know, I don't know what's going to happen. But I am betting on the future that I am willing to sacrifice members of my group in order to reach that goal that I care about. And the same goes for the protective side. I am being attacked by another group. Why don't we just scatter? Why don't we just run away? Why don't we Just, why don't we just, you know, cease to exist? And I'm like, no, I want to continue to exist, and I am willing to sacrifice members of my group. I'm willing to kill them for this higher purpose in order to continue to exist as a group. And so there's a direct relationship between war and human sacrifice, and we understand it. If you look at the different rituals that happen and the manner in which human sacrifice was practiced in different civilizations, you will realize that that is the case. You will realize in the things that we recognize more, let's say, more directly as being human sacrifice, which is the notion of ritually killing someone in a. In a very formal way, that it is just a way to avoid the cost of the normal protection and, let's say, expansion of my identity. And so that is why, for example, you can understand that let's say when the Romans took over Gaul, took over a certain amount of the country, they realize that they also don't want to totally decimate the other people and take over their land. There's something that. It's not even to their advantage to do that because those are resources that they. That they want to use. So in order to mark their authority, in order to stop the killing, one of the things that they will do is that they would. They would sacrifice their enemies. So they would take some people, some. Some of the leaders, or they would take a certain amount of people from the. From the enemy group, and they would ritually kill them in order to mark the way the man in which they ruled that group, in order to mark the expansion of their authority to declare it, to say, we have taken over this, this land, we have taken over this people, we've taken over this power. And you see that this happens in many, many civilizations where the killing of a slave, for example, or the killing of an enemy, a captured enemy, is part of the behavior because they want to mark their power on the other, but they also want to limit the cost. They don't want to just slaughter everybody. And this is real politic, guys. Like, I'm not. I'm not skimming, skimping at how the world works. But what you realize is that sacrifice is inevitable. You know, it is part of identity itself. And once you realize this, you realize that it also explains a lot of other types of sacrifices, but which is, for example, the sacrifice of food. And so sometimes we. It doesn't have to always have to be meat. It could be grain, it could be all kinds of things. The pouring out of libations, all These types of sacrifices will be ritualized ways of marking giving up either up towards the higher purpose of the group in order for all of us to recognize that we are bound to this. To this. It's about attention that we are bound to this purpose of. Or down. Sometimes you also give down to your fallen ones. You know, this idea of pouring one out for the lost, for the lost ones, where you pour out a drink on the ground in order to commemorate the dead. You can understand that this is also a manner in which to preserve the memory of our group, to preserve the idea that we are together by remembering those that are fallen and creating once again this sense of cohesion not just in space, but also in time with the people that were that preceded us. And so giving out food to the dead is a manner in which we can remain bound to them through the all. Through the sacrifice of something that is precious to us. All right, all right, so I'm not going through all of it, but hopefully you're starting to see how this works and how. Why it is that sacrifice is part of human reality. In the ritualized sacrifice, you end up having different types of sacrifices. You can imagine that in terms of, especially in terms of human sacrifice, you can imagine that there is the scapegoat sacrifice that I talked about, but that there's also like the sacrifice to found a city. So you realize that a lot of civilizations participate in human sacrifices in order to found cities, in order also to found houses. So you find under houses, the under posts, let's say that hold up houses, you will find human remains of people that were killed or sacrificed and put under the house of. In order to hold the house up. So of course, we're all materialists. We're all, we're all scientists. And so we think that that's superstitious. Why would you kill someone and put them under the post of a house? To hold up the house. And this is of course, where we struggle to understand different types of causality. We don't understand that if you make, if you put something precious as the foundation of your home, if you sacrifice something precious in order to bind even a building together, even, even, even a family together, then that will hold it. And it will, it will hold it not through weird superstitious means. It will hold it through attention. It will hold it through the knowing of, of, of. And there's It. It can become quite subtle, but nonetheless, there's. Even if just the person that does something like that understand what they paid, the price that they're paying. In order to exist together in a home, in a house, in order for things to bind together, then they will do it. Now, I'm not trying to defend human sacrifice. I obviously do not believe in human sacrifice. I'm a Christian. I think that the story of Christ has solved the problem of human sacrifice. Because there is something itchy about it. And we realize that. We realize as we look at how it develops and moves towards animal sacrifice. And then moves ultimately towards more subtle forms of sacrifice. That there's a refining of the sacrifice system. But to simply deny it and think that it's completely. It makes absolutely no sense. And not to understand that why it is. That why it exists is also being extremely naive and not understanding how it works. And so you can understand how people would sacrifice things in order to get from higher authorities. And that could be ritualized into the sacrifice to a God. A sacrifice to a God in the sense of the God as the principality. As the top of what it is that binds us together. And so just to go back over what we talked about, just in terms of going back over the idea that there are different levels of ritualization in killing. All killing is to a certain extent ritualized. Because it is done with a purpose. And therefore has to be done towards that purpose. But there are different levels of ritualizations, of course, in killing. And you can understand how this is what happens in the animal kingdom itself, where it's. And even you can realize that it's not just even about killing. Sometimes you don't even kill. Sometimes you can create the pattern of sacrifice in a manner which is dedication. And so you see that in scripture, for example, where people would dedicate themselves to the temple, for example, you see that in Scripture, where someone is given to God and that person lives in the temple and then becomes a servant of the temple. The idea that you would give up your men to be in the army. And so you give up, at least one of your sons will become a priest, for example. These are ways in which we understand that when we talk about even human sacrifice. It doesn't necessarily mean that someone has to die, but it means that we give up someone to a higher good. And then that binds us together. So the idea of, let's say, this idea in Catholic countries. Where every family kind of had to have one, a member of their family, become a priest, let's say, was this kind of giving up towards a higher purpose. But of course, you see that even just in animal behavior, where an animal is killed. And then the best part of that killed animal will be given up towards the alpha male. Let's say we talk about scapegoat sacrifices. And we have this idea, for example, in Scripture, that the firstborn is dedicated to God. And you can understand how in some cultures, this type of thinking would lead to actually killing your firstborn, which seems crazy to us, but we have a sense in which the firstborn has to kind of embody, in a way, the highest ideal of our family. And I know that this is going to sound weird, but there's a sense in which the best part is given up towards the ideal. That's where you can understand also why there is that in war, why we have the sense in which we give up our best men in order for them to fight and to die for the cause of our nation. There's very little difference between the two. It's just that one is more ritualized, let's say, than the other and will usually also lead to less killing. Because in a war there is ritualization, but it can become very messy. And the number of people that die and the number of people that end up getting sacrificed for the unity of our group is much larger than in human sacrifice. So you can understand why in human sacrifice, there was a way in which this was a way to have an economic way of killing in order to attain the goal that something like war ends up attaining. All right. And so you can understand how in different cultures, then there would also be initiation sacrifices. And so there are many examples of that. For example, the Spartans, when the Spartan citizens reached a certain age of initiation, One of the things that they would do is there would be a certain amount of time in which they were. It was fair game to kill any servant in the land. And so the Spartans would go out and they would murder the as many serfs and as many. As many slaves as they could in order to mark their capacity to be a Spartan. It was an initiation sacrifice. We see that, of course, in different gang initiations and the legends of gangs initiation. Some of them are maybe not actually embodied, but the stories of them still kind of imbibe our culture. You know, you have this idea that if you're a member of the Aryan brotherhood or whatever, you have to kill a rival in order to participate in order to be a member. Sometimes you don't necessarily have to kill to be a member, but if you do kill a rival gang member, or if you kill someone from another gang, or if you even kill an innocent person, then that will make you go up in the hierarchy, that it becomes a form of Marking the outside by killing that which is outside, or eliminating something which is weak inside the group, a rival that you're able to beat in order to make the group stronger and to bind you together. There's also a manner in which acting in that scandalous way. This is something that you see in mimetic, in mimetic sacrifice, is that there's something about doing something horrible like killing another human being that you recognize as being a mirror of you, right? Humans are different from animals because you see in their face a mirror of yourself. And so the idea that to go into something as scandalous as killing another human being and doing it as a group or doing it for a group becomes the ultimate marker of participating in a scandal by which we exist together. This is of course, especially true in criminal organizations where the idea that if you're willing to kill someone in order to be part of this group, then we can trust your, we can trust the fact that you care about our group more than anything else, that this is what you, you completely care about. And so killing becomes a very powerful tool for any kind of criminal syndicate. It offers all kinds of solutions to the problem of existing in an illegitimate end of. And a. In something which is illegal and something which is criminal, is that if you get people to kill others or you make it part of the way in which you scale up the, the hierarchy of a criminal organization, then you are not only participating in a scandalous act together, but you are, you are also making them dependent on you because you know that they killed someone and that this binds them to you in ways that are more than one. Let's say, by knowing about this person's scandal, then they also become, they owe you because you could always denounce them. You know, you, you, you share something together which, which is the knowledge that you've all killed someone together, that you've all killed someone. So these are all ways in which initiation sacrifices are a way of participating in human sacrifice that works. It actually works in order to bind a group together. It's horrible, but it works. And so you realize that in The Gospel of St. John, you actually have a very short definition of what it is that sacrifice is, human sacrifice especially. And you have it when, when the, the Sanhedrin are questioning or wondering what to do about this Jesus fellow. And because they can see that Jesus is causing problems, you know, through the, the turning over of the, the tables in the temple, through the resurrection of Lazarus, he's attracting a lot of attention to himself, to the Jews, they're Scared of the Romans. They're scared about also the people, what the people are seeing and how it's. It's destabilizing their group. And so, you know, the. One of the members of the Sanhedrit says, you do not realize that it is better for you that one man die for the people than that the whole nation perish. And so the idea of being able to eliminate one person, you know, by, by the Sanhedrin, killing this one person, they would be one marking their allegiance to Rome by saying, we're denouncing a traitor. Right. They're also binding themselves together by participating in killing this ultimately innocent person. All of this is happening at the same time. They realize that by doing this, then they will bind themselves together. And so in this case, of course, you realize that in many civilizations this type of function when you realize that until very recently, executions were always public. So the public execution is a way, is another form of human sacrifice where we kill someone in public. We make sure everybody sees that. And we realize that by doing that, we are going to mark the limit of behavior in our society in a very dramatic and powerful way. Of course, political assassinations are that as well. We realize that if I can just kill this member of this enemy team, this enemy group of this enemy nation, if I can just kill bin Laden, then there'll be less bloodshed. So I will. We will bind together to kill this one person in order to bind to. To preserve the identity of our group. Because we realize that if we do that, then we don't have to go to war or the war that we are having with the other people is going to be diminished by killing these few people, let's say, and this is going to be very controversial, but there is a manner in which the watching of George Floyd dying, the killing of George Floyd ended up being something like a human sacrifice. It ended up being something like someone dying and then binding care together and trying to create a social cohesion under the death of one person. So George Floyd gets killed. And then people, massive people all over the world demonstrate in the street for days and days and weeks. Cities. You know, there's a sense in which there's this catharsis which happens that is exactly the type of catharsis that would happen in any. In any kind of human sacrifice. But strangely enough, it's, it's. It's actually closer to the Christian version of human sacrifice because there is a serious problem with sacrifice and what it does because it is nonetheless the ritual. There's something which, when we look into the face of another human being and we see that mirror. There's something about killing someone else which is very different, like I said, from killing an animal. And so there's a manner in which it seems like in human culture there was something bubbling. There was something bubbling up to help us understand that there's something off about the manner in which we do that. There's something in the reflection of myself in the other which makes this type of behavior something unacceptable. And this is, of course, what ultimately leads to. This is why Renee Girard says that the fact that in the story of Jesus Christ, we see the ritual scapegoat sacrifice from the point. Point of view of the one who is sacrificed, that it actually collapses and completely resolves in a manner, the problem and the reality of the scapegoat sacrifice. Because the victim of scapegoat sacrificing is often innocent, because the problem of desire is there in the group. And so we. The fact that we throw all our. The sins of the group onto one person. Person is of course, too much for that person to bear. And this is a. It's somewhat like a. A momentary binding, but it's a cycle, like this constant cycle of you have to keep doing that over and over in order to refresh and to rebind you together. Now, in the Christian story, we have a sense in which as we take the place of the sacrificed one, as we take the position of the sacrificed one, then it is actually revealing the mechanism of the scapegoat sacrifice and in a way heals it or recasts it in a different manner. And it also. I've talked about this before. It actually exposes a secret about reality, which is that the true manner in which things bind together and hold together and is through self sacrifice. It is not through sacrificing other things, although it works, but ultimately we realize that it is. If I want my family to bind together, I have to sacrifice my idiosyncrasies to the common goal. I have to give myself to the love that exists in my family. And that is the proper way for a family to exist. I could find a black sheep in the family. We could have one of the. The chill, one of our many children in the. In the. The family represents the black sheep. They're always to blame. It's always their fault. It's always. They're the ones who are responsible for all our woes. And it works, right? It actually will bind it together, but it will leave this residue, this dark residue on the outside and what that does is it, it creates the cycle where it has to. We have to keep this black sheep there or recast it into someone else in order for the group to continue to exist. What the Christian story reveals is that the proper way and the best way for a group to exist is that if we all sacrifice ourselves towards the love that we have together, let's say in a family, then that will be the proper way for the group to exist and it will be a stronger way and a healthier way for a group to bind together. And so what we see in the George Floyd thing is a weird version of this position where now the victim is elevated and now the victim becomes that which binds people towards a common purpose and is policy making. It's actually leads policy. You know, laws were changed, budgets were changed, things were realigned in the wake of people watching George Floyd die. And so if you don't think that that's a kind of human sacrifice, I don't know what to tell you because it worked. It, I mean it worked in the sense that it created one person dying, changed laws all over the United States. So you can bicker and tell me that I'm, I'm being, I'm exaggerating and saying that it's, it was, it's participating in the pattern of human sacrifice. But then why is it changing things? Why is it actually rebinding since society towards different purposes? How did it do that if it doesn't, if it's not effective, if one person dying can't change the way society, or redirect or rebind or recast society. I don't know what to tell you. Once you also start to see it this way, you realize that the modern geopolitical world is based on several sacrifices, but two very large human sacrifices. And the stability of the modern world is based on two sacrifices, one which was the Holocaust, which even uses language of sacrifice. We continue to say the Holocaust. And I'm sure that our atheist friends won't dare use another words besides Holocaust. Why? Because you don't get to decide whether or not it works that way. And so the Holocaust functions as a rebinding of society where living in that, in the, in the fact of that sacrifice. I'm not just. It's not about justifying it, it's about what it does, what effect it had. And so we constantly remember, we remember the Holocaust has become part of the narrative which holds the Western world together. That we did this, remembering that we did this, that, that the west did this, that, that Some people were willing to go this far as to kill all these innocents. And it. It created international law. It created all these things that bind us. But there's another one too, and which is, of course, Hiroshima and Nagasaki. It's a classic example of human sacrifice because the United States calculated they don't know what's going to happen. The United States don't know the future. They can't completely tell the future. But they realize that if we kill these innocent people, if we destroy entire cities, then we make a bet that it will rebind us together at a higher level, that it will stop the war. I mean, that is exactly what ritualized sacrifice is. We calculate that if we engage in this one ritual act of slaughtering innocents, thousands and thousands and tens of thousands of innocents, then it will heal us, and we will. And it will rebind our society. Now, I don't. I am scandalized by both of these, but I'm not stupid enough. I'm smart enough to realize that it worked, that it happened, and it participates exactly in the pattern of human sacrifice that happened thousands of years ago. There's no difference in terms of the pattern. There's only a difference if you want to create a weird autonomous category called religion. But if you don't, then you realize that it works and that it happened. And so, first of all, let's look then at abortion. What is abortion? Abortion is exactly the same thing. Abortion is exactly that. Someone gets pregnant and now they have something that they care about. They have a purpose. They have something which they think is important and which binds their being towards a purpose. And all of a sudden, something gets in the way. This. This burgeoning human in them gets in the way. And they don't know with the future. How could you know the future? You don't know what's going to happen. But they make a bet. And they identify the fetus, they identify the child in their body as the cause of why they're not going to be able to reach their goal. They identify it as something which is. Is the reason. It's the scapegoat. It's exactly what a scapegoat sacrifice is. They're saying it's that thing's fault, it's that person's fault. And they dehumanize the fetus like it's the fetus's fault that I'm not going to be able to accomplish my purpose and my goal. And so I will sacrifice it to my purpose. And once I get rid of that, of the reason why I can't reach my purpose, then I'm rebounding towards the purpose which I had in the first place. And so I don't know what to say. I mean, I don't know what to say besides that it participates in the same pattern. It's just. It's just a. It's not understood as religious, it doesn't matter. But it nonetheless participates in the same pattern. And so let's get to the second part of the tweet that I said that I wouldn't be surprised if elites engage in ritualized human sacrifice. Now, I'm not saying that they do. I don't know if they do. I'm saying I wouldn't be surprised if they did. And why would I not be surprised if they did? Because I look around me and I see that criminal syndicates use killing as initiation methods. They've used it for thousands of years, whether it's the Spartans or whether it's the Hell's Angels, they use killing as initiation mechanisms. And I'm not saying that all the elites function as initial criminal syndicates, but there are certainly some elites that function as criminal syndicates. And to the extent that they function as criminal organizations and syndicates and they use the same patterns and structures as the mob or the mafia or other criminal syndicates, then why would I be surprised that they would use killing as initiation sacrifices? I mean, I don't know if they do, but I wouldn't be surprised if they did, because it's a human universal, and you see it in civilizations that date thousands of years ago, and you see it in the streets of big cities today. And so I don't. I don't see why that's weird. And I. It's only weird, like I said, for someone who creates a weird little distinct category called religion, a category that they don't understand, a category that they can just like, count off as superstitious and stupid and ridiculous, although it's a human universal, and then makes them feel safe that they don't have to understand this. And then it makes them blind to all these other behaviors that human have that are ritualized and that could be really understood if they took a little bit of time to understand, to understand what religious. What they call religious behaviors are. And so hopefully this was scandalous enough for you and. But helpful also to understand that this isn't. There's no taboos. We're not going to pretend, you know, we need to understand why humans do certain things. And if we can understand it, then it will Help us also understand the best version of that. Because I believe the Christian story is the best version of that. I believe the true sacrifice is self sacrifice. And I can explain why and I can tell you why and I can see it as the culmination and the reversal of this whole pattern of sacrifice. But if you don't try to understand it and you can't tell me why you think self sacrifice and you believe it for some amorphous, strange reason that nobody understands why it, why it is the most important, then before you know it, you're going to be calling for the death of who knows what scapegoat that you're going to find. Whether right now we can kind of see if it coming up again where, you know, Facebook has allowed us to wish for the death of people of a certain nation. And we just do that without realizing that once again. And whether, whether they are responsible or not responsible. You know, like I want, I don't, certainly don't want to defend what's. What they're doing right now. But nonetheless it's still participating in this pattern that we think that we are, we are somehow anyways, it's good to try to understand what sacrifice is and it was helpful to. To understand a lot of symbolic behavior. So hopefully this has been useful and, and yeah. So we'll talk to you very soon. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially going to www.thesymbolicworld.com support or else on Patreon, the Pageau videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
