{"episode_id":"SW - #010 - 2018-08-01 - Divine Patterns In The Life Of Moses","start":0.56,"end":104.94,"speaker":"Jonathan Pageau","text":"Hello, everyone. I'd like to welcome you to the 10th episode of the Symbolic World podcast. In this episode, I'm going to play a talk that I gave at the climicus conference in 2016. It's the second part of two. I had already posted the first part in episode three, called Encountering God and Stories. In this particular talk, I go in depth into the book the Life of Moses by St. Gregory of Nyssa. And I tried to pull out how the pattern of the book and the pattern of the story that it interprets are really an extremely powerful pattern that is at the basis of a lot of the world. I hesitated a little bit to put it up. I think you can follow the talk quite easily. But towards the end of the talk, I show a series of icons, and I try to show the audience that the icons, some of the very traditional icons in the Orthodox Church, are actually constructed with the same pattern that we find in St. Gregory's book. And so, of course, in the audio version, you won't be able to see those, but I will put some links in the podcast description to a place where you can find all those icons, because there is a transcript version of this posted on the Orthodox Arts Journal. And so I hope you enjoy this, and I will see you soon. This is Jonathan Pageau. Welcome to the Symbolic World."}
{"episode_id":"SW - #010 - 2018-08-01 - Divine Patterns In The Life Of Moses","start":116.42,"end":863.05,"speaker":"Jonathan Pageau","text":"Now I'm going to talk to you. I'm going to talk to you about a book by St. Gregory of Nyssa. It's called the Life of Moses. And there's. I checked it out. There's a few copies of it, of it back there. If you have never read this book, you really have to read this book. The theme of the conference is encountering God. And I have to be honest, when I was exploring Orthodoxy, when I was a catechumen, just trying to figure, figuring things out When I read St. Gregory's book, I mean, coming from a Protestant background, having all the Bible stories just, you know, really deeply in my memory, reading, reading St. Gregory's book is just. Was like constant lightning bolt. I was just reading the book and just couldn't believe it. He was just connecting everything together and making everything just make so much sense, you know? And so what I was hoping to do, and I've never done this before, is that as I continued my life, as I continued, as I converted, as I explored iconography, as I explored other writers, I would just always come back in the back of my mind. I realized that I had this program running in the back of my mind, and it was basically St. Gregory's book. And it just informs. Yesterday I told you about, talked about patterns and stories and this book, what St. Gregory does is the pattern is there in the scripture, but what St. Gregory does is the way he speaks about things and the analogies that he threads together, he just shows it to you. So what I'm going to try to do today is I'm going to try to take you on that journey. I'm going to try to trace the basic pattern in St. Gregory's book. Now, his book is extremely expansive. He talks about a lot of things I could never. You can't. I couldn't capture it all here. But I'm going to trace a basic pattern about. Of what's in there. And hopefully it will help people understand, first of all, what I'm talking about when I talk about these patterns. And then, as everybody here has, we all have the experience of the liturgy, the experience of Scripture, hopefully it will. It will spark some of your intuitions to kind of start to see those connections. I mean, everybody has already seen them, but hopefully it will be a part of. To help you to get through that experience. So the idea is that in St. Gregory's book or in the Scripture and everything, he traces a pattern of the world, basically a pattern of the cosmos. And when I talk about a pattern or a map of the world, we're not talking about the kind of map that you get on Google Maps or, you know, like a physical map, but it's a map of meanings that are threaded together. And really what it is, it's a map of our own journey. It's a map of our ascent up the Ladder, of divine ascent. Because the story in St. Gregory's book, the basic structure of his stories, he traces the life of Moses as he ascends up the mountain. And this ascent up the mountain is basically the same as what we're seeing in this icon of the ascent of the Holy Ladder. And so going up the mountain is this gradual ascent towards divinity, but at the same time, it's our participation in the church. If you look at the icon that's up now, you can see that. You can see that the beginning of the Ladder is the church, and then through the church and up the Ladder, we move up towards this divine encounter which we find at the top of the Ladder. And so in St. Gregory, what he does is he connects all these things together. So the base of the mountain that Moses is going to ascend, what he does is he gives us these images of what the base of the mountain looks like. Or what it looks like before we begin the journey, before we enter onto the journey. And the images that he uses are all these images of flesh, these images of all the things that are outside our nature, all these things that are added to our nature and the things that are foreign to us. And the basic image that he threads through is these image of the garments of skin. When Adam and Eve fell in the garden, what God gave them as they were chased away from the garden were these garments of skin around them, these garments of dead animal skins. And that's like, that's the basic image that St. Gregory uses as the bottom of the. Of the mountain. So here's. This is going to be our mountain people. It's going to be very simple. I'm not an artist today. I'm just a speaker. And so the bottom of the mountain, told you, is the garments of skin. But it's also, we could say that it's the narthex, okay? So it's the place where the church ends and the world begins. So the bottom of the mountain is what Gregory calls the feet of the soul. And it's the passionate and appetitive parts of our soul. It's where our appetites, our passions are located in the human soul. And so the top of the mountain is the place where we encounter God. So it's the intellect, it's the higher part of the soul where we're capable of grasping the nature of things. But at the same time, because the bottom of the soul, the bottom of the mountain, is the nartex, then the top, the top of the mountain also appears as the sanctuary. And as we talked about yesterday, beyond the sanctuary, in the highest place of our being, that's where we encounter this divine tabernacle. That's where. That's where Moses received the pattern of the divine tabernacle. And the Divine Tabernacle I, St. Gregory told us that's Christ himself. Okay? It's Christ as the universal origin and container of all things. So that's the basic pattern already giving you just the basic pattern that St. Gregory traces in the book. And what it does is it joins, if you look at the elements already there, it joins the personal to the communal. So it's a body, but it's a community as the church. And then ultimately it leads us up to what is the most, to the highest, to the spiritual and to the uncreated. And so when I'm, as you see what I'm starting to do, and this is what I'm going to be doing, is that I'm going to use St. Gregory's words, and I'm actually going to create a. A visual map of what he is, of the journey that he's bringing us on. And at the end, you'll see why I'm doing that. Now, the first important thing as we do this, as we look at the elements that St. Gregory brings together, and this is a rule, I think, for all our interpretations of symbols in the Bible or in the Liturgy, is that symbols are not moral things. That is, the elements that we find in the liturgy or the elements that we find in the Bible, they're neither. They're not necessarily good or bad, the things in themselves. So they're places of meaning, you could say. So what's important on this map of meaning isn't so much where the thing is on the map, but which direction is it pointing to. So if you think back at that, at that ladder of divine ascent, it doesn't matter how high you are on the ladder, if you're falling down, you're falling down. If you're at the bottom of the ladder, but you're going up, you're in a much better place than that person at the top who's falling down. And so everything in this map of meaning has a dual possibility. We could say it could have a light side or a dark side. And so because we're talking about a trip, I'm going to start with the actual movement of the trip. And in the movement of the mountain, there's two possibilities, right? You can go up or it can come down. And in St. Gregory's description of this, it's actually. It's very. It's really interesting because he shows us this duality, how the same thing can have a light and a dark side. And so the way he does is he talks about Aaron's. About Moses, Brother Aaron. Okay, So I hope everybody knows the story of Moses, because I'm not going to go through too much of the details of the actual story. But Aaron was Moses brother, and God chose Aaron to be Moses helper. So the way St. Gregory interprets that is he says that Aaron is akin is analogical to our guardian angel, that angel that God places with us to counsel us, to entice us into making that ascent up the divine ladder up the mountain. And the angel does this through reasonable thoughts and through encouragement. But if you know the story of Moses, you know that Aaron is also the one who made the golden calf, right? And who brought the. Brought Israel to engage in licentiousness and idolatry so how do we reconcile those two things so. Well, Gregory tells us a secret. He tells us that, quote, there's a doctrine which derives its trustworthiness from the tradition of the Fathers, which says that after our nature fell into sin, God did not disregard our fall and withhold his providence. No. On the one hand, he appointed an angel with an incorporeal nature to help in the life of each person. And on the other hand, he also appointed a corrupter who, by an evil and maleficent demon, afflicts the life of man and contrives against our nature. Okay, so what are we talking about? I think most people here would know what he's referring to. And what he's referring to is this. And I think. I mean, the faster that we just reconcile ourselves with the fact that this is what he's talking about the best. Because the imagery might seem silly on a first reading, but it's only silly if we're materialists who think that angels are, you know, fleshy people with wings and devils have spiky tails. But once we get rid of the materialist blindfold that often entraps us, then we experience this every day of our lives. I mean, anybody who has fought a passion or else given into a passion, then suddenly wakes up and think, like, why did I do that? You know, where does that come from? I mean, everybody knows that we have this fight in us all the time. But if you're struggling with this image, if you find it too difficult to accept, I mean, I've already showed you this image in iconic form at the beginning. It's this one. Look at what's happening on that image. On one side, there are the angels encouraging, and on the other side, there are the demons bringing down. All right, so the brother who is our counselor, we could call him that little voice in our head, our conscious, whatever you want to call it, can become a vehicle for the angel or the demon, depending on which side the person decides to go."}
{"episode_id":"SW - #010 - 2018-08-01 - Divine Patterns In The Life Of Moses","start":863.37,"end":863.73,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #010 - 2018-08-01 - Divine Patterns In The Life Of Moses","start":863.73,"end":919.01,"speaker":"Jonathan Pageau","text":"Which way we decide to move. So now we've got this notion of movement. So we can start the trip. We can start the trip. St. Gregory starts at the beginning of Moses journey. He starts at the birth of Moses. And as most of you know, when Moses was born, there was a law. Pharaoh made a law because there were too many Israelite children. And the law was that all the male children were to be killed. And so St. Gregory interprets this, and he tells us for the material and passionate disposition to which human nature is carried, when it falls is the female form of life, whose birth is favored by the tyrant. The austerity and intensity of virtue is the male birth, which is hostile to the tyrant and suspected of insurrection against his rule. So am I in trouble?"}
{"episode_id":"SW - #010 - 2018-08-01 - Divine Patterns In The Life Of Moses","start":919.49,"end":919.93,"speaker":"Jonathan Pageau","text":"Yes."}
{"episode_id":"SW - #010 - 2018-08-01 - Divine Patterns In The Life Of Moses","start":919.93,"end":963.23,"speaker":"Jonathan Pageau","text":"All right, We've got materiality and passions related to the female form, and austerity and virtue related to the male, okay? So right away, our modern minds are bothered with this, and I can understand that. I totally get it. But we. Just hold that thought, okay? Just hold it just a little bit, okay? Because if you really read that quote, I'm going to make you read it again. If you really read that quote, you'll see that hiding in that quote, actually also the dark side of the masculine, okay? And that's the tyrant, okay? So don't worry. Everything will balance out."}
{"episode_id":"SW - #010 - 2018-08-01 - Divine Patterns In The Life Of Moses","start":963.23,"end":963.63,"speaker":"Jonathan Pageau","text":"You'll see."}
{"episode_id":"SW - #010 - 2018-08-01 - Divine Patterns In The Life Of Moses","start":963.63,"end":2608.54,"speaker":"Jonathan Pageau","text":"St. Gregory balances everything out. In fact, St. Gregory starts by telling us that Moses, right, that Moses had two mothers, okay? And because in order to protect Moses from the pharaoh, he's placed in a basket. We know the story. Placed in a basket on the Nile and found by an Egyptian princess. So St. Gregory tells us the daughter of the king, being childless and barren, I think she's rightly perceived as profane philosophy, arranged to be called his mother by adopting the youngster. For truly barren is profane education. So the adoptive mother of Moses is knowledge of the world. It's profane natural philosophy Today, we would say science, technology, all that type of knowledge. And St. Gregory warns us that it can sometimes impede our spiritual journey. And this is the foreign princess, but Moses birth mother, who continued to care for him while he was being raised by the Egyptian. Well, Gregory tells us that it's the church and it's teaching. So already now we start to see, right at the beginning, we start to see the other side of the feminine, which appears. So the feminine is the periphery in the sense of the womb, okay? The feminine, that which surrounds us. But at the risk of going into cliches, sometimes cliches are useful. It is both the womb and the tomb, if you will. So St. Gregory uses the image of a fruitful womb in his natural mother compared to a quote, womb of barren wisdom. So what it is, it's both the church which contains us, but also the outer world, which is our dissipation, okay? So two things which surround us. So that's why it is the periphery. It's both the church which contains us and the outer world which is our dissipation. So if we. If we continue with this idea of periphery, we've already talked about the foreign princess. And so what Gregory develops is this idea of the foreign. Is this idea of the foreign as this outside thing. So Gregory develops this whole idea that the subjugation of the Israelites to the Egyptians in the book of Exodus is an image of the subjugation of the human person to what is added or exterior to our nature. We could be the tyranny of our flesh, our desires, but it could also be these foreign. Foreign knowledge, foreign education, all these things which are on the outside, which. Which can trap us. So when Moses grows up, we know this story as well. He suddenly feels this attachment to Hebrews, to his own people who are slaves in Egypt. And one day, Moses kills an Egyptian who he sees abusing an Israelite. Moses teaches us by his own example to take our stand with virtue as with a kinsman, and to kill virtue's adversary. The victory of true religion is the death and destruction of idolatry. So slavery to foreign elements, idolatry being the best example of them, can appear like we've seen as tyranny, as the Pharaoh who imposes himself on us. But it can also appear as seduction. And so in the story of Moses, we have these stories of foreign women, women from other nations who. Who seduce the Israelite men and bring idolatry with them. So even after fighting and escaping the foreign tyrants, they fall back through seduction. Quote. It was only to be expected that some among them would be filled with lust for unlawful intercourse with foreigners, unquote. So the foreign women are idolatry, the slavery to our passions. Okay, so am I in trouble again? All right. They are the barren and profane philosophy. But you see, Gregor is not done with us because there is a trick in this story. And the trick is that Moses had a foreign wife, and Moses married a foreign woman. So here again we start to see the two sides of the symbolism start to manifest itself. The foreign wife will follow him. For there are certain things derived from profane education which should not be rejected when we propose to give birth to virtue. Indeed, moral and natural philosophy may become at certain times a comrade friend, a companion of life to a higher way, provided that the offspring of this union introduce nothing of a foreign defilement. And what's really important as Christians to understand in our own symbolism is that Moses wife is the one who circumcises Moses son. Okay, Remember that circumcision is the cutting off of the garments of skin, according to Moses. So the foreskin is removed as this mark of the foreigner, since his son had not been circumcised so as to cut off completely everything hurtful and impure. His wife appeased the angel when she presented her offspring as pure by completely removing that mark by which the foreigner was known. What Gregory does is he beautifully weaves in the image of circumcision with the notion of baptism. Okay? So if the foreign is removed by the foreign wife, so too, in baptism, death is removed by death. Okay? So down there, we could say between the foreign tyranny of the pharaoh and the mountain of the divine ascent, there is that water which is also death. And one must go through the waters in order to begin the journey. So, of course, St. Gregory. For St. Gregory, this is the crossing of the Red Sea. That's what the crossing of the Red Sea means. It's our baptism that commences our journey onto this divine ascent. So Moses split the water, then crossed the Red Sea, pursued by the Egyptians, on whom the water closed, quote. After we have drowned the whole Egyptian person, that is every form of evil in the saving baptism, we emerge alone, dragging along nothing foreign in our subsequent life, unquote. And the garments of skin, this outer fleshy part is called dead and earthly. And they're related to our animal aspect, because that's what they are. They're dead animal skins added to our nature. So, for example, when Moses comes back down from the mountain after his ascent, St. Gregory makes a huge deal to the fact that animals were not allowed to even touch the base of the mountain. He says, quote, that none of the irrational animals was allowed to appear on the mountain signifies, in my opinion, that the contemplation of the intelligibles. In the contemplation of the intelligibles, we surpass the knowledge which originates with the senses, unquote. Now, that sounds Platonic, but we're not done. And this removal of the garments of skin, they appear the strongest when Moses ascends to encounter the burning bush. I mean, if you remember the story, what does God ask Moses to do before he comes to the burning bush? God asked him to remove his sandals. And St. Gregory relates this removal of the sandals to the removal of the garments of skin. Sandaled feet cannot ascend that height where the light of truth is seen. But the dead and earthly covering of skins which was placed around our nature at the beginning must be removed from the feet of the soul. But even this removal finds a surprising duality in St. Gregory, because when St. Gregory describes the burning bush, he insists on the fact that the burning bush was a thorn bush. And he says it few times for you to really notice that it's not just a bush, it's a thorn bush. Now why, why would he insist on the fact that it's a thorn bush? Quote, Moses on that occasion attained to this knowledge of true being. So now does everyone who like him divest himself of the earthly coverings and look to the light shining from the bramble bush, that is, to the radiance which shines upon us through this thorny flesh, which, as the Gospel says, and which is, as the Gospel says, the true light and the truth itself. So think about that quote for a minute. In the book of Genesis, one of the consequences of the fall of Adam and Eve is that creation is going to produce thorns. And that's the hostility of creation appears in the image of thorns. And the garments of skin which God gives to Adam are, are meant to protect them from the consequence of that fall, and the image of which is those thorns on the bushes. But here, just as Moses removes that outer fleshy covering of skin which is the consequence of the fall, where does he see the light? He sees the light coming through the thorn bush, and as St. Gregory says, himself coming through the thorny flesh. So St. Gregory always preserves those two things. All the removals will come back and you'll see. It's an amazing thing to watch. And this question of the periphery, of the bottom of the mountain comes to its limit, which is chaos, complete chaos. And Gregory uses this image of clay, this chaos. So what he does is he connects the slavery of the Israelites in the foreign land to what they're doing in the foreign land. And what are they doing? They're forced to make by a foreigner to make bricks out of clay. For this demon who does men harm and corrupts them, is intensely concerned that his subjects not look to heaven, but that they stoop to earth and make bricks with themselves within themselves, out of the clay. And we have to understand this clay as this half form thing, as this mud. And St. Gregory relates it to the frogs that come out during the plagues, as this ambiguous creature that is both on land and in water, and doesn't have its place. So it's really this chaos that exists on the border of everything. On the border of what? Of what exists. So when we think about the different, if we think about the different elements, I look at them up on the screen. If we think about the different elements of periphery that I've mentioned, it only takes a moment to realize that that's just how we, we experience the world, right the feminine as the womb or right. This house that contains us and the world around. It's the foreigner that we encounter coming from the other side of the border. The passions which make us idolaters and dissipate us to the outside. And the animal, which is the body without the flesh, without reason. And finally, clay, that ambiguity and confusion that comes when order or the center no longer hold. And all of these example, they're how we personally experience this periphery. So we need to be clear that when Moses ascends the mountain, it is really described as a divesting, right? As a removal of those sandals, as the purification from the attachment to peripheral things. And there's also a rarification where the mass of the people stayed down at the bottom of the mountain. And as he moves up, there's this rarification. Father Stephen mentioned that yesterday the 70 go up with Moses. But by the time Moses reaches the very top where he encounters God and receives the law, he is alone. And so from the quantity up to the one. And so it's somewhat like the high priest, who is the only one who can reach all the way into the holy of Holies. And so this echoes the actual shape of a mountain. It's the actual shape of the mountain which is large at the base and just moves up to a narrower and narrower summit. Okay, so when we have this image of a mountain in the Bible as this place of epiphany, as this place of encountering God, it's not arbitrary. The fact of mountains is the very experience going up a mountain and reaching the top. And all of a sudden you see the entire world around you. It's the best image of what it means to enter that unity, which is that connection to what unites everything together. And so the movement up the mountain is the movement up this pattern of meaning which I mentioned. And St. Gregory makes a big deal about that. And this movement is up both, we could say the epistemological and ontological hierarchy of beings. And St. Gregory formulated in a very particular way, he explains that Moses ascent up the mountain is Moses discovery of the true knowledge of being. So by removing the sandals and seeing the light in the bramble bush, and he's moving away from dependent beings. So when I say dependent beings, what I mean is everything, everything that's created is dependent on God. But when we see those things as isolated in themselves, and we don't see them as being connected to God, then that's when they become dangerous. That's when they become. St. Gregory called them a type of falsehood. So as Moses is moving up, he's moving towards being itself, from which dependent beings find their meaning and coherence. And again, that's analogous to the movement up from the multiplicity of the base up to the unity of the summit. The bottom of the mountain is assimilated with darkness. And as Moses goes up, he encounters light and music, the source of visual and auditory meaning. But to enter the divine chamber, the sanctuary, Moses must encounter God in higher darkness, as Father Stephen mentioned yesterday. So, quote, what does it mean that. That Moses entered the darkness and then saw God in it. What is now recounted seems somehow to be contradictory to the first theophany. For then the divine was beheld in light, but now he is seen in darkness. Let us not think that this is at variance with the sequence of things we have contemplated spiritually. Scripture teaches us by this that religious knowledge comes at first to those who perceive it as light. Therefore, it is perceived to be contrary to religion. Is darkness down there? Oops, sorry, I don't have that map up there anymore. And the escape from the darkness comes about when one participates in the light. But as the mind progresses and through an even greater and more perfect diligence, comes to apprehend reality, as it approaches more nearly to contemplation, it sees more clearly what of divine nature is uncontemplated, unquote. And then, as I explained yesterday, even beyond that divine darkness, what does Moses encounter? He encounters the pattern of the tabernacle. Now, the pattern of the tabernacle is extremely fascinating because in its description, we could take that pattern of the tabernacle and we could stretch it out to encompass everything else that we've already seen. Okay, imagine this is the mountain. Now. So, in moving out of the world, so to speak, Moses regains the world. So, for example, in its most hidden place, the tabernacle is equivalent to that lonely place where Moses encountered God and the Menorah, that seventh branch candlestick, which is in the Holy of Holies. St. Gregory makes equivalent to those rays of light of the Spirit, and also to the pillars of the church. And he talks about the pillar. Sorry, he talks about the pillars of the tabernacle, which are the pillars of the church. Quote. All who themselves support the church and become lights through their own works are called pillars and lights. And so the saints, of course, but also all of us who are. Who participate in the life of the church, we become pillars and lights of the church. You are the light of the world, says the Lord to the apostle, unquote. So this light that he sees in the pattern of the tabernacle is the very light that Moses encountered as he was ascending the mountain. And finally, the biggest mystery of all is that on the edge of the tabernacle, the outer cover of that tabernacle is. Is made of animal skins, animal skins which are dyed red. And so the beauty is that just like in the burning bush, those dead skins which were removed in the ascent are found again, though transformed. And what were the enslaving passions are now the passion of Christ. And there's even water down there, if you noticed. As the people entered into the tabernacle, they had to wash themselves before the entrance. Even if one sees skin dyed red and hair woven, the sequence of contemplation is not broken in this way. For the prophetic eye, attaining to a vision of divine things, will see the saving passion there predetermined. It is signified in both the elements mentioned. The redness pointing to blood and the hair to death. And St. Gregory tells us that hair on the body has no feeling, hence it is rightly a symbol of death, unquote. All right, we're starting to get the full image here. One of the things that is encountered by Moses is in the heavenly tabernacle is the pattern of priesthood which is given to Moses. And so this makes this whole pattern, this whole mountain, analogical to the ecclesiastical hierarchy, which is later elaborated in Dionysian theology. But what's fascinating is that in that section where he talks about attaining priesthood and gaining the pattern of priesthood in the divine tabernacle, he also traces now the dark side of the ascent. I told you, everything has two sides. And so there's a dark side to the ascent. He speaks of a false ascent up the mountain. It's the ascent of pride, which can bring men to gain the priesthood for themselves in order to bolster their own passion. And so the passion of licentiousness and of idolatry, which we picture as wallowing in the mire at the bottom of the mountain, now finds its pair in this mock ascent, which is accomplished in pride. So everything, even the ascent, has a light and a dark side. Now, okay, I've only. I've only brushed the surface of what St. Gregory deals with, and I encourage all of you to explore this book on your own and discover the wealth that it. That it offers. But if we look at the map here, I think we have enough elements to get a sense of what this is about. So please look at it carefully. Okay? We have the feminine, which is mother, education, and the church. Or else it is profane knowledge and the world. The foreigner who is the tyranny of idolatry, but is also the profane knowledge and can become our wife and friend as we move forward. We have animality, which are our passions and should be removed, but they can also be transfigured. We have this process of purification, water, fire, baptism, circumcision. We have the masculine, which is Moses in Moses is the virtual individual, but can also be the tyrant and the pharaoh. And we see the brother angel, who is a counselor for good or evil, depending which way we're going. We have the true ascent towards divinity in the priesthood and the false ascent, which is the fruit of pride. And finally, we have the darkness which is encountered at the bottom and at the top of the mountain with light and music in the middle. And above it all there is the divine tabernacle, which is Christ, and which, even beyond the unknowability of divinity, paradoxically resolves all those dualities, gathers all things into himself, unites all opposites, and is simply all in all. Now, try to keep this basic pattern in your memory, okay? It shouldn't be so difficult because in theory, the elements here are intuitive. They should make sense to us on a very basic level. Okay, has everybody got it? Now watch. Do you see the pattern? There is light, the outside of the circle. There is darkness, the inner darkness within. And there is the divine tabernacle, not made with hands. There is the mountain, and there in the circle are the sandals removed in order to attain the vision. There is the ascent and the descent of the mountain. And I didn't tell you the positive descent of the mountain, but it also has a positive, because when we descend the mountain, we can be descending it because we're falling, but we can be descending it, bringing the law down to the people, we can be descending, bringing the division of God to the world. Do you see the pattern? There's the divine darkness, there are the rays of light, all the pillars of the church, and there is the outer darkness at the bottom. Now, the older versions of this icon didn't use the king cosmos. They actually used the foreigners. So they would put all the different tribes and all the different foreigners represented inside. And usually in the middle, there was a dog headed man who represented that final monster, that final chaos, that frank frog on the edge of what being is. Now, if you take this and you flip it around and you think of the Tower of Babel, what do you have? You have the same structure making, taking clay, making bricks and building this False ascent of a tower up to reach to God. And what's the result of that? The creation of foreigners. All right. Do you see the pattern? And I keep asking that. There's a divine darkness, the rays of light. And in this icon, it's not so much as much the bottom. The descent of the mountain is the descent into the mountain. So it's a slight change, but it's the same thing. The cavern becomes this womb, this tomb, at the same time. And so there's the mother, and there's the tomb on which Christ is laid. There are the animals next to Christ, which represent those garments of skins. There are the two foreigners, the helpful foreigner who come to serve Christ, and the harmful foreigner who comes to tempt Joseph. And down there, just to make sure, there's the water. Got to have the water down there. I'm going to show you one last one, but I could have 25 here. I'm going to show you one last one. Can you see the pattern? There's the divine darkness. There's the light. There's the tabernacle. The angels ascend on one side, the demons descend on the other. The saints are the pillars. They are the lights of the church. And in this one particular one, it is an amazing vision of the womb on one side, which is paradise and the church and the Theotokos. And on the other side, there is the grave. You see that? You see that circle with a strange brown that are. Those are the dead coming out of their tombs."}
{"episode_id":"SW - #010 - 2018-08-01 - Divine Patterns In The Life Of Moses","start":2608.54,"end":2608.69,"speaker":"Jonathan Pageau","text":"And."}
{"episode_id":"SW - #010 - 2018-08-01 - Divine Patterns In The Life Of Moses","start":2608.76,"end":2651.32,"speaker":"Jonathan Pageau","text":"And what's bringing them out of their tombs? Music, of course. And so I would just encourage you to just think when you go to liturgy and you see it's everywhere. I mean, this is just. This is just like a hint. I mean, I had to. When I first wrote this, it was like two hours long. Okay, so just cut, cut, cut. I was cutting everything, but it's just an amazing thing. Read St. Gregory, read the scriptures with this vision, and it's just. It just. It just astounds us every time. It astounds me until today. And I get knocked over all the time just by how amazing our God is and how amazing his creation is. So thank you."}
