{"episode_id":"SW - #344 - 2024-06-14 - Do Adam and Eve Die After They Eat the Fruit - - A Comment on Alex O’Connor’s Conversation with JBP","start":0.24,"end":1743.19,"speaker":"Jonathan Pageau","text":"Hello, everyone. So for those who have not seen it, Jordan Peterson had a pretty amazing discussion with Alex o', Connor, cosmic skeptic, who I've also talked to on his channel as well. I have to say that of all the celebrity atheists, this is. Alex is really showing himself to be one of the people that is truly paying attention. Not only paying attention, but seems to understand the arguments that Jordan is presenting more than any of the other kind of celebrity atheists I've seen him talk to in the past. One of the frustrations that I've had, and you know that is often in talking to these kind of atheist types, it's actually that we just talk past each other. It's not that we disagree. I mean, we do disagree. But ultimately, at least for me, it's been very frustrating because I often feel like people don't understand what it is that I'm talking about, don't understand the argument, and then also have a kind of arrogance and not understanding the argument, which makes it even more difficult, right, to. To not get annoyed at that kind of conversation. But in this conversation between Jordan and Alex, you really get the sense that Alex has been working very hard at trying to kind of understand what it is that Jordan is getting at. Not only that, but also willing to push his own understanding of what religious thought is and has been thinking. Trying to think deeply about the stories, about what they mean, about what would it mean for them to have happened also in a more kind of physical sense, or not all of this stuff. Anyway, the conversation is very interesting, definitely worth watching. And surprisingly, Alex is able to get questions out of Jordan Peterson that many people have not been able to get, which even surprised me, that is, Alex asked him if someone put a camera in front of the tomb of Christ, if it would have captured someone walking out. And I think during. Sense of like a suspect. So. Which really surprised me. And so, yeah, so great stuff. But there's. So I thought I would kind of put peek in and talk about one of the things that they discussed. Alex had some very interesting insights about the story in Genesis, about the story of the Fall, about the question of the serpent, of who is the serpent? What is the serpent's relationship to Christ? There would be so much to talk about. But one of the things that Alex said is that there's a problem in the text because God says to Adam and Eve, on the day that you eat the fruit, you will die. And then when they eat the fruit, he said, well, they don't die. And so what's going on why is it that when that God says that on the day that you eat the. The day that you eat the fruit, you will die and they don't die? And so what I want to do is I want to look at the story, I want to look at how in fact they do die. When they eat the fruit, not only do they die, but that the manner in which they die is actually just like everything in the book of Genesis. At the beginning of Genesis is an origin story. What we're noticing, what we're seeing in the moment when they eat the fruit, is an origin of death. Not only an origin of death in the banal sense, but in origin in the sense that it shows us and helps us understand what death is. It becomes a lens by which we can look at death after that. And so I thought it'd be useful to look at that, you know, just even for you guys, because it's an interesting subject. This is Jonathan Peugeot. Welcome to the Symbolic World. And so before we start, if you enjoy what we're doing at the Symbolic World, Please go to symbolicworld.com and consider becoming a member. We have an amazing community in on our website where people can discuss, talk about symbolism, exchange ideas. And there are different levels of membership. There are free members, but there are also PAIN members who support what we're doing and. And PAIN members have access to a Q and A every month to some extra videos, and also discounts on things like courses and different things that we're offering. And it's also a great way for you to support what we're doing. All right? And so, as you know, in the story of Genesis, God tells Eve not to eat the fruit of the knowledge of the good and evil. They can eat of all the fruit in the garden except for that one. And if they do, on the day that they eat of that fruit, they will die. And so then the serpent comes and says, surely you will not die if you eat the fruit. You will become like God, knowing good and evil. And so Eve is tempted, she eats the fruit, and then a bunch of stuff happens. Now, I've talked before about the idea that in some ways the serpent is telling the truth. And so I won't go into that right now. You know, maybe we could talk about it another time, that the serpent is not completely lying. Just like all lies, there's an aspect of it which is true and which will show itself to be true in the story of Christ later, about the idea of eating the fruit and dying. But let's see what it is that happens after the he eats the fruit. So I'm not going to go through the text, but I did made a list of all the things that happened to them. Hopefully I get this right. If you feel like I'm missing something, go ahead in the comments. All right. So when Adam and Eve ultimately eat the fruit, the first thing that it says that happens to them is that they realize that they're naked. And then what they do is that knowing that they're naked, they hide themselves from each other. They sew fig leaves on their bodies, and then they hide themselves from God. Then when God finds out, he comes to see them. And immediately what Adam does is he blames Eve. He says, this woman that you gave me, she gave me this fruit. And then God turns to Eve, and then Eve lays the serpent. The next thing that happened is that God curses the serpent and tells the serpent that the serpent will eat dust. He says that there'll be enmity between the woman and the serpent, the serpent and her offspring, and that the woman's offspring will crush the head of the serpent and the serpent will strike at the heel of that offspring. He tells Eve that she'll have pain in childbirth, that she'll have desire for her husband, but he will rule over her. He says that the ground is cursed. Then he says that to Adam, and he says that now it'll be painful to get food. You have to work in order to find food. The world will produce thorns and thistles, and you'll have to eat the plants of the field. And then finally he ends his pronunciation by saying that for dust you are, and to dust you will return. You have come out from the ground. We have to return to the ground. And so the key for us in understanding all of these statements is in the last part is in the very end of the statement where God says to Adam, from dust you are, and from dust you will return. If you remember in the second creation account, God gathers the dust of the earth and then blows the spirit into the dust. And that is how God. That is how man becomes a living spirit, becomes a living being. And so when you look at that, you might at the outset think, okay, and then they leave the garden. It's like, well, if God said that they would die, why don't they just drop dead? You know, why don't they just eat the fruit and drop dead? And I think it's because people do. Death is one of those things that we think we understand, but that we usually don't have very good definitions for that. We don't totally understand what it is that they're referring to. And also to understand that death is something that doesn't just apply to a person, but that applies at every level, every ontological level of reality, that there's analogies to what death is at every ontological level. And this is, of course, what's going on here, is that all the elements are trying to help us understand what death is. We have a kind of origin story for death. And like I said, the clue is in the idea of dust. So the idea is that now you will become dust. Now what does it mean to become dust? First of all, what is dust? Dust is basically a mass of things that have no relationship with each other. That's what dust is, the difference. And then God gathers the dust together, all these dispersed elements, and then he puts a spirit in it. He puts a. A breath in it. He puts heaven inside, he puts a name inside, he puts meaning inside. He puts purpose inside. He puts all the things that are invisible patterns that legislate dispersed elements. He puts that in this gathering of dust. And now the dust is animated. Now the dust is. Now is no longer dust, but is one being, even though it's still made of dust. And so this is the difference between life and death. The difference between life and death is the difference between unity, which contains multiplicity, and multiplicity, which no longer has unity, bringing it together. That is the difference between life and death. And so the difference, if you like, in the most mundane way, the difference between a live animal and a dead animal is the difference between all these different elements in an animal that are moving towards the purpose, purpose of survival, the purposes that animals have. And then all of a sudden, something happens to the animal. Now the breath leaves, right? The spirit leaves the animal. And the Bible, it says, we don't know if it goes up or it goes down, but let's say the spirit leaves the animal. And now the elements of the animal no longer cohere completely towards purpose. And that's why they will start to decompose. The elements will start to break apart from each other. It takes time. But at the moment of death, that process has already become. There's a mystery by which death is actually part of life. But that would be too complicated to talk about that right now. But the idea of something that is dead is something that has lost now its unitary purpose. Now this is the best way to. To understand what death is. And it can be applied at different levels of reality. So if you understand that that is what it means for you to die. So when you die, your body now is still there, but it starts to decompose because there's nothing holding it together towards purpose. So you can understand then that all the things that move you away from your purpose are akin at least to death. That is sickness, for example. When your body is breaking down and is not capable of properly moving towards its purpose, then that is a process of death. Old age. When you get older and your body starts to wither and it no longer easily moves towards the purpose that you have for the body, then that old age is also akin to death. Now, it's not arbitrary that both death, both disease and old age do lead to death in the absolute sense. Like in the sense that now there really is this complete separation between the reason, the spirit, the unifying principle, and the disparate elements. And you can see the process all along. But this is what it is that you're supposed to understand. But now you can also apply to anything that has commonality. And so you can say that, you can say with a true analogy, you can say, well, the death of my friendship with this person. And so what does the death of my friendship with this person mean? It's not like we don't cease to exist like me and Bob. We were still there. So what does it mean for our friendship to die? It means that the thing that bound us together, that created a third reality, which is our relationship, which is the communion of. Of us together, is now gone. And because of that, now Bob and I are going our separate ways. You know, if you say the end or the death of an empire, the end of the death of a nation, that's the same thing. The things that are. That made the empire are still there, right? The remainders of the buildings, the matter, the. The people are there. But what happens is now they no longer have a reason in order to join together and to participate in a common identity. It's true for the death of a company, for. For the death of anything that you can imagine that has a unifying principle holding it together towards purpose. And then that principle going away. The elements now disperse and become something like food for something else. They become potential for other beings. So it's like if I'm no longer friends with Bob, I can still be friends with someone else. And so that, let's say friendship is complicated against multiple. Let's say I'm married to someone and then I get divorced and that's the death of our marriage. But now I become potential for another relationship that I can engage in and that's true for nations, it's true for companies, et cetera, et cetera. Okay? And so this is what dying means, and this is what begins to happen at the fall. And so all the elements that are there in the story are there to show that. And so what's the first thing that happens? The. The Adam and Eve notice that they're naked and that they have to protect themselves. And so why do you have to protect yourself from something? You have to protect yourself from something because it's not you, it's not part of you, you know, you have to protect your something because it is hostile to the identity. So a company has to protect itself from spies, from the other company, because those spies are hostile to the purpose of the company. A being has to protect himself from being hurt from someone hitting them with a sword or whatever it is that you have to do. That is the nature of protection. The nature of having to separate yourself in an act of protection from someone else is an image of separation. It's an image now of multiplicity that's losing its unitary function. So before that, Adam and Eve were naked, but they didn't have to protect each other. They didn't have to protect each other from each other, and they also didn't have to protect each other from God. There was multiplicity, but that multiplicity was moving towards communion and unity. And now the multiplicity is moving away from communion and unity and is becoming hostility, is becoming danger, is becoming shame, is becoming secret. All of these things are, you know, why do you have to keep a secret from other people? You have to keep a secret. You have to keep a secret because the people that don't know the secret are outside from you. And so you have this separation between inside and outside, which is now formulated as a form of hostility. Now this is implicit in the very eating of the fruit of the knowledge of good and evil. Matthieu, my brother, has a great way of helping people understand by saying that if when you use the word good and evil, it has so much baggage because people apply it only to morality. But the best way to look at it is to say the tree of good and bad. And so what is bad? Bad is that which is not related to the identity. And so a bad chair is a chair that is moving away from the purpose of the chair. A bad apple is an apple that is falling apart and is no longer cohesive to the reason why I would care about an apple in the first place. And so, etc. Etc. That is what bad is. Bad is the movement away from an identity. Now the thing is about good and bad. It is a necessary. It is a necessary category for the existence of multiplicity. Because you can conceive of bad as simply the distance between beings. And so, you know, it's like, how can I say this? A car makes a bad lunch and, you know, like a bird makes a bad chair. And that's totally fine because bad can be understood as the distance between beings. Now there is a danger in the knowledge of good and evil, which is that you can. You know. Saint Ephrem the Syrian talks about this problem, which is that he says that Adam and Eve were going to be given the fruit of the knowledge of good and evil when they were ready, and so that they could see bad from the position of good. But he said, because they took it for themselves. Now what happened is now they see good from the position of bad, is that they are now trapped in multiplicity, without unity. And the unity seems that is it as it appears, far away, and that they no longer have access to it. But if you would see good and evil from the position of good, you would say, then you would be able to identify difference in a way that is completely normal, in a way that is completely healthy. Because I understand that, like I said, that a bird makes a bad chair, and that's completely fine. If I know the good of the chair and I know the good of the bird, there's no problem there. And so the problem happens when it happens from the. From the other side. And so when you look at what happens there, the nakedness is the third part is the first part. And so you have this separation. They have to separate themselves from each other because they have to protect themselves from God. They have to protect themselves from each other. And then, of course, immediately what happens after that is that Adam blames Eve. Adam says it's her fault, and Eve says it's the serpent's fault. Now that's an increase of that separation. When we begin to blame each other for things, then we are moving further and further away from each other. God curses the serpent and says that he will eat dust. Now the eating of dust of the serpent is related obviously to the Adam and Eve becoming dust at the end. That. Now the serpent, you know, I've told. I've said this a few times. You have to understand the serpent as this coil, as akin to the leviathan that surrounds the world. The serpent is the periphery. The serpent is that which is around the center. It represents the marginality. It is the dead skins Right. It is the changing of skins, it's change, it's variety, it's difference, it's distance, it's all of those things. But now this serpent will eat the dust, that it will be only connected to fragmentation and that which is broken down and will no longer simply be an expression of the center. Like it won't be multiplicity as expressing the middle. It won't be variety or change or transformation as expressing the good. Okay, that will change. In the story of the Bible, right? This is the story of the bronze serpent and ultimately the story of Jesus. There's a restoration of the function of the serpent as this agent of transformation towards the good. But now in this case, God says to the serpent, you will just eat the dust, like you will just be connected to the outside. And then he puts enmity between the woman and the serpent, the serpent and her offspring. And you can see now it's the same problem. So now because of that, you have two problems. You have chaos and tyranny. You have two extremes. The world tends to move towards hyper order in order to control the situation. And then there's also move towards, you could say hyper chaos in order to, you know, these two now kind of face each other. And so you have the serpent wanting to bite the heel of the person. And then because of that, now the person has to crush. And that image of the serpent trying to bite the heel and, and the human having to crush the serpent is an image of civilization itself. It's the beginning of civilization. It's the beginning of all artificial structures that try to keep chaos out. And that which is wild, that which is strange, that which is different now is seen as threatening to the inside of the city. And you have to, you know, you basically have to rule over it in a manner that is different from the way that Adam was ruled over the world before. Before the fall, Adam named the animals, Adam ruled over the world in a kind of a capacity to name the beings, you know, and participate in their identity. But now this is the other side, which is this idea of crushing. And God just says that this is how it's going to be. It's important to understand that this is just the consequence of the eating of the fruit, of the knowledge of good and evil improperly. And that the curse is just like the simple consequence of what that means and it showing us what death is. Like I said, of course, the next one is pain in childbirth. And this is maybe a little harder for people to understand why that's necessary. But it has to do with this. It has to do with the fact that the production of multiplicity and the production of difference is now painful. Right? It is no longer a natural production of multiplicity. You know, there's the idea in the church fathers that Adam and Eve were supposed to multiply themselves in a manner that was something like intelligence, you know, going over all of creation and kind of joining it together in this unity. But now, you know, human nature was broken, as some of their fathers say. And now we have multiple people. And now those multiple people are born in pain because the process of multiplication is now a process of suffering, just like death is this breaking down of people. And suffering is related to that. And so you have the same thing that happened. So what says that there's pain in childbirth and that her husband will rule over her is a repetition at a different level of what was said before, which is that the serpent will move towards the outside and to dust, and then will try to bite at the heel, and there'll be a crushing of the heel. And so now it's the same thing. The woman will be producing multiplicity and pain, and then ultimately her husband will rule over. Will kind of crush her in that way. And so it's not like. And once again, we have to always remember that this is just a description of how death functions and what the process of the extremes of falling into duality does. The ground being cursed, of course, obviously, hopefully this is now becoming more and more and more obvious. The ground being cursed is equivalent to the pain in childbirth, is equivalent to the eating of dust. And now Adam has to impose his will on the world in order to be able to live. And the thorns and the thistles will resist him. So you have the same structure, the dust and the serpent. And then ultimately, the idea that the dust is. The serpent is biting at the heel. The man has to crush it. The woman is making multiplicity and desire. She kind of desires her husband. He rules over her. Again, the ground is cursed and the thorns and the thistles are attacking. And now you have to. You have to impose your will on it in order to make it function. So this is a description of what death is. And you can understand that this is something, like I said, it's really good for you to understand that this is how death functions, because this is. This is what happens. So think about now, the process, let's say, of a. Of a city or of a company. And so you have a kind of unity and multiplicity. And when that's going well, there's a balance there's a sense in which the multiplicity is moving, as in a kind of dance towards the purpose of the company. And there's a flow of identity from the company and there's a flow of participation from the bottom up. Now, some things can happen in a break where there's a lack of trust, where there is a sin from above, let's say, where the people, the leaders of the company, start to take too much for themselves or they start to act unfairly or whatever that is. And then that creates a kind of fracture in the body. And then the body now starts to act against each other. And now they're not focused on the purpose of the company. They're basically infighting. They're trying to get their own. They're trying to pull the blanket. They're trying to make things, you know, they're trying to protect themselves from each other because they see their. Their leaders or they see their co workers as their enemies, as their competition or whatever. And then you have this sense of breakdown. And so one of the ways to deal with that, and it can work to some extent, is then leadership sometimes has to impose itself more strongly and say, okay, now we have to put consequences. We have to make rules. We have to, you know, we have to create ways to discipline, ways to fire people, to get rid of them. So that if they're trying to infect the company. And so the. As the company grows, at the beginning, it'll be pretty organic, you know, just a little team, and everybody's kind of working together, and it's great. Then as it grows and as the possibility of death starts to manifest itself, then the systems of control will become. Can become. Not necessarily depends on the company, but can become more and more tyrannical. And then you have this exchange between a kind of distrust here and breakdown here and then more tyranny at the top. I've talked about this many times in many videos about this image of this relationship and how it culminates in the image of the prostitute and the beast in Revelation. And so, of course, like I said, then this ends with this image that from Dust you are and from Dust you will return as the kind of culmination of the process of death. And so by looking at the story of the Fall, you can actually understand the process of death and what death is. And you can understand it fractally. Like I said, you can understand that in some ways, death is always somewhat active in your life. It's always there. It's always part. And there is, you know, how can I Say this, there is also a way to flip this. And there's a way to flip death into glory, which is something I've talked about also many times, which is that you can make multiplicity into a form of glory if you're able to flip the process of multiplication into a way in which it expresses the fullness of the unity. And so that is also possible. And this seems to happen through self sacrifice. This is what I've been talking about, what Jordan has been talking about, that through self sacrifice you're able to, then, you know, if the leader, for example, shows that he's a self sacrificial character, that he's acting with love towards the people that are making up the company, that he's not wanting to take everything for himself, that he cares, that he takes care of the people below him, and he's also giving himself to the purpose of the company and isn't just trying to make money. He has vision and he's willing to kind of give himself towards that. And if he does that, then the multiplicity can become a type of glory. It doesn't have to be death, it doesn't have to be infighting and, and, and competition and a kind of fragmentation, but it can align itself and then it can become an image of, of the, can become a kind of instantiation, very large instantiation of the vision of the company. Right. And so it could be a company, could be anything, you know, could be you, could be your life, could be your family, be all kinds of things. But this is, of course, I think this is good to, to see. And so this was just a little, a little, you know, a little rejoinder just to kind of jump into the conversation. I thought, like I said, that the conversation between Jordan and Alex was really wonderful. There are many other things that I could say about it, you know, and maybe in the, in the, in the comment section, if there are some aspects of that conversation you'd like me to comment on that you think are worthy, maybe I'll take that into consideration. And so thank you everybody. Thank you for your attention. I hope you're having a wonderful time and I'll talk to you very soon. Bye bye."}
