{"episode_id":"SW - #330 - 2024-03-02 - The Leviathan in Scripture - Ouroboros Symbolism","start":0.16,"end":2952.81,"speaker":"Jonathan Pageau","text":"So leviathan is represented as like God's pet, basically, as kind of God's plaything that he created in the waters to kind of play. But in the same thing in the book of Job, then the leviathan is represented as an expression of God's power. You know, it's like, can you, can you control the Leviathan? You human, like, do you have enough power to master this giant monster? This is Jonathan Pedro. Welcome to the Symbolic world. The leviathan is a strange creature in the Bible and in the tradition. And so I thought that it would be a great idea to kind of look at the leviathan, to think a bit about the sea serpent, the dragon, the relationship to the devil, how all of these associations came to be, what they can mean. And also it can help us understand how symbolism can be polyvalent. That is, that symbolism can have multiple meanings at the same time and that understanding those multiple meanings can also help us understand how symbolism works and then also help us understand the specific meanings that are attributed to each symbol. And the leviathan, that great sea dragon, sea serpent, seems like a great place to look at that. So before we start, I just want to say two things that are important. One is that as many of you know, the Symbolic World Summit is coming very fast at the end of February. The tickets are nearly sold out. And just in this last moment, we finally announced who it is that our secret guest is going to be at the Symbolical summit. And as many of you guessed, it is in fact going to be Jordan Peterson, who is going to come and spend those three days with us with his wife Tammy as well. I'm definitely looking forward to having him and father Stephen DeYoung and Martin Shaw and Neil Degrade and all these Symbolic world people. With Richard Rowland, it's going to be absolutely crazy. I think it's going to feel like it's my birthday. That's pretty much how I'm going to feel during that entire weekend. And since the tickets are almost really sold out, and I know that it's difficult for a lot of people to come, we have decided to offer online tickets. We're going to try to stream it, but we're not going to guarantee that we'll stream it, but we will at least deliver all the lectures on the same day, a raw version of all the lectures. So you can follow along. You can go on the Symbolic World website, you can discuss with other people about what is going on at the summit while it's happening. And then after we've done all the edits, you will Also have access to the fully realized four camera view final edited version of the entire summit. And we'll also add some special stuff like we'll do a return on the summit with a bunch of the speakers after the summit is done, maybe one or two weeks after it's done to kind of, for all of us to kind of rethink about everything that happened because I know it's going to be a wild time. So go to the symbolicworld.com you can look in the description of the video. You will find the link to go get your online tickets. Right now we are offering it as a major discount before the summit because we're going to offer the videos on the very same day after the summit. We will still sell it, but at a much higher price. And so now is the time to get it so you, so we can have as many people kind of participating and talking about this, this really possibly once in a lifetime event. So look for that right now. The second thing I want to talk about is of course related to our subject the Leviathan, which is that we are now crowdfunding God's dog. And we are halfway, at the halfway point of the crowdfunding for the second book of this series which deals with all these crazy legends that we find in scripture and in the tradition in including the Leviathan as well as people that have been following the symbolical press and all the adventures. You know that it's been a difficult time. We have struggled to kind of get to be totally on top of everything. But I am telling you, I promise you, I am going to master this with all these amazing people around us. We're going to get everybody everything that they, that they participated in, in the crowdfunding. And we will continue to get better and better with every one of these books we put out. You know, like the books themselves, which are excellent world class art, you know, with great storytelling that is the same way we want to approach our business. And so please, if you can go to the Kickstarter and support the Godsdog Kickstarter right now. All right, so enough advertising. So in the, in this, in the first issue of God's Dog, we have a version of the Leviathan. And so for those who haven't read it, I'm going to put up the pages so you can see there's this image of the end of the world where there's this mound of bodies and all these dead bodies that are there. And we talk about this final battle and we see St. Michael coming down from heaven with the mighty Sword hitting the waters, hitting the Leviathan and ending the world and beginning the world anew. And in the same way, in the new book, we're also going to go deeper into the image of the Leviathan and we're going to talk about. We're going to kind of go into this image of the relationship between the Leviathan and the flood and the giants and what it is in our story. How do we relate all of these ideas of chaos and of the giants and then ultimately of the ark? As you can see in the final image at the bottom of that third page, you can kind of see the boat on the water. So all of that is something that we're going to talk about. But one of the things that people have often pointed out to me is how a lot of these stories, they're not in scripture. That it is. A lot of the associations are about the Leviathan and about the idea that it's related to the Ouroboros, you know, the snake eating its tail, the idea that it's related to the devil himself. That is all of these associations. A lot of people will point out that they're not directly in Scripture. And so what I want to do is I want to kind of go through the imagery of the Leviathan and the symbolism around it, the iconography of the Leviathan, and it'll help us also see how the imagery develops and how it is in fact related to scripture and to other traditions. But everything is already there in scripture if you know how to read it. And I've often said that traditions, extra biblical traditions are often there to point out things that are already in scripture but that are sometimes difficult to perceive. Because if you don't have the right intuition, you won't be able to see it. But if you look at it with the right intuition, then all of a sudden it pops out. And so some of these extracurricular, extracurricular, extra biblical books are there to kind of reconnect the dots for you. So you can kind of see how this works. And so if we want to understand the iconography of the Leviathan, the way that it's represented in Western art and the way that it ends up being represented in Western culture, one of the things that we need to think about right away is the image of Jonah's monster. And so this is a second century marble, two second century marbles that represent Jonah being eaten by the sea. Sea monster. So we often think of Jonah and a whale. There's absolutely, obviously there's no indication that Jonah was eaten by A whale. And traditionally, although a whale is a fine way to understand it, because a whale is very much a monster that moves between, you know, breathing air and going to the bottom. It's like this liminal figure that is neither mammal nor fish. So it is definitely a monster. But if the way that it's represented traditionally is more as this sea monster with the body of a fish, you know, even the legs, sometimes of an. Of a mammal, the head of a dog, sometimes the head of a dog, you know, that's like a snake dog. And you can see even this figure has wings. So the sea monster is really a dragon in the way that we talk about what it is that dragons mean. That is, the dragons are hybrids, dragons are chaos. They are the mixture of different identities. And that is how they're represented in early imagery. That's how they're related to all these different images of hybrids and griffins and all of these types of images. And that is the way the ancients understood it. That is the way the ancients understood the sea monster, which is why Jonah here in the second century. Don't tell me that Christians didn't have art in the early centuries. This is a second century carving of Jonah being eaten by the whale. Now, what you have to look at are a few things. Of course, the monstrous aspect of Jonah. But then already, if you look at the image, you will notice that there is a suggestion of a circular movement in both images. One which is Jonah coming out on the left, Jonah coming out of the monster, and the other which is Jonah going into the monster on the right side. But nonetheless, you can see how there's this interesting circularity to the way in which the dragon and the human is represented. Now, it's not exactly an Ouroboros, but you'll see how that circularity is something which happens almost intuitively in the way that the serpent is represented. Doesn't mean that the people were necessarily conscious about using that type of imagery, but it does end up being in the image nonetheless, and we'll see why that is the case. And so just to show you, here is a version of mine, which is the carved version of my version of Jonah and the sea monster, and also a drawn version, the one that appears on the prints and the T shirts and stuff. So in the more recent versions, a lot of the aspects of the monster, that is that the legs and the, you know, the dog face is reduced, but it's still there. As you can see, the fish has ears, you know, and so the fact that the fish has ears can kind of show you that this. That this, you know, this aspect of the monster is not completely gone. And again, just like in the other image that you saw before, I tried to suggest a kind of circularity in the monster, first in the tail, which circles on itself, but then also in the figure coming out, which kind of connects or almost connects to the. To the tail. And so what's important to understand is that this image of Jonah is one of the earliest image of death in Christian iconography. And so it was shown on the sarcophagi, that is, on the tombs, the. Not the tombs, but the actual, you know, boxes that the dead people were put into. The image of Jonah was one of the most used images, where on the tomb, you would see Jonah get thrown into the fish, and then on the other side, you would see Jonah being ejected from the fish. And so this idea of the sea monster eating the person became an image of death and of resurrection, which is why it was put on the sarcophagi in the first place. And this is why, you know, this is, of course, based on the very. Let's say, the very saying of Christ, which is the only sign that I will give this generation is the sign of Jonah and the sign of the. Of the death and resurrection, the going into the monster and the coming out of the monster. So we can understand how this image of this monstrous thing that is kind of from below that comes up and swallows up the person is an image of death. And there's a relationship between the image of death and, of course, the image of chaos. So this image of the monstrous head that is Jonah's head, that kind of comes up and swallows the people, then becomes an image of what we call the hellmouth. So the hellmouth is an image that we see in Christian iconography where at the. You know, in different ways, either it is in the image of the Last Judgment which you see here on the left, or whether it is an image here again of Christ harrowing Hades. You know, it doesn't really matter. It's the idea that there is this monstrous head which is the head of death, the head of hell, the head of decomposition, the head of chaos, which is below. The people are kind of stuck in this monster, like Jonah was stuck in the sea monster. And then out of the. Out of that comes the resurrected ones here. And on the right side, you can see how it's Christ harrowing Hades, harrowing hell and getting people out of the death, the monster's death. But then on the other side, when you See the Last Judgment. What you see is the opposite. You see Christ casting people into the mouth of death. Right? And so this is already an image of how you can understand the. What you could call the polysemic or the polyvalent function of symbolism. Is that the place, ontologically, the place in the image of being that the head of the monster occupies is the same, but the relationship is different. That is, on the one hand, it's Christ getting people out of death, and on the other hand, it's Christ sending people into the fire and into the final death. And so this is important to keep in mind that this polyvalence and this duality of the symbolism will appear all through the imagery of the monster of the dragon and of course, of the Leviathan as well, which is that it's the place in relationship to other things, which is more important. And like I've said many times, symbolism is not moral in itself. It can have moral connotation in its application, but it is not moral in itself. And it can go either way, depending on the manner in which it's used. And so, of course, these are just two versions of these images, but there are plenty of versions, if you want to look them up, of the mouth of hell. You can find them online, both east and west, as this kind of monstrous thing. And you can see that there's still a remainder of the image of Jonah, which is that the image is something of a snake, it's something of a fish, but it also has ears. You know, you can see that. You can see the ears on the. At the bottom of the. Of the head, and here, again and again. Also in this one, you can see the ears on the. On the monster. I'll show you one last time in a. In the bigger image, you can see that the monster has ears. So one of these is like Russian, and the other, you know, is. Is like Northern European or Western European. And so this image really crossed all over the place now. Okay, so what's important to understand in this case is that what you will see in scripture is these sea monsters and the Leviathan in particular, represented in many guises, represented in different ways, but that are always. The serpent always has the same place, but that the way that it's treated is different depending on the context. So, of course, it's important to understand that the monsters, the sea monsters were created, are mentioned in the creation narrative. And so on the day that God creates the fish and the birds, it says, so God created great sea creatures and every living thing that moves with which the waters abounded according to their kind, and every winged bird according to its kind. And God saw that it was good. But the great sea creatures is a Hebrew word called the tannin, which is the sea monsters, really. And so it is a kind of generic term for these massive, giant sea creatures that are. That are considered monsters, of which, you know, the leviathan, or there are also different. Different versions of which. I forget the name at this moment. Yeah, it'll come back to me. Sorry. And so there's different. These different sea monsters that exist in the sea. And so in scripture, think about it now as they are these kind of monstrous things that exist in the waters. And what they end up representing often is they end up representing the waters themselves. They end up representing chaos itself, because they are these monsters at the bottom of the world in the. In the waters. And that is what the. The leviathan ends up representing very much as well. But the thing about chaos is that chaos is also potential. Chaos is also power. And so think about how you have an authority, and that authority wants to increase its reach. So what it will do is it will try to reach out into the things that it doesn't master yet. And in mastering them or incorporating them, what it will do, it will increase its power, right? So by, you know, the Roman Empire, by invading the northern barbarians, and by including the barbarians into their fold, what they're doing is they're increasing their power. And so this is the way to kind of understand that or even understand the warrior that is on this. On the edge of an army that is going crazy and is kind of killing people because he's this expression of. Of power. Okay? So chaos and potential is. Can also be represented as power. So that's what ends up happening in scripture is that the Leviathan is represented in different ways. Sometimes the. So. So, for example. So in. In the psalms, for example, there's this text that talks about the. The Leviathan and says, here is the sea. V. It talks about the power of God and like God's creation, how God interacts with his creation. He says, here's the sea, vast and spacious, teeming with creatures beyond number, living things both large and small. There the ships go to and fro, and Leviathan, which you form to frolic there. So Leviathan is represented as, like God's pet, basically, as kind of God's plaything that he created in the waters to kind of play and to. And to frolic in these giant, you know, waters. And so he. Here it's this sense that it's Almost like the kind of chaotic playfulness of God is represented in this giant sea monster that just writhes through the waters. But in the same thing in the book of Job, then the leviathan is represented as an expression of God's power. It's like, who can you, can you control the leviathan, you human? Do you have enough power to master this giant monster? And the answer is of course no. And this is an example to show how our capacity, our power is limited compared to the capacity and power of God. Okay? And so, but in the way that it's represented, in the idea that it's a kind of chaos, this is the relationship between the serpent, the sea monster is, and what we call the Ouroboros. That is the idea that of a serpent eating its own tail. And so why do we have this image of a serpent eating its own tail? What's the relationship between the rest? And if you read my brother's book, we'll see an image of his cover. You'll understand that it has to do exactly with that. It has to do with a type of causality which is not linear and logical and coherent, but rather a circularity, right? A kind of breakdown of linear causality, which is change, which is transformation, and is represented as the ridiculous idea. Not ridiculous, but like the idea of the serpent basically feeding on its own tail, which is obviously an impossibility. You can't have a per. It's basically a kind of cannibalism, like cannibalism. Self eating is not possible. If you do that, obviously you'll degenerate, you know, but then it becomes an image of this idea, but then it can easily then become an image of the edge of something, right? In the sense that it's the place where an identity starts to lose its coherence. And so it ends up being the rim or the periphery around an identity. Because it is exactly that. It is the. The, you know, an identity has a kind of coherence. It lays itself out in a regular pattern. But then when you reach the edge of that identity, you reach the place where it starts to contradict itself, where it starts to not be completely logical. And that is represented, can be represented as this circle of chaos, this rim of chaos, which is of course the ocean itself, you know, that is around the giant island of the. Of the world, but then also, you know, mythologically represented as a serpent. Now this image of the serpent eating its tail is of course extremely ancient. You know, I'll just show you one very old image version of it that you can find in Egypt where you see the, of course the serpent with the head at the top eating its tail and then the pharaoh representing the center, representing the order part. I don't know if it's a pharaoh, but let's take the human, the person who's there is representing the, the, the identity, the, the order. And then around that identity and order is this kind of circle of, of limit of, of chaos. Now this image, it happens everywhere, right? And so my brother used it in his book as this image of the serpent that goes around the tree. The tree being now the identity in the center and then the, the Ouroboros going around the tree being this kind of change or transformation or chaos or power or potential. There's all these different analogies to what it is that is outside of the current identity. And I just want to say a little thing. I usually don't get into polemics too much, but it's interesting because you have James Lindsay who kind of came after me and came after Jordan Peterson and a bunch of people. He started saying how the Ouroboros is the symbol, that it's from occultism, that it's from alchemy, that it's from Gnosticism, and, and it's like, well, yeah, it does appear there, but it's not the only place it appears. The image of the serpent turning on itself is an image which is completely coherent and is there in the tradition as well. It's there in Christianity, it's there in Judaism. And we'll see examples of it as we move forward to show that just because Gnostics or occultists or whatever use a symbol does not reduce it to that use. And often all these weird magical people, they try to take symbolism for their own purpose, but that doesn't mean that you can limit that symbolism to that use. Right? It's a pretty simple thing. It's not that complicated to understand that if you see an eye in a triangle, it doesn't mean Freemasonry, it doesn't mean Illuminati, it means the eye of eternity, means the Trinity, it means the all seeing eye. And, and it was used by these organizations as in a kind of parasitic way in order to, you know, to, at least to. That was more related to their own particular use. But the symbolism itself is not, cannot be limited to that in the same way. Like a swastika. The idea that a swastika is a Nazi symbol is one of the most ridiculous things you can think. It's like swastika is one of the Most universal symbolism, one of the most universal symbols ever created. Anyways, I've talked about this many times. And so what I want to show you is I want to show you some images. So in the Jewish tradition, the image of the leviathan as this particularly round fish, or round, you know, sea monster, was quite prominent in the Middle Ages, you know. And so you can see that the fish is not biting its tail, but it does have that kind of circular motion, and it does have this kind of peripheral idea that it is a periphery that is around something in the middle. So here you have this red part in the center. Here you have these kind of flames that are in the middle with the fish that is going around and kind of touching its own tail as this sea monster, chaotic monster, chaotic fish, all of this type of imagery. And so in the. In the scripture, the. The. This dragon or the leviathan then again ends up having these two aspects of symbolism. So, for example, in the book of Isaiah, now we have this image of the leviathan as the chaos which is opposing order, right? The chaos which is fighting order. The dragon, in the sense of St. George, right, that is coming to, like, eat the virgin, and the warrior has to spear this dragon. And so it says that in the day of the Lord, you know, in that day, that final day, that final day of all revelation, you know, the end of the world, in that day, the Lord with his sore and great and strong sword, will punish Leviathan the. The giant serpent and Leviathan the torturous serpent, and he will slay the dragon that is in the sea, right? And so this is the image that we are represented, that we're representing in God's dog, right? And so in God's dog, we have this image of the. Of St. Michael coming down and now slaying Leviathan in the sea. But you'll say that's weird because it doesn't say St. Michael, right? It says, God slew the Leviathan in the sea. And so just keep track of that, and as we move forward, you'll get a sense of how all these things ultimately come together. But like I said, there's also an image that is represented positively, like I said before, and in the image I just showed you, which is the Jewish tradition, that is how it's represented in Jewish tradition. So below here, what you have is something called the Feast of the Leviathan. And so there are Jewish traditions which talk about how in the Messianic time, at the end of the world, when all is finished, there will be a great feast where we will eat the flesh of the leviathan, and the skin of the leviathan will be used to cover Jerusalem, and that the people will wear the skin of the leviathan and that we like a glorious skin. And so they'll eat the flesh of the leviathan and they will wear the skin of the leviathan as this kind of glorious image. And you think, well, that is weird. That is a very strange image. Why would they have an image like that? And what's weirdest about it is, by the way, if you know about God's dog, if you is look at how all these people at the end of the world in the Messianic age have animal heads. If you notice, it's not exactly for the same reasons that we have animal heads in our story in these. It's more about kind of specific characteristics, I think it's hard to know exactly what the meaning of these images are, but it seems more like the idea like specific characteristics which are in their glory, right? So they're wearing crowns, but they represent, you know, different parts of the. Of what humanity is. What's interesting, though, is that there is a donkey there. And so there's definitely pure and impure in the Messianic age coming together. But why would we have that? But the thing is that we have something similar in Christianity, which is this image of the heavenly Jerusalem. And the heavenly Jerusalem is similar civilization. But now it's like, right, you think it's so weird because you think civilization isn't chaos, is it? Civilization is power. Right? This image of the garments of skin that I've talked about many times, which is this image of this covering that God gives men that turns into basically everything that man uses to cover himself. And civilization being the big part of that. And in the end, you have this glorious Virginia of civilization where civilization basically is filled with the glory of God. And it. And what was dangerous and chaotic and potential is now eliminated. And you have a sea of crystal, right? In the book of Revelation, the seed is no more. There's no more ocean, there's no more leviathan. The leviathan has been conquered. And everything that is the exterior part, all the skin, has now been turned into glory, which is in Revelation, represented as the heavenly Jerusalem as the city, the covering that is filled with glory. But the image of the leviathan and the feast of the serpent and how then it is turned into these skins that people wear and that Jerusalem is covered in, is very similar imagery in terms of what it means. And it shows the two aspects of how it is that chaos and Order relate together is that sometimes order is shown as subjugating chaos and kind of piercing it and, you know, and ruling over it. And then sometimes it's shown as order or the heaven filling up the chaos and filling it up with light and with glory and with radiance. And so those two images are important to maintain in a kind of balance or in a kind of in attention, because they both represent important aspects of how it is that heaven and earth join together. Now, this image of the circular dragon or the circular serpent that represents the Leviathan is, Is one which you find as Christianity as well. Here are two examples. So here is Antichrist now, who is sitting on the great beast that is represented in Revelation, and the great beast that comes out of the sea, remember? And so this, this great beast that comes out of the sea is also a circular structure. It, like I said, it doesn't. It's not exactly the serpent eating its tail, in this case, on the one on the left, but it does still have the. The same structure of the dragon, the beast, the serpent coming out of the sea. And now of having this circular image on which the Antichrist is sitting on the right side here. Now you have the image of the dragon really eating its tail. This is from a 12th century image where you see the dragon kind of eating his own tail. And there are different versions of this. I didn't take so many. But if you look up medieval Croziers, for example, that is the bishop staff that happened in the Middle Ages, you'll see the same structure as this. You'll see the same structure as this circular serpent. But now in the center often will be St. Michael spearing the serpent sometimes. And then other times, what you'll see in the middle will be something like the Lamb of God that's in the center and the serpent that is around it. Now think again about this image of the heavenly Jerusalem. You know, of the Lamb of God that is in the middle of the city and around the city, around the Lamb of God are the walls of the city and the civilizational, multiple aspects of civilization. And you can represent that as the lamb in the center and a serpent or a dragon circling around it. Right. And so you can see that when I talk about how the, the feast of the Leviathan in the Hebrew tradition, in the Jewish tradition and the heavenly Jerusalem are similar in their meaning. Right? They play with the same type of imagery. And of course, there are different versions of this. Like, I just want to show you an image. So here an image of the bronze serpent where Again, the circularity of the serpent is made prominent. You, you know, it's like. It's actually kind of awkward to draw a serpent like this, but clearly what the artist wanted to do was to emphasize this kind of shape that is roboros, like, right. That has that kind of circular structure to it. Okay. All right. Now, the thing about this is, is that this image of the serpent eating its tail or the serpent turning on himself is an image that is there from the very beginning. It's there in the book of Genesis. Not in the book of Genesis, but in the way that we represent the book of Genesis. So we often think just of the serpent eating its tail, you know, directly. But a better way of representing how this circularity works is actually like this. So it's not just like one wheel of a serpent, but it's multiple wheels of a serpent. And so the serpent wrapped around a tree is just the same as the Leviathan wrapped around the world. It's exactly the same as the image that my brother put on his book, which is that you have the tree in the center, you have the identity, you have the structure, you have the thing that is ordered, and then around it, you have these circles, these rings of chaos. And I did it on purpose to show that in the. In the Middle Ages, they often understood that this serpent wasn't just a serpent, was really like a kind of monstrous dragon character which you see here on the right side, you know, that's often identified as Lilith or as different kind of monstrous demonic characters. But you can see here that the serpent has legs. You know, that the serpent has a human face and is also. Also has that. So it really is a monster or a dragon. It's not just a serpent in the. In the most simple sense, but the serpent is fine. But what I want you to see is that, like, this is how symbolism works, is that it's a serpent, it's a fish, it's a monster, it's a dragon. It's like, you have to be able to see how, of course, these. All these images are distinct, and they can be used to be. Show something distinct, which. But they can also become analogies for each other and easily slip back and forth into each other without there being any problem, because you can understand them where their place is in the story. Right? It's like there's. The place where they're put. Is there to help you see the analogies that exist between these. These different images. And so now we have to get into, like, the crux of things. And so the in the book of Revelation, there is also something about this which is that it says in the book of Revelation 12, verse 7 to 9, it says, Now a war arose in heaven and Michael and his angels fighting against the dragon. And the dragon and his angels fought, but they were defeated. There was no longer any place for them in heaven. And the great dragon was thrown down, the ancient serpent, who is called the devil, and Satan, the deceiver of the whole world, he was thrown down to earth and his angels were thrown down with him. And so look at what's going on here. Like it's very powerful what is happening. So here the serpent and the dragon is identified with Satan and the devil. Now in the text it doesn't say Leviathan anymore, but anybody who knows their scripture will remember that in Isaiah it says on that day the Lord will kill Leviathan, the Lord will defeat Leviathan. And so everybody knows that this verse is referring back to that verse in Isaiah. And so the dragon that is being spoken of is the leviathan, it is the great dragon, but it is also the opposer, it is the Satan. So it is the devil that is the one that separates, and it is the Satan that is the one that opposes. And in this case, you have this hostile image between order and chaos, between chaos that opposes the identity, chaos that tries to revolt itself against the multiplicity, decides to revolt itself against the unity. And that's why you have than images like this, right? So the one on the left is my carving. It is St. Michael killing the dragon in the book of Revelation, St. Michael killing the leviathan, if you understand it from the book of Isaiah. And on the right now you have another version of this Image which is St. Michael killing the devil. And in this version, if you see on the right, St. Michael has the sword, because in Isaiah it says, with his mighty sword will he kill the devil. And so if you remember, if you remember the image I showed you of God's dog at the outset, St. Michael now is killing the leviathan with a sword. But it's totally fine to represent it as a lance as well. That has become the more traditional way in the east of representing this relationship. Because what it is, it's a spear. It's basically an axis, right? It's a pole, it's an identity, right? It's a one. And that one is now going to fix the many and the slithering and the motion and the chaos and the division, right? So it's going to fix that in the ground. And so that relationship of hostility between the Idea of defeating the chaos and defeating the opposition is there in the. In. In the text related to the devil, that is that which divides to the Satan, that is, that which opposes. And then St. Jerome, for example, he goes all out and he just says, you know, the leviathan is the serpent in Genesis, you know, he says that the leviathan is the same serpent that you see in Genesis tempting Adam and Eve. And so he just kind of loops it all together and just ties a knight's bow in it to help you see how all of these things are connected now. But in this symbolism, you have to understand that the other symbolism, which is that the symbolism of the filling and the symbolism of the glorification doesn't need to go away. And it can be maintained inside the way that we represent these different images. And that's where we get to this problem, which is that on the one side, you see God and his angel spearing, you know, completely dominating the chaos and the disorder and the opposer. But on the other side, what you see is God filling up and becoming death and being joined to death. And that is why Christ on the cross looks like a serpent. And that's why Christ on the cross is represented as the bronze serpent. That's why Christ himself says that he will be lifted up, like the bronze serpent will be lifted up. Now, the cross does many things. It does both at the same time, by the way, which is, again, the cross will always wreck you if you try to think about it too much. Because the cross is both God becoming the serpent and, you know, entering into the chaos, into the death, and filling it with himself. But it is also, at the same time, the spearing and the fixing of the serpent by the nails onto the structure of reality. And so the serpent around the tree is nailed to the tree. And so it's like he bowed, but it's not just nailed to the tree. He also becomes the serpent. So that duality or that fullness of the paradox of God both becoming, coming into death, becoming sin for us, all these types of images that are completely crazy, but then also being, while he's doing that, being the one that is now going down into death and spearing the devil. And so it brings you back to that image that I showed you at the. At the outset, you know, which is these two possibilities, like, how these different possibilities can coexist in the manner in which they're represented. So here you see Christ coming down with his cross, but his cross is a spear, right? Look at the cross that Christ is bringing into death. So he's spearing the mouth of death, just like St. Michael is spearing the mouth of death in the, in the other image, you know, and now it's Christ doing that, but he's at the same time going into death and coming to take the people out of death. So you can see how all of these are related and how the subtlety of the symbolism is important to maintain so that we don't fall into kind of just simplistic and moralistic interpretations. Okay. And so this type of imagery leads up to this image of the. For example, the bishop's staff, which has serpents on it. And so here you have these two serpents that are represented around the cross. And of course, it is a version or, you know, let's say a. Similar to the, the. The Caduceus or the rod of Asclepius, which is an image of medicine. And so why is, why would we have that? Because a lot of people are annoyed, like when they see the. The bishop, like, with these two serpents. They think this is pagan, this is pagan. But it isn't pagan. Right? It's right there. It's right out of scripture. It's right out of the idea of Moses taking his rod, and then when he takes it, it becomes a rod, and when he lets it go, it becomes a serpent. And that's it. Like, that's the whole thing. It's the tree that is the identity, and it's the one that is. That is held right. When you hold onto it, when you, when you grasp it, then you know that it is an identity. And when you let go, when you drop it, when you lose it, when you forget it, then it becomes a snake and it becomes a monster, and it becomes something that doesn't have a clear identity. And. And so this is the type of imagery that is there in the cross. And there's a. There's a surprise about this chaos is that it has two sides. It both is, on the one hand, that which can oppose that which can divide, right, The Satan and the devil. But it is also in the surprise, that which can also increase power and increase glory and ultimately heal from the other side. So we have to be careful which one we're dealing with, because obviously, you know, many a heretical idea has come from confusing that, you know, and you see that in. In. In the kind of Gnostic teaching, you do see that where they say things like Adam listening to the serpent and eating the apple was in fact, the type of enlightenment that. That they were actually doing what was right but that is not the way we understand it, really. The cross is the way that all of this is settled. The cross, which is the opposite of the kind of chaos or the multiplicity rising up to try to revolt itself against identity, but is rather this giving up and this giving in, you know, to. To kind of offer yourself. And in that manner, the entering into chaos then becomes a type of feeling and a type of glory. And so hopefully this is a little helpful, kind of understand what this imagery of the serpent can mean. You know, why the imagery of the Leviathan is. Can easily have both of those images in them, whether it is this idea of the great power of God and creating these monstrous, chaotic beings, but at the same time that those chaotic beings can of course become opposition and become an image for the devil and the Satan that is, like I said, the one that breaks down identity and the one that opposes it. And if you're interested in that, put it in the description as well. I wrote an article called the Servants of Orthodoxy a long time ago, like 10 years or more than 10 years ago, that you can look up and you can read a bit more about this whole idea of the relationship between the serpent and medicine and all of that. And if you're also interested in this idea, like I said, do not forget to support us with God's dog 2. This is the second book of five. This is going to be a massively epic story, folks. It's going to move all through these medieval legends, but then also through scripture and through a bunch of surprising things as well. So everybody, thanks for your support and your attention and I hope to see some of you at the Symbolic World Summit and if not, we'll also discuss online. So thanks everybody and I'll talk to you very soon. Bye bye. In 2021, my brother Mathieu and I, with the help of Por Nielsen of Philip Kartin, introduced all of you to a new vision of storytelling. We launched the God's Dog Monster graphic novel through crowdfunding, introducing the dog headed St. Christopher the dragon slaying St. George to full view as a new epic story began. The response was astounding. Reaching over $250,000 and ultimately selling out our first print of the book. Now book two of five in this series, God's Dog Warrior moves into the meat of this epic story where our dog headed stranger must be integrated, must be trained and must fight. The cosmic stakes behind the story become clear, the characters shine, and heart wrenching choices must be made. Book two will surprise you with more monsters, more giants, and a deeper exploration of the mythology underlying it all. Since book one of God's Dawn, I've also started a publishing company called Symbolic World Press with some amazing partners to deal with the timely production, printing and shipping of all future books. We've already successfully published Snow White and the Widow Queen and we'll expand our activities rapidly. The money we raise is to build this whole project and even move towards other media. We now have three full time people working with us, plus nine artists, six writers collaborating towards at least 14 upcoming books. And all of this without any outside funding, no outside control. It's all of you making this possible. This is why crowdfunding is so powerful. So in this crowdfunding, we've partnered with professional comic artists Matt Sheehan, Jesse White, Philip Cartin and Martin Krotz to bring together God's Dog Warrior. But on top of that, I'm also introducing an entirely new comic book series called the Garments of Skin, which will explore the lore, the mythology around God's dog, bring the story into the contemporary world where new heroes try to resist a global system of control. We are at a turning point in culture, a turning point in storytelling, and I know I can count on all of you to make it possible. We have to take back the reins of storytelling, move past the gatekeepers, and I thank all of you for trusting us to play a part in that. Thank you for backing God's Dog Warrior on Kickstarter today."}
