{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":0.64,"end":73.71,"speaker":"Jonathan Pageau","text":"On this episode of the Symbolic World podcast, I am posting a discussion that I had with Jordan Peterson called the Metaphysics of Pepe. So many people who watch my videos have told me that it is through this discussion that I had with Jordan that they discovered what I was doing. It became so strange for a while that I thought that my, let's say, my little 15 minutes of fame would be spent talking about a cartoon frog. But there's a few things to discuss about what happened, a few important points to bring up, and I think you'll find it very interesting to discover how this video came about and all the waves that happened around it. This is Jonathan Peugeot."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":74.11,"end":75.79,"speaker":"Jonathan Pageau","text":"Welcome to the Symbolic World."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":86.55,"end":381.66,"speaker":"Jonathan Pageau","text":"The Metaphysics of Pepe was actually recorded with Jordan Peterson on the same day as the last podcast I put up Tradition and Things that don't fit. It was November 7, 2016, and the political waters were at the boiling point. There had been a few very strange coincidences between Jordan and the fruit frog more than could be ignored. People on 4chan were buzzing like mad about the synchronicities, which included their own dubs relating Jordan to the Holpepe and their strange Kek mythology. All of this was appearing online. It was a very strange time indeed. It was one day before the election of Donald Trump. Myself, I had only recently become aware of this page Pepe meme. I had followed the relationship between poll, the Politically incorrect channel forum on 4chan and the election of Trump. And immediately I recognized the pattern of the frog, the ambiguity and how it was being used to flip things over, how chaos was being harnessed to show Trump as an outsider and how the Trump campaign were using the attacks, but by Clinton, the whole basket of deplorable type of attack and flipping those attacks back against the attackers. And I also knew the traditional stories of these marginal figures who act like tricksters and chameleons. And so, like everyone else, I was somewhat freaked out when I saw Jordan Peterson wearing a frog hat in one of his videos. And speaking of the portents appearing around us, he seemed to be embodying this transition that is happening now. It is this transition which is the cause, the zeitgeist, of all the chaos of all these inversions and these double inversions into which the world has entered. So when Jordan asked me to have this discussion with him, in the back of my mind it was like, okay, we can talk about art, but this conversation has to lead to towards a discussion of what is happening around him. And this whole Pepe meme we got to the discussion, we were able to hash things out a bit, but it is very strange. There is a moment towards the end of the discussion where I give Jordan the advice to be careful. It might seem like a very banal thing at first glance, but as I was talking about the Pepe meme, how it had been declared a hate symbol and all of that, I suddenly felt a very deep fear, a fear of being associated with this frog and all the dark undertones that it had, a fear of somehow being contaminated by Jordan's association with the frog. And so this came out of me as giving the man advice and in a certain manner, distancing myself from what was happening, which immediately felt like I was, you know, being quite arrogant, considering the circumstance. When the discussion ended, I was left with a strange aftertaste. And when I woke up the next morning, I woke up with a sinking feeling. And so I immediately wrote Jordan and told him not to put up the second part, that we had to figure this out. I realized that I did not understand the situation well enough that I had to take the time to work things out, go into the chaos that Jordan was going through, rather than distance myself for it, dive into it, and try to find a way out. In November of 2016, we barely knew anything of the alt right, which I actually mentioned in the video. Most of us thought that this alt right consisted basically of Paul Joseph Watson and Milo Yiannopoulos. In the next few weeks, the Atlantic article and video on Richard Spencer appeared on our horizon. That's the video in which we see him doing the heil sign during a conference. Now, I had never heard of Richard Spencer. Most of us hadn't heard of Richard Spencer. And the fact that the mainstream media suddenly focused on this obscure figure, putting the limelight on him in such a manner, showed me exactly what was happening with the Pepe Mine with its association with Trump, with the chaos as a mirror. The extreme left wanted a Hitler figure. They had a secret desire to confirm their fear that Trump and those who had voted for him were all secretly Nazis. And so they were putting forth somewhat."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":381.66,"end":384.02,"speaker":"Jordan Peterson","text":"Like Richard Spencer, someone who was happy."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":384.02,"end":488.73,"speaker":"Jonathan Pageau","text":"To use the Pepe meme if it fit his agenda. And this Richard Spencer at that time, I don't know about now, but at that time, he barely had any following compared to the other, let's say, you know, popular right wing figures like Milo or Gavin or Paul Joseph Watson, Ben Shapiro, Shapiro and all those other conservative or libertarian types. And so it was in seeing the Atlantic feature of Richard Spencer, seeing how they made him so prominent that I fully understood the Pepe meme and how it was acting as a mirror. So in December, I slowly crafted what is now the second part of the metaphysics of Pepe, showing what I hope to be a deeper understanding of the dangers and opportunity of chaos, as well as showing the way out of chaos and the possible rebirth, the resurrection of Logos, that golden ball which the frog of chaos could bring out of the darkness and into a new day. And so, having gone through all of that, I asked Jordan if he could send me the raw footage and that I had an idea of how to edit our discussion in a way that would be helpful and would hopefully not make things worse. For those who remember, in that winter, Jordan had not yet completely figured out his autoimmune issues and had fallen into a very deep depression. It was during that week that he had put out his message for the New Year, in which he. We can see him becoming very emotional, but he watched the video with Tammy, his wife, and then he called me up and we put it up that evening."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":490.09,"end":491.57,"speaker":"Jordan Peterson","text":"So whether you're hearing this for the."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":491.57,"end":498.81,"speaker":"Jonathan Pageau","text":"First time or whether you are returning, here it is. This is the metaphysics of Pepe."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":502.01,"end":503.53,"speaker":"Jordan Peterson","text":"We're going to talk about frogs."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":503.61,"end":504.33,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":504.65,"end":505.21,"speaker":"Jordan Peterson","text":"Yeah."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":508.98,"end":515.62,"speaker":"Jordan Peterson","text":"So, yeah. Okay. So, yeah, when we saw. I mean, when I saw the video that you put up, was it two days ago now?"}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":515.86,"end":516.34,"speaker":"Jordan Peterson","text":"Yep."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":516.34,"end":518.1,"speaker":"Jordan Peterson","text":"Yeah, two days ago. I couldn't believe it."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":518.66,"end":518.98,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":518.98,"end":527.7,"speaker":"Jordan Peterson","text":"And the next morning, I got an email from my brother, who also studies symbolism and is very. A very smart person. And he said, does Jordan know he's incarnating Pepe right now?"}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":528.34,"end":565.76,"speaker":"Jordan Peterson","text":"Yeah. Well, the funny thing is, you know, I knew about Pepe, but it was. I had nothing like that on my mind when I made the video. It never even entered my mind that that was an association. I mean, I was just concentrating on this Kermit thing that had popped up. Had probably popped up about two years ago. And I. The first time someone said that, I thought, huh. So I went and listened to Kermit and I thought, oh, yeah, I do have a voice that's similar to that. I see. I can get it lower, but my voice tends to rise up into my. Right into my. It's because of tension. So."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":566.16,"end":570.8,"speaker":"Jordan Peterson","text":"So this is it. We need to do it. Like, so we need to do the metaphysics of Pepe. No one has done it yet, I think."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":571.04,"end":582.48,"speaker":"Jordan Peterson","text":"Yes, exactly. Exactly. Well, and so, you know, and then. Then this strange occurrence, of course, also also emerged with regards to the mask that Charles had made. Me or the hat."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":582.56,"end":584.44,"speaker":"Jordan Peterson","text":"Yeah. Which looks like Pepe."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":584.44,"end":647.3,"speaker":"Jordan Peterson","text":"I know. It even has red lips, which is staggering. It's absolutely staggering. And so I just about fainted when I. After I posted that and people start. People pointed out the correspondence with Pepe. Really, I just about fainted. It was. And that doesn't happen very often. Like, I can only remember one other time in my life when I was shocked enough to almost faint. I just thought that was just too much. It was too much to bear. And then thinking about the frog correspondences since then, it has been. Well, it's inexplicable and absurd, but so much of this is inexplicable. I don't know. I tweeted something yesterday. I looked up Maps of Meaning, my book on the Amazon seller lists, to see where it was located. And it was number eight on books that are associated with behaviorism. And it was bracketed by two other books, Mahzarine Banerjee's book. And she's the person who invented the Iat that's been used to ferret out unconscious bias."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":647.38,"end":648.06,"speaker":"Jonathan Pageau","text":"Oh, my goodness."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":648.06,"end":671.13,"speaker":"Jordan Peterson","text":"And the other one was a book by Richard Bandler that I think was called Frogs and Princesses. Just. And then to find out about Kek. You know, I didn't know about Keck. And anyways, it's. And then today I was thinking, I was watching Nina Paley, who's an absolute genius, and she's animated the. The plagues that Moses called down on the pharaoh. And of course, one of the plagues was a plague of frogs."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":672.41,"end":711.44,"speaker":"Jordan Peterson","text":"Okay? So the frog is a perfect liminal character, because the frog, I think you tweeted about this as well. The frog lives both in water and on land. And so it's like a. It has a monstrous characteristic that it can cross. It's one of those things that crosses over between. Between worlds. And so you see that. You see that in the stories. Like the story of the frog and the princess is a perfect example. And it relates to the Pinocchio story that we talked about earlier. So a princess goes to a pond. She's playing with her favorite thing, which is this golden ball. And so she drops the ball in the water."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":711.44,"end":760.39,"speaker":"Jordan Peterson","text":"You know, just to mention something, that golden ball is the same thing as the snitch that Harry Potter chases in. In the Quidditch games. In Harry Potter. And it's funny because inside, the snitch is actually part of Voldemort's soul. Right? So. And so that's part of the soul of evil. That's inside the golden ball. And the golden ball in Harry Potter has wings, which makes it a round chaos. Technically speaking, it's an alchemical symbol. And the round chaos is a mercurial symbol. And the spirit Mercury is an emissary of the gods. And so the gods are speaking to you when any. When anything flickers in front of you and captures your attention. And in the Quidditch game, the person who follows what captures his attention is the seeker. And also the person who wins, not so much the game, but the metagame."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":760.95,"end":764.39,"speaker":"Jordan Peterson","text":"What's important, I think, in this story is that the ball is the most important thing."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":764.95,"end":767.43,"speaker":"Jordan Peterson","text":"Right. That's why it's golden. It's like. That's why it's golden."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":767.43,"end":777.05,"speaker":"Jordan Peterson","text":"So for her, it's the idea that it is the most important thing. So she drops this ball in the. In the water. It gets. It gets lost. So she loses the most important thing. It falls into chaos."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":777.13,"end":780.25,"speaker":"Jordan Peterson","text":"Right. So that's the death of God, for all intents and purposes."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":780.65,"end":854.07,"speaker":"Jordan Peterson","text":"Or just the idea of. Yeah, or just the idea of the loss of innocence or whatever. You think about it in terms of the loss of the most important thing. And so this frog appears and says, I can go get your ball if you promise something for me. And so the promise is that she will bring the frog with her into her castle, let the frog eat with her, and then let the frog sleep in her bed. Okay, so we've got those two things, food and sex, we talked about before as well. So the frog goes down into the water and then brings up the most important thing. And the princess is forced to accept this frog in her. She doesn't want to. Like, she's very annoyed that she has to let the frog into her house, eat from her plate, and then finally into her bed. But by doing that, the frog, of course, transforms into a prince. Here you have this idea that we talked about before where the most important thing goes out into chaos and whatever can bring it. Bring it back. Right? Whatever can bring it back to us can be tamed and can enter into the world. Can it find its place into the."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":854.07,"end":856.71,"speaker":"Jordan Peterson","text":"World and maybe even turns into the thing of the highest value?"}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":857.08,"end":857.6,"speaker":"Jordan Peterson","text":"Yes, exactly."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":857.6,"end":912.34,"speaker":"Jordan Peterson","text":"Yeah. Well, that's. That's something for people to really think about. About. About marriages, for example. So, you know, people are always. And I think this is part of the profound immaturity of our culture. People are always running around waiting to find the perfect person who's perfect for them. And so, you know, one thing you might think is that if you ever found the Perfect person, they would run away from you screaming immediately. So. Because. And so that perfection is something that you have to build within a relationship. And so you accept the other person, so to speak, warts and all, and hope that they do the same to you and swear that you won't run from each other. And then, as a consequence of that, you can engage in a mutual process of transformation that emerges as a consequence of telling the truth and having a truthful relationship. And then as a consequence of that, the. The transformation can take place. And you might start with a frog, but maybe you end up with a prince."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":913.54,"end":953.02,"speaker":"Jordan Peterson","text":"Yeah. So, like, we talked about the idea that this is the structure of the world, and so it happens as much on a personal level as it does on a social level, on a bigger sense. So just a little hint, we talked about before, the story of Abraham and the three angels coming and announcing the birth of Abraham's son. Well, in the story of Sleeping Beauty, that's exactly what happens. The queen goes to the pond, and there, lo and behold, is a talking frog. And the frog is the one who announces to the queen that she will have a child, the most beautiful child in the world. And so, again, here is this idea of something coming from chaos."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":953.1,"end":991.86,"speaker":"Jordan Peterson","text":"Yeah. Well, that's so interesting because, you know, in the diagrams in my book, in Maps of Meaning, one of the diagrams is an egg shape. That is the chaos into which things plunge. But chaos is an absolute state in some sense. It's the state of the unknown as such. And you never see the unknown as such. You always see something that's partly known and partly unknown. And that's what the frog is sitting on the edge of the pond. The frog enables you. So the frog is an emissary of chaos, roughly speaking. And you always. You only meet an emissary of chaos. You never meet chaos because it's like."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":993.62,"end":997.44,"speaker":"Jordan Peterson","text":"It'S none existence. It's beyond being. It's below being, if you will."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":997.44,"end":998.96,"speaker":"Jordan Peterson","text":"Right, right, exactly."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":999.36,"end":1026.59,"speaker":"Jordan Peterson","text":"And so now this thing, like two things. One is interesting, is that Kermit the Frog is the same thing, because Kermit is a host. He's a host on a show. And so what he does is he transitions. He's the transition between different worlds. So you have an act, and then you have this transitional figure which appears, and then you have another act. And so that's what. That's the role that Kermit the Frog plays on the Muppet Show."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":1028.03,"end":1032.03,"speaker":"Jordan Peterson","text":"His primary problem is with Miss Piggy, who's a really loud feminist."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":1034.11,"end":1074.21,"speaker":"Jordan Peterson","text":"That's hilarious. Okay, and now, now Pepe. Here's the metaphysics of Pepe. So this is what's happening in the world right now is that there's a very strange situation where the people, like, let's say the right. We'll call them the right, or like the forces of order or the. Let's say the norm. The people who create the norm for a society. Okay? So we're in a situation where things have been inverted and the people who supposedly in the narrative are the ones who create the norm are being marginalized. They're being pushed into the margins. Right. And they're being told, you're the ones who create the norm."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":1074.21,"end":1074.44,"speaker":"Jordan Peterson","text":"And."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":1074.51,"end":1076.91,"speaker":"Jordan Peterson","text":"And we're going to push you out into the margin."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":1077.31,"end":1080.67,"speaker":"Jordan Peterson","text":"And so you think that's why they've identified with the frog?"}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":1080.83,"end":1098.91,"speaker":"Jordan Peterson","text":"That's why they've identified with the frog. Because what happens is there's a strange inversion that happens, right? The power of inversion and the power of mocking and the power of humor is usually on the side of chaos. It's usually on the side of the power of the margin, is the question."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":1098.91,"end":1121.31,"speaker":"Jordan Peterson","text":"Well, I noticed, like, I noticed this happening about 20 years ago is all the. The right wing had all the comedians. I thought, what the hell's going on here? The right wing doesn't have the comedians. It's the, it's the left that has the comedians. They're the ones that are poking fun. So the world's gone very strange that the comedians have become that the right wing has started to express itself in comedy."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":1121.39,"end":1173.49,"speaker":"Jordan Peterson","text":"Yeah. So that, that it's a sign that there's. There's this strange inversion that's happening. And so there's. There's an interesting, like just a little footnote on this. Like in the Bible, there's a story that talks about this. It's the story of Elijah. So in the time of Elijah, Israel has been worshipping false gods because of the Queen Jezebel. Right. And Elijah, who is supposed to be the prophet of the God of those people, has become a marginal figure. And so his name is Elijah the stranger, which is very odd because he is supposed to be a prophet of God and his tool is mockery. He mocks the prophets of baal. And, and that's something that you actually don't see very often in the Bible where the tool to kind of bring back order is through mockery. And so this is what we're seeing with this Pepe figure is that Pepe is like an inversion machine."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":1173.65,"end":1174.29,"speaker":"Jonathan Pageau","text":"Okay?"}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":1175.17,"end":1208.28,"speaker":"Jordan Peterson","text":"So the people who use Pepe, what they do is they take something like an insult that's being thrown at them and they flip it around. They flip it around on those that insulted them. Like, that's what you did with the Kermit thing, which is perfect. People are making fun of you because they say, you sound like Kermit. And you're saying, okay, I'm going to take this and I'm going to make it into my strength. And that's what Pepe does. And so a lot of the crazy stuff that's coming out of this Pepe thing is part of that. There's a lot of dark things in the Pepe, you know, like, things that person I wouldn't necessarily want to touch."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":1208.44,"end":1223.51,"speaker":"Jordan Peterson","text":"Yeah, well, I mean, when I first saw the frog, I mean, the Pepe frog, I really recoiled from it. It's got this kind of underground comic horror associated with it that I really. I really find distasteful. So, like. Like sort of viscerally distasteful, you know."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":1223.67,"end":1269.87,"speaker":"Jordan Peterson","text":"But I think it's supposed. It's. It's kind of supposed to do that to you. Yeah, that's part of the power of. Of those that are using that. That image. Like, it's right there. If you look at it, it's right there in the first comic, like the first Pepe comic. You know, you have a. It's very crass. But here's this frog, right, who goes to the toilet to urinate, but he pulls his pants down to his knees. And so he's doing something that usually if you pull your pants down to your knees, you're going to sit and do something else, but then he does that, but he stands. And so here's this. And he shows us his backside, right? So here's this strange power of inversion which actually brings the man to stand back up. And so that's this double inversion that people who use this type of imagery are doing."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":1269.91,"end":1270.07,"speaker":"Jordan Peterson","text":"And."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":1270.14,"end":1278.5,"speaker":"Jordan Peterson","text":"And so even it's like, you know, let's say like the radical left winger saying, you're. You're this. Whatever, you're a white male controlling, blah."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":1278.5,"end":1279.3,"speaker":"Jonathan Pageau","text":"Blah, blah, blah, blah."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":1279.3,"end":1297.29,"speaker":"Jordan Peterson","text":"You're all these things. And the people who use these Pepe comics, they're. They say yes, and they'll. And they reflect that to you. And then the people who accuse them of that completely lose their mind. They completely lose their mind. But the only thing they're doing is saying, you're saying, let's say that I'm a racist, this, blah, blah, blah."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":1297.29,"end":1297.4,"speaker":"Jordan Peterson","text":"And."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":1297.47,"end":1356.72,"speaker":"Jordan Peterson","text":"And then they reflect that back to them. They Invert it in a way, because they're saying, here you go, I'll show you what you're telling me. I am. And then the radical left wing lose their mind. And so it's like. And so it's kind of. And if you look at those people, like the alt right people, they have this strange magic, right? Because if you look at Milo, Milo Yiannopoulos is a perfect example. You know, here is a half Greek, half Jewish, gay, Catholic, Trump supporting Englishmen in America. And so nothing talking to the Republicans. Exactly. And so nothing people can throw at him will stick on him because he is the frog. Like, he is that marginal figure standing on the side, but he's like, he is that double inversion and he's kind of. I don't know if he's trying to. But what it seems like he's doing, he's bringing order back through like this, this double flip that's happening. It's very odd. It's a very odd."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":1356.72,"end":1358.72,"speaker":"Jordan Peterson","text":"It's very strange. It's very strange."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":1361.12,"end":1365.92,"speaker":"Jordan Peterson","text":"So anyways, I would just say just, just, I mean, just be careful. It's a dangerous place to stand."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":1366.4,"end":1395.8,"speaker":"Jordan Peterson","text":"Yeah, yeah. Yes. I'm trying to be careful, believe me. I've got lots of people that I'm talking to that are helping me formulate my arguments and articulate them properly. And like, I'm doing my best to keep my feet on the ground and my, my eyes open and, and, and not to be angry about this, but to be in the chaos, really, and not assume also that that's a catastrophe, because I don't know what's going to happen to me. Yeah. I don't know if this is the worst thing that ever happened to me or the best thing that ever happened to me. Yeah, I can't tell. Yeah."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":1395.8,"end":1435.55,"speaker":"Jordan Peterson","text":"And once you. When the solution will happen inside the chaos, right. The, the, the, the. The Jonah gets pulled down by the whale, down into the depths of the, of the, of the ocean. And it's while he's in the belly of the whale that the solution comes to him. Like in this case, he had this moment of repentance where he turns, he turns around. Repentance is a flipping around. And so this moment that he brings him into death turns into this baptism where he comes out and he's, you know, and he's a, he's a, he goes into the city. Right. So that's another part. But so that, yeah, the solution is going to come out of this chaos."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":1435.79,"end":1436.11,"speaker":"Jordan Peterson","text":"Yeah."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":1436.11,"end":1437.91,"speaker":"Jordan Peterson","text":"Well, right now it's still great problem."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":1437.91,"end":1442.27,"speaker":"Jordan Peterson","text":"If It's a really complex problem. You have to go very far into chaos to find a solution."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":1443.23,"end":1446.75,"speaker":"Jordan Peterson","text":"But there's always the risk of losing yourself when you're in chaos."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":1446.83,"end":1451.63,"speaker":"Jordan Peterson","text":"Right, definitely. Well, that's right. I mean, that's the thing about dragons, is that they can eat you."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":1451.71,"end":1452.19,"speaker":"Jordan Peterson","text":"Yeah."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":1453.47,"end":1503.02,"speaker":"Jordan Peterson","text":"That's why I don't like the new age ification of Carl Jung's thinking. And in part, I think Joseph Campbell was responsible for that, although he did a lot of very good things. I mean, the thing about. The thing about confronting the thing that you're afraid of is that the thing that you're afraid of is genuinely terrifying and it can actually eat you, and it's eaten plenty of people before you. And so it's no joke. And, you know, I mean, during this whole, let's call it, ride so far, I mean, what. Yeah, what was going to happen, especially in the first couple of weeks, I mean, when I was being called a bigot and a transphobe and all of those things, and being pilloried essentially, at least within the university for my views, it wasn't obvious at all that there was going to be any. There was going to be any way of swimming out of it, let's say."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":1505.02,"end":1535.38,"speaker":"Jordan Peterson","text":"But it's very disturbing because now you basically have these two monsters fighting each other. You know, like you have, let's say, this Pepe type frog. And you know that Pepe was declared a hate symbol by the. The Anti Defamation League. You know that. I mean, that's very frightening. It's frightening that this is how far it's gone, how much it's like on, you know, all of a sudden they see that they can see the monster on the other side, but they don't see the monster on their side."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":1535.54,"end":1536.02,"speaker":"Jordan Peterson","text":"Yeah."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":1536.34,"end":1544.74,"speaker":"Jordan Peterson","text":"You know, and the lgbtq, et cetera, et cetera. I mean, that is itself a liminal."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":1545.68,"end":1581.49,"speaker":"Jordan Peterson","text":"Well, look at what's happening with it. It's the same thing that happened with the gender neutral pronouns. As soon as you blew the binary apart, there was an endless multiplication of potential identities, and that was the chaos manifesting itself. And the ever expanding letters that go along with LBGT is an exact example of exactly the same thing. It's like, well, we're marginalized. Well, we're marginalized, too. Well, we're marginalized, too. And how about us? We're also marginalized. And it's like. And I guess that's also partly because each person has at least one element of them. Is that seriously marginalized in some manner?"}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":1581.49,"end":1611.92,"speaker":"Jordan Peterson","text":"Yeah, yeah, yeah. And the rain. And it's interesting, like the rainbow is a, is actually a perfect symbol because a rainbow is actually, is just a. It's a fluid thing. It is a fluid thing. A rainbow is not six colors. A rainbow is a spectrum of colors. It is chaos itself. It's the division of order into an indefinite amount of things. Right. So we typify a rainbow into six colors, but it's actually just the spectrum of color."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":1611.92,"end":1612.48,"speaker":"Jordan Peterson","text":"Right, right."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":1612.56,"end":1619.88,"speaker":"Jordan Peterson","text":"And so it is indefinitely. It can be separated indefinitely. There is no limit to how much it can be separated."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":1619.88,"end":1659.53,"speaker":"Jordan Peterson","text":"Well, and it seems to me that that's actually the problem with the identity legislation. It's like, well, like, imagine that, like an identity is a very important thing, right? An identity is something you have, but it's also something that you and I play out. So you have to negotiate your identity with the rest of the social world. It's like a game in some sense. But identity also has to have a function. Like. And this is also why the legislation is so pernicious because it just says, well, your identity is whatever you want it to be. It's like, well, no, it's not because you have to live with other people. It's like you, it's like saying you can play whatever game you want to play. It's like, well, you can't because you got to find other people to play with."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":1659.69,"end":1660.17,"speaker":"Jordan Peterson","text":"That's right."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":1660.17,"end":1668.57,"speaker":"Jordan Peterson","text":"We're playing together and you can say, well, you have to play my game. Well, I can tell you toddlers on the, on the school ground who say, you have to play my game. They just get shunned."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":1668.89,"end":1669.37,"speaker":"Jordan Peterson","text":"Yeah."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":1669.53,"end":1700.82,"speaker":"Jordan Peterson","text":"And then the game itself has to be playable. That's the other thing is that there, there, there are playable and non playable games. And one of the things that Piaget pointed out, the developmental psychologist Piaget pointed out about a game is that one of the hallmarks of an acceptable game is that people want to play it voluntarily. And that's another part of the legislation that's so pernicious. It's like, okay, you have a game and it's a game that you've chosen subjectively because that's what it says in the legislation. And when, when you come near me, you have to play my game whether you want to or not."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":1701.06,"end":1701.54,"speaker":"Jordan Peterson","text":"Yeah."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":1701.62,"end":1730.35,"speaker":"Jordan Peterson","text":"And then the problem with that too is that, well, where does that stop? And the answer is it stops with indefinite multiplication. So the whole point of society is to enforce a game that's somewhat arbitrary that everyone can more or less play. They sacrifice parts of themselves to play it, but it beats the total chaos of the war against. Of all, against all. For example, that's the Hobbesian right, nightmare, right and life. Nasty, brutish and short."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":1733.4,"end":2039.19,"speaker":"Jonathan Pageau","text":"This is a complement to the discussion of the metaphysics of Pepe the Frog that I had with Dr. Jordan Peterson. There are strange transformations happening in our world and hopefully understanding them will prevent the worst from taking shape. As I discussed with Dr. Peterson, the frog is a type of hybridity. As an amphibian, it exists in two worlds at the same time. So it becomes an image of the margin. Another possible aspect of the margin and the monster as we encounter it, is to be a shapeshifter. Shapeshifting, like hybridity, is the sign of the place where categories fall apart on the edge. In the case of shape shifting, this characteristic is presented mostly as a power of the margin. It's the power of fluidity, like a trickster taking on several forms to operate his mischief. To fully understand how Pepe the Frog operates, we need to understand how shape shifting occurs and how it gives power to those who wield it. You see, Pepe has become a meme, possibly the most used meme of all times. His image is floating on the Internet and it can be produced by anyone in the world. And so there are thousands and thousands of images of Pen Pepe, ranging from a glorified emoji to the most horrifying scatological images you can imagine. Because Pepe has become this chaotic, fluid, shape shifting thing. He ends up acting like a mirror in the same way water acts as a mirror. And the way that works is that because there are so many images of Pepe, when people look into that huge chaos of images, they can't encompass all of it. They have to mentally order it. And in ordering it, they do that using their own mental patterns. That is, they project their thinking into this chaos. And as they force the chaos to take shape, it becomes an image of their own ideas, maybe their own ideological possession. And so one of the things that has been happening is that some people on the right, what some groups are calling the alt right or whatever, have been using this effect to act as a mirror against the social justice warrior types. It even went so far that the SJWS finally declared Pepe a hate system symbol. The Anti Defamation League said that Pepe was a hate symbol. I mean, this frog, this cartoon frog, it was so ridiculous that the ADL finally scaled back some of the language they use. I mean, of course it was politically motivated, but how could such a silly thing happen? Well, certain images of Pepe, a few of them in the thousands and. And thousands of images available, had racist themes. And so there was the Hitler Pepe, a KKK Pepe, a scheming Jew, African stereotypes using racist slurs, cliche Mexicans. All of these examples were floating with the other thousands and thousands of Pepe images online. But when the social justice warriors looked in this mirror, this pond of Pepe images, all they could see were the ones that reflected back to them their own ideology. Or rather like a mirror, an inversion, the dark shadow of their ideology. Of course, immediately the accusation came. Pepe is a racist symbol. He's a hate image. And the irony is very big because first of all, no one controls this image. No one has any control over it. Pepe is everything and anything and nothing at the same time. By declaring publicly that he's a hate symbol, the SJWs are pointing to their own absurdity. And this to the delight of those that use this image. But hiding in this is an even larger irony. If you look at the images that they pulled out as being racist images, there's this strange contradiction in them. You see, on one side there's Hitler Pepe and KKK Pepe, and there's a Trump Pepe, while on the other side, there's the skinning Jew, the African American and the Mexican. This means that Pepe is at the same time the archetypal oppressor, seen from the side of the victim, all the while being the archetypal scapegoat, seen from the side of the oppressor."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":2041.03,"end":2041.55,"speaker":"Jordan Peterson","text":"That is."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":2041.55,"end":2332.69,"speaker":"Jonathan Pageau","text":"Pepe is both sides of racism at the same time. When the SJWs look at that automatically, without even thinking, they organize it through their ideology and it exposes their program, because they automatically decide that when Pepe is Hitler or KKK or Trump, Pepe is identifying with those people. But when he's a scheming Jew or a Mexican, Pepe is mocking and criticizing those people. Why is such an absurd image of Hitler as a cartoon frog not seen as mocking Hitler? In fact, all the SJWs are seeing is a reflection of themselves, of their nightmare, of their shadow. The rather pathological desire we've seen in the past few months to accuse everyone of being Hitler or a neo Nazi or a white nationalist is an expression of their secret desire, the desire to be confirmed through an encounter with their projected other. And it's funny, because the discourse of otherness has been an ideological tool of the left since the 1960s. And now we're at a time when it has come back to haunt them. So by using this strategy, the people have been wielding this path. Pepe image have taken advantage of the power of chaos, taken advantage of what happens when the frog jumps into the pond and goes down to the bottom to find the golden ball, as I explained in my interview with Dr. Peterson about the story of the princess and the frog. But the frog can't stay in the water forever. That's the most important thing. At some point, you have to finish the story. To finish the story, the frog has to get the golden ball. And one could say that the golden ball is actually the sun which will come up for the new day. The frog has to get the golden ball and bring it back to the surface of the water. It must carry the most important thing, carry the seed of the new world to the princess so that it can grow. If that doesn't happen, there is no telling what else can come out of the water. If the frog stays there for too long, it will be eaten or it will call some darker monster because there are other things down there beside the golden ball. And the frog can tempt the leviathan to devour it. And it's not as if this is impossible. As the frog swims in the darkness, the social justice warrior is still peering into the mirror and calling forth its shadow. We've already seen some intimations that this game people are playing might raise something more than a new day, might raise the very monster the social justice warriors hope to encounter. So as the frog swims in the water, how can it do that? How can it recognize the golden ball that is at the bottom of the pond? Because it's actually not easy to distinguish things when. And we're covered in darkness. And the answer to this is in what happens in the story. The frog has to get out of the water and become a prince. The frog has to become something else. And bringing up the golden ball is the same thing as the transformation of the frog into a prince. One cannot happen without the other. And so, as Dr. Peterson has often suggested in his lectures, the way to do it is to sort ourselves out is to go into our own self. Define the golden ball that is hidden in the darkness. To go down and find the most important thing of Western civilization. Civilization. And Dr. Peterson has suggested the most important thing of Western civilization is the logos. This truth. It is the word. We have seen how noise has been the chaos used to drown the word."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":2333.57,"end":2351.98,"speaker":"Jordan Peterson","text":"What I'm going to talk about is freedom of speech. And I want to tell you a few things. About freedom? Because I've been thinking about this very carefully. I've been thinking about this very carefully over the last two weeks. And it's partly because of the videos that I've made."}
{"episode_id":"SW - #005 - 2018-06-12 - The Metaphysics Of Pepe - with Jordan Peterson","start":2358.54,"end":2368.77,"speaker":"Jonathan Pageau","text":"And so we must find the word, for it is the sun that rises after darkness. The word is the thing that comes out of death and lives again."}
