{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":0.32,"end":61.12,"speaker":"Jonathan Pageau","text":"So hello everybody. I am very excited to be here with Bishop Barron. Most of you will not need an introduction to him. He is the Catholic Bishop of California. He is also the writer of many books. He runs Word on Fire, which has many publishing recently a publishing on Jordan Peterson and I've been with him, with Jordan Peterson on his channel recently with John Vervecki, to talk about Christianity, its place in the modern world. So we thought it would be a good idea to continue the conversation, just both of us, to talk about the Bible, about beauty, about art, and about how Christianity can exist in the contemporary culture. This is Jonathan Peugeot. Welcome to the symbolic world. Bishop Barron, thank you for coming here."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":61.28,"end":64.68,"speaker":"Bishop Robert Barron","text":"Jonathan, thank you. Good to see you and good to be on with you. Thanks for the invitation."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":64.68,"end":79.36,"speaker":"Jonathan Pageau","text":"Oh, it's wonderful. I wanted to maybe we can start off and maybe after the fact, after our discussion, what was your impression with Jordan and with John of how that went and what kind of place this type of discussion can have in the present state?"}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":80,"end":132.87,"speaker":"Bishop Robert Barron","text":"Yeah, I love the conversation. I thought it was really interesting and different perspectives, you and I. Explicitly Christian. John Vervaeke, I don't really know his background that well. I know he's cognitive scientist professor at University of Toronto. I found his musings on kind of Western intellectual history really interesting. And of course, Jordan Peterson, you know, someone that's I think, deeply interested in spiritual matters. Not explicitly a Christian, but very interested in it. So it was just throwing light from different angles on this thing, which I thought was intriguing. But we all come together and in being concerned about meaning or better the lack thereof in our culture and the crisis it's causing in young people especially, I mean, I see it every day in my pastoral work and the work on the Internet. So I love that. I think that was really fruitful thing for us all to be talking about."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":133.35,"end":189.44,"speaker":"Jonathan Pageau","text":"I think one of the interesting things that seems to be happening, and Jordan does also seem to be someone who opened the. This door or kind of participate in opening the door. You'd participate in this as well, which is we had this kind of last new atheist moment, you know, with Sam Harris and Dawkins and all of these people. And it seems like that moment has broken. It's broken. And there's something about the zeitgeist which makes it possible for. I'm seeing it a lot of atheists to perceive even what it is we're talking about, because this has been difficult for me until maybe five, six years ago, is that when we talk about the stories, we talk about the Bible and how it's a worldview rather than something that you kind of analyze from above, how we can enter into these stories and participate. It's something which until recently I felt like people weren't even able to grasp. But now that door has been opened."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":189.68,"end":376.37,"speaker":"Bishop Robert Barron","text":"You know, there's a lot there. I remember a teacher of mine saying years ago that, that sometimes a block in the spiritual life can simply be an intellectual conundrum or it's a question or it's something I'm just stuck. And until I get unstuck, I can't move any deeper into the spiritual truth. And I think for a lot of young people, and the new atheists spoke to this, there were intellectual blocks. You know, isn't Christianity just pre modern nonsense? It's opposed to science. It's a bunch of old superstition. It's a projection of our, of our idealized self understanding, you know, all the usual things. And young people got stuck. They probably heard a lot of that in their college and university classrooms and they thought, yeah, okay, religion is just a lot of nonsense. The new atheists, they geared all that up again, you know. Well, here's the thing in a way that does great service because it allows us to deal with some of these problems that young people have and thereby to eliminate false understandings of religion. I like the cleansing quality of atheists, from Goldman Feuerbach all the way to Sam Harris. They do something, they cleanse idolatrous understandings of religion, they raise and therefore allow us to address some of the intellectual blocks. Once that's over, then as you say, I think quite rightly, people can begin to move into the spiritual power of these great texts and these great symbols and these great doctrines. But in a way I'm happy that the New Atheists led to a renaissance in Christian apologetics, in Christian philosophy. We had to pick up our game because to tell you the truth, we were God awful. When the New atheists came by, we, I mean the whole Christian world, we didn't know how to address them, which was stupid because we have extraordinary resources in our intellectual tradition. But you know, that's a long story. We threw down our arms to a large extent because we were so concerned about dialoguing with the culture and reaching out to the culture, we lost our edge apologetically. But that's dangerous because when the atheist critique comes, and it always comes in some form, we gotta be able to meet it or young people especially will get stuck and then they won't be able to move into the wider world. I Think as I read Jordan Peterson, there's something I've always found kind of this lovely innocence about him, like he just discovers certain things and then begins to talk about them. And what he discovered was the spiritual power of the Bible. And we, again, I'm speaking broadly, we Christians, we were kind of lousy at that, too. We weren't very good at opening up our own spiritual riches. And so Peterson, he said, hey, look, hey, look, young people, look at all this stuff. And they responded like crazy to it, which doesn't surprise me at all. So that's how I read the moment. The new Atheist critique was cleansing in a way. And Peterson has been like, as I was kiddingly saying, like a gateway drug for many people into the real spiritual stuff. And so, you know, thank God for him."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":376.53,"end":435.38,"speaker":"Jonathan Pageau","text":"Yeah. And one of the surprising things to me has been to even realize that postmodernism, with all its damage that it's done, it's actually opened an interesting door as well, which is that. And we can see it actually, as we watch the breakdown of our social narrative as we see it fragment, all of a sudden, even the most materialist person has to pay attention to story, has to pay attention to the fact that we're actually living inside competing stories. And so once that becomes clear, even sadly, in terms of politics, then you can also use that to help people say, well, that's exactly. These stories in Scripture are more like a story that you live in than a description of kind of facts in the way that chemists will describe facts or a physicist will describe facts. And it opens up the door to say, yeah, we have to wait before I analyze the world. I have to string a bunch of facts together in a narrative in order to be able to even make my way through the world."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":435.86,"end":591.56,"speaker":"Bishop Robert Barron","text":"Yeah, you know, postmodernism does have a nihilistic side to it, or like a purely kind of deconstructive side. But there's the aspect I like to call the nostalgic postmodernism that looks behind what the Enlightenment occluded. So modernity, or the Enlightenment, with all its rationalism and scientism, tended to occlude great parts of our tradition. And we talked about that with Jordan a few weeks ago, is this whole wisdom tradition got occluded in many ways by the hyper rationalism of the Enlightenment. So one side of postmodernism is to kind of break that up, is to break through that occluding wall so that we can again revisit these sources. So in that way, it's been liberating postmodernism. I wrote a book a couple years ago called the Priority of Christ Toward a Post Liberal Catholicism. And that's what I meant was post liberal beyond the Enlightenment tinged reading of Christianity, which I would have gotten as a young guy that was very much in vogue after Vatican II was a very Enlightenment reading of Christianity. Well, I think we have to break through that, but break back to something that had been occluded. And that's what Peterson's doing, in my judgment, standing up in front of people and he's giving a patristic reading of the Bible. In many ways, he, he's doing what I think what the Fathers call the tropological sense or the moral sense of the Bible. He'd probably say, Peterson would probably say the psychological meaning, but okay, I call it the moral meaning of the Bible. Great, great. He's doing that. He's finding a tradition going back to Origin of Alexandria, you know, going back to Philo. He's recovering a very ancient tradition that was very much occluded by the hyper rationalistic approach to the Bible. I don't know about your own training, but certainly mine was almost exclusively in historical criticism, which means in a very rationalistic way we look at the biblical texts as ancient Near Eastern literature. We try to understand what the author's intention was, what his environ and culture looked like, what were his concerns in like late 8th century B.C. judea, et cetera. Well, I mean, fine, all that's fine. But what it didn't allow is what Peterson is exploring, what the church fathers explored. What does this text tell me about God and my relationship to God and my relationship to the deepest meaning of my life? A lot of that got set aside by a very rationalistic, enlightenment tinged approach to the Bible. What I hear you doing, what I hear Peterson doing is opening up older wisdom sources."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":591.8,"end":670.35,"speaker":"Jonathan Pageau","text":"Yeah, definitely. I think that's true for myself. It's very strange because, I mean, I studied art and then I studied theology after. But I came to theology, let's say, from an iconological perspective, that is that I was interested in the way in which images spoke to each other and created these patterns of meaning. And so for me, you know, when I would get, I took some theology classes in colleges even before I studied more, more intense, intensely. And I just remember being annoyed right away, just annoyed because it's like, what is this? Where are the stories? Where, where are the images? And it really is through the psychological approach that I discovered typology. And then when I read St. Gregor Venissa, or I read St. Ephrem the Syrian. I was like, this is home. And then I started to see that how the New Testament is just basically quoting the Old Testament constantly and referring back to all these images. And so it created like a, like a Tokian world building. You could say, you know, like that there's this world building in scripture that you can inhabit and that it's a series of analogies and a series of references that you can live in. And so I was never too, I was always annoyed with the, with the critical historical from the beginning."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":670.51,"end":849.22,"speaker":"Bishop Robert Barron","text":"There's so much there. Can I ask you something right away? It just came to my mind, go all the way back to what, seventh century, eighth century, the iconoclast controversy. John of Damascus, right? This, I think, pivotal moment in the history of Christianity when you've got a somewhat puritanical, you know, against graven imagery, somewhat Islamic influenced view that would say you don't do this, you know, but then John of Damascus, who said no, because God made an icon of himself. The icon of the invisible God is the humanity of Jesus. And so that becomes the ground for iconography and for Christian art. You know, I've argued no John of Damascus, no Sistine Chapel, no Chartres Cathedral. I mean, in a way, the whole vision tradition comes from this incarnational sensibility. So there's that old, old, old battle against the iconoclast. But then come up to the 16th century and a big part of the Reformation was an iconoclastic instinct. You know, you go to churches in Europe and you can see it. You can see these places that were wrecked. I mean, literally windows broken and statues knocked down. Well, I'll tell you a third example of it is in my own lifetime. Look at the churches built, Catholic churches built in like the 60s, 70s, 80s. When I was coming of age. Von Valtasar, one of my favorite theologians, called them the great barns of the Reformation. And what he meant was it was a new iconoclasm. It was denuding these buildings of symbolism, imagery, narrativity, color. Great big brick, empty kind of Bauhaus modernist buildings. Well, you know, I went to Europe to study, to get my doctorate. I went to Paris and Chartres, Notre Dame and the Sainte Chapelle and the Rouen Cathedral and Reims and Amiens. And here's this poor kid growing up in 1970s America, where church buildings were meant to be. Oh, no, stark brick. No, no, get rid of the pictures, get rid of that. It was a very rationalistic way to build church Buildings. But then you go to Europe and these buildings are just. They're crawling with symbolism and iconography and color and narrativity and so on. And I remember realizing, very consciously, I'm a, what, 29 year old guy, I'm in Paris thinking, man, something went wrong. Something went wrong with the Catholic spirit. So that's a long ranting speech about. From the iconoclast controversy up to the Reformation to my own time, there are these outbreaks of iconoclasm that are rationalistic, anti imagistic, anti narrative, anti symbolic, and that wreaks havoc because the soul feeds, you know that the soul feeds on all that stuff. That's what nourishes us. You, Peterson, others, I think, are saying, hey, hey, look at this world. That's on the far side of an iconoclasm."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":849.22,"end":883.85,"speaker":"Jonathan Pageau","text":"Yeah. I mean, Quebec. Right. And so Quebec used to be the most Catholic place in the world. And so you can see it. You can, because we have so many churches. And so you can. You can see the decline and how in the 50s and 60s it was starting and then it accelerated to these monstrous things. These monstrous, just horrible buildings that. So you agree no one cares about, no one likes them, everybody hates them. And. And there's something even more even. Not just the images, but the actual transformation of the space from a traditional hierarchical space."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":884.25,"end":884.57,"speaker":"Bishop Robert Barron","text":"Yeah."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":884.89,"end":890.25,"speaker":"Jonathan Pageau","text":"This desire to eliminate this three part structure of the church, which is the same as the temple."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":890.25,"end":891.21,"speaker":"Bishop Robert Barron","text":"The temple, right."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":891.21,"end":906.01,"speaker":"Jonathan Pageau","text":"One of the oldest structures. And it's this old. Even pagan temples are made this way. This sense of entering into the mystery and flattening everything. So the flattening of the symbolism ended up being the same flattening of culture that happened all around."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":906.25,"end":1010.51,"speaker":"Bishop Robert Barron","text":"We democratized it. And I mean that as a very strong criticism. I remember the years when the priest. And see, here's the mistake people made. Oh, the priest. You think Bob Barron is such an important guy that he belongs up in that chair in front of everybody? Come on. It's not Bob Barron. It's the priest who has this symbolic role acting in Persona Christi. It's Christ presiding at the liturgy, you know, and the priest garbed so as to mask his own kind of grubby identity. It's not Robert Barron, it's. It's this symbolic figure now in Persona Christi. And then we did it across the board with the architecture, with the liturgy, with our style. We flattened it, democratized it, and we robbed it of all that evocative business. Do you know the book? Yves Congar, one of the Great pre. Conciliar theologians wrote a book called Le Mystere du Temple, the Mystery of the Temple. And it's now. It's like it was a seed that was planted long time ago, but it's come up. All the Catholic theologians now are reading that book. They're rereading it to say y. Yes, the Temple. And as you know, I mean, the Temple hearkens back to the garden. I mean, it's this great symbol from the very beginning. But when we denude the Temple of all of its cosmic and psychological and spiritual symbolism, then it becomes, as indeed many thought it should become just a gathering space. You know, I remember hearing that as a young guy. Oh, no, the church is just, you know, it's where the. It's the pilgrim people on the way and we put the tent up for a while and we stay there. Well, that's turning the Temple back into the tabernacle from the book of Exodus. The Temple is meant to be. It's the axis mundi, right? I mean, it's the place where we connect to the deepest value."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":1011.95,"end":1068.7,"speaker":"Jonathan Pageau","text":"The Christian temple is also eschatological. The structure of the church is based. I always tell. Even I remember when Protestants would tell me that. Why are we going back to this Old Testament stuff? Well, it's actually mostly based on revelation, because the altar in the Temple was not in the holy of holies. The altar was in the court. And the reason why the altar is in the Holy of holies is because of the Cross. And it's because of what we envision in Revelation of the Lamb on the altar as the. As the kind of fulcrum of the worship. And so we're actually, it's. And you can see it in early Roman churches, you've seen these early Roman churches, that the entire decoration of the church is eschatological. It's all the 24 elders and the singing angels and the new Jerusalem. This is the imagery that actually propulsed iconography. Was this first, this church as a place where, let's say, the return of Christ is already happening, we're already participating in the kingdom. It had this kind of glorious aspect to it."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":1068.94,"end":1151.39,"speaker":"Bishop Robert Barron","text":"You're absolutely right. But can I say this? I'd be willing to bet if you talked to 95% of Catholics, they wouldn't understand that because we weren't taught that gathering place where we come together as a community around the table of the Lord. We heard all that language. And again, may I say I'm a great reader and admirer of many Protestant theologians and so on. But it's a totally Protestantized understanding of the church and the liturgy. It's where the people, out of their free will, decide to gather as a community around the table of the Lord with no decoration, only the word being proclaimed, et cetera. But what you're talking about, which is classic stuff, it's deeply rooted in the Bible, comes roaring up into the great tradition. But trust me when I tell you, within Catholicism, a lot of that was forgotten about and it wasn't taught, that when you step into the church, you're stepping into an icon of heaven and that the language of May our voices join with the voices of the angels. Most Catholics, if they even hear that language, would say, oh, it's nice little pious decoration. No, we mean it. The heavenly worship is being participated in and represented iconically by our worship here below. And no, that's. I'd say most Catholics would miss all that. There are some people right now in the church that are really trying to revive that tradition."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":1151.55,"end":1193.44,"speaker":"Jonathan Pageau","text":"Yeah. And I think Balthazar, you mentioned him before, poked at this and was able to kind of awaken some. Some little flame. I think, for myself, in the Orthodox tradition, there's a lot that has been preserved, a lot more of that kind of cosmic vision. I think it was also in the 19th, 20th century. You can feel it slipping away. But it seems like, because it had been kept for so long, that there was enough to revive it today. And I'm pretty happy, I'm pretty excited that the things that I'm presenting. Some people are surprised by what I'm presenting. And then a lot of my hierarchy has been recognizing it and saying, no, this is what St. Gregory of Nyssa is saying. This is what St. Ephrem's saying. I'm just presenting it maybe a little differently for the modern people to understand."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":1194.4,"end":1207.18,"speaker":"Bishop Robert Barron","text":"I don't know the answer to this. Tell me, would most people in, let's say, the various Orthodox traditions, would they understand. Understand their own liturgical richness, or have they suffered, too, from some of this rationalization and flattening out?"}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":1208.06,"end":1264.38,"speaker":"Jonathan Pageau","text":"I think individually, I think that's happened, definitely. You can see it on the verge of communism and on the verge of all the chaos of the 20th century. You can feel the meaning slipping, and it slips in different directions. It doesn't just slip towards materialism. It also slips towards a kind of weird esotericism. You see that in the Russian church, especially, all these strange icons start to appear. But I feel like today there is enough there and the emphasis on St. Maximus, which has been happening since the 50s with Baltazar. He's who's Catholic. But this emphasis on Maximus has been a lifesaver and has helped people come back towards this cosmic vision of the liturgy and around the idea. When I talk to people, everybody is. People maybe don't necessarily understand the specifics of it, but they at least understand the basic notion of it and aren't scared by it. They don't find it pagan or strange the way that other people might find it."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":1264.54,"end":1343.84,"speaker":"Bishop Robert Barron","text":"You know, who's onto that in our tradition was Ratzinger, Joseph Ratzinger and his texts on liturgy. And he's grounded in people like Guardini going further back in the 20th century. But the cosmic dimension Ratzinger felt had really been forgotten. And I can testify as someone that was. That came of age during that time, absolutely no one thought of the liturgy cosmically. We thought of it as the place where the community gathers for mutual support and to revive our interest in kind of making the world a better place. I would say that's how we understood it and that we were strengthened at the table of the Lord to do the work of building the kingdom. Now, again, there's place for all that language. There is place for it. But as you say, the eschatological, the cosmic, the transcendental, all of that was underemphasized, and Ratzinger was trying to recover it. Then he becomes pope, and that's why he puts such a stress on the liturgy, but recovering it in a fresh way. Now, as you know, their liturgy war is going on all the time, and they've been revived in the Catholic Church over the Latin versus vernacular issue. But see, the deeper thing, Ratzinger wasn't saying, boy, oh, boy, let's go back to Latin. He was saying, boy, oh, boy, let's go back to exactly what you're talking about. Let's go back if you want to, this cosmic and richly symbolic eschatological understanding of liturgy. And I think that's still very much."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":1343.84,"end":1362.04,"speaker":"Jonathan Pageau","text":"What we need to do, definitely. But it's tough because you can see how Ratzinger was attacked even for trying to be connected back to the own tradition, taking out an old cross and bringing it out in procession. All of a sudden, everybody's saying, look at the ridge Vatican. That's a museum piece."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":1362.04,"end":1362.48,"speaker":"Bishop Robert Barron","text":"What are you gonna do?"}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":1362.48,"end":1392.58,"speaker":"Jonathan Pageau","text":"You're gonna dismantle it and sell it? It's been in the church for 400 years. And so he was just constantly attacked for his vestments, for the processions, for the desire to kind of bring back this vision of the kingdom, let's say, in terms of the material use of it. And so it's difficult because there is also a fight, like you said, there's a liturgy war. And there are people who see that as a kind of ostentation or as just."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":1393.67,"end":1510.67,"speaker":"Bishop Robert Barron","text":"But do you agree with this? I mean, that goes right back to the apostles and Judas, you know, I mean, couldn't this have been sold and the money gave the poor? And then Jesus, though, with this wonderfully extravagant sense of, you know, what she's done? And he explains what she's done in this beautiful, I mean, ultimately cosmic sort of perspective about his death and his resurrection and so on. But see, that attitude, which I would. I bring it from Judas, if you want, all the way to Immanuel Kant, 18th century, would say, well, religion is fundamentally about ethics, right? So liturgy and sacraments and prayer and all that stuff is kind of extraneous. What really matters about religion is ethics. Well, see, I think we're all Kantians now, in a way. How often people today would say something like, oh, you know, it doesn't really matter what you believe as long as you're a good person or, you know, you're a social justice warrior for all the right causes. That's what matters. And all the other stuff is kind of foo foo, or if it helps you, God bless you. But the really important thing is that you're ethically committed. Well, that's right out of the Kant playbook. That's right out of. Couldn't this have been sold and given to the poor? Where in fact, religion is that indeed, as an implication. There's ethical implications and social implications, of course, but it's grounded in something much stranger and weirder and wonderful and sacramental and eschatological. But that all got bracketed, I think, in the Kantian manner as extraneous to the ethical core. That's done a lot of damage. But you talked to most Catholics, I think, would probably subscribe. They don't know it's Kant. But to a Kantian view, as long as I'm a good person, that's all that matters. But as you say, like bringing a gorgeous cross out of the Vatican museum someplace, well, it's not just, boy, how much is that worth? And we give it to the poor. It's splendid. And it opens a window in the soul and it accomplishes all these things and that go beyond the merely ethical."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":1510.83,"end":1599.68,"speaker":"Jonathan Pageau","text":"Yeah, exactly. I mean, nobody. It's funny because nobody complained when they build these monstrous Buildings like the Guggenheim Bilbao or whatever, this massive, huge. Nobody's complaining when you build this massive multimillion dollar temple to modern thinking. But if it's given to God, then no, it all has to go to the poor. The image of Judas you use, I've used this several times to kind of talk about hierarchy, right? That it begins with worship. And this is something which is. People are now starting to understand almost technically, that the first thing that's important is what you're focusing on. It's the right. The telos, or the reason is there before all the rest. And so when Christ says the first, you give up to God and then you care for the poor, those are not opposites, right? They don't contradict each other. Actually, one leads to the other. Because if you just create a kind of social justice mesh or this kind of social justice thing, it becomes totally open to corruption. If you don't have the highest ideal first, then the other thing becomes a system. And I've seen it. I worked in Africa and kind of charity work for several years, and some of it was just monstrous. Just because you give money doesn't mean that it does what you think it does. Not if all your attention isn't oriented to something which is actually judging you. People hate to hear that. But judging you in the sense that it's the ultimate good to which you're looking, then the rest will fall apart at some point."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":1599.84,"end":1672.19,"speaker":"Bishop Robert Barron","text":"Well, that's why I learned this from the Church Fathers, both East and West. If there is a master theme of the entire Bible, and it's always dangerous to say, but if there's a great master theme in the entire Bible, I would say it's orthodoxy, by which I simply mean right worship, right praise. So we're made to lead all of creation in a chorus of praise to the true God. That's how the Fathers tended to read the Genesis account. I interpret it in a sort of Catholic way as this stately liturgical procession of all the things coming forth from God, you know, one after the other in a beautiful, ordered harmonic procession, at the end of which comes the leader of the praise. That's the person, the bishop or priest that comes at the end of the procession is now to lead the praise. So now we know what human beings are for. They're for right praise, and not just for themselves, but on behalf of all creation. And there, as you say, Eden itself is a temple, an elevated place because the rivers run out from it. So it's an elevated place and human beings are meant there to Be priests, kings as well and all that, but priests leading creation in a chorus of praise. So what goes wrong? Bad praise. It's always the problem in the Bible. I don't know. An exception, really."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":1672.58,"end":1673.3,"speaker":"Jonathan Pageau","text":"Yeah, you're right."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":1673.3,"end":1820.3,"speaker":"Bishop Robert Barron","text":"Whether you're looking in Exodus or the first book of Kings or anywhere you're looking, the problem is bad praise. And from bad praise follows everything else. Bad, the disintegration of the self. And that's what, you know, I think Peterson and company are really good. The psychologists, they can talk about that, what it's like when that. When I disintegrate on the inside, and that comes from bad praise. I start praising money or fame or power or whatever. You know, I'm like the priest of baal. I'm hopping around the wrong altar and I'm slashing. They're bleeding. Well, that's people today. I think that's people in addictive patterns today hopping around the altars of baal and they're harming themselves. So Elijah does what the biblical figures always do, which is he calls it back to right praise. And that's the only way that the fire's gonna fall if we're properly aligned to God. So I think that's the whole story of the Bible. In many ways, then Jesus, how do we read him? But the new Adam, he's the new David, he's the new temple, he's the one divinity and humanity come together in him. He's the point of right praise is humanity giving right praise to God. You know, so if anything, I put my finger on that as the master motif of the Bible, and see here, it's what we need to tell the world. I'll speak as a Catholic. We lost confidence in ourselves. Our game became so much. Let's make ourselves pleasing to the culture. You know, when I was a young guy, it's reaching out to the culture, making sure the culture understands and let's use the culture's language. We lost confidence in ourselves. And honestly, the culture wasn't that interested in us. You know what I'm saying? They weren't reaching back to us with enormous. They were like, oh, yeah, yeah, great. As we move on, where the church ought to say no, in season and out, no matter where the stupid culture is, we proclaim and we proclaim right praise, which brings us back into right order and so on. And in the meantime, this culture that we're all trying to mollify, it's the priests of Baal, and there are 450 of them, right? I mean, they Always outnumber us. There's one in Elijah, but by God, he was the right prophet. But there are 450 priests of Baal. They're all over the place in the culture. Why are we pandering to that culture? As our primary move, we should be declaring the way Elijah did anyway. End of rant. I mean, that's a homily."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":1820.3,"end":1901.15,"speaker":"Jonathan Pageau","text":"No, but you're very right. And I think that. I think that even just 10 years ago, saying that would have just gone over people's heads. People would not have understood why worship is important. And I think so in a way, we can absolve some of our. The people before us, because there's something that happened, this kind of materialism, this kind of physicalism, which made people forget that the world is primarily made through attention. That is, from the very beginning of Genesis, when God declares and sees and judges as good, you realize that this is actually how the world comes together. And the things to which you attend will flow downstream and will create fruits. And so if you worship money, if you worship other things, and that the pattern of addiction is a liturgical pattern. It's just a satanic liturgy. And anybody who's gone through addictions will notice that because it has an order and you. And it always happens the same way. It's like you fall in these sins and you just keep repeating them over and over. And the same person can find it stupid that a Christian will repeat his daily prayers every day, but then they'll still reach for that cigarette and not realize that they're doing the same thing. But their pattern is destroying them and eating them up and enslaving them rather than bringing them higher, towards higher patterns."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":1901.31,"end":2017.09,"speaker":"Bishop Robert Barron","text":"No, absolutely the way it works, and I read this in the Fathers, but also in more contemporary people, because what the Fathers would have called and Aquinas, maybe concupiscence, we might translate today as addiction, because you start worshiping something other than God. Well, you get a buzz from it because you're in an impassioned way around some worldly good. And it really is a worldly good, whether it's pleasure, it's honor, it's power, whatever. So, okay, I get a buzz from that, but the buzz will have to wear off because we're not meant for that. The hearts wrestle to rest in God. And so it wears off. All right, I better go back to that source again. And so I strive and strive and strive, or I hop around the altar again and again and again, and then I get it. So it's more wealth or More honor, more power. And I get a buzz. But every addict knows that it's less intense the second time. So now I start to really panic. And I go back now with a kind of insistence, and I'm hopping like mad around that altar. Now I'm drawing blood. Now I'm wounding myself because I'm so addicted. And then before you know it, you are in this little awful cycle, and it's the same. The woman at the well is the same thing. You know, you come to this well every day and you drink, but you still get thirsty. I want to give you water welling up in you to eternal life. I want to break you from that addictive pattern because I want to hook you onto the supreme good, which turns out to be love, by the way, which is why it keeps overflowing. But the churches need to keep telling the story. The society needs it like mad. Addiction might be the way to name the fundamental problem today, spiritually and psychologically. And we got the answer. The answer is grace. The grace that breaks you out of these addictive patterns. And it's right praise. It's. You know, Paul Tillich said that. Tillich said all you need to know about someone, you can learn by asking one question. What do you worship?"}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":2017.09,"end":2017.49,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":2017.49,"end":2040.54,"speaker":"Bishop Robert Barron","text":"And I've always thought that's dead right. What is of highest value to you? Once I know that, I know everything about you. You just said about the streams flowing. Yeah. I'll know everything I need to know about you when you tell me what's highest value to you is money or even your family, your culture, your society. Those are all good things, but they shouldn't be worshiped. And they're going to lead to addictive patterns. Yeah."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":2040.54,"end":2086.94,"speaker":"Jonathan Pageau","text":"And you can see, if you want to know where our society is, you can also look at what are the things that we're encouraged to worship and what are the things that we're allowed to worship. Right. And so. And it's clear, like, there are certain values which, like you said, like, let's say, for example, in the environmental question. It's a good question. It's a good. But it's when it becomes. When we're shown that this is what you need to worship, and everything has to submit to the worship of this, whether it be that or the idea of inclusivity. There are different values which have become the supreme values, and then all other values have to kind of fit under them. But if it's not the right value, if it's not love. Right. If it's not the infinite source of the world, then it's an idol, and it'll have bad fruits down the road at some point."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":2087.02,"end":2160.68,"speaker":"Bishop Robert Barron","text":"It's the oldest story in the world, and it's still the best story and the one that we need to keep telling. And our job is not to make the culture like us. Our job is to proclaim this story. Cause it's the story of Christ. I mean, Aquinas says, if you want to be happy, love what Christ loved on the cross and despise what he despised on the cross. It's a very cool little formula. And what did he despise on the cross? Wealth, pleasure, honor, power. You know, to look at the crucified Jesus and say, how much wealth did he have? How much pleasure is he having? How much power does he have? How much honor? As they spit at him and they mock him, it's like he's taking all the worldly values and he's crucified to the world. What does he love on the cross but the will of his Father, which allows grace now to pour into the whole world? And so you want to be happy, Thomas says, and that's why he thought the cross was where the Beatitudes appeared. So the Beatitudes are moral guides in a way, but they're Christological descriptions. You know, the poor in spirit and so on. And those who have eschewed wealth look at the cross. And so we need to do what Paul did. You know, I hold up Christ and him crucified. We have to do the same thing. Because the culture needs Christ as much as it's ever needed Christ, it seems to me."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":2160.84,"end":2190.95,"speaker":"Jonathan Pageau","text":"Yeah. And there's a mystery in that, which is this is something people struggle to understand in terms of Christian asceticism or the Christian desire to eschew the desires of the world or the pleasures of the world. Is that as you do that, you actually discover the ground of those pleasures as well. Right. You discover the reason why they exist in the first place. And then they become rightly ordered in your life and also in the society, if you're able to actually sacrifice them to the highest good."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":2191.43,"end":2255.24,"speaker":"Bishop Robert Barron","text":"Do you know that it's from Chesterton, because he early in his life was kind of agnostic. And he said, when I was convinced that only the goods of the world would make me happy, I was so unhappy. But once I became a Christian, I realized, oh, they're not meant to make me happy. Then I really started enjoying them. That's exactly the point you're making. So Chesterton drinking and Eating and he loved life. And full of humor and all that. Great, great. What liberates you for that is precisely a liberation from those things as objects of worship. Once I'm free of that, I can really enjoy them as they're meant to be enjoyed. But when I start worshiping them, they become a source of torture. And everyone knows that, right? That the thing I worship, it tortures me because it's never going to make me happy. And it keeps drawing me obsessively to itself and the churches. That's our job, is to keep announcing it. And what you do, I think artists do it by showing these great images that embody these spiritual truths. But we gotta pick up our game. I think the culture's a problem for sure, but we gotta pick up our game."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":2255.48,"end":2335.85,"speaker":"Jonathan Pageau","text":"Yeah, I think the young. It's like I look at the people that follow what I'm doing and it's not a massive amount of people, but let's say there's a certain amount, but they're mostly young. They're mostly like 20 to 30, 35. And so what it feels like is that it is also seed being planted and that even like, let's say 10 years ago when I started icon carving, I was working with an architect named Andrew Gould and we realized that even in America, the Orthodox church didn't have a culture of beauty. And so we set out, we started a journal and we started writing articles and putting out beautiful images and. And now 10 years later, we can see the seminarians that were there 10 years ago. Now they're the priests and we can feel the change in culture. And I think the same with you. I look around what you're doing and I see the same thing, a bunch of young men like in their 20s who have this energy and so, and so it seems like there's no other, because the other stuff is going to die. It's already dying. This kind of lame Christianity, this materialist Christianity, this kind of supercritical Christianity which leads to atheists becoming, you know, heads of theology departments and all this kind of nonsense, it's just going to vanish. And so what's going to be left are those that have this cosmic understanding and are able to participate in it."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":2336.01,"end":2401.35,"speaker":"Bishop Robert Barron","text":"Absolutely. And the self loathing of Christians is always a source of frustration to me. Did you notice it was a couple weeks ago when Harvard University chose as like head of chaplains a guy who's an atheist. I wrote this article about it just. And my point was it wasn't against him. I said, I'm sure, he's a nice guy, I have nothing against him. But I said it's the self loathing of the Christians at Harvard who have such a low regard for their own thing that they'd say, oh yeah, I'm fine. An atheist, someone who denies the existence of God can represent the chaplains. You know, I mean, it's like you've just surrendered to the priests of baal and maybe I'm individually, the priests of BAAL might have been lovely people. I'm saying if Elijah just said, well, you know, yeah, they're great, you know, sure, let's have one of them in charge of the temple and come on, I mean, why have we surrendered? We've got the words of eternal life. And it's not arrogant to say that. It's what all the great saints knew in all their humility. The great saints knew that. And so I hate the self loathing of Christians. I think it's terrible."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":2401.59,"end":2468.53,"speaker":"Jonathan Pageau","text":"But there's really an interesting, there's a transformation happening. I'm perceiving it in secret, you could say, where I had this crazy experience where there are priests giving these catechumenate classes online now because they couldn't meet during the COVID And so one asked me if I could come to this class who was giving to catechumen. So all these young people, these 20 year olds, and one of the guys expressed, he said, I'm not sure I'm doing this for the right reason. And he said, because I feel like I'm here doing this because this is the place to be. This is the coolest place. Like this is the future. And that it's like, it's, it's like in these fantasy stories where people are rediscovering this ancient mystery that has been lost. This is the, this is the edge that we have, is that people don't know about the entire mystical tradition of the church. They don't know about the entire symbolic tradition of the church. They have this silly superstitious vision of what it is and very superficial. And so it doesn't take a lot to just poke at that and show them this powerful mystery that is there, which is true. And so you can actually shock people into realizing what religion is about because they think it's nothing."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":2468.69,"end":2577.79,"speaker":"Bishop Robert Barron","text":"And then they'll inhabit the moral space much more efficaciously and much more powerfully when it's fed by these mystical sources. But when you cut off the mystical sources as superstitious and then you say we're going to just hang on to these great social justice principles, well, then we become an echo of the culture, then who cares? And if our buildings look like they could be banks or they could be, you know, purely secular spaces, who's gonna be interested? But when you've got a Chartres cathedral that looks like it's landed from another world, which indeed it has, right? I love the fact that Kenneth Clark, one of my great heroes, did civilization many years ago. You know, the great art historian and he was at Chartres and he said, keep in mind this was all painted in vivid colors. And he said, how much even more fiercely Tibetan it would have looked. And it's always struck me that you imagine shart not just sort of blank, but alive with color. It landed from another world. And you're meant to be drawn into this world transforming vision of everything. If our churches and our behavior and our self understanding is just a vague echo of the culture, everyone's gonna get bored. And of course, young people will stay away in droves, but they will be attracted. I'm glad you mentioned the word on fire gang, because I do have all these extraordinary young people. Super smart, very artistic, hyper motivated. They won't be turned on. I called it Beige Catholicism. Years ago, when I first got back from my doctoral studies, I began writing and I wrote a little essay about beige Catholicism that we've allowed our colors to bleed into this bland beige. Well, no one's going to be interested. I wanted something fiercely Tibetan about our Catholicism. I want it to be edgy and colorful and challenging."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":2579.23,"end":2583.31,"speaker":"Jonathan Pageau","text":"We're lucky. In Montreal we have. Have you been to Notre Dame Basilica in Montreal?"}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":2583.47,"end":2584.19,"speaker":"Bishop Robert Barron","text":"Yeah, sure."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":2585.39,"end":2599.93,"speaker":"Jonathan Pageau","text":"It's as if you feel that you are in shout in the Middle Ages. They have the ceilings painted with gold stars and, you know, all the pillars are ornamented and everything. And you think like, wow, I can project this into space and know what it would have been like to stand in these medieval cathedrals."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":2600.01,"end":2653.39,"speaker":"Bishop Robert Barron","text":"We forgot, though, this is a story I've told before. I don't know if I did it with Peterson, but with a classmate of mine many, many years ago, I was a student in Paris and I took him down to Chartres to show him. And we went all through Chartres and I explained everything to him. And then he said, yeah, it's great. It's just so liturgically off because he had been trained the way I was. The lurcher should be in a circle and we all see each other and it's all leveled out and. But here's this chart which, as you say, goes Right back to the temple. It's like the most liturgically correct place I can imagine. But the way we were trained, that was the right response was, yeah, it's too bad, you know, it's old fashioned, it's not liturgically correct. That means something's gone wrong with the human spirit. So we are, we're recovering it. There is better church architecture today within Catholicism and there's a better sense of the cosmic point of the liturgy, the."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":2653.39,"end":2694.1,"speaker":"Jonathan Pageau","text":"Temple, all that, I think so I've seen several, I mean there are several liturgical movements that are kind of popping up and also there's something in the thinning which will produce that same thing. Because as the social justice type person that only wants the moral aspect of Christianity finally realizes that there's no reason to go to church anymore. It's, it's, then the people that are left are going to be the people that love the tradition, that love the, you know, to be connected to what our ancestors kind of gave us, to have this, this really grounded sense that we are in this, this story, like we're participating in the story, you know, that story in scripture. This is still your story."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":2694.26,"end":2695.58,"speaker":"Bishop Robert Barron","text":"Yeah, you're in it."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":2695.58,"end":2722.97,"speaker":"Jonathan Pageau","text":"And all of this, this, this whole, you know, we've been doing a series in on my channel called Universal History where we're going back into all the legends, all the things that the historians, throughout all of it, we're just saying we're going to re explore this, you know, even the things that they told us was completely stupid, like Prester John and all of these traditions. No, we're going to, we're going to explore it and look at what it means and what it helps us understand about, you know, what it means to be a society, what it means to worship and how this all kind of."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":2722.97,"end":2814.5,"speaker":"Bishop Robert Barron","text":"Comes together, this ethical thing in mind. I want to see what you think as I think about this. Go back to the civil rights movement, 50s and 60s, right in our country that were led by for the most part very religious people. So King, the most obvious example, but the many others religious people that led this movement, and you read the sermons of Martin Luther King, I mean, he's grounded in the Hebrew prophets, he's grounded in the great biblical tradition, he's grounded in Jesus, et cetera. And so his social justice activism had a deeply, I'd say, mystical and spiritual source. The fact that today this sort of revived social justice movement is not being led by, by religious people. In fact, there's a great hostility to religion, I think has given this present moment A much darker hue. It's a much less edifying spectacle because the leadership is not grounded in the mystical and the biblical and the prophetic. And so it will turn in short order into simply a us against them, deeply violent. Where King. I mean, look at King's language. It's judged not by the color of his skin, but by the content of their character. And he said, I want to draw white people into the beautiful community. I don't want to expel them from it, et cetera. But. Well, that's coming up out of a Isaiah sort of vision of things. The loss of the mystical and the prophetic and the biblical. We can see it today, can't we? That's my theory. In the social justice movement, it's a much more dire prospect today than it was 50 years ago."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":2814.88,"end":2860.4,"speaker":"Jonathan Pageau","text":"And it looks like you said it's very dark, because what it ends up looking like, and it's sad because I don't think people are going to be able to perceive it until it's too late, is that it ends up looking more like a pogrom or a mob. Like a mob justice thing. You know, it's not yet bloody or not very much. It's still in words and in and in, you know, online and everything. But that pattern, you know, of finding the victim, destroying their life and getting rid of them and is something which that definite will inevitably start to bleed out into. Into culture. I mean, people do lose their jobs, and there's all of this happening. So we can see that the very. The very pattern of desiring justice and desiring supposedly out of love and compassion is turning into the very thing that they hate."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":2860.8,"end":2918.24,"speaker":"Bishop Robert Barron","text":"Absolutely. The Girardian dynamics you're alluding to there. The scapegoating stuff is for sure. And I always go back to, you know, Isaiah chapter two, this. This beautiful image. Again, it's evocative of the temple and of. Of Eden and everything else. Mount Sinai is. The tribes of the Lord go up the sacred mountain. Well, they go up the sacred mountain because the temple's there at the top of it. And it's all the tribes, not just of Israel, but then all the tribes of the world. That's the vision. But what unites them? It's not some social justice conviction. It's not some Kantian ethical imperative. It's the worship of the true God. They come up the mountain together to worship the true God. That's what draws us together. Without right worship, attempts at togetherness are going to fail, and they're gonna fall into something like Dissension and scapegoating and us against them. So again, that's the answer is what's on top of the sacred mountain is the place of. Right. Worship. That's the only force."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":2918.56,"end":2927.92,"speaker":"Jonathan Pageau","text":"Yeah, we see it in Revelation 2. It says that New Jerusalem gathers the glories of all the people into it, as the Lamb is at the center of this whole pattern."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":2928.66,"end":2956.98,"speaker":"Bishop Robert Barron","text":"Absolutely. You know, that's why I remember in our conversation with Jordan Peterson and he was, I think John was as well talking about the kind of psychedelic drug stuff and was that influencing the author of Revelation? And I mean, who knows what the author of Revelation was taking? I don't know. But you and I both said some version of no, no, that stuff is grounded in Ezekiel and in Daniel. And you know, you don't need, in other words, psychedelic drugs to come up with those images. They're from the literary and spiritual tradition of the Old Testament."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":2957.87,"end":2996.46,"speaker":"Jonathan Pageau","text":"Yeah. And by the way, thank you. It was nice to have another Christian with me because I've been having this psychedelics discussion with so many people. It's like it's in the culture. So it was nice to have you there to kind of maybe a little push back against that tendency in culture. I don't think it's, I don't think it's leading us in the right direction. And as you said, I mean, I've never taken psychedelics, but I know the iconographical and typological language of Scripture. And so when I see Revelation, I've read Daniel and Ezekiel and I've seen the frescoes and this whole, the space of the church and the way it's laid out in terms of iconography, it all makes sense to me. It doesn't seem so freaky."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":2997.18,"end":3033.9,"speaker":"Bishop Robert Barron","text":"Can I ask you a question? You know, my academic area of specialization is Aquinas and people always say Aquinas and Augusta and Aquinas, Aristotle and so on. But I've always been struck by how Eastern Thomas is. Because you've got Pseudo Dionysius, the Areopagite is a huge influence on him. But also Chrysostom is a huge influence. Gregory of Nyssa is a huge influence. John of Damascus, he quotes, he calls him Damasenus. He quotes him all the time. Gregory, I mentioned Gregory of Nyssa, who's your go to guy among the Eastern figures, like of those I mentioned, do you have someone that really has anchored things for you?"}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":3034.22,"end":3045.4,"speaker":"Jonathan Pageau","text":"Well, for me it's really, let's say in terms of symbolism, it's St. Gregory of Nyssa. And in terms of in terms of, let's say, the full vision. It's Saint Maximus the Confessor Maximus."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":3045.4,"end":3045.8,"speaker":"Bishop Robert Barron","text":"Yeah."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":3046.68,"end":3076.22,"speaker":"Jonathan Pageau","text":"His understanding, his theory of the logo, you know, and how it all comes together and unites, which is grounded in Dionysus, of course, to me is not only what grounds me, but I feel like it's something that I can use to reground Christianity for the contemporary world because it has something to do with meaning and the capacity for man as the locus of meaning. All of this makes so much sense and can be explained to people today. So he's really. He's definitely the person I go to."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":3076.22,"end":3127.02,"speaker":"Bishop Robert Barron","text":"Yeah. You know, when I was a doctoral student in Paris, I went to my first seminar with Michel Corbin, who's still alive, he's a Jesuit priest there. And he turned out to be my doctoral director. I didn't know that at the time, but he introduced himself to us all and he said, I now je St. Quentin, now I'm 50. He said, When I was a young man, I read Hegel, I read Heidegger, I read everyone that we were supposed to read. And he said, now that I'm 50, I find Gregoire Denise. Now I read Gregory of Nyssa and it was maybe the first time I'd really heard Gregory of Nyssa. I was what, 28 at the time, I guess. But I always think of Corbin when you mentioned Gregory of Nyssa, that he just found him to be such a go to guy at that point in his life. And Corbin was in fact very influenced by the Greek fathers and that sort of got me into that world a bit when I was doing my doctoral work."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":3127.18,"end":3188.51,"speaker":"Jonathan Pageau","text":"Yeah, the life of Moses. You know, I've got kind of deep analyses of the life of Moses and that. That structure the way the whole narrative, like the way that he sets everything up and he. The way he creates this pattern of the mountain and then opposes different things is. It's the key. I've done a talk where I draw the mountain and put up all the elements and then show icons so people can see that the pattern that San Gregory is Sen. Gregory is calling to is the underlying pattern of the architecture of the church and of all the icons. It really is he really. His vision was so. Was so powerful. I mean, it's so short, the text is so short. You have to be careful not to miss things, you know, because they're all so condensed together. And Assyrian too is my. The hymns on Paradise I think are really useful for people today. Like he does typological reading, like nobody does, because he does it in a poem where he moves from the Old Testament to the New Testament and he gives us the keys, basically, as he's doing it. It's very powerful."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":3188.75,"end":3191.27,"speaker":"Bishop Robert Barron","text":"How about Gregory Polymas? Do you follow him a lot?"}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":3191.27,"end":3197.07,"speaker":"Jonathan Pageau","text":"It's just too hard to read for me. I find him so difficult to read. And so I leave that to others."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":3197.63,"end":3217.27,"speaker":"Bishop Robert Barron","text":"He's often called the Aquinas of the East. You know, he has that kind of scholastic. And at one point in our program, I had to teach that era. And so I read some of the texts of Gregory and the whole thing about the transfiguration and the energies versus the essence, all that business. Anyway, it's interesting for the Thomas to engage him."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":3217.35,"end":3248.31,"speaker":"Jonathan Pageau","text":"Well, definitely. How can I say this? I can see, I can understand basically the essence, energy, distinction, and I can understand that with that distinction, it gives a possibility, a clear possibility of the man in which God can be completely imminent and also at the same time, absolutely transcendent. And how. There's no confusion in that. But beyond that, I struggled with a lot of the really pointed distinction people make, and I just leave that to the theologians. At some point."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":3248.55,"end":3288.05,"speaker":"Bishop Robert Barron","text":"You know, I think with Pseudo Dionysius, the very young Aquinas goes with Albert the Great to Cologne as like his assistant. And Albert the Great, we know, was teaching the divine names of the Pseudo Dionysius and the young Aquinas. We actually have a manuscript in his young hand, a little bit shaky and unsure where he's copying out Albert's lectures. So the very young Aquinas took in Dionysius in a deep way. And it's all through his theology, all through it. So it's not just some kind of rationalistic Aristotelian product. It's deeply influenced by the east and all the mysticism, but it's just."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":3288.05,"end":3312.09,"speaker":"Jonathan Pageau","text":"It's the same with Origen and many of the Fathers. What happens is that people read back into the influences, then they read back the younger developments. Yeah, so people will view, you know, like late Thomism and then they'll put that back into St. Thomas and the same thing, origin and a lot of the. A lot of these. So it's, It's. It becomes a lot of. I really try to stay away from that as much as possible."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":3312.09,"end":3312.89,"speaker":"Bishop Robert Barron","text":"I'm. I'm."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":3313.13,"end":3363.19,"speaker":"Jonathan Pageau","text":"Luckily, I'm an artist and I can just show images. And so I never get into. I rarely get into theological arguments because I'm just showing you these images of how these patterns are there and typological relationships between the old and the new. It's not as frustrating, let's say for me, I love it that way. Well, Bishop Baron, I would say I think we've gone quite a bit. I would say thank you for your time, thank you for your attention, and thanks for engaging Jordan. Not that many Christians at the outset were willing to really kind of jump in and try to, to kind of grasp what he was saying, to be able to criticize him for the things that he's going nuts about, but then also really see how it's pulling in people towards the church. And we've seen it. And so thank you for that courage, let's call it."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":3363.19,"end":3434.54,"speaker":"Bishop Robert Barron","text":"I'll just say one quick thing about that. A couple years ago now, I was chair of the Bishops committee on Evangelization. I had to give a talk on what they call the nones. Right, The N O N E s, all the young people leaving. So I gave all the stats and said, here's, I think, why they're leaving. And then I said, here are some signs of hope. And I went through a number of things and my last one was, I said, the Jordan Peterson phenomenon. And I said, look, I'm not saying I'm endorsing hereby everything he's ever said. I don't even know if he believes in God. This was a couple years ago, you know, I said, but he's this smart guy in a non flashy way, talking about the Bible to armies of young people in person and even bigger armies online. And I said, millions of people. Yeah, yeah. I said, I think that's hopeful for us. Well, I think a lot of the bishops took it in for the bishops were fine, but Catholic social media afterwards, I mean, blows up because again, everything's gotta be read politically. And so Jordan Peterson, he's not totally on board with all the identity politics stuff. So he's a bad guy. Bishop Barron is recommending this bad guy. And I'm like, no, no, bracket all that. I don't care about all that. Forget all that. I'm just saying, smart guy talking. The Bible is turning on these young people. That's a sign of hope."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":3435.26,"end":3453.42,"speaker":"Jonathan Pageau","text":"And also, and like you said, even at the outset, even helping people to see the wisdom part of it or see how it represents psychological patterns, which is something the fathers completely agreed with. And so it's bringing people, it's making people want to read Scripture."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":3453.82,"end":3454.46,"speaker":"Bishop Robert Barron","text":"Absolutely."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":3454.54,"end":3455.26,"speaker":"Jonathan Pageau","text":"That's wonderful."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":3455.66,"end":3461.13,"speaker":"Bishop Robert Barron","text":"Absolutely. Yeah. So I still hold to that. And we'll see what happens next. Yes, exactly."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":3461.13,"end":3473.13,"speaker":"Jonathan Pageau","text":"And so thank you. So I'm looking forward to everybody to seeing, you know, go in the comments, you know, to ask questions and everything. And so maybe one day we'll have Bishop Aaron on again if he's interested. But thank you for your time."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":3473.13,"end":3475.73,"speaker":"Bishop Robert Barron","text":"Good. I'd love that. Thanks, Jonathan. All right."}
{"episode_id":"SW - #203 - 2021-11-30 - Bishop Barron - A Return to Cosmic Christianity","start":3475.89,"end":3537.92,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to. To get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon, the Pageau videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
