{"episode_id":"SW - #072 - 2019-11-13 - The Symbolism of Storm Area 51","start":0.64,"end":23.84,"speaker":"Jonathan Pageau","text":"So, of all the requests that I've had, it is surprising to realize that the thing that has been probably the most requested in the recent times has been this Storm Area 51 event that was created on Facebook. And despite that, today is a sweltering day, I will nonetheless try to explain how this is related to certain patterns in society."}
{"episode_id":"SW - #072 - 2019-11-13 - The Symbolism of Storm Area 51","start":37.02,"end":40.46,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world."}
{"episode_id":"SW - #072 - 2019-11-13 - The Symbolism of Storm Area 51","start":50.22,"end":696.87,"speaker":"Jonathan Pageau","text":"So, as you know, the. The Storm Area 51 is a Facebook event which was created in the late June as a joke, you know, as a kind of spoof, in order to. I think the guy had. Did it, had done it after he had seen some Area 51 guy on Joe Rogan. Anyways, it doesn't matter. What is hilarious is the fact that at this moment, I'm looking at over 3 million people who have said they are either going or interested in going. And so a lot of people have asked me, why is it that this particular thing has attracted so much attention? Surprised that. Surprised that people can't really see this? Because the reason is that it is connecting to certain tropes. Now, it's going to be difficult for me to tell you what the meaning of this is in the sense that because it is a joke, because it is a. You know, it's just most of it is mostly for the memes and to be on the inside of a certain joke. It would be strange if people actually showed up to this event. I'm not saying it's not impossible that that would happen, but obviously it would be very strange. Now, the reason why it is attracting so much attention, it's because you could call it a mythological representation, a mythological version of something which is happening all around us, of a trope in society which is going on. And so what I'm going to do is I'm going to show you how it is. The way that it's framed is similar to other things going on. And maybe it can help you to understand what. What exactly it's dealing with. Now, it shouldn't be so strange to you that as this Area 51 event is being put on and as so many people are being. Are getting involved in it, are participating in the joke, there are things that are less funny which are happening at the same time. And so we have the story of this man who attacked an ice facility in the US wanting to free the. The foreigners. And this man was killed by the. The police. You have. You have activists like Shaun King on Twitter who are saying who are. And Ocasio Cortez has also mentioned that the detainment camps for Mexicans crossing the border illegally are akin to concentration camps. And, for example, Sean Kin says that the people in those concentration camps should be liber. And he says, by any means necessary. And so obviously, that is a call to violence, a call to the type of action that this man has done, which is attack the ICE facility. And so what is it that's going on? Obviously, we can see that the pattern of these events are the same as the storm area 51. That is, there is a place where we are keeping aliens, foreigners. Those two things are the same in terms of symbolism. And there are others who want to free these foreigners from this detainment camp. Now, the reason why The Storm Area 51 event is so popular is that it is really almost a liturgical version. It's almost a. Like I said, it's a mythological version of the same pattern, which means that it's not necessarily politically, it's not on one side of the political aisle. It's just picking up on this pattern and then representing it in a science fiction narrative structure. Now, why is it that this question of the aliens in Area 51, to free them, what's the big deal? What is it about? And so here's where we have to go back into my explanation about the notion of the pattern of the alien, the pattern of the foreigner, within a cosmic structure, you could say, within an ontological hierarchy. That is, we all have identities that we identify with. And as we look further from our identity, we encounter something which is unknown. I've often said things like, it is insane to say that UFOs don't exist. Obviously, UFOs exist. They are unidentified flying objects. They're akin to dragons or monsters. They are things that don't fit humans. They are things which manifest the unknown to us. And so the alien trope in our culture has come to represent the epitome of that unknown. But in the ancient world, this alien was the foreigner. And in foreign races, you had monstrous races which could be akin to the aliens today. You had monsters on the edge of the world, but you also had fantastical places. You had civilization. This notion of the. For example, in the stories of Alexander the Great, Alexander the Great travels to the land of the Brahmin. And there he meets this idyllic culture of people who don't even need clothing. They're just naked in nature. And they're completely at one with everything and everybody. They are peaceful, and they don't kill anything. And so it's like this idyllic image of the foreigner and so the foreigner, because the foreigner is unknown, the foreigner will take two sides, will tend to be a space of projection for both. The worst of us, the most animalistic, all our vices, all our excesses. And then it will also be a place to project our ideal, this idea of purity or of innocence. And so we see the same in the image of the immigrant today, or the image of the foreigner today. We have the same structure where one side of the political aisle wants to portray the foreigners or immigrants or people from the outside as possibly dangerous. Why are they possibly dangerous? Because we don't know who they are, and so we don't know what they are. So they might be dangerous. And that is obviously true. And the other side wants to portray the foreigner, the immigrant, as a resource, as a new breath of fresh air which is coming in and will increase our possibilities, will increase our capacities for work, our increase our capacity for different cultural understandings. All of that is also represented. And that is also true to a certain extent. So both sides are true to a certain extent. But now in this storm area 51, you have this same idea. You have the idea, especially in this, the storm of the year 51, you mostly have the idea that these aliens are this ideal society and they have so much to give us. They have all this technology, all this stuff that they can give us. And. And so they're like a treasure. And so the image of the alien becomes like this treasure which is being guarded by the government, by the authorities. And so we're going to go in and we're going to access that ideal thing, you know, that knowledge, that science, that technology. And so it's not that complicated. And so the reason, like I said, the reason why so many people are willing to get involved in it is because it is represented apolitically. And so you have, on the one side, I've seen right wing people get involved and use their tropes in the memes. And then I've also seen left wing people get involved and use their tropes in the meme. And so the meme is. Becomes a place where everybody can kind of come together and participate in this social trope and exchange about this social trope. Now this also comes to talk about what has been known in Internet culture as this idea of meme magic. I haven't talked a lot about meme magic, but I think it's maybe something that is worth mentioning here that these tropes, these, these memes that pop up, they also have a capacity to transform the social sphere. They have A capacity to affect the world, to change the way people see things and. And also to make things happen. And so that is usually what people think about when they talk about meme magic. And here in this storm area 51, it is only one more. One more, let's say, part. A little part of this whole atmosphere of. Of freeing the foreigners. But it's not just that. It's also at the same time, the foreigners who want to come in to the United States. And so this idea of forcing the border, of breaking down the border, and so all of this is breaking down social order to a certain extent. That is the idea that the government or any form that our society is there to. To hide something from us. I've talked about this in my conspiracy theory video, is there to prevent us from accessing certain things. So all of this is represented in the storm area 51 meme. And so on the one hand, going in and getting the foreigners, but on the other hand, the foreigners coming in and getting access to the advantages we have. All of this is contained, and it doesn't have to be rational because it is presented in this. This meme and story form. It doesn't have to be. It doesn't at all have to be presented in a. In a rational manner. It can really be a kind of, I hate to use that word, I guess, with the mythopoetic structure. Okay. And it gives a way for people to participate in. So I hope this is helping you to kind of understand why this meme has been so popular and why so many people from all different spheres and, you know, from the most edgelord Internet troll to, you know, what is it Budweiser had Area 51 cans and that song by that rapper. And what is it? Old Town Road, they did a video where they play on this storming area51 meme. And so all aspects of society can participate in this narrative trope which is appearing in our society. And the meme magic thing is going to be interesting to see whether or not on September 20, on the date that has been given for this event, whether or not people will actually show up, if they do, that would be a testimony to the capacity for affecting the world through memes. So. So, guys, I hope you enjoyed this as you watch me sweat putting this together. And I will see all of you very soon."}
{"episode_id":"SW - #072 - 2019-11-13 - The Symbolism of Storm Area 51","start":698.16,"end":762.96,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward, and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pajo videos as well, and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
