{"episode_id":"SW - #008 - 2018-07-16 - Shrek - When the Margin Wins","start":1.44,"end":1034.66,"speaker":"Jonathan Pageau","text":"So I want to welcome you to the Symbolic World podcast. This podcast is taken from videos that I've been making for about a year. And so this recording of my discussion on Shrek was actually done last year in June 2017. And so I want to really apologize for the quality of the audio. But you'll see as the podcast moves along, the audio will be getting better and better as as my own technical skills have improved and are still improving, hopefully. This is Jonathan Peugeot. Welcome to the Symbolic World. In my last video, I discussed the pathology of the center, the pathology of identity, by using Guardians of the Galaxy as an example. And I want to move towards explaining the pathology of the margin as well, the chaos of the margin. But before we get there, we need to discuss the transition of one pathology to the other. And to do that, what better way is there than comparing the movie Shrek to the Greek drama Bacchi by Euripides? It just seemed like the obvious comparison to make. So the movie Shrek is an upside down fairy tale. And because it is upside down, it is one of the most illuminating movies ever made for someone who wants to understand the pre periphery because the peripheral elements are put in the spotlight. So now a trick for those who want to interpret symbolism. If you want to understand a movie, it's best to pay attention to the beginning. For in the catalyst of a story, the movie usually announces itself, reveals its symbolic structure. And this is the case here. The movie starts with Shrek reading the basic figure fairy tale motif of the princess held in a tower by a dragon. The story is told in a beautifully illustrated manuscript. A book is almost always an image of knowledge, tradition, order, and in this case, it is also beauty. So as he's reading, Shrek rips a page out of the book to use as toilet paper if you want to understand the subversive effect the margin can have on the center. Well, this is an amazing example right there. Every process, every system, every tradition in human existence cannot be total. It cannot contain everything. And in a very important way, it should not attempt to contain everything. That's the Tower of Babel motif. Once more. For every complex human process, hierarchy or system, there is always something left out, a residue, a remainder, something that does not fit, something that is not consumed in terms of process, or else a margin or a fringe. In terms of space, a system can never be perfect. The fringe appears as chaotic, problematic, multiple, accidental, like the dregs at the bottom of wine, the peel, the rind. It's that extra time we need to add in, leap years for our calendar to make sense. And waste, human waste is the most immediate version of this. Ads is the whole panoply of accidents produced by the process, which is human digestion. And that is precisely what we are treated to in the first moments of this movie. A litany of potty humor and inverted behavior which could bring glee to any three year old. Washing with mud, fishing with flatulence, implications of cannibalism. And it's funny because that's what funny is. Laughter is an involuntary reaction to something which does not fit, something upside down, something unexpected. Laughter is seeing the limits of a normal process. And so the margin has a dual function. By marking the limit of something, it frames, shows its end and is therefore akin to death. But by being this limit, this end, it is also an exposition of the vulnerability and insufficiency. So the notion of wiping oneself with the page of a traditional fairy tale book is as right on as you can get if you want to show how the margin can overrun the center. And that is precisely what the movie Shrek is about. In the movie, there's this Lord Farquaat who is obsessed with order and perfection. His kingdom is excessively straight and organized. And because of that he proceeds to empty the kingdom of strangeness, to imprison anything that doesn't fit, that is not normal. Basically, all the characters are of fairy tales. Now we have set up the two extremes. Shrek wants to cover the fairy tale with waste and the anal retentive. Farquaat wants to contain the fairy tale by imprisoning it completely. But you see, Shrek was living in a swamp and not bothering anyone, doing his inverted thing on his own. It is trying to control or contain the the marginal, which will push the ogre, who was pretty content, to wallow in his mire. It will push the ogre to confront the lord. The ogre has literally lost his traditional place in the chaotic buffer zone of society. If you thought Occam's Razor did not have side effects, well, think again here. The side effects come back with a vengeance. In the case of Farquat, the desire to fully master, fully control the strange will backfire on him. And we realize that the reason why Farquaat wants to do this is to hide his own insufficiency. Farquat is impossibly short, which actually makes him on the verge of being a fairy tale character himself. When Shrek finally brings the princess to Farquaat, the Farquhat gives him the deed to his marsh. But you see, that's not how it works. There is no deed to the margin, no rule, no measurement to the chaos on the edge. By this point, it's too late. The monster will have to take it all, take the whole structure down. He will have to take the princess. It's like in the Matrix when the architect has tried to fully account for the anomaly that is Neo within the program itself. See, you can't do that. That's the point. To try to do that has sent the world into extremes with both the totalizing, self replicating Agent Smith, that is Ego from Guardians of the Galaxy, that is Lord Farquaat facing the anomaly. The thing that does not fit one extreme has to break now. This extreme duality, the duality of the Tower of Babel as reaching for absolute unity and control and so bringing about absolute fragmentation, is shown in the movie quite perfectly at the very end, when Farquhat realizes that his princess has a monstrous side. His princess has a shadow which he cannot handle. She displays the very strangeness that Farquhat wanted to control. There is always, always a serpent in the garden. And so he begins to scream, I am king. I will have order. I will have perfection. After which he is devoured by a dragon. The devouring by the dragon is then echoed in the structure by the transformation of the princess, who to our surprise, becomes not a beautiful princess, but rather becomes an ugly ogre. The periphery has won. The married couple of Shrek and Fiona leave in a garlic clove. And then we're given an image of an impossible mixture when a dragon will marry a donkey. I mean, love is love, right? And the final scene is the kicker, the now handicapped gingerbread man. Oh, sorry, gingerbread person appears. And then they say. Wait, is it? They say, or is it? They says, not sure. Anyways, it says, in the guise of Tiny Tim, God bless us everyone. And this is the everyone which is important. This everyone takes on a significance we could have never guessed in the original frame given by Dickens. Now what's important to understand is that all of this started because of the excess of control, an excess of identity. Farquhat is actually obsessed with himself, like Ego in Guardians of the Galaxy. And there are very ancient stories which describe this problem. And the most obvious is the story of the Greek tragedy the Bacchae by Euripides. In this story, King Pentheus of Thebes does not want to recognize the existence of the God Dionysus, who is his cousin. Now notice the relationship of identity. Dionysus is Pentias cousin, having been born from the God Zeus and the human simile now, right away, we should ask questions. Why is Dionysus a God and not a demigod like Achilles or Theseus? But that is part of the undecided nature of this God. He is the God of wine, the God of euphoric states, the God of the fluid state. He's the God of wild nature and presents himself as coming from the outside. That is, though he is a Greek God, he appears as a foreign God of the east. And in the drama he presents himself as an effeminate foreigner. All of these images are the image of how the margin leads us away from ourselves, away from identity. Of course, there's something euphoric about this ecstatic chaos. And so the subversive possibilities of this fluid God are intensely real. Pentheus, just like Farquhat, is guilty of a sin of pride, a sin of the right hand, we could call it. And because Pentheus refuses to acknowledge even the existence of Dionysus, to let exist something he cannot understand or control. Dionysus makes the women of the city go mad, makes them rush out into the mountain, into the wilderness and act out back an alien frenzy for this king. Pentheus actually tries to imprison Dionysus, but his bonds can never hold that which is by nature the limit of what can be contained. And then comes the move. Then the relationship of identity plays itself out. For Pentheus has the snake in his own heart. Of course, just like Farquhat, in being a borderline fairy tale character, desires the ogre princess without realizing it. In fact, it would have been to Pentius advantage to know that in the outset. But now it's too late. Pentheus pride is blinding him, and Dionysus asks Pentheus if he would like to see the Bacchae, the women out there in the mountain. I'd like that, says Pentheus. Yes, for that I'd pay in gold and pay a lot. Why is that? Dionysus asks. Why do you desire it so much? I'd be sorry to see the women drunk, comes Pentheus, dishonest reply. And his own pride has bound him to the swinging pendulum. Soon he is cross dressing and he sees two suns in the sky. The world is breaking up into multiplicity, and before he knows it, as he himself is going mad, he is being ripped apart by the mad women in the mountain, just as Farquhat was eaten by the dragon. The tyranny of the margin always proceeds from a tyranny of the center. Exactly. A pendulum swinging. One of my favorite visions of this relationship comes from Saint Maximus the Confessor, who frames this problem on the individual level by using the left and the right hand symbolism, saying, quote, the passions of the flesh may be described as belonging to the left hand, self conceit as belonging to the right hand. He speaks of the excess of virtue. Quote, Demons that combat us by the lack of virtue are those that teach us prostitution and drunkenness, greed and jealousy. The demons that combat us by excess of virtue are those that teach us presumption, vainglory and pride, who by the vices of the right secretly place in us the vices of the left. Notice how well Maximus captures this movement we see in Shrek or in the Bacchi. The first sin is always a sin of the right hand. The first sin is always a sin of pride. It is the sin of Satan, it is the sin of Adam, the sin of Cain, the sin of Babel. It is also the sin of Peter, who declares that he of all people would never deny Christ, and then proceeds to deny him three times. If the margin has won, if the margin has devoured the center, the pendulum will swing once again. And this swing the margin does not expect. For just as the center cannot fully contain the margin within its order, the proponents of the margin end up re establishing the center by devouring it. For that margin will inevitably end up taking the language of identity, of pride and of exclusion, those things that were the very weapons of the center. But such a contradiction can no more hold than its opposite. The inversion flips back on itself and the seed begins to grow. You see, there is a power in the margin, but to retain that power it must remain the margin. There is an authority of the center, but to retain that authority it must leave room for the fringe to unfold without absolute control. That is the tacit agreement made by any traditional society. But that agreement has been forgotten in the absolute categories of modernism rationality facing the absolute chaos of postmodernism. And so the pendulum is left to swing, and where it will stop, nobody knows."}
