{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":12.56,"end":14,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":14.4,"end":28.33,"speaker":"Matt Fradd","text":"Welcome to the symbolic world. Jonathan Pageau. Did I get that right?"}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":28.33,"end":29.29,"speaker":"Jonathan Pageau","text":"Yes, that's right."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":29.45,"end":37.37,"speaker":"Matt Fradd","text":"Good. That's cool. That's a cool way of saying it. Australians are really great at butchering names that should sound lovely like that, like Paggy Pagio or something."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":37.53,"end":52.62,"speaker":"Jonathan Pageau","text":"It's hard to say my name in English because we don't usually the A Jo is not an English pronunciation. Like the normal way would be to say Pa, Joe or something like that. It's just not. It's a very French way of saying a very French name. French is my first language, so."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":52.86,"end":71.5,"speaker":"Matt Fradd","text":"Okay. Yeah, that's awesome. Well, it's really lovely to meet you. I don't know how we first connected. Somebody told me I should interview you and then I looked you up and I really enjoyed the things you had to say. And I go to an Eastern Catholic church and so all that you were doing with icons I found super intriguing. So it's really nice to finally touch base."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":71.82,"end":96.99,"speaker":"Jonathan Pageau","text":"Yeah, same. I've had several people in my, let's say people following me or said, you know, Matt, Fred, what he's doing. And so I looked into what you're doing. So I was happy that you connected with me. And I thought, I think you connected with me in March and then with the pandemic and everything just kind of, we didn't follow through. And then recently someone said again, you need to contact him. And I think I remember an email by him. So I went in and I said, yeah, perfect, let's do this."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":97.15,"end":134.09,"speaker":"Matt Fradd","text":"That's right. So, I mean, it's hard for me to kind of gauge reality at this point. I'm about to move to Steubenville, Ohio, but right now I'm in Georgia and I don't know if I've just drunk the Kool Aid or what. Like any kind of lockdown, any kind of mandatory whatever just like really rubs me the wrong way. Meanwhile, my family in Australia had this six day lockdown. They weren't allowed to walk their dog. I don't see the reason anyway, so it really bothers me. And then I've seen a few things up in Canada where these police have broken into a person's house Gestapo style. And I find it super troubling. I just was interested what you thought."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":134.09,"end":152.56,"speaker":"Jonathan Pageau","text":"Yeah, it's very. I find it very troubling as well. We just have. They've started a new lockdown now, which is with 8:00pm curfew, you know, you're not allowed to walk with other people. Not allowed to. I think they said if someone is living alone, one person is allowed to go visit them or something like that."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":152.72,"end":153.76,"speaker":"Matt Fradd","text":"Friggin generous."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":153.84,"end":154.64,"speaker":"Jonathan Pageau","text":"Yeah, exactly."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":155.04,"end":180.22,"speaker":"Matt Fradd","text":"It really pisses me off, like, who the hell are these people to tell us this kind of stuff? And I think, up in Canada, how old do I look? I'm cleaning my glasses. I'm just old and curmudgeony. Everything pisses me off. Canada, you know, I've heard I've got some friends up in Canada, and they say they're kind of encouraged to snitch on their neighbors if they have large gatherings. What a great way to destroy the sort of social fabric."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":180.38,"end":268.5,"speaker":"Jonathan Pageau","text":"Well, that's what it feels like. What it feels like is a difficulty. There's a kind of materialism which is seeped in, you know, where we think that the integrity of the body is the only thing that matters, you know, and so it's in line with a kind of insipid materialism that we live with. And then there's a kind of objective sense where they feel like, because we're talking about medical, therefore there's no opinion to be had. There's no morality involved. It's just, we're gonna save lives and we're gonna do anything we can for people to stop dying. And so they feel people just accept it. And also, we've accepted the role of the state as this totalizing thing in our lives. It's something which has been seeping in. You know, after World War II, it just started to grow and grow and grow and grow. And now everybody has just accepted it. And we think that basically the state can tell us what to do. They basically manage our identities. They manage. They're allowed to tell religious groups if they can meet or not. And, you know, and they all do it for our good. And so it's a very. It's a strange situation that we've. We've kind of seeped into a authoritarian state. And people tell me it's for a good reason. And I. And maybe, I don't know, but authority and states have always said it's for a good reason. You wouldn't install authoritarianism for a bad reason. It's always, we're doing it for your good. Right. We're doing it to help you. So. Yeah, it's a frightening moment."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":269.3,"end":298.36,"speaker":"Matt Fradd","text":"Yeah, yeah, yeah. Gosh. I just saw recently these Greek Orthodox Christians were like, you know, meeting regardless of the. For epiphany, regardless of the COVID laws, which I thought was just super badass. So I was pumped about that. Yeah, there's Just part of me that's like. We've almost like totally given them this control. We've allowed it. So like it's times like this that make me look at my like conservative conspiracy theory friends. Like, tell me what you were saying again, because it's."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":298.36,"end":371.53,"speaker":"Jonathan Pageau","text":"Yeah, well, it definitely feels like there is some at least agreement among nations because they're all using the same words, they're all using the same language. You know, we've heard this build back better used by Biden and then Trudeau and then Boris in England. And so it's like everybody's using the same language. And so even though you don't necessarily need to think of a top down conspiracy, there's at least a strange agreement about what it is we're doing and the sacrifices we're willing to make in order to get there. And I think that's what no one talks about is that we have this goal and we think, they talk as if we're willing to sacrifice everything to get to this goal. And we don't want to talk about the cost in terms of everything else. Mental health, society, the cohesion of groups, even the abandonment of the elderly. In Quebec, the elderly have been completely abandoned. And we do it for them, we're doing it for their good. But we're not allowed to visit them, they're not allowed to see anybody. I know some people whose uncles parents are in an apartment and they haven't left for months and they're not allowed to even walk out on their balcony. And so it's insane."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":372.25,"end":378.45,"speaker":"Matt Fradd","text":"Did you see that? Parler just got shut down because Amazon kicked them off their servers and app. Do you know what parlor is?"}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":378.45,"end":380.49,"speaker":"Jonathan Pageau","text":"Yes. Yes. No, that's."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":380.57,"end":382.49,"speaker":"Matt Fradd","text":"Try and look it up. It doesn't exist anymore."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":382.57,"end":384.41,"speaker":"Jonathan Pageau","text":"No, it doesn't exist. It's been nuked."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":384.41,"end":385.61,"speaker":"Matt Fradd","text":"This is ridiculous."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":385.69,"end":419.75,"speaker":"Jonathan Pageau","text":"Yep. No, I tell you, there's a serious lockdown on information. And it all, it fits together. Even if it doesn't, even if it's not whether it's planned or not, it fits together because as we're at home and we encounter the world only through the Internet, then that becomes the frame for reality. And so if you're able to now control that frame, then you have a control over what reality is. And you can tell people what's happening and they have no way to know besides. Yeah, accessing reality through like I get."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":419.75,"end":437.99,"speaker":"Matt Fradd","text":"The argument when someone says these are private companies, they can do what they want. But as you say, when Twitter and Facebook and Instagram have become the town square and then you say, and you are not allowed to come. And then say, you know, it does really feel like you're canceling free speech. And it does kind of feel like a breach of the First Amendment, even though I know technically it isn't."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":438.15,"end":446.03,"speaker":"Jonathan Pageau","text":"But not only you're not allowed to come to the town square, but we're going to shut down any other town square that you tried to open. And so it's not just that."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":446.03,"end":482.51,"speaker":"Matt Fradd","text":"I know. It's like, can we go meet over here and chat? No, that's banned, too. This is insane. I, I, I'm just sort of waiting. I was talking to my wife today and I'm like, okay, I just hit 100,000 subscribers on YouTube. I'm excited. Cancel it. Like, come at me. I just, I just can't wait. Like, so here we go. Maybe this would get me kicked off. If you are a, if you are a Catholic or an Orthodox out there, go find a priest who will flout the COVID rules to bring you Eucharist if this thing gets locked down. I've already found some priests. They're like, absolutely. He's like, we're gonna print out MapQuest directions. We won't even have people use Google. We're gonna meet in a parishioner's home and you'll receive Eucharist. Bring it."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":483.47,"end":510.93,"speaker":"Jonathan Pageau","text":"Well, it seems like, I mean, I think that that's the kind of thing that's been happening just privately, I would say, and I know that some churches are being stricter in terms of the guidelines, and some are being at least secretly more permissive. And so it's hard because we're also called as Christians, to obey the rule of the state. We try to not be, to rebel against the rule for no reason."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":510.93,"end":513.73,"speaker":"Matt Fradd","text":"Of course, if the law is reasonable, we should obey it."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":515.01,"end":523.97,"speaker":"Jonathan Pageau","text":"It's a tough situation. It's a very difficult place that we are in right now, that's for sure. And it's hard to know what is the right thing, what is the racing?"}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":523.97,"end":549.45,"speaker":"Matt Fradd","text":"No, it's totally. You're exactly right. I mean, everyone with a bloody YouTube channel thinks they're an expert. Exhibit A. And I know nothing. I know nothing, except I just want to be left alone to worship God and be with my friends and family. But so I'm fully, you know, fully admitting that I don't know what I'm talking about in many respects. And I know we're all, we're all listening to people who know what they're talking about either, and then just whoever feels the most Appealing to us. We. I don't know. It's crazy. All right, I want to talk to you about icons."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":551.65,"end":575.01,"speaker":"Jonathan Pageau","text":"It's hard to talk about anything besides what's happening, and I totally. I totally understand that, because what do we. Like that's imagery has been so crazy. Like, the imagery of the. Of the Capitol takeover was so mad. Like, it was one of the maddest things that I've seen. The imagery of that shaman with, like, the horns, you know, walking through the Capitol with, like, face paint on. Feels like we're in a video game. That's what it feels like."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":575.81,"end":580.35,"speaker":"Matt Fradd","text":"Yeah, it was gross, for sure. How did. How did Canadians sort of respond to it?"}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":581.23,"end":583.39,"speaker":"Jonathan Pageau","text":"I don't know. I don't. I know how I respond."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":583.39,"end":583.99,"speaker":"Matt Fradd","text":"You don't get out."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":583.99,"end":604.56,"speaker":"Jonathan Pageau","text":"So you haven't spoken to them in months. Exactly. And I don't watch the news because I'm tired of the propaganda. So it's hard to even know. It's hard to get. Like, I can't watch CBC because I want to wretch if I try to watch CBC here. And. And it's difficult to find alternative. It's a little harder to find, let's say, alternative media in Canada than, you know, than in the U.S. yeah."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":604.56,"end":656.07,"speaker":"Matt Fradd","text":"And we'll see how long they're around for. But honestly, though, like, I was thinking this the other day. I was driving in my car, and I was listening to some political talk show, and I just thought, this is not good for me at this point. Like, I could be listening to, like, Bulgarian Orthodox chant or soothing jazz or something, but not this. Like, I know I would be healthier if I just unplugged. That's not to say that we shouldn't kind of keep abreast of these issues and have an idea of what's going on, but at some point, it's like, how much politics can I take in? And we all. We've all heard the stories of those, you know, fathers and grandmothers who have been told by the doctor, you need to stop watching Fox News. You know, whatever. So, I mean, this kind of comes to the point about talking about iconography and religious things. Like, for you, as an. As an artist, not wanting to go insane, I mean, what kind of suggestions do you have for Christians like me and others?"}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":656.23,"end":675.29,"speaker":"Jonathan Pageau","text":"Yeah, well, it's the same. I think that I have to apply my rules to myself. One of the things I've been doing now for a little while is I make sure that when I get up in the morning, I pray before I do anything. Else before I pick up my phone and before I look at my notifications, any of that, I try to pray before that."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":675.85,"end":677.21,"speaker":"Matt Fradd","text":"Can I ask you what you pray?"}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":677.85,"end":738.95,"speaker":"Jonathan Pageau","text":"I just pray the morning prayers, the Orthodox morning prayers. And then I try to do a little bit of the Jesus prayer, which these days is not super successful because we're so. We're so, like, our minds are so taken up that, you know, I find myself wandering in my thoughts while I'm doing the Jesus prayer. So hopefully that will get better. But I agree. I've had the same since Christmas. I've kind of decided to break away a little bit and not get. Not listen to too many political podcasts, not be too. And try to get the bare minimum to at least know what's happening, but not get involved in the commentary and the infighting. But then now, recently, because it's the social media world that is being affected itself, because, I mean, it's the same for you in a way. This is part of my job. It's like when the YouTube videos start to get shadow banned and there starts to be warning on your YouTube videos, then that's affecting me. So it's harder to stay neutral and to break off from that."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":739.27,"end":744.23,"speaker":"Matt Fradd","text":"See, at least you have a respectable skill like art and carving. I just yell about things I don't understand."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":744.87,"end":746.23,"speaker":"Jonathan Pageau","text":"Yeah, luckily I can fall back."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":746.23,"end":747.03,"speaker":"Matt Fradd","text":"I'm screwed."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":747.35,"end":766.23,"speaker":"Jonathan Pageau","text":"Yes, that is true. And I try, like I've been trying to also do that. I've been doing better, like get up in the morning, pray, go carve for like three hours and then after that get into emails and stuff. That way I'm not as frantic as I am when I start right away on the, on the emails and the social media stuff."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":766.23,"end":783.06,"speaker":"Matt Fradd","text":"You're such a talented guy. Because, I mean, I've been looking at your. I'm going to pull it up right now and I'm going to show people some of your carvings. It's absolutely incredible. Did you ever kind of, you know, as they say, write icons, or is it just. Has it been carving? Is that considered writing? I don't understand."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":783.86,"end":825.85,"speaker":"Jonathan Pageau","text":"Well, I kind of joke because the word to write in Greek is actually. It means to incise. And so I think that I win when I say I carve icons, that I, you know, that I just carve them. But the writing icon things is complicated. I don't like to use that term, but I just carve. I carve. I carve icons. It's kind of a marginal art, let's say, in the Orthodox tradition. But it is Legitimate. And there are icon carvings from the beginning all the way until recently. It's being revived, kind of like icon painting was revived in the mid 20th century. And so I think that right now icon carving is also being revived by a few people, myself included, and then a few carvers all over the world."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":826.97,"end":832.99,"speaker":"Matt Fradd","text":"Yeah, I'm showing folks right now what it looks like. That's amazing. I mean, when did you get into this?"}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":833.87,"end":923.07,"speaker":"Jonathan Pageau","text":"Well, when I was. I grew up Baptist, Protestant. And then when I was in college, I studied painting, but I was really struggling to join my theology, which I wanted to take seriously. And the art making it feel like it just didn't jive together. So all my art in college was about image making and the problem of image making as a Protestant and in the Western tradition. And so it just became like this weird self referential thing, which is great for postmodern art, but it's not good for your spiritual health. And so that's one of the things that kind of pushed me towards becoming Orthodox is as I discovered at first, medieval art and fell in love with the, let's say, internal language of the church, that the church had developed this beautiful sacred visual language that you could find all over Christendom, from Syria to Spain, basically. And so I discovered this and at first I was kind of sad because I thought it was gone and that it wasn't accessible anymore. But then when I discovered iconography and how it was still alive in the Orthodox Church, it was one of the things that led me to convert. And so I wanted to paint icons, which is what most people want to do. But at that time, it was in 2001, 2002, icon painters were very difficult to access. It was hard to find someone to teach you. And just happenstance, my parents cut down a tree in their yard and they said, do you want to have a go at this? And I thought, I'm going to make a blessing cross. And so that was it. And I was a catechumen at the time. And then that's kind of what started it all."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":923.15,"end":930.91,"speaker":"Matt Fradd","text":"I see I'm showing people right now these kind of crucifix medallions that you've put together as well. That's amazing. What's that made out of? It looks like stone."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":931.55,"end":960.01,"speaker":"Jonathan Pageau","text":"So a lot of. Yeah. One of the things that I'm carving is steatite. So it's kind of a kind of soapstone. Okay. It's an old tradition from the old Byzantine tradition which kind of went away when Constantinople fell. But I'm trying to revive that because we don't really have access to carving ivory so much anymore, it's very difficult. And so the steatite or the stone is a way to kind of regain a certain look of ivory and miniature and stuff. And so it's the thing I really like the carve the most. Actually."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":960.33,"end":967.61,"speaker":"Matt Fradd","text":"I'm looking at this Seed of Wisdom statue of our Blessed Mother and our Lord. That is just beautiful."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":969.61,"end":1007.09,"speaker":"Jonathan Pageau","text":"Those were someone. A few Catholic patrons have asked me to make statues. And statuary isn't usual in the Orthodox tradition. It's hard to fully know exactly why. It has something to do with iconoclasm. And it's not sure exactly why statuary didn't develop so much in the East. But so when I've had some Catholic patrons asking me to make statues and I said, I'll do it if you accept that. I tried to kind of integrate Eastern iconographic language in the statue. And so it was an interesting little game to play between the statue and the More. That's a kind of medieval, but at the same time looking more Eastern."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":1007.41,"end":1054.75,"speaker":"Matt Fradd","text":"I actually prefer it a lot more. And I've been thinking about why that is the case. You know, I've been going to a Byzantine church now for about six years, and I think it's. I don't know what it is, but, like, here's how I explain it. If somebody took a photo of a beautiful woman, say, dressed up like the Theotokos, I wouldn't want to use that in a. You know, while praying. And I think a lot of people would agree, like, well, yeah, no, like, you don't want someone who, like, looks like Jenny down the. And statues kind of have that. I mean, I know icons can look tacky if they're not well done. I think statues have a better likelihood of looking tacky. But I actually really like this of the Theotokos. It's kind of. Yeah, it is a really beautiful blend between east and West, I guess."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":1055.07,"end":1072.45,"speaker":"Jonathan Pageau","text":"And if you. They look a little bit. I tried to make them look a little bit like the Seed of Wisdom statuary that was popular in the 11th 12th century in the west as well. Tried to find. Trying to recapture the strength of the medieval Christian art in a way that is surprising at the same time."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":1073.33,"end":1084.05,"speaker":"Matt Fradd","text":"Golly, this is outstanding. I'm just clicking around and showing people what they look like. This one of our blessed Lord. What does that mean in Greek? I think it's Greek Pantokraetor."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":1084.05,"end":1087.09,"speaker":"Jonathan Pageau","text":"Is that the text? It means the ruler of all. The Lord of all."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":1087.57,"end":1088.13,"speaker":"Matt Fradd","text":"Okay."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":1088.29,"end":1095.59,"speaker":"Jonathan Pageau","text":"It's usually the image that you find in the dome of the church, for example. Right. So it's like Christ coming back at the Last Judgment."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":1096.79,"end":1105.27,"speaker":"Matt Fradd","text":"Gosh, that's beautiful. So as you had this sort of conversion, if you want, to the Orthodox Church, did you find. I mean, were you a serious Baptist as a child?"}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":1105.91,"end":1180.73,"speaker":"Jonathan Pageau","text":"Yes, I would say so. I was very involved in youth groups and, you know, I was kind of artistic. And so in my young adulthood, I wrote a lot of plays that were performed and kind of toured around Quebec, you know, kind of evangelize, big evangelical type plays. So I was quite involved. But it was really, at least starting in my early 20s, I would say it became like a crisis, really. Like a major crisis in terms of the depth of the understanding, but also the problem of art. And so that's really. It was really kind of my desire to find coherence that led me to the Orthodox Church and reading the church fathers, especially St. Gregory of Nyssa and ultimately St. Maximus the Confessor, just like that was it. Like, I found really the power of the Christian worldview, you would say. I felt like. I discovered. I felt like I had grown up in a world where scientism was the worldview and Christianity was like this weird, arbitrary revelation on top of it. Whereas in discovering the Church fathers, I discovered that there's actually the shape of the world is Christian and it's. And the scripture actually describes how the world is like, how it. How it appears to us. And so I really fell in love with that."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":1181.45,"end":1200.98,"speaker":"Matt Fradd","text":"That's beautiful. What's it been like? You know, I know you've given some lectures on the same platform as people like Brett Weinstein and Jordan Peterson. What's it like, kind of discussing the faith with people who may or may not have a sort of more of a secular mindset so they can appreciate Christianity for what it's given us, but they. They hold to a form of religion while denying its power."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":1201.14,"end":1201.58,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":1201.58,"end":1202.54,"speaker":"Matt Fradd","text":"How's that been for you?"}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":1202.54,"end":1300.43,"speaker":"Jonathan Pageau","text":"Well, it's really been a surprise, to be honest, because before I met Jordan Peterson, I was mostly talking inside, right. So I was talking about Christian symbolism to Orthodox, describing symbolism and icons and all this stuff. So for years I ran. I was editing a journal called the Orthodox Art Journal with other people. And so when Jordan kind of threw me out there, he just kind of threw me out into the public. I encountered this secular crowd, and I tried to find ways to talk about these things in a way that would be understandable to secular people. And, I mean, I've been really Surprised to see that there are a lot of people that are staying on the secular side. But I've seen thousands of people convert to Christianity because they're at the end of the nihilism, they're at the end of this kind of weird, modern, postmodern world that has been given to them, and they're at the end of scientism as well. And so I've seen a lot of people finally understand, at least, because one of the problems we've had is that people don't know what Christianity is talking about. A lot of times they think it's just a kind of. Either it's a kind of moralism or it's a kind of arbitrary thing that if you don't believe this, you go to hell, you know, that kind of nonsense. But when people start discovering that it's actually discussing about this, talking about the structure of reality and it's discussing how reality exists and how you need to engage with reality, then they're surprised and they're excited that this is still available to them."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":1300.43,"end":1316.17,"speaker":"Matt Fradd","text":"Yeah. I think that's why Jordan Peterson has been something of a gateway drug into Christianity for many people who have abandoned the faith as kids. He kind of helped it become intelligible to them in a way that they hadn't seen. Seen before. They, they didn't realize it was that sophisticated. They just, I don't know, maybe thought it had something to do with people who denied evolution or something."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":1316.97,"end":1361.8,"speaker":"Jonathan Pageau","text":"Well, that's, I mean, it's also because of the, it was kind of like the New Atheist moment, which took over in, in the popular culture, you know, and it, I don't know if it really took over in the high intellectual spheres, but it definitely took over popular culture. And so you could have a barely, you know, a somewhat intelligent, not super smart person who had all the arguments laid out of how stupid religion is and how all these contradictions in scripture, all this kind of stuff, and how it doesn't fit with science. But then it's also because they were facing a bunch of people who are trying to read science into Genesis 1. So then these two things that face each other create this weird, monstrous cultural moment where we think that that's what Christians believe. And then there are actually some Christians who do think that."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":1361.8,"end":1362.48,"speaker":"Matt Fradd","text":"Yeah, yeah."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":1362.56,"end":1380.32,"speaker":"Jonathan Pageau","text":"And so they've never encountered traditional Christianity before. These people. Yeah, like you, you, you meet a, like a kind of debunker and they talk about what most Christians believe. And what they mean by most Christians isn't most Christians. No, I know it's like Bible belt, like this very narrow strip of."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":1380.72,"end":1400.72,"speaker":"Matt Fradd","text":"And I find. I find the most. The most. I mean, I know there are a lot of very rational, fantastic atheists. I get it. But I think the most kind of angry ones tend to be people who kind of grew up in a fundamentalist home. You know, they talk about how they grew up Christian, and you're like, ugh, that doesn't. The kind of Christianity you're describing that you grew up with doesn't actually sound like something I would get on board with either."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":1400.96,"end":1409.32,"speaker":"Jonathan Pageau","text":"Yeah. And I mean, most. The biggest Christian group is Catholic in the world. It's not this fundamentalist group and Catholicism."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":1409.32,"end":1423.85,"speaker":"Matt Fradd","text":"And then we have our own baggage, right, with the craziness going on with all this talk of pedophilia and something the Pope said about something that he may have been taken. I mean, so we have our own way of making Christianity as a whole look suspect."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":1424.01,"end":1449.11,"speaker":"Jonathan Pageau","text":"Yeah, for sure. I mean, but that's. There's a difference between. There's a difference between, let's say, the worldview and the doctrinal positions, which are something. And then there are the kind of hypocrisy that you find in any group, any world, and the kind of the traitors that we find within the hierarchical structure. You know, and so I think that it's important to be able to differentiate that because totally, you know, it just."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":1449.11,"end":1461.87,"speaker":"Matt Fradd","text":"Gives people an easy way to dismiss you. Like, if I want to dismiss you and then I find out you're. You have hypocrites in the ranks. Easy done. I take the moral high ground. I look super great. I get to point to your immorality while you've been trying to tell me to be moral."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":1461.87,"end":1493.77,"speaker":"Jonathan Pageau","text":"You know, and it's also. It's easy because. Because Catholicism is such a hierarchical structure, you can point to anybody, let's say anybody who has any authority in the. In the Catholic Church and say that's Catholic. And you can kind of incriminate the entire. This entire. One of the biggest institutions in the history of the world, probably the biggest. And incriminate the entire institution because of the fact that in that massive billion people institution, there are some people who are using it to their own perverse advantage."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":1494.33,"end":1561.98,"speaker":"Matt Fradd","text":"Yeah. I've often said, you know, if you're looking for a perfect church, as soon as you join it, it won't be like, suppose you were to have found it, you join it. Have you met you. You're disgusting. It'll be awful. You know, it's like, it's. Yeah, it's a lot easier, I guess, if you've got a small church down the road with 10 people to try to keep you all together. But when you've got a billion plus, you're going to find hypocrites for sure. So one of the things I've done in my work in the past is I've written on the topic of pornography and I've just found it really interesting because it's definitely in my history. It's something I'm tempted to from time to time. It's something I hate. But I see the appeal of it. I see how it's kind of dragging people into hell and into just a kind of boring, monotonous existence that they don't want to be in, but they feel they have no choice to be in. And I just wanted to chat with you about that because I've had this idea which isn't terribly insightful, but I think it is accurate that pornography is like the anti icon. So if the icon sort of, kind of brings us into this larger reality, pornography does the opposite. It suppresses the personhood of the performer and sort of hollows her out, or him out, as it were, and leaves us with less than what's there."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":1562.7,"end":1690.23,"speaker":"Jonathan Pageau","text":"Yeah, for sure. I think there's a very good. It's very interesting to differentiate, let's say, the idea of the icon and the pornographic image. Because the pornographic image is probably one of the closest places where we could find idolatry today in terms of understanding what ancient idols were actually were, which is that you create an image or you create a statue or an image, and then that statue becomes a vehicle, right? It becomes a kind of vehicle for some demon, like some spirit. And then your encounter with that spirit is going to bring you something, right? And pornography plays exactly that role. Like if you don't believe in incubi and succubi, like you're an idiot. Because that's exactly what pornography is doing. You're not encountering the person, right? Like you said, they become hollowed out shells and they become vehicles for your passion and then ultimately vehicles for these, you know, let's say the way in which your passion, that mode of being, links together with others is through a kind of principality which is driving this whole thing. Right? Because your passion isn't driving the industry of pornography, but all the passions of people brought together and kind of as this strange entity is what's driving this thing. And so the pornographic image becomes a place where that manifests itself and it leads to a form of ecstasy. Just like an idolat. Like an idol would. It can give you something. Like it gives you some momentary power or momentary ecstasy. But then, like you said, because it is ultimately an idol and it's not connected to God like an icon. Like an icon of. Like, when you meet a saint or you meet a holy person, that person is actually revealing Christ to you in the opposite way. Then pornography is breaking you away from what the true purpose of sexuality is, what the true purpose of love and relationship is. And so it really is, like you said, a kind of anti. Iconic."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":1690.86,"end":1696.3,"speaker":"Matt Fradd","text":"Yeah, I mean, if we think of, like an icon as. How would you define icon? Just as well."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":1696.3,"end":1754.44,"speaker":"Jonathan Pageau","text":"The word icon just means sacred image. Like, it's. The word icon just means image. But it's usually shorthand for holy icon, which is that you have a sacred image and a sacred image. What it does is it reminds us, first of all that God gave us, renewed the image that he had placed in us, like, renewed the image of Himself that He had put in Adam. He renewed it in Christ. And so the image of Christ participates in the way that God reveals himself to us. And then the images of the saints, they also remind us and they help us participate in the fact that we're all together in this church. We're all together in this body, this cosmic body, which is moving towards the eschaton. And so that's what icons do. So when you look at an icon of a saint, it's presencing the saint to you, but behind that, it's also presencing Christ to you. Just like when you meet a person."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":1754.76,"end":1793.23,"speaker":"Matt Fradd","text":"Right. And that's kind of what I wanted to get to. You know, I'm not sure if you've heard of Anthony Esselin or not, but he's an excellent thinker. He has this quote of his. He says, we sense that the human body is a precious thing worthy of our reverence. It is not a tool, not an object of consumption, like a steak or a keg of beer, not an animate provider of pleasure. It is the outward expression of a profound mystery, that of another human being. And that's the evil of pornography right there. It. Yeah, we. It's almost like it does what death does in an analogous way. It separates body and soul and says, I just want this."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":1794.19,"end":1861.3,"speaker":"Jonathan Pageau","text":"No, you're exactly right. It really does. It is a cleaving. It's like a cleaving of the person. And especially because we already get a little bit of that just in the technological image itself. Like, it's a dangerous game. We play with these screens, it's already a danger. But when. When that. Let's say, when that danger gets brought to the extreme through this kind of explicit sexual act and also the kind of raw. How can I say this? The. The nudity of shame, you could say, you know, where you. You have the permission to look at something which is meant to be secret and meant to be holy. Like, it's a desacralization of something which is meant to be. To be holy. And so all of that brought together is exactly what you said. It turns the body into pure meat, pure object of desire. And it's not even the body. It's like an image. It's like this deincarnated image. It's almost like this. Like I said, it almost is like a subtle body in the very traditional sense which manifests itself to you of these kind of demonic forces."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":1861.62,"end":1944.11,"speaker":"Matt Fradd","text":"Oh, yeah. Well, let me just kind of unspool here a little bit about my opinion on the difference between pornography and naked art. And then I would love you as an artist to kind of help me kind of flesh this out a little bit. Right. Because, you know, the word pornography entered the English language in the mid 19th century, comes from two Greek words which means the writing or drawing of the prostitutes. And it's clear that the kind of creators, the producers of pornography mean for their product to interact with the consumer in the way that a prostitute would. So pornography is always meant to be a substitute for a prostitute. You know, I was just thinking, like, in this crazy lockdown time that we're in, if you were a prostitute and had to work online, what would that look like? Well, it would be pornography because I think one of the primary, maybe the only notable difference between pornography and prostitution is that there is a camera in the room. But with naked art, it's something altogether different. You know, you don't find people sort of being tempted to masturbate in the Sistine Chapel. You don't find them going to some beautiful art museum and finding that temptation. And yet you see the body in all of its beauty, the breasts and the genitals, and this is all lovely. And it seems like though you're being drawn into an interior world, there's something going on. There is a complexity, an interiority to the person."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":1946.35,"end":1965.71,"speaker":"Jonathan Pageau","text":"I mean, I don't. I tend to be not on. I'm not on the. On this, let's say. I don't mind the fact that nudity exists in art, but it's definitely, to me, like, when nudity started to Reintegrate art, let's say, in the. During the Renaissance and later, it seemed to me like it was a strange pagan move."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":1965.87,"end":1966.51,"speaker":"Matt Fradd","text":"Oh, really?"}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":1967.15,"end":2042.95,"speaker":"Jonathan Pageau","text":"Because if you read the early councils when they. They accepted images in the church, and when you read how the Church Fathers talk about. One of the reasons why icons look the way they do is because Roman art was erotic. Roman art was extremely erotic. And so what the Christians did is they took the Roman forms and they. If you look at the figures, they're using Roman tropes. Everything about iconography is based on Roman tropes. You know, the fold, the clothing, the poses, even the contrapposto. All of this comes from Roman statuary and Roman painting, but it was de. Eroticized. And so all the figures are covered and then the contrapposto is adjusted slightly so that it's not as sensual. So all of it, there's like a. And you can read. I think it was even St. Basil. I'm not sure. Don't quote me on that. Sure. But one of the fathers talked about how the images that are represented in the Church have to be. Not to attract attention to your desires like they need to be. They need to have a sobriety to them so that you're not tempted by them. And so I do think that because like in the Sistine Chapel, even the Sistine Chapel now they've been restored, but it didn't take long for the nuns to paint things. Vines over the. Over the genitals, which were removed. Now they've been removed by John Paul."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2042.95,"end":2069.83,"speaker":"Matt Fradd","text":"Ii, which I thought was. That's cool that we disagree on this, because I think that. I think. I disagree with you on that. I think that. I mean, whatever we might say of Christian tradition and the Fathers and their opinions, I mean, the argument that one would make would be that the body can be portrayed in a way that is decent and good or not. And so would your argument be that you actually can't portray the body through drawing or painting in a way that."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2071.35,"end":2133.96,"speaker":"Jonathan Pageau","text":"I think that the best way that I would understand that is mostly that the body or the naked body is. Has two aspects to it. There are two nakednesses, you could say, and those are related to the story in Genesis. Like, one is the nudity in the garden, and it's the nudity in the secret place where you're in communion with God. And then at the fall, that nudity gets turned into the nudity of shame. And in the outside of the garden, then you cover yourself. And so I think that that duality remains and so I think there is, of course, like you said, absolute dignity and beauty and power to the human body. But there's something of the altar in that power. There's something of the sacredness of the body which needs to be preserved and hidden for the moment of the bride and the groom, like for the encounter of the bride and the groom in the hidden chamber. So that's kind of more the way that I understand it."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2133.96,"end":2139.84,"speaker":"Matt Fradd","text":"So your idea would be that since the time of the fall, it is no longer appropriate to depict the body naked?"}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2140.56,"end":2221.54,"speaker":"Jonathan Pageau","text":"Well, I would say that it's hard to depict it naked without the shame. And so that's why Christ was represented not fully naked on the cross, but let's say as naked as possible. And it was somewhat scandalous. Even when Christ started to appear that way on the cross. Christ was represented fully clothed until, like the early. Let's say, I didn't even know what the first time. I think it was in the 9th century, around the time of Charlemagne, that Christ started to appear as naked on the cross or as almost naked. And I think that it was meant to represent the nakedness of shame. It was meant to the nakedness, or in a way you could say joining the nakedness of shame with the nakedness in the garden in a very strange, very surprising way, the way Christ unites opposites and extremes together. But that was one of the only places where the body was shown was when Christ was dead on the cross. And I would say that it's mostly that it has to do with the secret. It has to do with a mystical reality which is still kept. You could say something like, I imagine that in paradise we'll all be naked, right? Like in the kingdom, maybe, or clothed in glory. The way that we won't be wearing Nike. We won't be wearing Nike, that's for sure. Or clothing glory. The way that the fathers talk about the nakedness of the garden. Something like that."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2221.94,"end":2225.62,"speaker":"Matt Fradd","text":"What's your opinion on those beautiful breastfeeding Madonna icons?"}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2226.66,"end":2236.03,"speaker":"Jonathan Pageau","text":"I don't know. I think that they start out okay, and then they get more and more disturbing, you know?"}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2236.03,"end":2239.95,"speaker":"Matt Fradd","text":"And by disturbing, do you mean sensual, like leading to sexual?"}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2240.19,"end":2252.51,"speaker":"Jonathan Pageau","text":"Definitely. I think that in the Baroque period there is a. There's a. There's a kind of sensuality. Like you look at a Rubens painting and it's just. It's just all. It's very sensual. I mean, the body."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2252.67,"end":2254.95,"speaker":"Matt Fradd","text":"What's that? What's he. What's that called? Sorry, I want to look it up."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2254.95,"end":2256.51,"speaker":"Jonathan Pageau","text":"Rubens. So r. U B?"}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2256.75,"end":2261.24,"speaker":"Matt Fradd","text":"I shouldn't look it up, I guess. Rubens. What would I type? Painting."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2261.4,"end":2262.92,"speaker":"Jonathan Pageau","text":"Yeah, Rubens painting."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2264.44,"end":2363.61,"speaker":"Matt Fradd","text":"Yeah. Okay. Yeah. No, I see what you mean. How they become more sensual. Well, let's. I don't want to put a pin in that. I do want to keep fleshing that out, but just kind of back up a little bit. You know, I suppose when we talk about, you know, pornography, you know, you could talk about it from different angles. Right. Like, there's the one who produces the pornography, there is the one who, quote, unquote, performs in the pornography. Then you have the consumer. Right. And I suppose, in fact, I would say it's. It is the case that one can look at pornography and not sin because, you know, we have these sort of police officers who have to say, look at images of child pornography in order to identify victims and catch these people. Or you might have a mother, say, who accidentally stumbles upon what a child has been seeing and scrolls through to understand it. You know, I would say that this, because of the intention of the viewer watching pornography, while it may always be harmful to some degree, one isn't always culpable for it. Yeah, but. But I. And I suppose it's possible that someone could look, as you say, upon these Ruben paintings, or even the icon of the breastfeeding Madonna, and feel lust and have their sexual. Their sort of lower passion stirred up. But I've always thought, I guess that, you know, especially in regards to, say, the icon or even the Sistine Chapel, that the problem wasn't with the art, it wasn't with depicting the body, which is good. It's always been with the person that there's a problem in the heart. If I am to look upon something holy like the breastfeeding Madonna icon and feel lust. So that's not a problem with the depiction, it's the problems with me."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2363.61,"end":2375.76,"speaker":"Jonathan Pageau","text":"But no, I think you're onto the. You're right in an absolute sense. But I still nonetheless think that it's a dangerous. It's a dangerous."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2375.84,"end":2400.75,"speaker":"Matt Fradd","text":"I think I see what you mean, because at the very least, like, let's say one says you can depict the body in a responsible way, which I'm not. It sounds like you're leaning towards, not necessarily after the. After the garden. Right. But. But even if that were the case, there's the temptation of, like, leading people into sin because there are people who are seriously perverted. And so maybe. Maybe that's an argument for why you shouldn't just be having these."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2401.87,"end":2425.63,"speaker":"Jonathan Pageau","text":"These naked images in churches. I mean, I am definitely a traditional iconographer, so I don't advocate for the naked people in churches. But if you look at, for example, the way that nakedness is portrayed, like, I was trying. As we were talking, I was trying to think of other scenes where the saints are represented naked. And it does. It does happen. And it's usually ascetics. Like, ascetics are sometimes represented naked."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2426,"end":2426.88,"speaker":"Matt Fradd","text":"Mary of Egypt."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2427.04,"end":2432.56,"speaker":"Jonathan Pageau","text":"Yes. Saint Mary of Egypt is sometimes represented naked in a way where she's almost a skeleton."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2432.56,"end":2432.92,"speaker":"Matt Fradd","text":"Yeah."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2432.92,"end":2470.59,"speaker":"Jonathan Pageau","text":"Like, she's a barely. She barely has any flesh on her. And so there is a way in which the nakedness of the aesthetic is also this weird place where scandal and glory come together. You know, like, you can imagine when St. Francis of Assisi would disrobe or ask his Franciscans to disrobe before in public. Like, it wasn't. It was obviously not to entice their. Entice other people's sexual desire, but it was rather for the person to kind of descend into that shame of nakedness in a way that would liberate them from the. Liberate them from that shame in a way."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2470.59,"end":2473.15,"speaker":"Matt Fradd","text":"Yeah. I don't know of that particular story. Oh."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2473.15,"end":2474.43,"speaker":"Jonathan Pageau","text":"That St. Francis would disrupt."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2474.83,"end":2483.71,"speaker":"Matt Fradd","text":"I've heard stories of, you know, maybe Francis rolling in the snow or these sorts of things to avoid temptation. But is it the case that Francis asked some of his brothers to actually strip naked?"}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2484.16,"end":2494.48,"speaker":"Jonathan Pageau","text":"Yeah. Well, Francis himself did it. And so Francis. When Francis kind of. He started giving his father's money to build a church, and then they brought."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2496.08,"end":2498,"speaker":"Matt Fradd","text":"From now on, our Father who art in heaven."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2498,"end":2507.28,"speaker":"Jonathan Pageau","text":"Right. And so he took his disrobe, then he gave his cloak to his father, to the priest that was there. But then he also asked some of his brothers to do the same at some points."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2507.28,"end":2510.4,"speaker":"Matt Fradd","text":"And this probably doesn't mean undergarments. Right. Though I'm sure he's not like."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2511.12,"end":2511.6,"speaker":"Jonathan Pageau","text":"I don't know."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2512.24,"end":2517.2,"speaker":"Matt Fradd","text":"Cause if that were the case, I mean, far be it for me to criticize a saint, but I'd be like, that doesn't seem cool, Francis."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2517.2,"end":2517.6,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2517.68,"end":2519.68,"speaker":"Matt Fradd","text":"But I guess I can see."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2520.08,"end":2539.92,"speaker":"Jonathan Pageau","text":"Well, the holy fools are capable of engaging in this kind of scandalous behavior, but they take the consequences for it. But it's also. It is this weird moment, like I said, where this strange moment where the nakedness of Christ on the cross is both the nakedness of scandal and the return to the garden at the same time."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2541.13,"end":2569.31,"speaker":"Matt Fradd","text":"So I just really want to understand your argument. So forgive me for going back to this. So is your argument. And maybe you haven't fully thought this through, so I'm not pressing you on it or anything, but it seems to be like prior to the fall, one could look upon another body and see it in all of its glory and splendor and without wanting to use the body. But since the time of we've left the garden, that's no longer possible. And so we shouldn't depict nudity in art?"}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2570.27,"end":2576.59,"speaker":"Jonathan Pageau","text":"Well, I don't think we should depict it in a sensual manner. At least not. At least not in the church art. At least not in church."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2576.59,"end":2599.39,"speaker":"Matt Fradd","text":"No, I agree, but then, but I wouldn't consider, like, I wouldn't consider the nudity in the Sistine Chapel to be sensual in any sense. Like I agree that those Ruben paintings were sensual from what I saw. So would you say though that you can depict nudity in a non sensual way that would be appropriate or are you kind of skeptical of that?"}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2599.39,"end":2608.15,"speaker":"Jonathan Pageau","text":"I mean, I think people have done it with Christ on the cross forever. And so, I mean, without necessarily showing Christ genitalia, that Christ is basically."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2608.15,"end":2618.51,"speaker":"Matt Fradd","text":"But I would be open to that. I would be open to a beautiful icon displaying Christ genitalia. And I would see, I would, until this conversation would have thought that would have been appropriate or could be appropriate."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2619.07,"end":2633.18,"speaker":"Jonathan Pageau","text":"I don't know. I think that, I'm not sure I get the sense that that one might be disclosing the secret in a way that might not be appropriate in the public. I would say it that way because."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2633.18,"end":2635.78,"speaker":"Matt Fradd","text":"He was crucified naked by all accounts. Right."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2635.94,"end":2638.66,"speaker":"Jonathan Pageau","text":"I think that's probably. He probably was completely naked."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2639.14,"end":2647.06,"speaker":"Matt Fradd","text":"Yeah. Yeah. This is really fascinating. Feel free to expand on this if I'm not giving you enough time to flesh out your thoughts."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2647.54,"end":2715.42,"speaker":"Jonathan Pageau","text":"But that's what I think. I think that if you look at the story of art, you'll notice that when the. From the Roman period to the Christian period, there was a transformation in the way that the body was represented. And you can see that there's a use of all the Roman tropes, but transformed into a more sober vision of the human person which focuses on the face, especially this encounter with the person. Right. Because you encounter someone in their eyes and their face and their expression. And so you can see that that's where the art, towards what the art went. And. And then during the Renaissance, which, I mean, this could be a big argument to have, but I think the Renaissance is a return to paganism, at least for a little moment. During the Renaissance, then there's this return to nakedness in art. And also A return to a lot of the pagan subjects, Right. If you look at the way that Michelangelo represents God, it's basically Zeus, right? I mean, who is this figure? Who is this bearded guy? I'm not sure who. Who is this bearded guy that's touching Adam? Is it Christ? Like, who is it? Is it God?"}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2715.42,"end":2716.3,"speaker":"Matt Fradd","text":"It's God the Father."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2716.54,"end":2725.5,"speaker":"Jonathan Pageau","text":"It's the Father, right? Yeah. So until then, like, until the 14th century, God the Father was never represented in art."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2725.5,"end":2726.14,"speaker":"Matt Fradd","text":"Interesting."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2727.18,"end":2735.66,"speaker":"Jonathan Pageau","text":"You know, it's funny, so, like, very, very freak events, but it's like during all the Middle Ages, the Father was never represented because you don't represent God."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2735.66,"end":2775.95,"speaker":"Matt Fradd","text":"Well, that's interesting. You know, what's interesting is I heard Dr. William Lang Craig, who I'm sure you're familiar with, he was asked a question about iconography, you know, and I've got my standard responses right, to Protestants who tell me I'm not allowed to kind of depict things in heaven and earth. And it was interesting because he said that. He gave one of the responses I've given, right? And he said, well, you know, the second person of the Blessed Trinity, in becoming man, made an icon of himself. And so he can see an argument for that. But he, He. He holds to what you just said, that you shouldn't be making an icon of God the Father. But that's interesting, because I'm in trouble if that is true, right? Because I belong to a tradition which does often depict God in that way."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2776.03,"end":2821.83,"speaker":"Jonathan Pageau","text":"Yeah, well, less and less. And even in the orthodox tradition, if you look at Starting in the 15th, 16th century, there starts to be images of God the Father that are represented. At first, they kind of try to fudge it by representing. They call him the Ancient of Days. And so they show the Ancient of Days and then the. In the vision of Daniel, where he gives his power to the Son of Man. And so they represent, like, Christ with white hair, and then also Christ as a child on his lap. So they try to fudge it, but then that figure of the Ancient of Days finally becomes God the Father, and they start representing God the Father in iconography. But now modern iconographers, I know almost no modern iconographer that represents God the Father. I could probably not even count them on one hand."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2822.07,"end":2824.23,"speaker":"Matt Fradd","text":"And what would you say the argument for that is?"}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2824.71,"end":2874.01,"speaker":"Jonathan Pageau","text":"The argument is for what you shouldn't do. Respect the second commandment in the sense we respect the notion that you cannot represent God but through Christ, because Christ is the image that God gave to us. And so we can see God in Christ, but we cannot see God directly outside of the Logos. You can't see God the Father. Like every theophany in the Old Testament is the Logos. Like, you even have this idea, for example, that when God says, I am the One, that is, it's Christ. That's why in the halo of Christ, orthodox people would often write the one that is. Right. So the one who is is basically saying, you know that vision that Moses had? That's what he saw. He saw Christ. He saw the divine Logos."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2875.29,"end":2880.17,"speaker":"Matt Fradd","text":"Huh. I'd have to think more about that. What about when Moses sees the back of God? Are you saying that's Christ too?"}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2880.73,"end":2882.57,"speaker":"Jonathan Pageau","text":"I mean, I would say he hasn't."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2882.57,"end":2885.85,"speaker":"Matt Fradd","text":"Become incarnate at this point. So why does it matter? Why do you have to say it's the sun?"}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2886.65,"end":2909.83,"speaker":"Jonathan Pageau","text":"Well, because the sun is the principle of manifestation of the Trinity. Right. The Son is that by which all things are made, but it's ultimately also that by which all things appear. Right. All the qualities, all the names, all come through the sun. And so all categories of existence are manifested through the sun."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2911.03,"end":2915.43,"speaker":"Matt Fradd","text":"What does that mean, all categories of existence? What does that mean?"}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2915.59,"end":2920.87,"speaker":"Jonathan Pageau","text":"That means that everything that exists is revealed or manifested through the sun."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2921.19,"end":2926.63,"speaker":"Matt Fradd","text":"Okay, I don't know what that means, manifested, because I'm thinking of John 1, where it says nothing came to be except through him."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2926.9,"end":2927.22,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2927.22,"end":2927.9,"speaker":"Matt Fradd","text":"But what does that mean?"}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2927.9,"end":2944.98,"speaker":"Jonathan Pageau","text":"That's a good word that. By him, by. By. So God created the world through the divine Logos. So the, the Logos or the. The Word is the means by which God reveals himself into creation. Does that make sense?"}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2944.98,"end":2948.18,"speaker":"Matt Fradd","text":"Yeah, I think so. Say it again."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2949.7,"end":2956.16,"speaker":"Jonathan Pageau","text":"So, so, so the end. So let's use. Let's use secular terms. So the infinite episode of the office."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2956.24,"end":2959.76,"speaker":"Matt Fradd","text":"Where Michael Scott says, explain this to me like I'm five. That's kind of what I'm."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":2960.08,"end":3044.19,"speaker":"Jonathan Pageau","text":"The unbounded infinite that is beyond all category, totally beyond all name and all comprehension. Yep, all comprehension manifests himself through a concentrating point, a sun like his that he engenders and that son. And I'm not in secular talk anymore. I said, I'm going to stay in secular talk. And then, so then that's how. So it's like this. You can imagine the infinite and then through the Logos and the world starts to manifest the categories. So the difference between Christianity and any other religion, because that idea is there in a lot of other traditions, but the difference is that we say that the Logos is co. Eternal with the Father, that we don't think that the divine Logos is Created. We think that the divine Logos is uncreated and therefore the world creation is called to participate in God because the way by which it's made is not lower than God. It's not like a lower stage than God. So when God speaks, it's him, and through his speech, then all things appear. So this idea, for example, like, so Christians could never have this idea that creation is bad. Could never have this idea that creation in itself is fallen. Because the means by which God creates is God."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":3044.27,"end":3046.27,"speaker":"Matt Fradd","text":"Including the naked body."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":3046.59,"end":3052.83,"speaker":"Jonathan Pageau","text":"Including the naked body. In a hierarchy. In a hierarchy of being."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":3052.99,"end":3067.3,"speaker":"Matt Fradd","text":"Yeah, yeah, no, I wasn't trying to be a smart ass. I was just saying, like, that's true, right? I mean, you do have, like strands of Christians that, you know, speak of the body or speak of sex or speak of sexual desire in an anti body way."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":3068.58,"end":3094.4,"speaker":"Jonathan Pageau","text":"Well, for sure, there is a strand of Gnosticism which is just always there in Christianity. This idea that the world is fallen in itself, that, like you said, the body is evil in itself or that sexuality is evil in itself. Whereas the traditional way of understanding and the right way of understanding is that, that all things ultimately point to God if they're in their proper place. It's just about things being in the right place."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":3094.64,"end":3102.24,"speaker":"Matt Fradd","text":"Yes. Yeah. Okay. Beautiful man. All right, thank you. I'm gonna have to. Have to listen to my own podcast and think that through again. That was really cool. I appreciate you."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":3103.04,"end":3106.8,"speaker":"Jonathan Pageau","text":"How do we get. We started with pornography and got to like talking about that."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":3106.8,"end":3134.49,"speaker":"Matt Fradd","text":"Well, that's a much. That's the way. That's the way you want to go. You don't want to start from how to go to pornography. Hey, I've heard some people say that icons can be therapeutic. Not just therapeutic, but kind of healing. They can kind of heal the wound that pornography has created. I don't know how I feel about that. Obviously, I think it's a beautiful thing to stare upon icons, but what would you say to that? Someone who says, you know, I was looking at pornography, it really messed me up. And so to help heal me of that, I just started sitting before icons."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":3135.13,"end":3142.41,"speaker":"Jonathan Pageau","text":"I mean, I think it's possible I would say, thank God if that's the case. You know, I don't. I wouldn't see it as a formula. Like, I."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":3143.05,"end":3153.67,"speaker":"Matt Fradd","text":"Nor would I. That's what I'm having trouble. That's what I'm having trouble with. Because it sounds really pious, but I'm like, I don't see how that could, like, just do this and then this will happen. I Think that's true? I don't think there's any silver bullet at all, you know?"}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":3153.67,"end":3155.51,"speaker":"Jonathan Pageau","text":"No, exactly. It's like confession."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":3155.67,"end":3156.15,"speaker":"Matt Fradd","text":"Yeah."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":3156.23,"end":3163.67,"speaker":"Jonathan Pageau","text":"Fight and pray, fall and get back and pray and confess and. I mean, what else? Like, that's life, you know, that's just how it works."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":3164.15,"end":3169.43,"speaker":"Matt Fradd","text":"Yeah. Cool. All right. What else should we talk about?"}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":3170.47,"end":3181.92,"speaker":"Jonathan Pageau","text":"I don't know. What do you want to talk about? I mean, tell me a little bit, because I know a little bit about, you know, who are you talking to? Like, who are the people that. Who do you feel is your audience when you're talking to people?"}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":3182.72,"end":3214.23,"speaker":"Matt Fradd","text":"Who is. I guess I think that Catholicism is true, and I want to help people understand the Catholic faith through a sort of Thomistic lens. I did my undergrad and master's in philosophy, and a lot of it was Thomistic philosophy. I love Thomas Aquinas, and very often on our show, we'll kind of like, take a text from the Summa or some other commentary of his and just sort of look at it. He's a very clear thinker. He writes almost syllogistically. You know, he steel. Mans. I'm not sure if you've heard of that term, have you?"}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":3214.23,"end":3214.95,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah, yeah."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":3214.95,"end":3300.26,"speaker":"Matt Fradd","text":"He still mans his opponent's arguments. And so it's just always interesting, you know, like in the Summa, he'll present arguments. I know you know this, but for those who don't, he'll present arguments against the position he wants to make, and then he'll make his position, then respond to those arguments. But then there are other works of his. I have one over on my shelf here. It's called de Marlowe on Evil, where he'll present up to, like, 20 arguments against the position he wants to make and then respond to those. And not in a way that you feel like he's straw manning the position. I just find that really intellectually honest. And I know. I'm sure I fail at it, but it's something I try to do as I consider opposing, opposing ideas, you know? So, yeah, I guess that's who I speak to more and more. We have orthodox Christians who are viewing the channel, but I say probably a lot of Protestants and a lot of confused Catholics, right, who are just. We're all going through. I'm sure this is true in the Orthodox Church. Churches, too, Right. We're all going through this turbulent time. It feels like there's this division, you know, not just in politics, but in religions, right, where you've got the people who are identifying as the traditionalists and then the soy boys, it's probably not what they identify as, but, like, it's like it feels like this is splitting apart every kind of group. And I think there's just a lot of, kind of confusion and this desire to find something to anchor themselves to, and that is Jesus Christ and the Scriptures and the patristics and the liturgy, you know, but, yeah, yeah, I think that."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":3300.26,"end":3336.42,"speaker":"Jonathan Pageau","text":"I mean, I think it's wonderful because you're right. There is such a. I think there's such a chaos. Like, we're definitely going through a period of intense chaos of strange, upside down things, you know, happening, and it's infecting the church and it's everywhere. You know, it's for sure, I would say, in the Orthodox Church because it's so slow, it's not as prevalent, but it's coming. And you can see it coming. And you can see all the kind of the same type of conflict that you find in the Western Christianity are starting to kind of come into the Orthodox tradition."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":3337.22,"end":3381.19,"speaker":"Matt Fradd","text":"One question I had for you is, and I know you're a Baptist who became Orthodox, is sometimes I see a lot of vitriol online from Orthodox people towards Catholics. And I don't know if it's like the. The kind of Big Brother syndrome where you just hate whatever's bigger than you and it's kind of like why New Zealand hates Australia. But we're like, they're cute, they're fine, we love them. You know, I don't know if there's that thing going on or. But I suspect there's a lot of Protestant converts who may have had an anti Catholic sort of bias and brought that into Orthodoxy. I'm not saying there aren't things to critique in Catholicism. And if you're Orthodox, you're right to kind of reject what you believe to be false. You know, I'm not saying that makes you anti Catholic or anything like that, but. Yeah, I'm just wondering how that's changing the kind of landscape of Orthodoxy in North America or if you've noticed that."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":3381.91,"end":3537.58,"speaker":"Jonathan Pageau","text":"I think, I mean, I think that the, let's say the hostility towards Catholicism that you find in Orthodoxy has a long story. And because, like. And so, because Orthodox are also very slow, slow moving. You know, it's like you talk to Orthodox people like they're still living in the fourth century. Like, to them, the arguments that were happening in the 4th century are still live right now. And so because of that, there really is this sense that the Crusades happened not that long ago. And, you know, and not just the Crusades, but then also the Holy Roman Empire and the, you know, the kind of taking over of certain Orthodox lands in the modern times. So all of that is very prevalent in the way people thinking, because Eastern Europe is that place where the two political aspects of Christianity just kind of constantly were in battle. And so you have countries that were Orthodox before they became Catholic and then some that had this weird, you know, and then there's the kind of, like you said, Eastern Catholics that are kind of in between, but they're not on one side and not on the other. And so because of that, I think that's why you get the hostility. But, you know, I myself, I don't. I'm not interested in that stuff. I'm just. I don't find it interesting because I feel like the. The world is falling apart, to be honest. So much is happening that I think we can recognize the differences. We have, acknowledge the differences, but then also understand that on most fronts, we are on the same side. On most fronts of what's going on in the world, we're on the same side. And there's also a strange thing which is happening, which is that you start to notice, for example, that the. Let's say, the line. The battle lines, or the cultural lines are going across different Christian groups. And so you end up having people who are serious about their faith and take it seriously in their life and in the way they view the world and want to use their faith as a lens for how they perceive reality. And you see that across all different denominations. And then you have people in all the same denominations who desperately want to be accepted by the world, who desperately want to be progressive and to kind of change the way that Christians understand things in order to adapt to the modern world. And then you see those also all across the denominations. So sometimes you end up. Sometimes I end up feeling more sympathy with a Catholic or a Baptist or even a Pentecostal, who takes scripture seriously, who takes Christ seriously than another Orthodox who just wants to be accepted by the UN or whatever, who just wants to be loved by the. You know, by the popular thinking."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":3537.58,"end":3606.64,"speaker":"Matt Fradd","text":"So, yeah, that's. That's interesting. And, you know, in. In Catholicism right now, because we had this big reform, right, of the liturgy after the Second Vatican Council, and now there's this, like, desire to return to our tradition, which I'm all in favor of. And I wonder if there's, like, an awkwardness in that. You know, like, tradition is meant to be this thing that's passed on that's almost second nature. It's kind of weird when you have to, like, grab and artificially impose upon yourself and your way of life a tradition that wasn't yours. And maybe that's just what we have to do until it becomes second nature again. But I think that's one of the most things Catholics love about our Orthodox brothers and sisters is they never had that same sort of. That same sort of. Yeah, change in the liturgy. You guys have your tradition, and that really feels stable. I mean, this has been the line I keep saying, like, in a time of chaos, you stick, you seek stability. If there's a storm outside, you go to wherever feels safest. And that can mean tradition in a healthy way. But I guess it could also mean a sort of a kind of awkward, white knuckling sort of rigidity, too."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":3606.64,"end":3672.25,"speaker":"Jonathan Pageau","text":"I mean, yeah, it's hard to find the balance when the world is kind of pushing you in a direction. And I sympathize for people who kind of kind of buckle down and kind of hold on. But it can be its own idol. Of course, at the same time, if you're not careful, because we always have to remember that Christ both would criticize the Pharisees for not embodying the law properly, but then he would also talk to Samaritans and he would talk to heretics. He didn't stop himself. If you understand that Samaritans were heretics at the time of Christ, then all of a sudden a lot of you can understand the possibility of engaging with people that you feel aren't right on every point of view anyway. So I'm not a big fan of the hyper traditionalists. I find that they kind of sometimes miss the essential. But I'm also definitely not a fan of the super progressive type with."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":3672.4,"end":3691.92,"speaker":"Matt Fradd","text":"Yeah, I'm with you. I'm more sympathetic to the hyper traditionalist because I feel like I can see what they're reaching for. Yeah. And, yeah, man, it's crazy. Hey, are you aware of these kind of Western Orthodox folks who celebrate one of the Western liturgies, but who are Orthodox?"}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":3692.56,"end":3699.61,"speaker":"Jonathan Pageau","text":"Yeah, they always struggle to find their place. Like, I think it's an interesting idea."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":3700.65,"end":3715.05,"speaker":"Matt Fradd","text":"I mean, it's probably like me. It's probably like me, right? Who's, like, adopting all of these Eastern traditions, who goes to Divine liturgy? It's an awkward place to be. And I heard someone say it's like being the child of divorced parents. You just feel kind of out of sorts, out of place."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":3715.29,"end":3728.79,"speaker":"Jonathan Pageau","text":"I think most of the people who are Western Orthodox are kind of ex Anglicans who kind of have a desire for Anglo Catholicism, can't have it in them to, let's say, convert to Catholicism."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":3728.79,"end":3729.31,"speaker":"Matt Fradd","text":"Yeah."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":3729.31,"end":3744.95,"speaker":"Jonathan Pageau","text":"And so, and so they, they end up becoming Orthodox but wanting to keep their kind of Anglo, you know, Anglo Catholic liturgy. And there's also like a weird neo Celtic thing in there, like a kind of idea of Celtic spirituality. And, and so now what makes that weird?"}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":3744.95,"end":3755.88,"speaker":"Matt Fradd","text":"Because that sounded pejorative. Right. Because I, I kind of feel like if Anglicanism hadn't split from Catholicism, the Catholicism you would have today would actually be less Roman and more Celtic in an appropriate sense."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":3756.92,"end":3832.89,"speaker":"Jonathan Pageau","text":"The way, at least my understanding of the west, the Western Orthodox, is that they have a sense that, let's say the Celtic church was colonized by rome and that St. Augustine actually imposed. St. Augustine of Canterbury kind of brought in the Latin and kind of impose the Latin form and kind of marginalize the Celtic practices. And that they're trying to kind of revive these Celtic practices. At least that's my. Not everybody. It's hard because it's such a. It's a mess of people. Like, it's all people that are kind of doing different things. But that's the sense. And it's like, I don't. I'm not against it. I just, I'm worrisome about things that are kind of archaeological and their approach, where the traditions that are gone, it's hard to revive them from the outside. You find these texts, you find these old texts that aren't even fully there, that are missing pages and they're missing things. And you try to reconstruct the liturgy of some 5th century Celtic saint. It's like, I don't know, man, maybe I'm not there, but I think it's better, like you said, to have something which is handed down and which is, which has continuity."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":3833.29,"end":3861.28,"speaker":"Matt Fradd","text":"And what was tough with me, and maybe tough of you, is I didn't have anything handed down to me, like, even as a, even as a, as a Western Catholic. It was just sort of the, the nonsense of this, you know, secular music being played in church. And, you know, I wasn't even taught how to pray the Holy Rosary. We didn't have incense in church. All of that was gotten rid of because the kids want to be entertained. The only thing is, Father wasn't as funny as Seinfeld and the band wasn't as good as Metallica, so it came across as lame."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":3862.64,"end":3891.13,"speaker":"Jonathan Pageau","text":"But I think that, that, but that's. It's a good thing right now because I think that that's one of the things. That's one of the aspects that is bringing people back to traditional liturgical practice. It's that at some point, you realize that it works for a while to try to carbon copy the world, but you run out of breath because you can never compete with the devil. Like, you can't compete with. You can't compete with the thing you're taking it from. And so it ends up always looking like a pale imitation."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":3891.13,"end":3902.97,"speaker":"Matt Fradd","text":"Totally. And if liturgy is the work of the people, then we go to work. We go out of justice to give God his due to the degree we can not. To sit back and be entertained. Yeah, no, totally, totally, totally."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":3902.97,"end":3980.08,"speaker":"Jonathan Pageau","text":"And also because the forms that we have are so awesome, like the relationship between the architecture, the liturgy, the images, it's like. It's this intertextual language of references that will blow your mind once you start to look at them more profoundly. And all of a sudden, it's like, I always kind of joke with people that. People who like Marvel Comics or Lord of the Rings and all this stuff where it's like all these characters that interrelate with each other and they have crossovers and everything. That's what liturgy is. That's what the whole liturgical cycle is. And the relationship between the architecture and the processions and all of this, it's basically like a giant Marvel Comics universe, but it's the one you can live in. It's not something you look at from the outside. You can actually be inside this intertextual world of references and relationship. And some parts of this icon appear in this icon. And then all of a sudden, you listen to a hymn, and then it says something, and you realize why Christ is represented this way on the cross. There's something in the hymn which is connecting that and then to the story of Jonah and then to Adam. Even the. It's like. It's just this amazing ride you can get on when you start to see all these references and how they connect to each other."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":3980.08,"end":3993.73,"speaker":"Matt Fradd","text":"Oh, man, that's really beautiful. Hey, what's your opinion on theistic apologetics? Cause from the short discussion we've had here, it sounds like. I don't know. It doesn't sound like it plays a primary role in your Christian life. Maybe I'm wrong."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":3994.29,"end":3995.09,"speaker":"Jonathan Pageau","text":"No, not at all."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":3995.09,"end":3998.05,"speaker":"Matt Fradd","text":"Okay, so why is that, and what's your opinion of it generally?"}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":3999.73,"end":4017.17,"speaker":"Jonathan Pageau","text":"I don't have. I don't have a problem with apologetics. I think I grew up Baptist, and I grew up having, at some point, you know, having to go knock on doors and tell people that Jesus loved them. And I always promised myself that I would never evangelize. When I became Orthodox, I would just never evangelize."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":4017.25,"end":4018.85,"speaker":"Matt Fradd","text":"Is that why Orthodox don't evangelize?"}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":4019.29,"end":4091.4,"speaker":"Jonathan Pageau","text":"There is go knock on doors. But then when I started encountering atheists, and atheists started writing me and asking questions and everything, all of a sudden I realized that there may be another way to evangelize. And it's mostly just talk about how beautiful this is and not try to explain it in a way of defending the positions and everything, but mostly try to. So the way that I talk about Christianity is always trying to show you how powerful this pattern is and how you can live inside it and how you won't find a better story than the story of Jesus. There is no better story. The story of Jesus encompasses all strains of storytelling in its story. And I can show it to you. I can slowly point at different aspects of Jesus story and show you how it brings in all these different elements that you like to watch in movies. But they're all. They're all brought together in the story of Christ in a way that will blow your mind once you start to see it. Right. So that's mostly been. My approach is just to try to surprise people with meaning, surprise them with beauty, rather than try to defend this or that moral position or this or that, you know?"}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":4091.4,"end":4098.2,"speaker":"Matt Fradd","text":"Yeah, yeah. No, and I think you're. Even though I think there is absolutely a role for theistic apologetics, because, you know, for a lot of people, they're."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":4098.2,"end":4099.48,"speaker":"Jonathan Pageau","text":"Like, it works for some people."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":4099.48,"end":4132.29,"speaker":"Matt Fradd","text":"Well, there are. I mean, there are people who are like, I actually want to believe. I'm not being stubborn. I'm not trying not to believe. Just show me how this is logical. But I think you're right. For many people, they've been down that road so many times and can't kind of make themselves believe. Which is interesting, because, you know, Blaise Pascal has that answer to those who want to believe but don't know how. It's like, well, just act like a Christian. Like, take holy water and say your prayers and. And just do the things Christians do and see the coherence. You know, your life will adopt. Maybe. Maybe that's more in line with what you're saying."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":4133.26,"end":4188.96,"speaker":"Jonathan Pageau","text":"Well, there's something about, like. There's something about the experience of the liturgy, for example. You know, if you do. If you go in with, like, this openness and this desire to encounter it, and. Or the encounter with an icon or the encounter with a very beautiful traditional church that it goes beyond the argumentation, you know, and there's something about Orthodoxy which is just always traditionally been that. You know, when St. Vladimir of Kiev converted to Orthodoxy, they always say that it's because they invited his mother to Hagia Sophia and they said, here, come see what we're doing. And they brought her into the church, and she went through this magnificent liturgy with huge choir and the sound reflecting in all these golden domes. And then she went back home and she said, I was in heaven. I just came back from heaven. And so I think there's something that is something in the Orthodox tradition which kind of is conducive to that as well."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":4188.96,"end":4202.44,"speaker":"Matt Fradd","text":"It is. It's more incarnate. Right. Because if we stick to the kind of head arguments, what you're saying to your friend when you invite him to liturgy is like, bring your entire being with you, not just your intellect. Like, experience it and see what happens."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":4202.84,"end":4253.57,"speaker":"Jonathan Pageau","text":"Yeah, yeah. And, like, one of the things I'm doing, for example, is helping people see the story of Christ appear all over. And also the inevitability. Because one of the things that people don't realize is just how Christian they are without knowing it. And there are certain tropes, for example, in storytelling that are extremely popular right now or just inevitable right now that didn't exist before Christ. They just didn't. The image of the night, for example, the image of the strong person who is willing to fight, to defend the weak and to sacrifice himself for those who can't fight for themselves. That is a Christian story. There was none of that in the pagan world. The pagan heroes are all jerks. They're all selfish, like, boorish people who only care about their honor. Whereas the knight has that idea that you can fight for the weak."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":4253.57,"end":4258.61,"speaker":"Matt Fradd","text":"And so I was just reading Robin Hood lately. It's my bedside story, and it's exactly that."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":4259.89,"end":4270.37,"speaker":"Jonathan Pageau","text":"And so you can't avoid it. The image or the image of the hero who gets knocked down and kind of stays down for a while, and you feel he's gonna lose and he's gonna be beaten, and then he gets back up at the end."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":4270.37,"end":4270.77,"speaker":"Matt Fradd","text":"Rocky."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":4270.77,"end":4302.94,"speaker":"Jonathan Pageau","text":"It's such a cliche, but without the resurrection that story is, it just wouldn't be part of our tropes. And so I try to point to people to say how much the story of Christ has imbued all our forms. And that as we actually, as we move away from Christianity, it even becomes more apparent, because we start to notice now, all of a sudden, that every Marvel comic store, every Marvel movie is about Jesus, basically. And it just. In the. Just little parts of. Of Jesus's story that are. That are appearing in those."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":4302.94,"end":4323.58,"speaker":"Matt Fradd","text":"Well, I mean, I watched. I watched the first Thor, which I know is kind of based on mythology anyway, but a lot of them are in some way. And it's just so Christian. I mean, he. Yeah, he comes to Earth, he dies and saves us and resurrects and then ascends, and he tells his bride he will be back for her. Not his bride, but his girlfriend, you know."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":4323.58,"end":4341.22,"speaker":"Jonathan Pageau","text":"Yeah, exactly. He's coming back for very. I think the first Thor movie was Ken the Branagh. So he probably was doing it very, very much on purpose. But even the whole arc, if you look at the Avengers endgame and all that stuff, at the end, I'm going to spoil the movie. I mean, everybody's seen it by now."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":4341.22,"end":4343.1,"speaker":"Matt Fradd","text":"So it's your fault if you haven't continue."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":4343.1,"end":4413.82,"speaker":"Jonathan Pageau","text":"Yeah, exactly. It's your fault. So I keep telling people. So when at the end, Iron man takes the gauntlet and then kills Thanos using the gauntlet, he's making a Lord of the Rings move. He's taking the ring and he's using it to fight evil. And so the question is, what's the difference? Like, what's the difference between why in the Lord of the Rings they can't do that? Like, if they take the ring, they're going to be corrupted by its power. Why is it that Iron man can take the ring, Tony Stark can take the ring and use it to defeat evil without being corrupted? And the reason is that because he sacrificed himself is because he died doing it. And that's the only reason why he could do it is because he knew that he was going to die when he did that. And it's a Christian story, it just ends up being a Christian story where he takes the power of death, uses it against death to save the world from death, but he has to die himself in order for it to be legitimate, in order for it not to be a form of satanic pride, he has to die. And it's like, what are you gonna do? You can't avoid the story. It's just gonna. It keeps coming back and back and back."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":4415.26,"end":4431.58,"speaker":"Matt Fradd","text":"Yeah. Trampled death by death. That's beautiful. Yeah. Okay, cool. All right. Well, hey, I've loved our chat and thank you so kindly for coming on the show, and I hope we get to chat again. Maybe for those who are watching on my channel, where can they learn more about you and the great stuff you're involved in."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":4432.3,"end":4452.5,"speaker":"Jonathan Pageau","text":"So, I mean, you can find my carvings on my carving website, Pedro Carvings. I'm also on YouTube on the symbolic World, where I talk about symbolism in all its forms. I have a website called the symbolicworld.com as well, where we have a blog and different people talking about symbolism as it helps you understand the world we live in. And so those are mostly the place where you can come up."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":4452.5,"end":4460.02,"speaker":"Matt Fradd","text":"And then you also have a great teespring account that I'm showing people right now. Did you come up with these designs? Are these your carvings?"}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":4460.34,"end":4464.9,"speaker":"Jonathan Pageau","text":"Well, not all. There's a few that. There's one. At least one or two that I asked someone I cared that I really."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":4464.9,"end":4468.78,"speaker":"Matt Fradd","text":"The Cosmic Mountain one. I'm going to buy. Buy like a hundred of them as soon as we're done."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":4470.3,"end":4482.14,"speaker":"Jonathan Pageau","text":"That's like the work of 20 years, I would say. So I've been thinking about this cosmic. The idea of representing everything in one image for a very long time. And so finally last year I had the guts to kind of put it together."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":4483.02,"end":4487.1,"speaker":"Matt Fradd","text":"It's beautiful. Tell us about it. Because it's on the screen for people to see right now."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":4487.42,"end":4523.4,"speaker":"Jonathan Pageau","text":"It's based on the, let's say, a kind of bringing together of the story of Genesis with the crucifixion of Christ. But also it joins all different elements of iconography together in one image. I have a video on my YouTube channel if people want to find out about what elements that I drag into this picture. But it's also a description of the hymns on paradise by Seneferim the Syrian and the ascent of Moses on the mountain in San Gregory of Nyssa's Life of Moses. So all of the things that I love about Christianity basically brought into one image this cosmic image."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":4523.64,"end":4528.52,"speaker":"Matt Fradd","text":"It's really terrific. And so how did you do that? I mean, did you do that on the computer? Was it a carving that you."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":4528.76,"end":4531.96,"speaker":"Jonathan Pageau","text":"Oh, it's a drawing. It's a hand drawing. Yeah."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":4532.12,"end":4535.8,"speaker":"Matt Fradd","text":"Oh, my goodness. Dude, you're a very talented man and I'm glad you're doing what you're doing."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":4536.6,"end":4539.04,"speaker":"Jonathan Pageau","text":"Thanks. Thanks for having me. It was a lot of fun. I enjoyed it."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":4539.04,"end":4539.96,"speaker":"Matt Fradd","text":"Good stuff. Thanks."}
{"episode_id":"SW - #142 - 2021-02-20 - Matt Fradd - Icons vs Porn","start":4540.92,"end":4605.86,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
