{"episode_id":"SW - #006 - 2018-06-21 - Symbolism in Guardians of The Galaxy vol.2","start":0.96,"end":1189.95,"speaker":"Jonathan Pageau","text":"On this episode of the Symbolic World podcast, I'm going to play for you the very first video that I made exclusively for my YouTube channel based on symbolic interpretation, and it was an interpretation of Guardians of the Galaxy. You will see that the sound is not amazing. Hopefully you will notice that as the podcasts keep going, both the sound of the original videos and and my capacity to edit this appropriately will improve. I have to apologize for the last podcast I put out. It seems that my introduction and the first part of the audio was mono and only in the left side channel. It is possible that since I was talking about Pepe the Frog, about ambiguity and about, say, the margin, that it was a strange symbolic synchronicity, that it was all on the left side. But I'll let all of you decide that for yourself. So having said that, please enjoy my interpretation of Guardians of the Galaxy and superheroes in general. This is Jonathan Pageau. Welcome to the Symbolic World. Hello, everyone. After I did the video the Metaphysics of Pepe with Dr. Jordan Peterson, I received quite a few requests to do more symbolic interpretations of popular cultural phenomena. Until today, I've been mostly interested in the symbolic structures that we find in Christianity and the traditional stories, traditional forms. And it has led me to look into mythological ideas, folk stories, traditions from Islam and from Judaism as well. And so, in my wish, let's say, to discover the symbolic patterns that we find in Christianity, I've also found that these patterns are general patterns of being, and we can use them to understand our lives and our families, but also culture forms such as movies and novels and even political events. So when I started to get those comments, at first I hesitated to start, let's say, profusely commenting on popular culture. But I realized that, to be honest, I do it for myself all the time. I can't watch a movie or a television show without seeing the underlying patterns. So I thought I would make a more popular discussion on the question because we live in a very strange time, time of rising chaos, let's say. And by looking at the patterns which appear around us, we can start to make sense of what's happening. And I hope, though I hope that as I start making these videos, it will be an impetus for people to look more deeply into the traditional stories. Because, let's say, something like the Bible, the level of symbolism and the level of the stories in the Bible are far more profound and subtle than anything that we can find in popular culture today. So having said that, first I need to explain that there are many ways that we could Frame, symbolic patterns. But the frame that I will use most prominently is the geometric symbolism of center and periphery. And I'm going to use that structure because, well, it's easy to understand. And we encounter it in our bodies, we encounter it in our rituals, our societies, and we also encounter it more abstractly in language and in our concept. And so it also happens to be the main, let's say, imagery used by political factions within the growing chaos and strife which surrounds us. This notion of identity of refugees, walls, immigration, war, technology, all of these things can be understood quite well using the basic frame of state, center and periphery. In general, the problem of chaos is the problem of the margin. And whether we see this margin as an exciting potential by which we can further ourselves out into the world, or whether we see this margin, this periphery, as a dangerous threat to the things that we care about, it's important to understand the margin and see its manifestations. And I think that that's the key to avoiding the worst. So I'm going to start these videos with Guardians of the Galaxy. So why Guardians of the Galaxy? Well, it's the last movie that I saw, but it also has a lot to say about what's happening around us. There's been a lot of commentary recently about how a lot of the blockbuster type movies right now are giving in to left leaning, social justice type propaganda. And we can definitely see that in Guardians of the Galaxy. But it remains interesting nonetheless. And it can still help us understand things if we stay critical and make an effort to always see both sides. That's really the key to remaining aware and being completely aware of what's happening. One of the things that makes it interesting is its use of the superhero genre. The hero genre, the notion of the superhero as a guardian is quite appropriate. A guardian stands on the wall, right? Stands on the limit, protects the city, or in this case, protects the whole galaxy from whatever threatens it. And so in this way, the hero is very much akin to liminal symbolism, to symbolism of the margin. Like a wall or a weapon is a manifestation of what happens on the margin. And in fact, the hero usually is not normal. The hero is not a proper extension of the center, let's say not a proper extension of identity. Rather, the hero is an exception. And being an exception, that exception manifests itself in ways which reflect the quality of a margin. So Superman is an alien, Wonder Woman is an Amazon, Aquaman is from Atlantis. And so many others of the superhero types are born from accidents. They're freaks, right, like Dr. Manhattan or Hulk. And so Many of the superheroes, they suggest a type of. Of hybridity, right? The type of hybridity that happens on the margin, on the place where two categories meet. That's where hybridity begins to occur. And so we can see that in the names of the superheroes like Batman, Spiderman, et cetera, et cetera. Not just a man, but a something man. And usually that something, let's say it's an animal or it's a power, or it's some something strange, let's say. And the heroes in antiquity, the heroes of mythology, of the pre Christian world, were also these hybrid things. They were usually demigods, right? Ambiguous hybrid beings that stand between worlds. Heracles, Achilles. But we also see that in the Bible, in the pre Diluvian giants, right, they were called men of renown and, and were known for their extraordinary feats. And they were born of the miscegenation between the sons of God and the daughters of men. Whatever you think that means, it doesn't matter. What's important is to understand that they are this last generation before the end of a world, this limit of the world, and being at the end of the world before its destruction. They appear as this mixture of categories, as a place where the categories begin to fall apart. And the biblical giants, they also remind us that the superhero usually is a mirror reflection of the super villain, let's say, like two sides of a coin, or rather two sides of a wall. And that sometimes the difference between what's on one side of the wall and what's on the other side isn't that obvious. And that was certainly the case in antiquity. A great modern example is the figure of Hellboy, who defends the world from evil, but is basically a demon who crossed over from hell. And in the end, it is said that he will be the cause of the end of the world itself. And so he remains ambiguous throughout his story. The recent Suicide Squad movie was a perfect example of this. Now in the Guardian of the Galaxy, the characters exhibit this in between nature, this ambiguity of the margin. We're so used to the trope of like a ragtag gathering of contradictory figures, weirdos, outsiders, criminal loners, all these kind of these chaotic characters coming together that we're so used to seeing it now as a trope in stories that we. We probably don't ask ourselves what that is, what that means. So the basic superhero story, usually, let's say the one that comes to mind if we think right away of a basic superhero story, we could say the most archetypal story would Be this notion that there is a threat from the periphery, there's something from the margin which threatens the center, something monstrous is attacking. So think of Independence Day. Think of Pacific Rim and those types of movies of this invading outer, this invading stranger, this invading alien that comes and the hero saves us from that thing. If the movie is a bit subtle, the superhero or the hero in general will have some link, will have some relationship of identity or of causality with that bad thing that's coming. Now think. Think, for example, of Superman, who saves the world from General Zod, who is a. Who also comes from his world. Think of the X Men, who have the save, who have to save the world from Magneto and other mutants who are just like them. So now, because the superhero is an in between character, he can also sometimes defend the world not from the outside through threat, but from the dangers and the pathologies of the center itself. Or sometimes the hero can defend the world from both extremes at the same time. What made the X Men movies so interesting, for example, is that the X Men are trying to defend the world from bad mutants who are like them. Those bad mutants want to destroy the center. Let's say they want to destroy the normies. And then the X Men are also protecting the mutants from those normies, from those in the center who fear and are disgusted by the mutants because they're dangerous freaks. So a large part of the story arc of volume two of Guardians of the Galaxy is to show the pathologies of the center, let's say the pathologies of identity. Now, we know that this is what the movie is about because it's encapsulated in the catalyst of the story. The catalyst of the story is that the Guardians are hired to protect the source of energy, some batteries belonging to the Sovereign race. They protect them from an interdimensional monster, a monster of chaos, a dragon, basically, in terms of symbolism. But when the Guardians encounter the Queen of this Sovereign race, something goes wrong. The Sovereign race is presented as this pure race. They're golden, they're designed, and so they're intentional. And intentionality is important in understanding the center. But here, this intentionality is shown to us in the extreme. So think eugenics. They're presented as without error, without accident. And the Queen criticizes the origins of the Guardians, speaks of Quinn's unorthodox and unknown genealogy. A hybrid, and so particularly reckless, she said. So notice the relationship between hybridity, the unknown, and chaos. So Rocket has himself stolen the batteries, and then he makes us understand that his theft is a kind of vengeance against the sovereign's pretension and pride. So the queen fails to understand that it is precisely because this group of guardians are unorthodox and peripheral, which makes them capable of defending the sovereign from that monster. But it's also what makes them capable of stealing the very thing that they were protecting. So the question of identity becomes the central question of the movie from the beginning, and it plays itself out as the story unfolds. So one side of the pathology of the center could be called the feminine side, being unpolitically correct, but using traditional categories, we could call it the passive side of identity, which is the desire to remain pure, right to preserve absolute order, remain untouched in an almost hygienic manner. One of the traditional images of this is, of course, the image of virginity. So when the queen is forced to go. And of course, the queen is a virgin, that's made explicit in the story. So when the queen is forced to go to another planet, we see her walking on a carpet unrolled before her as she refuses to touch anything foreign. We can find this type of excess in our daily relationships. We have the trope that we find around us of the mother, who's a clean freak. And we can understand this excess in terms of hygiene very well. We know that the excess of hygiene in the modern world, the excessive use of disinfectants, for example, seems to be at least one of the causes of modern allergies. And so excess of purity actually causes in a reaction, an excess of our defense system, which reacts disproportionately to things that are actually not harmful or even beneficial, which come from the outside. And there's a story in the Bible about this, a story about the excess of purity. Moses has married a foreign woman. In fact, she's a Kushite woman who has been described in tradition as being Ethiopian woman. So she's a woman with a dark complexion. And Moses, Sister Miriam complains about this. And because of this criticism, she's punished. And her punishment is appropriately, it is a skin disease. Her skin becomes white as snow, and so she is defiled by an excess of whiteness. Her excess of purity becomes a punishment, and she has to be kept out of the camp for seven days. So the. The other enemy, the other important enemy in Guardians of the Galaxy is ego. Ego is in many ways the flip side of the pathology of the center, the active or masculine excess of the center. And that can be described as the excess of imperialism. So if the Supremes want to protect their energy, they want to protect their lineage, protect their identity at any cost from, let's say, leaking out. Ego, which is of course a perfect name in what he represents in this movie, wants rather to spread his light throughout the entire galaxy, so that the galaxy becomes himself. He wants his identity to be all, containing no difference at all. This is of course the Tower of Babel motif. He joins himself with all possible life forms, not with the purpose of creating new things, because he kills the offsprings in which he does not see himself, right? He will only tolerate that which. Which is a manifestation of his own identity. So he doesn't understand. What he doesn't understand is that for there to be another version of him, that is the very notion of other means that there must be difference. And it is that basic blindness of pride which makes it impossible for him to even conceive that Quill would be attached to his humanity, would be attached to the manner in which he is different from his father. And so Ego could not foresee his own demise. Now, these two pathologies of the center are obviously in many ways opposites. But in the end they're just passive and active sides of the same pathology, which can come from the excess of the center, the excess of the right hand, let's say, the excess of order, the excess of identity. And both of these tendencies and their excesses are totalitarian in the very explicit sense. That is, they want to believe that something can exist on its own, can be completely self sufficient. Which is impossible, of course, except for the infinite or the Divine itself. Now the question is, is there something anti western, is there something, something anti order? Or is there some social justice propaganda in this movie? And maybe a little. It seems to be, let's say, strongly tilted to one side. But the chaos of the Margin is also showed. We see that in the mutiny of the Ravagers against Yondu. That's a good example of the chaos that happens in the Margin. Also. We see it in the resentment and the bitterness of Nebula, who's also a half biological, half robot creature. But it's also lurking in the background of this movie. Because we know, especially if we've seen the first movie, we know that behind all this, lurking behind all of this story, is basically the head of the forces of Chaos, I would say, which is Thanos, which is a virgin of death. And so, despite the strong left leaning tendency, some balance is still fine in the overall story. And we'll have plenty of time to look at the excesses of both sides if we continue on the series."}
