{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":0.16,"end":149.29,"speaker":"Jonathan Pageau","text":"Atheists will say, well, humans are the universe knowing itself, right? It's like, yeah, humans are the universe knowing itself. It means that the universe is intelligent because we're intelligent. I don't know what to say. It's like we are part of the universe and we're the place where intelligence finds its highest form that we know of in the created world. And therefore the universe is intelligent because it's like, it's like if I take your body and I say, well, you're not intelligent because your fingernail's not intelligent and your thumb's not intelligent and your, you know, your, your ear is not intelligent. But Stephen Meyer is intelligent. That's the same with the universe, right? It's like the universe is intelligent because we're intelligent. I know that that might, I know that that might have convinced a bunch of atheists, but it just seems like there's a way in which often I've noticed that atheists tend to abstract themselves from the, from the reality and not consider the place of man in the cosmos. Whereas in the biblical cosmology, you know, the human is placed in a very particular place in the middle of the whole system and is given to name the animals, like is given to continue that process of information that happens in creation. The place of knowledge in the world is, is the human person. This is Jonathan Pedro. Welcome to the symbolic world. So hello everyone. I am here with Stephen Meyer. Many of you will know Stephen Meyer. He is a scientist involved in the question of intelligent design. He's written several books, the Signature in the Cell, the Darwin's Doubt. But he's come on my, let's say, closer to my attention recently because I've noticed that he's been getting more and more attention. You know, I, I saw a few years ago talk between himself and Berlinsky and, and, and another mathematician talking about, you know, kind of opposition to Darwin or questions about Darwin on the Hoover Institution and millions of views on that. And then recently Joe Rogan and then Piers Morgan. And so it seems to me that there's an interesting shift in the willingness of people to engage with the question of intelligent design. And so that's what I want to talk to Steve about. And so thanks for, thanks for coming on."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":149.53,"end":151.13,"speaker":"Stephen Meyer","text":"Thanks for having me, Jonathan."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":151.61,"end":174.26,"speaker":"Jonathan Pageau","text":"And so, I mean, first of all, maybe you can lay out for people who don't know your work. You know, what is the basic argument that you're proposing in terms of intelligent design? It's different from the young Earth creationist approach. It tends to take the question Question of evolution and of those types of proof, seriously. But then see them in a, in a different frame."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":174.9,"end":342.75,"speaker":"Stephen Meyer","text":"Yeah, yeah. Well that's a great place to start. Quick definition. The theory of Intelligent design affirms that that life and the universe are best explained by a designing intelligence rather than by undirected material processes such as in biological realm natural selection acting on random varia. And it's quite different from young earth creationism in that it is making no claims about the age of the earth. Most proponents of intelligent design think, as I do, that the earth is very old, but it's an age neutral proposition. It's saying that life is designed as opposed to merely giving the appearance of design, which is what many Darwinian biologists say. In fact, that is classic Darwinianism. Richard Dawkins has said that biology is a study of complicated things that give the appearance of having been designed for, for a purpose. But the claim that the Darwinists make is that the appearance is an illusion. And it's an illusion because even though life looks as though it was designed, the appearance of design is a product of an unguided undirected mechanism, namely natural selection and acting on random variation. So our challenge to the evolutionary establishment is not about the idea of change over time or about the idea of microevolution or adaptation. It's not even necessarily about the idea of universal common descent, the idea that all organisms are related by common ancestry. Although I personally and other ID proponents are skeptical about that, others are not. But what we're really challenging is this idea that there's no evidence of actual design in life. The claim that life is the product of undirected processes such that the appearance of design is just an appearance, just an illusion. So we named our theory Intelligent Design to contrast it with that idea of Darwinian apparent design. Now, so back to creationism. Creationism and intelligent design are different in two ways. One, creationism is committed to a particular age of the earth and a particular reading of the days of Genesis in the Bible. Our theory is neutral about that. But most of us scientists hold that the earth is very old. And secondly, the creationism is derivative from, or in a sense a kind of a deduction or interpretation of the biblical text. Whereas the theory of intelligent design is an inference from biological and astronomical and physical and cosmological data, it starts with the evidence and infers to the activity of a designing mind behind the evidence as a matter of scientific and philosophical reasoning."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":343.47,"end":379.24,"speaker":"Jonathan Pageau","text":"And so my understanding is also that one of the biggest arguments you have is that in some Ways the level of complexity that the world is actually made of was not available to Darwin at the time. He didn't understand just how many levels of complexity existed even within the cell and within, you know, DNA and the constituents of life. And every level that you add acts and adds an exponential level of randomness or of possibility. And therefore it's just the possibility of like the capacity for something to be simply the things bumping into each other over millions of years is just mathematically impossible."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":379.64,"end":717.96,"speaker":"Stephen Meyer","text":"Well, yeah, there's a lot, you've said a lot there that's all very relevant if we move from our definition of the theory of intelligent design, that intelligent design affirms that there are certain features of life and the universe that are best explained by a designing mind or intelligence rather than undirected processes. That leads naturally to the question, well, what kinds of features are you talking about? And in the realm of physics, one of those features is something that many physicists talk about today, and that is the, the evidence that the universe was in some way fine. T to allow for the possibility of life. We have the basic parameters of physics, the laws of physics, the constants of physics, the initial conditions of the universe. All of these things have been discovered to fall within very narrow ranges or tolerances outside of which life and even basic chemistry would be impossible. And so there's this high degree of fine tuning, this incredibly improbable degree of fine tuning that has led many physicists, even physicists like Sir Fred Hoyle, who was a very prominent scientific atheist early in his career, to reverse field. Boyle discovered some of these fine tuning parameters and then later realized there must be a fine tuner behind the fine tuning. And he was quoted as saying that a common sense interpretation of the data suggests that a super intellect has monkeyed with physics to make life possible. So that's one of those classes of evidence, the evidence of fine tuning that we find in physics and cosmology, but within the biological realm. You're right. The discovery of the extraordinary complexity of even what we used to think of as the simple cell has led more and more biologists to doubt theories about, first of all, the chemical evolutionary origin of life. The idea that you could have a series of chemical reactions over a long period of time and move from chemicals in some sort of prebiotic soup to, to the first living cell. And it has also led many scientists to doubt the, the, the full on biological evolutionary theory, the Darwinian part of the story that you can get from the first cell to all the new forms of life Again, through an undirected, unguided process, such as natural selection, Acting on random variation. So what types of complexity are we seeing inside life? The most extraordinary discoveries started in the, in the 1950s and 60s. And these were the discoveries of the information beari of the large, what are called biomacromolecules, things like DNA, RNA and proteins. Watson and Crick elucidate the structure of DNA in 1953. It's a pretty big discovery, very big breakthrough. But in 1958, Francis Crick working on his own. It's interesting, he'd been a code breaker in World War II, he's working on his own. And he realizes that along the spine of the DNA molecule, On the interior of that famed double helix, There are a series of chemical subunits. And he realizes that those chemical subunits, they're called bases or nucleotide bases, are functioning like alphabetic characters in a written language or like digital characters, like the zeros and ones in a section of machine code. And he's making these discoveries about the same time that you're having the information revolution taking place in engineering and math and physics. And so you have the concepts of information coming into the sciences. And George Gamow, very famous physicist, realizes that Crick's description of the DNA molecule can be rendered that what he's describing with the function of the nucleotide bases. He says a series of those bases can be rendered as a digital bit string. This is a string of information for directing, and this was Crick's hypothesis for directing the construction of proteins and protein machines that keep cells alive. By the mid-1960s, when this sequence hypothesis of Francis Crick is confirmed, you, biology enters an information age. And people realize that inside the cell we don't just have chemical reactions going on. It's not just metabolism even, it's an information storage, transmission and processing system. And there's two different processing systems inside the cell, One for replicating DNA and one for using the information in DNA to direct the construction of proteins. And so the sophistication of the informational system that's at work inside even the simplest cell, even one cell B, information processing and storage capacity of the type I'm describing this, this completely changes the terms of debate about the origin of life and even, even evolutionary biology, because we now realize that in order to build the first living cell and in order to build new life from pre existing life, in each case you have to have information, Just as in our computer world you need code to produce if you want to give your Computer, a new function. If you want to have a new app or a new program or new operating system, you've got to provide information. Same thing turns out to be true in life. If you want to build a new form of life from a simpler pre existing form, or if you want to build life in the first place, you've got to have information to build the proteins and the molecular machines and the other structures inside the cell. And so that creates a shift. It puts all evolutionary theories under pressure. I would say that both chemical and biological evolutionary theory have reached a state of impasse because they cannot explain the origin of information. And yet we know from experience that information always arises from a known source and that source is intelligence."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":718.2,"end":742.14,"speaker":"Jonathan Pageau","text":"Yeah, and in some ways we also have the experience of, in the world of seeing constraint go beyond the natural, like just things banging against each other. And that is exactly the same thing. It's things like mind, things like will, things like purpose, all of these invisible patterns that constrain reality. The ones that go beyond the way."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":742.14,"end":876.06,"speaker":"Stephen Meyer","text":"You'Re talking, Jonathan, that's exactly. You're talking like an engineer. But to understand life today, you have to think like a design engineer. To understand the universe, you have to. Those fine tuning parameters I was talking about in physics, those are nothing more than highly improbable constraints on what matter is allowed to do by the fundamental laws of nature. And we find in order to move from all the possible ways of arranging matter that there are to the ways that manifest themselves in life, one constraint after another has to be applied to those that, that those huge ensembles of possibilities have to be narrowed to get something that we would recognize as life. And that is that, that. Well, that makes life possible. Let's just say that. Yeah. So the, the engineering constraints that are necessary to produce a cell are immense and highly improbable. And they also represent inputs of information. This was the basic insight of the early information scientists like, like, like Weaver and others. The idea that information involves the, the restriction of possibilities. In fact, we measure information today that way. If I flip a coin and it comes up head, well, let's do it with zeros and ones. In the computer world, if I, if I get a one, I've eliminated a zero. So there are two possibilities. I've constrained the possibilities and elected one and eliminated another. And that's one bit of information. And so we, we, we now have a way of quantifying this idea of informational constraints. And the DNA is nothing more. Well, it's a lot of different things, but it is Also a series of restrictions. You've got four possibilities at each side along the DNA molecule. It's not a binary code, but a quaternary code. And so at each point, one of the four options is elected and three are eliminated. And therefore a quantifiable amount of information is imparted or stored at that point. And it turns out that that information is also importantly functional because it's directing the construction of the proteins and protein machines. Yeah."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":876.06,"end":953.95,"speaker":"Jonathan Pageau","text":"And I mean, what's fascinating to me is that even when I hear the Darwinian argument to say that it's just random mutation and then natural selection, it's like even the term natural selection. What? Exactly. So you're saying, so being has a tendency to persist and being has a tendency to be autopoetic and to constrain reality in a manner that non living beings do not have. And that type of constraint, even though we don't even necessarily have mind at the outset, like at the lowest forms, but that type of constraint already looks like what mind does at a higher levels. And so like you said, the idea of saying that we can notice that this type of constraint, even in the world of biology, is already there in the structures themselves, but then at some point thinking, well, then we can't go any further than that, we notice that that actually does what we need for it to happen, for it to constrain reality in a way that goes beyond just randomness. Analogically you would be able to infer that then mind is an aspect of the universe that constrains matter like it already is in life. Like, why does it bother you?"}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":953.95,"end":1101.27,"speaker":"Stephen Meyer","text":"A key insight you have that I'm thinking back on Shannon, Claude Shannon and Weaver, who developed information theory in the first place. And the idea was that any reduction of uncertainty results in a corresponding input of information. And so that's what we can think of. The idea of imparting information is also a way of constraining things. But what we also know from our experience, our uniform and repeated experience, which is the basis of all scientific reasoning, is that if we have a big input of information into a system, it's always come from a mind, whether we're talking about a computer program or a paragraph in a book, or a hieroglyphic inscription, or we're transmitting information now across the Internet. But where does that information come from? It comes from a mind. And that kind of makes sense when you think of or from intelligence. Well, what is the Latin root for intelligence is Interlego. It's to choose between. That's what Minds do they choose between and in the most basic sense, information is choosing between, between 0 and a 1, between a a or a C or a G or a T. And so what we find in life is stored information in DNA suggesting a priority, the prior activity of a mind in, in choosing between the options to elect the one that's there present. And so there's a lot of deep concepts here, but I think that from the standpoint of evolutionary theory, and you brought up the whole question of random mutations, the evolutionary mechanisms do not and are not providing adequate explanations for the origin of information. Let's just look at Europe, the mutation selection idea for a minute. If in fact a section of DNA containing information for building a protein is alphabetic or digital in character, and it is. Leroy Hood, our famous biotech expert out here in the Seattle area, just says DNA contains digital code. Richard Dawkins says it's like a machine code. Francis Crick made very clear that it stored information, and not just information in a mathematical sense, but information that was also functional."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":1101.67,"end":1108.31,"speaker":"Jonathan Pageau","text":"Yeah, it's a constraining factor, it's commanding, it's giving orders."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":1108.55,"end":1435.55,"speaker":"Stephen Meyer","text":"Exactly. Bill Gates are also other local hero in the Seattle area says DNA is like a software program, but much more complex than any we've devised. So what do we know about software information in a digital form? Well, if it's functional, we know that you can't change it very much without degrading its function and very quickly causing it to lose function altogether. But what do the Darwinians propose as the mechanism by which new form is generated? Well, they propose that you will have random changes in the section of a gene, the ACS, GS and T in a gene, and that many of those random changes will be degradative, but occasionally you'll get lucky and you'll get a good one, and then that one will result in a new protein, and that new protein will result in will combine with other proteins and form some sort of new anatomical structure. And as those changes accumulate, you'll eventually get new form, new biological form and function. But there's a problem, and that's the problem, a problem we know well from our computer world, and that is that the functional sequences are so rare that if you begin to change the bit strings, you're inevitably, after very few changes, going to destroy the function long before you ever get to something new or functional. If I've got a section of code for building an app and I want to evolve it by random changes to generate a new app, I'm going to degrade and destroy the existing app long before I find a new series of characters that will give me a new app or a new operating system or something. And the reason for that is that the functional sequences are so rare among all the possible ways of arranging the zeros and ones in computer code. Or we could do the same thought experiment with English text. If we've got a line of poetry, time and tide wait for no man, and we want to evolve it into a line from the Principia by Newton, we can. We'll start to change the time and tide and pretty soon we'll get undecipherable gibberish long before we get a line from Newton or Hawking or anybody else. And what's going on here? What's going on is that in all linguistic systems, our systems for conveying information digitally or alphabetically, the islands or the arrangements that are functional can be represented as little tiny islands separated from other little tiny islands by vast spaces of non functional gibberish. There's a kind of an abyss between them. Now, does that same kind of problem apply in biology? Well, it turns out it does. We have strong empirical evidence now that the sequences that form functional genes capable of building proteins are extremely rare. Among all the possible ways there are of arranging the A, Cs, GS and Ts in DNA, or arranging the amino acids, the 20amino acids in the proteins. I have a colleague, Douglas axe, who worked 14 years at Cambridge University to investigate the question, well, how rare or common are these functional sequences? And in studying a protein of modest length, of about 150amino acids in length, he discovered that for every sequence that will fold into a structure that's capable of doing a protein, a structure called a fold, there were 10 to the 74 power non functional combinations. Well, what that means is that inevitably then if you start changing the functional ones very much, you're going to fall into the non functional abyss because there's just so many more of them in comparison to the ones you want. Now, in addition to that, since Axe has done this work, there have been other scientists who've gotten similar numbers, but there have been a scientist at the Weizmann Institute named Dan Taufik. Axe did his work at Cambridge University. Tawfik has studied what are called. He studied proteins and he mutates them intentionally but randomly. And he's found that after a very few number of mutations that the stable structure called a fold, will unravel. And if it unravels, it can't perform a Function, there's nothing there to select. The number of changes that are necessary to cause it to unravel are far fewer than the number of changes that need to accumulate to build a new fold. Can't get there from here. Problem. Not only are the functional genes and proteins very rare, they're highly isolated in what's called sequence space, in the, in the space of all the possible ways there are of arranging the parts. So it's very much like the computer analogy. You start changing the zeros and ones, you're going to destroy your computer program or your app long before you generate a new one by random changes. The same problem applies at the genetic level in biology. And that leaves a big unanswered question. How do you explain the origin of new information? The new information you would need to build a new protein, which is kind of the scene of qua non of biological innovation. You got to have proteins and new protein folds in particular if you're going to build anything."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":1436.03,"end":1474.26,"speaker":"Jonathan Pageau","text":"So I'm not a scientist, it's important to understand that. And so is there a way to understand top down constraint, like a computer program at every level? So in some ways the zeros and ones, the reason why they're ordered that way necessarily is constrained by a level of programming that is constrained by, you know, like constrained by, by a human will at the top. And so that when you look at the difference between the zeros and ones and the program, you see a form of constraint. But you, how can I say this? That it has to layer itself so that you find the will because the."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":1474.26,"end":1559.73,"speaker":"Stephen Meyer","text":"Will is much hierarchically organized. Exactly. The constraint. There's constraint is, you can think of constraint in two ways. There's a functional requirement that you want the computer program to achieve or to meet. And then the engineer constrains the possibilities to produce a program that will produce the outcome that's desired. The functional requirement or the functional outcome or end. And in living systems you have highly constrained information rich molecules that are part of a larger information rich hierarchy and information rich system for storing and transmitting, storing, processing and transmitting information. But that ends up being that DNA producing proteins system is part of even greater hierarchy of information. There's information, it turns out, beyond the DNA stored in other places in the cell and in the organism. And so the best way to think of life today is as a hierarchically organized information storage, transmission and processing system. Well, that may not be the whole of what life is, but life certainly contains all that. And, and, and if you want to explain the origin of life, you've got to explain that because that's what's present."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":1560.61,"end":1598.96,"speaker":"Jonathan Pageau","text":"Yeah. And I mean, that seems to be. Because in the description in, in Genesis 1, that seems to be the way that God creates the world as the, as a hierarchy of identities that are laid out in purpose. Sometimes we don't realize the reason why the categories in Genesis are used. They're actually all categories of, of, of place in an ontological hierarchy and purpose, right? So like when you think of when God creates the mammals, the categories he uses are wild animals, tame animals, and creepy crawlers. It's like those are not scientific categories, folks. Those are categories of, let's say, constraint towards purpose within a human with a human experience."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":1599.2,"end":1600.16,"speaker":"Stephen Meyer","text":"Interesting. Yeah."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":1600.32,"end":1678.36,"speaker":"Jonathan Pageau","text":"And so you see that it's like the reason why I identify these animals is related to me, right? They're the animals that, that I can use and that ultimately maybe I can eat. They're the ones that eat me, right? And they're the ones that are kind of hidden on the ground and that, you know, are, are akin to the kind of chaos and, and wiggly stuff underneath. And so you can see that, that the way that it's described is as related to, you know, because the reason why I'm saying that is because I don't know if you've tried or, or attempted to make the connection between a lot of your work and what some of the, let's say, leading edge Cogsci stuff that is coming out. I've been had a lot of conversation with John Revae and obviously Jordan Peterson talks about this a lot, which is that even our category, our category structure, even the way in which we recognize beings in the world is related to constrained purpose, right? So why we even identify beings is related at the first level to the reason why we are identifying it, right? So I don't see a cup, I see something to drink from, right? And so I don't see a chair, I see something to sit on. And that all identities are actually constrained by purpose because the border between identities is not, is not that obvious. Right. Without intelligence, even the actual identities themselves."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":1678.44,"end":1817.57,"speaker":"Stephen Meyer","text":"And, and our, our argument is that is that entities that manifest purposive function or behavior are invariably the, the product of mind in our experience. And that's especially true when we're talking about information. The argument I make in a book called Signature in the Cell is that whenever we see information in a digital or alphabetic form, as we do at the foundation of life, and we trace that information back to its source, we always come to a mind Not a material process. And then I ask people to think, well, what are some examples? A hieroglyphic inscription. You see that on the Rosetta Stone in the British Museum. You're not going to infer wind and erosion. You're going to realize there was a scribe there. A computer program comes from a programmer, A paragraph in a book comes from a writer. Information embedded in a radio signal or being transmitted across the Internet ultimately goes back to a speaker or broadcaster if we trace information back to its source. The one thing we know very, very confidently is that information always arises from a mind or an intelligence. And that relates to some of the things we were talking about at the beginning of the interview, that if information is related to electing some options and eliminating others, in other words, constraining possibilities, that information is imparted as possibilities are constrained. And so a constraint represents a choice, a choosing between an interlego. Well then interlego is actually what we mean by intelligence, that intelligence is choosing between the options. There are things that do happen randomly, but there are limits to what are called the probabilistic resources of the universe. And the amount of information in the, the linguistic transmission that we're participating in right now and the amount of information in a computer program and the amount of information in a DNA molecule all exceed what you can reasonably expect to occur by random, random processes or stochastic processes, even if you take into account the entire history of the universe. So we're with DNA, we're well beyond that probabilistic threshold into both an amount of information and a kind of information which is indicative of intelligence."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":1817.65,"end":1885.65,"speaker":"Jonathan Pageau","text":"Yeah, and I mean, it seems to me too that you know, even taking, you know, the, the idea of, of random mutation and the notion of constraint, Right, So you can, you can use the word patterning, right, to talk about constraint. It's like basically you have a bunch of stuff and then that stuff is actually ordered in a manner that makes it into some, turns it into something else, right? So you have a bunch of stuff, you order it together. And now it's not just a bunch of stuff. It's an actual animal or it's a chair or it's, you know, whatever it is that I can identify as being. Because it's made of stuff, right? It's made of all these different levels of things. But that, that patterning itself, it seems like it has to, it just has to, has to pre exist to some extent for the, for the patterns to be like, to come into, to the pattern. Right? So it's like Even if you have a bunch of stuff and it comes into a pattern, that pattern makes sense. And it makes sense to form a new being that is a higher level of being, you could say a more complex level of being. It's like what is calling that into being? Like what is, what is the pattern has to, at least in some manner preexist."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":1885.65,"end":1890.89,"speaker":"Stephen Meyer","text":"Yeah, this is something, a connection I explore in some of my work. The connection between form."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":1891.49,"end":1891.73,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":1891.73,"end":1981.11,"speaker":"Stephen Meyer","text":"And information and the, the, you know, medieval philosophers like Thomas Aquinas talked a lot about formal causes and they were drawing on an Aristotelian background. And Thomas himself had a notion called exemplar causation, which was the idea that there's form in matter that results first in an idea, an exemplar in the mind of a creator. So we have a, we have a chair that we're sitting on. There's a, we can, we can describe that as a form, a structure, but we know that that came from an idea in the mind of a carpenter. So that the form we see in matter issues from a different kind of form, an idea or pattern in the mind of a creator. And so there's a connection between form and. If you think of an idea as informing information. And I think in modern, in modern engineering, with the idea of information theory and with other informational concepts, we see there's a similar connection in biology between form and information, that the three dimensional structure of an organism depends upon information that's encoded in DNA, but also information that's encoded 3 dimensionally in other parts of the organism. That's why we get back to that idea of a hierarchical organization of information generating biological form."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":1982.07,"end":2007.95,"speaker":"Jonathan Pageau","text":"But even in the recognition of the being. So you have apples, let's say you have a bunch of apples. Every single one of those apples is different. None of those apples are exactly the same. So how do I recognize identity across variation? Because they're all different. And so there has to be a pattern that links them together that makes it possible for me to recognize the, the, the, the fact that they all participated in a."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":2008.75,"end":2018.27,"speaker":"Stephen Meyer","text":"Right, exactly. And so that's a very mysterious epistemologies. Well, how do we recognize universals among all the different particular manifestations of those universals?"}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":2018.83,"end":2020.31,"speaker":"Jonathan Pageau","text":"But, and that seems to be something."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":2020.31,"end":2021.31,"speaker":"Stephen Meyer","text":"We seem to be able to do it."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":2021.31,"end":2121.93,"speaker":"Jonathan Pageau","text":"Yeah, I mean humans seem to be particularly good at that. And you know, and that seems to place them in a particular position. You know, and sometimes I'll hear. It's interesting because sometimes I'll hear some people say Something like atheists will say, well, humans are the universe knowing itself, right? It's like, yeah, humans are the universe knowing itself. It means that the universe is intelligent because we're intelligent. I don't know what to say. It's like we are part of the universe and we're the place where intelligence, you know, let's say intelligence finds its highest form that we know of, that we know of in the created world. And therefore the universe is intelligent because it's like. It's like if I take your body and I say, well, you're not intelligent because your fingernail's not intelligent and your thumb's not intelligent and your, you know, your, your ear is not intelligent, but Stephen Meyer is intelligent. And so that's the same with the universe, right? It's like the universe is intelligent because we're intelligent. I know that that might, I know that that might convince a bunch of atheists, but it just seems like there's a way in which often I've noticed that atheists tend to abstract themselves from the, from the reality and not consider the place of man in the cosmos. Whereas like in, in the biblical cosmology, you know, the human is placed in a very particular place in the middle of the whole system and is given to name the animals, like is given to continue that process of information that happens in creation. And therefore it is in some ways the place of knowledge in the world is, is the human person. Anyways, that's a bit taking you off track there."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":2122.41,"end":2170.17,"speaker":"Stephen Meyer","text":"It reminds me of the book that was published a few years ago by Thomas Nagel, very famous atheist philosopher of science, who had come to be very skeptical of Darwinian evolution and also origin of life research, Origin of life, chemical evolutionary theory of the origin of the first life. And he wrote a book called Mind and Cosmos titled how the Neo Darwinian Materialist View of Reality Is Almost Certainly False. And so he was, and a big part of his argument was that any theory of origins that can't account for mind is missing something really big. And the neo Darwinian theory of biological origins cannot account for mind, and therefore it's missing something really big."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":2171.21,"end":2182.65,"speaker":"Jonathan Pageau","text":"Especially because it's because of mind that we even have those evolutionary theories in the first place. It's like there's a meta question that no one is looking at, which is that without mind, you don't even have your evolutionary theory, folks."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":2182.65,"end":2249.3,"speaker":"Stephen Meyer","text":"Well, and there's another cut on this that I think is relevant to argument that we've developed, and that is that that the evolutionary explanation for the origin of animal body plans, the origin of new forms of life, the origin of the first life, is always rendered as a strictly materialistic theory that does not have any place for it, no place in it for mind. And that is not because there's no evidence of mind in the natural world, or no evidence of mind having acted in the past in the natural world. But rather it's a methodological choice, It's a choice of method from the outset. And there's actually a principle that evolutionary biologists affirm, as do many scientists today. And they say that if you're going to be a scientist, you must limit yourself to strictly materialistic explanations for everything, even the origin of life, the origin of the universe, the origin of consciousness, the nature of consciousness as they write."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":2249.3,"end":2250.38,"speaker":"Jonathan Pageau","text":"It in a book, which is."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":2250.38,"end":2424.53,"speaker":"Stephen Meyer","text":"Well, the principle is so common that it has a name. It's called methodological naturalism or methodological materialism. And part of what we're challenging in our work on intelligent design is that principle, the idea that that should be normative for science. It wasn't normative during the period of the scientific revolution. You found that Kepler, Boyle, Newton and many others made design arguments right in the context of their scientific work. They saw evidence of design in nature and they talked about it and they made arguments about why what they saw was best explained by a designing intelligence. That move, that inference has been ruled out of court since the late 19th century, but in post Darwinian evolutionary biology. But that means, and this was, this was, you know, part of the Nagel concern. That means we're putting blinders on ourselves as scientists and philosophers. We're saying here no design. See, no design. Even if there's very evident, if there's powerful evidence of design. And, and so the, the question I think for the scientific atheists is is what what best explains? Open ended question. What best explains? Not what materialistic explanation best explains what, but what explanation best explains things like the fine tuning, things like the circuitry in cells, things like the, the, the, the digital code in DNA, things like the whole information processing system in life, things like the circuitry that we find controlling animal development. These are features which in any other realm of experience would immediately awaken an awareness of the activity of a mind antecedently in the past. So if you find, I could show you a wonderful picture of the, the circuitry that controls animal development. It's called a developmental gene regulatory network. When the scientists at Caltech map this out, the way that genes and gene products interacted to control the way cell Division occurred, and the way different gene products were expressed at different times as the organism was going through cell division, from 1 to 2 to 4 to 8 to 16, et cetera. They mapped out these relationships between the genes and the gene products, controlling the expression of genes at just the right time, in just the right place, in just the right cells and cell types. They mapped it out. It looked like a circuit, like an integrated circuit, only it wasn't a circuit controlling the flow of electricity as much as it was controlling the flow of information. Look at that. And you look at that. And then they discovered something else that the circuits, the molecules that are part of this system, the system cannot be perturbed without shutting down animal development."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":2424.93,"end":2425.73,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":2425.81,"end":2498.24,"speaker":"Stephen Meyer","text":"Developmental gene regulatory networks are immutable, essentially immutable. A little bit around the margins, but very little. Which means that if you want to get a new animal form from an old animal form, you've got to change the developmental gene regulatory network. But that's the one thing we know empirically you can't do. And so this presents a fundamental challenge to all forms of evolutionary theory as theories of the origin of new body plans, what has to be explained, the origin of life. And yet we look at that circuit and we say, wait, I've seen that before. I've seen systems that have that characteristic, and they're always the product of engineers. So we're looking at a feature which in any other realm of experience would immediately trigger the awareness of an activity of a mind. We're also looking at a system that poses a fundamental impediment to the adequacy of evolutionary theories for the origin of major innovation in the history of life, the origin of body plans. So you've got one paradigm failing, and we've got evidence that very powerfully points in a design direction. It's time to consider that maybe mind ought to be part of our theories of origin again. Yeah."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":2498.4,"end":2548.05,"speaker":"Jonathan Pageau","text":"Have you dealt with some of the panpsychists ideas? You know, because that seems to also be a way to answer, you know, I had discussion with Bernardo Castro and a few other people that posit the notion of mind as, you know, he, you know, even being close to, even being an idealist, where basically he encapsulates all of. All of materiality within mind in order to account for that. That problem. But what's interesting about people like Castrop and a lot of the panpsychists is that they don't necessarily attribute mind in the way that, let's say a Christian or a monotheist Would as a transcendent absolute origin of all patterns, let's say, but rather as this kind of amorphous, you know, this amorphous thing that is there, that is part of the material."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":2548.05,"end":2733.32,"speaker":"Stephen Meyer","text":"World and is co. Extensive with matter and all matter, even what Newton called brute matter, you know, atoms and molecules and. Yeah, and, and so there are a number of things to say about that. I, I address it in my most recent book, Return of the God Hypothesis. It Panpsychism first of all doesn't do a very good job of explaining the evidence of design we have from the very beginning of the universe. Those fine tuning parameters are set right from the beginning and they seem to require a causal, an antecedent cause which is not the universe, but which can explain the structure of the universe as a whole from the beginning. So if the mind that the panpsychists affirm is coextensive with matter, you find this also in pantheism. You've got a little bit of a problem because you need a cause that is sufficient to produce the effect in question. And the cause must be in some way separate from the effect. And they want to invest all of mind in the materiality of the physical universe. And yet the nature of the evidence of design, the evidence of mind we have is present from the beginning and seems to require something outside the system to explain its origin. Secondly, I would say that that investing mind in, in inanimate objects does not really pass the test of experience. We know of minds because of our internal self conscious awareness of our, our own powers as agents. We have, we have introspective awareness of our minds and we therefore know something about what they can do. To impute those same powers to, to a table or to a rock seems to be a stretch. I don't think we have good reason to, to believe that, that those entities have, have minds. Now you might want to say that there's a mind behind quantum mechanical phenomena. But I again, I think that takes you in the direction of a transcendent mind, not in the direction of saying that there's, there's a mind in every particle or in every, every immaterial object. There's something. When we think of mind and we want to invoke mind, we're invoking it based on our own introspective awareness of what it means to have a mind. We, we have an awareness of what a mind is because of our, our being, our being minds and using minds. And that's what we really mean by mind. So we end up equivocating when we want to say a rock or a planet has a mind as well."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":2733.96,"end":2787,"speaker":"Jonathan Pageau","text":"I mean, that's intuitively obviously that, that makes sense to me also because we, we kind of understand mind as a, as an active constraint over, over materiality. It's like that's how we actually experience mind as being. And so, for example, Bernardo Castro's theory is wild, but it's an interesting provocation to that idea, is that his idea is that all of the world is actually a form of dissociation. He almost sees it as a kind of disease. It's almost like a Gnostic way of thinking where there's this unitary mind and then it starts to break apart and that all the aspects of the world are actually a form of dissociation and lack of memory, you could say, of being part of the original mind. And that's why they perceive themselves or they exist independently from, from the original mind. And so it's a, it's a. I find it to be a very dark."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":2787.48,"end":2789.72,"speaker":"Stephen Meyer","text":"I'd say the panpsychists are getting warm."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":2789.96,"end":2791.16,"speaker":"Jonathan Pageau","text":"Yeah, that's right."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":2791.8,"end":2815.32,"speaker":"Stephen Meyer","text":"They've moved from the simplistic materialism that has dominated science, philosophy and the academy and much of culture for the last 100 years. And they're saying no, there's, there's a third fundamental reality. There's matter, there's energy. What in science, I think people are coming to is there's a third fundamental reality in the sense that there's mind or sorry, there's, there's, there's, there's matter, there's energy and there's information."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":2815.4,"end":2816.2,"speaker":"Jonathan Pageau","text":"Information, yeah."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":2816.2,"end":2882.04,"speaker":"Stephen Meyer","text":"I've heard what we know from our experience, which is the basis of all scientific reasoning, is that information always comes from a mind. That's right. And, and then I think you get into a more philosophical discussion with Pan, Panentheists, Panpsychists and others want to say that mind is, is fundamental or a fundamental reality, or straight up idealists who want to deny the materiality of the world. And I think there, the Judeo Christian worldview has the balance, right? That matter and energy are real, space and time are real, but so is information. In the beginning, after all, was the word this idea biblically, even when you were talking about the Genesis account again, stipulating theory of intelligent design is not based on a reading of Genesis. But it is interesting to me as a person who's both an intelligent design theorist and also a religious believer, that the biblical text in the creation account repeatedly says, affirms that and God said the Agent of creation is the word, it is information."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":2882.36,"end":2909.51,"speaker":"Jonathan Pageau","text":"Not just that, it's more than that. Because God says, God's. God sees and God evaluates. That's what he does during all of Genesis 1. So that's what mind is. Mind is basically giving a pattern of constraint, right. And then let's say calling that the multiplicity into that constraint and evaluating the distance between the participation and the constraint. Like that's how we live. That's how all our lives are made."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":2909.51,"end":2921.53,"speaker":"Stephen Meyer","text":"Interesting, Jonathan. Yeah, he's taking. He's taking stock of information, or he's taking in information to take stock of a situation and then acts accordingly by."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":2921.53,"end":2932.29,"speaker":"Jonathan Pageau","text":"Imparting new information, by evaluating, saying that it is good. It's like, you know, naming, evaluating and then judging. It's like that's actually. That is the greatest way of understanding mind. And I think like you said, you."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":2932.29,"end":2948.22,"speaker":"Stephen Meyer","text":"Know, simplistic story that can be read at a very simple level. But there's some. There are very profound things going on there from the standpoint of. Oh yeah, philosophy, engineering, science, epistemology. Yeah, very interesting."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":2948.22,"end":2981.63,"speaker":"Jonathan Pageau","text":"Yeah, I definitely think that Genesis 1 is the best account of the origin of the world. It just happens to not be a scientific account. It's an account of the origin of the world in meaning and how mind and meaning are the source of reality. And then everything else is downstream from that, from that description. But I was wanted to say, based on what you said of the. The kind of materialist scientists, when I hear them saying something like there's energy, matter and information, it's like my mind is just flaring up. Because like you said, information is active constraint."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":2982.11,"end":2982.47,"speaker":"Stephen Meyer","text":"Yes."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":2982.47,"end":2983.67,"speaker":"Jonathan Pageau","text":"You know, and so if you don't."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":2983.67,"end":2987.23,"speaker":"Stephen Meyer","text":"If you don't like, where does the constraint come from? It begs the most important."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":2987.71,"end":2989.99,"speaker":"Jonathan Pageau","text":"Yeah, you're right there. Like you're right next to it."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":2989.99,"end":3090.44,"speaker":"Stephen Meyer","text":"If you don't like, it elicits the most important question. Right? And see, in the 19th century, late 19th century, there was the assumption you could understand everything by reference to matter and energy operating within space and time. And we've realized late 20th century, neither in biology, nor in physics, nor in other fields can you understand what's going on. But especially not in biology can you understand what's going on apart from a third fundamental entity, and that is information. And you're right, information implies, logically, it implies a constraining agent. But empirically, we know from our experience that information always comes from an intelligent source. Even by the way, Jonathan, in these origin of life experiments, I don't Know if you've seen any of the, the videos online of James Tour, the organic chemist from Rice University. He's been critiquing these guys who do what are called prebiotic simulation experiments. They're trying to simulate how the first cell could have arisen from some kind of prebiotic environment through a series of undirected chemical interactions or reactions. What Tour shows, and which many people working in origin of life research actually know, but don't want to lead with, is that at each step along the way, to get the chemicals, the simple chemicals, to move in the direction of more complex and biologically relevant chemistry, constraints have to be applied from outside the system by the prebiotic simulator himself."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":3090.44,"end":3101,"speaker":"Jonathan Pageau","text":"I know, I know, that's hilarious. Even if they get to it, even if they would actually do it, it means that they've completely constrained everything to be exactly in the right place for it to happen. It's hilarious."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":3101.16,"end":3248.84,"speaker":"Stephen Meyer","text":"So here's a big question, okay. If these experiments are simulation experiments, what's being simulated? If at every step along the way you need intelligence agent to restrict degrees of chemical freedom to move in a life relevant direction, what are you simulating? Must have occurred on the early Earth. Yeah, yeah, the same thing. Right. You must. There must have been intelligence playing a role. So even the prebiotic simulation experiments of the chemical evolutionary theorists are inadvertently reaffirming the principle that it takes intelligence to generate information, because every one of those constraints can be rendered as a quantifiable input of information. And in fact, it even gets more specific than that. There are experiments called ribozyme engineering experiments where there's a particular origin of life theory called the RNA world, where the idea is that the first molecule was an RNA world that stored information and could also act as a catalyst of some kind, kind of, but not really like a protein. That's the theory. And so there are experiments trying to develop RNA molecules that have the capacity to copy themselves, but to build RNA molecules that have even a limited capacity to copy themselves. And the best we've been able to do in the lab is get about a molecule that could copy about 10% of itself, the ribozyme engineer has to literally engineer the sequence of letters on the RNA molecule, the nucleotide bases, in a very specific way to get a molecule that has this limited self replicating capability. So yes, now you have a molecule that can partially replicate itself, which is therefore a little bit more possibly life relevant down the road. It's just one step along the way, along the way of many that will be needed. But at least it's going in the right direction. But how did you get that? How did you accomplish that step? An intelligent Ribozyme engineer, I kid you not. That's what they're called. Input information into the RNA molecule in order to, to, to, to move it in that life, life friendly, life tropic direction. So what are you simulating? You're simulating the need for intelligence to generate information. The very thing that intelligent design advocates have been saying is the basis of our design inference, that we know you need to get information, you need a mind. Since there is information present in the cell, there must have been a mind active."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":3249.08,"end":3301.6,"speaker":"Jonathan Pageau","text":"Yeah, I think that, that your example is an amazing example of what I often seem to be the problem at the outset, which is the scientists ignoring their place in the system and acting as if they're just transparent. These weird, transparent, I don't know what exactly, or like kind of these disincarnated gods that are, that are just doing these experiments, when in fact the very, even the very act of looking and constraining even the experiment itself is already an act of constraint, like the limiting of phenomena to one phenomena that I will isolate and identify and analyze. Then the capacity to write that in a book and to tell other people about it and to then, you know, like educate others. Like everything you're doing is in mind and you're telling me that mind is an illusion as you're using mind to do all the things that you're doing to tell me mind is an illusion."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":3301.68,"end":3361.21,"speaker":"Stephen Meyer","text":"This happens in the simulation of the origin of the, or the, the modeling of the origin of the universe by physicists called quantum cosmologists. They end up postulating a pre existing mathematical state out of which matter somehow arose. But even with the, the equations that they postulate, they have to manipulate them to get an answer that will indicate that our universe is possible. So the manipulation of the mathematical apparatus involves an imparting of information that's coming from the minds of the physicists. The chemical evolutionary theorists do it and forget that they are the man behind the curtain doing all the important constraints of the chemistry to get things to move in the right direction. Every attempt to explain the origin of, of interesting aspects of our physical universe apart from intelligence, ends up inadvertently reaffirming the importance of intelligence and the origin of those features."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":3362.25,"end":3381.49,"speaker":"Jonathan Pageau","text":"And so you've seen, I mean I've seen this shift in perception, the shift in the capacity for people to consider this theory. You see that in the amount of attention that you've been able to get in the past few years, which I imagine to some ways is that to be on Joe Rogan must have been a surprise. Like I imagine that was a surprise."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":3381.49,"end":3397.41,"speaker":"Stephen Meyer","text":"Yeah, very much so. It's kind of funny in the aftermath of it though, Jonathan. I, you know, I, I did do a PhD at a well known university and I've written three books and I've been part of this. You know, I've, I've accomplished a few things in my life."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":3397.49,"end":3397.97,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":3397.97,"end":3404.85,"speaker":"Stephen Meyer","text":"But when I get introduced now on the podium for a talk, the only thing that gets mentioned is that. And he was on the Joe Rogan experience."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":3404.93,"end":3405.81,"speaker":"Jonathan Pageau","text":"That's hilarious."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":3405.81,"end":3409.22,"speaker":"Stephen Meyer","text":"Like everything else I've done in my life is of."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":3409.22,"end":3415.18,"speaker":"Jonathan Pageau","text":"No, it was all leading up to Joe Rogan, you know that. And now soon you'll be like weightlifting and UFC fighting or something."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":3415.5,"end":3416.62,"speaker":"Stephen Meyer","text":"Well, right, right."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":3417.02,"end":3419.7,"speaker":"Jonathan Pageau","text":"So what's happened, like, what do you think's happened in the culture?"}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":3419.7,"end":3492.72,"speaker":"Stephen Meyer","text":"I, I think the media interest is, is really just a, a symptom, if you will. It's a manifestation of something deeper that's going on and that is that the kind of arguments that we've been discussing are starting to percolate and there's a number of. I had, I had another media encounter that illustrates this a little bit. I was, I did a conversation with Peter Robinson, who at the Hoover Institute, who has that wonderful program Uncommon Knowledge. Peter wrote the famous Mr. Gorbachev tear down this wall speech, Reagan and in 1987, and he did a, an interview with David Berlinski, David Galeranter, the chairman of the Yale Computer Science department, and me about the mathematical problems facing Neo Darwinian theory. And it's a pretty heady topic, you know, because we got into the math and we described the problem of combinatorial sequence space and the rarity of genes and proteins and in, in sequence space and why this poses a problem for Neo Darwinism. We got three and a half million views."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":3492.72,"end":3493.84,"speaker":"Jonathan Pageau","text":"Crazy. Yeah."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":3495.12,"end":3623.22,"speaker":"Stephen Meyer","text":"And so, you know, kind of words getting out, something's wrong in the house of Darwin, people are getting the message. At the same time, that was 2019 and there were a lot of angry comments. Three years later I did another three way interview with Peter Robinson, this time with John Lennox, the Oxford mathematician, Michael Behe, one of the most important advocates of the theory of intelligent design, and me. And after the interview dropped, we've had, I don't know, two and a half million views of that so far. After the interview dropped, Peter Robinson called me on the phone and he said, is something changing the dynamics of your Debate. He said, three years ago we got a huge number of views, huge interest, but a lot of people are really angry. And there was a, there are a lot of angry comments. I had people calling me up, warning me off in association with you guys. He said, have you seen the comments this time? He said they're off the chart. Positive people saying, why haven't I heard these arguments before? This is really compelling stuff. This makes this looks like, sounds like sweet reason to me, what's the problem? And so that's just one little snapshot. But we've had high level conversions to intelligent design from people in the science establishment. You may have heard of Gunter Beckley, the very prominent German paleontologist who was the curator of the bicentennial exhibit of the Darwin for celebrating the Origin of Species and Darwin's birth. In 2009, he set up an exhibit with Scales of Justice where he had on one side the book the Origin of Species and on the other side a stack of books about the theory of intelligent design. And then he made the scale contrary to the law of gravity tip in this direction with, with the, the Origin of Species on, on the, on the, on the downside. And then he had a little caption that said the one book that outweighs them all. And apparently some of Gunter's colleagues of Gunter, if you're going to mock the intelligent design people, you better read their books."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":3623.22,"end":3624.06,"speaker":"Jonathan Pageau","text":"He should read them."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":3625.27,"end":3745.56,"speaker":"Stephen Meyer","text":"And he said that was my mistake. And about two months later I got an email from him asking if we could have a phone conversation, but please not to call him at the office, to only call him at home. And he said, I want to come out and talk to you guys because I realize you've been very unfairly maligned. There's a lot of solid science in your work and your arguments are very compelling. And he set out to have a deep think about the whole issue. And seven years later, in 2016, he announces that he now also, he, he, he, he had already begun to express skepticism about Neo Darwinism in the immediate wake of reading our stuff, but he had a deep think about all this. And in 16, seven years later, he announced that he was now a proponent of the theory of Intelligent design. He's doing active research on a problem in paleontology called the waiting times problem, and, and is advancing Intelligent design actively with his scientific research. Galeranter, the chairman of the Yale Computer Science department who sat in that interview about the mathematical challenges to Neo Darwinism, wrote an essay a year or two before in a long review essay in the Claremont Review of Books called Darwin a Fond Farewell that he wrote as a consequence of having read David Berlinski's book the Deniable Darwin and my book Darwin's Doubt, which. Both. Both of which outline this mathematical problem for Neo Darwinism. So, you know, chairman of the Yale Computer Science Department, paleontologist, who's the curator of the Darwin exhibition at the largest natural history museum in Europe. These sorts of people are not supposed to be changing their point of view, but that's what's happening. So when that's taking place at a high level of science, then inevitably things in the culture will start to follow. And, And I think that's part of the reason we're getting some of the media attention that we have."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":3746.36,"end":3822.84,"speaker":"Jonathan Pageau","text":"Yeah, I think there's also a more existential aspect to this because, you know, it's. It's nice and fun to say that the world is meaningless and that, you know, that there's no intelligence and no mind behind the world when everything's going nice and dandy. But I think that Covid put a lot of people into a vice and, and force them to face the problem of meaninglessness in their own life or, or a sense of things falling apart and things. Things not. Not going the way that they thought. Yeah, that's my perception as well, because we've seen quite a bit of. Even like, in terms of. In the orthodox tradition in the U.S. we've seen this huge wave of converts of young men that are. That are coming to church and they're all of one single type, very intelligent, highly educated people that, you know, are realizing that meaninglessness is. Is no joke. Like, it's not that we. We need, we need an anchor and that. And I think that some of that is probably leaking out also. I mean, I think everything you said is right, but there's also a culture of. Of a sense that. That, that. That we need meaning for. For our. Our lives to. To. To have."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":3822.84,"end":3834.32,"speaker":"Stephen Meyer","text":"I. I think that's been a huge factor in the unraveling of the new Atheism has unraveled for a bunch of reasons. There was. Do you know of the author, Justin Brierly in the uk?"}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":3834.32,"end":3835.32,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":3835.32,"end":3869.35,"speaker":"Stephen Meyer","text":"There's this terrific book, the. The Surprising Rediscovery of Belief in God. And it's the story of the, of the way in which. Of the demise of the new Atheism, which was all the rage in 2007 and up until about 15, 2016, then there was a lot of infighting, disagreement about moral and political issues that sort of thing. But also I think this, the, the, the scientific and philosophical arguments started to wear very thin. The new atheists didn't really do a good job of engaging any of the arguments that we've been talking about."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":3869.35,"end":3875.23,"speaker":"Jonathan Pageau","text":"You know, the, because they, most of them don't actually, they don't have an answer argument. They don't understand Dawkins."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":3875.31,"end":3940.25,"speaker":"Stephen Meyer","text":"Yeah, Richard Dawkins himself has acknowledged that nobody knows how life first began, that we don't have a good chemical evolutionary theory of the origin of life. Well then how do you square that with your claim that biology is the study of complicated things that only give the appearance of having been designed for a purpose? If you have a system which clearly is evidencing purpose of behavior, namely even the simplest living cell, and you haven't given, ever given an evolutionary explanation for that, maybe you don't have the goods and maybe, maybe your statement that life only appears to be designed is ungrounded. And so I think the scientific arguments that the new atheists made were thin. I think that was part of the reason. But another facet of this is that the new atheists have nothing to offer by way of personal meaning. That's just, that's just inherent in the worldview and it's not. If it's true that God does not exist and that science shows that, well then we have to face that like good existential troopers."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":3940.57,"end":3968.57,"speaker":"Jonathan Pageau","text":"But, yeah, but, and you can see it downstream because now you have some of the, the really prominent uatheists arguing for female penises. And it's like, how, what happened? Like, okay, how did we get, how did we get. You know, there's a sense in which the, the, a lot of the crazy political stuff, you know, became the place where people put their meaning in and like a, a kind of fervor towards purpose in the political sphere. But that is not particular."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":3968.73,"end":4076.17,"speaker":"Stephen Meyer","text":"That's interesting. You can say, well, we, we don't need meaning. And well, we may need it, we may want it, but we just have to face the fact that the universe doesn't have any meaning because there's no person behind the universe to give it meaning after all. And this is, I think both the new atheists and I agree, meaning is derivative of personhood. Nothing can mean anything to a, to a, a rock or a planet or an atom. Things only mean things to persons. And if, if the universe does not have a personal source and at the end of the universe we're going to have a heat death and there will be no more persons, then there is no possibility of ultimate meaning in, in for human existence. And I, I think that prospect actually has, as that has settled in for many people, it's had a kind of jarring impact metaphysically. So you have a figure like Ayaan Hirciali, who was one of the leading New Atheists, who has now announced her conversion to Christianity. And one of the factors that she cites is that the new atheism had absolutely nothing to offer in for those or for what Viktor Frankl called man's search for meaning. There was, there's nothing there. So I, I think it's a combination of factors as to why it's unraveling. I think the theistic worldview makes better sense intellectually. It provides a better explanation for the origin of the universe, the origin of life, the nature of, of human consciousness. I think it provides the only real grounding for epistemology, our ability to know and, but it also, it also provides a basis for meaning. Yeah."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":4076.17,"end":4095.73,"speaker":"Jonathan Pageau","text":"I mean, because it, you need, you also need like a vertical integration. And this is, I think this is one of the problems that all these theories of complexity are struggling with is that they just want to talk about emergent qualities and emergent phenomena, but they just have no way to account for the jumps in qualities between the different levels of, of being."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":4096.05,"end":4105.49,"speaker":"Stephen Meyer","text":"That's really well said. Emergentism is, is, is word salad. You just, you just name the effect its own cause."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":4105.49,"end":4107.57,"speaker":"Jonathan Pageau","text":"Yeah. David Bentley Hart said, just put the word magic."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":4107.65,"end":4138.14,"speaker":"Stephen Meyer","text":"We have. Where did mine come from? It came from emergent mental properties. You know, okay, there's something qualitatively different between the mental experience that you and I are having, the mental experiences that we're having right now. My seeing that, that gold medallion behind you and the, the chemistry that's going on in my, in my synapses, those are qualitatively different. And saying that there's. The mind is emergent off of that just renames the mystery."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":4138.22,"end":4151.04,"speaker":"Jonathan Pageau","text":"Yeah, exactly. Yeah. That's what David Bentley Hart said. Just put the word magic. It's like, just use magic because that's what it is. It's just basically saying, I don't know what this is. I'm just going to give it a name so I don't have to deal with it. And then, and then, and then pretend like you're actually."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":4151.2,"end":4154.88,"speaker":"Stephen Meyer","text":"To be fair, to be fair, we theists don't know what mind is either."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":4154.96,"end":4155.4,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":4155.4,"end":4315.1,"speaker":"Stephen Meyer","text":"But we have experience of it as possessors of minds. But what we know and do not discount is that mind is a Reality. This was Thomas Nagel's huge point. You cannot simply write mind out of the cosmos. It's a reality. And we also know that there are some things that minds can do that matter cannot do. And what we see in the physical universe and in the biological realm in particular are features of those systems that we know from experience only minds produce. And so if you reason that back to the beginning, you realize there must have been a mind at the beginning to give rise to those features that we see in the physical world and in the biological realm. And therefore, if you go back to that basic metaphysical choice between mentalism or mind first versus matter first, the mind first view makes a lot more sense. Yeah, there's one of the great 19th century scientists and probably the often ranked as the third greatest physicist of all time. James Clark Maxwell, turns out was a staunch critic of Darwin. He's 1870s in the heyday of his powers as a physicist. He helps to found the Cavendish Laboratory in Cambridge. He gets it in. He has it inscribed with a verse from the Psalms. Great are the works of the Lord sought out by all who take pleasure therein. He is a devout Presbyterian physicist, but he's all, he's deeply skeptical about the whole Darwinian revolution. And he says the conclusion of design follows inevitably from an application of the laws of logic to the, to the observations of, of the senses. And what does he mean? Well, a law of logic is that we have to have a cause that's sufficient to the effect. So what do we see in. From our, through our senses? We see effects that we know only arise from the activity of minds. Therefore. And since some of those effects go right back to the beginning of the universe, witness the fine tuning discoveries that we were talking about. We see evidence of mind from the very beginning of the universe. And thus we must invoke a transcendent mind to make, to, to explain what we see around us at some level. It's not that hard. It's not that hard. The big metaphysical questions can be resolved by careful thinking. Apply the laws of logic to the observations of the senses."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":4316.14,"end":4336.22,"speaker":"Jonathan Pageau","text":"I think that's a great way to end a conversation. Stephen, thank you so much for, thanks for your work and thanks for all the. And I'm happy to see that people are paying attention and that the arguments are kind of breaking through the secular world. And I hope to see more of that as the time continues."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":4336.38,"end":4401.46,"speaker":"Stephen Meyer","text":"Hey, that's awesome. And one other, one other indicator I think of this shift intellectually is the, the, the amazing amount of young talent we're attracting to our larger movement of scientists and philosophers and historians of science, but also to our summer programs. And so if you have young listeners out there who have aspirations for careers in science or philosophy or related fields, have them direct them to the Discovery Institute website and find out about some of the summer programs. It's an amazing amount of energy. We have a program this summer we're doing in Cambridge for the first time, England. And that to me is one of the most exciting indicators of an intellectual shift. Thomas Kuhn, the great historian of science, said that scientific revolutions occur one funeral at a time. The older generation, well, we'll just encourage retirements, not funerals. But, you know, as, as one generation passes from the scene and the younger generation arises, oftentimes that's when you see people becoming open to new ideas. And I think that's absolutely happening."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":4401.78,"end":4413.46,"speaker":"Jonathan Pageau","text":"That's great. Well, thank you. And everybody. Yeah, check out the, the, check out the summer programs and also look into Stephen's books. And thanks. And hopefully maybe one day we'll have another conversation."}
{"episode_id":"SW - #347 - 2024-07-08 - Stephen Meyer - Where Darwinism Breaks Down","start":4413.94,"end":4415.78,"speaker":"Stephen Meyer","text":"This is great, Jonathan. Thanks for having me."}
