{"episode_id":"SW - #154 - 2021-04-18 - Sir Gawain and The Green Knight - Part 2","start":0.64,"end":1384.32,"speaker":"Jonathan Pageau","text":"So last month, for my Patron Only video, we looked at the beginning of the story of Sir Gawain and the Green Knight. And so this week we're going to look at the second part of the story and go deeper into its analysis. So if you haven't watched the first part of this video, I would say go watch it before you watch this one, or else you will be a little lost. This is Jonathan Peugeot. Welcome to the symbolic world. When we left Sir Gawain in our story, he was now on Christmas Day, one year after he had cut off the head of the Green Knight. And he was now trying to find a castle. And so he prayed that he could find a place to. To hear the mass on Christmas Day. And then he sees this castle at a distance. On arriving at the castle, he's received by the lord of the castle and his lady who is sitting with him and the cast. The lord, of course, accepts to let him stay, but also proposes to him a strange deal. The king says that he is going to go hunting the next day, and at the end of the day he will give him whatever it is that he's able to catch in exchange for whatever it is that Sir Gawain is able to catch at the castle. So, of course, Sir Gawain accepts this deal, not really knowing what he's getting into. And the next day when he wakes up, the king has left and is hunting. And while Zir Gawain is still in his bed, the lady of the castle comes in and come to sit next to his bed. Of course, there she is and she is trying to seduce him. Of course, Sir Gawain is an honorable knight, and so he tries to dodge and to get out of the way, and he tries to avoid refusing her outright, but also, you know, trying to be polite about it, trying to be very courteous, while also not giving in to the temptation. We have to understand that he's in a very difficult situation because if we remember the story of. If we remember the story of Joseph in Egypt, we know that to refuse her outright and to insult her would be dangerous for his own reputation, because then she was. Could accuse him to her husband. Of course, that's not said directly in the story, but we feel in the story that he's in danger. He has to be careful. And so he's able to dodge the seduction. And the lady finally is able to steal a kiss from him before she leaves his room. So when the lord of the mansion arrived, lord of the castle arrives. The lord gives him a venison that he was able to get a doe that he was able to hunt. And Sir Gawain goes up to the knight and kisses him one time. And so, you know, there's a bit of humor. There's a bit of like, okay, you know, this is very strange. No questions asked. And so the next day, the same thing happens again. The lady goes into the room and she tries to seduce him more forcefully, and Sir Gawain avoids it. He gets. She's able to take two kisses from him. And again the knight comes back with, I think it's a boar this time. And the same exchange, two kisses for the boar's head. It happens three times. On the third time, the lady is very insisting and she asks for Gawain to give her some token of his love, some like, love token. And Gawain is avoiding, is avoiding. And finally she wants to offer him something as a token of. Of love. And he refuses until she mentions her girdle. She mentions that she has this very special girdle, a green girdle, that if he wears this girdle, then nothing can harm him. And so Sir Gawain finally gives in and accepts to wear this girdle. When the king arrives, of course, once again, the final thing that he hunted was a fox. And Sir Gawain offers him the three kisses that she was able to steal from him. But he doesn't offer the girdle that night. So then Sir Gawain ends up leaving, leaving the castle, and goes out to find the Green Knight in order to, you know, fulfill his promise of having the Green Knight give a blow at his head. So he searches for the Green Chapel, which is where he was supposed to meet the Green Knight, and arrives at a cave which he realizes is the Green Castle. There he is, and the Green Knight finally does appear, you know, telling him that he needs to get ready to receive his blow. And so Sir Gawain places himself, you know, presents his neck to receive a blow. And twice the Green Knight feigns the blow, hits the ground, misses, and every time, Sir Gohan kind of jumps back, but he accepted to receive one blow. And so he presents his neck again the second time, and then finally the third time, the Green Knight hits towards his neck and stops and just nicks his neck very slightly. And then Gawain gets up, pulls his sword out and said, that's it. You said one blow. You've given your blow. This is it. I'm not going to give in to more of your attacks. And the Green Knight starts to laugh and reveals to him that he is in fact the lord of the castle in disguise. And that the whole thing was a test that he passed. And he said, you passed the test. You were able to pass the test of hospitality by not giving in to the seduction of my wife. But because you refused to give me the girdle, I had to leave my mark on you. I had to leave a little nick on your neck. And so he also reveals that he was sent by Morgan Le Fay, who is a very strange character in Arthurian legend. It kind of very strange witch character who is actually related to King Arthur. And he's, you know, he's. The knight is very jolly and very happy to see that Gawain has succeeded in this test. And he says, why don't you come with us and have dinner with us at the castle. We, I forgot to mention that this is happening on New Year's Day. That is, we are really at this transition between the two years. And so he invites him to come to the castle, but Sir Gawain realizes that he was not completely forthright and. And he goes back to the King Arthur's castle and doesn't agree to stay with the Green Knight. And he is sad, he's sad to realize and he puts the garter on his arm as a kind of sign of his shame. And he goes back to the castle wearing the garter. He tells the story to King Arthur. He tells the story to all the knights and all the knights are very happy to hear that he succeeded, that he's still alive, that he didn't get his head chop off to chopped off. But Sir Gawain is not able to celebrate with them because he carries this secret shame and the secret knowledge that he did not fully succeed in his quest. And so it's a very strange story. It's a very strange story. There's a lot of elements. Now the first thing to point out is very fascinating, just right to the side is that there seems to be a relationship with this Sir Gawain and the Green Knight. And also the story of Frodo who brings the ring to Mordor. All of it seems to be related. Seems very much. Seems like Tolkien was inspiring himself from this, from this story of the Sir Gawain, especially since Tolkien also translated made a version of Sir Gawain in modern English. This idea of the success, but that is mitigated with failure, that there is some failure in his success. This idea of succeeding in your quest but being, let's say, tainted by the success and the quest seems to be related to the story of Tolkien's Lord of the Rings. So let's go through the elements. And as we go through the elements, we can kind of understand what is happening. Now, as I mentioned last time, this is happening during the time of the transition between the old and the new. It is related also to the solstice, related to the end of the year and the beginning of the year. And so the challenge, the very strange challenge that was posed to him by the Green Knight, at least even as it began, was a very strange one because it wasn't the normal challenge. It wasn't a challenge of two knights fighting, saying, fight me. And whoever wins will, you know, will be, will succeed in the challenge. It was saying, you chop my head off, you basically give me a blow and I will give you another blow next year. And so it's kind of a weird upside down challenge, and it launches Sir Gawain into a kind of strange upside down world. And the upside down world is really, though, this world of the margin, it's the world of the end. You can see it because it's happening during the end of the year, the, during the, during Christmas time, which is when the sun is at the, at its lowest at the end of the year and the beginning of the year. So there's this idea of this transition and basically Sir Gawain is going to get his head cut off, right? He cut off the head of the former cycle, he cut the sun off, and now it's his turn to get his head cut off as he inaugurated this new cycle. You know, this is a very, very old, old imagery, imagery that is in ancient, ancient creation myths of gods getting castrated or getting their heads cut off or being dismembered in order to start off the new world. And so this, all of this is related to that. So when Sir Gawain arrives in the world of the stranger, he has to accept hospitality. And so now Sir Gawain is himself a foreigner in a foreign land. And when you are a foreigner in a foreign land, things are very strange. Things are not the same as when you're in your own land. And you see this in scripture, you see this in many stories. And what Sir Gawain faces is a kind of upside down world where instead of him being the knight who, let's say, conquers the lady or the knight who conquers, in terms of hunting, you know, who goes out and hunts the prey, who goes out and defeats the dragon, who goes out and defeats the enemy, he is in a world where he is now the prey, he is being preyed upon by the foreign woman. He's being preyed upon by the foreign queen. And he has to act like a. He has to act like a prey and he has to dodge the attacks. He has to dodge this predator that is trying to get him. And so here is this kind of upside down world where usually the man is the one who courts the lady, the man is the one who's trying to conquer the lady who. But in this situation it is now the lady who's trying to conquer him. And he has to kind of avoid it. And so this is. And the contrast is, it's important to show. Whereas he's a host in the castle of the foreigner. The foreigner is the one who's going out and who is hunting and who is conquering, who is gathering the potential of the world and bringing it back to the castle. Whereas Gawain is in this weird upside down world. And upside down is also because, you know, he is the stranger in the house of the king. And now he is, he is the one receiving affection from the queen. And so that is also part of this strange upside down world. And it appears to him as a test because. And it's very interesting, it's very interesting to understand it that way, especially in terms of the notion of the honorable knight to, to he. It is a test of his virtue that he is virtuous even though he is not in his own land. It is the ultimate test of virtue that he is able to remain, to keep his character in that upside down world. In a world where he is not accountable in the same way that he would be accountable in his home, he's able to remain virtuous. Now this is something that we experience all the time. If you've traveled, if you've, if you've gone to places where no one knows you, you understand that you're always in a danger of behaving in a way that is not the type of way you would behave at home. Because no one knows you, you're not accountable to anybody, right? And so you have to guard your heart even more when you're not in your home, when you're not in your family, when you're not in a place where you are accountable for your actions. And so in scripture there are places there, even in stories, there are even some stories where there's a suggestion. When you're in the land of the foreigner, you actually act. You can act upside down because you're not accountable. You can steal, you can take, you can. There's all these stories of Jack and the Beanstalk, for example, of. You know, there are many stories of characters who, when they're in the land of the foreigner, they're somehow acceptable to steal. But here we see in a way the Christian narrative, very, very strong Christian narrat narrative, which is that even in the land of the foreign, even in the land where you're not accountable, you need to be honorable. And you see that in the very gesture of Sir Gawain going out into the foreign land to receive a blow from this monster because of a promise that he had made, he's willing to go out and accept the consequences of his actions. Now, this is really a story of virtue and a story of honor, but there's also a little secret. There's also a. I don't know how to say a secret, or rather there's a mystery in the story because he also, even through guarding his virtue, he realizes, or there's an aspect that he has to take from the foreign world in order to be able to fight the foreign world. And I've talked about this with you guys on as. In order to. In different guises. Through the notion of the inversion festival, through the idea of the gargoyle, through the idea of the garments of skin, the vaccine, all of these images of. Of using death against death or conquering death against death, in order to defend himself from the Green Knight, he actually ends up compromising himself just a little bit. He accepts a little bit of that strange world and it appears to him as a mirror of the situation, which is, first of all, it's a garter, it's a belt, so it's like a margin, it's something that goes around him, but it's also green, which is. It's something of the Green Knight. He should have been. He should have been wise enough to understand that there was something going on when he. When the garter was green. And here he is going to wear this green garter in order to fight off the Green Knight. You know, it's an apotropaic use, and he's using something of the feminine as well. He's using something of the feminine, something of death. That is a weird, a little, let's say, plunging into death somehow. And he's going to then use that against. Against death, against his moment, against the Green Knight. But it is also in some way a compromise that he's making, you know. And so, like I said, it's important to understand that often there are aspects of these tales which aren't Just moral. They're really higher than just morality. They're. They're really showing us a kind of pattern of reality. And so you could see, for example, like if you gave Christ as an example of that, would be that Christ, in seeing that pattern and seeing that he had to take on some aspects of death in order to, let's say, face death, he decided to take it all on while remaining innocent, to take up all of the. All of this, drink all of the salt water, drink all of the chaos, put it, bring it all onto him in a way that transformed everything. And so that would be like a, let's say, the ultimate Christian version of what is happening in this thing. Whereas here it's actually a weakness. He actually compromises. He actually falls. And so in this fall, he. He has. He has the taint of the fall on him, you know, but it's still, nonetheless, through that fall and through this little compromise that he will be able to defeat the Green Knight. But in a way, it remains. How can I say this? It. He ends up being shown that this was not necessary. I've said. I've talked about this before as well, which is that. What is the story that I mentioned, mentioned about this before in my video on Prince Ivan and the Wolf, I talk about this where it is that because Prince Ivan compromises and because he always takes the golden girdle, and he takes the. In that story, he also takes, like, a golden girdle, but it's not around a woman, but it's around a horse. He takes also the cage, the golden cage. He's still gonna get to his goal, but he's gonna suffer, be, you know, going through his goal. And so here, if he hadn't compromised and taken the girdle, he. He would have succeeded completely. The. The knight would not have even nicked him. But even the. So he compromises, he falls. But even through the fall, he's going to get through the end nonetheless. He's just going to suffer doing it. It's going to be a longer process and a more painful process. Think about it and think about it in Catholic terms, in terms of, like, going through purgatory. Like, he had to go through purgatory. You know, it worked. He got that. He got to heaven or whatever, but he had to go through purgatory. And so this is what's happening in this. This place. And so he reads the Green Knight, and then he has to have some temporal punishment. He has to have some mark on him that will signify that he. That he wasn't completely successful. But what's interesting about it is how the garter then becomes a marker of his glory nonetheless, because he puts it on his arm and for him it's a mark of shame. And he wears it as a mark of shame, but it ends up in the vision of everybody else being a marker of his glory. And you can understand this. It seems like this was also related, this idea of transforming shame into glory or, you know, transforming death into glory, once again is related. This story seems to be related to the Order of the Garter in terms of the. It seems to have been written at the same time as the foundation of the Order of the Garter. For those who don't know what the Order of the Garter is, it is an order in England, the highest chivalrous order in England, the Order of Knights in England. And the symbolism of this order is a garter, it's a belt. And the legend about how the Order of the Garter was founded was that King Henry iii, he was dancing with his niece, who was young and beautiful. And while they were dancing, she dropped her garter, like her garter fell to the ground. And it was a moment of shame in many ways. It was a moment of shame for her to drop her garter, right? It was a moment of shame for both of them because there was something suggestive about the situation. People might have thought that it was suggesting some improper relationship between both of them. And so instead of trying to hide it, instead of trying to pretend it didn't happen, King Henry took the garter and put it up. And I think he puts it on his head or puts around his neck, or he puts it on his sword or something and brings it up and kind of brings it up above and then says loudly to everybody to hear that is shame to those who think ill of what is happening, shame to those who. Who think evil of what is going on. And so he takes the moment of shame and flips it in order to shame the others. And then the Order of the Garter itself becomes an image of the knight's glory. And so it. Then, if you look at people who are in the Order of the Garter today, they wear the garter as a kind of metal. It's like a kind of. It's a kind of image of their glory. And it also seems to be related because the patron of the Order of The garter is St. George. And so there it also seems to be related to the garter by which St George tamed the dragon. In certain versions of the story, because I told you before, there are some versions of the story where St. George kills the dragon, but there are some versions of the story in which St. George tames the dragon. And this seems to be related to that. Once again, using death against death, once again, you know, using a certain aspect of our passion against our passions. And ultimately you could say it's also, in a way, the image of Gawain, who was able to also tame his dragon, that is through the situation with the wife of the noble. He was in a situation where it was actually more dangerous for him to resist the lady. He could have given in and then just left the castle. Nobody would have known. Whereas now he was more in danger by resisting her because she could have accused him. And so he ended up nonetheless taming his passion. And by accepting the garter, he's also protecting himself against her. Because it's a way to say, okay, I'm going to give in. I give in to these little things that, that you're proposing so that I don't give in to the bigger thing and actually end up sinning. And so all of this is going on in the story. It's obviously, I'm just kind of skimming the surface. It's a very, very powerful and very deep story. But I hope that this, these little tidbits have given you some insight into the story and, and yeah, so I hope you've enjoyed it and I'm really enjoying going into these stories. I'm probably going to go into more for my future patron only video. And once again, I want to thank you for your support and you know, it's really, I'm really happy, I'm really excited to continue doing all of what I'm doing and as I move into my house next month, I hope, hopefully the, the regularity of the videos will be more. Thanks everybody and I'll talk to you very soon."}
{"episode_id":"SW - #154 - 2021-04-18 - Sir Gawain and The Green Knight - Part 2","start":1385.57,"end":1407.81,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion."}
{"episode_id":"SW - #154 - 2021-04-18 - Sir Gawain and The Green Knight - Part 2","start":1407.89,"end":1409.09,"speaker":"Jonathan Pageau","text":"I will put a link to that."}
{"episode_id":"SW - #154 - 2021-04-18 - Sir Gawain and The Green Knight - Part 2","start":1409.25,"end":1450.34,"speaker":"Jonathan Pageau","text":"In the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
