{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":0.96,"end":84.06,"speaker":"Jonathan Pageau","text":"On this episode of the Symbolic World podcast, I am playing for you a discussion I had with Greg Hurwitz. Greg Hurwitz is an author, and he's also becoming a political player trying to recast the Democratic Party in the United States as a more centrist party. This discussion with Greg was very interesting for me because it was more political than what I usually get into. And not surprisingly enough, it has been one of my least popular, popular podcast, the one that has had the most negative comments and the most, let's say, thumbs down. Because of course, most people know that I am a. Mostly I am more conservative. I'm a, you know, a conservative Christian icon carver. And so in some ways, I'm a traditionalist. And I think people were surprised to see me discussing so openly with someone who is on the other side of the political spectrum than myself. But I would say that I wanted to put it up as the pod in the podcast nonetheless, because I think these discussions are important to be had. And it is the refusal we have to discuss honestly and openly about our similarities and differences which is bringing us to this situation of what seems to be a rising conflict. And so hopefully you can get something from the discussion and hope you enjoy."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":97.67,"end":121.01,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the Symbolic World. Greg, Maybe you can also give your own introduction to yourself. Maybe tell us a bit about what you've written, about your experience as a writer, and then we'll jump into the storytelling. Great."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":121.01,"end":241.18,"speaker":"Greg Hurwitz","text":"Well, you covered it pretty well. I mean, I write novels. My new series is called Orphan X. I've done movies and tv, and then I worked a lot in comics. My first comic was the Punisher, who's my favorite character for Marvel. I did some Wolverine, I did some Moon Knight. And then I went over to D.C. and wrote Batman for a couple years, which was like the most possible fun you can have. Comics is like that rich kid who lives up the street from you who has all the best toys and play with all those toys. And then the only slight correction I'll make to your introduction is I wasn't actually hired by the party itself to work on this refocusing of what the values are. It was more something that we built outside the party and then figured out how to get the sort of outside resources to show what we were thinking about as a way to express the. Express the first principles of the party. And then we got buy in from the party a little bit later. And a lot of that derived from me feeling like, as Democrats, that it's not so much that President Trump won the election. I feel like we lost this. I feel like we didn't do a good job at all of articulating our fundamental values and standing for the things that matter the most to the most people and getting them effectively conveyed. And so what my approach was, was to take a different focus with the team of compatriots including Callie Corey, who wrote Thelma and Louise, and Marshall herskovitz, who created 30something and wrote the Jack Reacher movies and created My so Called Life, who have. We have sensibilities much more outside of Hollywood for the most part. You know, they. Callie grew up in Kentucky. She wrote Nashville. Marshall ran that with her. Most of my books are big thrillers. I tour in the red states a lot. And so we wanted to do something that came from the outside and re expressed where we thought the party should be."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":242.78,"end":260.6,"speaker":"Jonathan Pageau","text":"Okay, so maybe we could start with that. I'd be happy to make a. Since we already started on that subject, what I'm gonna do is I'm going to play for you this four minute ad which you can find on YouTub. I'm going to play the ad and then I'm going to. We're going to talk about it and see if we can kind of perceive what it is that you're trying to do."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":263.08,"end":359.37,"speaker":"Announcer","text":"We stand for the working men and women, always have and always will. And we define ourselves by what we've done to help them get their shot at the American dream. Social Security, the GI Bill, the Civil Rights Act, Medicare, saving and auto industry. 23 million people with health insurance for the first time in their lives. And all along it was American workers, farmers and factory workers, immigrants and engineers of every color, speaking every language, who were building the highest standard of living the world had ever seen, whose innovations were changing history, whose courage made America a beacon of hope and freedom for those living in tyranny around the world. Working people made America. Then something happened. Some people in Washington took the side of the powerful against American workers. The game got fixed. For an entire generation, income flatlined. Big donors made sure lawmakers cared more about Wall street than your street. Back in the 80s, a CEO made 30 times what his workers made. Now they make 300 times. Since the Great Recession, almost all of the income gains have gone to the top 0.01%, not 1%, 0.01%. Instead of raising your salary, they buy back stock to increase their own bonuses. They merge companies and reduce competition so."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":359.37,"end":360.61,"speaker":"Greg Hurwitz","text":"They can make even more money."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":361.09,"end":413.64,"speaker":"Announcer","text":"All while your cable bill gets bigger, your cell phone bill gets higher, your Internet Gets slower, the seat on your flight gets smaller, their taxes get lower and your health bills get raised. Who's looking out for you? The people in power are so busy giving tax breaks to the wealthiest that they blow up the deficit and leave nothing for roads and bridges, nothing for veterans or Medicare, nothing for job training. Something has to change, and we're going to change it. A new generation of leaders who know what needs to be done and who have the will to stand up to those who would hold us back. We want our America back. The land of decency and fairness, of generous hearts and big dreams, and the freedom for anyone who wants to work hard to make those dreams come true."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":413.88,"end":417.28,"speaker":"Greg Hurwitz","text":"I don't care what your politics are. I don't care what God you pray."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":417.28,"end":419,"speaker":"Announcer","text":"To or what color your skin is."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":419,"end":432.94,"speaker":"Greg Hurwitz","text":"I don't care if you ride a tractor or run a business. And I hope your business is a big success as long as everybody plays by the same rules. The same rules. The same rules. Cause this is America. This is America. This is America."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":433.1,"end":487.08,"speaker":"Announcer","text":"And this is our generation's great calling. To rise to the challenge like those who had the courage before us, to build a future for all Americans, not just the few. To fight for the higher pay. Working people have more than earned. To fight to make health care available to everyone who needs it. To stop those who would try to cut the Social Security and Medicare benefits that are rightfully yours. To protect the environment instead of selling it to the highest bidder. To fight for a government free of corruption, where your representatives work only for you. To build a future that is just and free, full of hope and opportunity. A future our children thank us for leading. Because democracy is built, not bought, by the strong and the free."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":501.16,"end":568.14,"speaker":"Jonathan Pageau","text":"All right, so one of the things that. As I watched the ad a few times and I tried to see it, one of the basic things that I noticed in the ad, which I found interesting is the. You really use. You're using a U shaped story. And it contrasts a little bit with the. Just the kind of general, you know, this general kind of progressive idea. It seems like you're acknowledging some of the strengths of the past. Something, you know, the people and the, you know, the moves that have been made in the United States to make the best of the United States that brought us to where we are today. And then you kind of show this dip where through certain political actions, certain things happened and things started to go awry. And then finally you offer this new solution, this new coming together. And so there's really this kind of u shaped story, which we find, you know, in the Christian story, but you find in all kinds of stories where, you know, this descent into Jordan always talks about this story about like the descent into Hades and then this coming out of the Hades. So maybe you can maybe tell us a bit about how you structured the content in that ad."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":568.78,"end":742.64,"speaker":"Greg Hurwitz","text":"Well, you're precisely right. I mean, that's the aspect where, you know, the Epic of Gilgamesh adheres to the exact same structure as the Terminator. You know, it's a three act structure. That's what we use in screenplays. I also just do want to acknowledge my partner in crime, Marshall Herskovitz, who is very heavily involved in the writing and editing and production of this too. So I don't want to make it sound like this was a solo venture. So, yeah, that is basically the structure is us. One thing that Democrats have not done, because it's more of a conservative trait to honor history. Right. And it's one thing that we thought was really important is to acknowledge the strengths that the party has had in the past and then to talk about things going awry and also to sort of subtly, you know, we don't name Republicans or Democrats in the whole commercial, like the words are never spoken. And so things got off course. And that was overall, that's money in politics and corruption and other problems. And then when we emerge from the other end, it's a very different message. We want to do an ad that really is starting to talk about politics and about the party in ways that people don't usually talk about. So the structure that you've painted is precisely the structure that we wrote. But there's things in there that we feel like have gotten lost in the polarizing aspect. Like if discourse gets polarized, then what happens is both sides entrench and defend the further extremes of their parties. And we wanted to go, hang on a minute. We have to celebrate merit and we have to celebrate excellence and accomplishment. And it's not that Democrats haven't done that in the past, it's that the messaging has ceased to do that. And so when people say, you know, it's a rigged game, it's a rigged game. It's a rig game. We want, you know, income. We want to end income inequality. Well, what's the reverse of that? The reverse of that is income equality. And for people who are working in Congress making $175,000 a year with the world's best healthcare, like that's not what they want for themselves and their kids. And so I Think it's much more important to talk about, for instance, income and justice, meaning, let's figure out how to get the fair rules that are the same for everybody at the starting gate. But if you're an innovator and if you're an entrepreneur and if you work harder, good on you. Go start a second business or open a charity or buy another car. I mean, there has to be a celebration of accomplishment also. And so there's a lot of subtle shifts that we thought that were ways to focus and refocus the messaging of the party towards some values that need to be inherent in the party. And so we use that structure to kind of talk about it. Here's where we were in the past. We celebrate the working people as the hero. They're really the heroes of not just our economy, but the whole increase in world wealth, frankly, is the American worker. And we've sort of gotten away from that and gotten too divisive. And so the end is a big message that's much more unifying."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":742.72,"end":890.5,"speaker":"Jonathan Pageau","text":"Yeah. And so for people who are watching, you can see in the actual structure of the story, you can see at some point, you know, there's this kind of celebration, and then you see an actual wave. Like, you actually show this big wave coming down. And so this flood that comes in. And for those who have been watching my videos, you know, I always talk about how that's how the world is structured. There's this flood at the end of something, and then there has to be a rebirth, and then you have something else. And so then there you have this flood, and then there's this rebirth. And you can see this image of people marching down the road, kind of all together in unison. And one of the things that I noticed, which I'm happy about, is that there is obviously in the Democratic Party, and let's say on the left in general, there is this notion that it's important to celebrate diversity. If we kind of follow Jordan's idea about what the liberals are and what the left, you know, the left side is, then it makes sense that there is this vision that diversity creates opportunities, creates that difference is something which helps us to find new opportunities. And I think that what's interesting and what I think is great is that just in that story where you do show a lot of diversity, different types of people, different types of places in life, you also have things like you celebrate fatherhood in this little clip where you have a father holding up his child. You also don't exclude, let's say, the white man. You know, the white man is part of it. He's part of the diversity. He's part of the story, and he's there in the story. And so I think that, you know, when you see that, I really, at least I felt like there really is this desire to move away from seeing, let's say, diversity as something which opposes, something which wants to take down the system, but rather seeing this coming together under the banner of building, of building a country and doing it together. So I thought it was very successful in doing that. My question I have is this has to do with the power of symbolism, let's say is it seems to me when I watch it, that on the one hand, you're trying to communicate a message of the party, but you're also trying to affect the party itself. You're also trying to message both to the inside and to the outside of what's possible, like, what story is possible to tell. So maybe you can tell us a little bit about that, about the attack."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":891.7,"end":998.24,"speaker":"Greg Hurwitz","text":"That's a very astute observation. One of the things Marshall and I discussed a lot, and also with Callie, was that in a lot of ways, the message is the substance. Do you know what I mean? Like, if you. If we can put something forth that people find compelling, then that can start to become the ways that people discuss things. And I think there's a lot of ways that if Democrats march in the front door and say, I'm for universal healthcare as a right, and I'm for women's right to choose and I'm for gun control, everybody's immediately in a rush. Like, once you start to use buzzwords and ideology, it's like, everyone raise your hand who's on one side of the issue or another. And there's much more interesting and valid ways that we can talk that's more authentic to what our beliefs are, to talk about specific issues. Everything is on the slippery slope, whether we talk about gun control, whether we talk about immigration. And increasingly, the parties have gone to a point where the sentiment that is echoed, everyone's dug in their heels, and it's like, all immigration is bad or all immigration is good. It's like neither of those is correct or valid. And so when you're talking about how we message, I'm really glad you noticed that sort of celebration of diversity as a strength, certainly, but it's also within a unifying message. And for me, you know, there's a section of the video where a series of different people say, I don't care what God you pray to. I Don't care what color your skin is. I don't care if you drive a tractor or own a small business. And sure enough, some people do both of those things. You know, we just want to make sure everyone plays by the same rules. And there has to be unification, even in our diversity. And I think where we really get off course is when we're driven to these extremes by each end of the party and people won't concede any ground. And so it's either that. Anyways."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":998.56,"end":1029.31,"speaker":"Jonathan Pageau","text":"Yeah, I've done a video where I kind of show the two opposites, where I kind of show these two extremes. You have Trump saying, build a wall, and then we have Justin Trudeau saying, diversity is our strength. And it's like those are really the two extremes. If you build a wall and you totally close yourself off, you asphyxiate. But if you just say diversity is our strength and you don't have any appeal to unity, then that's decomposition. It's like that's what decomposing is."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":1029.31,"end":1111.58,"speaker":"Greg Hurwitz","text":"Well, and it alienates a lot of the population. Also, if it's only about diversity, if you get up and rattle off every diverse group and leave out white men, like people are gonna be aware of who isn't named versus if you kind of say, look, this is something that we're all in together. I mean, you know, Jonathan Haidt, who. You've read his work as well. I mean, he puts it so elegantly when he talks about that the role of conservatives is to be protective of an in group in a lot of ways. And that's not some sort of vile instinct. It's very, very helpful to have some concern about, you know, it's an evolutionarily selected trait. If you think about, you know, Native Americans, when Europeans came, like they'd be. It's a wise choice sometimes to be wary of out group and infection and contagion from out groups. It certainly serves a purpose. But as you said, if you build a wall that is too impenetrable, new ideas and people won't get in and will stagnate and die. And any effective society has to be in relation of those two ideas. So we can't have that. Diversity is our only strength. And we also can't have that. We're building an airtight wall in all cases. We can't have no immigration at all or all immigration being good. And so as long as we're entrenched in that for the purposes of political discussion or winning elections, we can't actually get to real solutions. That are gonna matter."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":1112.94,"end":1165.17,"speaker":"Jonathan Pageau","text":"Yeah. And I think that it's funny cause I read, I was, when I watched the ad, I was kind of looking down, I was looking the YouTube comments and I was reading the YouTube comments. Obviously there was a usual just kind of degraded comment. But some of the comments were interesting in the sense that there were literally some people saying, I'm a conservative, I'm a Republican, but if this is the message that Democrats are going to be using, then I'm thankful for that. Because now we can actually have a discussion. Like now we can actually engage in an actual discussion. Because when we fall into these polar opposites, then it's a war. There's no other solution. Like we're going to fight, even if it's just with words, but it's going to be just this constant trying to block the other person and trying to get our people in. And then we're actually not producing anything productive. It only becomes a kind of tribal warfare which doesn't go anywhere."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":1166.13,"end":1348.24,"speaker":"Greg Hurwitz","text":"Yeah. And I think you're right to make that point. So a lot of Republicans are like, hey, we hate corruption too, but guess what, you want to court me, you go first. How are you gonna be not corrupt then? If you want me to cross over and consider your party, your party's not airtight. And so we have to talk a lot about what are the pledges we're gonna make for young candidates to either win back the trust of Democrats who we lost, or to start to have conversations with centrists or Republicans who might be open to that. So we gotta clean up our side of the street. And I think the other thing that's really important is there's this view that progressives tend to take sometimes as if all Republicans or conservatives sort of lack empathy and are delighted in people who can't make their way on a dominance hierarchy. And it's like conservatives care a lot about how we take care. Like there's a lot of people who necessarily will be left out of a dominance hierarchy. To give you one example, 29% of people in the United States right now are valid who are military aged, are valid to make it through into the military. And it's either due to obesity or lack of ability to read or write. There's only 29% of eligible people, which means that we're leaving out 71% of people can't meet a basic standard that's not good for any aspect. Right. There's people who are being sort of left behind that has to do also with protection, drafting security of the country. It also has to do with people who, if you can't get into the military, it's not like other options are piling up at their door either. Conservatives don't like that. You can't take a position that conservatives, all of them, that the only thing that they care about is sort of making money and lacking empathy and leaving people behind. But as long as we are pushing that like they're pushing that, all that Democrats want to do is create a welfare nation and give money to undeserving people. We can't actually have conversations about what the solutions are from both sides and both perspectives. And so there's a lot of people who have a more conservative inclination than I do who are very concerned about people who are left out of dominance hierarchies, whether it's with worker education or building a family. And we can't get to their solutions and their ideas in good faith if we've decided that all of them are morally insignificant and we're spending our time virtue signaling about it. So I'm actually curious, maybe a lot of the concerns that Democrats put forth because we tend to be oriented on the working class and the underdog, because that's part of our proclivity work, but maybe there's a lot of solutions also from conservatives and a lot of conservatives who can find holes in what we're doing and ways to better prove that and make them more effective. And as long as we're busy slinging mud at different approaches and, you know, magically mind reading people's lack of virtue and motives, we can't actually get to those conversations to say, hey, you and I disagree on maybe some of these approaches and policies. But, but how do we actually sit down and talk about how would you want to fix this? Here's my proposal. What are all the things you think are awful and lacking in my proposal? Like, let's have all those discussions."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":1348.56,"end":1401.86,"speaker":"Jonathan Pageau","text":"Yeah. And I think there's also just a. What ends up happening, and we see it is that people, they just stop recognizing each other. They just don't recognize each other. So, you know, I'm not right now, I'm in South Carolina. So I'm in the South, I guess, and I meet people who are Republicans who are really super conservative, you know, and there are some of the most generous, you know, just open and inviting and welcoming people that I've ever met. And so when you, if you give this image of just the good old boy who, you know, is a racist or whatever, then how the people that are Republican and aren't like that. They just say, well, you're not talking about me. I don't know who you're talking about. You're talking about some people. You're talking about something. It's not me. So I'm not. I'm going to stop. I'm going to stop listening to you now because you say you're talking about me, but you're not. And. Sorry."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":1402.18,"end":1403.9,"speaker":"Greg Hurwitz","text":"It's what people do to Jordan. Right?"}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":1403.9,"end":1404.54,"speaker":"Jonathan Pageau","text":"Yeah, that's right."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":1404.54,"end":1411.54,"speaker":"Greg Hurwitz","text":"Like, here's a straw man. That's my version of everything that you think who I will now demolish. Yeah, that's nice, but you ain't talking to me."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":1411.78,"end":1502.65,"speaker":"Jonathan Pageau","text":"Yeah, but it was interesting because it was actually my relationship with Jordan which kind of awakened me to this problem, because, I mean, I've been somewhat aware of this kind of problem of misrepresentation. But then I got to know Jordan and we kind of became friends. And then this hit, this whole scandal. And I was watching the news, and I was listening to the CBC and I was reading online. I thought, who are they talking about? Like, I don't even know who they're talking about. So all of a sudden, I realized just how distorted our narratives have become and how there really is this need to kind of refocus and to find places where we can discuss. And I do appreciate this kind of intellectual, dark web group, you know, even though I don't know how long it's going to actually last. But, you know, I think that for now, it's good to. That you can have someone like, you know, Ben Shapiro talking to Sam Harris, which just seems like an impossible thing to happen there. But you're watching it happen, and you're watching an actual civil discussion between, you know, two very strong opposites, but that are willing to engage honestly with the other person. So that's what. That's definitely what we're all hoping for. At least that's what I want. Yeah. All right, so I want to move then to your storytelling. You know, you mentioned in just when we talked about the ad and you talked about how the Epic of Gilgamesh is the same story as Terminator. Maybe you could go into that a little bit, because I think I see a lot of relationship with your own structure that you use in your own story. So maybe go into that a bit and I'll have some questions about what I read of you until now."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":1503.29,"end":1527.45,"speaker":"Greg Hurwitz","text":"Well, so here's what's a little tricky. It's like, in your work, you're playing so beautifully with Archetypes and icons and symbols. That's overtly what you're doing. And with writing, what's very interesting is I have a story structure kind of embedded in my head. Everybody like, you know, I'm in la, so one of my jokes is I meet tons of people who want to be writers and very few who actually want to write."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":1527.7,"end":1528.02,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":1529.06,"end":1580.3,"speaker":"Greg Hurwitz","text":"And you know, so a lot of people say, oh, I took this course on writing a novel. I took the screenwriting class, I read this book. And part of it is like, if you love books, read a thousand books. You know, if you love screenplays, watch a thousand movies. So that there, there becomes this sort of internal awareness of how things structure. I also, you know, Jordan was my professor. I did a, you know, I did personality psych, I did a Jung seminar with him. He was my thesis advisor. I did Freudian and Jungian analysis of Shakespearean narrative. You know, my contention is Shakespeare was a great thriller writer. If you get to the tragedies in that. He was, you know, highly convention bound, highly structured tales of lust, intrigue and murder designed to appeal to the broadest possible cross section of society. And he was interested in putting butts in chairs and selling out the Globe Theater. You know, he was, he was also commercial."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":1580.46,"end":1581.74,"speaker":"Jonathan Pageau","text":"That's right, he was. Yeah."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":1582.06,"end":1713.52,"speaker":"Greg Hurwitz","text":"And so, so I have a really strong grasp of the hero's journey. But if I sit down to write a book that is. And it's one of my criticisms of people who take too many courses. And when you take a lot of classes and read a lot of books, what they tend to teach is structure because structure can be taught. What can be taught is dialogue because it's different every single time out. And those character moments that really make you engage with somebody, that's really your ability to see the world as an artist and figure out what, what are those little tells of character that make you fall in love with somebody. So structurally it's very important to have that understanding and then sort of forget it almost and then to embark on a very specific, from the ground up level of here's a guy who's doing a thing in a situation that's a moral dilemma. So then you start to build it that way. So I always have this sort of lingering notions of what the hero's myth is. Books will, you know, thrillers will always have a structure that you're starting out. There's a mystery or intrigue at some point in the middle there's a big depth. Like you talked about, that U shaped story structure. And Then in the end, there's something emergent that creates order out of chaos, like the post flood. Right. And so I'm very aware of that. And I will play with imagery that's even overt sometimes. Like, during that descent, I will sometimes play around with, you know, underworld imagery, like it's the Odyssey or the Iliad. Right. But it's very important to also make things very, very specific to character and. Because people don't want to just read a fleshed archetypal, you know, and you can see it a lot with kind of cop movies and genre things that get very by the numbers and they'll still function well even though they're by the numbers. I mean, so we all know the story, right? It's like the cop and he's on a stakeout with his young friend and, you know, his young partner who gets shot, and then it's personal. Or the cop whose wife and kids get killed, and then it's personal. There are certain structures that are so pleasing that even if the execution is middling, it's sort of pinging that little pleasure center in our brain for revenge or order or, you know, masculine strength. But you don't want to resort to that too fully. And things that are better take those archetypes and sort of transcend them and making them more specific and personal."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":1714.56,"end":1784.01,"speaker":"Jonathan Pageau","text":"Yeah, I think. I think that the way that. Like the way that I talk about it in my videos and the way my brother talks about it in his book is really this idea. You could call it like a meeting of heaven and earth where you. You have a pure pattern, like a pure spiritual essence or however you want to call it. And then you have the world of particularity and they have to join together, like they have to meet together. And you can't. You can't. If you sacrifice one for the other, then you have. You end up with something which is lacking, which. Either. Which either lacks the capacity to create empathy that you talked about. If it's too abstract and it's too. It's too much of a. Just a pattern, or else it lacks the. The capacity to make you kind of. To give you a vision of the world, which is what the pattern is able to do, is able to kind of make you feel like this is meaningful. Like it's not just a bunch of things that happen to someone. Like, there's this. Even though you could have a really amazing character, it's like. I mean, some people like reading Proust. I can't read Proust. You know, like, there's Some types of literature that we've seen that will never appeal to a large audience because it's not showing them, giving them this sense of meaning in their, in their life. Sorry. If you like Proust, I didn't want to knock him. If you like him."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":1784.09,"end":1790.01,"speaker":"Greg Hurwitz","text":"Yeah, for me it's Derridon Foucault who I just find deadeningly dull. You can't read."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":1790.01,"end":1790.57,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":1790.57,"end":1800.89,"speaker":"Greg Hurwitz","text":"But you know what's interesting is when you're writing, a lot of the same rules apply. You know how when you're looking back, you can see structure and areas of interest that you don't know. If you're just pursuing things that are of interest."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":1801.13,"end":1801.73,"speaker":"Jonathan Pageau","text":"Right? Yeah."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":1801.73,"end":1951.38,"speaker":"Greg Hurwitz","text":"I started to pursue kind of trying to talk out of a civic responsibility of trying to fix the things in my own party that I felt needed to be fixed. That was really my starting point because, you know, I don't want to just assign blame in a way that is peripheral for the state of polarized discourse. I want to really look at it and see where I can change it. But what's very interesting as I started to dive into this is that the same rules apply for writing as do for politics. So guess what you don't want to do is you don't want to write in cliches, right? You don't want to write characters who are straw men. You don't want your antagonist to have a very easily knockdownable worldview. I mean, the bad guy never thinks he's the bad guy. You want them to have an ingrained and rich philosophy. And if you start to write in a whole series of cliches that people have seen and heard before, then your writing's weak. You haven't hit that specificity. So guess what? As you import that into politics, you know, it's the same thing as people start to say, if you can walk into a room and say, you know, keep the government out of my uterus, that it's immediately a sentiment that's going to divide everybody into what they think already versus having a conversation about women's desire to maintain control over their own bodies in a way that's more sophisticated and that is engaged with some understanding of how not everybody should just agree with that right away. Or else they're mouth breathing troglodytes. And it's likewise from the other side. They can take my gun when they pry my cold, dead fingers from my gun. Doesn't leave a lot of room for, for subtlety or discussions to talk about where we are and what things in Society, including gun owners, want to have to make, to show more gun discipline or to have things be safe while also respecting the Second Amendment. So these sort of cliched phrases, when you do them in books, it means you're not a strong writer. And when they're trotted out in politics, it has the effect of just shutting down the other side completely. If you're using buzzwords, if you're using ideological phrases. I mean, one of the jokes I made growing up in America under Reagan and being from a more liberal family that voted Democrat forever, family values, was a phrase that was used so much here to mean a particular thing that I always say it wasn't till I was grown up and married and had a kid and had two kids, and I was like, wait a minute, I like family values. Like, family values are good. I should have some family. Because it was used as such a political cudgel."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":1951.38,"end":1971.77,"speaker":"Jonathan Pageau","text":"You couldn't hear it. You weren't actually hearing what they were saying. You were just saying, here's my enemy saying something. And he keeps saying it for some reason. And let's say he's coding like he's saying this coded language that is going to reach the people that he wants to reach, but it didn't have any actual content."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":1972.17,"end":2062.77,"speaker":"Greg Hurwitz","text":"Well, and I have a theory too, that as ideology becomes ossified into buzzwords and phrases from either side, this is not me picking on Republicans or family values, because I think this is equivalent. As things get condensed into buzzwords that are news bites, they lose authenticity and are much more often used for manipulative effect. And so that's part of what the reaction we have to sort of cliches and buzzwords. It's like people have real sentiments. They figure out how to boil it down into something that's a neat, catchy slogan. Then it gets used and used and used and used, and anyone who's opposed to it recognizes it as a sort of empty slogan. That's an ideological manipulation in some ways, like when people talked about family values forever or when people talk about, you know, the things from Democrats also that are the phrase words. You know, it starts to become detached from the actual meaning and human experience of it. And obviously it's a necessity to communicate in a market for politicians on both sides. Right. It's a rallying cry to say, keep the government out of my uterus. But that's not gonna be a starting point to engage with somebody who is, you know, a pro life, born again Christian who has a lot of deeply felt emotional feelings about abortion it's not a starting point. It's sort of a shutdown point. And you know, I'm vehemently pro choice, but I think that it needs, that this needs to be a conversation that's engaged with great respect."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":2063.25,"end":2116.58,"speaker":"Jonathan Pageau","text":"Yeah, but I think that's one of the, at least the discussion. I don't see the discussion, the discussion happening. I think that especially that question is a very, is very difficult because you do have, you're not. The two sides just are not talking to each other in terms of the abortion discussion because you have one side saying choice and the other person saying life. Really. I mean, you have the two sides. So it's like one person saying, how can you not care that. That you're destroying a human life? And the other person can't see. Doesn't see that. And saying, how can you not care that you're intruding into my personal responsibility and my personal choices? So that discussion is. I don't see that discussion happening anywhere, you know, sadly. So I don't know. I don't know where it's going to go, but I think that hopefully we can at least find some places where we can discuss."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":2117.49,"end":2146.02,"speaker":"Greg Hurwitz","text":"Well, here's the thing. There are certain issues we're gonna disagree about fundamentally. And that's the job of humans. The job of humans is to have different perspectives, whether you're Libertarian, Democrat or Republican. Where for me it starts to get problematic is when either side like the issue you just said, that's not fixable. That's not like we can all just sit down and solve it. But where it gets really problematic and gets worse is when either side starts to impugn the motives of the other side."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":2146.26,"end":2198.15,"speaker":"Jonathan Pageau","text":"Yeah, I agree. I think I always tell people exactly that. I say, you know, when, when you know, when. Exactly. Like for example, when even on the. Let's. On the pro. On the pro choice side, when someone says your purpose like you're. The reason why you're doing what you're doing is because you want to control women. And it's like the people on the pro life side can't hear that argument because they're saying no. See, the reason why we say that is because we think it's a human life and you can't destroy human life. And then the people on the human life side are saying, you know, you're killing babies. You know, you don't care about killing babies. And they're saying, that's not what we're talking about. We're saying, no, this is about. And so they're Just not that they're not talking to each other. That is actually an issue. That's definitely an issue where you can see that the two sides are just completely not. They're just not. Not communicating well."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":2198.15,"end":2204.67,"speaker":"Greg Hurwitz","text":"And it's also, you know, it's also part of it of, like, tell me your position and I'll tell you your moral failing."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":2204.75,"end":2205.71,"speaker":"Jonathan Pageau","text":"Yeah, yeah."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":2205.71,"end":2217.31,"speaker":"Greg Hurwitz","text":"You know, and it's like, sometimes it's not. Sometimes someone just believes something different, and that's okay. And it has to be discussed in ways that are not saying that they are monstrous or morally lacking."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":2217.63,"end":2218.75,"speaker":"Jonathan Pageau","text":"And. Yeah, well, you don't."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":2218.75,"end":2220.75,"speaker":"Greg Hurwitz","text":"Obviously, someone because they."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":2221.68,"end":2232,"speaker":"Jonathan Pageau","text":"Yeah. Or that you don't immediately demonize someone because they have a different opinion than you, then the discussion is totally impossible. It's impossible to even have it. That's for sure."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":2232.16,"end":2238.08,"speaker":"Greg Hurwitz","text":"Well, from a negotiating perspective, it becomes impossible to figure out something that might actually function."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":2238.32,"end":2238.8,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":2238.8,"end":2262.29,"speaker":"Greg Hurwitz","text":"You know, like, I see this so clearly with the gun control, gun discipline problem is if somebody walks in immediately and says, you know, I'm for gun control, you can't have any conversation to talk about the fact that we have, you know, a lot of gun owners. There's so much agreement about specific things, like, you know, violent. Violent history checks."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":2262.29,"end":2262.57,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":2262.57,"end":2331.74,"speaker":"Greg Hurwitz","text":"There's certain things where, you know, 90% of Americans and 73% of NRA members are in favor of violent history checks. It's actually not that controversial. And so. But if you want to get into very specific things that we might say, hey, maybe this is something that we should look at better. Can we look at this one thing versus coming in in a largely abstract way and not getting to the specific. Everyone's going to just tilt further toward their extreme. Because it's like, if you're coming in telling me you want to abolish the Second Amendment and take my guns away, and everyone who owns guns is. Is violent and stupid. Like, why would you listen to anything anyone has to say? You can't have a negotiation or a series of compromises when you don't believe that, A, the other side is engaging in good faith, and B, that there are no circumstances under which they will be satisfied. And I see that as the big fear when we're discussing certain. What I think are reasonable parameters with the Second Amendment to say, let's just look at violent history checks. The fear from the other side is, you're not gonna be happy with that. I'm gonna give that up to you, and then you're gonna do what's next, and you're Gonna do what's after that? You're gonna do what's after that until you get rid of the Second Amendment. Because secret modem."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":2331.82,"end":2363.41,"speaker":"Jonathan Pageau","text":"Yeah. Yeah, that's definitely. That's definitely. What I see from the conservative side is that the progressive agenda is exactly that. It's a progressive agenda. And so it's seen as you do one thing, you do another, you do another, you do another. And then it's not clear exactly where. It's not always clear exactly where we're going, but it seems like there are some setup steps, like in the process, and we're going to go on these steps no matter what. So. So yeah, that. That's definitely. That's definitely the perception that I see from the. From the conservative side."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":2363.65,"end":2475.77,"speaker":"Greg Hurwitz","text":"Well, the other way too, to be fair, is like, you know, there's. When conservatives are giving voice to, you know, due process of the law like that. You can't blindly believe every accuser, whether male or female, of everything. There's a concern from the left that is like that series of choices is going to be wielded fraudulently and corruptly to denigrate the rights of people who are less empowered. And it's going to lead to a handmaid's tale. Right. So that concern exists on both sides. And as long as people are dug in, I mean, it's not that big of a stretch. If you think about, you know, recurrent fights in intimate relationships, you can't wind up in your marriage or in your relationship not ceding any ground. I mean, those are. Those are the marriages that end in divorce where you don't believe in any good faith concession you can make, where every little choice in your life, in your marriage, in your house, is battleground. You can't get anywhere with that. Yeah, you have to engage in good faith and see someone else's perspective and also be aware to look at your blind spots. Like when people talk about perspective in a marriage. Right. Oh, you have a partner who brings you greater perspective. That's actually literal. There's somebody outside of you looking at you who can see your blind spots in a way that you can't. And if you want to turn everything into a battleground that your perspective is what wins all the time, marriage ain't gonna work. And in America, we are dead split. I mean, you look at the last few elections, we're not having races that are going 70, 30. We're married. So we can either cross our arms and dig in our heels, or we can try to figure out ways they kind of can come together. And there's extremes in both sides of the party that are not gonna be game for this and don't probably deserve much of our attention. But there's a huge swath. The vast majority of people on both sides of the political divide. We gotta figure out how to live together."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":2476.17,"end":2525.51,"speaker":"Jonathan Pageau","text":"Yeah, no, I think that that's definitely the. That's definitely the hope is that people will at least learn to talk to each other. And I think that this, that a lot of these conversations that are happening online are giving us a little bit of a hope that it's possible at least to have these discussions. And I think that those people that are willing, like you and I now, I'm obviously, I was telling you on the phone the other day, like, I'm an icon carver. You know, there's probably very few ways I don't even have to signal how conservative I am, like, in terms of just the way that I just. My title makes it pretty obvious. But I think that, like you said, I think it's really important to engage and to talk and to kind of get a sense of what people are, how people are perceiving you as well, and to understand that."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":2526.52,"end":2532.6,"speaker":"Greg Hurwitz","text":"Yeah. But, you know, in fairness, I did like your series of icon carvings of transgender bathrooms, though. I thought that was pretty cool."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":2535.16,"end":2539.96,"speaker":"Jonathan Pageau","text":"Yeah, those are. Yeah, those are. I did not. Under a pseudonym. They're. They're not supposed to. Fair enough."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":2540.36,"end":2550.4,"speaker":"Greg Hurwitz","text":"Yeah. I mean, it's. It is funny when you come from different, from different sides of trying to figure out, you know, how we still engage. Look, I wanted to talk a little bit about Batman because."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":2550.4,"end":2573.98,"speaker":"Jonathan Pageau","text":"Yeah, let's talk about Batman. That's something that I'm really. I mean, I read. So I read the volume two of your Batman stories, and I don't know if you saw the video that I did on Batman and Adam and Eve. So I'd like to get your take on Batman. He's such a wide character, but there's definitely, you know, that you definitely had a particular take on him. So maybe go ahead and tell me about Batman."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":2574.62,"end":2621,"speaker":"Greg Hurwitz","text":"Well, so first of all, I was totally delighted when I got the chance to write Batman for dc. As you can imagine, it's like I got the call and had to act super cool and professional. And my inner, like, geek boy, 12 year old is like doing cartwheels down the hall. What I found when I was getting in and writing Batman that I was very interested in is the dynamic. And I use this, to some extent, an orphanax because it was sort of a. So the dynamic, particularly in men, between perfection and intimacy. That was something that I found. So it's like, here you have Batman who can't fly. He doesn't have a magic ring, like Green Lantern, doesn't have any superpowers. But he represents the pinnacle of human discipline. Right. And part of why you can do that is he's an only child. His parents were killed when he was young."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":2621.24,"end":2621.6,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":2621.6,"end":2734.32,"speaker":"Greg Hurwitz","text":"Robin's always dying. Like, we get a new Robin and Robin dies. He dates women under his pseudonym, and they either die or they vanish or it's unattainable. Sort of temptresses like Catwoman. Right. There's a big divide between the people he dates or the female characters he's engaged with as Batman versus Bruce Wayne. And one of the things that was interesting to me was that he can be as close to perfect as a human can get without magic skills, but with sheer discipline and sheer willpower, in part because he has no intimacy. Once you have intimacy, it's a recognition of the limitations the world. Right. I always think of it like, when I had kids, the way I thought of it was that my. The surface area of my vulnerability increased. Right. And you can't protect it all. Like, once you're intimate and you don't want your kid to go to school and get bullied, right? You don't want. Once you're married, you don't. You know, you're open. If you're. If your spouse has health issues, like, there's just. It's a bigger range of things that start to interfere, and that's even literally down to a level of your schedule. Like, I used to just get up, go to the computer, write all day. Like, there's no interruptions. But if you want to have a wife and dogs and kids and, you know, a lot of friends in your life, things are going to get interrupted. You have. You have to widen out more into fullness with intimacy. And perfection, in some ways takes a laser focus. So I was very interested in that, and I imported that in ways I'm sure you were aware of when I started to write orphan acts. That's the struggle. It's like, here's this guy, this kid who was pulled out of a foster home at the age of 12, raised to be an assassin. But his moral compass was never broken. Like, his mentor and father figure tells him, the hard part won't be making you a killer. The hard part is keeping you human. And so he's torn in conflict between those two, Being like the perfect trained assassin, but also Having a moral compass that's unbroken and wanting to hang onto his humanity."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":2734.56,"end":2926.15,"speaker":"Jonathan Pageau","text":"Yeah. Well, it's interesting because, you know, you brought up the structure of Terminator bit before, and. And I think that. That those two opposites in Terminator are definitely, at least in the first one, they're shown as almost unbridgeable opposite. So you have this perfect world, Skynet, you know, this kind of technological perfection. And then you have this woman, you know, who's kind of messed up and kind of, you know, just. Just kind of chaotic. And so one is basically trying to kill the other, and the other person just has to defend themselves, you know, until the end from this, this. This. This intrusion. And so it seems like there's something very interesting in this idea of the humanizing capacity, right, of this feminine character that you. In Orphan X, at least that's kind of how you set it up, is you have this single mother, right, with her child. And in coming into contact with this character, suddenly the assassin starts to find himself compromising, deciding things he wouldn't decide and slipping, and then finally kind of entering into an actual relationship with that family, not just with the woman, but with the child. And so there's something. And so there's something about that that, let's say at least that strong opposite at the beginning. I don't know how you. Because you mentioned also Gilgamesh. You have that in Gilgamesh, too. It's a bit different, but you do have this idea of this. It's kind of almost the opposite of that, where you have a wild character, Enkidu, who's in the forest and is completely wild. And then this female character comes and humanizes him by entering into her, entering into a relationship with him. It seems like in your story and in Terminator 2, you have the flip side, where it's the city character. Like, it's almost as if it's Gilgamesh himself who would have been tamed by this woman character. But maybe Gilgamesh is actually tamed by Enkidu himself. Like, he's actually those two together, like this kind of wild, very particular, very connected to nature character and this almost tyrannical figure. When they meet together, then they have, in a way, they balance each other out. Like, one of them becomes more human and the other one also takes on some meaning. So I really saw that. I saw that not only in your Ophelia and in Batman, but even in some of the other tropes that were being played out in your Volume two. Because there's also, in Greg's Volume two, it's with Scarecrow. And so Scarecrow is also this, like, he almost has like this story with his father where this crazy professional who is so bent on discovering what fear is that he has no humanity left in him. And then Scarecrow encounters this one of his victims who remains human despite everything he does to him. And finally there's this little moment in the story where he actually helps her. You know, like this surprise moment where actually helps her. And then you see that, you know that there's this possibility of change in a person anyway, so maybe you can talk a bit about a bit more. That's how I was seeing it. Especially because you had mentioned Terminator before. So maybe you can tell me a bit about how you see, you mentioned this story a few times to me about this Terminator story. So I don't know how you see it connected."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":2926.95,"end":3186.91,"speaker":"Greg Hurwitz","text":"Well, yeah, it's interesting. Your observations around that are interesting. I mean, the thing is, the Terminator, especially when you get to the sequel, you really see that it's basically the taming of a wild beast, right? And it's. I love the way James Cameron writes female characters. I just think he's amazing. And if you look at Linda Hamilton, she's so tough and so badass and she's so empowered, but she's also sourced, like, she's also deeply feminine at the same time, right? So it's not just that it's an overlay of her into a male character that you just switched the anatomical parts. Keep in mind, I mean, she's pregnant at the end of Terminator, right? And she's a protective. There's a protective mother aspect. It's what I love so much in, you know, Aliens is like when Sigourney Weaver finally gets pissed off. It's like it's the mama grizzly when you've got between her and her cubs. And so there's a different sort of texture to what that is and how and how it functions. And I think Cameron does that beautifully where he doesn't write paper thin female characters. He writes them with a of lot, lot of depth. And, you know, just because you're writing strong women doesn't mean that you're writing them complicatedly. Like, we don't talk about people writing strong men, right? I mean, you want complex men, male characters, right? It's like strong is still one dimension if you don't bottom it out in ways, whether that's for male characters or female characters. So Terminator is always very interesting for me in that way. To have a female protagonist who uses a lot of feminine power to affect the plot. But it is interesting. Like, so within Batman, I was pretty well known for recreating the villains, I think, which speaks to my own darker proclivities. So my first assignment there was. I kind of. They were doing the new 52, which was a recreation and a recreation of the universe. And I started with the Penguin. DC kind of said, you can do anything that you want. But they were kind of stealing me from Marvel. They said, you can have any character you want and do whatever you want. I said, I want to write a miniseries on the Penguin. And he looked at me like, are you insane? You could have, you know, Flash or Superman. You want to do a miniseries on the Penguin, who's like the biggest joke character. And it was so funny because I so admire Alan Moore's the Killing Joke about the Joker, which we can talk about in a sec, because I kind of did an homage to that in a later thing. And so I still remember we announced it, but I was like, I see this in a particular way and I want to write it. And we announced it. And I remember there was an Internet poll of of most eagerly anticipated series coming up, and they listed six of them. And my Penguin miniseries got 0.0012% of the vote. In my favorite all time anonymous Internet comment, somebody said, I'm really glad Hurwitz's mom voted for him. Like nobody cared. But the thing is, it was a real lesson because I wrote it, the critics came, the fans came. And that's what I kind of parlayed into Batman. Cause I just had a sense of how I wanted to do it. And what I wanted to do was if you're the Penguin, if you're short and stout and unattractive, Batman's a bully. Like, if you really switch the lens, the perspective. Like, Penguin's this guy who's like trying to make do. He's always been unattractive, he's always been fat. He's always on the bad end of it. And as much as his moral compass is completely off kilter, here's this tall, cleft chin superhero who swings in and beats him up again and again and again. And I just thought, what a cool trope to turn that on a tad and to give the Penguin a very real perspective and depth and a bit of humanity, which you talked about with my Scarecrow story. Also, that we're getting insight into him in a way that's real. He's not just sort of a cackling you know, malcontent, but actually has, you know, felt emotions and feelings and is beat up. And so I try and always look at these things from the perspective of the opposing side because people think that, like, if you make your antagonist really, really bad, you know, that'll make your hero even stronger. And it's like, it's not the case if your antagonist is complex and has a worldview that we can almost relate to, but our protagonist can engage with that ambiguity and chaos and still come out and emerge and win the day. That actually occurs more positively to the protagonist."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":3186.91,"end":3227.65,"speaker":"Jonathan Pageau","text":"Oh, yeah. You can see a good example that happened just in the last few years is the difference between the. The Justice League movie and the last Avengers movie, where it's like, the bad guy in the Justice League movie is just a. Who knows what his motivations are. He's just this. Evil barely exists. He's just like an abstract evil person. And. And Thanos in the Avengers movie was at least given it was fleshed out. And you can. There's some strange moments where you can almost understand, like, why he's doing what he's doing. And then you pull back and you say, no, no, no. This is. This is. Is scary. You know, So I definitely agree that that's something. So the idea is that Penguin is basically. He sees himself kind of, like, as a victim of Batman. Like, he's that Batman. Yeah, that he's."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":3227.65,"end":3229.89,"speaker":"Greg Hurwitz","text":"I mean, as you know, that's the most dangerous position."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":3230.13,"end":3230.77,"speaker":"Jonathan Pageau","text":"Oh, yeah."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":3231.01,"end":3240.41,"speaker":"Greg Hurwitz","text":"Believes they're martyred at the hands of someone else. Like, virtually every genocide has been perpetrated on behalf of people who believe that who they are exterminating has victimized them."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":3240.41,"end":3242.05,"speaker":"Jonathan Pageau","text":"That's right. I agree. I agree."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":3242.45,"end":3258.81,"speaker":"Greg Hurwitz","text":"So there's another aspect I wanted to talk about a little bit. In my Batman, I wrote a Batman Dark Knight Zero edition. It's sort of an origin story that I haven't really discussed that much. But one of the things it deals. It's very archetypal. So I wanted to talk about it with you a little bit. I don't know if you read that one."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":3258.89,"end":3259.25,"speaker":"Jonathan Pageau","text":"I did."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":3259.25,"end":3271.93,"speaker":"Jonathan Pageau","text":"I did. I did. That's why. Because it kind of came with volume two. Like, I bought Volume two, and then I read it, and then you were at the end. So I did read it, and I thought it was really interesting. Maybe go ahead and tell me what you kind of. What you were thinking, and I'll give you my impression of it."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":3272.09,"end":3480.31,"speaker":"Greg Hurwitz","text":"Well, so I was trying to retell, like, the Zero. The Zero editions that Marvel or DC did this thing where we wrote issue number zero. And it was supposed to be an origin tale. So I wanted to write about Joe Chill, who's the guy who killed Bruce's parents in the alleyway. And the conventional story is he was just some thug who shot them and he wanted the pearl necklace, okay? So I told it in very surreal fashion. And I picked it up with young Bruce, who's trying to find meaning in this. He goes off to high school, and he's drawing charts and maps of, like, who really killed my parents? Who's behind it? Was it this corrupt person? Was it this crime family? Was it this person who's opposed to my dad's charity? Was it this business rival? He's trying to shape order out of this. And it's. You know, from being a little kid all the way forward through the present, through schooling, I really trace and show the strength of this desire to get to the bottom of it. And when he's in school, his teacher, when he's in high school, interspersed with this is sort of talking about, I think, you know, quoting Emerson. And Emerson talked about, if you look in your heart, you will see some internal design that matches a map of nature. And it is beautiful, right? And that the individualism, you know, he's sort of the defining father, in some ways, of American individualism. You know, to know what is true in your own heart that is true for all mankind, that is genius. And imitation is suicide. So it's this beautiful inner order. And so that's what Bruce is being taught when he's in school. So he finally gets out, tracks down different clues and gets to see Joe Chill. And when he kicks in the door, he's gonna kill him. And this is before he's Batman, right? He's a young man now, and Joe Chill is in this miserable apartment. He's unshaven, there's booze and pizza wrappers. He's slumped in the corner, all kind of drunk, drugged out. And in his window that's propped open, it's a rickety sash window, there's a volume of Edgar Allan Poe. And what Edgar Allen Poe said is the exact opposite. He was the perfect inversion of Emerson, which is, if you look in your heart, what you will see is utter chaos. And what you will see is the pointlessness and nihilism of the world that is so terrifying that you'll be drawn to it in a way that you seek to destroy yourself. And that's Joe Chill. And when Bruce goes in that room, what he realizes is all of his desire to give shape right, to have meaning behind his father's death is nonsense. He was just this drunk guy who wanted the pearls. And there isn't any comforting conspiracy to be had. And he doesn't kill him because you can't kill chaos. And when he goes outside, he's very emotional and he's walking. And there's ads for the circus, right? The circus that Robin was raised in on the wall. And one of them is a smiling clown. And Batman, not Batman. Bruce Wayne leans against it. It starts to rain on him, and he's recovering his breath. And as he's leaning against it, the rain streaks the poster and pulls the happy clown figure into a scowl. And the droopy eyes that prefigures the Joker. So the Joker doesn't yet exist. Bruce isn't yet Batman. The Joker isn't yet the Joker. But what I wanted to show was that shattering of comforting conspiracy and meaning into the chaos of the world is gonna be his lifelong struggle. He's trying to find order. And the Joker represents, of course, chaos. He just wants to see the world burn."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":3480.95,"end":3619.04,"speaker":"Jonathan Pageau","text":"Yeah, I thought. I thought that it was a really. I was really thought that it was a very effective way to tell the story. And also because, like you said, I think that when you said you can't kill chaos was a. Was a perfect way to phrase it, is that he, you know, if it had been some conspiracy theory, all he would have had to do is to find, you know, like to go up the conspiracy, find the source of the conspiracy, knock that off, and then he's done, right? He's done. He's finished. He's finished his mission. But what he ends up being is it's a much bigger mission that he gives himself, which is that it's a faceless. Right? It's a faceless chaos that he's trying to keep back. It's like, it's not Joe Chill. It's every thug, it's every criminal. It's every possible way that someone can. How chaos can kind of seep in. And so he's this gargoyle, you know, standing on the building. And he's one of the. He's a guardian of the city. He's holding back this dark chaos that's on the outside. So I thought that it was a really good. It was a really good way to see it. And then, you know, the meaning that he finds is not out. It ends up not being out there. It ends up not being this conspiracy that he's trying to find. Out in the world. But it ends up being. He has to internalize it, right? He has to be the one. The meaning has to come from him. He has to be the one standing on that border and kind of holding the line of this kind of dark chaos. And so I really. Yeah, I thought it was a very effective way to tell that story, you know, and to. To kind of imagine, really, in a mythological way, like what that encounter with Joe Chill is supposed to be. You know, what. What is this meaningless killer? And I think that a lot of comics, they've kind of gone away from that in some times. Like, I think Spider man there, they tried to give some kind of, like, secret meaning to why, you know, his uncle got killed. And they tried to find some weird trope where they're trying to make it a bigger story. But, no, the whole point of these. The story is that it's just this meaningless thing that happens. And it's. In trying to give it meaning, but from the inside that you. That you can. That you get confronted. So, no, I really did appreciate it. I would suggest people should look it up. You can find it. It's easy to buy on Comixology or something. You can buy it."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":3619.6,"end":3641.34,"speaker":"Greg Hurwitz","text":"Well, that, of course, too, as you well know. I mean, in some ways, that's the story of Christ, right? You shoulder your own cross, right. You accept your own suffering, and in doing so, you can transcend it. And so the gargoyle metaphor is so interesting because it's so obvious. And I've never thought about it until you just said that, which I'm embarrassed to admit. So don't tell anyone else."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":3641.5,"end":3643.18,"speaker":"Jonathan Pageau","text":"Yeah, exactly. Don't tell anyone else."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":3643.18,"end":3659.96,"speaker":"Greg Hurwitz","text":"But, I mean, Batman is constantly portrayed as a gargoyle, right? My covers have him crouching on the roof of a building. Right. It's a constant gargoyle imagery because, of course, gargoyles would have ward off the spirits to protect the people in the places or in the buildings."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":3660.04,"end":3661.32,"speaker":"Jonathan Pageau","text":"Well, the trope that I."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":3661.64,"end":3664.56,"speaker":"Greg Hurwitz","text":"It's like, it's so ingrained in us, I didn't even think about it consciously."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":3664.56,"end":3862.17,"speaker":"Jonathan Pageau","text":"Right. Well, the trope that I've been using is really this image of the. What I call the garments of skin, or the idea of using chaos to fight chaos or using darkness to fight darkness. And so this idea that Batman take, you know, just like the. There really is this idea that, you know, that you have these monsters that protect you from bigger monsters, right? So you have these small monsters on the edge of the world, and they're kind of dangerous. They're kind of scary, but their actual function is to protect you from way bigger monsters that are out there. And so Batman takes that. Like, he turns fear against itself. He turns darkness against itself. It's like a vaccine, this idea of using the disease to cure a disease. And. And that seems to be a really. And that's why he's so attractive to us, because we can really. We recognize the pattern and we can see. And it's so funny. Like in the little video that I made, I tried to show how a lot of the elements of Batman, which don't seem to fit together once you see it through that frame, all of a sudden you realize that they do. Because the idea of the garments of skin is also related to the idea of our animal self, like our animal reality, like our bodily existence and everything that's flesh about us in the Bible, it's really at these garments of dead animal skins that are put around it. And then I just basically say Batman. That's what he does. He dresses himself as a beast. Like, he actually, you know, you can imagine those warriors that would put on wolf heads and as these animals, and then they would fight against the. Against the enemy wearing those kinds of tropes, or Hercules wearing a lion's skin, right? To embody that. That kind of chaotic passion. But to do it, you know, to stop your. Your Stop the enemy from. From. From coming in. And so Batman definitely seems to. To embody that. One of the things that someone mentioned recently in a conversation, a private conversation I had with someone, is a very powerful conversation I had with someone. His name is Jason, and he's very ill. He's. He has a breathing mechanism. And he. And he. And he wanted to talk to me about Batman and Joker and. And his take on the Batman and Joker was quite powerful. And I'd like to run it by you for you to tell me what you think. He really saw it as two reactions to suffering. Like he saw as if there's some scandal in Joker's life. Something happened to him that broke him. And Batman also had that in his life. He has something that happened to him that could have broken him. But they both reacted in two different ways, where one used it as fuel to basically defend, you know, the city, and the other one gave in to the nihilism and into resentment and then just wants to all hell to break loose. And I thought. And I thought even in Jordan, in the terms of how Jordan Peterson talks about the world, I thought it was just. I never thought. I had never thought about that and I thought, wow, that's a fascinating idea. And I saw the same in your story with Scarecrow. There was something of that in there which is like, there's fear, this confrontation with fear. And Scarecrow kind of gives in to fear, whereas Batman says, no, I'm going to turn fear against itself. Like, I'm going to use fear to stop those that want to bring fear to the innocent."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":3863.05,"end":3933.68,"speaker":"Greg Hurwitz","text":"Yeah. And I think that split is the split between positive masculinity and negative masculinity. Right. I mean, and that's something that, you know, one of the. I wrote a piece on positive masculinity when I was on book tour in England saying we talk all the time about toxic masculinity, but we're never talking about positive masculinity. And like what that entails. And to some extent that's sort of like being, you know, if you're a democrat, you're only talking about, you know, making the rules fair for everybody, but you're not talking about the aspirational. People don't have anything to aim for. Right. So it's a very similar thing. And I do see that split that way. I play with it a lot in Orphan X also that notion that, like, to catch a monster, you have to become a monster. Right. And so a big aspect of that, and we see it again and again with Batman too, is like you have to walk that kind of sine wave between the yin and yang. You have to have one foot. Those are the two eyeballs. Right. In chaos and in order. And you have to be good enough that as you're walking that razor blade edge as a monster who's fighting monsters, that you don't tilt into total chaos. And that's the strength of the adventuring archetypal hero."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":3935.12,"end":3988.98,"speaker":"Jonathan Pageau","text":"Yeah, yeah. And you see, you know, you kind of see it paired up like in stories, especially in Batman and Joker. Like you, they end up pairing them up like they almost become. They almost become like these metaphysical opposites where you have these two sides, you know, the eagle and the snake or whatever. These two, these two sides that are almost self defining, like defining each other. And you know, and even in the story trope, sometimes it's played out where, you know, the one is even the cause of the other. So the enemy is the one who caused the good guy. Or sometimes it's the opposite. It's the hero who is the secret cause of the enemy. He did something. And you see that in some of the Batman stories you get that where, you know, it was Batman who was there. And when the Joker fell in the. Fell in the. In the acid or something like he was somehow involved in it. And so you have this idea that one causes the other, the other causes the one. This kind of eternal conflict, let's say, of the two sides."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":3990.02,"end":4019.06,"speaker":"Greg Hurwitz","text":"Yeah. And it's, you know, look, that's. That's how it functions. I built a lot of that into Orphanax also. And what's so great with Batman's Batman has the best rogues gallery. And it's because every single one of those represents his opposite. Every single person in his main rogues gallery is a reflection of some aspect of him, but gone wrong in a different way. And it's what's so fascinating. There's this 360 degree circle around him of all villains who represent some part of him."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":4019.22,"end":4033.38,"speaker":"Jonathan Pageau","text":"Yeah, yeah, that's definitely. And I mean, that's why he's so. He survives for so long and obviously he's not going away for a while. Hopefully they'll get the movies right though, because they're in a scary spot right now."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":4033.62,"end":4034.1,"speaker":"Greg Hurwitz","text":"Yeah."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":4035.7,"end":4058.98,"speaker":"Jonathan Pageau","text":"Well, listen, I think we've gone quite a while. I really appreciate talking to you. I'll definitely probably. I read only the first Orphanax book, but I will probably read the second one and start to think about some of the things we've talked about and see if I can see some of those patterns in there and probably look into some of the other comics that you're doing. Are you still doing comics or is that finished now?"}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":4058.98,"end":4067.21,"speaker":"Greg Hurwitz","text":"I'm thinking about embarking again after Batman. It was such a great experience. I didn't think anything could equal it, but I'm sort of flirting with a couple things now."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":4067.37,"end":4067.93,"speaker":"Jonathan Pageau","text":"All right."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":4068.17,"end":4071.69,"speaker":"Greg Hurwitz","text":"Yeah, well, look, it's so great, great to talk to you."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":4071.85,"end":4098.24,"speaker":"Jonathan Pageau","text":"Yeah, it was good to meet you. And yeah, so I will put in the ad for the democratic ad that you put into people in the comments. Try to look at it, Try to look at it objectively. Look at the structure, look at what's being said. And it would be great to see your comments about it below. And so that we can get the discussion going, an actual real discussion between the different sides going. So thanks, everybody. See you soon."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":4098.64,"end":4099.28,"speaker":"Greg Hurwitz","text":"Thank you."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":4101.36,"end":4156.25,"speaker":"Jonathan Pageau","text":"Thank you for listening to the Symbolic World podcast. As you know, this podcast is for now based mostly on my YouTube videos, which I am transferring into audio format. Please go ahead and visit my YouTube channel. There are more videos there on different subjects that I'm not going to put into audio. And please share this to your friends. I know a lot of people know about the YouTube content, but not so many people know that this is also a podcast. So share it to your friends, share it on social media. And if you can, feel free to support this financially as well by going to my Patreon page, which is Pageot videos. Strangely, you can go there and you can support it at any amount that you want. A month for all the patrons. I do a monthly Q and A live Q and A in which people can ask questions in the chat, and I try to have a more personal connection with people. The YouTube comments have become different, difficult to follow and to answer."}
{"episode_id":"SW - #041 - 2019-07-10 - Gregg Hurwitz - Patterns in Politics and Storytelling","start":4156.41,"end":4157.21,"speaker":"Jonathan Pageau","text":"I'll see you soon."}
