{"episode_id":"SW - #258 - 2022-10-24 - Love And Attention - Thunder Bay Conference","start":12.08,"end":2753.81,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the Symbolic World. Our next speaker is Jonathan Pageau. He's an Orthodox icon carver from Quebec and the chief editor of the Orthodox Arts Journal. He's cultivated a community of artists, authors and creators and given them space on his Symbolic World blog. He also explores symbolism in art, literature, philosophy and popular culture in talks he's given around the world and his YouTube channel, also called Symbolic World. He recently published a graphic novel, God's Dog. Please join me in welcoming Jonathan Pichot. So, first off, I really would really like to thank Eamon and Catherine and Scott for this amazing event and this amazing opportunity. You know, these discussions we've been having for years now, I guess it's becoming. Have been. They've just been wonderful to. You saw it yesterday, like there's a. What I've been seeing, what I've been feeling is this desire to understand each other. Desire. Desire to enter into real communication with each other. And I'm like, now I'm almost used to it, right? I'm used to it. And so I'm looking at the content and yesterday a few people were telling me, oh, you know, my father was here and he was just amazed at the generosity and the discussion. Like, yeah, to always remember that that's actually the basis of why we're even able to have these discussions. And so I want to thank all of you for coming here. I was right from the first day when people started arriving. I was just amazed at how much people have been following this discussion and how I felt the same generosity and openness to listen and to engage that I felt when I talked to John or when I talked to Paul. The big confession I have to make is that, oh, last night I suffered greatly. I was in so much pain because I was sitting right there and I had John and Paul up here and they were talking and exchanging and I was like, you could probably see me. Like, I was right on the edge of my seat. I was like, I'm going to jump up there and get into the conversation. But I didn't. I was respectful. And so I thought, I'm going to. So I'm hoping that I can make them suffer a little bit this morning, say a bunch of things. And so it's funny because yesterday Paul was standing up here and he said, are you going to wing it? And he was like struggling with that. And I had prepared to talk, but with everything everybody said, I went downstairs a little bit to kind of center myself and pray a little bit. And I thought, am I just going to do the talk or am I going to engage? And I think I'm going to engage more than just do the talk. And so hopefully it's going to come together in terms of. I'm going to deal with a lot of the things that John talked about and Paul talked about yesterday, and I'm going to try to pull them together basically into my talk that I had prepared today. So I really wanted to. At the outset, I wanted to dive into the theme of the conference, which was this idea of consciousness and conscience. I think the framing of the conference was a way to maybe try to help us think about or look at how is it that conscious experience, consciousness, how is it related to morality? I don't like the word morality. I rarely use it. I would rather use the good, if that's okay with you. And we'll move into. Why I use that term has a long history. And this is something for those who followed my own discussions. It's something that I've been fascinated with from the beginning, which is the problem of what John calls combinatorial explosion, the problem of framing as we approach reality. That is, we realize that phenomena is too complex. As an artist, it's something that most anybody who's a painter or an artist, you come to realize that very fast. Because if you sit in front of something and you're trying to draw it or paint it. I was talking to someone today who is explaining that experience. You realize there's way too much stuff out there. And I actually have to find a through line. I have to discover. I have to engage with a structure which is hidden or there potentially in the thing that I'm looking at. And one of the things I realized when I was in my 20s was that actually, that's probably how we deal with most things, that we have to find a through line, as John. The term that John uses, which I like a lot, as we frame phenomena. And what I think is. I think that if we understand it that way and we look at it that way, we're going to come to a manner of understanding how the good arises from that. And so one of the things you realize, and you've heard me talk about the glass a million times if you watch any of my videos. But one of the things you realize is that when you engage with things in the world, you engage with them with a purpose. So, like, our categories are not just concrete categories that are completely arbitrary, but that they start at least they start in categories of engagement, right? So it's like a glass is something. It's a container. It's something that I drink from. And that's why I care about it. And that's why I care enough about it for me to have a category for it or for me to engage with it in a manner that makes it hold together as a phenomena. Because what we realize is that phenomena is combinatorially explosive. There are many aspects to this. Like, we could say, what is it? The example that's always used is, I could use this as a weapon. I could use it to prop up something. It has all kinds of possibilities in it. But as I engage with it, then it manifests itself to us as an identity. And that identity is almost in some way, it's identical with its good. That is, when I perceive a glass, I'm always judging whether it's a good glass because I want to drink from it. Like, if I'm walking out on the floor and I'm doing it unconsciously in some ways, or I'm not doing fully consciously, I'm always asking myself whether or not the floor is going to hold me or I trust that it's going to hold me, because that's why I have a category for it in the first place. And it's the same with even. Sometimes it looks harder when we look at the scientific categories. But the scientific categories are framed first of all in our experience categories, just the experience that we have every day. And so why is it, even in terms of science, why is it that some aspects of science get more funding, get more attention than others? It's because they're always couched in categories of care. Ultimately, they're couched in what is important to us in terms of humans. And so what I realized a while ago is that I think that that's what Dante is talking about in the commedia. And so I've been really thinking a lot about the way that Dante engages with the way that he sees this movement that humans have out into the world. And he talks about it exactly in that way. He couches it in two notions, which is love, the love and the good. That is, all humans perceive a good toward which they move, and that they at least think or at least hope that they will find rest in that good. And so if you think about it, every single one of your movements and anything that you do can be framed that way. That is, I walk into a room, I have a reason why I'm walking to a room. It can be a very minimal reason. It could be a small good, but it has to be a good, or else I wouldn't move. I would just stand here paralyzed. But if I'm moving somewhere, I'm moving in a direction towards something. If I grab something, I'm doing it for a reason. And it's always because I'm looking to rest in a good. If I grab a glass, it's because I think if I drink it, I will find a good there. And if I, you know, if I walk into a building, if I go to shopping mall, if I do anything I do. And sometimes that good can just be, you know, if I want to go for a walk and I want to clear my mind or whatever it is, every single motion we do. And I think it's probably actually most of the time true, even for things that we're not totally conscious of, that we actually act towards good. We protect ourselves from things that will hurt us, and we move towards things that we recognize as being good. And so the reason why I'm talking about this is because that's, I think, related to the problem of a combinatorial explosion problem, which is the categories that we have and the categories we even perceive in the world are related to their good. So an apple, is it a good apple that means a different thing than a good chair or a good anything. Or even in terms of science, it's super interesting because scientists, when they study something, they will reduce all the parameters down to their variables that they're looking for and they will create a frame, and then they will have to judge whether or not the facts they're looking at fit the good that they're aiming for. But there's no other way to do it. So you have to decide. I'm studying this for this reason, and now I have to see which facts because I'm obviously, if I'm studying a rhinoceros, right, it's like I'm not going to be looking at the clouds because that doesn't fit in the good that I'm looking for. And even if I'm studying a rhinoceros, I have to study the rhinoceros in a certain direction, in a certain frame, a certain aspect of it. And then all the facts, I'm going to see which facts fit in that good. And some of them, which don't fit so much, there's always going to be things that are going to be kind of on the margin and I have to decide where do I cut off, where do I remove the facts that don't fit into the good that I'm caring about and which ones do, and then I can get to the purpose that I'm doing. So even science actually functions in that manner. In the process. Often people will then describe the results of science and say, well, here are these objective results and everything. But those objective results are always couched in someone searching for a good and organizing facts towards a purpose and then deciding, not deciding, or perceiving which facts fit, fit and aim at the good that they're trying to find. And sometimes a scientist will identify a good, will start to organize facts towards that, and they'll realize that, no, the facts just don't. They don't. Actually, you can't reach the thing that I'm doing. My theory doesn't work. So I have to find a new theory to try to gather these facts together if I'm going to make sense of the world. And so one of the things that I've been thinking of is that that I think is ultimately just that is the source of morality or the source of the good. We see the good in things, but then there's a manner in which as soon as that becomes a question of people, or as soon as that becomes a question of others that I see in them a reflection of myself, I see them as like me. Then the good of the glass which is there to drink out of, becomes a different kind of good. But there's nonetheless that. And in Dante, that's the way that it's presented to us is that Dante. And it has to do with love. That is, love is the thing that draws you towards the good. One of the things I've been thinking about in terms of Dante is that we often complain about how in Latin and in the Romance languages we've reduced all the words for love that were in Greek, because in Greek they have seven words for love or five words for love, and they've reduced them to one. And so we lost so much. But I think that although maybe we did lose, there's also something that we gain, which is we gain the notion of just the idea of something which draws you towards something else. Just that. Like, what is it that draws you towards something else? And then you say, well, that's love. So it is erosion, you know, but it's also agape. Because agape is also that which carries me into the other, like this open, like movement towards the other. But it always is. It's like a motor that makes you move. And it's a great way to frame it, because then you can actually. You can apply it, like I said, to all the things you do. Because, you know, whether it is Whether I'm brushing my teeth or whether, you know, I'm avoiding a puddle, all of these things that I'm doing are always a love drawing me towards the good and trying to avoid the things that are in my way or trying to emphasize the things that are drawing me towards the good. But when we encounter people, then people become for us places or things that can draw us into a different kind of good. In Dante, what happens in him is that he finds himself right in this dark place. Finds himself basically in a place of nihilism. He can't move. He's stuck. That's the place where you have no good and you have no love. And we've all experienced moments like that, and we know people that fall into that. Someone who's depressed can be physically fit. They're completely physically in good shape. They could do all the things if they physically. But they can't find a purpose to move, and they can't light a love to get them to move. And so they. They lay in bed all day and you're like, well, just get up and do something. But there's no love, there's no draw. There's nothing pulling me forward. And so Dante finds himself in that spot. And the first thing that makes him move is he encounters the poet. And the poet reveals to him beauty, something which is calling him. And so Dante, his. A little bit. You could say something like a little bit of love is kindled in him, where he also remembers something that had driven him before this good, that had pulled him forward. So he encounters the poet, which is the one who taught him about love. Maybe the first thing that kindled even the notion of love in him and that made him understand. But it's a person, and that's why it's not an abstract thing. And this is actually going to. I hope at some point it's going to also help people understand religion a little better, is that humans are driven towards the good in people. Like, we're not abstractly driven towards morality. Very few people will act towards abstract moral principles, but people will be drawn into examples and people who reveal to you in their persons things that I want to imitate. That's how children learn. That's how we exist together. And often we forget that because then we find these ethical codes and we have all these ethical rules, but we forget that humans see in others and we move towards others. We're drawn into others, and we move in the example of others. So that's what Dante experiences. It's like Virgil is an example of someone who embodied beauty, someone who was able to manifest love in a more exterior form, right, in poems, in literature, all of that. And that has powerful value. But it's not enough for Dante. And that Virgil leads him ultimately to Beatrice. And Beatrice. Now there's an example of an actual erotic awakening that he had in his life where it's like this woman captured him and gave him a motor, right? Gave him a motor at first towards her. But then in the story, we see that his love was unrequited. He wasn't able to engage with her. But it's a person. It's a person that's kind of drawing him forward. And of course, if you know the story of date, then those people that he encounters, they pull him further and they pull him into heaven. And so this can also help you understand what heaven is, because it's just so hard for the modern world to realize that in Dante, heaven are people. They are people that embody the virtues, that lead us towards the good. They are saints, they are characters and have all through. And it's the same, even with the bad stuff. It's all people. It's all encounters with people that model sin, that model passion, that model excess, that model violence. And then it moves up into people that model virtue and that model the good more and more embedded into each other. So when Dante ascends the heavenly spheres, there's a reason why those heavenly spheres are inhabited by people that exemplify this scale of goods, this scale of virtues. And it's funny because even in the text, because, you know, I think Dante, this is. I think this is something which would have been completely just obvious to a medieval person. It would just be something that's completely normal to understand. But Dante was, like, in this interesting transition period. I think he probably felt that he was in this transition period. And so to warn the, like, Star Trek science fiction reader of the future, Beatrice, at some point tells Dante, it's like, wait, the souls don't actually inhabit these heavenly spheres, okay? So just be like. Be careful. Like, they don't. This is. We're not idiots. Like, there aren't souls, like, up in these. In these whatever circles of heaven that are kind of hanging out there, like, looking down. That's not what we're saying. We're saying that the experience of the heavens, the experience of this ascension or hierarchy of that which is above you, is there to. And how does she say it? She says, at first you need your senses. Like, we get things from senses and from our sensual experience, we Then know what is fit for mind. But it all starts in the sense. So it's like it's not that the souls inhabit the heavenly spheres, but that if you understand that which is above you, the experience of that which is above, then you can understand why these souls that inhabit different virtues move up into greater and greater goods. And so then he has these experiences. He moves up into the good, and then he ends up in the final moment, right into the love that moves all things. That's how the poem finishes. It finishes with him entering into the love that moves all things. And you realize that the whole poem was about love and about what draws us into these goods. Now, my contention is that I think that Dante is helping us understand the manner in which attention functions in the most immediate way. That it's not. He's not just describing a moral system, he's not just describing, but he's actually helping us understand the manner in which attention functions through care and desire for a good. And that is actually how categorization functions. Obviously, he wouldn't actually probably have cared about this more scientific question, but I think that that's. He's giving us a manner to understand the process of framing and of categorization, but he's doing it in the way that is the most important, which is understanding that all of this is couched in our experience of each other and of people that draw us into that which is good. And so I think one of the things that that does, one of the things that that does. I'm going to. Just before Dante enters into the highest sphere, just before he enters into the love that moves the universe, the Trinity, as the image of that love that is this multiplicity and unity which coexist together. It's a possibility of drawing the many into one. That's the problem of attention itself and the problem of understanding how those coexist. They coexist in love. And it's not an arbitrary. It's not just an arbitrary thing, because it's the problem you face with the glass as well, because the glass is not one thing, right? The glass is a bunch of things, and it's a bunch of things that are a bunch of things. But nonetheless, for some reason, we are able to see that it's one. Like, what is going on? And I think the answer to that is love. You don't like the word love because it's too sappy. Like, let's just use the word care. We could use the word Heidegger used. That's fine. That's what drives us into seeing unity in multiplicity is love of the good that that one gives you, whatever that one is like whatever thing you see as one. A car is not a one thing. A car is millions and millions of things. But nonetheless you're able to perceive it as one because it gives, it offers you a good that draws you into itself. And so that's also true for, let's say at the primal level. It's something that you could find for all the categories. It's a phenomena. I'm also, let's say, saying that the phenomenological experience of reality is primal. It's before whatever scientific categories you give. So the reality of a tree is first phenomenologically the good that it offers. And then if you want to start breaking down its cell structure, that is helpful and it's fine. But that there's a, there's a good in which we first even know that a tree is one thing. Because I know it sounds, it sounds obvious because we all experience it all the time, that we just see unity and we think that it's an obvious, like, oh, that's the, it's just one thing. Well, it's not. Well, it is, but it's not. And that's the problem that I think Dante is giving us some image of. And that's why I do believe that I think that that's the highest. I think that it is one of the reasons why we have the image of the Trinity is to bring that mystery into the highest good, into the source of all things. You could say source of all things is one in many. At the same time, it is a perfect union, perfect multiplicity. And so it brings us into this image of what the source of reality is. And if we say that and it's actually a problem solving thing, I do believe that it's true, I am a Christian. Like it's a revelation. But it is also a problem solving thing. Because the systems that look at the unity of all things as a monad, as an absolute monad, they tend to understand multiplicity as degenerative. They always tend to move towards the notion that the multiple becomes evil in itself. That as you move from the one to the many, you're moving into evil itself. So you see different gnostic systems that have that structure. And so of course, the problem of positing just some, I think very few systems would do that. But just positing some multiplicity as the origin, the complete origin, I mean, just means that we're just going to be fighting all the time everything's going to be at war with each other because there's no notion of unity which holds it together. So I think the Trinity is there to one of the aspects of the Trinity in the context of this conversation can help us understand that that is how, especially even in the way that Dante presents it, the notion of when we say God is love, it's not just a sentimental thing that we're saying. We're saying that the source of reality is bound in this principle that draws us together, but also doesn't reduce us to one. Because that's also one of the important aspects of love, is that if I love you, I don't want to be, I want you to exist as different from me, right? Because if we collapse the difference between you and I, then there's nothing to love anymore, right? So there's a sense in which as I approach the thing I love, I both want to be united with it, but I also wanted to have a certain distinction from myself, or else it cannot be a source that draws me. And so the notion that those two, those two aspects of love, which is one, the unity and multiplicity coexisting basically is the way that I see it as helping to solve a lot of these problems. The other aspect, what's important when you think of how Dante ascends, is that before he, let's say before he encounters the Trinity, he encounters Christ. And I really do think, I really do think that Christ offers some technical solutions to some of the problems that we're dealing with. So if you don't want to believe in Jesus Christ, let's just at least start with the notion of the anointed or Christ, the idea of the Son of Man, which we find in Scripture, because one of the problems we've been having and everybody's been talking about is how is it that, how is it that these higher beings or that these distributed cognitions, how is it that they exist? Or do they have consciousness? How do they have consciousness? Is it possible? How is it that they're causal? How do they hold together? And one of the things I think the ancients started to posit as a solution to that is something like heavenly man. And you find that in the Bible in the image of the Son of Man. But you find it also in early in 1st century Jewish thinkers, Philo of Alexander, for example, he talked about this idea of Adam Kadmon, we're universal man. And the reason why I think it's an important category because we often hear people say things like that they don't realize it, but they'll say things, you know, like, even, like, I'll use an example, like Santa Claus. Like, they'll say something like, well, Santa Claus doesn't exist. It's just something humans came up with. And I'm like, okay, humans came up with. Like, who are these humans? And is it one human? Like, is it. Can you name them? Can you find the people that came up with these things? Can you find the people that came up with the structure of a family or the structure of a nation? Are you going to. Who are these humans? So people say that it only exists, or people say something like, gold only has value because we decide it does. And really, who is this we that decide that gold has value? Do you have the power to change that? Go ahead, my friend. You do that, you change that, you make that not true anymore. Go ahead and make sure that goal doesn't. If it's just a completely subjective thing that we come up with, then go ahead, stop that. Make it stop. Right? That's not how these things work. There seems to be driving wills that are higher than our individual will that are managing these things. But those wills seem to be a reflection of in. Just as the people are saying, seems to be a kind of mirror of human. Of a human will. It's a human good that it's looking for. It's not some random thing, right? So it's like you can imagine that someone that the image of Santa Claus is filling a function that has some good, whether you agree with it or not, that has some function that is driving people to participate in that. The value of gold is the same thing. Like you. You can't just decide the value of gold seems to have some good. It's aiming to. You could then decide whether the good is parasitic or whether it has more to it than just that. But there's something driving that. And I do think that that's ultimately the notion of the heavenly man is helping us deal with. So you could understand that positing of a man with a capital M that stands at the right hand of God and that rules over all things. And so even in the Bible, if you know your New Testament and you start to think about it, you can start to see that sometimes it seems that that's what St. Paul or the Bible is suggesting that is going on, which is something like the angels. So these principalities that are above us, these distributed cognitions that we encounter that we can see have agency over us. They are above us in the sense that we're kind of subject to their causality. But there's a manner in which you could say something like, they are meant to serve man. Man is meant to rule over them. So you'll find texts like that in St. Paul where it's like, we are meant to rule with Christ, like we're meant to rule with the angel. We're meant to be in the council of God ruling over, even over the angels. But I think it's also technically just in terms of understanding how these emanating group distributed cognitions happen, is that they are ultimately the product of man with a capital M, that they serve man or they don't serve man, or you can find versions of it that are distorted and lead us into places where we don't, where we didn't think was possible. A good example is the genie is a good story for that, right? And so you have a higher level principality which appears to someone and then is at your service. And the, the principality says, what do you want? You can get whatever you want. And it's like a test of virtue. It's a test of where are you, let's say, on the scale of goods. And so if you, and then what you ask for, you'll get. But because you're not high enough on the left on the scale of goods, you're going to get all the side effects that you weren't conscious enough or you weren't concentrated enough to get. So you're going to get what you wanted and then all the side effects come with it. So a good example of that is Facebook. That's probably one of the best examples to understand is that I really don't think that Zuckerberg is a bad guy at the origin. I think he's just naive. He, he's very smart and naive and he's like, we're going to make this thing, this community, and it's going to have these functionalities. And he never really asked himself, what good is it serving ultimately? And also there's a secret reason why it exists that they don't tell you, which is ultimately to make money. And so that's actually the secret reason behind, let's say, Facebook. And so because of that, no matter what functionality they put into it, the only thing it wants from you is your attention. That's all it wants. It has your attention. It runs. If it doesn't have your attention, it doesn't. And the reason why it wants your attention, because it monetizes your attention. So then you have this thing which manifests itself a Being that has agency over us, that has power over us ultimately. But because it is not serving the proper good, it becomes parasitic and it gets out of control and it starts to manifest all these things that are. That weren't intended in the first place, but that were there. If you had looked at the good that it was serving at the outset. And so it has. So you could say that Facebook is supposed. It was supposed to serve man. It was supposed to be an emerging community that was there to serve the needs of man, but because it had a goal, which was to make money just. Or that was like the first goal, then everything else starts to get wobbly. And then you realize that it ends up serving the darker aspects of ourselves. It just ends up serving your passions, you could say. So it becomes distorted. And then because you realize that the easiest way to get someone's attention is not to propose to them the good, that's actually. It hurts, it's hard, it takes effort, it's difficult, it's to make you angry, it's to get you excited, to just stimulate the lower aspects of your desires. And that's how it'll get your attention. But then you can understand, then you can understand, like, say, Facebook, that this causal pattern, it is causal, it actually causes behavior in us and it brings us together towards purposes that it is at once above us, but it should, or if it wanted it to work well, it would have been in the service of man. You could say like M now with a capital M. And I think that that at least in terms of the problem of understanding the consciousness of higher order beings, I think it's probably Saint Maximus now becomes the key to that again, which is that we see these higher structures through human consciousness. And that is completely the right way to see it, that human consciousness becomes the crux of how these higher level beings exist. And that is totally fine. But it only works if we have a kind of distilled man, a man which is, I mean, the best. The image is the heavenly man, a man that is all that man can and should be. It's the highest image of what man is. And it gets pulled into one place and it becomes like an image of what that is. And I think that that's what in the Old Testament the notion of the Son of Man was. And so the Son of Man receives from God all power and authority over the world. You see that in the book of Daniel, right? So it's like the Son of Man descends from heaven and has all the power of God, but is the heavenly image of man in the world. And I think that without that image, and so you see it, you see it then used in the Renaissance Neoplatonists, they'll have versions of that, right, where they'll have Leonardo da Vinci's perfect man. Or you'll have different notions of this ideal, idealized man that the Renaissance thinkers will try to bring into the conversation to make sense of the microcosm and macrocosm problem. But I do think that no matter how we look at it, that might be a really good place to look for us to be able to talk about the question of distributed cognition or the manner in which principalities exist, because they do have so the image that St. Paul talks about. So St. Paul talks about these principalities and powers that are managing us. And he says something like, Christ is at this moment secretly ascending and dominating over the principalities and powers. That is the image that was given to us of man in Christ. Now this is where I'm going strictly into the Christian idea that it does reveal to us the image of what the proper image of man, which will rule properly over the principalities. And that has to a certain extent to do with the problem that you're talking about yesterday in terms of the multiple consciousness positions, like the multiple eyes. Because what you realize is that the man, the high, and this is, I think it's also why it was scandalous when the story burst out into the world, is that the man that is the heavenly man, is the one who is willing to die, is the one who is willing to let go of all these high positions. And that looks like dying. It's a self sacrifice, willing to sacrifice all these little selves in order to enter into the ground of being that John was talking about yesterday. So the story of Christ, like the image of Jesus on the cross, it's so bothersome. It's so weird. You know, you go into a church and we're used to it, but it's like, why do we have this dead guy looking at us right from the east where the sun rises? It's like the origin. He's the origin, right? So this guy on the cross is the origin. Saint Maximus says crazy things. Like, he says things that sound crazy at the outset, but I think they're quite reasonable. He, he says when Christ was on the cross, he was creating the world. It's like, okay, yeah, not going to fit that in a scientific textbook. But the act, let's say, if you can imagine a perfect act of self sacrifice, that act is the origin of the principalities Right. It's the. Or is the origin of the proper order of the world. And that if, if that happens, then things lay themselves out under it in the right way. So you could say in terms of your mystical experiences or the way that mystics talk about it, right? And so they. All these things that they use, ego, death, or whatever, all these types of terms that they use is that if you reach that point behind the I positions, you enter into a space which both recognizes that none of these positions have existence in themselves, but that they all have existence because they are held together in this place. This place which in some ways is beyond particular care, but is like the source of all care, you could say, right? It's like it's beyond the particular loves, but it's the source of all loves. And so I really do believe that the story of Jesus, if we start to think of it even in terms of the conversations we're having, we'll be able to reveal some things about why the story looks the way it does. Because it's a very strange. And it's a very strange story. You think like, why is it that that story. And so even as a secular materialist, it's like, why did that story become the backbone of Western thinking? Why did that story become the backbone of Western thinking on morality? Because we. And even like I think most people today will believe something like that. Self sacrifice has value. And it's like, really? I mean, okay, but why, like why. Why do you think that? Or why do you think that self sacrifice has a causal. Causes the world to exist properly? And I've been thinking about that a lot in terms of trying to understand how we also categorize things. And I mentioned this a bit, but I want to go just before I end, I want to go through it because I want you to see that I know it's hard, at least for people that are. They're used to the Christian language. It's hard because sometimes you just hear the story and you have this barrier. I get it. But if for something to exist as one, the multiple aspects of that thing, whatever it is, because they do all. They could also exist in other ways. They have millions of other ways in which they could exist. They could have other functions, other. They have to give themselves to the One. Okay, so remember what I said, it happens through man. That's totally fine. I'm not saying that the parts of the glass have this will, that they're giving up their will and that they're moving towards the unity of the glass. Like I'M not saying that, but if that's how you want to understand it, that's also fine. Whatever. I'm just trying to help understand that there's a need for idiosyncrasy to be sacrificed towards the whole. And that is how things actually cohere into one. So self sacrifice is at the origin of the unity in things. And there's also a manner in which the one also has to give itself to the many. Because nothing is perfect. You have to, right? So it's like if I imagine the form of the glass almost in the Platonic sense, the perfect glass. There has to be a kind of flexibility to let multiplicity be possible, right? To let the glass exist, make one, it's out of wood or out of glass, out of metal, have different sizes. There has to be a kind of giving up of the purity of the one so that the many can exist. This is, of course, something if you, in any team or in any group, you'll definitely, at some point see that there can be the goal of the team, the goal of whatever it is we're doing. And that will be that which draws us together. We're going to give our idiosyncrasies to that. Right? If I'm playing a sport, if I'm playing basketball, I'm not hanging out with my girlfriend. I'm not doing other things. I am giving away. I'm sacrificing all these aspects of me in order to give myself to this unity that I'm participating in. So I'm joined together with others. I'm doing it in love towards the good. And so there's a sacrificial aspect to that. But there's also a manner in which the team that I'm participating in also has to give itself to. To the players. It has to. It has to kind of give itself in love to the players and care about even the players. The players, let's say idiosyncrasies or the things about the players which don't totally fit. I have to. I have to have give some mercy towards that. Or else, because nobody is a perfect basketball player. Nobody is just a basketball player. There will be that messiness. And so I have to. The one has to give itself to the many, and the many have to give itself to the One for that to exist. And that's what I think. I think that's one of the things, I think that Christ, let's say, reveals in his story. And I think that's probably also why after Christ, after the story of Christ. The sacrificial system ends pretty much everywhere. Like the actual physical, you know, scapegoat sacrifices. And all these types of, of physical, ritualized sacrifice, they. They all tend to kind of peter out because he's revealing a different mode of sacrifice which is actually more primordial to how things work and that. And it's the. Actually, it's like actually self sacrifice is the way. So if you want your family to bind together, you can do it with a black sheep. It works, by the way, so you can have a member of your family that's a black sheep and you can just put all the blame on them, whatever problems your family has, their fault, whatever issue they have. And you'll find unity in blaming the black sheep. It'll work. I'm telling you, it's like it's their fault. And now we love each other more because we know it's their fault. And you see it, it's happening right now. Like all the scapegoating, it's crazy. Sadly coming back again. And then what Christ reveals is that, no, actually the proper mode of sacrifice is self sacrifice. So if you want your family to cohere and you're a father, you have to give yourself to the whole. And if you do that, it's much more powerful and will create much more unity than the scapegoat part. And then the same for the group. The group. It's like, it's actually. If I sacrifice my idiosyncrasy towards this common good, then it's the best way for unity and multiplicity to coexist. Hopefully I've been. I'm going over my time, sorry. So hopefully this is just the thought that I've had regarding Dante and the notion of the good, but also related to the problem, even categorization and how higher beings can be said to exist. And not because we've been struggling for months now. Everybody's struggling about talking about egregores and all these different terms they're trying to talk about, to discuss how these higher patterns are causal. And I really do think that the notion of man, or distinct, instilled man is the way to. That it goes through that. It's like a filter. The notion of man is this filter that makes these principalities causal on us. Kind of accept it implicitly because we recognize that they serve the good. Even if we're wrong, we recognize that they serve the good of man. And even if we, like I said, even if we're off on that, it's still that because In Dante, all the bad things you do are also driven by love. It's just distorted, right? It's like if becoming a drug addict is love, love is what makes you become a drug addict, right? Love is what makes you become anything like you cheat on your wife or whatever bad thing that you're going to do. It's always love towards a perceived good that drives you towards it. And you can get it wrong, but it's still the same structure. So anyways, hopefully that was helpful a little bit in the discussion. It wasn't too rambly because I was trying to bring it together. And yeah, thank you. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes."}
