{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":0.64,"end":74.61,"speaker":"Ted Lewis","text":"The dark powers want to use symbol in a way that sort of obfuscates what's really there. Powers are always based when they have a kind of a bent agenda. They have to have some kind of lie that's inherent to the way they're working in the symbolic world. Because true symbol is integrity between what's on the inside and what's on the outside. It's kind of the way I think about glory. True glory is like pure integrity of what's on the inside and the outside. Like a piece of amber, you know, and you put it up to the sun and it's just like this beautiful translucent thing that you look through and it's solid all the way through. Whereas a distorted symbol. And now we get into things like idols and advertising and words and stereotypes and things that kind of like have a certain force socially. They're all predicated on some kind of a lie. They have a duplicitous nature. They function precisely because the inside does not have integrity with the outside. The outside has more of like a grandiosity which we kind of like almost attribute to things by virtue of association, but they're hollowed out. They really don't have integrity of meaning."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":74.77,"end":156.86,"speaker":"Jonathan Pageau","text":"Yeah, this is Jonathan Pedro. Welcome to the symbolic world. So hello everyone. I am very happy to be here with Ted Lewis. Ted Lewis is the director of the International Jacques Elul Society. Christian Roy, who you may have seen on this channel and is a good friend of mine, presented us. I myself have read some Jacques Lul. I've struggled with Jacques Elul in some ways. I feel like his insight on technology is very important for us right now to understand the problem, civilization, the problem of technology. But also of course, as an orthodox Christian and as someone who makes images, I've struggled with some other aspects of Jacques Elul, which is what I see as the true negative vision of the city, of civilization, of the image of spatiality and the possibility of these things to manifest in the world today. And so I'm really excited to be able to kind of engage this discussion with Ted. And so Ted, thanks for coming along."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":157.42,"end":159.18,"speaker":"Ted Lewis","text":"Yeah, it's great to join in here."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":159.82,"end":170.16,"speaker":"Jonathan Pageau","text":"So I think a lot of people will know Jacques Lulil, but maybe several will not. So could you give people a sense of who he was? What's his importance for us today?"}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":170.64,"end":332.08,"speaker":"Ted Lewis","text":"Yeah, I'll be glad to. Jacques Ellul is a mid century thinker and in many ways is a pioneer in the area of critiquing technology. And his prominent book, the Technological Society Came out first in 1954 in the French edition, 1964 in English. So we're coming up on a 70th year anniversary. But even before that, during the Nazi era, Jacques Ellul and his friend Bernard Charbonneau and others in the personalist context in France were very concerned about how the force of technology and a mechanized world would have an effect on society as well as our very humanity. So one of the threads through all of his writings, I mean, he wrote a lot, 40 books, died in 1994. But the thread through all of that is sort of a warning that if Western people do not really come to terms with how the force of progress and technology, when it's untethered from ethics, will end up having a deep effect on even the way we conceive ourselves as human beings. A simple way to think about it is to think about how environments influence us. So Elul kind of split things into three zones. There's sort of like a time where nature was our environment. And social villages and cultural things are primarily rooted in how nature forms and patterns human life. And then the next stage has to do with just what he calls the environment of the social. This is the society. We might think of the Greek city state and the Roman world and into the medieval world and Renaissance. And the social world has more influence from how humanity is starting to lift itself away from nature and to create new ways of thinking and being and science and whatnot. Then for Elul, technology itself becomes a third kind of environment, an environment which informs who we are as people. It almost becomes totalistic for him. Some people think he's too far with that totalistic way about technology as a force dominates every part of human life. But those are some broad strokes around his writings."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":332.4,"end":354.24,"speaker":"Jonathan Pageau","text":"Yeah, I think the thing that for myself, made me feel close to Elul is that he definitely seems to understand, because it's important for people to understand that Elul was also a very serious Christian. You know, his insight, much of the way that he thought came from the Bible, came from his own. Was he reformed? Was he Protestant? I don't know what his tradition was."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":354.87,"end":405.11,"speaker":"Ted Lewis","text":"Yeah. Primarily identified with, with the French reform and had had quite a bit of influence within France and in those circles. One of the more, more significant things is before he was really a Christian, he had read Karl Marx. He fully embraced a Marxist approach. And in many ways that continued to inform his. His sociology. And then he starts to read Kierkegaard. I think he's known for reading just about everything Kierkegaard. Wrote, which is really astounding. And then he started getting introduced to Karl Barth. So Kierkegaard and Barth kind of advanced his Christianity out of a traditional Calvinist reform zone into what you might call more of a dialectical perspective of faith matters."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":406.47,"end":448.46,"speaker":"Jonathan Pageau","text":"And so one of the things that impressed me was that he does seem to really pick up very much on a clear strain in the Bible, which is you could call it the Cainite image of civilization, which is that we find in the first chapters of Genesis that civilization is an issue of the descendants of Cain and is in some ways a kind of reaction to the curse and compensation for the curse in some ways. To think about that, that he seems to see the city in that. That vein and civilization and the technification of society in this. This kind of line, let's say canine line."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":448.94,"end":519.56,"speaker":"Ted Lewis","text":"And you really have to understand a Lowell's critique of the city. And he does come on pretty strong as a follow up to Harvey Cox's book, the Secular City, where Harvey Cox tends to have more of an open mindedness. Like now, now that we've come into, you know, the fullness of modern society, all the virtues that might come with that. What Ellul saw in that was a sacralization of the city. So it's not the city per se, with all of its architecture and structures and institutions. For Elul, that's most problematic. It's the fact that it gets lifted up like a Tower of Babel as something that becomes autonomous with its separate law, autonomous from God. So that that's really at the heart of Elul's critique of the city is it becomes archetypal, just like the Tower of Babel of human enterprises that don't know how to be more interactive and participatory with God in a spiritual realm. Yeah."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":519.56,"end":572.1,"speaker":"Jonathan Pageau","text":"And in this way, this is where in some ways it starts to rub with me in terms of especially being an orthodox Christian, is that his interpretation of that leads all the way into his vision, for example, of image making and also of liturgy. How he saw liturgy as something similar to this process where he tends to be suspicious of all. Of all formalizations. You know, any type of formalization seems to be suspicious and prone to becoming idols. And his approach seems to be a kind of desire to desacralize or demythologize, you know, very much like Karl Barth, very much in that. In that sense, where in some ways he sees Christianity as the ultimate desacralizer. You could say that desacralizes everything. Is that. Do you think my understanding is right."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":572.1,"end":627.06,"speaker":"Ted Lewis","text":"In that I think it's fairly good. And you have to understand that Alul once went to a Nazi rally sometime in the later 30s. He was at one of those rallies and he even admitted that he felt the pull, the magnetism, the group energy getting drawn into that. And so his reaction to ceremony and ritual and the use of arts ultimately has to be understood through the lens of how it can be used to manipulate society. Of course, he then writes Empire of the Nonsense, where he kind of feels like most modern art is itself sort of dominated by a technological flow within the 20th century. So he doesn't have a whole lot of positive things to say about modern art."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":627.77,"end":690.06,"speaker":"Laura Diaz","text":"Tucson the Weight is Over Mediweight Loss they're officially open on North Oracle Road. That's right, no more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project. Ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight Loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com pack up though."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":690.86,"end":695.22,"speaker":"Ted Lewis","text":"Because Chevy SUVs have the capability to take you to some incredible places like."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":695.22,"end":700.86,"speaker":"Jonathan Pageau","text":"An adventure in the middle of in the Equinox, Active, an SUV that will help you get away with confidence."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":701.1,"end":706.39,"speaker":"Ted Lewis","text":"Or head off for a night in the in Chevy Traverse with all the tech you need to stay connected."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":706.55,"end":708.95,"speaker":"Jonathan Pageau","text":"While the undeniable value of Chevy Trax."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":708.95,"end":714.31,"speaker":"Ted Lewis","text":"Will keep you moving from here to over here to way over here, get to all the places you want to."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":714.31,"end":730.39,"speaker":"Jonathan Pageau","text":"Be with Chevy SUVs. See Watson or O'Reilly Chevrolet. And so what is his view of let's say because there is an eschatological image of the city right in the book of Revelation and So how does for himself, like, how does he reconcile those images together?"}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":731.01,"end":828.96,"speaker":"Ted Lewis","text":"Well, I'm, I'm glad you used the word reconcile because that is a word he likes to use where image and word come together in a, in a fruitful way. So probably the most important book for this topic of, of his perspective on images and liturgy and, and all of that is the Humiliation of the Word. It happens to be one of my favorite books and I was able to bring it back into print recently. And at the end of that book, he has a whole chapter called Reconciliation. And by that he's talking about Jesus, Word of God, ultimate image of God as reconciling word and image in a way that restores the balance of both. And then that has implications then for other aspects of Christian life. So even though he's very, very hard on image and he prizes word, I mean, the very title, the Humiliation of the Word is sort of like grieving over the fact that we are an image dominated society, image saturated, and we prize more what we see rather than what we hear. And he goes into great depth about how the loss of our capacity to hear well, affects our thinking, our way of relating to, to the spiritual realm and to God. And it kind of roots us much more in the here and now. So bringing back a restoration or reconciliation of word and image for him is the pathway modeled by Jesus to, you know, to, to bring us into a better zone."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":830.24,"end":913.09,"speaker":"Jonathan Pageau","text":"And so one of the things that made me fascinated to talk about this is that recently, you know, Kerstan gave me this wonderful edition of the ELUL Forum that deals in large part with the question of how Jacques Elude talked about principalities and powers. This is, I think, something which is extremely relevant today as we're noticing. One of the things that social media has done and the Internet has done is that it has accelerated the question of the relationship between attention and the way in which social media, social forces function. And what it has done is that made it possible for us because it's accelerating it so much. It's helping even secular people see the types of agencies which take over and act through people. And it's made it easier. At least what I've noticed. It made it easier for me to talk about this notion that there are types of agencies or principalities, powers. St. Paul uses different words to talk about these, that that kind of, let's say, have a type of agency over human behavior. And this in some ways is one of the subjects that ELUL has treated, you know, in a moment where it was in Some ways very unpopular to talk about these types of subjects. So can you give us a sense of how he perceived these. These types of transpersonal agencies?"}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":913.65,"end":1034.6,"speaker":"Ted Lewis","text":"Yeah, it's a. It's a big topic, and I have to be humble to say I'm still sort of unpacking his perspective. And then what I think about it, he definitely felt and believed that there were real principalities and powers simply because the Bible treats them as real. And Marva dawn is someone who did a fair amount of work with this topic. She did her whole dissertation on Elul's view of the powers and principalities and then wrote some other things about it. And she highlights that Allul kind of hedged a little bit on what might be called the ontological being of powers when it comes to agency and personification, which, you know, through Christian tradition. When we think of powers as having volitional dimension, I would say he wasn't like fully there in his descriptions, as you'll find in other Christian writings. And yet for him, they are. They do have independent force beyond what you could just study empirically as a social scientist. Just a couple examples for him was like the power of mammon, which is a biblical word related to money and wealth and material things which have a certain power then over our need to protect what we save. It's similar to the way we kind of think of a power over someone who has an addictive or a compulsive relation to what enslaves them. And everyone who's in the recovery world kind of knows that these powers are way beyond what they themselves can control. And that's why we use terms like agency from beyond, because it's. It's the metaphoric language that helps us be honest about the fact that there's something greater that's influencing us."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":1035,"end":1204.2,"speaker":"Jonathan Pageau","text":"Yeah. In the text that I was reading, there's a letter from Jacques Elle to Marva Dawn. And he seems, at least in some of the parts of the letter, to be wary, to be cautious. Like you said, it's as if he's a little. He tends to have a bit of a reductionist approach to it, where he doesn't want to fully talk about agency. But let me just read a little text from it here. He talks about these powers, and he says, that is to say they certainly exist, but not as entities comparable to human and materializable persons. They exist in as much as they are manifestations and not as beings. Thus one finds the evil phenomena, the fact of money, of the city, of the state, and of technique, and these Phenomena reveal the existence of an evil spiritual power, but not as a sort of powerful angel reigning over the world and using money or the state. And so Satan is the accusation. Therefore, everywhere there is an accusation, there's Satan. But it is not a personage who provokes and produces the accusations. The accusation exists by itself. And so in that, I can see that he's really struggling. He is really struggling to talk about this. And in some ways, I feel like I kind of understand, especially in the moment where, in the time when he was writing this, how he was dealing with this. But there's a way in which, in some ways, what he's saying about these agencies and powers is something that a reductionist would say about us, about humans. He would say there is no agency. There's only the fact. There's only the actions, there's only the cells, there's only the electric impulses in your brain because you cannot detect true agency through material calculation. Agency always appears above, let's say, the material facts. And so I was a little surprised because I really do think that someone would take his argument and apply it to a person, and it would be as valid as the way that he tries to skirt the problem of transpersonal agency by attributing only the factors. Now, I understand that it's difficult because we are materialists, and therefore we're not used to thinking analogically. And so when we think of these angels and we see these beings with wings, we kind of freak out because it bothers us to think that way. We can't think that even those representations are always analogical to some other form of an invisible agency, let's say."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":1205.16,"end":1390.79,"speaker":"Ted Lewis","text":"Yeah, this is a deep topic. I might kind of come at this topic from a different angle, and I'd like to throw out the word symbol. Symbol, Sim, Greek for with bull. Greek for throwing something. You know, we get our word ball from that part of the Greek words that have the bowl in it. So symbol to throw with, parable to throw, beyond diabol or diabolic to throw apart. So the. The reason I kind of want to start with symbol is that in a way, God's effort to reach humanity and CS Lewis is kind of big on this. Has to go through symbol to reach us. And that doesn't mean that we can deconstruct it. And then there's nothing there. We come to realize it's the necessary means for one realm that's so incomprehensible and beyond to reach us, has to go through metaphor and symbol for us to make sense. Of it. And so I think even when it comes to the darker powers, all we have is language and symbol in a way to apprehend it. Yeah, but like wind, like gravity, like frequencies now that, you know, make our garage door go up and down. We. We know that this stuff is, like, really happening because we see the effects. And so I think that's part of being just limited human beings is that we have to learn to. To know that we're really not going to get that much more than symbol. And yet that's still a rich area for us to traffic in. And what I kind of find interesting is that the dark powers want to use symbol in a way that sort of obfuscates what's really there. So powers are always based. I mean, when they have kind of a bent agenda, they have to have some kind of lie that's inherent to the way they're working in the symbolic world. Because true symbol is integrity between what's on the inside and what's on the outside. It's kind of the way I think about glory. True glory is like, pure integrity of what's on the inside and the outside. Like, kind of like when you get like. Like a piece of amber, you know, and you put it up to the sun and it's just like this beautiful translucent thing that you look through and it's solid all the way through. Where. Whereas a distorted symbol. And now we get into things like idols and advertising and words and stereotypes and things that kind of like, have a certain force socially. They're all predicated on some kind of a lie. They have a duplicitous nature."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":1391.19,"end":1391.75,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":1392.79,"end":1413.79,"speaker":"Ted Lewis","text":"And they function precisely because their inside does not have integrity with the outside. The outside has more of like, a grandiosity which we kind of like, almost attribute to things by virtue of association, but they're hollowed out. They really don't have integrity of meaning."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":1414.03,"end":1463.78,"speaker":"Jonathan Pageau","text":"Yeah. Would you say that the very. Because this, I think, would fit well with what Elul says, which is that the lie in some ways is the autonomous existence of the thing itself. That is, you know, the state presenting itself as the summit of authority, for example, that itself is the lie which forces the disjunction between, let's say, the outward appearance or the outward symbol and the interiority of the. Of what is symbolized. And so it forces. You know, when a state believes that it is all powerful, like in the authoritarian states that we saw in the 20th century, it is forced to use a religious language which is not appropriate for itself in order to apply it to itself because it is in some ways like the Tower of Babel taking up the. The place of God, we could say."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":1464.02,"end":1516.92,"speaker":"Ted Lewis","text":"Yeah, And I think what fits with what you're saying is. Is the phrase pretentious powers, one of Elul's favorite verses right out of second Corinthians 10, has this phrase of pretentious powers, you know, that we can deconstruct and bring captive to the lordship of Christ. And by pretentious, it means it. It has the appearance of being very powerful. This is. This is what I call the outside manifestation of a power that presents, well, like a state, like a nation, you know, like. Like a new car or whatever. But on the inside has some contradictions, what you're calling a lie. There's always an Achilles heel, you know, on the inside of these duplicitous symbols because they're. They're. They have to continually be propped up."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":1518.84,"end":1519.2,"speaker":"Jonathan Pageau","text":"With."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":1519.2,"end":1529.33,"speaker":"Ted Lewis","text":"With falsehoods and narratives and. And things which, you know, again, lack the integrity of meaning, of the way things truly are in the world."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":1530.13,"end":1666.85,"speaker":"Jonathan Pageau","text":"And so one of the ways that I. So this is, I think, in terms of Elul, maybe I can phrase it this way, because I think it relates to what we're saying now, which is that Elul seems to want to portray the negative in the sense that in some ways, right, the crucifixion of Christ, the humiliation of Christ, the capacity to embody weakness, subverts the whole structure, right? And so in some ways, it exposes the powers similar to the way that Reni Girard talks about. And I think that in that sense, he is completely right. And there's something about what he's saying which pierces very truly. Where I wonder, is that in Scripture, there's also a whole other strain, which is the tabernacle, the temple, and even Ezekiel's third Temple, which is a kind of vision of an eschatological temple and this image of the Son of Man. And so, for example, in Revelation, you have this final image where you have two. So even in the text I was reading, he was alluding to the Lamb and to the idea of the Lamb as this. This insane image, right? It's like, why the Lamb at the summit of the hierarchy, right? That's the subvertive image. But in the vision, it's actually two images, right? It's the Son of Man and the Lamb. So it's the King, judge, ruler, and the Lamb joined together. So there are these two strange. In Scripture, it can seem contradictory, but they're there, right? The vision of the tabernacle or the God asking Moses to build a tabernacle is very much using tropes related to Cain. You know, the Bezalel, the way that he's described as an artificer. The only other person called an artificer in scripture, I think, is Tubal Cain. And so it's like there's this whole other strain, and that's the one that I see Elil, let's say, ignore, which I think would lead him to be something like a Christian anarchist. Like, it's as if art, all structure, is dangerous in itself. So I don't know what you think of that. I'm kind of poking here, but I want to know what you think."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":1666.85,"end":1672.53,"speaker":"Ted Lewis","text":"Well, I'll kind of talk out loud, speaking more of my thinking than trying to represent Elul here."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":1672.53,"end":1673.29,"speaker":"Jonathan Pageau","text":"Yeah, okay, okay."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":1673.29,"end":1792.06,"speaker":"Ted Lewis","text":"But then I will come back to him. But if you think about Rene Girard's concept of sacrifice as having cultural rootage in the Hebrew tradition as well as the ancient near east, and from his perspective, it slowly is being or it's evolving into a new perspective which upends the whole sacrificial system itself. It's like a counter narrative that involves nonviolence and forgiveness and relationality and upending. So it's possible, I think, that when you look at liturgical and artistic and those physical traditions that come out of the Old Testament, that those themselves have a type of evolving understanding. So by the time Jesus is talking to the woman at the well in Samaria, he says, you know, it's neither that temple or this temple people are going to worship in spirit and truth. I think Elul kind of shares a little bit of that kind of sympathy where the. The temple itself has. Has, like, aspects of legitimate tradition, but ultimately becomes not just replaced by something spiritual, but it actually becomes sort of. There's a tension with it. There's a subverted element. And Jesus himself is using language to confront the temple institution itself by kind of broadening people's minds into these paradoxical ways of thinking that are transcultural. So I don't know if that's a window in talking about that, but I think Allul kind of shares some of that sense of There's a trajectory, just like a trajectory for Girard about sacrifice. Maybe there is for visual culture, too."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":1792.46,"end":1882.41,"speaker":"Jonathan Pageau","text":"And I think, yeah. And so I think that that's. Maybe I have a yes and way of thinking, you know, not a. Not a this but this or, like, I tend to have a yes and way of thinking. And so. And so even in the story of Christ, you have those images, and then you also have the fact that he cleansed the temple. He wanted to purify the space that God had established. Then I also think of the eschatological vision. The image of the heavenly Jerusalem is very powerful because it seems to solve the problem, because the way that it's presented is, is that the kings of all nations offer their crown up into the heavenly city, and all the glory of all the nations are elevated into the heavenly Jerusalem. And so it's not that the nations are destroyed, it's not that the kings don't exist, is that they exist in the proper order. So whatever particular glory a nation has is given up to something higher. And that's its glory, actually. Right. It's like that is what his glory is. Whatever it can offer up and whatever it doesn't hold on to itself and. And tries to, you know, like. Like the kind of. The kind of dangerous nationalism that we can see that that is actually a kind of way in which all this participates on this. So there isn't a. There isn't just the negative part. There's also this kind of positive way that we can. That civilization, that art, that culture, that. That. That. That authority, that all these things can participate ultimately in the kingdom."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":1884.01,"end":1910.41,"speaker":"Ted Lewis","text":"Yeah, I. I think I would affirm that. And there's. There's a affirming incarnational blessing of. Of things that. That are, with integrity, reflect the nature of God and the. The intended, you know, creation that was set out for us. And at the same time, Jesus is the great disturber of everything in every culture that does not align with. With. With all of that."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":1910.57,"end":1938.16,"speaker":"Jonathan Pageau","text":"Yeah, that's kind of the way that I. I tend to. I tend to see it myself. Yeah, it's. So in terms of. In terms of. How do you feel that Elul speaks now? Because, you know, we're seeing in some ways the. The radical acceleration of technification. You know, everybody's talking about AI right now. It's. It's wild because it. It's as if now these principalities and powers are almost like appearing in front of us. And so. And so what do you. What do you think?"}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":1938.56,"end":2070.82,"speaker":"Ted Lewis","text":"Yeah, well, just as an aside, I'm. I'm a real fan of C.S. lewis's Ransom Trilogy and the third one, that Hideous Strength, is, you know, you can get away with saying things in fiction that you can't always convey in nonfiction. And so I just think that that's a great example for us to think into some of the trends that that we're wrestling with now when you think about how powers are related to institutions and whatnot. For Elul, I personally think that one of his most important books for our current time is the Technological Bluff in many ways is the third of a trilogy. If you start with the Technological Society that he wrote in the 50s, and then in the 70s he wrote the Technological System, which adds some new perspective on his original thesis. And then thirdly he wrote the Technological Bluff. And by bluff he's talking about how technique driven methods in our society present well to provide solutions. He even uses the word salvation at times because of this problem, this technology is going to save us from whatnot. And yet the bluff is we really don't know exactly how the rollouts are going to look. We don't know what all the effects are. He uses terms like consequences are unforeseeable, they're unpredictable, sometimes even unmanageable. And because we have such a high general faith in technology, we think that's the only way to really solve something. We have a pandemic which arguably comes out of a technological milieu, but now we have to find a technological solution to deal with it. Well, now that presents some additional fallout challenges. And this is the bluff that he says we need to call if we're really going to not let ourselves be in these cycles of technological soteriology."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":2071.23,"end":2071.47,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":2071.47,"end":2133.33,"speaker":"Laura Diaz","text":"Tucson, the weight is Over Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication, but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better, and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com yeah, yeah."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":2133.33,"end":2189.24,"speaker":"Jonathan Pageau","text":"And one of the things that Illude seems to present, which is very powerful, is that in some ways what happens in a technological state, what happens when the technological takes over the narrative, is that it's only means that matters. That in some ways we don't even know what the goal is. It's only the implementation of means, which seems to be the very purpose of society itself. And it's almost like you said, it's as if. And then the side effects of the implementation create new needs and new problems that have to be sorted out by the implementation of more and more efficient and technical means. And so it's like it makes you feel like you're moving and you. And you're moving towards something, but there is no, There is no end point. Besides what more technical, efficient things like, you know, what. What is the purpose of all this? Where are we going?"}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":2189.72,"end":2197.4,"speaker":"Ted Lewis","text":"Well, when we, we get away from. Yeah. Healthy, sustainable systems that have give and take and balance and, and whatnot."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":2197.88,"end":2249.88,"speaker":"Jonathan Pageau","text":"Yeah. There's a sense in which we, you know, for example, like the, the. The idea that technicity is supposed to make us happy. I guess, I guess maybe that's the best thing that you can, or the most positive idea you can. Makes it easier, maybe in order for us. I'm trying to be generous to this kind of run towards technicity to make life easier, to make things for us to do the things that we care about which are not related to life or something like that, like dileisure and pleasure like that. But we can see through, like the increase in depression and the increase in kind of a kind of madness that people are falling into, you know, especially as identity starts to fragment, you know, they don't know where to look for meaning."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":2250.36,"end":2271.58,"speaker":"Ted Lewis","text":"Yeah. And I think this aligns very well with C.S. lewis's abolition of man, another one of my favorites, because he. In the same way you're talking about means separated from ends, that fits well with what Lewis calls, you know, agendas of progress being untethered from traditional ethics."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":2271.82,"end":2272.3,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":2272.46,"end":2308.06,"speaker":"Ted Lewis","text":"Because ethics are ultimately about understanding our best ends and then balancing ourselves in relation to those they have a claim on. On society to create good ends. But once, once you remove traditional ethics from the realm of applied science, then you can see how the means becomes more dominant. It's the same way in the artistic and image culture where the form begins to dominate over content and meaning. Similar application there."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":2308.3,"end":2387.6,"speaker":"Jonathan Pageau","text":"Yeah, you see that. I mean, advertisement is the ultimate example of that. And I mean, it's fascinating. I Don't know if Ellul. I mean, for sure, CS Lewis had that intuition. Very much so, which is that in some ways the increase in man wanting to free himself from transcendent attachment, the desire for man to kind of fulfill his own destiny, to fulfill his own will, and to kind of fulfill his own desire for power, ultimately leads very surprise. It's not that surprising, but it can seem surprising to some, to an anti human narrative ultimately, where in some ways we're seeing it now in the more extreme version of the environmental narrative, where it's almost as if humans are just parasites in the world and that they, you know, all they do is consume and it'd be better if there were fewer of them in the world. And you see it now with AI as well, this kind of idea that we need to be transcendent ourselves. We're going to give birth to something that will ultimately destroy us or consume us. And there's almost like a suicidal ecstasy. It's very disturbing to see that that's at the end of this kind of desire for technical power. But I don't know if Elil had insight on that, if, you know, that he had kind of foreseen something like that."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":2388.16,"end":2461.2,"speaker":"Ted Lewis","text":"Well, I see what you're saying as requiring social compliancy. In other words, you can only go in that direction if you don't allow for dissent and that everyone has what might be called a shared reality. Since you're in Canada, I'll reference an interesting video that comes out by Horizons Canada, which has a Tower of Babel motif in it. And what's really interesting about the narrative, because it's all about where technology and. And humanity find a way to work together for a better future. But it has a Tower of Babel image in it. You know, that's. That's all about, you know, people all coming together for one big project. And it reverses the narrative because God is now the. The antagonist in a scenario where it's good for people to come together, think alike, share one language, and create a better shared future. It's unfortunate that that project was thwarted and God scattered people laterally back into their creaturehood."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":2461.36,"end":2488.44,"speaker":"Jonathan Pageau","text":"Yeah, and this is something that has been going on for a while. One of the main buildings for the European Union, I think it's one of these globalist associations, is literally designed based on Bruegel's Tower of Babel. And when the European Union started to kind of meet, one of the posters they put out was a huge poster of Bruegel's Tower of Babel. And it was like, you know, we're gonna, basically, we're gonna finish the project, you know, we're gonna finally do this Right."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":2488.44,"end":2499.92,"speaker":"Ted Lewis","text":"And you know, those 16th century artists, there's so many Babel painters, many of them show the tower incomplete as a, both social and theological statement."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":2500.32,"end":2500.88,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":2501.52,"end":2516.62,"speaker":"Ted Lewis","text":"Because, because the, the fact that it was not completed is itself a commentary on, on the, you know, the, the, the false efforts to, to try to build something independent of God."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":2516.7,"end":2523.98,"speaker":"Jonathan Pageau","text":"Yeah. And that's the right, that's the right way to see it is that to imagine that anything is complete is the sin in itself. Right?"}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":2523.98,"end":2524.26,"speaker":"Ted Lewis","text":"Yeah."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":2524.26,"end":2530.14,"speaker":"Jonathan Pageau","text":"To imagine that anything can be self contained and complete is a, is the, is the heir of idolatry."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":2530.63,"end":2538.47,"speaker":"Ted Lewis","text":"So here's a nice way to bring our topic back to Powers. And speaking of 16th century, did you know where the phrase hideous strength comes from?"}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":2538.47,"end":2539.51,"speaker":"Jonathan Pageau","text":"No. No, I don't know."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":2539.67,"end":2618.76,"speaker":"Ted Lewis","text":"It's a Tower of Babel phrase. Okay. David Lindsay, a poet from 1555, wrote about that hideous strength and the shadow that it casted six miles in length. And so this is Lewis, as a medieval and Renaissance scholar of literature, comes across this poem, recognizes this phrase, hideous strength, as about the archetypal force from the Babel project, and then uses that all through that hideous strength. And of course the nice, which is such a playful gesture like acronym, you know, for the Institute of the Technocrats, because they're aspiring upward, you know, to have, you know, to build a utopian society. They poke through the heavens, so to speak, just like my hands sort of poking above the box here. And without them knowing it, that opens up a portal for other benign celestial powers to come down to earth and to support the, you know, the team that's fighting against the bad side. So they brought down on their heads their own demise."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":2618.92,"end":2619.32,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":2619.32,"end":2644.18,"speaker":"Ted Lewis","text":"This is a beautiful image to say that Powers have a duplicitous nature because on the outside, again, they present well with, with great force and, and, and everything. But on the inside there's an insecurity and a lie and a contradiction, which means that they ultimately bear the seeds of their own destruction."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":2644.98,"end":2703.14,"speaker":"Jonathan Pageau","text":"Yeah. And I mean, I'm interested in knowing about this as well, because one of the things I haven't seen in Elul also is a mention of angels. That is there is a whole vision in scripture of the divine council. You know, this is something that is becoming, I think with good reason, more popular and talked about today. The idea that, that and the way that it was recuperated in Christian mysticism. Right. For Example in Dionysus, divine hierarchy, he literally uses the words that St. Paul uses to describe what he's talking about in terms of negative influences that oppress us. He uses them to talk about them in terms of their positive. As levels of manifestation from the divine down into human. So thrones, powers, all these things are used by Dionysus to. To describe the way that God kind of descends into the world. And so has he did. Has he talked about that, like the reality of angels, let's say, in the New Testament as well?"}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":2703.78,"end":2716.9,"speaker":"Ted Lewis","text":"I think he kind of hedged on that. You know, you got to understand that he's. He's starts out as a Marxist. And so his. His notion of power and force is, like, akin to the fetishism of commodities."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":2717.14,"end":2717.94,"speaker":"Jonathan Pageau","text":"Yeah, yeah."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":2718.26,"end":2731.23,"speaker":"Ted Lewis","text":"And. And so ultimately, when. When Elul has interest in powers and principalities, biblically, he's interested in their function, not their ontological being."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":2731.39,"end":2731.87,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":2731.87,"end":2756.72,"speaker":"Ted Lewis","text":"So he's not denying their existence. But I think this goes back to the symbol thing. He recognizes that everything is symbolic, whether it's the new Jerusalem or winged beings or whatever, as a way to help us grasp that there's something there that's additional to our, you know, our human cultural realm."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":2756.8,"end":2789.01,"speaker":"Jonathan Pageau","text":"Yeah. But even in, like. Even in terms of functionality. And if you think about St. John in the book of Revelation, when he addresses the angels of the cities. Right. And so there's a sense in which, in that case, the angel of the city. Right. Or the principality of the city is not seen in a negative way. It's just seen as, you know, the. It's a kind of a place where the identity of the city comes together in its agency. And so I address this. This angel in a. In a positive way, not in a negative way."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":2789.25,"end":2791.13,"speaker":"Ted Lewis","text":"Yeah, yeah, yeah."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":2791.13,"end":2915.24,"speaker":"Jonathan Pageau","text":"So, I mean, because I think that that image that you just gave us of the Tower of Babel poking through, you know, and then the surprise that it lets in, you know, benign principalities or good principalities. I think that that's something that we're already seeing, and it's very interesting. So a good example is that during. During. During COVID especially in places where the power of the state was felt very strongly, all of a sudden, it's like it kind of exposed certain things which were already there, hidden certain capacities that the state had that people didn't realize that we're there. And then all of a sudden, this crisis, you know, exposes and makes real the capacity for the state to really control us, you know, in ways that we didn't think Were possible both through narrative, through kind of inner propaganda, like using tools of propaganda inside the country, but then also real power of like, you know, when I was in quarantine, the policemen showed up in my. At my door, right? It's like, these are real. These are real power steps. But another thing that happened is that it. In seeing that agency and in seeing the state act with such force and feeling, I was like, nobody's controlling it, Right? Exactly. Like an agency. It's like, why is it happening all over the world? And there's nobody in charge of this and there's nobody with like. That is like. There's no, like, evil genius sitting there rubbing his hands and making it happen. It's just like it's. It's a form of. It is a pattern which is laying itself in the world. The reaction to that for a lot of people was conversion. Like, in the Orthodox Church, we have seen a massive wave of converts at the end of COVID And I'm talking parishes doubling, tripling all young people, that through this desire of the state to gain absolute power, they were able to perceive something about how the world works that made them want to."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":2915.48,"end":2915.8,"speaker":"Ted Lewis","text":"To."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":2915.8,"end":2918.24,"speaker":"Jonathan Pageau","text":"To attach themselves to something higher, you."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":2918.24,"end":2923.88,"speaker":"Ted Lewis","text":"Know, and that probably did not happen as much in the mainline denominations."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":2924.68,"end":2935.4,"speaker":"Jonathan Pageau","text":"I don't know. I don't know. I just know about, of course, my own. My own. My own church. And so why would you. I don't know. Why would you think that wouldn't have happened in the mainline dominate in denominations, for example?"}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":2935.64,"end":2987,"speaker":"Ted Lewis","text":"Because most mainline denominations lean a little more progressive and liberal, at least in the United States. And so they were more compliant to not gather. And in many cases, they were whittled down more. And many of them are struggling more so with not just attendance, but leadership transitions, vision of what their church, you know, direction is. Whereas in churches, which might not have struggled as much with that sense of compliancy to official narratives, there was probably more of a sense of resistance and alternative community and perhaps that becoming an attractive magnet for other people seeking community."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":2987.4,"end":3042.94,"speaker":"Jonathan Pageau","text":"Yeah, and even the. Even like the. I think because one of the things that happens in these totalizing patterns is that they. There's a sense in which we need to be reduced to individuals. Like, we need to be reduced to just dots, you know, without. Without competing allegiances, you could say, to the. To the massive power of the state and that. And then reducing people to lonely, you know, to like just a lonely. Especially those that didn't have families, lonely guys, lonely women, you know, sitting there in front of Netflix for a whole year. I think it also made the problem very acute where people realized, no, actually I need intermediary communities. I need real connected places where I physically go and talk to people and do that with something that is meaningful and not just arbitrary."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":3043.34,"end":3091.07,"speaker":"Ted Lewis","text":"Lowell talks about that as a key priority in his book Presence in the Modern World, really his first major book, written in the mid-40s. And in contrast to institutional systems that want to have a one way communication to kind of control things, he talks about needing to be with neighbors, needing to have real conversations, prizing localism, you know, and later, of course, his famous phrases, you know, where dialogue ends, propaganda begins. So he had a pretty strong advocacy for those local real life relationship dynamics as a way to kind of maintain a type of resistance in the world."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":3091.39,"end":3116.67,"speaker":"Jonathan Pageau","text":"Yeah. So maybe that's a good place to transition. And let's move into the last question that I have for you is maybe you can tell people about your work and how you see what kind of solutions you see for modern people in this, this increasingly technified world and also increasing centralized authorities. How do you see people finding real life solutions for the, for their lives and for their families, for the people around them?"}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":3117.87,"end":3333.95,"speaker":"Ted Lewis","text":"Yeah, it's a compelling question. And my, my primary work is in the field of restorative justice and conflict resolution for about 25 years. And it's, it's a great calling. And you know, one of the things I've observed as a facilitator is that there's almost a paralysis of dialogue in our western cultures. People just having more caution and reservation about having hard conversations with each other because they're not, maybe, maybe they're not sure how the other person is thinking or how they'll react, or maybe they do know how the other person is thinking and they're afraid that it'll cause a rift in the friendship. So whether it's red blue issues or pandemic issues or race issues or cultural correctness issues, whatever it is, we're experiencing a type of paralysis that's deadening healthy dialogue on so many levels, whether it's family and interpersonal or friends or co workers. I mean, I know university teachers that feel more afraid to just freely say things or choose things within their curriculum because they feel like there's eyes watching them. Not just from above, but students who will say, I didn't feel safe when that content was presented without warning. I have a friend who lost her job because of that very thing. Without any dignifying learning conversation from both sides, practically and positively. The Way I see dialogue opening is in the word story. Usually when we think of civil discourse, we think of people having healthy debate. And there's a good place for that. But it's not necessarily a starting point. When I talk about story, I'm talking about people getting into the experiential realm of what they're really observing and noticing and living through and maybe some hardships that they've gone through and just narrating that across the divides to people that might have oppositional perspective. What that does is it gets people out of what I call their head zone, where they tend to be defensive, they want to win arguments and persuade people, and into the heart zone, where we tend to think more about our common humanity with others. The heart zone is where we listen better, where we apologize, where we have some humility and curiosity and it brings us into these story realms. So that's a big part of what I do in my workshops now with different groups is I'll talk about what are skills and structures that help conversations shift away from head zones into the heart zones where there's kind of a bonding potential. And that doesn't mean everything just stays in kind of this feeling story zone. It actually creates a foundation for people with differing views to then come back into the head zones and have more capacity and more trust to really have iron, sharpen iron at that point. Yeah, because I think we still need those hard logic based conversations, but we're just not able to start there. So we have to have foundations of shared understanding, shared bonding, shared appreciation for what other people have gone through and then find ways to come back to the more debatable issues."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":3334.19,"end":3451.88,"speaker":"Jonathan Pageau","text":"Yeah, and I think that what you just said is key because in some ways what we see, it seems like what we see is an excess of both and a new capacity to bridge. Because what you often see, the clash, and I see it, you see it even in the sad online world is someone coming with a story perspective and then someone answering with a facts logic perspective. And that can go wrong in many ways in the sense that maybe the person who's just telling the story just wants to tell the story so that you understand where they're coming from. Sometimes the person telling their story confuses the spaces so they think that their story is, is an argument for the head, head place. And then, and then there's a misalignment. But the idea of both exploring both and understanding the difference between the two and saying like, of course we should, like we, we know each other, then that, that bound that, that basic place for trust is set. And then we can, like you said, then we can talk about the difficult issues in terms of. More. In terms of how reasonable things are and what makes sense in terms of what we're doing. So. So that. No, I think that that seems like a great approach. Well, Ted, thank you so much for this conversation. I appreciate that you went there with me because, as you saw, my relationship with Dilut is like a 5050 relationship. And that's maybe why in some ways I haven't talked about him so much on my channel. But I think for people watching, it's a good place to leap into a little, especially as someone who had very deep insight into something, into all the problems we're dealing with now in terms of technification and also in terms of state powers becoming all powerful and how, as Christians, we can deal with that. So thanks a lot for your time."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":3452.28,"end":3519.49,"speaker":"Ted Lewis","text":"Yeah, I'm really, really thankful to be here. And I just want to tack on one short piece that kind of brings powers and story together as a theme. The counter narrative for Elul with respect to the Tower of Babel is Philippians 2, where Jesus empties himself, not wanting to take on the importance of being like a Greek Roman God with lots of status, but becomes a servant and ends up dying. That's the reversal of the Tower of Babel impulse to. To be autonomous. And I think that that incarnational story, and Ellul talks about this as a juxtaposition numerous times in his writings, validates the whole notion that we live in a real world, we live in a messy world, we live in a visual world. And so to be able to engage without the same power dynamics really does have validation in that story because it's, it's. It's the ultimate symbol of God reaching us."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":3519.73,"end":3560.62,"speaker":"Jonathan Pageau","text":"Yeah. And it's the surprising image of the one who does that, you know, with the. With the headboard which says that he's the king. Simultaneously, that kind of simultaneous clash of imagery where he both empties himself and is raised up to the highest. You know, he goes into death, but then enters into the holy place like it's a. Yeah. The story of the cross just kills you every time you think about it. It's so. It's. It just smashes everything together. So seeing the world through the cross is definitely the way to solve the problem of, of principalities and powers and how, you know, the highest gives itself to the lowest. That's the best way to understand true Christian hierarchy and true Christian power. So, Ted, thanks This has been great."}
{"episode_id":"SW - #303 - 2023-09-02 - Ted Lewis - The Technological Society","start":3561.02,"end":3568.09,"speaker":"Ted Lewis","text":"Well, it's a delight to converse with you and kind of see where our conversation leads us. All right."}
