{"episode_id":"SW - #253 - 2022-09-14 - Left Hand - Right Hand Symbolism","start":0.24,"end":2187.16,"speaker":"Jonathan Pageau","text":"In Scripture, we have this important passage in the New Testament, when the Son of man comes in his glory and all the angels with him, he will sit on his glorious throne, all the nations will be gathered before him, and he will separate people one from another as a shepherd separates the sheep from the goats. He put the sheep on his right hand and the goats on his left. Then the king will say to those on his right, come, you who are blessed by my Father, take your inheritance. Then he will say to those on his left, depart from me, you who are cursed, into the eternal fire prepared for the devil and his angels. So this is, of course, a very famous text. The text uses the symbolism of the right hand and the left hand in a way that is very intuitive to us and makes a lot of sense. But this symbolism is very important, and it appears universally, I think, in most cultures, it's related to the experience that we have of having a hand that is strong, a hand that we can easily use, and a hand which is weak, and a hand which is more awkward. It's also related to the right and the left eye. And so what I'm going to do with you is I'm going to go through some basic notions of what this could mean in terms of more than just a metaphor, but as the basic experience of how beings coalesce towards their unity, but also break apart into multiplicity. This is Jonathan Peugeot. Welcome to the symbolic world. So a lot of my difficulty, let's say, with the symbolism of the right and the left hand, comes about in my. Under my interpretation of this particular image. So this image is one of the very first images that we have, I think probably the first image that we have of the Last Judgment. And so in this image, we see Christ in the center. To his right, we see the sheep. To his left, we see the goats. To his right, we also see a red angel. And to his left we see a blue angel. His right hand is exposed and his left hand is hidden and secret. Now, this is one of the first images, and this image will last quite a long time in the. In the history of Christianity. And it will become a kind of standard and will be explicited in different ways. It will come all the way up to the iconostasis, because in the iconostasis, which is this separation between the sacred place and the nave in churches in the Orthodox Church, very often we will find what is known as a deasis, and the deises will have Christ on our right, let's say, but also in the dasis, he's often in the middle. And then on his right will be the Mother of God. And then on his right again will be this red angel which is. Which has come to be represented as St. Michael, come to be understood as St. Michael. And so on his left now will be St. John the Baptist. And then will be the blue angel which we saw earlier, who had come to be understood as Saint Gabriel, the Archangel Gabriel. This will, of course, also go all the way into the icon of the Last Judgment. It's very important to kind of understand that this image of the deis is, Is an image of the Last Judgment. Every time you see an image of Christ in the center with the Mother of God and with, with St. John the foreigner and, or St. Peter and St. Paul. As you can see, St. Peter is here on the right and St. Paul is here on the left. These images will be images of, we could say, the Last Judgment or the eschaton or the final moment where we can kind of see the cosmic structure of the universe separated into two, with paradise on one side, with death and hell and breakdown and animality on the left side with Christ in the middle. In this one. I like this one very much. I keep showing the same image. I'll put a link to the. This is a contemporary icon, so I'll put a link to it in the, the. In the description. Although. Although it is really a condensation of all the old. All this. All the old icons of the Last Judgment. And so we see. We see Christ raising his hand up, we see the sun on his right hand. We see Christ with his hand going down, and then we see the moon on his left hand. So this is a moment of ascension. We could say going towards Christ or going towards heaven. And this is a. Something going down. So it's coming down and away from Christ into death and into hell. But not just that, of course, these saints that are on the left of Christ are not, you know, in death and hell. But we'll see how it all kind of comes together in the symbolism as we, as we move forward. And so one of the problems that we have is that when we look at the symbolism of the right hand, we'll find something like opposites, which seem to be in the symbolism. And so that's one of the reasons why it's so difficult. And people will flip from one to the other without realizing that they're doing it. They'll kind of switch from one aspect of the symbolism to the other. And I think I understand why now, but it's taken me a quite A long time to understand why. And so the four sides of this, you could say that the right hand is concentric. If you remember the words of Christ, it says, he says to the sheep, come into the kingdom, right, come towards me, enter into the kingdom. And he says to the, the goats, you know, move away, right, go away. And so what you end up seeing in the symbolism of the right and the left hand is you'll often find on the right hand you'll find symbolism of foundation, of establishing, gathering together law. Of course, the symbolism of the right hand is of course, the symbolism of something which is straight. You know, in many languages, the word for right, right and the word for left. Like in French, for example, we say droit, which means straight or right hand. And gauche means awkward or, you know, crooked. It can, in different language, you'll find that the right means straight and means also, you know, has something to do in the sense of also a stand in for the center. Sometimes the word for right or the notion of the right hand will almost be like a stand in for the center itself. But then also on the right hand, if you look at, you know, the image of the Last Judgment, you find that on the right hand you have something like mercy protection. Often the right hand is symbolized by blue or by water. Already it's starting to cause problems in your mind because that image I showed you at the outset has the red angel on the right hand. And on the left hand is often represented as wild, as strange, as the exception, as excess, as crooked. And so often it's related to the passions, to dissipation, dilapidation, all this type of images. But if you look at the story of the Last Judgment in the Gospel, it's also related to rigor, because Christ says to those on his left hand, you know, go away. Like, he's using a very harsh, rigorous language. He's applying the law to them very strictly in order to push them away. And this is we'll also have the symbolism of fire and the sword. And so what I'm going to propose to you is that we're looking at a kind of crossover. We're looking at the two sides how, depending on your point of view, they cross each other and they tend to represent something. They seem to look like they're representing the opposite of what they were in the first place. And I think that this will be very important. It seems like it's just arbitrary and this is not a big deal, but it's actually going to be very important. Understanding the relationship between myself and others, the relationship between, you know, my interaction with other people and how, in some ways, that which moves away from me is received by the other. And so there's this switch that happens in between. And that switch is sometimes hard to conceptualize, but I think with a bit of effort, we will be able to understand it in a way that isn't too. Too difficult, that it's actually pretty simple. And this also seems to be, I think, what is captured in the symbol of the caduceus, which has been brought into the church through the symbolism of the bishop's staff, which is that you have a center. You have a central axis. At the top of the axis, you have a golden ball. You have something like the source, the light. The sun in the caduceus is also represented with wings. And so it's the idea of the spiritual thing above, you know, the sun above, the source of light, the source of things, the source of being. And then wrapped around it are these two serpents, which represent two tendencies. And you can see how the serpents move towards the center and then away from the center, towards the center and away from the center. And on one side, one serpent will move towards the center and then will cross over and then will move away from it and then return back towards the center. And I think that this is actually a very important structure. It's a. It's also a structure. When we look at it, it's very satisfying to us to look at this image of a. Of a straight axis and something moving a serpent around it. It is. I think it's a very primordial structure, which is why it appears in every single culture. Right. You know, the. The Europeans were probably surprised to come to South America and in Central America and to find the image of this serpent wrapped around a pole with wings. And, you know, as they. They encountered the. These empires that were in Central and South America. But I think it's because it really is one of the. Probably one of the oldest symbols and a very, very universal symbol. And so, as you can see, the imagery can be represented like this. Like, here's an image of the Last Judgment from the medieval Western style that has Christ in the center. And then on. On his right hand he has a lily, which is a representation of mercy. And then on his left hand, he has a sword. Now, this, of course, is just a. Just a version of this, right? With the hand going up and the hand going down. You know, there are different ways to represent it. Here it is the lily on the right hand and the Sword on the left hand. This had their different representations of this, there are different versions of it. But it's really important to understand how these attributes, the lily and the sword, became in Western and also to a certain extent in Eastern art. The attributes of the angel, the attributes of Gabriel and Michael. And so here is an image of a Coptic iconostasis that is again the wall that separates the holy place from the nave. You can see that in the iconostasis, Gabriel is holding a lily. And Michael here is not holding a sword, but is holding a lance. Often he can be also be represented holding a sword. Now, once again, the issue is that in, in this image you can see that it is in some ways the opposite of this one, because at the top you have Christ and you have the blue angel on his left and the red angel on his right. And this is of course the, the issue, this is the problem that we're trying to figure out. And I think that the fact that we see the duality in the art that continues on until today, but that often we will see that duality flip has to do with the very problem of what it is that is going on in this image. So here is a version of St. Michael, of course, holding his sword, Russian icon of St. Michael and a Coptic icon of Gabriel presenting the lily to mother of God. So if we look at the angels themselves, they are, they do seem to be related to the right and the left hand. So in the early Christian times, for example, in the book of Enoch, there is a description of St. Michael as being the right hand of God, as standing on the right hand of God. And this of course makes sense because the name of St. Michael means the one who is like God, he who is like God. And so he is the right hand of God. He is the one who is like God. And that relates him to the right hand. I mentioned this idea that the right hand is something like a stand in for the center. It's like a foundation. It's that which represents the center below the center. And so when we look at the image of the Mother of God on the right hand of Christ, we wouldn't be surprised to know to notice that that image, the image of the mother of God, will also be in the center. For example, in the image of the Ascension, we will see Christ above and we'll see the Mother of God below as a stand in for the center. In the Dasis, we also have St Peter who is on the right of Christ. And then in the image of St. Peter we have the same Notion which is that Christ says to St. Peter, Right, you are the stone, and on this stone I will found my church. You are the foundation of, of the church. And so he is, in a way, a stand in for the center being on the right hand. Okay, so all of these things hopefully make sense to you. And so why this is important is because we have to understand that all identities, whether it's you, whether it's a group you're participating in, anything that has a logos that is recognized as having a purpose will have something like a right hand, and a left hand will have a concentric element and an eccentric element. And so if you think about a, you know, think about a, a team, for example, or think about, let's say, a company that is building robots or, I don't know, building something. Let's say they're building robots. This company will have aspects that they will deal with which will be concentric, that is, aspects which will move towards their purpose. And then they will also have aspects that they have to deal with which will be eccentric, which will be moving away from their purpose or further away from their purpose, we could say. So we can understand that. That is, of course, something that you have to deal with in your own life. There are some things which move you towards identity, towards, let's say, a kind of strengthening of identity. And there are things which will tend to move you away from identity. And so this is the current. We could take these kind of cosmic currents that move to, towards the center, towards logos, towards identity, and move away from the center, Logos identity. You can see that in the image of the Last Judgment, Christ is saying it very specifically, right? Those on the right hand will come near and those on the left hand will move away. Now, in that story, it's represented just as positive and negative in the sense that moving toward the center is positive, moving away from the center is negative. But that's not, of course, always the case, as I've often said, which is that St. Paul has that imagery to him. He is the apostle to the strangers, right? The apostle to the non Jews. But everything about St. Paul, right? How does he convert? He falls off of his horse, back off of his horse, he becomes blind. He talks about how he is a shapeshifter, how he is. He said that he's an aborted apostle. All his imagery is about this dissipation and this kind of brokenness. But in his case, it is not bad, although there are some bad aspects to it. It is not bad. On the opposite side, you see St. Peter who is, you know, the. The one who speaks up at Pentecost, the one who kind of represents Christ, the one who is the foundation, the one who is the shepherd for the other apostles, all of this as a kind of stand in for Christ. And so you can see how neither of them is positive and negative. But how does it work in terms of why is it that. That the center and the left and the right hand seem to have kind of two opposite aspects of symbolism coming together? So I think the way that it's represented, whether it is in the deist, whether it is the caduceus, whether it is these different ways we try to represent the relationship of opposites, is it's difficult to represent visually because in some ways you could see it this way. So this is the best way that I understand it. So if we understand the notion of the right hand from the point of view of the Logos, okay, so from the point of view of Christ, from the point of view of the identity, from the point of view of center, you have the right hand, which is concentric, so it's moving towards the center. And you have the left hand, which is eccentric, which is moving away from the center. So the idea would be that the way that I experience the right hand of the Logos, that I experience the right hand of that which is facing me, that which is that I'm engaging with, it could be the Logos, but it could also be the other. It could also be the person that is facing me is I experience it as a kind of mercy, a loosening, right? There's a kind of loosening of the standards in order to bring me closer to the center, closer to the logos. But this right hand in myself is something like discipline. It's something like self containment, you know, it's something like holding together. And so if I think about how the right hand applies to my relationship to myself, then it is seen that it is seen as that which establishes my identity, that which holds it together. So it has a kind of hardening to. It has a kind of solidity to. It has to do with that which conforms, conforming. But if I am facing someone else or if I'm moving towards a purpose, then what I experience from the moving towards that has to be a kind of loosening on that, a bringing in a kind of mercy at my own fault, or else there would be no way to move into that identity or move into the person across from me. And I think that on the other hand, you have the same thing because the left hand is eccentric, then it appears in myself as a form of dissipation. So my left hand in regards to myself is something like awkward. It's dissipation, it's loosening, it's deforming of the central identity. But if I experience the left hand of the purpose in which I'm trying to move, then it's experienced as a rigor, as a judge, because it's the hardening of that, of that identity that I'm moving towards, which is pushing me away because it's not leaving room for me, it's holding me away from itself by applying a kind of rigor and a kind of hardening to itself. And so you could see it in the other way around again, when it's applying the right hand in order to bring me into it, it has to open itself up, it has to apply a kind of mercy and a loosening to move into so that we can move towards each other. So you can understand that this is true, of course, like I said, of identity and logos. But it also is a reflection of the manner in which we actually experience the right hand and the left hand. Because if I'm going to shake your hand with my right hand, I'm going to cross over and there's going to be this crossing over which will happen and my left hand will be a crossover to your left hand. And so it's actually really, really profound because it has to do with our very experience of facing someone, our very experience of encountering a person has to do with how these actually flip in our just immediate, immediate experience, but also conceptually in terms of the way in which we let someone come towards us or we push them away from us. So we can understand that this is, let's say, in a positive way the way that I've represented it. But we can also see it right as, let's say, flipped in terms of the way that I represented it. Up here means I have the positive side, you could say, but I also have the negative side here. And usually that's what it is. Usually the right hand is something like positive and the left hand is 10, tends to be something like negative. Not always, but it often is that. And so now we can understand how if I am in myself, my right hand, that is my tendency towards my own center, my capacity to be in myself and to move towards myself, can be experienced as pride, as self sufficiency. Whereas in a more positive way on the other side, on the left side, you can understand that my left hand in regards to myself can be seen as a Kind of exteriorization, a possibility of glory. Even you could say that is something which is not just in my center, which is kind of emanating or moving out or let's say overflowing from me, can be seen as this left hand. And so, you know, when we say things in the church, when people say things like how, you know, the fire of hell is the fire of Pentecostal. You can kind of understand it now, like why that would be. Why is it that the, the fire of hell as this kind of burning will be experienced by those who are, let's say, will experience by those in a certain condition as the rigor and hardening of God, but that for others will be experienced as a kind of glory, as a kind of expansion of their being, depending on their disposition, depending on how they are relating to the, the Logos, we could say. So you can see that it's not a system. It's really important because if you try to see it completely as a system, then you're going to. It's more like a poem, it's more like rhyming. It has this, it has an intuition of structure, but the structure always kind of eludes you because, because it is, I think it really is very, very basic in terms of our experience. And so this is where we can kind of understand St. Peter and St. Paul more easily and the relationship between what we call the dasis. So now again, this is a dasis with Christ in the center, with the Mother of God on his right hand, with St. John the Foreigner on his left hand, St. John the Baptist with St. Peter on his right hand, with St. Paul on his left hand. And so we can see now the different symbolism. So in the case of the Mother of God we have this containing. We have this gathering in. We have also this idea of a kind of stand in for the center in the relationship of heaven and earth. All of this is. So she is gathered into the center and in some ways she's also hidden because of that. She is also seen as the one who provides mercy, provides, you know, kind of softness to us. So, so all of this kind of symbolism comes together if we can understand the different aspects of it. And then St. Peter, he appears also in a way as a stand in for the center, as a boldness towards the center, as a kind of representative again as being the shepherd, the one who is a stand in for Christ in the world. And now on the left hand then we have St John the foreigner who is out in the wilderness. He is wearing animal skins, if you remember. The image of. In the Last Judgment, where you see all these animals on the left side, he's wearing animal skins, he's yelling, he's making a lot of noise, he's telling people to repent. And so there's nothing secret about him. It's all outside. It's all this kind of outer aspect. And now the same again with St. Paul, who is, like I said, he's a Roman citizen, so he's almost a stranger. He is a shapeshifter. He says he's all things to all people. So much about St. Paul is about this, if you can understand it. You can kind of see why it is that St. Paul represents himself with all these types of characteristics. He even. He says, right, that he is an aborted apostle. That's a pretty strong statement in terms of the idea of something which is rejected and dead and, you know, and is kind of far away. But at the same time, we can see how one leads to the other. You know, one side leads to the other. And so think about St. Peter and think about how St. Peter, his symbolism is always the same, right? His symbolism is always the one who is bold. But then because of his boldness sinks, right? The one who moves in a way from the right hand to the left hand. So because of his boldness, he walks out on the water, then he sinks. He tells Christ that he will never betray him. And then he does. He tells Christ that Christ doesn't have to die, right? He's like, no, you don't have to die. You can contain yourself. You can just be the center in the sense of the right hand and the establishment and the solidity. But Christ says to St. Peter, get behind me, Satan. Get behind me, you opposer. So you can understand how this symbolism of moving from the right to the left and how, let's say the one at the top is the kind of the opposite at the bottom is happening in the symbolism of these two people. And you can. So you can see that the. The sin of St. Peter is something like pride. And so in St. Paul, you have the. The one who falls off the. Who falls off the. The horse who does all that. And his first sin is something like the thorn in the flesh, you know, and it seems to be some kind of sensual sin related, of course, to a woman, because this idea of the thorn is the consequence of the fall, then also a thorn in his side, which is related to the idea of Eve coming from his side. So he has this whole idea of what it is that his sin is, which seems to have something to do with sexuality, although it's not totally clear. But then also people are getting mad about this. But there's also St. Paul has a kind of opposite sin, or I don't know if it's a sin, but it's a tendency which. That St. Paul is always boasting. He's always boasting without boasting. He's always saying, you know, he has a very strange behavior in his letters where he says on the one hand that he is nothing, that he is all these things, but then he kind of secretly boasts as he's doing that. So that seems to also be part of this crossover that we find in the right and the left hand symbolism. And so now we can understand. There's this citation from St. Gregory, from St. Maximus the Confessor, that I'm always quoting, but I'm going to quote it to you again because I think it's a very powerful grasping of what the right and the left hand are in terms of the negative part of it. So St. Maximus talks about the demons that combat us by the lack of virtue are those that teach us prostitution and drunkenness, greed and jealousy. So we can see that these. These sins, right, they are the sins of dissipation, the sins of dilapidation, the sins of passion in the strict sense, right, of becoming a slave to something outside of you that dominates over you. And then he says the demons that combat us by excess of virtue are those that teach us presumption, vainglory, and pride, and who by the vices of the right, secretly place in us the vices of the left. So here you can actually see this crossover, which is that that which begins in pride ends in dissipation and dilapidation. And we can see that this is something which is true in the story of St. Peter, who starts with pride. He starts with boldness and then ends sinking in the water, sinking in the mire. He ends denouncing Christ. Of course, he ultimately repents, but we can understand the pattern that St. Maximus isn't taking this from. He's not just pulling it out of his hat. He has such a deep intuition of scriptural symbolism and the scriptural images that he's able to show it in our everyday experience. And so this also seems to be suggested in the image of the transfiguration. So in this image of the transfiguration, I like this one particularly because you can see on the right of Christ, you have Christ going up the mountain, and then on the left of Christ, you Have Christ going down the mountain. So this movement of moving towards the top and moving away from the top is there in this version of it. It's not always there, but in this version it is. And then you see on the right hand of Christ you have Elijah. Now Elijah is interesting because Elijah, you know, is the one who calls down the fire of God. He's the one who mocks the false gods. He is, you know, and even the way he looks, he has that wild kind of St. John the Baptist aspect to him. But look at, he's on the right side of Christ. And then on the left side we have Moses, who is the one who brings the law, who is the one who brings the revelation, but who also his sin, the same sin as St. Peter, right? The sin of Moses was to think that he was the one who would bring the water to the Israelites. And so you can see that St. Moses kind of up here is related to Peter down here also, because Moses is a, is the standin for God in the text. I mean, God says crazy things in Exodus. He says, I'm setting you up as my, you know, as my servant. And then you will be God to Aaron and then Aaron will be your, your. Your servant, you know, towards the people. So he's kind of setting Moses as a little God in the world who, who acts on the others. And so he is this stand in for God in the story. And then if you look at the bottom now, it flips. So Moses is here, St. Peter is here. And interestingly enough, St. Peter is looking towards the center, right? So he is looking towards the middle. But then on the left hand you have James who is falling over backwards, kind of like St. Paul on the donkey. And he is facing Elijah here. Elijah, interestingly enough, you know, goes up in a flaming chariot. And so in this case you can see how the flame and the chariot, and the flame and the glory and the chariot as well. Because the chariot is a added aspect, right? It is a supplement. A chariot is like a vehicle which is added to the identity. It's like a body. And so he goes up in this chariot, this flaming chariot going up into heaven. And so it's very much in some ways an image of all that is on the left hand, but here he is represented on the right. And I think it really is to represent this crossing over that happens between the left and the right hand, depending on your perspective. And like I said, it's not a system. You. It really is a kind of intuitive thing that happened in the, in the Tradition. So ultimately, we come back to this just basic image of the Yin Yang symbol, which I think is probably actually, in terms of a geometric representation, might be one of the best representations of how the two opposites come together, how one opposite drives the manifestation of the other in this way. And so it really is a powerful image to help us understand what it is that these two streams, we could say of reality, how they come together and how they work. And like I said, it's really important to understand that. That this is not just like abstract, of course, can help us understand the art and it can help us understand the stories, but it is something which exists at every level of our experience. It is something, you know, this tendency towards identity and towards solidity toward the center, and this tendency towards dissipation and breakdown and multiplicity is something which is part of every identity we can recognize. And it's important to be able to see how, let's say, one causes the other in a positive way, and also how the excess of one causes can cause also the excess of the other in a more negative way and how they are related together. Of course, there would be much more to say and much more to meditate on, but I thought this would at least be a basic introduction to the symbolism. And remembering that this symbolism is not, of course, just in the images I showed you. It is there all through the Old Testament as well. It appears, as, I think, even right at the outset, as the idea of the fruit of good and evil, this basic opposition. And then it appears as the column of fire and water. In Exodus, it appears as the two pillars of the temple, Yachin and Boaz. If you look at those two pillars, you can see that Jachin means to establish. No, it means to establish. So it is the right hand, really. And then Boaz is, of course, the one who married Ruth. Who is this? The one who went towards the stranger and has something to do with the left hand in this kind of exteriorization. And interestingly enough, it's funny to notice that in the Jewish tradition, if you look at the names of the angels, Michael tends to be related to something more like mercy and the right hand. And Gabriel seems to be related to Gebura or the idea of more rigor and more strength. You could say an exteriorization of strength. Whereas in Christianity it seems to actually flip. But it has to do with this facing each other, I think. I think that if you think of Christianity and Judaism kind of facing each other and exchanging their position, you could say, at least in the way that Saint Paul presents it as, you know, the idea of the those that were under rigor and now under grace and vice versa. This is the way that St. Paul presents it in his, in his text. There seems to be this happening in even the image images of St. Michael, which for us, St. Michael starts to be represented as red, as the sword, as all of this while nonetheless also being related sometimes to the right hand in this crossover. And then Gabriel being represented rather as Mercy and as the lily, as the blue angel. But then nonetheless also being on the left hand. And so there's definitely a mystery there. I of course, invite all of you to continue to think about this with me because I've. I feel like I've definitely not exhausted all the symbolism. You can also look up some articles that I wrote for the Orthodox arts Journal about 10 years ago on different right and left hand symbolisms. There's, of course, different aspects to that. Some have to do with authority and power, you know, and there are also other aspects that I've treated in those articles. So I put those in the description that you can look up. So thanks for thinking about this with me and this difficult but important symbolism and I will talk to you very soon. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon, the Pageau videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
