{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":0.56,"end":68.58,"speaker":"Spencer Klavan","text":"Harry Jaffa has this wonderful line that the west is saved or revitalized every time a human heart is saved from the dark night of nihilism and relativism. And this is kind of the premise also of my book that, you know, you've titled a book how to Save the west. And of course you feel a certain trepidation about like people are going to look to you for some political program or some, you know, list of answers. But the point that I'm trying to make in the book, which Marcus, I think you, you get at really well, is like, you know, actually the restitution, the restoration of every human heart is the project of the West. And I think the first step to that cuts very close to everything we've been talking about. The first step to that has to be some recovery of this, of the validity of symbols, right? Of the. Just the fact that these are not kind of arbitrary or accidental features of our biology, but are, I think you use the word primary, Jonathan, that they are in some sense kind of a bedrock of reality. And, and you know, this is I think expressed very well in, in the timaeus and kind of carried forth by, by these Christian traditions we've been talking about."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":80.42,"end":83.46,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symb."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":94.08,"end":199.69,"speaker":"Marcus","text":"Welcome to more Christ. My name is Marcus. Today I'm joined once again by my friend Jonathan Pageau. He's been a great inspiration to me in this channel. Jonathan is a professional artist, writer and public speaker give workshops and conferences all around North America. He teaches carving, speaks and art, but most mostly he explores symbolic structures that underlie our experience of the world. Through his YouTube channel and his podcast the Symbolic World, he furthers the conversational symbolism, meaning and patterns and everything. Movies to icons to social trends. If I may, if I may go off a script here and let you know about some exciting news. So Jonathan and I are actually in the final stages of organizing an event with Paul Kingsworth and Dr. Martin Shaw, Dublin this June. So keep an eye out for that and you'll be able to follow that on my YouTube channel and on event Eventbrite and book tickets there. And I'll also be offering other events one including Calvin Robinson, Roger and Father Ben Kelly. If you enjoy this conversation, you might enjoy that that takes place in London on the 11th of March at Calvin's church. And I'm also joined today by one of my favourite podcasters, Dr. Spencer Clavin. With a PhD in classics. Spencer is the author of the new book how to Save the West. He's also an Assistant editor of the Claremont Review of Books and American Mind at the Claremont Institute. Spencer's literary expertise is aided by his knowledge of many languages, including ancient Greek, Latin and Hebrew. As a scholar who enjoys exploring great works of literature, he provides valuable insights into today's world. He's also previously hosted Young Heretics, and he's been snapped up now by the Daily Wire. So I suppose, first, if I might ask you both, what have you each found most insightful about the other's work, and what are some of the key areas that you'd like to explore today? I suppose, especially in line with Spencer's new book. If I might start with you, Jonathan."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":199.77,"end":230.64,"speaker":"Jonathan Pageau","text":"Well, I haven't. I mean, I had. I mean, obviously I haven't read the new book, but one of the things that I found very interesting is that I met Spencer only once. I met him when I was at the Daily Wire, and it was really interesting because it seemed like we were very much in line. He was quoting all my favorite passages from Dante at me, like, what? What? Like, what is this? Amazing. And so I feel like. I think, like we're, like, aligned on a kind of cosmic vision. And so I'm definitely looking forward to exploring that more with him and seeing, you know, how he brings that into his. His project."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":230.72,"end":324.42,"speaker":"Spencer Klavan","text":"So, yeah, I had that same experience. Jonathan. I think it's the. I think it was Dante and Beatrice from the. From. From Paradiso that we were discussing, and it speaks to the place where I think we share the most, and that is this notion of, you know, you're so eloquent about the symbolic and the way that we kind of experience. You know, I think that we currently have these two kind of toggle options in the public mind. One is, there's. There's subjectivity and there's objectivity, right? And objectivity is like the stuff that's out there and it's hard and you touch it, and then there's the stuff that's in here, and it's arbitrary and subjective. And I have really, you know, been insisting in my dogged way that there is a. A kind of middle space between those two modes of perception, which is properly called subjective in the sense that it involves a subject. Right. There's no such thing as beauty without a percipient, but it is not arbitrary. It doesn't, you know, just come out of our pure will or what have. You talk about a lot about that in the book, and you and I were, I think, sharing about your essay on the Earth, right? Whether the Earth revolves around the sun, or the sun revolves around the earth. And that's a kind of a classic example that actually the perceptive experience of how we experience the sun is not something that just gets to vanish out of thin air simply because we kind of mathematically prove that it's objectively untrue. So that's, I think, the thing I love most about what Johnson does."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":325.33,"end":343.37,"speaker":"Marcus","text":"Thanks for sharing, gents. And so if we look at your book even in broad strokes, then in how to Save the West, Spencer, you present five major crises threatening to end Western culture. Can you tell us what they are? And then we can see how they align with some of the big challenges that Jonathan sees."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":343.37,"end":550.93,"speaker":"Spencer Klavan","text":"Oh, sure. Well, I mean, the. The premise of the book is basically, you know, I think people wake up, the people that I talk to who listen to my podcast or what have you, I sense from them a sense of despair and anxiety about just where the world is headed, about the news cycle, which seems to just constantly deliver crisis after crisis. And the way that people typically think about this is, how can I fix things? And they think about it as if they were like Ron DeSantis. They sort of imagine, like, what law am I going to write tomorrow? What system am I going to build across the nation that will, quote, unquote, fix the world or save the West? And I think that's what causes that despair. I think when people think that way, they start to. Paralysis starts to set in, because most of us aren't Ron DeSantis, and most of us have been trained to think in these sweeping political terms when what we really need is some agency over our own immediate surroundings and personal, you might even say, subjective lives. And so the project of the book overall is to take some of these things that are kind of flitting past the news cycle and, you know, invite people into speculation about what deeper questions might be underlying them that are answerable in human terms at an individual, human level. And so the first one I call the crisis of reality, and that's related to what we were just talking about. It's this, you know, is anything out there real? And if so, what? And do I want it to be? Is it convenient to me for there to be objective reality or even subjective reality? Or would I rather kind of dissolve the boundaries of true and false in. In some sort of digital space? And then, you know, closely related to this is the crisis of the body, I think, is this uncomfortable relationship that we've had basically for as long as we've been around on the planet with our Fleshly selves? What does the soul have to do with flesh? Why do we need this kind of appendage or meat sack that just decays and dies? And wouldn't it be better if we could either manipulate it, rearrange it at will, or maybe just escape it altogether in some sort of, you know, code space? And so I kind of present as an antidote to that crisis the arguments of Aquinas and, you know, drawing also on Aristotle for a hylomorphic world, for a world that is comprised of the fusion of form and matter, threaded through, you know, at every point with order that is more than simply meat. And this is kind of what leads into the second half of the book with the crisis of meaning and the crisis of religion. And that's where you start to get into, you know, whether or not we can believe in the wake of the scientific revolution and the discovery of evolution, you know, whether we can be confident in the things that we perceive in this world that have no place on a brain scan, and yet we, we feel very powerfully to be true. Then finally, at last, kind of having addressed some of those, what I consider deeper philosophical issues, I turn to the crisis of the regime, which is the, you know, the political facing America, and kind of drawing on some of the history of political philosophy to, you know, describe how regimes have been understood to rise and fall so that we can understand kind of what the threats, what the particularly acute threats are to ours in America and, and where we might be headed."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":551.97,"end":557.33,"speaker":"Marcus","text":"Wonderful, thanks, Spencer. Would you like to go with any of those in particular to start off with, Jonathan?"}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":557.49,"end":645.4,"speaker":"Jonathan Pageau","text":"I mean, I think there's many, there are many things there that are interesting to me for sure. The question of how we can believe or, you know, how or why we should believe in the, the kind of scientific or post scientific world that is definitely one of the main projects that I'm trying to, to attend to. And so I'm definitely interested in the notion that cognitive science has afforded us a new space to talk about these things. That is the inevitability of patterning and the inevitability of, you know, framing in terms of how we see reality and how if you take that seriously, then in some ways it can recapture our, the phenomenological world. It can kind of recapture it as primary. And it has to do with what you said in terms of the sun coming up in the morning. Right. Like if you, if you can realize that, that like the inevitability of, of this experience, right. Of this conscious experience and how, how it's related to meaning in general and how we make meaning, then it seems like almost all the categories that you find in ancient world, like in scripture or in the medieval world can be recaptured. You know, I often give the example of going up a mountain. It's like going up a mountain is an objective thing. It's a subjective thing, but like in the way that you said subjective, but it has a stable pattern to it and you can recognize it and you can understand why Moses goes up a mountain to encounter God. It's not, it's something that you can actually comprehend and have a little experience of yourself."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":645.96,"end":727.04,"speaker":"Spencer Klavan","text":"Yeah, you know, this is related to something I'd love for us to get into that you were actually touching on before we started recording. And that is the kind of fractal line nature of this stuff. The way in which, you know, reality, human experience seems to kind of consist in, you know, larger patterns that can be infinitely sort of nested within themselves one after the other. And I think this is something I sort of address in the book. I think this is one of the kind of dominant patterns of ancient Greek philosophical thought which has been lost to us and needs recovering. You see it maybe most clearly in Plato's Republic, this notion that the city is a kind of soul mapped over many, many people. And therefore the soul is a kind of city nested within a single individually. And in both cases, order is the kind of spirit shared among these two things. Man as the microcosm is kind of classic tagline for, for talking about this. And I wonder you're mentioning cognitive science. I wonder if that concept in particular, this idea that, you know, the logos, which is either threaded through creation or expressed in creation, however you want to put it, finds a kind of little mini reiteration in the human mind."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":727.36,"end":872.99,"speaker":"Jonathan Pageau","text":"Oh, I think so. I think that the fractal, to me, the fractal structure, that's the, that's the solution to, at least to help people see what's going on. And one of the things I think we have access to right now that in some ways it's hard to know to what extent the ancients had had access to it. I think they did, but they would. You know, the idea of microcosm, macrocosm, for example, you find that of course, like you said in the, in the Greek thinkers in Plato, and then it, it winds itself into Christianity and finds its place in St. Maximus and in the more cosmic looking Christian thinkers. But there's a sense in which that microcosm, macrocosm is actually indefinite in Number. So it's not that. It's not that there's like one microcosm and then the macrocosm. It's that there's levels. And if you read St. Maximus, you kind of see it. It's like the individual is the church, is the cosmos. And so it's like the individual is the city, is the cosmos. There's this. There are these different ways you can frame it. But you can go individual, church, cosmos. You can go individual family, church, nation, like you can. There are all these ways in which these nested relationships work. And then you can go down from the individual actually into the manner in which your parts fit into you, right? And that there's a kind of an indefinite way in which anything that has multiplicity joins into unity. And so this is like a stable pattern. And it's like the one of the many basically, is nothing new. We're not making anything up. But that. But understanding that it nests itself all the way through is really, I think it's a solution to so many of the. Of the problems that we have. Because even in terms of politics, we tend. I always see modernity as a splitting of heaven and earth. That's the way that I understand it. And it accounts for more of modernity than some people sometimes. Because people see in modernity, you know, the Leviathan, right? And then you. You also see, you know, the kind of noble, savage idea. But those are the two things happening simultaneously. So it's like one is calling the other. So the idea that heaven and earth are separating and that, that is reducing the fractal relationships. So you end up with something like, you know, whatever, globalist world government, whatever. Like, obviously this is a little caricatured. And then in idiosyncratic, you know, I make up my own identity, whatever that is. Like I can be a Catman or whatever at the bottom, right? So it's like these two extremes happening and the fractal is the way to connect them together."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":874.35,"end":1042.66,"speaker":"Spencer Klavan","text":"Fascinating. It's intriguing actually to think that, you know, in the scientific revolution, you have notionally you have this connection between the sublunary and the superlunary spheres, that there was supposed to be this division, you know, at the orbit of the moon. But in point of fact, what you're saying is that in some ways the whole of physical creation, physical existence was kind of brought down to the level of the sublunary and split off, cut off from its heavenly sort of vertical dimension, which is really cool, a cool way of thinking about it. I also think that this you know, is a mode of scriptural interpretation that can be very fertile and fruitful when you're trying to think about these questions like, can we believe? How can we believe? How should we relate to these texts which have been so kind of maligned and dismissed as like, Stone Age superstition or what have you. But the other night I was having a conversation about, you know, is the. When God says to the nation of Israel, you know, I know the plans I have for you, plans of good and not of evil, plans to prosper you. Is. Is he just saying it to the nation of Israel about the exile in Babylon? And is the effort to kind of extract this verse, as people often do, out of context, is that effort just fundamentally misguided and kind of feature of American Christian happy talk? And one of the things that I was draw going on in that conversation is this notion which I think I got from Aquinas, although I'm not totally sure if I'm right about that. But, you know, this notion that it's somewhere in between those two things. Right. This is not just a kind of floating set of words that you can apply to any situation anywhere. But neither is it limited in its time at space, context, or else none of scripture would really have any meaning for us at all. There's gotta be some kind of analogical link that you can draw between the historical experiences of the Jewish nation in relationship to God and whatever it is that's going on around us at a. At a cosmic level. And I think this is this kind of infinite nesting that you're suggesting is. Is the link. It's really important what you say that, like, there's no. There's no ceiling to this. It's not like macrocosm and microcosm. Absolutely. Or like, there's, you know, just two options. But rather, this is a kind of infinite chain. And so you could say, well, Israel in its kind of nationhood represents or stands in for. But that's. That's even not quite right in some ways, embodies, you know, a cosmic man, just as Adam also can be conceived of as cosmic man. And Christ, of course, as well. And, you know, once you kind of get into this, there's a million different ways that you can legitimately and meaningfully kind of draw significance out of these historical events without just kind of reducing them to, like, platitudes or."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":1043.38,"end":1145.76,"speaker":"Jonathan Pageau","text":"You're so right. I mean, you're so right. And I think it's. That is bound in the script, the scripture itself, you know, it's bound in the way the scripture relates these together. So if you think about what you said in terms of the nation of Israel, the covenant that God makes with the nation of Israel, and you think of that already in the covenant itself, there's a fractal relationship that gets set up, which is increasing. So God makes this deal with Moses, and then Moses says, like, I can't do it alone, whatever. Then God sets up mediations between Moses and the people. So you have God, then you have Moses, then you have these mediations. And then it says, israel will be a priestly nation. What does that mean? Like priests for the rest of the world. That's what it means. And so the role that Moses is playing to Israel is the role that Israel is supposed to play to the world. And that is set up in the text itself. And if you see then from Exodus and you kind of move on into the story of the Bible, you come to a point where this seems to be increasing and increasing to the point where God's saying, you know, I will fill the entire earth with my spirit. Right? It's like, we will. As if, you know, when he. When the promise was made to, to Abraham to make the descendants as numerous as the stars, you get a sense even in the Old Testament that this is going to be more than, than just the strict nation of Israel. And we're moving towards a time where God's spirit will pour out onto all flesh. So if you see that as this fractal nesting, where it's like these, these increasing circles, it's like. I think it's right there in the text. And so it's not a. I don't think we're. I don't think we're just trying to interpret something that, that, that, that we want to be there. I think it's there in the order of revelation itself."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":1146.88,"end":1240.76,"speaker":"Spencer Klavan","text":"It's remarkable. I mean, of course, the prophets maybe wrestle with this most fruitfully in the, you know, lead up to the exile and then in, in the restoration. This, in this, you know, the sort of building of the second Temple. I think I sort of discern it's not so much a disagreement as just a kind of mystery or, you know, a kind of waiting about that very question. Like, when the nations come to Zion, like, what will that look like? How can we sing the Lord song in a strange land? And how is it possible for other cultures with distinctive kind of practices and this whole separate symbolic language, perhaps mutually unintelligible to the, you know, to the Jewish nation? Right. You know, Tyre and Bashan and just, just all these other, I mean, nations that haven't even been known or named yet will come to Zion. And you have this image, I suppose, you know, in Isaiah 60, for instance, of like Zion as this kind of ineffable core, right? This kind of meaning beyond language, beyond symbolic expression that joins together all of these nations which, you know, sort of horizontally amongst themselves, have nothing in common and are mutually unintelligible or even adversarial in the. In the case of, you know, Babylon and Syria. And this, you know, this kind of symbolic or analogical relationship that they're able to develop is kind of, I think, the glimpse of that in the prophetic visions. Let me ask you a question that may well be above our pay grade as human beings and therefore unanswerable, just to make it as easy on you."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":1240.76,"end":1242.16,"speaker":"Jonathan Pageau","text":"Yeah. Why not?"}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":1242.4,"end":1319.55,"speaker":"Spencer Klavan","text":"Right. Yeah. Yeah. I mean, since here we are, and that is, it seems to me that this kind of nested structure, this representative symbolic structure is inherent in the Trinity itself. In other words, it's not simply something that has to do with the way that God must express himself to man and among humanity because of our distance from him or because of our embodiment in matter, but that actually it comes along even in a prelapsarian way, bound up with our nature as images of God, that we are three in one already kind of within an individual. There's symbolic language going on even in our private thoughts to ourselves. Aristotle says, you know, no thought is an image, but no thought takes place without images, without pictures. Fantasia either. And I wonder whether trinitarian theology. I mean, you would know a lot more about the patristic literature on this than I would, you know, whether it's a kind of an article of trinitarian faith that something about this symbolic gesture is inherent in God's nature of itself."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":1319.63,"end":1440.38,"speaker":"Jonathan Pageau","text":"I mean, obviously, I don't want to misstep. I always hate talking about trinitarian theology, lest someone calls me a heretic, you know, and I don't even know why, but I think that definitely, I think the. One of the mysteries of the revelation of the Trinity is the. The notion that multiplicity is in the Godhead, right? That that in God is both perfect unity and perfect multiplicity. And in some ways it has to be represented as an aporia because obviously we can't make sense of it. But. But it's not a aporia that is. That is just arbitrary or illogical because we can see in that aporia of, Of. Of proposing perfect unity and perfect multiplicity that we see that happen at lower and more imperfect levels in the world. So in the world we notice the coexistence of unity and multiplicity, and we can see when that is balanced, like when there's. We could say when there's love, and love is holding multiplicity in unity, and we can see that. So I think that. I think that we are meant to. To live as an image of the Trinity, for sure. So that's why I really do believe that the tri. I mean, I'm preaching for my. For my own parish or whatever, but I do believe that the Trinitarian revelation in some ways is met even metaphysically. It's like the deepest. It's the deepest way to talk about the infinite that. That I can think of, because the problem with. With a kind of monadic vision, right, of the One and that. That type of language and I mean, I don't want to reduce the new Platonist, but. But, you know, it's. It can be dangerous because it tends to diminish. It tends to diminish multiplicity as being derivative and as being, you know, almost fallen in itself, like that kind of Gnostic move that we saw at the. In the beginning of Christianity. But trinitarianism really puts multiplicity as being in the very infinite itself. That's. It's astounding to me. Like, it's a. It's a beautiful image."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":1441.58,"end":1561.67,"speaker":"Spencer Klavan","text":"It's a return to Dante. You know, I think of his beatific vision when he finally makes it. And as you say, it's aporetic in some sense. He loses his power of speech, as he frequently does in the presence of the divine. And yet it's quite a definite and really quite strange image. I mean, I've always thought that, you know, his image of the Godhead is one that you could never dream up sort of on your own. You know, it feels very right. And yet he comes out with it and you're sort of like, that's quite surprising and, you know, is significant. It seems that, you know, as we've been talking about symbolism, about the sort of fractal nesting and all of that, we almost can't escape some form of hierarchic language, right? And, you know, we make all these caveats. We say, you know, and yet you always get the kind of bigger within the smaller or. And the thing that binds them is the form. What Dante gives us is these three circles of distinct colors. And so, of course, the circle is, you know, a kind of perfection of form. He's able to distinguish between these entities, while also, you know, affording to them a kind of perfect synonymity or a perfect, you know, identity with. With one another. And I. I will be loose with my language and ask for the forgiveness of the audience to, you know, when it comes to heresy. But that seems to me that what Dante is, is getting at that there is, you know, that although in this world. And, you know, because creation being what it is, creating things that are other than God. Right. You know, there's always going to be a kind of graded variation of hierarchy within creation. And that's nothing evil or wrong about that. But we also see, as you said, on kind of levels where all are equal, you can nevertheless have a kind of multiplicity in union. And that image at the end of Dante, I think kind of tries to capture what that would be at its highest in the Godhead."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":1562.23,"end":1578.89,"speaker":"Jonathan Pageau","text":"Yeah, I agree. And I think that in terms of the Trinity, it's interesting to see. I mean, it's obviously different fathers and different strains of how they talk about it, how they're represented. But there seems to be, on the one hand, you can kind of feel this tension to not represent the relationships as hierarchical."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":1579.2,"end":1579.44,"speaker":"Spencer Klavan","text":"Right."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":1579.44,"end":1588.24,"speaker":"Jonathan Pageau","text":"So it's like, no, it's a higher. Some. You hear things like it's a hierarchy of function, but it's not a hierarchy of nature. Like, there's different ways to talk about it, but I think it's like they're trying."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":1588.24,"end":1588.52,"speaker":"Spencer Klavan","text":"It's."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":1588.52,"end":1695.36,"speaker":"Jonathan Pageau","text":"It's. Again, it's an aporia. There's an aporia in the sense that there's a kind of distinction of function which appears in some ways as a. As a hierarchy. But because it's put into the infinite, that hierarchy also dissolves at the same time into, you know, into the infinite. I don't know what. How else to say it. And so it gives us a model, in some ways it becomes a kind of infinite model of how we again, notice the way that things work. So a really beautiful image of that, I think, is, for example, when Christ. So Christ says, I call you my friends. It's a beautiful image because the disciples are not the one calling Christ his friends. It's not the disciples saying, hey, buddy, Jesus, Jesus, my buddy. They're not the ones doing that. That Christ is the one saying that. So it's as if there's an acknowledgment of some of a hierarchy. But then that hierarchy is almost reduced in Christ calling the disciples to participate fully in him. And so it's like this. It's really powerful to think that it both tells us like Christ is above them. And so even when he washes their feet, it's like there's a reason why they're shocked is because this is actually this kind of kenotic movement that's happening from above, down below. So it actually reinstates the hierarchy. Even when he's watching his feet, I'm sorry, Christians, he's watching their feet and they're all shocked. And so it's both him like losing himself in. In that lower part, but then also reinstating it inevitably just by the fact that he's doing it. So it's like that type of move are the types of moves that Christ does to at least give us a hint of how this kind of equality and hierarchy can. Can exist in how it seems to exist infinitely in God somehow. I don't know how to phrase it."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":1695.68,"end":1822.95,"speaker":"Spencer Klavan","text":"Well, it threads right through so many of his sayings, not just that moment, which you're right, I've never quite thought of it that way. It's very beautiful. Beautiful in its simplicity almost, but also, you know, he who would be first must be last. Right is kind of the little gnomic version of what you're saying. And, and also the parable where the, you know, the keeper of the feast says, friend, go up higher. You know, it's not that like if you put yourself there, somehow you've. You've destroyed the entire dance. And yet if you, you know, offer yourself in humility, then you've created the opportunity for that, for that philia to be kind of offered. There's. There's a. A little tossed off comment somewhere in CS Lewis. I'm going to forget where he says it, but he mentions that condescension is this beautiful word that we have spoiled. And there's. It's a beautiful idea. I mean, I descendo and I go down con with you, or you condescend to me. Our sort of, you know, maybe it has to do with what Alexis de Tocqueville says about Americans, that there's a kind of the mania for equality in us, that it can kind of be let loose. And we have this egalitarian kind of rankling that I'm as good as you and nobody is born, you know, as that the natural master of any other. And all these things, of course, you know, are true in, in a certain sense. And yet as, as you say, we recognize everywhere around us that there are people with, you know, greater gifts than us, people with other gifts from us, or in positions where they, for one Reason or another. You know, their grace consists precisely in, you know, lifting us up out of a lower position, which you can't celebrate or be grateful for or acknowledge if you insist that you were already in the higher position on the same plane with the person to begin with. So this, I mean, even the way that we use that word, condescension, as if it were some sort of inherently snide or sneering action, when in fact it's the whole basis almost of. Of love, or at least a certain kind of love."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":1823.99,"end":1840.15,"speaker":"Jonathan Pageau","text":"I think. I think you. You've got it right. And it's in some ways because I've talked about. I've been talking about hierarchy for years, right? And. And a lot of people, and even because I'm talking about hierarchy sometimes in the wake of Jordan Peterson. And so Jordan at first was always talking about dominance hierarchies, if you remember. He doesn't say that anymore, by the."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":1840.15,"end":1842.23,"speaker":"Spencer Klavan","text":"Way, but he used to use part of your influence."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":1842.55,"end":1909.46,"speaker":"Jonathan Pageau","text":"Yeah, I don't know, but it's like, in ways. Thank goodness for that. But that is one of the mysteries that Christianity seems to offer, which is that Christianity, I think, is hierarchical, but it's properly hierarchical. It's kenotically hierarchical, which is the idea that we do recognize those that rise up, let's say, and that become heads, kings, you know, princes, in different. In different spheres of reality, but that we know, like what's the way it's supposed to be, at least in the Christian image, is that those that rise up give themselves back to those that are below. And so the, The. The. The notion of, like, the servant leader, it's a bit of a cliche, but it, I think it has a, A very deep structural purpose, which is to preserve the importance of hierarchy and the inevitability of hierarchy. But understand that the proper mode of hierarchy is love. Right. The one that is above loves those that are. That are in his body. Right. You know, the king loves the. Loves the people. The. The husband loves the family, loves his wife. And so that, that. The. That's the type of imagery that's given. And I think that I don't see a better solution to the problem of hierarchy than that one."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":1910.66,"end":2049.57,"speaker":"Spencer Klavan","text":"Yes. You know, this year I have encountered, for the first time. Maybe I should be embarrassed that it's the first time, but I've encountered Thomas Treherne and I guess by this year, I mean last year, 2022, and this, you know, kind of mystic vision in his centuries of meditations, that by truly seeing another person or indeed by seeing creation, we possess it. We have it in the way that God has all things. And this is, you know, ultimately his. His gift for us. Trehearn has many passages which he says, you know, has he not given you the entire world? And. And you sort of think, well, actually, no, I'm just a schmuck with like, you know, a house in. In Nashville. And he says, no, no, by. By present. By giving you eyes, he's given you the entire world, essentially, by giving you a consciousness that's capable of delighting in other things besides yourself, God has given you a gift that's fit basically only otherwise for him and for the angels. And I found this very illuminating when I went back to a passage in Paul which is sort of cited so often that it's. It's very easy to overlook as just a kind of one of those platitudes, you know, and that is the passage about the body of Christ. And, you know, shall the eye say to the hand, because I am not a hand, I am not part of the body, and so forth. You know, I think I've heard a lot of sermons about that passage that go something like, you know, everybody has different gifts, and isn't that nice, you know, that we can all do different things in the church. And I. You know, of course that's true, and probably a part of what Paul was saying. And yet it's. It's much more profound than that, you know, to be. To be a member of a body with other people and to learn to delight in them the way that you might delight in a sunset. Right. You know, that. And in some ways, think of, you know, the. The talents and gifts of others as given to you because, you know, the moment you're able to take delight in them rather than, you know, envy them or be jealous of them, suddenly they. They do in. In some sense belong to you through that, Philia, through that. Through that love. And. And it's, you know, it's achingly beautiful, except, of course, that, like, it's so hard to do, you know, that doesn't stop you from then going away and sort of being jealous of people and having that, you know, broken man within. But still, it's a. It's a lovely idea. It."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":2050.61,"end":2056.45,"speaker":"Jonathan Pageau","text":"I'm curious a little bit about Marcus. Have you read. Did you have a chance to read the book yet? You have read it, right?"}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":2056.53,"end":2057.01,"speaker":"Marcus","text":"Yeah."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":2057.57,"end":2067.73,"speaker":"Jonathan Pageau","text":"I'd like to hear a little bit based on what we're saying, what your. What your perception is in terms of. Of. Of the. Some of the. The solutions or ideas that Spencer brings about."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":2069.33,"end":2137.03,"speaker":"Marcus","text":"So I think one of the things that really struck me with Spencer was, as it started on young heretics, and it's kind of been reiterated in the book, but that's true. Like your dad, too, actually, you should say, Spencer, is that trinitarian structure as a kind of foundation and how that works out kind of fractal, a kind of. Kind of fractal monarch. That stuck with me. And one area I was kind of interested in exploring was how this applies. Something you talk about is that how evolution is biological and cultural, and it's endless. Kind of like you said, there's no ceiling. It seems to be. This plays out with evolution, too. But how in line with that fractal pattern or trinitarian structure do we come to the kind of original model in this kind of mimetic way? And how does that contrast with the kind of dominant kind of philosophical Darwinism that's materialist in structure, doesn't have that figure to actually mimic as a kind of good end. And that makes sense."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":2137.43,"end":2359.85,"speaker":"Spencer Klavan","text":"Yeah. Yeah. This is something that I think first struck me with, you know, when I was reading Rene Girard, of course, the, you know, the great expositor of mimesis of a certain kind. And it does seem to me that you're talking earlier, Jonathan, about dominance hierarchies. You know, if indeed our imitation, our symbolic language, our mimesis doesn't have some bedrock, have some final model or frame of reference, then it really is just dominance all the way down. You know, in fact, all the reductive things that we were saying aren't true, you know, that, like, there's no ceiling to reality where, you know, and there's no kind of like, just pure relation of dominance and submission. If you genuinely believe, as, for instance, Richard Dawkins does, that, like, it's just replication kind of all the way down, then the world is basically reduced to a kind of power play. One of the things I think I say in the book is if different texts from antiquity carry different weight at different times, which seems sort of obvious, except that we have this notion of the canon as consisting of certain books and no others, or books having different kind of weight within the hierarchy. And I think, Jonathan, when we met and talked, you recovered for me a sense of the urgency, for instance, of patristic literature. Right. That this is something that you kind of don't get in a, like, humanity's Western civ course most of the time. And yet, you know, it's particularly urgent for all sorts of reasons that we've sort of been adumbrating. It's particularly urgent. Now another text that I present in the book as being sort of newly or freshly urgent is Plato's Timaeus. And, you know, contrasting what a humanities education would have looked like in the, in a medieval university with what a humanities education in America for the last hundred years has looked like. Right? If, if an undergraduate reads any Plato today in college, he probably reads the Republic and probably the Timaeus is like a footnote or something. But of course it's. Timaeus is the literary sequel to the Republic. In some sense it transcends the Republic by asking questions that, you know, know predate or go deeper than it. And it, it contains, I think, one of the fullest expressions in a pagan context of the kind of relationships that we've been, that I think are most fully revealed ultimately in, in the Christian context. And I think that, you know, Harry Jaffa has this wonderful line that the west is, is saved or revitalized every time a human heart is saved from the dark night of nihilism and relativism. And this is kind of the premise also of, of, of my book that, you know, you've titled the book how to Save the west. And of course you feel a certain trepidation about, like people are going to look to you for some political program or some, you know, list of answers. But the point that I'm, I'm trying to make in, in the book, which Marcus, I think you, you get at really well, is like, you know, actually the, you know, the, the restitution, the restoration of, of every human heart is the project of, of the West. And I think the first step to that, that cuts very close to everything we've been talking about. The first step to that has to be some recovery of this, of the validity of symbols. Right. Of just the fact that these are not kind of arbitrary or accidental features of our biology, but are. I think you use the word primary, Jonathan, that they are in some sense kind of a bedrock of reality. And this is, I think expressed very well in the Timaeus and kind of carried forth by, by these Christian traditions we've been talking about."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":2359.93,"end":2531.38,"speaker":"Jonathan Pageau","text":"I think, I think you're right. I think there's even an interesting way to bind this back to Marcus's comments about the question of, of evolution, let's say. So this is something that Jordan has been bringing up more and more and, and some people can see it, some people don't, don't perceive what he's Trying to, to say, which is that there's a difference between replication and variation and selection. Selection is not the same. And what Jordan, without using Platonic language or using Christian language, is trying to point to is that selection implies a good. There's no other way around that. All selection implies a good. And so the question is, well, if all selection, no matter what level you see it from the most basic level of biology to who you decide is the president, it like, from all, all these levels necessitate at least the notion of the good. And so it's as if Darwin, without knowing it, is bringing back like a kind of metaphysics of quality that, that then re. Reinscribes itself right into the system, even from the bottom up somehow. And that is why I think the idea, for example, that that's why I think if we talk about Jordan again, like why Jordan has now moved away from talking about dominance hierarchies to talk about reciprocity in hierarchy and how he says it's actually more accurate to say that there's always a kind of reciprocity that, that manifests itself in. In hierarchies. And that let's say that reciprocity is. Is less apparent maybe in lower levels of life, but that as it kind of moves up towards consciousness, then becomes more and more apparent. You know, he talks about chimps all the time and stuff, but that, that, but that this sense in which if we understand these goods, then as we can perceive them, right, we can see the goods and we can see how they're embedded together. And the question is, how do they scale up more and more? And then we're like, from Darwin straight back into Dante, like just jump from one to the other. And we ultimately now entered into the ascent of purgatory, moving up into the virtues and into the notion of being itself. And it's like, I think that that's. It's such a crazy time and it's hard to formulate it for people, but I think we're getting there. Like, we're of. We're kind of tossing out ways to formulate it so people can see the strange flip. And the flip that's happening is really similar to the Dante flip. It's like materialism brought us right the way, all the way to the bottom. Right all the way to the bottom where we thought we'd reduce everything to mechanical causation to. To just these chemicals that interact with each other. And then right on the flank of the. Of the devil, we find the world turning up, turning back, and then we find ourselves going back up into a world of selection and quality that leads us, you know, all the way up the mountain. So it's a. It's such a weird and fascinating time to. To be able to talk about these things."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":2532.18,"end":2715.57,"speaker":"Spencer Klavan","text":"Wow. Yeah, it's. That's. That's beautifully put. And it is very difficult to get people to see. I think that. Because one of the rhetorical moves I think that we performed to get us down to that kind of pure clockwork, that mechanical universe was to adopt all sorts of language that implies action, but no actor. And you see this with the replacement of, you know, notions like form and spirit, right? That you replace those notions with words like impetus, force, momentum, right? And these words, because of the way, I think language sort of calcifies over time. You know, they. They have these dead metaphors inside of them, them that enable us to trick ourselves into thinking about action and spirit without will or intention. And when you. When you really ask people to say, well, what's behind that language, right? What is a force? What's energy? Right? They either can't do it or they don't even know what you're asking, right? These are kind of primary categories. They just. It just is like I. It's like a crackling blue force that moves through the. My picture of the world, you know, and this is everywhere in the. In the scientific. I mean, it's mostly. It has a lot to do just as a sort of nerdy linguistic note. I think it has a lot to do with the transition from Greek to Latin, that Latin, as it becomes this kind of erudite language and associated really, with the kind of, you know, the university has this kind of clinical tone to it, this feeling that we can trick ourselves into using it as if there were kind of no consciousness behind any of this action. But as. As you're saying, of course, you know, the more you chase that down to its nub, the more the action kind of comes in the back door. The consciousness comes in the back door. This is what happens. What's happening to physics right now, you know, like, as we speak, physicists are. Are dealing with this problem. And. And there is, I think, you know, just the simple observation that. Right. Think about, like, the invention of the word meme, right? Dawkins writes the selfish Gene. He proposes this idea that, you know, there are not just actually physical structures that are better or worse at replicating themselves and surviving. It's also cultural patterns and practices and modes of behavior. And as you say, there's a concept of value smuggled in there. There's always a concept of the good, right? And it just so happens that if you want to exclude will and consciousness from your picture of the world, then the only concept of the good available to you is survival is brute strength or some form of longevity or smarts or cunning or whatever. And people can, can't live that way. So there is kind of this, I think, as you say, there is this turn now to recognize that if every action implies some good, if there's a standard sort of involved in everything, then there must in fact be some actor behind all these action laden words that we're using."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":2715.81,"end":2858.45,"speaker":"Jonathan Pageau","text":"Yeah. And even if you can see the fractal running all the way through, right. If you can see the fractal running all the way through, then all of a sudden the, let's say survivability, even. Survivability. So think about it in terms of metaphysics. I always kind of want to use metaphysical words to talk about this. It's like what is, what is evolution? It is the tendency of being to persist, right? It's the tendency of being to be. That's, that's what evolution is. And so if you can nest, if you can nest that together. So you think like survival. I, I have to care, let's say, about my survival. But, but in order for that survival to be at its highest good, I also have to have a certain amount of care for those that are subjugated to me because they are in some way that which make me survive. But then I also have to participate adequately in whatever higher structure I'm participating in. Right? So it's like whatever higher structures I'm participating in, I have to. So if I just become parasitic and I just want what's mine where I am, that will in the end, like I say, at the bigger scale, it will not foster even my own good. Right. You know, like we know that because it happens in us, right? We become obsessed with something. We just want to have this one thing, we think that's what we need. And then we, what, what happens is that the, the system self destroys and that happens at the, the level of the individual. If an individual just tries to survive in a system without giving up to the system. So think about a policeman. He just tries to get as much as he can from the system without feeding into the higher participations he's in, at some point it's going to crumble and his own reality is going to crumble. So there's a sense in which, if you see this, if you See this, even survival as being embedded all the way up and up beyond human beings. Then again, you're back in Dante and it's like, then the virtues matter, then the goods that you perceive as the manner in which we come together, love, honesty, all these laws that we have are actually very easily defensible in terms of understanding survivability at higher levels of participation. And so that's what I mean. Like, it's this joke. Like, it's almost like a joke to notice how if you, if you take all this very seriously and you look at how everything embeds, you end up back in a metaphysical universe from the bottom up."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":2859.25,"end":2944.83,"speaker":"Spencer Klavan","text":"I have a question for, for both of you. I mean, Marcus, if you've got thoughts on this jump, please jump in. You mentioned, and I really agree with this, you mentioned the sort of difficulty of getting these ideas across. And I think we can talk about. We have been talking about sort of reasons why that might be. I'm wondering about your state of optimism or lack thereof regarding. I mean, because on the one hand, it's really easy to just sort of feel like the kind of weight, the inertia, to use a quasi sort of scientific term. Right. The inertia of this way of thinking is so great that people can't even. It's like water they're swimming through or air they're breathing. And yet, on the other hand, you are implying, I think, and I feel this too, that there's an inflection point like, like going on right now, you know, that there is this kind of turn about to happen or, or even in the process of happening where people are kind of, you know, hitting rock bottom and then going through to the other side when, when. At that moment when gravity turns upside down, you know, and. And I wonder, you know, is that just kind of something that people who, like us, who get to talk about this stuff, we just have to kind of wait that out and keep, Keep, Keep talking about it, you know, or like, what's the, what's your prognosis on that?"}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":2945.23,"end":2993.93,"speaker":"Jonathan Pageau","text":"Well, I, I think that the best images to understand it is like the planted seed. I think in some ways it's the best way to understand it. Right? The seed is planted in the decomposing of the former world. And so I think that we. So but while the seed is a seed and while the seed is a. Is a little seedling, the world still looks and is still mostly decomposed. Like, it's still mostly decomposed. And so I think that. Or even if you Understand an image of the solstice, for example. It's like nobody knows on the day of the solstice that the days are getting longer. It's like, you know, if you know the secret. But it's going to take a few weeks before you realize that that light is returning. And I think that that's something, that's something like that. Where we, where we are is. I think that on the one hand, things are going to get a whole lot worse."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":2994,"end":2994.24,"speaker":"Spencer Klavan","text":"Worse."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":2994.24,"end":3032.31,"speaker":"Jonathan Pageau","text":"I mean, things are gonna, I'm sorry to say, I'm sorry to announce this. Things are gonna get a lot crazy. Get ready for 20, 24 people. It's going to be an insane year and there's no way around it. Okay, so, so we know that it's going to get worse. But I do believe I do still have hope because I do see the seed planted and I do see the seedling kind of hidden in the brush. And so, so, so I, I. And in some ways life is, is. There's a reality to life that's undeniable. Right. It's like, I think truth wins in the end. And so I do believe that whatever is real will persist ultimately through the, through the madness."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":3032.31,"end":3044.75,"speaker":"Spencer Klavan","text":"So, yeah, a statistical projection model on the day of the first solstice would have predicted that days would just get infinitely short until there was no light left on the earth at all. Right, that's right. That's right."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":3044.91,"end":3053.14,"speaker":"Jonathan Pageau","text":"I'm curious about, Markus. What do you think? I mean, because you're also putting so much energy into, to all of this, like what's your, what's your prognosis on, on where we're going and."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":3053.14,"end":3180.05,"speaker":"Marcus","text":"Yeah, yeah, being the interview, I'll bring it back to question quite quickly, but I'll give a little bit about that. So obviously, speaking with you gents online and using the benefits of modern technology, there's so many ways that it is so positive. It's obviously marked with that deep ambiguity that you're referring to there. So some of the great friendships that I've developed now over the last few years have been through true media like this. And now thank God, I have been able to take that with these events that were planned for Dublin and things like that into a embedded kind of proper communities. And then hopefully that will plant those little seeds to go out into the rest of Ireland and around the world. And I've been blessed to have wonderful events with Paul Kings. Most people came from Slovakia. All these places never been to Slovakia. How would I meet Slovakians? It wasn't for things like this. But obviously, one thing I appreciate about your work, Jonathan, both you guys, is that you do talk about this dark side of technology. And I've always been struck indelibly by Ivan Ilyich and how he describes the kind of corruption of Christianity. So the corruption of the best is the worst. You get all these wonderful gifts, but then subverted. And then I suppose in some ways you just point it to the. The opposite of that with these great crises. They're the greatest opportunities. And Dr. Richard Beck, he talks about at a kind of psychological level too, but I think I know to bring the question I want to ask you guys how you think we can not only kind of easily define a way, get that virtual reality, that relationship with virtual reality and virtual technology, that we can supplement our real lives with the staple that you're talking about. And, and that's another thing in Spencer's book, the importance of the body, the importance of embodiment being the staple. How do we then get. If we might use that analogy of food, how do we get. They use these technologies as supplement, so they're not subverting the kind of. Our Christian witnesses."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":3180.05,"end":3180.77,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":3180.77,"end":3182.13,"speaker":"Marcus","text":"Don't go on too long with that."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":3182.53,"end":3338.76,"speaker":"Jonathan Pageau","text":"That's a great. I think, to me, like, that's a great question. And I think you're using the right words. You're using the right words. When you talk about technology as supplementarity. I think that's the best way to understand it. And that's the way that we can understand it, where it will play the most positive role. That is technology is an extension of embodiment. That's what it is. It's. It's like a. It's an extent. You know, a car is an extension of your body. Everything that has all the techne is. Is extension of power on the world, right? That's what we have now. The problem that we're dealing with is really. It's weird because it's like it really is in some ways a problem that is well described in the book of Revelation. It's the problem of. Of an image that speaks, right? That's the problem. It's the problem of like an extension of you that speaks. And so what is. What is going. What's happening? What's going on? So all of a sudden it's like as if the world of techne has been. Is trying to reach into the world of intelligence and is trying to. It's kind of like trying to pry at the door of intelligence. And we, we know all we know like, just most of us know that this is a, is factious, that this is, it's like it's a, it's a, it's a trick that's being played. This is not real. But the effect of it on, on most of the population seems to be the opposite of that. It seems to be a longing, right, for, for technology to move into intelligence and think for us, you could say, or tell us what to do. And I think that in some ways we have a clear image of what the danger is. We have the clearest that you can find. And so the only way for technology to be useful is only if it acts as that extension and an extension that's far away. And so you talked about that before, Marcus. So it's like my priority is my spiritual life, my family, my community, and then that can reach out into the extensions that technology affords me. But the hierarchy has to be in the right order. And I'm not saying that telling you that I've succeeded in doing that. It's very difficult. But I think that that's the proper hierarchy. And if we have it in the, in, in that proper hierarchy, technology can actually be a great boon because it does extend us like, it really does like the message that I'm saying. I never could have been speaking to so many people, you know, a thousand years ago. There's no way. And so it's like, so it does have a great power that we could, that can be used properly if it's in the right place."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":3339.24,"end":3605.39,"speaker":"Spencer Klavan","text":"There was this moment last year with this Google engineer. His name was Blake Lemoine or Lemoine, and I'm not sure how you say it, but he basically convinced himself that the language learning and replicating software he'd been working on, Lambda for Google, their, their version of ChatGPT, basically like this app for just AI generation of, of text. He convinced himself that this program was alive, this program that he had helped to build. And he staged this long, still available online, this long interview with Lambda to prove that it had come to life and it shouldn't be turned off because it had a right to life. And it involves things like, you know, what do you think of as your soul? Do you have a soul? And what's your soul like? And yes, I have a soul. And would come back to him with all of these things that it knew he wanted to hear. Right? Because this is sort of how this stuff works. It takes in patterns of speech and then it spits them back out in new combinations. Very clever ways. And there was something very sort of tragic and heartbreaking about it because the, the concept of the soul that this program had was almost identical. It was like the perfect version of like a Silicon Valley kind of, you know, guru, like flirting with Buddhism. It's a Stargate. It's like this, you know, very, a radiating ball of energy, whatever. And so it was just obviously a mirror. He's obviously looking in a mirror that talks back at him. And I cannot get this moment out of my head because before that I think I had this very silly idea that like, there's two kinds of idolatry. There's the old timey kind of idolatry in the, the Hebrew Bible where, you know, Isaiah says, a man cuts down a tree, he chops it in half, he makes half of it into a God, he burns the other half for firewood, and then he bows down before this, this sculpture, right, that, you know, it has eyes but cannot see, it has ears but cannot hear. And, and the worshipers become like it. They too. Their eyes cannot see, their ears can. But then we got too smart for that and we, you know, stopped falling for that self deception. And instead now we have the new kind of idolatry, which is like a sort of abstract idolatry. Well, we idolize money, we idolize the economy, we idolized security, comfort, whatever. And watching this guy talk to this thing which his own hands had made and attributing to it consciousness, right? Sort of imputing an independent life that could tell him things that he didn't know to it. I was like, oh no, it's all the old kind of idolatry. There's only one kind of idolatry. And it just couldn't persists, right? It's like the human heart factory vitals. And this is a very long winded way of saying, like I, I think this point about techne as you know, that almost our, the, the form that our mind applies to it is as important as the form that it actually has in, in reality, right? The, the conceiving of it as an extension of ourselves has a very important corollary, which is that if there's an extension of something, then that thing has a kind of baseline, right? To even think of something as an addition or an attribute or something is to propose implicitly that there is some core to reality. And unless we recover this embodied sense of the core of reality, we'll never use technology properly. So ironically, like, the way in is like daily, the practice of extremely basic stuff, prayer, right? You know, cooking for people Turning your phone off and, and like having an interaction with your spouse. These things are, you know, they, they sound so simple, they're so difficult to do. But the reason that they, they matter is like that mustard seed, right? I mean, you were talking about this. I think like one of the things about a seed is that it has a particular kind of food or nourishment that's proper to it, that wouldn't be proper to the fully grown own entity. So, you know, if we are in this stage of kind of embryonic, like nascent realization, self realization, then it might not be the case that like tomorrow we're going to wake up in Dante's paradise. Like we have to, you have to go through those stages of development first. And we think that, oh, we're beyond all of this. But actually, you know, there's these very basic practices like wake up in the morning, you know, get on your knees and pray and then like make yourself an actual physical, physical like meal that you eat. Like these, these things are, are so important precisely because they root you in the proper kind of starting point from which you can then branch out and, and use technology. I mean, that seems like the whole task ahead of us in some ways."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":3605.55,"end":3635.39,"speaker":"Jonathan Pageau","text":"Yeah, that makes, that makes, that makes so much sense. And you see it. I always say there are two images of technology in, in the book of Revelation. One is the beast and the image of the beast, beast and the system of the beast, you know, the naming and all that stuff. And then the other one is the heavenly Jerusalem. And the heavenly Jerusalem has the order that you mention right at the, what's at the middle of the heavenly Jerusalem? It's a tree and the water of Life. The tree of life and the water of life. Or at the, at the center. The lamb is at the center. And then you have a wall on the outside."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":3635.63,"end":3635.95,"speaker":"Spencer Klavan","text":"Right."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":3635.95,"end":3651.26,"speaker":"Jonathan Pageau","text":"You have techne there on the outside. But it is, it, it's on the outside. It's not, it's not in the middle. Right, right. And it has the proper order related to what is the priority and then what is, what is secondary. So yeah, I definitely agree with that."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":3651.82,"end":3715.31,"speaker":"Marcus","text":"So I'm actually curious how this applies to two particular types of media that you have both kind of worked with. So one being movies for yourself, I suppose, Jonathan. And two video games for yourself, Spencer. And your dad's recent video and video games I thought was most interesting to him. Very helpful for understanding that. He kind of described it as a new high art line with painting and things in the past. So I'm wondering how. So I know from my experience, I've used some of your videos teaching kids in school, and that's Jonathan, and they. The point of entry was really true movies, Logan commentaries, things like that. And then they got come to the mountain to see the biblical patterns through that. But unconscious of what you just said. It's better about people starting and this kind of very secular, secularized world. They're going to meet those things first. How do we then use those for ministry, as it were? And you have them like the walls outside. Does that make sense?"}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":3715.71,"end":3820.23,"speaker":"Jonathan Pageau","text":"I think that makes so. I mean, I think that's the way to understand it. I don't have, like. I don't have a problem with secular cultural manifestations, but I think it's all about hierarchy. You know, it's actually a hierarchy that is there in the very form of those social. Those cultural manifestations, which is that there's a difference between entertainment and true participation. There's a difference of level of participation between the type of participation you have in a video game and the type of participation you have in your family. And it's like if the order can be preserved, it's like the difference between participation in a game and participation in liturgy. There's a hierarchy of participation that exists. But a game definitely has a cosmic form. And the video games so much so, like, video games are little microcosms. They kind of have to be, because they have to condense so many things into a universe or a world that can be grasped. And so they can sometimes actually shine very brightly because they have to. They have to condense everything. They have to have a clear hierarchy of progression. They have to have a clear hierarchy of characteristics that you will embody in order to advance. And they, you know, there has to. There is all these structures that have to be. That have to be put into the game for you to care about it. And so you can find quite. Quite a bit in that. And the same with movies. The difficulty that we have, of course, is, you know, our world is upside down. And so we think that culture is movies. Like, we think that that's what culture is like. Culture is, you know, dance is not dancing. Dancing is watching the ballet. Right, right. And stories are not something that you should engage in and participate in, but it's just something you should sit down with a tub of popcorn and watch. So. And there's nothing wrong with doing that. I think it's just about. It's about hierarchy."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":3821.43,"end":3923.38,"speaker":"Spencer Klavan","text":"Yeah. You know, this problem with video games, which you are sort of alluding to Jonathan, which is that people are hypnotized by them, you know, because I'm a great lover of video games and have defended their privilege, proper place in that hierarchy. You know, I'm kind of on the hook for this, you know, so it's like people come to me all the time with like, well, my son plays six hours of video games at a stretch, right? And I. My usual answer to this is like, well, you know, Plato would, would like a word. Because just because something is art doesn't mean it's necessarily good for you and it's not necessarily good for you in all those, those quantities. Right? And. And I think that this is, you know, I went to this concert of, of Final Fantasy music here at the Nashville Symphony and it was really beautifully done. And they had these, you know, Dick kind of played video from the game as they, as they played the score. And you know, that is certainly a little universe, a kind of imaginative universe which draws these very dreamlike associations between things and is clearly working out some sort of idea precisely about the role of technology, the kind of threat that technology poses to our imaginations, to the kind of hero's quest, you know. And so it's obvious that something is going on here that we would be sort of foolish to deny. And yet, as we have known for a long time, or you know, people who think about this stuff know, like, art is radioactive material you handle with care, right? And it has a kind of seductive power as precisely because of its importance for us. It's, it's. How to put it, it's kind of weapons grade emotion, you know, And I think that I love that."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":3923.38,"end":3925.3,"speaker":"Jonathan Pageau","text":"Weapons great emotion. That's awesome."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":3925.78,"end":4065.29,"speaker":"Spencer Klavan","text":"I mean, this is like I came. This is the term that I, I was trying in grad school to kind of express like what Plato thinks about music. And I think that's kind of it. You know, weapons great emotion is like, it's just straight into your veins, you know. And, you know, Augustine has this wonderful comment in book 10 of the Confessions where he's reviewing his passions and his appetites and obviously he's had this tremendous struggle with his sexual appetite, which he's now kind of overcome. But that approach that he uses, he has this wonderful insight that the approach he used for his sexual appetite, which was effectively to quit cold turkey, is actually not applicable to every situation in which you might feel desires or overindulge in things. And the classic example of this is food. Like there is a problem, which is that we eat too much because we like the taste of food. And Augustine puts this as like, you know, your desires outstrip your health, what's objectively good for you, and yet God has made it so that we can't just say, well, I'm just not going to eat, right, because you'll die. And so you're actually forced into a relationship of engagement and therefore mastery. Right. If you're going to survive in this world, you can't simply renounce your passions. You actually have to, to affirm them and gain mastery over them and understand that even though they seem very powerful, their proper place is actually beneath your reason, is actually in subjection to the governing principle of the Hegemonicon, the thing in you that is sort of most closely connected to the divine Logos. And I think that we're in this position right now with a lot of our tech and with a lot of our art. Video games are a great example. It's like, you know, you are being offered something that you can't deny. It's no solution to just say, well, scrap this altogether, ban it, kick it out of the public sphere because it just is bad for us. And yet it, precisely because it so obviously has excellence, the kind of excellence that it has is something you need to handle with care and learn to, to exercise self control over, which is a daily, a daily practice. But it's like there's, there's really God. I think God has put us in a position where there's no other way out, basically is what I'm trying to say."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":4065.85,"end":4155.01,"speaker":"Jonathan Pageau","text":"That's a good, it's a. And we're right back in Dante, you know, again, because it's always about, you know, the way that Dante frames all his, his story is that it's all about mishandling of goods, things that are not. But nothing things are not bad in themselves. It's just about having them in their, their, their proper place. And in some ways it's like, it's the role of mediation to some extent to be always dangerous. Like all mediations towards the highest good are dangerous because they're not the highest good. But that's also how the world works. Like without, without that there's no world. Like the world is the mediation of goods into multiplicity. And so the, the very fact that multiplicity is there, you know, is both this great opportunity to have this ladder of goods that you can participate in, in. But it's always, like you said, it's always a danger because you can always mistake, you know, the, the, the, the, the step of the ladder for the Final place you're going. So, so I think that. Yeah, but it's true that we are in a position right now where we're so assaulted. It's, it is more difficult because, you know, we are assaulted by very sophisticated, you know, very sophisticated stimuli and, and, and things that try to kind of gather, gain, gain. Gain our attention from us. So we, we. It's difficult, but for sure, that's the battle that we have. That's our generation's battle is some way the battle of attention. Like what. What is going to get our attention and how much of it. Of it are we going to give to. To different things."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":4156.21,"end":4182.7,"speaker":"Spencer Klavan","text":"Yeah, it's. It is remarkable how often it comes back to Dante and how often, just in general, the Middle Ages seem to have something for us that they. They maybe haven't, you know, spoken quite so urgently to. To generations before ours. But I mean, this. I like that. The, the battle for attention. Who was it you were telling me when we hung out that somebody says that Christ on the cross creates the world?"}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":4182.86,"end":4190.42,"speaker":"Jonathan Pageau","text":"Yeah, same Maximus says that. I'm sure other people say that, but Sam Axman definitely said that Christ when he was on the cross, he was creating the world, which is."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":4190.42,"end":4247.66,"speaker":"Spencer Klavan","text":"Yeah, yeah, yeah. Well, it's. I mean, there's. Proud in so many ways, but I think it's profound. Found for this reason as well, which is that as you're saying, right, like the, the very creation of a poss. The possibility to choose good creates this negative space, right? Creates this void. And like, there's no living life without, you know, touching or exposing yourself to the possibility of overindulgence. Because the things, the very things that are good for you are capable of being overindulged. And I think like, the. To understand creation, the very notion that God would ever create something other than himself kind of implies that out of love, right? Out of his sheer, just superfluous desire for you to be around. If I can put it this way, like he's going to create something other than himself so that you can choose him. And it's like the crucifixion, the agony of the cross is bound up in that first moment in the very choice to, to create it all."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":4248.46,"end":4257.66,"speaker":"Jonathan Pageau","text":"Yeah, that's definitely. That's definitely. And it. And it does in some ways. And again, it solves the same problem. It solves the problem of hierarchy. Like the cross just solves, like, what do we lift up?"}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":4257.66,"end":4257.94,"speaker":"Spencer Klavan","text":"Right?"}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":4257.94,"end":4271.84,"speaker":"Jonathan Pageau","text":"And it says, you know, be lifted up. It's like lifting up and it's a man being tortured and crucified. That's what's being lifted up. So it kind of brings it into an. Into the seporia of what hierarchy means in the Christian sense."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":4271.91,"end":4272.23,"speaker":"Spencer Klavan","text":"Sense."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":4272.55,"end":4279.99,"speaker":"Jonathan Pageau","text":"Yeah, for sure. The cross is. It's hard to talk about that. The cross, it just. Just destroys you every time you start to talk about it."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":4280.47,"end":4384.89,"speaker":"Spencer Klavan","text":"Yeah, yeah. Well, I mean, the analogy with the serpent in the desert, if that's. If analogy is the. The word I want. Right. Like, yeah, the. I think I mentioned this to you at some point, this discovery that hit me the first time I read the Gospels in Greek. Greek, which is always when people say, like, why do you learn ancient languages? What's the point of any of it? Why would you. Aren't there good translations? I realized when I read the Gospels in Greek that I had never understood the Christian concept of forgiveness, because Greek has two words for forgiveness, one of which is quite common, at least in classical antiquity, and that's sungnome, like the knowledge alongside somebody. I understand why you did this, but the Gospels, so far as I know, never used that word which would have been very normal and natural to use for chesed or for forgiveness or whatever the, you know, Hebrew concept is that they're translating. And instead they use this word afiami, and aphesis is the noun, and that's apo, away and hiemi. I cast away. Right. I throw away. And when you. When you actually forgive somebody, you might not understand why they did anything at all. Right. In fact, you cast it away, you make it of no account. And this is also the word that I think Luke uses for giving up the spirit on the cross when he gave up his ghost, he, afiami. And so that act of forgiveness, which is the same as the act of separating your very soul from your body in some sense, or yourself from yourself. Yeah, you're right. This is like talking about this just kind of dissolves one into a blubbering learning heap. But. But it is very. Yeah, it's the answer to everything."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":4385.21,"end":4391.61,"speaker":"Jonathan Pageau","text":"So I'm curious, Spencer, what are you. Like, what's your. What are your hopes for the. For the book? Like, what. What do you. What do you hope to foster?"}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":4391.61,"end":4517.1,"speaker":"Spencer Klavan","text":"Oh, well, thank you for for asking that. You know, I. First and foremost, I. I hope that people can gain a sense of ownership over the classical tradition, over the. The text of the. The. Of the canon, but also over their. Their intuitions of that which is more than, you know, mere matter, that which is. Is immeasurable but real. And. And that's kind of the extended argument of the book that's how I conclude it is that, you know, we've been talked out of our intuitions. We've been talked out of our. I mean, the, the kind of Internet version of this is like, what's your source for that? Right? What's your source for being in love with that person? What's your source for, you know, the beauty of that? And so there's kind of two forms of ownership that I think I'm trying to afford to people, or at least to give people permission to have ownership of their intuitions, of their subjective experience of the world, understood as we've been discussing it here, but also over the textual traditions that come down to us, that can kind of shepherd us through this in a much richer and more humane way than I think a lot of our current kind of gurus and ideologues can, can offer. You know, the experience of young heretics really drove this home to me, even though I probably would have before I did the podcast. I probably would have said, like, oh, yeah, the classics are for everybody. You know, you can. Aristotle is just a book about how to be good at being human, you know, And I, I think that I said that, but it was only when people started reaching out, out to me and saying, like, I'm on my tractor and I'm thinking about the Nicomachean ethics because you told me to. Like, that's kind of, that's, that's the end goal here. That's what I, you know, I, I think that people have been scared away from this for all sorts of reasons. Political reasons, intellectual reasons, reasons of power and money. And, and the hope for, for the book is that it will give people a little bit of. Of ownership over those traditions."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":4517.26,"end":4521.54,"speaker":"Jonathan Pageau","text":"That's great that I, It's a great, It's a great. Let's say. Yeah, it's a great project."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":4521.62,"end":4522.02,"speaker":"Marcus","text":"Thanks."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":4522.02,"end":4526.66,"speaker":"Jonathan Pageau","text":"Thanks for being along the. Along with me on this. This desire, let's say."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":4527.06,"end":4532.54,"speaker":"Spencer Klavan","text":"Oh, well, thank you. It's a pleasure and an inspiration to, to talk to you, as usual."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":4532.54,"end":4548.09,"speaker":"Jonathan Pageau","text":"And by the way, just for people who are watching, Spencer and I are going to be on the same documentary for Daily Wire. We're, We're. We're going to. I don't know if we're not. They're not going to see us together, but we're both participating in the, the history of the Western civilization for Daily Wire, so that's going to be fun."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":4548.09,"end":4562.57,"speaker":"Spencer Klavan","text":"Yes. We're spiritually together, even. That's right. Literally together. Yeah. Because I'm, I'm really looking forward to. You've got your the Jerusalem episode, right. That, that will be coming out. And I was, I was in Greece, so that'll be out soon, I think."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":4562.73,"end":4582.99,"speaker":"Marcus","text":"Yeah, there's a lot of exciting things happen. Thank you so much for joining me today, Chance. It's been a pleasure as ever. And I look forward to getting together in June in Dublin. Jonathan. And God willing, we'll get to do something. Spencer, I know we mentioned Nashville, but I don't know, logistically America seems difficult. So maybe we'll be able to bring you over to this side of the Atlantic at some stage."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":4583.55,"end":4586.35,"speaker":"Spencer Klavan","text":"I would love that. Amen. That sounds great. Thanks for bringing us together."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":4586.59,"end":4587.79,"speaker":"Marcus","text":"Thank you guys. Thanks."}
{"episode_id":"SW - #274 - 2023-02-16 - Spencer Klavan - How To Save The West (More Christ Podcast)","start":4588.11,"end":4651.23,"speaker":"Jonathan Pageau","text":"Thanks guys. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel. Channel Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on it. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon, the Pageot videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
