{"episode_id":"SW - #109 - 2020-07-23 - June Q&A","start":12.56,"end":514.1,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. All right, here we are. I see Bradley is there in the chat. Good to see you. Hopefully some more mods will be there. I see a bunch of people from the Facebook group. Marianne, Laura Lee. Neil is there as Dirt Poor Robbins, our con. I did a. If you go on, on social media, you'll see I posted two conversations ahead with the band Dirt Poor Robbins. And so Neil is there in the chat. He can maybe post the link if he wants to. That was a lot of fun. We talked about the symbolism of their music, of their album covers, and we even talked about weird things like Frankenstein, the Wizard of Oz too, if I remember correctly. So, all right, this month, my goodness. Oh, man, I wish I could. I wish, you know, I wish, I wish I didn't have to say, I told you guys that it was gonna get worse. But it just keeps getting worse. This year just keeps getting worse. And so we'll get through it. As you've noticed, I've been putting out more content in the past few weeks. You know, content dealing with the situation, with the protests, with the strange religious, let's say, acts that people have been doing. I mean, even the Patreon only video for this month has been on that, talking about foot washing. And so, yes, we're right in there. As the culture war rages, hopefully we can look at it with a clear mind and try to see what's going on and how we can understand it. So hopefully those videos have been helpful. One of the things that's been going on in the background that, that, you know, I, I still really want to. To point your attention to is that on the website, the symbolicworld.com we now have a blog with a bunch of articles written by different people. And just a few days ago, someone. Timothy Aspel. Slaw. I don't. I hope that's how pronounce your name. Timothy Aspel. He just put up an article on Minecraft called From Mines to Mountains. And it's very interesting because he talks about Minecraft itself, but he also talks about how video game creation needs to respect the rules of a traditional world. And so they. The way that they usually create like this flat map with like a dome. And the further you get from the center of the map, the more things start to break down and start to be more difficult to calculate. And so because of that, sometimes it gets weird. And anyways, it's very, very interesting. It is definitely worth your. Your attention. So check that out on the Symbolic World dot com. Thanks for everybody. Who has been supporting me. I, I feel very touched because I know it's been so weird and so uncertain that, that I'm very touched by those that want to continue to support what I'm doing. And as you know, those that, that support me at $10 or more, you get to ask questions in advance. And there are a lot of questions, so hopefully we can get through them. And then also if people want to ask questions in the chat, for now, I'm just going with the super chats because, because there's just too many questions. And so if I started to, to, to look at the chats themselves, then we just, it would just be overwhelming. So it's not the perfect solution, but for now, it's the best solution I've got. All right. And so I will start answering the questions and I usually start with my website, so start with the symbolic world. So Adam asks, have you ever given any thought of recording a Bible study? Maybe something funded by those interested? Sure, that's definitely possible. You know, there are too many things to do and there's not enough time. And so I figure at some point that could be. You know, I always thought that the day that I run out of spontaneous things to about, talk, talk about, then maybe I will do something like, like a more systematic study of a text, either text on the Bible or maybe a fairy tale or a myth, and really kind of read through it with you guys in order to, in order to, to really do a deep dive. But that's not for right now, because right now there's enough stuff to do. So. Josh the mover says. Hello, Jonathan. Why do early biblical figures live for so long, many hundreds of years in some cases. I have heard a few different takes on this and am curious to hear yours. So it's not, it's not that early. So the idea would be to understand that it's not early biblical figures. It's very specifically pre Diluvian figures. And so before the flood, you really have to understand the flood as a change of worlds. The flood is the end of a world. And so there are many things which help us to. Let's say there are many markers which help us understand the difference between what's there before the flood and what's there after and the number of years. The best understanding that I have of that is that it has to do with the notion of completion. So you have this sense that a thousand years would be the totality. And so you have these characters that die short of a thousand years, you know, for different reasons. Their sins make them, you know, die short of a thousand years or something like that. And so I think that it has something to do with that. And it also does really create the sense of. Create the sense of a different world that we don't totally can not completely connect with that. It's a world of greater men. It's a world of, of more encompassing men. Men that. Men that had more reach in terms of their being, you know, that were closer to the top of the garden, right? That even though they fell, they were still higher up on the mountain, the cosmic mountain. So that's the way that I understand that. And so what is the significance of the number 40 in Scripture and tradition? Well, my son, sense of the number 40 is that it's related to a cycle. It's related to, to a full cycle. And so usually you have these 40 years, 40 days. All these, these, these numbers have to do with this, with this idea of, of a full cycle that would go maybe through four different quadrants. You can understand it like that four seasons or four whatever, and that it's a full, full turn of that, of that wheel. There's probably more numerological reasons, but I've often told you my. Although I do have a little bit of a sense of numerological symbolism, it's not my expertise. Some people know a lot more than I do on that. So NC Watson asks. Hello, Jonathan. Do you think a modern writer could recreate a work like that of Dante, one that unites the personal, historical, mythological and cosmological? In other words, could Dante's structure be given a new body? And if so, what might that look like? I think so. I think that it would be possible. But I do think that I'm going to be controversial with this one. I really think that Dante's work is not just a work of an author. I think that Dante. I think that Dante's work is connected to something more in the sense that I really think Dante had a. Had a vision of some kind or had a. Or he himself had gone through what he was describing. Maybe that's the best way of understanding it is. I think Dante wasn't. I think that Dante's work isn't a work of fiction. I think that Dante's work is a work based on his experience. And so do with that what you will. Do with that what you will. All right, so New Myesh says."}
{"episode_id":"SW - #109 - 2020-07-23 - June Q&A","start":516.74,"end":517.02,"speaker":"Justin Ward","text":"I."}
{"episode_id":"SW - #109 - 2020-07-23 - June Q&A","start":517.02,"end":1072.99,"speaker":"Jonathan Pageau","text":"Have been bothered by Paul's statement in 1 Corinthians where he says that those who are circumcised should not become uncircumcised, and those uncircumcised should not be circumcised. He also states in Galatians that the one who is circumcised is obliged to go obey the, the whole law. Someone who is Jewish and believes in Christ. I'm not sure how this would apply to me or how to integrate my identity with the body of Christ. I have been part of a movement my whole life that has tried to deal with this type of problem, but I have become more and more disillusioned. I've also tried to find examples in the past, but they are few and far between, especially the farther back it goes. What do you think would be a good starting point in dealing with this? So I would say that a good way to maybe understand it is to look at the very early church and to look at the manner in which there was the church of the Jews and the church of the Gentiles. And so you can see that in the iconography, really up to, even up to the 5th century, you still have this idea of the church of the Jews and the church of the Gentiles. And there was this, this notion which really lasted for several centuries. And so maybe it would be interesting to look at that and to look at how early Christian Jews, you know, how, how they found their, their place. But in the tradition of Christianity, what ends up happening is that the Jewish community, they, this, the. The difference between the church of the Jews and the church of the Gentiles just kind of slowly goes away. And it comes to a point where, you know, as Christianity becomes the religion of the, of the Roman Empire, then it feels like the integration of the faith and society has been more complete and things like celebrating the Sabbath will stop at some point. And so that's, that's where you can kind of see that the distinction goes away and that those who would have been of Jewish descent would not have, would not have been required to follow the, all the Old Testament rules. There's also really is a difference and it's very important to understand it. It's probably difficult for people to realize that, but there is a difference because of the destruction of Jerusalem, that there's a difference in Judaism that is, Judaism is also born with the destruction of the Temple. Christianity and Judaism, the way we understand Judaism today are really come about at the same time. You know, there are no Jews today who are doing sacrifices or doing the kinds of things, all of sacrificial law, which is really the center of the, the of Israel's worship is gone when the temple gets destroyed. And so it's important to understand that there is a transformation which occurs there which I think continues on and makes it so that Christian Jews at some point are not required to follow all the rules. Now, as for the circumcised and uncircumcised, there is a relationship in St. Paul. There really is a relationship between the way that he talks. So it's really useful, if you want to get a sense. It's really useful to read the Epistle to the Hebrews and then read the Epistle to the Romans, like, read those two in parallel. And it's going to be very fascinating to see the type of language that is used to talk, to talk. There's a reason why in the Epistle to the Romans there's this emphasis on faith, you know, and on faith without the law. And there's this type of speaking which is addressed to the Romans. And probably he probably, St. Paul probably would not have said the exact same thing to the Jews as well. So maybe that's a few, few hints. And I'm sorry for your frustration. I can understand how that could be. That could be annoying. All right, so Keenan Cronin says, how is it that death came into the world through our fall, but the dinosaurs were wiped out long before we existed? Is it possible that we disobeyed God in the garden outside of cosmic time, which then brought death in the world from the beginning? That's the only way that I can make sense of this. And I'd love to hear how you reconcile the fact that death and corruption seems to be around before humans ever physically existed. I think, Keenan, you really just have to not mix the narratives. I. I know people will be very unsatisfied at. At the way that I present this, but the way that the story is told in scripture is just not the same way that the scientists tell the story. And so when you try to mix them together, you create monsters. You create things that don't fit together. You have giants and hybrids and weird, weird monsters. So I would say that. I would say that you need to look at it in terms of narrative and not. And try to look at the Bible like some scientific description of some phenomena that happened. I'm not saying that what happened in Genesis didn't happen. I've repeated this many times. Yes, I do believe it did happen. But there are many ways to describe something that happened. There isn't just one way. And, and so I think the way that the scientists describe what happened is Just not the same. So I don't know what to say, but in terms of understanding this notion that death came in with the Fall, I think that. I think that one of the interesting ways that I've been thinking about recently is the idea that death. I've talked about this relationship between death and glory. So there is this sense in, for example, in the hymns to paradise that the animals are outside of the garden. And there really is a tradition which talks about animality as being the same as death. And so the garments of skin, the garments of death which are added to Adam are animal skins. They're animal garments. And so even San Gregorio Nyssa says, that which was dead was added to our nature. That which came from the animal world was added to our nature. And so there is also a hint there that maybe in an ontological hierarchy, you can understand that. That the animal aspect of creation had, let's say, had a form of, or represented or manifested something that. Which would be what we call death. That there was a. There were. There was more movement in the. In the outside of the garden. But that's really just speculation in a way. It's not totally necessary to. To really have to reconcile these. But that could be a way to. For you to maybe think of it differently. That could help you to. To solve your. Your. Your suffering at. At trying to reconcile these things together. All right, so Luca Ash Kovic asked. I know this is a lot of questions packed into one, but basically, okay, here we go. What is your prediction opinion for the far future? What's what the future holds for our civilization if this isn't the true end, the apocalypse, if you will, what happens when people realize that modernism and the modernist way of thinking was a terrible idea? Will we return to some form of neo. Medieval epoch? Will technology eventually break down and fade away? I think that when you look at the story of the New Jerusalem, you get a sense that technology will not. The technology will be integrated ultimately, that in the ultimate reality, technology will be integrated in its proper place. That is the garden in the middle and the Tree of Knowledge and the Tree of Life, the Tree of Life in the middle and the water of life in the middle. And then on the outside, you have the walled city. And so that technology will. Will have. Will be in its place. And so that's what I think is the ultimate image that you find in Scripture now, what. How that will happen and how that'll come about. It might come about. You know, it seems if we read in Scripture, that the end of the world Comes about with a lot of. A lot of pain and destruction. So, I mean, we've already seen a lot of pain and destruction. You know, some of the things that are described in Revelation. It's possible that it's the type of thing that we already saw in the 20th century, like the mass purges, the millions of people slaughtered, the. You know, the. The ultimate total warfare, the. The. So, I mean, it's not. It's not like we haven't already had a glimpse of what, you know, civilization falling into complete conflict and complete chaos and the great. The last great battle could look like. And so, I mean, I don't know. The thing is, I don't."}
{"episode_id":"SW - #109 - 2020-07-23 - June Q&A","start":1073.15,"end":1073.39,"speaker":"Justin Ward","text":"I."}
{"episode_id":"SW - #109 - 2020-07-23 - June Q&A","start":1073.71,"end":6462.57,"speaker":"Jonathan Pageau","text":"What I see are certainly patterns of the end. I see there are patterns of an end. Now, is it the end of everything? Is it the end of Western civilization? Is the end of. I don't know. Like, I don't want to. I don't want to be too bold in what I say, but for sure, the clown world, the focus on the exception, the desire to account for everything, you know, the technocracy, and also a re. A, let's say a reawakening of spirituality, but in a very dark way. You know, the fact that everybody is curious of. Everybody's interested in spirituality, but they. They want a kind of chaotic spirituality. Everybody wants to, you know, their angel or they meet these. These. These beings that they. That they meet when they take drugs or whatever. So these. This is. This is. This is dangerous stuff. It's like a. It really is like these demonic hordes that are. That are on the edge of the world, that are trying to find cracks to come in, you know, and that's what it feels like right now. And so. So it doesn't look good, but yeah. All right. So Roxanne asks, isn't it important to keep in mind that symbolism opens up understanding to deeper meaning? I'm concerned about a tendency to want to pin down meeting using symbol as one uses straight pins for a butterfly connection. How can that danger be avoided? Well, the way that the danger is avoided is to you always, is to understand that symbolism only functions through analogy. Functions through analogy, and it also functions through structure. So you always. If someone's talking about symbolism and isn't ultimately talking about pattern and structure, but is trying to just say that this thing means that, then you can already stop paying attention to what they're saying because it's. It's going to be extremely trite. It's. I mean, it's fine. Like, it's fine. To understand, I don't know, it's fine to understand that if someone has an Iron Cross, that it is a. It is an image of a prize that you win for a certain type of bravery in the war. Like, I mean, it's not completely void of meaning, but if you don't understand the. How it connects to a pattern and the pattern of ornament, the pattern of metal, the pattern of adding something to you to make you different from others, you know, Although if you don't understand this other aspect of, of symbolism or how the cross becomes glory, like all of that, then you're going to miss out. And I mean, it's fine like in normal. In normal life, you know, it's good to know that the Iron Cross is given by this country to this type of person. But that's the way to avoid it. The way to avoid it is to always make. Is to always look and see if the person is connecting things to a broader pattern and is also able to see analogies with other things. So if you're not able to see analogies with other things, then that's when the interpretation is in danger. If you notice, like, if I. Every video I make, I. Maybe not every. I hope every video I make, I'm always trying to give you, let's say, the pattern version of that pattern, the one that appears in Scripture. And then usually I try to find a really, really surprising example, like something you hadn't thought of would be connected to that. So that you're. You're able to say, okay, yeah, okay, this really is a pattern because, you know, this stupid movie or this, this strange phenomena in culture is connected to the same pattern. So, okay, what is this? So Benjamin Rva asked, what is this? What is the significance of the aesthetic of coolness and its ubiquity as an ideal in our culture? Is it related to prevalence of irony? Does it rise, does its rise come at the cost of other values? I mean, it's very simple. Coolness is just that. It's a symbol of power. It's a. It's the. It's a version of the. It's a version of the idea of the snooty elite, right? It's the idea of the elite which is above things and is not affected by things, you know? And so you have this image of. Of an aristocrat who is extremely, extremely. Has extreme prowess in. In doing something. Like he can ride a horse, you know, in a really amazing way. But it doesn't bother him because he's so above it that you know it, he doesn't. He acts very cool about it. And so it really is just an. It really is just a symbolism of that. And so, you know, obviously depends at what level, but it's mostly about that. It's about looking. Looking detached from something in order to announce that you have power over it, that you're better than something. Okay, so Bogdan asks. Hi, Jonathan, what are your thoughts on the meanings of dreams? I'm interested in Jungian dream reading, and I'm wondering if that technique has a history in the church or if it can be integrated into the Christian tradition. I don't know a lot about Jungian dream analysis. What I know about dreams is that most dreams are meaningless. Meaningless in the sense that the idea of sleeping is that you go down into death for a little bit, you have a little death, you go down into chaos. And so your mind and your body are disconnected, right? So you have all these thoughts, right? And then your body is moving around. That's feels like it's not connected to, to your, to your, your. Your mind, right? So you have this disconnect. It's little death. And so let's say one of the things. So most of the time it's just like nonsense because it doesn't connect with reality. But once in a while it's. It becomes more like this idea of. You can imagine. Can imagine something like the idea of water that is very calm, right? And so if, if the. Your consciousness is extremely calm and is extremely centered, then it is possible that, that death or that descent into the waters will become like a mirror. And then it will actually manifest. It can manifest something very, very high. And so there are dreams. Of course, you see it in scripture, you see it in the tradition. There are saints, there are holy people who can have prophetic dreams. And those dreams contain cosmic patterns in them, contain patterns which can help you even understand, you know, what's going to happen or the way in which reality unfolds. And so I think that that is definitely possible, but I would say that it is rarer. It is rare, but it. And so you can understand that it could also be. It could. It could also be at a lower level. So you can imagine that a saint could have a cosmic dream because the saint is so connected and so centered that he actually becomes a mirror for the entire cosmos. But you could imagine that if someone could have a dream that is showing the pattern of their psyche. It's not. I don't think it's stupid to think that. I think that it makes sense. But it would remain to be seen whether or not people are really capable of interpreting those. I don't know. All right, so David Flores says is Goldilocks from the folktale Goldilocks and Three Bears, a representation of tyranny. I've been trying to figure this one out and can only figure she represents the top of a hierarchy because of her gold hair and bizarre actions. Venturing someone's home and partaking in their food with information. No, the, the story of Goldilocks is, is all about hospitality. It's all about, it's all about the problem of things that don't fit and the relationship of hospitality to the stranger. So on the margin of the world, in the forest, in the dark forest, on the edges, there are things that don't fit. There are things that don't connect to you. They're too big, they're too small, they're too soft, they're too hard, they're too hot, they're too cold, whatever, it doesn't matter. It's the idea is that they don't, they don't, they're not, they don't fit with you. And so that is what's going on. So Goldilocks goes into these houses and the things don't fit. And then she finds the things, the thing that fits with her. But in finding the thing that fits with her on the outside, she's actually transgressing hospitality. Because the relationship, the relationship between let's say the outsider and the insider is that there has to be a kind of buffer of distance in order to respect each other's identity. And then, so we, we encounter each other as strangers, right? So that is the, that is the, the proper relation of, let's say, the proper relation of, of hospitality. But let's say you, you, you recognize something in your relationship to the strange. You see something that has value for you and then you take it, right? And that's a, that's a story of a lot of situations. It's a story of colonization. It's the story of so many situations where when you find something in the stranger that you recognize, you end up transgressing hospitality. You end up taking. And somehow. So it can be, it could be, the story could have very, very dark, dark undertones if you understand what's happening. But that's really what it's about. And so the bears in the story are like the dog headed men, right? They're like St. Christopher. They're like the monsters on the edge of the world. They're these Talking bears that live in there. This whole idea of the barbarian. Right. And so that's what the bears are. And so you need to find a normal relationship with that which is outside of you. All right. All right, here we go. Okay, so Massasar asks. Hello, my friend. I really appreciated your conversation with Andrea. With the bangs and sorting myself out, I wanted to explore a bit more on the question of masculine feminine. I understand the feminine as the matrix in which reality comes into being. Is that right? Yes. That's a good way to see it. Or at least one. One aspect of it. The masculine as the principle in which meaning comes together. Is that right? I wouldn't say that the meaning comes together. We could understand it as the seed or the principle. And so the coming together happens as they join together. Right. As the masculine family come together. That's where the coming together happens. That's where the consummation happens. That's where the union of opposites. That's where the child is formed. Right. That's the coming together is the child. You have to see seed. You have the womb, you have the child. Right. And that's that. That's it. Okay, so my main question is related to the nature of the primacy of masculine over feminine. Adam came before Eve and Christ pre exists Mary and yet Eve causes Adam to fall and Mary gives birth to Christ. In this there seems a mystery. Could you elaborate on this a bit more? Oh, my goodness. There is definitely a mystery. There is definitely a mystery there. And St. Paul knows there's a mystery. St. Paul knows there's a mystery. I forget that the reference of the passage, but St. Paul talks about this when he says, you know, every, every man comes from a woman. The first woman came from man. Every man comes from a woman. And then he taught, then he says, I say this about Christ and his church. There's this like, there's this very interesting relationship. And St. Ephrem the Syrian, in his comment on that text of St. Paul, he goes intense because he then connects, which St. Paul doesn't do. St. Paul just says, there's the mystery there. But St. Ephrem the Syrian goes even further. And then he connects the masculine coming from the feminine to the divine nature of God as the divine womb and God manifesting himself out of the divine womb. And so it's like, wow, my goodness. So the, if you. It's going to be very difficult for you to find the, the causality, right? Because it just depends on which side you're looking from. The, the infinite itself is neither Masculine nor feminine, the origin of all things. And so it's, it's as if what you're seeing in the stories is the, the, the way of describing it is flipped in different stories. Right. Like you said, so Eve comes from Adam, but then all of man comes from Eve, and then the church is. Christ is born out of Mary, but then the church is born out of Christ's side, etc. Etc. Etc. There's this relationship of causality which if you take both at the same time, can maybe point you to a mystery which is above it, which cannot be uttered. Maybe that's the best way for me to describe it. So Diaz Brew says, would you ever consider an interview with Father Moses? Barry and or Turbo quars from The Fellowship of St. Moses? The Black conversation about how to properly integrate the outsiders into the heart could not seem more timely considering the current state of affairs. I think that's a good idea. You know, I have, I met Father Moses a few times and had a very good contact with him. And same thing with Father Turbo. I've had several exchanges with him through messenger, through email. We've talked about my article on St. Christopher and different things like that. So, yeah, I would be very happy. I, I, it's, it's. I'm not really good at organizing interviews, but, but yeah, that might be a good idea. It might be interesting to talk to Father Turbo. They both have very interesting stories as well, so that could be interesting. Think about it. Okay, so Jacob asks. Oh, Jacob. Jacob Russell asking questions. All right, well, I will answer your question nonetheless, Jacob, even if you're not there. I feel, I feel left out. All right, okay. So Jacob says, I have had many wonderful conversations about what a symbol is in the Internets. I found with the uncommon use of the definition nerds like us use for symbol, others try to use a different word to make sense of these ideas. The most common has been metaphor, which seems that it's rude to mean a transfer of meaning with no gathering. Yes. Instead of talking once more on what a symbol is, could you riff on how metaphor might or might not be used to talk about meaning, purpose and symbol? I mean, look, I don't really, I don't really care what word we use. I use the word symbol because in the word symbol there is the meaning that I'm trying to refer to. And like you, like you said, I think that metaphor can be a problem because it does indeed tend to, to emphasize the distinction between the levels and I and I in myself. When I talk about things, I tend to want to really create that distinction, because what happens is you have people and you've seen it all the time, is that they don't see the structural meaning. They see the relationship between the coming together of the elements and the meaning as an arbitrary relationship, as a kind of weird jump that has nothing to do with the actual structure of reality. And so, like, I definitely prefer the word, the word symbol, and that's, that's. I probably just use that. But if someone uses the word metaphor, don't get hung up about it, you know, that's usually not helpful in the discussion. The best thing to do is to just try to see what they're talking about and try to understand whether or not they believe that there are structural reasons. Like that something is an instantiation of itself. That's what symbolism is. And so the branch of a tree is the instantiation of the same pattern as the tree itself. So that's symbolism. It's when the pattern, the thing that symbolizes the pattern is an instantiation of the pattern. It's not just a random literary connection or it's not a disconnected set of things. All right, so Bleeding Mermaid asks, I loved watching your discussion this month with Owen Cyclops. Can you give us your thoughts on astrology and the zodiac? Obviously, astrology is condemned in Christianity and can easily be idolatrous, but I think the zodiac can also have a great insight on principalities as well as some interesting symbolic understanding of space and time. Would appreciate any thoughts you have on the subject. Thanks. Well, despite the fact that astrology was condemned by Christianity, I think that the aspect which is condemned by Christianity is more soothsaying than it is astrology in the sense that it's more the idea of wanting to use phenomena in order to predict the future. That for sure is, is not accepted in Christianity. But the idea that astrology was not been a part of Christianity, that's just not true. You know, in the Middle Ages, every king in the Byzantine Empire, every emperor would have had their zodiac chart done. They would have had their astrological place, you could say, like that trace. They would have known their place in the, the cosmic dance, you could say. And so I don't have a problem with the idea that the pattern of the movement of the stars would be related to the cosmic pattern. I don't see why that would be a problem. I think that, you know, I think that the movement of the heavenly bodies, definitely, especially if we're the ones looking at them, and especially because there are, there are so many. There's an innumerable amount of them. And so when we look at this infinite amount of dots in the sky and then we trace patterns. So it is a form of relevance realization to use. To use a John R. Vacian idea is that what will come out of that cosmic infinite is going to be patterned, and those patterns will be the patterns of reality. There's no way around it. There will be arbitrary. They will end up. They will end up representing, manifesting the patterns of our stories, the cosmic patterns. That's why there's a relationship in most zodiac systems between the mythological stories and the patterns that they pulled out of the heavens. Right. And so I don't particularly have a problem with astrological symbolism. I think my problem with astrological symbolism is that I think that it's misunderstood today. I think that nobody understands that symbolism anymore. And most of the people who say they understand it, they're bunk. Like, they're making it up. They don't get it. The. It's a lost. It's a lost symbolism, in my opinion. I don't. I've never. I have rarely seen anything. I mean, it's not like I've researched it immensely. But all this stuff I've seen related to the. The Zodiac has always been kind of bunk. And like I said, because it's used today mostly as a form of sooth saying, as a form of trying to affect reality or, or interpret real, or interpret the future or try to predict the future. Then in that sense, I think that it's. It's probably not very good. And I. I would say that most people who spend their time. I mean, if you read your horoscope, I really think it's useless. I don't think it's going to help you at all. But, you know, I don't. If you look at ancient cathedrals, they would, they would show the signs of the zodiac in their iconography because it was this idea of this cosmic spheres, these, this cosmic movement which was the pattern reality that Christ had created. But if you think about it, it's not silly. It's not silly to think when you look at the sky, there are so many stars that who decides what the patterns are in those stars? Like, where do those patterns come from? They don't come from the stars. They come from the connection of our consciousness to the stars and the connection of that to the pattern that we live in and that we understand. So it's not. I don't find it. I don't find it problematic at. In principle, but like I said, I don't think it's understood today. I think mostly it's just. It's just bunk. All right. Okay. So here we go. So I'm going to subscribe star. Now. Let me just make sure that I've got all the question. The comments on my website here. I think so. All right. Okay. Let's go. Subscribe, star. All right. So. So Aaron Lechtenberger asks, so forgive me if this question is unanswerable because I am not observing the wider culture very well, but why are political narratives taking up so much headspace inside people? Why aren't people's narratives about small things like having food, good friendships, or doing a good job at work or school? I see an implicit devaluation of all small things, and I'm not sure where it's from. Well, one of the places it's from is people need to feel like they're connected to something bigger than them, you know, and so that's inevitable. We have to feel like we're connected to a bigger pattern. And so that's why politics is always so important, because it is the manner in which we are connected to the people around us. It is the markers politics contains. The markers contains the narratives which bind us together as people in our nation, in our cities or whatever. And so it's very, it is important. It's very important. Now, one of the problems we have, of course, is because of social media and because we are bombarded with the, the political narrative is that that is one of the reasons why it can become obsessive and people can be completely filled, filled with that, that space, you know, and especially because, because of the social crisis. Because there is a social crisis there. Is there? The, the social crisis is getting more intense. The, you know, the fight, the culture war is there, and it's real. So because of that, it's, it's also inevitable that people would be more taken by it because, you know, it feels like the fabric of their society is being threatened, you know. But I do agree that I, I still think that the main solution to the problem is, is to focus on your own sins, to focus on your own passions, to love your neighbor, you know, at least for now, you know. All right, so here we go. XRD thoughts on pacifism. The Christian denomination that my mother belongs to is 100% on the side of pacifism. I think the argument being that if violence comes to you, it means it's meant to happen. But that seems like it's discounting free will. Yeah, I'm not a pacifist. I don't agree with pacifism. I think that, I don't think that Christian, that nations need to, to be, to not engage in conflict if that's necessary. I, I don't necessarily, I don't see the things that Christian said as opposing the capacity of a nation to defend themselves, you know, if they're in danger or the, or the capacity for you to defend your family if you're in danger. I think there's another question here about the turning the other cheek. And so maybe when I get to that other question I can continue on the subject. But, but no, I, I don't, I think that when people are pacifists, they misunderstand the things that Christ is talking about. All right, Dorothy. KK asked, what is the issue with some Protestants and Constantine? To me it seems a little illogical to fight the culture war and to want a Christian society and at the same time declare that Christianity died with Constantine, who opened the door to exactly that. Read some arguments and it seems that part of it is misinformation and misinterpretation. What are your thoughts? Well, yeah, I don't understand it. I mean, I guess I was there for a while so I, I could see it. It's very strange. It's very, very strange because the thing is that Christianity as we know it and even the Christianity, the Protestants believe in the Trinity, the, the dual nature of Christ, you know, the, the canon, the, there's so many things that Christians believed that, you know, that came about during the time of Constantine. And so, you know, Protestants need, Augustine, needs Saint Athanasius, they need these thinkers for their system to, to make sense. And so it's just odd, it's just odd that at the moment when Christianity was, was, was, let's say, manifesting itself fully, then that's the moment where that's their problem. And it mostly has to do with Rome and an objection to Rome. That's mostly what it is. And so it's mostly it, it, it's trying to find. Because Protestants oppose Rome, then they wanted to find the place where they could pinpoint the, the original sin of Christianity and they go all the way back to Constantine. But it is not a thought out position. And I think that most intelligent Protestants, most cultured Protestants who have studied history really can't hold that position. Even if they don't like Constantine, I think that they need to understand that, you know, the Christian, what Constantine brought, let's say the time of Constantine is the time of the Church. It's the Time of, of the things you believe in. It's a time where those things, you know, manifested themselves. So. All right. So Nicola asks, would you consider doing architectural reviews of some Orthodox churches or monasteries that are of particular note? Any comments on the new main cathedral of the Russian armed forces in Moscow? They've made some bold design decisions, I. E. The glass roof and the golden statues of Christ above the altar area. Yeah, it's something. It is something I need. Let me pull it up right now. It is very much. It is very much a, A church of, of glory, right? It. It is a church. A lot of people say it's a church of imperialism, but it's definitely a church which is celebratory. And so is it a statue above the altar or is it a relief? I think it's a relief. It's not a statue. Look, I don't have a problem with this, and I know a lot of people do. I don't have a problem with this. I think, you know, I think that how can you look at Hagia Sophia and think it's beautiful? How can you look at, you know, the Norman cathedrals in Sicily and think they're amazing and beautiful and then at the same time feel embarrassed by. By something like this? So I don't particularly. I'm not particularly bothered with the fact of this cathedral. You know, the glass, the glass roof is little. Is a little weird in my opinion. But that's really more my vision of the church as a. Also as a kind of cave, you know, as this kind of closed nativity area. But yeah, I don't. I don't particularly have a problem with. With that church. All right, let's go back to the questions here. Okay. All right, so actually, I think we're done with subscribestar and we're going into Patreons. Patreon is the most. Always has the most. There's like, there's like 26 questions here, so we might have to rush through some of these. All right, here we go. Okay, so, Paul Dumal. I think that's how you pronounce it. Hi, Jonathan. You mentioned that most of our modern storytelling comes from Tolkien. Could you briefly expand on that idea? Fail to understand what you mean? Well, what I'm talking about is not just storytelling, but it's a certain kind of storytelling. It's the world building storytelling. It's the nerd, nerd storytelling type of storytelling that undergirds things like Marvel Comics or that undergird things like Harry Potter. The kind of story in which a world is constructed, and then the actors of that world interact with each other. That is what I. That is what I'm talking about. And so I think that that really does come from. From Tolkien also. Tolkien crystallized the whole idea of fantasy and magic and all of this that we see everywhere. Right. He. He basically. I mean, it was probably already happening, but he crystallized the notion that the Middle Ages are the mythic. Is the mythic time of our culture. It's. It's this. It's this past that goes into the mists and that has all this kind of dreamy aspect to it, this magical aspect to it, you know, and so he was able to really crystallize that. And I don't think people have really gotten rid of it yet. You know, it's still there. It's still there, you know, underlying our culture. So. So that's what I mean. Hopefully that helps you understand. So Christian Soccer asked, do you think the opening of Christ's side on the cross is meant to connect to the opening of Adam's side? The opening of Adam brought out Eve, and the opening of Christ brought out the bride of Christ. That is the church. Yes, that is explicitly mentioned in the liturgical text. And so during the celebration of the crucifixion of Christ during Holy Week, you hear that being said or being chanted in the liturgy. So it is definitely connected to that. Ryan Pinkham asked, what do you think of King St. Louis IX? I mean, I'm French. What can I say? You know, I like King St. Louis. I mean, he's a complex figure. He's a complex figure, but he's an interesting figure. He's very interesting. He did a lot of amazing stuff. His story, his personal story is very touching because he seems to have been a very devout person and loved his wife. And, and, you know, he. He introduced the presumption of innocence in the system, the legal system. He, he. He ended the Albigensian crusade. He, you know, he did a bunch of stuff that were pretty impressive. He. He was part of the connection between the French and the Mongols. He entertained the relationship between the Mongolian empire and the Christian West. You know, and there are these. All these crazy stories of that time with Kublai Khan where, you know, there were these letters sent, and the Mongolian. The Mongols would send letters saying that they knew where Prester John was. And Prester John, those who don't know, was like this mythical Christian king that lived in the East. And so, yeah, it's really an interesting time. For anybody who's interested, it's a very, very interesting time. And so, yeah, I mean, you know, he's, he, there's. His crusading wasn't particularly successful, if you. At least that's my understanding. But, but I would say that all in all, he's a, he's a pretty admirable character. All right, here we go. So Neil the Great, which I mentioned. And check out his new album, Dirt Poor Robbins. Check out, check it out, Neil. Post it in the chat. I know you're there. So post it for people to, to, to, to go to your, to your website. Into our discussions. So Neil asks, hey, Jonathan, so many conspiracy theories floating around right now. Oh, my goodness, is there one that jumps out as the most interesting to you as far as its symbolic structure? All right, okay. So, man, you guys are going to get me in trouble with YouTube for talking about this stuff. But I think that the most interesting conspiracy that's around right now in terms of the symbolism is definitely the whole, the whole vaccine and micro dot thing, the connection between the vaccine and, and identification. But not just identification, but identification which would be, like, attached to your body that you could scan. I think that that is really very fascinating in terms of. And it opens up certain ideas in terms of understanding what the symbolism of 666 is. And I talk about that in some of my, in my videos on 666. The idea of accounting for the. Accounting for the exception or wanting to account for everything, and the idea of accounting for disease because a vaccine is basically being injected with an aspect of the disease so that you develop antibodies against it. So the idea that you could be identified, related to a disease, that we could account for those who have, have had or not had a disease, and that this type of accounting would be the marker which would either. Which would permit you to function in society or not. So there's this weird connection between accepting, accepting a mark, accepting to be marked, to be identified, and the disease and how this could be used as an, as a door, as a barrier or an opening to whether or not you're able to fully reintegrate society. So I think that that's very interesting. It's interesting to think about. And so, I mean, I've been thinking about maybe doing a, Maybe doing a video on the double symbolism of vaccination. I'm trying to get my brother Matthieu to do it with me, but that's really tough. But yeah, I've been thinking about trying maybe doing that because mostly we've talked about vaccination as being very positive in, in our former. In my former videos, in my writings, you know, I talked about this idea of the. Of. Of death, fighting death. But I. There is a dark side as well. So I think I mentioned this in another Q A too, the dark side of that. So maybe I'll make a video at some point. Maybe I'll put it on bitchute or something so that I don't get. So I don't get banned from YouTube. All right, okay, let's stay posted on that. So, Mark Kalashnikov. I'm sure that if that's your real name. Mark. Seriously, dude, that's amazing. So Mark Kalashnikov asks. Hi, Jonathan. I was wondering if you had any comments on Reflections, the blessing of Jacob in Genesis 49, especially from verse 10, starting with Judah and so on. I've never heard anyone speak on this subject. There seems to be some interesting symbolic nuggets that I. That are worded in rather cryptic language. Yeah, there's definitely interesting stuff there. I don't think I could do that right here off the top of my head. I would really need to reread the text in advance and talk about it. So. Sorry. Maybe that's something I can do at some point in the video. So Ronnell Canada asked. Good evening, Jonathan. This is my first question, so I'm pretty excited. Thanks for all you do. Well, you're welcome. Anyway, how can one correctly, in accordance to God's will, pursue the Alexander the Great archetype, not necessarily in the ruler sense, but more in the skill mastery sense. If you have a more apt representative for the sort of idea I'm trying to espouse in my question, could you use that? I asked this because as a young man, I use my free time to pick up various skills like programming, drawing, musical instruments, etc. And I obviously want to be successful, but I want these skills and the positions they may arise from knowing them in order to be a vessel for the Lord. I guess another way to ask the question then would be how do we. How can we strive for greatness without ego to aim at being fruitful and useful, but in a way that's honorable to God? I mean, I think that. I think that you. You've got it. I mean, I think you've got it in your. In your question. You already have the answer, which is that if you just develop a skill like programming, it's like a tool. It's like, you know, doesn't give you the purpose. And so by directing the purpose of what you're doing, like drawing or programming or music. Music. Then that is how you can make them into vessels for God. Right. And so the idea of the neutral scientist is. Or the neutral skilled person is just not true. Right. So that is how you can. That is how you can do it all. What you need to do is to always ask yourself, what is my skill directed towards? Is that something which honors God, or is it something which honors just my own ego or the passions or the passions of others? I think that's the question. All right, so. Hello, Jonathan. I've always had a conflicted view of when Christ says we should turn the other cheek. Yeah, this is the one I saw before. If someone comes after me personally, I can take it. But if someone comes after my family or the people I love, I don't see how I can stand and not fight back. Feel like I'm missing something in that phrase, but I don't know what. P.S. i've started participating in an Orthodox church near me. Thank you for all your work. So this really comes back to the last whole problem of pacifism. Now, one of the things that I've tried to tell you guys and really tried to emphasize is that there are very few things that Christ says. I would say Christ's message is not ethics. Christ's message is not a form of morality. It's just not. And when we try to interpret what Christ is saying as strictly immoral code of some kind, then we. We run awry because that's just not what he's talking about. And so I'm not saying that there isn't a moral. I'm not saying that there isn't a moral aspect which will flow from what Christ is saying, but that is definitely not the purpose. And so when Christ says we need to turn the other cheek, it's not about pacifism. It is about. It is about not being a slave to the outside. It's about not that your action, not your actions, not be dictated by what is outside you. So it's related to not giving in to passion. Right. That's the idea of what a passion is. The word passion means that you are subjugated to that which is outside. You're not in control of yourself. And so when Christ says to turn the other cheek, that's what he's talking about. He's talking about that if someone hits you and you react and you hit them back, then you are making that person, you are giving that person power over your will. You are making them in charge of what you're going to do. Whereas if you're able to, to turn the other cheek. And you do it by not being a coward. And that's really important because, you know, I always kind of to say, it's like if I turn the other cheek because I'm scared, then that's not what Christ is talking about. Right? It has nothing to do with what Christ is talking about. Christ not saying, be a coward and turn the other cheek. He's saying, don't let others dictate your will. Don't let others decide who, what your action is going to be. And so, and so, and so I think that it does not prevent Christians from, even Christians from defending themselves in certain, certain situations. You know, defending their family for sure, defending their nation for sure. Defending their, their land, defending all these things is completely acceptable. There's nothing, there's nothing wrong with that. As a Christian, to, to defend your, the people around you. Right. And it's not referring to that at all. I don't, I really don't see how. And, and the reason, one of the reasons why it's, it's not that is that it was never interpreted that way. The, the, the Christians had armies, Christians had nations, Christians had, had soldiers. And, you know, and when St. Paul talks to the Roman soldiers, he tells them, he doesn't tell them, stop being a soldier. You have to eat. Pacifist. No, he says, be just in the way you act. Right. Don't abuse your power. Right. And so that's what I would say about that. Hopefully that helps. All right, so JL asks, am I right in thinking that the only people coining new words are scientists and Internet youth? Is the blind acceptance of the alphanumeric strain COVID 19 from the charming coronavirus? An indication of the utter value we put on science? Is the adoption of specialist jargon by the masses a bad sign, or am I reading too much into it? Love your work. You know, it's weird because I have thought about that. I really have thought about why everybody was. At first people were saying coronavirus, and then they started saying COVID 19 a lot. And then COVID 19 kind of took over and I really did think it was. It had something to do with what you're saying. It had something to do with there was too much symbolism in the coronavirus. There's just too much symbolism in that word. And so it was, I think that intuitively it was kind of bothersome. And because we don't want it to be full of meaning, you know, we want it to be this, like, neutral thing that's happening And I think that, that giving it a name like that, like a science fiction name was probably a way. I don't. Not saying people did it on purpose, but it was a way to kind of de. Escalate the meaning, which was, which was bound into what was going on. All right, so Connor Mitchell asked again about the, the new military cathedral. So, yeah, I think I answered that. I think I answered that. I think it's a bit over the top, but I, I'm fine with that because it is what it is, right? It's. It's not a humble chapel in a village. It's a, It's a. To chapel to remember the, the, the sacrifices of the, of the soldiers who died for their country and who were Christian. And so, yeah, I don't. It doesn't bother me. All right, so AJ Del Toro asks. Hey, Jonathan, I hope you're doing well. My question is regarding music in the Orthodox Church. Is there a reason that no instruments are allowed? I often watch praise and worship concerts and so it's cool to see people connecting with God in that way. Thank you. I mean, it really does have to do with the notion that this is the way I understand it. Okay. I mean, people have different ways of interpreting it, but one of the ways it helps me understand it is to understand that we need to see that the Church really is a moving into communion of people. It is the coming together of the body of Christ. And so you have to kind of understand the coming. The, the one voice of the church. Right? The. Because there's discussion even there's really. It's really interesting because you'll see that people intuitively kind of understand that because there's discussion about, about polyphony in Orthodox churches, for example, some people think that there should be polyphony. There shouldn't be several voices. There should just be one voice. Right? But that you can understand then what is happening. This. The notion is that it's us uniting our Logos, our Logos together with the Logos of others together in one voice and raising that up and participating and entering into the presence of God. And so that's the way that I understand it. Mark Peters, ask Jonathan. Please clarify a comment you made on the lack of efficacy when elevating the host in the consecration. I can't find the exact quote, but you were talking about Galileo in the same sentence. No, I was not at all. I was not at all making a point on the lack of efficacy when elevating the holes in the consecration. I was not at all doing that. I was doing the very opposite. What I was doing is I was saying that if you try to adhere to a strictly materialist point of view, if you try to make science your first frame of meaning, then raising the host up is meaning. It's stupid. It's a stupid thing, because where are you, what are you doing when you lift up the host? If you're purely a materialist? Right. It's because you have Christians like that. You have Christians that are, that are. That really want to frame the world in terms of materialism. Right? And so it's like if you. If you're a materialist and you want the Bible to be all about science and be all about this, then rather, raising the host up is like when you're. You're putting it up so that it can catch the WI FI signals. I said something like that. You're not doing that, of course, because. Because the, The. The. The reality of hierarchy manifests itself really ontologically by things being higher up. It's. It's a real. It's a real transformation. Like go up a mountain. It's a real transformation. It's not. It's not. It's not. It's not just a metaphor. It's not. Not, you know, it's real. So that's what I was referring to, hopefully, that understands. It was the very opposite of trying to suggest that there was a lack of efficacy. So EB asks, what is the symbolism of factories? If man is made to spend time tending the garden and turning raw materials into more glorious things, what happens when he turns part of the creation into something that does this for him? Yes, I mean, factories are definitely part of the alienation that comes in the modern world. You know, this, this reduction to the task and the idea of making people into machines. That's what factories are. Factories are. And you can see the reason. You can see that's what it is. Because if they could get rid of all the people, they would. Right. And because they can't, then they turn people into machines. So it's. It really is a machine world to create quantity. And the value of the artisan, the value of human making is lost and the human worker and the factory worker becomes alienated. Yeah. So Arie Fisher asks. Hello, Jonathan, in your last video, you were asked about the importance of a good translation when reading the Bible, and you replied by giving an example of line in Genesis that was supposedly more correct. The symbolic structures. If it said, and God created the sea serpents. Yeah, or something like that. I went looking for looking and couldn't Find, find a translation that said that the closest said reptiles. Basically, I'm just wondering if you could recommend a specific translation of the Bible or the one that you use. Thanks for everything you do. You have taught me much. I mean, to be honest. Like, I just use the King James Version and then I, if I have a more specific question, then I will go online and look at an interlinear Bible and, and I will look at, you know, you can find the, you can find Strong's Concordance where you have the. I forget what the name of the website is, but there's a website where you can, you can look at an interlinear Bible and you have the English and the Hebrew and then you have, you can click on the words and the words will give you the definitions of those words and stuff. So that's really helpful. I also asked my brother, just ask my brother because he's quite fluent in Hebrew, so that helps. But that's if that's what the word is. Tannin, it means big sea serpents or it means serpent really, but it's implied that it's a sea serpent. So Jay mute asks, is that Jeffrey? Is it Jeffrey Mutter. Yeah. Jay, I'm happy to see you back, by the way. Jeffrey, I was really happy to see you. You pop up again. So I'm looking forward to talking to you soon. All right. So Jeffrey Muter says, when the world is upside down, where is the king? Story examples might be helpful. When the world is upside down, the king is hiding. So good examples. Lord of the Rings, hidden king, King David in scripture. That's a really good, that's a really good example. When the king, when the king is hiding amongst the people. And it's like you can imagine it really in the upside down world. It's people struggle to see the king, right? They can't see the king because they can't see hierarchy. They can't even, they can't see. They can't see what is more valuable. And so because of that, the king is hiding like the pearl in the field. All right. Christopher Coretta asks. Hi, Jonathan. A lot of hate is being made about the parallels between Woke and religion. And fair enough, there are many. However, I think the opposite distinction needs to be made. The new atheist types are already putting religion in woke into the same box of things dumb people believe because they're irrational. In what ways is woke not a proper religion? Well, it's not a proper religion because it's not aimed at the highest thing. It's not aimed at things that are high enough. And so because of that, it becomes what Jordan Peterson talks about in the sense of a. Of a caricature of religion. And it becomes a kind of fake religion, you know, pseudo religion. And you see the pseudo religions are all over the place. They're everywhere. They're in. They're in manga culture and they're in video game culture. People become obsessed with certain things. Now, in the. In the sense of the woke aspect, it's scary because it's. Now it's a political movement. So it's similar to communism, really, especially the current wave is very communist, you know. And so because of that, it is really a parody of Christianity, a parody of religion. So now the thing that the New atheists are saying, they're missing the point again, just missing the point because they don't understand that it's going to come back again. And it's going to come back again and again and again because it's part of us. So you can pretend, right? You can pretend and say, oh, look at those stupid people that are doing that. Right? But it's as if you thought sleeping was stupid. And then when people fall asleep, you go, oh, look at those stupid people falling asleep. It's like, dude, people fall asleep. You just can't avoid it. And so that's it. So the New atheists are. Are deluding themselves and they're riding on the coattails of a civilization which is falling apart. And they think that this is the normal course of things. It's not. If there are no unifying principles, society falls apart. It's very simple. There's nothing uniting things together, they fall apart. It's not. Not. It's not. Not rocket science. So. So they don't have anything to offer us. They have nothing. They have nothing to offer us which will hold us together. And so they can decry all they want when they see the religious impulse go go nuclear and go crazy like we're seeing right now. But they have nothing to offer. So, yeah, all right, I'd be curious to see if they really are. Is Steven Pinker saying anything about this, these protests? Is he? Is he? I'm not. I don't think he is. I haven't listened to Sam Harris. I'd be curious to see what he says. Maybe Sam Harris would, but Steven Pinker, he's got major blind spots. All right. Okay, so Herman Smith says, of course Santa Claus exists, but did he always exist? Fall memory and record of Santa Claus and the associated traditions vanished from the earth with Santa Claus. Continue to Exist. Ask that in another way. Now use that again for anything, Everything that exists. Ask that same question again. Does a chair exist? If all memory and record of chairs and the associated traditions vanish from the earth, would chairs continue to exist? So I guess I would ask that back at you and wonder. Okay, I'm going to answer the question. I don't want to be a jerk. Human beings have a particular function in creation. Human beings have a particular function of mediating between heaven and earth. And so a lot of things exist through humans. And. And so when you say something, when you say, would they. Would they. Would they cease existing if all humanity vanished, then the answer is right. The answer is yes, they would, because humans, Humans participate in their existence because we are the mediators of heaven and earth. As much as. I guess that's the best I can. I can say. And so Santa Claus needs a. Needs a body for him to exist. And so if there was no connection between the principle and the. And the manifestation, then Santa Claus would also would cease to exist properly because he would have no body. All right. Okay. So Chase and Lindsay. Hey, Jonathan. Is it possible for a fallen angel or principal to be saved or redeemed? That's tough, man. I have heard St. Augustine touches on the subject, and I've been reading through his confessions on and off. If it is possible, are there any examples of either canonical or apocryphal stories where a fallen angel is redeemed and forgiven? If not, why is it that a fallen angel is forever lost? Thank you for any help and insight into these questions. Man, that is some tough. That's a tough question. I would say the official answer is no. The official answer is no, because. So the way that it said in terms of stories, like the way that it's represented in terms of stories, is the idea that the angels fell before creation, something like that, or they fell before the creation of the world. They fell once and for all. So what it, what it refers to is that it's a. It's a. They. They're. They place themselves direct. The principalities have places in an ontological hierarchy, some facing up and some facing down, you would say. And so the aspect that's facing down is facing down. It's. It's just facing down. So that's the, that's the official answer, you know, and there's a lot of people that have tried to deal with it. CS Lewis has. Try to deal with this question. And I would say there's no ultimate answer, you know, because then you start talking about apocatastasis which. It's tricky stuff to talk about, and it's things that I don't really like to. To talk about the idea of, of a universal restoration, because it's. It's not useful. So, sorry, I'm kind of not answering your question. All right, so Norm Grandet asks. I'm reading the Language of Creation and have a question about time and space. So space is described as the power that builds a consistent and stable reality, while time is described as the mystery that subverts and overturns existing reality with inconsistency and confusion. My question is about the seemingly negative aspect of time from the standpoint of creation. Are we meant to understand this in terms of God leaving a fringe on creation, a place to deal with ambiguity or transformation, renewal as its counterpoint to rigor and possible tyranny? I place the whole mystery of what has yet to be, if it is ever to be revealed to man. Yes, it's the Sabbath. That's what the Sabbath does. The Sabbath is all about that mystery. Right. And the Sabbath is the proper integration of that mystery. That's the best way I can answer that. Okay, so Matthew Marinelli asks, St. Ambrose, in his homilies on the six days of creation, writes, the earth is not suspended in the middle of the universe like a balance hung in equilibrium, but the majesty of God holds it together by the law of his own. Continues. When we read I have established the pillars thereof, we cannot believe that the world has supported. Was supported by actual columns, but rather by that power that props up the substance of the earth and sustains it. Can you extrapolate on this? I think many people, modern people, would be completely confused by what St. Ambrose is saying. But these sentences seem to be the key to understanding symbolic thinking so natural for the Church Fathers. I mean, I think it's a good way for St. Ambrose to deal with the issue, let's say, of the change in cosmology which was happening at the time, in terms of moving already towards more mechanistic understanding. So what he's saying is when we use the. And I think that it's a. It's a good way to, to make, to make the transition. Like, I do it all the time. I do what St. Ambrose is doing. I do it all the time. It's like when, when we talk about pillars, it is a structural description of how reality holds together. And so if you dig underground physically, you won't find pillars underneath holding things up. Right. But if you want to understand how earth and the substance of Things is holding, is held together, then pillars, you know, especially a right and a left pillar is a good way to understand. It's a good way to explain how things are held together. They need. They need a. They need two pillars. They need a right hand and a left hand pillar. They need a pillar which, which manifests the inner movement and a pillar that manifests the outer movement, something like that. But they need a. They need a structure which, which makes identity possible. Okay, so I think that you're right. I think that. That St. Ambrose is basically saying something similar to the things that I'm saying. Right. He's basically pointing to how the analogies that we use, especially when we talk about the very nature of reality obviously have to. They're using images of the world and those images are real instantiations of the pattern. But we're using that image and analogy to talk about something which is invisible and something which is beyond manifestation. And so when we talk about the earth in the sense of the primordial earth described in scripture, the know, the one that is. That is chaos and void, obviously we're not talking about manifestation in the way we understand it. We're talking about the very substance of reality. So, yes, I agree. Thanks for that. But that's a great quote. I'm going to keep that. Try to find it if you have the citation, like if you have the. I'd love to get. I'd love to have that. So Nico asks. Hi, Jonathan, thanks for all your work. Probably I wouldn't be a Christian without it. Glory to God for that. My question is, what have we learned about symbolism after the Middle Ages? Is there anything that has been added or dismissed or has there been a change of focus? I've been thinking about this a lot, actually. I've been thinking about this and wondering what the advantage of today is over, let's say the Middle Ages. I think that a way to understand it, it's maybe a difference. It can be a disadvantage and an advantage is because we've actually moved away from. It's as if in the Middle Ages people were wearing glasses and we're looking at the world through glasses. And so everything was just this intuitive structure. It was just like they didn't have to explain it. And so then as we moved away from the Middle Ages, people took off the glasses and put on another pair of glasses, looked back and started saying how stupid the world was before because they weren't wearing the same glasses. So everything looks strange and odd. And so I think that one of the advantages we have now. Is that because now we've tried to take off the modern glasses and we're trying to put on. Back on the symbolic glasses, but we haven't lost. We haven't lost the memory of the other worldview. So, so it means that, it means that we end up explaining. I mean, that's, I've said this before too, is the reason why I explained symbolism is because we've gone very far away from it. And so now we're away, we're far. So now we have to explain it so that people will want to move back towards it. So that is an advantage, but it's also a disadvantage because there remains a form of alienation when I'm explaining symbolism rather than doing it. And that's why if you, if you look at my life, you look at my, you look at what I'm doing, it's mostly trying to bridge those two things together. You know, there's a reason why I spend half of my time carving icons. You know, there's a reason why I do that. It's because I, when I'm carving icons, I'm trying to be in the world and I'm trying to not explain it, but actually be making things that are participating in that pattern world. And it's different from when I'm stepping out and then analyzing things. So. So that's been my way to deal with it, at least. All right, so JD Asks, is postmodernism a flood? It's very similar to a flood, for sure. Yeah, very much so, because it creates, it is a. It creates absence of hierarchy or it tries to de. Center. Right. It tries to, to remove the pillar so that everything falls down. So, yes, I think that it's a good image of, of the world, postmodernism as a flood. So how. So Jerry K. Asks, how does an Orthodox Christian convert shame and anxiety into closeness to God? I mean, my answer is going to be very boring and not boring. It's just, I'm not going to tell you anything that other people haven't said. It's, it's terms of shame. It's, it's confession. That's the best way. Because if you, if you confess, then you, you're, you are actually submitting yourself. Also you're giving up to God, but you're also accepting to humiliate yourself. When you go to confession, you humiliate yourself to your spiritual father, and then that spiritual father, if he's a good spiritual father, will then give you a key to move on and to come back. Into communion with God. So that is the way to convert shame and, and anxiety. Then I would say it's prayer for sure. You know, Jesus prayer, it's the best in terms of anxiety because it's, It's a stable. One of the things it does, it stabilizes you. It stabilizes your psyche, it stabilizes your thoughts. And I say this like I don't. I'm not able to do it all the time. I fall into anxiety too. But I know that in the moment that I'm able to. To focus on the Jesus prayer, then, you know, then usually I find some kind of peace. All right, so Dionysus asks. Hey, hello, Jonathan. In the story, the difference between the figurative and the actual is clear. I'm not sure about that, but let's keep going. But in religion, the line between the two is blurred. How can we, as a culture, we discover the symbolic worldview will at the same time make sure that we don't fall back into superstition. Assuming that you don't deny the reality of superstitious thoughts, superstitious thought, could you articulate and clarify its distinction from healthy religious practice? All right, so I'm not sure what you mean by superstition, but let me maybe try to guess. I would say that superstitious. Superstitious symbolism, usually what it has in it is a kind of magical desire to control events. And so it's using symbol, symbolic patterns, using symbolic actions, using symbolism to control phenomena around you. So maybe, maybe that would be superstitious. There's a lot of things that people have considered superstitious which are not at all superstitious. You know, I did a whole video on the evil eye. I don't, I don't. A lot of people would say that's superstitious, but I don't think it's superstitious. So maybe it's because I'm not totally sure. I think that. I think that there is causality of meaning. And a lot of times the reason why we say superstitious because often it's like uneducated people end up having these causalities of meaning. So they. They identify meaning with causality in the world. And I think that sometimes the problem is that they understand it in a kind of naive way, almost like a scientific way. Like, if I do this, then that, or if I do this, it protects me from that, Whereas the causality of meaning is more complex. It's not the same type of causality. So maybe that's one of the things that causes superstition, but it's interesting. It's really actually very. Can be very fascinating to study superstition because superstitions are rarely. Are rarely arbitrary. They usually. They usually actually manifest like an interesting pattern they use. Because sometimes they're very old and they're kind of. They've been whittled down, you know, they've been. And sometimes the thing I think about superstitions, which now I'm coming a little. Maybe I'm coming a little close to. To what Brett Weinstein talks about when he talked about metaphorical truth. But I think that maybe sometimes superstitions, they are there to create certain patterns of being which have other causalities that are not necessarily. Not necessarily limited to the precise thing. Right. So I've talked about this in terms of purity laws, where the idea of not mixing wool and linen, for example, in a cloth, you'd say, well, how stupid? Like, what does it matter? Like, what does it matter that you mix wool and linen in a. In a piece of cloth? That's superstitious. Right. But. But my. My contention is that if you have several rules like that which cause you to intuitively understand the. The need to preserve distinction between two types of reality, then it's going to create disciplines in you that will be related to that and will help you avoid certain pitfalls of mixing categories in a way that could be destructive. You know, I always say that our world today could be maybe saved if a few people had remembered not to mix woolen linen. Because it seems like the problem we have right now is that. So it's just an example to say that I think that if we looked at some. A specific superstition, sometimes we might find that they're not as. They're not as stupid as what we think. But sometimes it's. It's a. It's very indirect. I haven't studied it in detail, but I would be careful not to be too. Too dismissive. All right, so John Case Tompkins asked Jonathan. My sister and I are rereading through the Grimm's Brother together, and we just read the Princess and the Frog. An interesting change between editions. In the first edition, the princess turns the frog into prince by picking him up and throwing him against the wall. Yeah. In later editions, that changes to a kiss. We're stumped on the significance of throwing a frog against the wall. The story claims that the princess wants to kill the frog. Yes, that's right. That's what she wants to do. But as soon as he transforms, she's happy to invite him to her bed. Any thoughts yeah, she's killing him. That's what she's doing. You know, she. She's a frog, so she doesn't want to. She doesn't want a frog. She wants a man. So the frog has to die. You know, that's what transformation is. Transformation is. Is. Death is always a kind of death and rebirth. And so the fact. I mean, obviously I can understand why it would be changed to a kiss as well. It's just. It's kind of. It's kind of horrible to imagine, you know, the scene, but. But it actually probably makes more sense that she. That she kills him because. Because the. The. The death is what brings about the transformation, you know, I mean, think about it this way. Look, guys, I'm sorry. This is. This is gonna be unpleasant, but how many times does a man change himself for the better because he was shamed by a woman? It's a lot. It's quite a bit. I think one of the. One of the. One of the roles or the aspects of the relationship between the male and female is that the women are there to kill the beasts, the beastly aspect of men. And they do it sometimes in a very unpleasant manner. But nonetheless. Nonetheless, it can work. So Robert Terry says, what are the essential books that you want your children to read to understand the world when they are teenagers? I would say, for sure. I mean. I mean, the Bible, I would really want my kids. It's hard because I feel like you really have to get at them earlier because once they're teenagers, it's almost impossible to dictate what they would read. But for sure, I would say that as children, you need to just. You just drown them in. In fairy tales and drown them in, and you can, you know, kids, kids. Kids have a pretty good capacity to deal with. With complex stories. You know, I read them a lot of Russian fairy tales, some wonderful stuff. Some Czech fairy tales are very complex. Some of the Czech fairy tales are very, very complex, powerful in their cosmic structures. They have. They have like three worlds and, you know, these. This transformation from brass into gold and. Or from lead into gold. And there's. There's really, really powerful patterns in the. In some of the fairy tales. I would say your kids, it would be good. They know the Odyssey even if they knew some Greek. Some Greek myth that, you know. And then as teenagers, it's hard because the. The world is so. Man, it's messed up. Like, I think you're teenagers to read Lord of the Rings, and I say that, and I'm really struggling to get my 15 year old son who I love to finish Lord of the Rings. He read the first two books and he's like, he finds it so boring. And I'm like, come on, man, read Lord of the Rings. So I mean, I think things like that Lord of the Rings there, in terms of stories, that would be, that would be something that I think your, your, your kid should definitely read, you know, and I think when they're old enough, then things like Arthurian, Arthurian legend and history, you know, understanding the stories of Alexander, I really don't see it so much as books as stories. I think kids need to know certain stories and so I tend to tell stories a lot to my kids. One of the things I would say that's important for people to understand also is that I've noticed that I think some people are sending me questions by email. Like sending me. Instead of putting them as the comments in the. You need to put, you need to put the questions as comments on the post that I put up on the different platforms. If you send me emails and stuff, they just get lost. I can't, I can't keep track of them. So I'm sorry if I missed some questions that way. All right, so I'm just gonna check into the chat. It's already 10:30. You guys are really like pulling me to the limits. It's fine, totally fine. I'm getting better at it. I think I'm getting better at kind of not spending too much time on each question. Also not getting too excited. All right, let's see. All right, so there are a lot of questions I might not be able to get to get through. So. All right, let's try, let's go. Anyways. All right, so Nate H. Asked, what is the symbolism of the coronavirus beard? Ah, man, I was just, I just always wanted to have a very long beard. And so I don't know why I had the guts to kind of do it in between between like January and, and March and. But my wife hated the beard and so I do. I was telling her, like, this is just, just the time. Just let me do it once, you know, and so finally just cut it off, you know, it was fun while it lasted. I enjoyed it. All right, so Andrew Johnson asked, what is the meaning of the 12 labors of Hercules? What are they besides mythical strongman feats? I mean, they're mostly about taming things. Most of Hercules labor, I don't forget, remember all of them. But most of them are about killing monsters, you know, cleaning stables, doing things that are about bringing order to chaos, right? So just manifesting the rule on the world. And so I would say that's what they are, really. So Jess Perience asked, why does God end his speech to Job with Leviathan? And how does that satisfy Job? I think it's something to do with new or renewed creation. Well, it has something to do with the fact that God goes all the way to the bottom, right? He's like. He talks about different aspects of creation and then he goes to the end. Then at the end of creation is the Leviathan. You can imagine the Leviathan, like, lying at the bottom of the ocean, right? Or at the edge of the world. Something like that. Kind of like the Aoboros. And so I think that that's why he goes all the way to the end. And it's like, it's basically a cosmic monster. And. And the, you know, it's like, do you understand this? Do you understand that there are things about this world that are bigger than you could ever fathom? Like, how can you understand the beast that manifests chaos? Right? How can you understand that? So I think that that's why it ends the speech, and that's why Job is kind of a bit. He's. It's like it's. He realizes that he's so small and that. That his gripe against God is. Loses itself in. In like the cosmic story, something like that. Hey, Jonathan, what is the Christian symbolic view on veganism? I think that veganism is like a weird, misunderstood version of. Of spiritual practice because the monks. Monks don't eat meat. At least in the Orthodox Church, monks eat in theory, that I'm sure some monks do eat meat. But in theory, monks are. Are supposed to eat vegetables. And there is a sense in which eating vegetables is the purest thing because it. It's what Adam did in the garden. But it's not just what Adam did in the garden, but there's also, in the story, for example, in the desert in the Exodus, you have this sense that God gives the Israelites water, then he gives them manna, and then they complain and complain and complain, and they. He finally gives them meat. And. And when he gives them meat, it's seen like a kind of. It's almost like God giving into their passions for a little bit, right? And you can see that it's probably similar in the story of Noah because humans don't eat meat until. They're not supposed to eat meat until the flood. And then after the flood, God allows the humans to eat meat. So it's like, so it's, so the idea of not eating vegetable, of not eating meat and eating only vegetables is kind of this movement moving in, moving up the mountain, right? Going to something more pure. But it's not a moral question, not in Christianity, in, in the sense of like not killing animals or whatever. And it's also, it's also not expected of lay people. So do you, so Sasha Trubiscoy asked, do you think the current woke religious phenomenon is related to. Rooted in the sharp decline of mainline Protestantism in the U.S. yes, for sure. It's the same people. It's the, it's the, it's the, the continuation of mainline Protestantism, you know, and you can see because it's fed still by a lot of, a lot of those churches like the Methodists and the, there's a, there's, you know, the Episcopalians, all of that there. It's, I mean, they, they're so focused on social justice. They have reduced Christianity to social justice. And so it's like, it's just a continuation of that. Probably going to do a video next week or maybe after that. I've been making a lot of videos. I probably need to carve a little bit. I'll probably make another video on the difference between Christ and Barabbas, and I might talk about that and talk also about Judas and how the sin of Judas in Scripture, because there's very few interaction with Judas is that he actually wants to give the money of the perfume that the woman uses to wash Christ's feet. She's using this expensive perfume to worship Christ and Judas says, you should give it to the poor. And so there's something about that, about this kind of utilitarian use of Christianity. All right. So m. So M asks, hi, Jonathan, can you speak about the Kabbalah and how it relates to Orthodox, also Pentecostal Christianity, how it relates to Orthodoxy. So I've talked about this before. Like, I've talked about how the word Kabbalah is very complicated because it's just such a big word. It just means mystical Judaism, I guess. And there are things in Kabbalah that are, that are definitely not in line with what Christianity says. And there are things in Kabbalah that are actually that are coming, that come closer. Like there are some descriptions that are, that are interesting. There are some traditions that can be interesting sometimes to help you see things from a different perspective, you know, But I, it's definitely not related. It's not related. And, and I think that you'll find probably in modern Saints, you'll find warnings to not be seduced by, by, by this thing. But nonetheless, like I said, I don't, I don't think, I think that there are some interesting aspects like the Sephirotic tree. I think that in the Sephirotic tree there's a, there's a, there's like two pillars and the central pillar and there's the notion of, of like two sides and, and synthesis at different levels of the ontological, of the ontological reality. And so there are really interesting things in there. But I would say just be careful because it's, it's also not, it's not the Christian traditions. If you're a Christian, you need to make sure that your, whatever interest you, you find, whether it's in mythology or whether it's in, you know, fairy tales even, or other mystical traditions or whatever, it always has to be, it always has to be subjugated to what you are. It has to be subjugated to the doctrine of the Church has been subjugated to your spiritual discipline, to your spiritual father. So you have to be careful because things which, if you're a Christian, the things which are outside can, can help you sometimes, but they have to be marginal, they have to remain marginal. They can't, they can't eat your central tenants. Hopefully that makes sense. So Vesuvius asked Dr. Marshall extoriorated Bishop Baron on social media for refusing to protect the Catholic statues in Cali. The bishop said Vatican II made public space the lady's job. Huh. Doctor cited St. Leo. Baron blocked him. Thoughts? Yeah, I'm not gonna get, I'm not going to get into, to political stuff. I mean, I'm not going to get into the political stuff of the church at. That's not happening. You know, my, my interactions with Bishop Baron and his organization have been positive. And you know, I'm sure we disagree on things, but I feel like a lot of the things that he's doing are helpful. So I don't know about this particular thing I write. I actually wrote an article for Word on Fire which is actually, if you, if, if anybody here is subscribed to Word on Fire, you will have the surprise of discovering in your mailbox a article from me which talks about movie interpretation and narrative and also my, let's say, the differences I have with Jordan Peterson, I might, I probably might read it actually. I might read it online next week or in two weeks or something. I might even have Bishop Baron on at some point. We'll see if he has time and accepts how do you interpret understand dinosaurs from a Christian worldview? Monsters, dragons? So someone wrote in another language. So sorry, I don't understand. So dreaming man asks, why is the idea that penis run the world so prevalent? Man Drew, why are you doing this to me? Is there literal? I know that's bad word truth to it. Or is it more a representation of a broken world? Look, this, I talk about symbolism. I would say if you want to, if you want to understand that stuff, read, go, go to the WikiLeaks, read the Clinton emails, you know, and you know, follow that trail if that interests you. I would say, but don't get too much caught up in that stuff because it's not really useful for your soul. But the world is a dark place and there are dark things. And so I think that now is not. If the world is in a chaotic. Is in chaos and the world is clown and the world is upside down and the world is perverted and the world is completely messed up, then it means that the elites are there first. That's how it works the world. I, you can never, you know, the, the king becomes immoral before, before his kingdom falls, you know, and when the kingdom is fall has fallen, it means that the sin of the king is usually manifesting. So yeah, okay, so 80s nostalgia guy asked, what is the symbolism of fasting? Is it about purification? Is it about sacrificing our own flesh? Why does God choose to speak to those who fast? Yeah, I think it is about purification. It's about, it's about leaving the things that come from the outside and focusing on that which is inside, you know, and so you remove the garments of skin, you remove the outer. Because when you, so like when you eat or when you engage in sex or when you, when you do things like that, then you are, you are kind of giving yourself out, right? You, you were moving out. So you, you're focusing your attention on things which are coming from the outside. Pleasures, all of that. And so fasting is a way to kind of shut off those doors and then try to enter into the, into the middle, into the center. So, so it is about sacrificing our own flesh. But you don't have to, you don't see it in a moderate, in like a moral way. You don't have to see it in like you're bad, you have to sacrifice your flesh. You know, it's like, it's not that it's really about, about moving away from the outside and kind of, let's say casting off the outer layers and moving in towards the center. So. All right. All right, guys. So. So from now on, I will only answer questions about symbolism, not going to answer questions about world conspiracies. All right, everybody. So, man, it is 10 to 11. And so I really appreciate. I really, I really enjoy these and I appreciate everybody. Thanks to all the people who are supporting me. Thanks to all the people who sent super chats. You know, I would say try not to go crazy, guys, because it's a crazy time right now. And try to, you know, try not to get too caught up in the. In the madness, you know, And I'm not saying ignore it. I'm not saying ignore the craziness. I'm saying try not to get too caught up. And try to remember that Facebook and Twitter are not the world. And you know, that we still have a responsibility to take care of our families, to love our neighbors, and to. To remember God. And so. So that's as much a call to you as it is to me, because I'm. I sometimes feel a bit stretched, you know, with everything that's happening. And I feel kind of like being. We're being pulled apart. And so hopefully you have family and people around you that you can hold on to. And hopefully, I mean, I. I know that now. I've just recently received an email from my priest saying that they're starting to have church services again. And I think that'll be helpful for a lot of people. And as soon as. As. As your churches are having services, I would say go to church, you know, and start communing with real people. And that will be. That'll be good. So thanks everybody, and I will see you guys. See you guys again next month. Bye. Bye."}
{"episode_id":"SW - #109 - 2020-07-23 - June Q&A","start":6463.69,"end":6528.66,"speaker":"Justin Ward","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward, and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially. Going to www.thesymbolicworld.com support or else on Patreon Pajo videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
