{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":0.32,"end":63.34,"speaker":"Don Hoffman","text":"What I see here in our theory is our theory of combination will get us to ever bigger and bigger infinities, but there's no limit. And so I can't start with a theory of the one big consciousness, because I can never get there. What I can do is have a theory of conscious agents that sort of is forever approaching the highest level. But at every point my theory will say, you're not there because, oh, you're now at level 50 of cancer's hierarchy. Now you're at level 100, but there's an infinite number of levels. So what's interesting about this scientific theory is that there will be no room for, for hubris or dogma because the theory itself will be telling you there's infinitely more steps to go and you're only at step one, 1 billion, but there's an infinite number. So this is really a very, very. When you do this, you get the fractal notion that you were talking about, but you get the mathematics coming back and saying exactly how the fractal works and also telling you be very, very humble because your mathematical theory will never get to the final description. There's no scientific theory of everything, even a theory of consciousness."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":63.57,"end":114.03,"speaker":"Jonathan Pageau","text":"Yeah, and it seems, that seems to really fit with the idea that most mystical systems are apophatic. That is, if you, if you read many of the more famous mystics or if you look at different non dual systems, they tend to always have this, let's say, infinite regress. There is no positive statement of the infinite. It's always a constant denial of that which was, or a constant shedding of that which was below. But there is no reaching the point. Even St. Gregory of Nyssa talks about, let's say, the ascent into God as being infinite. That infinite in the sense that there is no end to it. It's not a, it's not a stasis. You don't become an angel sitting on a cloud, you know, with wings and a harp. There's this kind of infinite movement up the hierarchy of beings. And so it seems to show this, this hierarchy as being, as being infinite, similar to what you seem to be describing."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":114.19,"end":126.31,"speaker":"Don Hoffman","text":"Absolutely. And so once again, I think that there's no contradiction between what I'm saying and these, these other spiritual ideas. The, the idea is to simply take them seriously enough to make them precise."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":138.63,"end":140.15,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":140.63,"end":141.91,"speaker":"Jonathan Pageau","text":"Welcome to the Symbol."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":152.21,"end":152.69,"speaker":"Don Hoffman","text":"Hello everyone."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":152.77,"end":202.44,"speaker":"Jonathan Pageau","text":"I am very excited to present to you my discussion with Don Hoffman. Don Hoffman is a professor, he's a scientist at the University of California, Irvine. Many of you watching this will already have seen interviews with him will know a little bit what his theories are. He is known for his work on cognitive science, the science of perception. But he's also working on a model of reality, a mathematical model, which would describe reality as emanating mostly from consciousness. And I've listened to many interviews with him, and I've read some of his work, and I'm very fascinated to see where his ideas connect, but also disconnect with the ideas that I'm presenting to you in the symbolic world. And I was quite surprised. I kind of pressed him on some of the questions. He answered very graciously, and I was."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":202.44,"end":204.76,"speaker":"Jonathan Pageau","text":"Very surprised to see the places where."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":204.76,"end":210.78,"speaker":"Jonathan Pageau","text":"Really our ideas connect. And you will notice on your own the places where they didn't totally connect."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":210.78,"end":213.7,"speaker":"Jonathan Pageau","text":"But I was surprised how much of."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":213.78,"end":216.66,"speaker":"Jonathan Pageau","text":"His ideas are attuned to what we talk about at the symbolic world."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":216.74,"end":218.18,"speaker":"Jonathan Pageau","text":"It is, in a way, a continuation."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":218.5,"end":226.02,"speaker":"Jonathan Pageau","text":"Of my recent discussion with cognitive scientists like Ian McGilchrist and also Bernardo Kastrup. And I think you will enjoy it tremendously."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":227.14,"end":274.7,"speaker":"Jonathan Pageau","text":"What I'm hoping to do is I am not a scientist, and so I'm more of a religious thinker, an artist. And so many of you are your pronouncements and your formulations in sometimes I would say they elucidate in me wonder and excitement, and sometimes they bring out in me confusion and sometimes in frustration. So what I'd like to do is to look at the way you formulate your theory, ask you some question about the way you formulate the theory. And so I will trust you for the mathematics, because I'm not a mathematician. And so it's mostly about trying to understand how it's formulated and see if we can understand. If you can understand things and connect them also to other, you know, to ancient religious thought. I know you've already mentioned that it does in some places, but maybe explore that, if that's okay with you."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":274.94,"end":276.22,"speaker":"Don Hoffman","text":"Sounds good. Sounds like fun."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":276.3,"end":343.48,"speaker":"Jonathan Pageau","text":"All right. And so the way that I understand your thought, there seems to be two basic threads. You could say. That is, one is to argue against the relationship between our experience of the world and something which we could call objective reality or fundamental reality, that there is a disjoint between the two. That because we've been evolved for fitness, we don't have access to the most fundamental aspects of the objective world. We could say. So that seems to be one thread that you follow. And then there's another thread, which is to rebuild a vision of the world which would Be something like conscious realism. That is seeing consciousness as fundamental and rebuilding, let's say, mapping back out to the different sciences and the different ways of thinking based on that theory. And so the first thing I'd like to ask you is, how do you connect those two together? It is how do you connect the one thread which is in your latest book, the Case Against Reality, especially to help people understand that we don't have a perception of reality? And how does that lead you to this consciousness theory?"}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":343.96,"end":749.1,"speaker":"Don Hoffman","text":"Great question. So they are two separate steps, and one might buy the first step and not the second, or vice versa. So they are, in some sense, independent propositions. The first about evolution and our perceptions and whether sensory systems have evolved to perceive truths about objective reality, whatever that reality might be. That's a technical question, right? That's really saying we have this theory of. The mathematically precise theory of evolution by natural selection. We have evolutionary game theory. So it's really a technical question. What is the probability that any sensory system has been shaped by natural selection to see any aspect of the structure of objective reality, whatever that reality might be? And to my surprise, there are very deep reasons within that theory why sensory systems are not shaped to see objective reality as it is, the structure of objective reality. I had some ideas going into it about why some reasons there, for some reason, we might not see reality as it is. But when I, my students and my colleagues started really doing the math, I realized that the answer goes far deeper. It's really in something as deep as what's called the payoff, the fitness payoff. Functions that guide evolution, they simply don't contain information about objective reality and its structure. So that's the real deep reason why we're not. So once you go there and you realize, okay, what evolution is telling us is that sensory systems have evolved to guide adaptive behavior, period. We thought, most of us thought that to do that, they would, of course, shape evolution, would shape our sensory systems to present the truth. Because, of course, you need to see the truth to be fit. And it turns out, no, no, it's just a useful guide. The sensory systems are a useful guide for adaptive behavior, period. And so then this forces you to step back and go, okay, if they're not showing you a window on the truth, how should we think about our sensory systems? And the attitude that I took is, well, the best metaphor that I have right now is something like a user interface or a virtual reality headset. Those are two good, useful metaphors. But as soon as you say that, that we don't see reality as it is, and what we're seeing, space and time and physical objects and shapes and colors and motions. As soon as you see that that's not the truth according to evolution. And by the way, I'm not doctrinaire about evolution. I'm not saying that evolutionary theory is correct. I'm just saying that it's the best theory. We have no competitor right now. There is no theory anywhere near the sophistication and prowess of evolution by natural selection. So there's just no other game in town for a scientist in this realm. That's why I studied it. I thoroughly expect that in 100 years, we'll have a better framework. So I'm not at all doctrinaire about evolution, but as a scientist, it's my duty to take the best theories we have right now and look at them. So then the next step is, if evolutionary theory tells us that our senses are just a headset or just an interface, the question is, an interface to what? And it can't tell you that. It's telling you that you don't see the truth, but it can't tell you what the truth is. So now you have to take a leap beyond that theory. And this is typical in science. You look at your scientific theories, you find their limits, and then you have to take a creative leap where the theories can't tell you where to go. Now, what they can tell you is you say, okay, I'm going to make this leap, and I'm going to propose this mathematical theory. Then you can look at this projection, for example, back into space and time, and then it better look like evolution by natural selection. So the theory can tell you if you're wrong about your leap, but it can't tell you if you're right, and it can't tell you where to look for your leap. So I decided you could imagine various ways to try to leap. I'm very interested in consciousness and what's called the hard problem of consciousness. How is consciousness related to physical systems like our brains or possibly artificial intelligences? And so I decided instead of starting with physics and trying to boot up consciousness, since evolutionary theory tells me that spacetime itself is just a user interface, let me start the other way. I'll start with a theory of consciousness on its own terms. So a mathematical theory of consciousness qua consciousness. So not most of my brilliant colleagues and friends who are working on this are starting with mathematical models of what physical systems must be like to create consciousness or to be consciousness. And evolutionary theory makes it clear that that game is dead. Those things aren't even real. They don't even, they're just interface symbols. So I'm not going to start with trying to postulate what does a system in space and time have to have so they could create consciousness. I'm not doing that. I'm saying let's start with a theory of consciousness on its own terms. What do I mean by consciousness? What's the minimal mathematical posit that I could make to boot up a full fledged theory of consciousness? And so that's where I and my colleagues, Chetan Prakash, when he's seeing Robert Prentner, Chris Fields and others that I work with, have come up with this idea of conscious realism and started working on this mathematical model of consciousness. And ultimately the goal then is to show how the dynamics of conscious agents where we're assuming that that's the fundamental reality. For now, by the way, I don't think science could ever give us a full theory of truth. So there's no final theory of everything from science. But we can talk about that later. But right now this theory would then be as far as we've gotten so far. And we would have to then show how space, time and what we call physical objects arise as some kind of projection of the dynamics of conscious agents. So we would have to get back all of quantum field theory. We have to get back evolution by natural selection or our theory of consciousness is wrong. So that's sort of the two step picture. And it's good that you start with that because a lot of people, here's one objection that I've gotten from a friend of mine and a very, very brilliant philosopher, Philip Goff, he says, look, on the one hand you're saying that evolution says that we don't see reality as it is. On the other hand you're saying that when I look at someone's face, I can get genuine insights into their conscious experiences. That seems to be a self contradiction. And you can see now why it's not. Evolution tells us we're not seeing reality as it is. Then I say, okay, next step. Okay, what is reality? Well, if it's consciousness, then the interface would be an interface to consciousness. So it wouldn't be a surprise that, that we would have some true insights into consciousness if that's what the interfaces do. So that's why it doesn't self contradict. The first is a theory about theorem from evolution. The next is a leap beyond evolution. But the constraint is this leap better project back down to space time and give me Evolutionary theory as a special case that resolves that kind of apparent contradiction."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":749.26,"end":864.34,"speaker":"Jonathan Pageau","text":"Okay, so I think that my biggest question then comes in relation to what you've just explained. That is, if our perceptions, if our capacity to perceive doesn't give us access to reality per se or objective reality, fundamental reality per se, and that in order to fix that or in order to find a solution to that problem, you're looking at consciousness as the originator of phenomena, as the basis of phenomena. Why do you continue to posit this reality? Why do you continue to say it doesn't give us access to reality? I don't know if you understand. I find that it creates in me at least a lot of confusion, which is that other people that I'm interested in very much who seem to see the fundamental consciousness as the fundamental, let's say, axiom will take on something like a modified phenomenological approach, which is that they will take phenomenology as a basic framework, which is that being presents itself to me, being presents itself to me, to my consciousness, and I engage with it with something we could call conscious agency, that is care, thinking about Heidegger in particular, something like care, something like desire, something like purpose, all of these categories will then generate the world. And so the idea, for example, that objects don't have identities apart from their purposes in consciousness, something like that. And so what I find difficult is that when you. When you continue to say that consciousness doesn't give us. And you could say something, what I hear from you often is that consciousness doesn't give us access to reality. And then you turn around through our perceptions, and then you turn around and you say, consciousness might be the fundamental axiom of phenomena. I don't know if you understand the quandary that I have in the formulation."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":865.22,"end":979.2,"speaker":"Don Hoffman","text":"I think so. Gets back to the first thing that we were discussing, and that is, I should say right up front, I don't know whether our senses show us reality or not. I don't know. All I know is that evolutionary theory tells me that they don't. Right. And also physics tells us that spacetime isn't fundamental, which is sort of the foundation of our current perceptions. So now, those theories may be false, but they're the best that we have so far. So as a result of those theories, I'm saying that those theories tell us we don't see reality as it is. Now I take another step and I say, okay, well, I'm not going to say that there is no such thing as reality. And I like the kind of Thing that you're talking about the phenomenologists and Heidegger and so forth, that's perfectly fine with me. And there's nothing in what I'm saying about consciousness that would contradict them. What I'm doing that's different from the phenomenologists and Heidegger and so forth is I'm saying if we want to say that consciousness and psychological and conscious experiences and so forth are fundamental, as a scientist, I know that that has been said for thousands of years by various religious and spiritual traditions. So in some sense there's nothing new. What's new from the science point of view is we're going to take that mathematically seriously. We're saying that consciousness is fundamental. If that's the case, then we owe a precise mathematical theory of what we mean by that. Because in some sense we would like to have a falsifiable and testable theory and we'd also like to avoid dogmatism. We would like to just not spin our wheels in the same circles for thousands of years. We would like to actually find out where we're wrong as quickly as possible. So that's why I go for this mathematical model of consciousness. So I don't think that it's at all contradictory to phenomenology or many philosophical points of view. In some sense, it's saying, let's take those points of view seriously enough that we're going to actually turn them into mathematical precise theories that we can test and find out their strengths and their failures. So I just say that so far it sounds like we're on the same page."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":979.44,"end":1075.46,"speaker":"Jonathan Pageau","text":"All right. And so I think that was, in a way, that was my biggest question because so I've heard you formulate things. For example, these are the types of questions that come up when I listen to you. And so, sorry, I'm not focusing on the more exciting parts of what you're saying because those I get and I'm excited about and it's more the questions that I have. And so I've heard you say something like when you look at, you'd say you look at a car and. And then the car exists and when you turn around, the car ceases to exist. And so these types of, let's say, formulations really boggle my mind. That is because one aspect, let's say, one projection of consciousness is something like memory. And when I say memory, I mean it also almost in a Platonic sense. That is, I don't want to argue, let's say, for the theory of the form. But there's a manner in which we commonly remember identities in consciousness, let's say, across each other, we participate in identities. For example, the identity of a car exists across my consciousness and my relationship to other consciousnesses because I learned what a car is from my parents. I learned from a car is from the idea that the car ceases to exist when I don't look at it. To me, seems like a very bold statement. And so maybe you can expand a little bit on that. Or let's say, in what manner does the car continue to exist when I don't look at it? Because at least it exists in my memory. At least it exists in, let's say, my knowledge that other people also know that the car continues to exist."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":1075.78,"end":1224.64,"speaker":"Don Hoffman","text":"Right. So I'm not denying that there's some aspect of reality that continues to exist. Whether or not I perceive it. There is some reality. It's just that what I perceive in my senses is not that it's just an interface to that reality. And what my interface is doing is very much like if you have a virtual reality headset on and you're playing a game like Grand Theft Auto in virtual reality mode, and I turn my headset to the right and I see a red Camaro. Well, in that context, in that metaphor that I'm using, the reality I'm interacting with is a supercomputer with lots of voltages, magnetic fields in it, and so forth. And when I'm actually turning my steering wheel and turning my head and looking around, I'm really toggling tons, millions of voltages rapidly in some supercomputer. But what I see is a red Camaro. Now, there is no red Camaro in that supercomputer. So that red Camaro only exists when I turn my headset and create it. And then when I turn my headset that way. That red Camaro existed nowhere else except in my perceptions. And since it's no longer in my perceptions, it doesn't exist. It might exist, of course, in my memory, as you point out, but as a current sensory experience, it no longer exists. And I'm saying that that's just what's obviously true in virtual reality is in fact what's also true in everyday life. We're wearing a headset. From an evolutionary point of view, our senses evolved to be a headset, not a window on the truth. And just like any headset, you render what you're looking at as you need it, and then you garbage collect it when you don't need it anymore and you get rid of it. And that way you don't keep all this structure around. The fact that we tend to agree. Like, suppose I play a game of virtual reality tennis with you, and I hold up a tennis ball and you say, yeah, I'm ready. And I hit the tennis ball, and you hit the tennis ball back. It sounds as though there's a single existing tennis ball, one in the same tennis ball that you perceive and I perceive, but in fact, there's not in my headset. I'm looking and creating the tennis ball as I need to. You're creating your tennis ball when you need to. There's no green tennis ball inside the computer, the supercomputer that's running this whole thing, but it coordinates our perceptions such that we have the useful illusion of a single tennis ball. So that's sort of. I hope that that helps to demystify the kinds of things I'm saying would be almost inconceivable, except that we have these wonderful new metaphors of virtual reality and user interfaces that we didn't have a few decades ago that sort of help make it easier. In fact, my take is that my generation has a hard time, but. But the next generation that's raised on the metaverse will just sort of yawn and say, so what? Of course."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":1225.68,"end":1323.83,"speaker":"Jonathan Pageau","text":"So I think this is. Again, so let me bring up another. Let's say, bring up another metaphor to try to crack this for myself. And so I think, to me, the idea. Maybe it's the idea of existence that I'm struggling with. And so there is, you could say something like, I'm fine with Aristotelian notion of potential. If there's potential out there, there's something like potential for existence, and then it encounters consciousness or encounters mind. And in that encounter, there is a joining of heaven and earth. We could say, you know, to use religious terms. And then there is phenomena appears as that. But there's also a sense in which that is not idiosyncratic. And I think you're not saying that it's idiosyncratic, that it's somehow, you know, just me or just my, my. But that there is. So. So most religious theories will posit higher beings, like they'll posit transpersonal consciousnesses. And the patterns that we share in common will be held by these transpersonal consciousnesses. And that is what. That is what, let's say, affords their possibility across each other, right? So you can imagine things like angels or bodhisattvas or different versions of these, where. So when you Say, for example, that the car ceases to exist when I turn around. That is intuitively, to me, it's something. It's something like, unacceptable. Or that. Or that the tennis ball that I am hitting and the tennis ball that you're hitting is not the same tennis ball. There's a manner in which it becomes the same tennis ball in communion with you as I am in communion with you. That's when it becomes the same tennis ball."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":1324.32,"end":1365.2,"speaker":"Don Hoffman","text":"Very good point. So, first, I would agree that I don't believe in solipsism. So I don't think that I and my perceptions are the only thing that exists. And I don't rule out many, many other forms of consciousness, in fact, countless other forms of consciousness that are beyond my imagination. And to say that they're perfectly real and also that consciousnesses can interact and that I could be very much right now unaware of all the kinds of interactions that are going on there. And in fact, all of these things are actually forced on me by the mathematical model that I'm working on right now. It actually forces me to posit a whole hierarchy of interacting conscious agents, or heterarchy might be a better word."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":1366.4,"end":1372.32,"speaker":"Jonathan Pageau","text":"What is the difference between. Because this really interests me. So what is the difference for you between the hierarchy and the heterarchy?"}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":1373.2,"end":1484.23,"speaker":"Don Hoffman","text":"Well, so in a hierarchy, there's a strict upper and lower right. So this is above that. This is above that. In a heterarchy, there could be some hierarchy, but there could also be things that are just sort of sideways from each other and not above or below. So a heterarchy is, I would say, just a little bit more general than a strict hierarchy in the way that I was using it. But so far, again, I think we're on the same page. I'm simply trying to take these ideas and make them precise. I want to actually show precisely how conscious, my technical term is called a conscious agent. That's the mathematics is conscious agent. So for me, conscious agent is not an informal term. It's a mathematically precise thing in terms of measurable spaces and Markovian kernels and so forth. And it, when I look at the mathematics, it suggests an interpretation along the lines that you were talking about, like potential potential, like Aristotelian potential. And somehow that potential becomes actual in an actual experience that one has. And then one can have a mathematical theory about, okay, how do conscious agents communicate and share experiences? Can conscious agents actually combine into new unified consciousnesses? And the answer is yes, and the mathematics shows how to do it. I just presented a talk A couple weeks ago to a workshop on mind and agency with a lot of quantum theorists and philosophers and so forth, where the mathematics provides a brand new and compelling approach toward actually taking separate consciousnesses, conscious agents, and showing how they literally fuse. The mathematics forces you to conclude that in this case the two consciousnesses literally fuse and experiences fuse to create new, brand new novel experiences from the interactions. So right now I'm on the same page with you. My only thing is let's make this precise."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":1484.23,"end":1552.69,"speaker":"Jonathan Pageau","text":"All right. And so this is something that really interests me as well, is that you seem to be. One of the models that I'm experiencing with is the notion of fractal consciousness or fractal agency. That is the, the idea that even me, like let's say as a person, I am, I'm made up of a series of capacities for attention or a series of, of conscious agents that join together into what I call Jonathan. But that this could scale up where I participate in a family, I participate in a city, I participate in other things that aren't. So let's say it's easy to say family and city because they're bound in space. But there are other things, types of agencies that I could participate in, which would be transpersonal, but that this also scales down within the person. But it doesn't imply a kind of panpsychist idea either. Like it doesn't. It's not the idea of that. Let's say consciousness is just a quality of matter and that they join together, but that there really is also a bottom up and top down relationship between these fractal agencies. So I don't know if your model has thought about those types of things."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":1553.21,"end":1702.37,"speaker":"Don Hoffman","text":"Oh, it's baked into the model. So fractals are self similar structures. As you look at different scales, you see the same structure, repeated and nested. And the mathematical framework that I'm using of conscious agents is precisely self similar at all scales. It's the same structure. When agents combine, they form new agents at a higher scale, but it's the same structure. So you have the self similarity going up all the way. And one interesting technical question that I'm working with my colleagues right now is that as we take suppose I have what's called a countable set of these conscious agents. You can pair them with the integers. So there's an infinite number of them and each has its own, say, conscious experiences. Well, it's a theorem of our theory that when any number of them, any subset of them interact, they form a new agent. So that means that you have what's called the power set, which is the set of all subsets of these conscious agents. You have a new collection of conscious agents which is, has the dimension or the, actually the cardinality. With this, the technical term, the number of them is the power set of the first. It's a bigger infinity. And once you, then if you take the power set of them, you get a new set of combined agents. So this is your fractal idea with mathematical precision. Now what we're doing is climbing up what's called Cantor's hierarchy of infinities. There's not one infinity, there's an infinite number of infinities. And each infinity that's up higher is infinite, infinitely bigger than the one below it. And so what I see here in our theory is our theory of combination will get us to ever bigger and bigger infinities, but there's no limit. And so I can't start with a theory of the one big consciousness because I can never get there. What I can do is have a theory of conscious agents that's sort of forever approaching the highest level. But at every point my theory will say you're not there because, oh, you're now at level 50 of Cantor's hierarchy. Now you're at level 100, but there's an infinite number of levels. And so what's interesting about this scientific theory is that there will be no room for hubris or dogma because the theory itself will be telling you there's infinitely more steps to go and you're only at step one billion, but there's an infinite number. So this is really a very. When you do this, you get the fractal notion that you were talking about, but you get the mathematics coming back and saying exactly how the fractal works and also telling you be very, very humble because your mathematical theory will never get to the final description. There's no scientific theory of everything, even a theory of consciousness."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":1702.61,"end":1753.33,"speaker":"Jonathan Pageau","text":"Yeah, and it seems, that seems to really fit with the idea that most mystical systems are apophatic. That is, if you, if you read many of the more famous mystics or if you look at different non dual systems, they tend to always have this. It's an infinite regress. There is no positive statement of the infinite. It's always a constant denial of that which was, or a constant shedding of that which was below. But there is no reaching the point. Even St. Gregory of NYSE talks about, let's say, the ascent into God as being infinite. Infinite in the sense that there is no end to it, it's not a stasis. You don't become an angel sitting on a cloud with wings and a harp. There's this kind of infinite movement up the hierarchy of beings. And so it seems to show this hierarchy as being infinite, similar to what you seem to be describing."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":1753.33,"end":1932.79,"speaker":"Don Hoffman","text":"Absolutely. And so once again, I think that there's no contradiction between what I'm saying and these other spiritual ideas. The idea is to simply take them seriously enough to make them precise. And it's an open question whether the mathematics that we've got right now will even allow us to posit that there is a final unity. I, I doubt it myself. I think that the description you gave that is so open ended and you never get to the top is probably right. But for me, I actually put this out to my colleagues and mathematical colleagues that I want us to look at this mathematically and see what kind of progress we can make on asking, is there any way to think about a final unity of all these conscious agents into one big conscious agent in the limit as we go to the top of the King Cantor hierarchy? And right now I don't see it, but that means nothing. I'm not a mathematician, so we'll see. But we do have big hints, like from Godel's incompleteness theorem, that no scientific, no finite axiomatization of mathematics that's rich enough to do arithmetic can ever have all truths. Godel says, give me a rich enough system of axioms. I'll show you a statement that's true but can't be proven. It's true given your system, but it's not provable from your axioms, your theory cannot get it. And if you add my new true statement to your axioms, I'll show you another statement that's true, but you can't derive it. And so what it's telling me is that scientific theories in principle will only scratch the surface of the truth. And you might ask, well, why are you doing it then? Part of the answer is I don't know. But the other part of the answer is it seems like consciousness needs to spend time in various specific form domains like space and time, right now. And here we are in this virtual reality with this 93 billion light years across and trillions of stars and galaxies and so forth, and we get lost in it. Consciousness gets lost in it and then wakes up and finds out, no, no, I'm not a little 160 pound entity in this vast universe. This universe is nothing but a headset that I'm wearing And I can take it off. So somehow consciousness seems to need to project itself into various forms, various formal systems, if you will, and explore them, get lost in them as a way of knowing itself. If consciousness is really about knowing itself, it does it by losing itself in a particular, like, space time system that we're in and then waking up and saying, as beautiful and rich as that is, I'm not that I'm beyond that. And that's how it comes to know itself, by knowing what it's not. So that. That's one reason perhaps why these kind of scientific theories are important. That's sort of part of the whole process of consciousness waking up to itself by knowing precisely what it's not. I'm not just that. I'm more than that. But you can't know that you're not just that until you can state precisely what it is that you're not just. And then you can transcend it."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":1932.87,"end":1997.82,"speaker":"Jonathan Pageau","text":"In many spiritual practices, not all, not all the spiritual traditions, but in many spiritual traditions, there is a sense in which there's a double movement. You could say, so there's a movement, an apophatic movement, which is similar to what you're saying, which is that these perceptions that I have, they are not ultimate reality. They are. They are somewhat. If compared to ultimate reality, they are something like an illusion. There's something like a dashboard, the way that you talk about. But then even that illusion, let's say, has to originate from something. It nonetheless is a projection of consciousness. And therefore it also does offer us reality at the level at which we are. That is, it offers truth to the level in which we are perceiving. But it also at the same time hides truth. Because I think when. When I listen to the way you present your system and when you talk about the headset and how it doesn't show reality, I struggle because it feels like there's an arbitrary layer. And where does that arbitrary layer come from if everything is a projection of consciousness? I don't know if you understand my question."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":1998.38,"end":2172.26,"speaker":"Don Hoffman","text":"That's a great point. And again, I agree, the headset is just a metaphor that helped people to wrap their heads around the idea that you might not see the truth. And that might not be bad, but the notion of projection is the one that I'm really working with. So I have a mathematical model of consciousness. And for example, that model may not have any notion of time in it, in the notion of increasing entropy. So in our mathematical model of consciousness, it can be a timeless dynamics of consciousness in the sense of there's no increasing entropy. But you can prove it's trivial to prove. It's a three line proof that any projection of that timeless dynamics will by the act of projection lead to the appearance of an evolution in time. So you get time evolution as an artifact, as something that's introduced. It's not real about consciousness itself. It's only an artifact of looking at consciousness through a particular viewpoint. Then you get the notion of entropic time and therefore probably more general limits as well. The consciousness itself may have might be cooperative, no limited resources, no competition. But when you take a projection of it now, it looks like limited resources, competition and competition in time. So in that sense you could say that this is all the truth. But it's truth of a projection and it's not a deep truth of the thing that's being projected from. And in fact there are artifacts of the projection that aren't deeply true about the thing that you are looking at. So it may be that there is no entropic time and consciousness view broadly, but from any perspective of consciousness, you get the notion of an entropic time. So you can see how. I hope what you see from this is that I don't think that I'm contradicting the basic ideas of these spiritual traditions. I'm trying to take them very, very seriously and make them completely rigorous. I'm hoping eventually to have a synergy between science and spirituality where both sides are going to be shocked. There are things that both are going to think that they knew were true. And we'll find out as we go along that, well, those were at best poor approximations to some better understanding. But I think the two will. There'll be a synergy that with the proper humility and the proper openness to proceeding wherever our theories, our precise theories may lead us. And of course not taking our theories as the final word, but as the best we have so far, we will be led to deeper and deeper understandings of the spiritual realm that maybe many of the spiritual teachers in the past knew, sort of by intuition. But most of us aren't there. But with the tools of science, many more of us can begin to start to grasp these ideas and get help towards them."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":2172.34,"end":2253.66,"speaker":"Jonathan Pageau","text":"So I think that again, maybe, I hope I'm not pressing the point too much, but if, let's say, if time and space are a projection of consciousness, you know, then how can I say this? Would they not necessarily be a true aspect of consciousness in projection, that is that they are true manifestations of consciousness within the frame that we are perceiving, the frame that we are existing. And I say that it's for me that you could say there are two big spiritual traditions in regard to this, right? There is a kind of idea of Maya, excessive idea of Maya, where everything is illusion, nothing of this is real, you know, and then there's something which would be more like an incarnational vision, which we definitely find more in Christianity, which is that all this is unreal in comparison to God. But to the extent that it is real, then it is real. It can be something like transfigured, that it can lead us towards mysteries, let's say if we, if we engage with what we would we see properly. But the, the, let's say the headset thing and the way that especially when you use the image of, from the headset to the ones and zeros in the computer, it's a, it really is pure disjunction between, let's say the fundamental, the more fundamental aspect and then the, the projection of that in, in our perceptions, right?"}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":2253.74,"end":2448.11,"speaker":"Don Hoffman","text":"So I agree that fair enough to say that the projection has a reality of its own. So for example, we talk about sunrise and sunset and it's perfectly fine. And it's true that the sunrise was at such and such 5:55am this morning or something like that. But from a higher perspective, if you take a rocket and get off planet Earth, then the very notion of sunrise and sunset is sort of irrelevant. The sun just shines. So it's true of a particular perspective that the sun rises at 5:55am in Irvine, California. And of course that wouldn't be true even in Seattle. It's a different time in Seattle now and so forth. So yeah, you can talk about truths of perspective and I think that there's not in the way that I'm thinking about our perceptions and reality. As you can see, when I say that consciousness is fundamental and that conscious experiences are a fundamental part of that, then our conscious experiences of space and time and so forth are experiences. So they are part of this deeper reality of consciousness. So when I'm talking about the headset, I'm really trying to bring home what evolutionary theory is telling us. Evolutionary theory is telling us that our perceptions are not isomorphic or homomorphic to reality. So with one exception, something called measurable structures. But other than that, there's no homomorphism from, from the point of view of evolutionary game theory. So to bring home the meaning of that theorem from that scientific theory, I use the headset and try to make the point that it's utterly alien. But then when I go to this deeper level of consciousness, there is a rapprochement. Now, I say, okay, I now want to transcend evolutionary theory. The reason I take the headset seriously is that's our best scientific theory in this realm. So let's understand what it says. It says that this is just a user interface, and you got to live with that. Now, with this deeper theory, there is something of a rapprochement because I'm saying there is conscious agents with their experiences, and that's part of the objective. Now, even there, you might say that what's really interesting is the potential for conscious experiences, not the particular conscious experiences that you have. And one could debate that. But the way I view it right now is mathematics lays out, there is this potential. And then when we actually run the mathematics, we see the actual play of conscious experiences that that potential gives rise to. So I don't see the two as terribly divorced. But the one, the potential, is stunning. And I should say this. As much as I'm praising science, I want to make very, very clear that I think that there will always be a fundamental mystery forever. There is no scientific theory of everything. And for what it's worth, my own take is that we can't ultimately know the truth through scientific theory. We can get rid of our misunderstandings of the truth through scientific theory. That is really, really helpful. But in some sense, we can only know the truth by being it. We can know it's. If we're not divorced from consciousness and consciousness is fundamental, then we can know it in silence when we let go of concepts. But we can also know something about it from our conceptual analysis. We can know that the consciousness is no less rich than the concepts that we've had so far. And we can know that certain of our concepts are just flat out wrong, or they're not rich enough. So they're helpful in that way."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":2448.19,"end":2494.14,"speaker":"Jonathan Pageau","text":"No, this is really helpful for me because it's really helping me understand. You know, I think it's helping me more understand why you say the things you say the way you say them, and how in a way, I'm realizing more and more that what you are trying to do is to say, well, here's evolutionary theory. This is what it presents, and this is the limit, because it actually creates a disjunct in the person listening. Because there's something to us which is appalling or repulsive about the idea that we don't have access to reality. And so then you bridge into saying, well, here's a way in which I can talk about reality, which will afford us some connection to reality. But is what is centered on consciousness and not centered on the idea of cold, objective, let's say, perception of facts. Let's say something like that."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":2494.14,"end":2548.09,"speaker":"Don Hoffman","text":"Yeah, that's a very good summary. And then the other thing about this approach then, is to say that to really close the loop when we propose this deeper theory, we have to show precisely how it projects down into a space time. That leads to evolutionary theory where that theory says I can't see the truth, so that we, that way we close the loop. That's how we see how evolutionary theory says you can't see the truth, but from a deeper point of view, you can see the truth and you can explain why the more narrower theory tells you you can't see the truth. And that's how science progresses. We take our theories to their limits, they tell us where they stop, and then we take a creative leap beyond. But whatever the new leap is, we don't throw away what we've already done. We treasure those scientific theories. They're wonderful gems, but we have to show how they fit into the, as you were saying, the fractal or the self similar pattern at a deeper level."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":2548.25,"end":2587.02,"speaker":"Jonathan Pageau","text":"All right, so I wanted to come back to something we were talking a bit before. So scientists love the idea, the bottom up part, let's say, you know, the idea, for example, as you formulated it, that consciousness can join together and then, then appear as a higher form of consciousness. But have you studied or thought about the manner in which higher consciousness constrain lower consciousness within a fractal hierarchy, which is that. Do you see causative relationship moving down from higher beings into. Into their constituents? Or do you just see it as a joining and then, and then see it going up, let's say."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":2587.18,"end":2757.39,"speaker":"Don Hoffman","text":"Well, in one word, yes, but I'll unpack it a little bit. Physicists themselves recognize that the standard reductionist approach is doomed. So reductionism, strictly speaking, is the claim that as you go to smaller and smaller scales in space time, you get to more and more fundamental entities and more and more fundamental laws. And that has been the idea that space time is fundamental. And that physicalist reductionism going to smaller scales gives you more fundamental laws and entities has been a very, very useful framework for centuries in science. But the glory of scientific theories is to tell you their limits. And space time has revealed that it doesn't go very deep. It only goes to 10 to the minus 33 centimeters. And then it fails, not 10 to the minus 33 trillion centimeters, only 10 to the minus 33. So I'm not terribly impressed. So reductionism has a finite lifetime, it can only go so far. And in fact the physicists now are looking at these, what they call UVIR interactions. So the ultraviolet is as you go into smaller and smaller scales, but IR is going, is going to the bigger and bigger scales. And before we used to think that as you go the UV direction to smaller and smaller scales, that's where you get more and more fundamental laws. But no, it turns out that it wraps around and as you were talking about, the global tends to affect the small as well as the small affecting the global within this is just within the physicalist framework of space time. And this is state of the art issue in physics right now. The physicists are trying to wrap their heads around this, they're trying to understand how this UV IR interaction is happening. But brilliant physicists are making real progress on this. And I'm going to be very interested now that's doing it within spacetime. I'm trying to work on this kind of thing outside of spacetime where the notion of spatial scale no longer holds. There is a different notion of self similarity in terms of, for example, the number of conscious experiences that an agent can have. So you can talk about combinations being higher in terms of this conscious agent has all the experience of these agents and more. And there I also see what you could call UVIR interactions where yes, bottom up interactions of agents in their asymptotics leads to higher level agents, but those agents in their asymptotic interactions also affect the low level dynamics of the agents below. And that's a very, very rich mathematical area that's going to, I predict, occupy us for centuries. Exploring all those possibilities of bottom up and top down interactions. There is the riches and you know, I, I just see the, the riches in the distance and I would love to explore them but you know, it's my guess is that's going to be an infinite exploration definitely."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":2757.55,"end":2810.65,"speaker":"Jonathan Pageau","text":"And so because we experience it in ourselves, right? That is the reason why I say that is that we, we experience it in ourselves in the sense that we notice at least I do. Like I'll notice things that have agency in me that I'm trying to constrain, you know, that seem to have some kind of agency and then I'm trying to, let's say, bring them in line with my higher agency or my higher consciousness. And if I apply that fractally up from me, then I notice the same in something Like a city where a city is of course made up of all the people that constitute it. But it has laws, it has ways of constraining those members in order for them to participate appropriately in their higher being, let's say. And so I tend to use very practical examples, but I don't know if the practical examples map onto your theoretical examples."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":2811.37,"end":3068.22,"speaker":"Don Hoffman","text":"Yes, so there's both emergent properties as you. So that's more of a bottom up kind of thing. So you can get emergent properties. The city is not just the people and the cars and so forth, it's something more. But you could think of that as a bottom up kind of kind of thing. But then the city itself constrains what people do and it affects the fact that I'm in Irvine as opposed to Manhattan, changes my lifestyle considerably in how I would live. So there's going to be these bottom up and top down things. And as you alluded to, in our personal lives we notice that we're not just one self consistent consciousness ourselves. You may be aware of the split brain work literature. So if you, you have two hemispheres, a left and right hemisphere, and if you. They're joined by a band of fibers called the corpus callosum, 225 million axons, roughly. And you cut that, cut those. Actually a friend of mine, Joe Bogan, was one of the surgeons who did those callosotomies cut the corpus callosum. And another friend of mine, V. S Ramakantran, we call him Rama Rama, one of the patients that he studied, the left hemisphere, I believe, believed in God and the right hemisphere was an atheist. The left hemisphere might want to have a desk job and the right hemisphere wants to be a race car driver. And they can even fight. The right hemisphere controls the left hand, the left hemisphere controls the right hand and they can fight. The left hand might be trying to make an omelet and the right hand doesn't want an omelet. And it throws a full egg into, you know, with eggshell and the whole bit into the omelet to ruin it. So the kind of thing you alluded to, we have concrete evidence of multiple agencies within what we call me. And that's what this theory of conscious agents that I'm working on with my team is really one of the things we're interested in is okay, how do these agencies interact and form new agencies and yet preserve in some sense the original agencies? And what happens when you cut the corpus callosum? What does that do? Is there a real disunification? How does that work? That we could disunify previously unified agencies and also in spiritual traditions, when they talk about the false self versus the deeper true self? And when you spend time in meditation and just everyday life and are aware of the false self and its need for trying to be special and more important than other people, and its tendency to complain about everything and to worry and so forth, and to think about the past and future and never be in the present moment versus another part of you that says, relax, be here now, and you see both going on in yourself at the same time. Once again, you get this notion of multiple agency and almost the sense that the false self is some kind of. It feels like some kind of autonomous thing that is going on of its own accord. And that in some sense, by paying attention to it and not giving into it, but just in some sense embracing it, it eventually dies, but it's a painful death for it. So that whole. And Christianity, when Jesus said, if you want to follow me, take up your cross daily, deny yourself, take up your cross daily and follow me. Well, that denying yourself is really what I was talking about. This false self that's complaining and worrying and wants to be special and more special than everybody else and be important. When people put you down and you want to snap back and repair that false self, right, and get back, you know, someone honks at you when you're driving and you want to honk back when you don't and you feel that part of you that's angry and you let it die. That's what Jesus is talking about, is daily letting that false self die. So it is very much like another conscious entity that has some autonomy that actually has to become. So I would love right now, I don't have a mathematical grip on that, but I would. But see, you can see where I want to go with it. I would like to take these ideas that are informal, intuitive and give them scientifically deep attention and try to model what's happening in the left and right hemisphere. What's happening, what we call the false self. How do conscious. How are there autonomous consciousness? Is how do they interact? How can they be united and separated?"}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":3068.62,"end":3130.56,"speaker":"Jonathan Pageau","text":"One of the things we've been talking about in this circle, let's say, of conversation that I'm part of, is the idea of parasitic agency. That is, that we can notice that there are some consciousnesses or some agents that seem to exist, you could say something like exist in service of their higher participation. And there are some agents which seem to close off and become parasitic. A good image is to say that they become prideful, right? They become prideful, they want to self contain. And in self containing, that is when they become something akin to what you call the false self, is that they become incapable of noticing their higher participations or even their lateral contact. You know, because in, in this theory of consciousness, I imagine there's also a sense in which we share in consciousness. That is there is one, ultimately one, or there is. Consciousness is shared amongst agents and it isn't something that closes itself off and becomes a completely hermetic system, let's say, right?"}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":3130.88,"end":3241.31,"speaker":"Don Hoffman","text":"In fact, I think that there is one sense in which I could say that you and I are the same consciousness, right? That there is in some sense a unification there. On the other hand, this false self that we were talking about seems to be. When consciousness has put on a headset and it doesn't recognize that it's a headset, it thinks it's the truth. So when consciousness lets itself get lost, it loses its own identity and it thinks that it's some little thing. So I'm a little 160 pound, 6 foot thing in this vast billions of light years across spacetime. So I'm this tiny insignificant thing. And I really believe that I so identify with that form, that experience of the body as being just this tiny insignificant thing. Then of course it makes sense that I'm going to be spending my time trying to figure out how to get myself, how can I be significant, what can I do? I have to compete with everybody. I have to be smarter or more famous or whatever it might be, or have a better car, richer, whatever. I have to do something because I. Because I'm believing a lie. And so in some sense that false self is part of the one big consciousness. But it's the one big consciousness that's letting itself identify with an illusion. And so it seems wrong at one level and it seems perhaps evil at one level. But at a deeper level it may be part of the necessary process by which consciousness really wakes up and knows itself. By letting myself get completely lost and doing evil things, competing and all that stuff, and then waking up eventually I realized that I transcend that and I take my headset off and the others take their headset off, we find out we're the same, we shake our hands and move on."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":3241.79,"end":3311.52,"speaker":"Jonathan Pageau","text":"Yeah, well, I mean, I think the idea, let's say the idea of repentance, if you apply it within yourself, I always try to move across the levels in order to kind of understand the analogy. So within you you will have you will notice those things. So it's like, let's say hunger is a good one. It's like, so hunger is an aspect of agency which is. Is good if it participates in its. In other end, let's say, collaborates with other aspects of agency within myself. But if it takes over and becomes parasitic and sees itself, believes its illusion, right? Believes that it's all it exists, then I can become. Then I can, like, let's say, my higher self can actually become a slave of that lower. Of that lower agency. And then I start to serve it, you could say. And so I, I live for eating. And I. And eating becomes that which drives all my. My motivations. And so you can see how this false, this smaller, false self, let's say, within me, right, is an image of how at. Even at a higher level I can engage in. In these, let's say, false selves that. That will capture my. My attention completely and cut me off from my higher participation in consciousness, right?"}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":3311.84,"end":3426.43,"speaker":"Don Hoffman","text":"And we can ask, why does consciousness do that to itself? Why does it allow itself to get lost that way? And I don't know. And I think that that's a deep question that we'll want to pursue both on just the spiritual level, but also on this mathematical, scientific level. And I suspect that we'll be talking about it for a long, long time. But one idea that I would throw out as part of that long conversation is you do notice in some people that when they have a limitation and they face it and rise above it, they become better in some sense. So, you know, people who are in the Paralympics, they might be. They might be missing a limb or they might be paralyzed or something like that. And you watch the ones that. Or like Stephen Hawking, right? He, you know, motor neuron disease, he's completely paralyzed, and he faces it and transcends it. And we look at it and go, holy smoke, look at the potential of the human spirit. You could be completely confined to a wheelchair, unable to move, and you can become the greatest, the most famous physicist in the world at that time. And so that may be one. I'm not saying it's the final word, but just one aspect of what consciousness is doing by putting itself in these various situations. Now here I am a selfish murderer. And then you learn about. You learn about your potential and so forth by putting all these. Yourself in these confines. And then eventually the murder on death row, waking up and realizing. And realizing who they are before, you know, for example, before they're executed. Well, consciousness woke up and it so there's so again, I'm not at all proposing that it's good to murder or anything like that, but I'm saying that there's some deeper point of view that we're going to, I think, ultimately have to understand about what consciousness is letting this, this happen. And it may be like the Stephen Hawking model, may be one aspect of it."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":3426.67,"end":3459.64,"speaker":"Jonathan Pageau","text":"Yeah. But I think that, I think that makes up, it makes sense because what can happen. Can I say this? Well, also there's a playing out that say when, when a. Let's say an agency becomes self serving, then it'll play itself out, right? Let's say the food part, like if I just eat, like it'll play itself out and I'll become sick, I'll become overweight. Like all these things will happen and in the consequence of that, as I see it unravel, then that is the point. Like that's the moment when I am capable. It's like, you know, it's a cliche, but it's like hitting rock bottom."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":3459.64,"end":3459.92,"speaker":"Don Hoffman","text":"Right."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":3460,"end":3486.03,"speaker":"Jonathan Pageau","text":"And that is the moment where I, you know, to use the words of Jonah, right. It's like I remember the Lord, I remember what is above. All of a sudden there's a. There's a possibility of, of connection again because this parasitic process has ran its course and now it's devolved into like it's broken down because it didn't have what it, what it needed to was. It was acting in a way that was reductive and was, was, was killing itself, let's say."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":3486.03,"end":3513.92,"speaker":"Don Hoffman","text":"Ultimately. Yeah, I agree. It seems that consciousness does have this built in mechanisms such that it lets itself be deluded, but gives itself feedback, painful feedback, like hitting rock bottom to help itself wake up. And again, the question is, well, why does consciousness bother to go? Why doesn't it just stay awake? And there seems to be some important reason why consciousness lets itself go to sleep. And we've talked a little bit about it, but I think that there's a lot of gold there that we haven't yet dug."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":3514.16,"end":3548.08,"speaker":"Jonathan Pageau","text":"Yeah. And there's some mysterious statements. Like there's an interesting statement by. I think it's St. Gregory of Naziad who says that there are the angels of the right hand of God and the angels of the left hand of God, that the angels of the left hand of God are the demons and that they think that they're acting completely out of their own will and that they are completely self sufficient and even thinking that they're acting against the higher will, but ultimately they're not. It's almost like a trick on them where ultimately it's a surprise and they end up participating in the giant pattern despite themselves."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":3548.67,"end":3555.63,"speaker":"Don Hoffman","text":"Right. And then they wake up and realize that the evil that they thought they were wasn't what they were at all. That was just an illusion that they were under."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":3556.27,"end":3578.92,"speaker":"Jonathan Pageau","text":"Yeah, I think that that's definitely. At least it seems to be. But it's difficult to pierce that, of course, because, you know, it's difficult to pierce it, like you said, without saying something like, the murderer is doing good. The murderer isn't doing good. The murderer is acting against consciousness in a way. But how can that be if that's the source of all things? There's like a deep. There's a deep paradox in that problem."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":3579.32,"end":3633.05,"speaker":"Don Hoffman","text":"One way out of the paradox may be that it's mathematically impossible to take a projection of the one consciousness without necessarily inducing these things as artifacts. That would be wonderful if we could actually prove. If a mathematically precise theory of conscious agents could prove that even if the One is in some sense without any competition, all loving and so forth, any finite or projection of it that doesn't include the whole will necessarily lead to what we call evil. That would be a very interesting theorem that would resolve the question that we're raising here. We would show that what we call evil is a necessary consequence of not looking at the whole as the whole. As soon as you look at it just from any particular perspective, evil is necessary. And maybe the waking up process is emerging from a perspective back to the whole."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":3633.61,"end":3737.24,"speaker":"Jonathan Pageau","text":"Well, definitely that's something that. At least from a Christian point of view, that is definitely a difficult proposition because you would say something. I think the way that I would formulate it as a Christian would be something like that multiplicity in multiplicity is the possibility of evil because of its disconnection from the One. But that the multiplicity can also be filled with the One. Ultimately, that it can be filled with love. And that if we see it's not that we abandon the multiplicity for the One, but that if we see the manner. This is why the headset thing is sometimes an issue for me. Because if we see how the multiple is connected to the one, memory is the image that we see, for example, in. I think for sure in the Christian tradition, but in other traditions as well. The idea that in distance from something, remembering it connects you to that. And so it's not that you annul the distance is that you remember. And so you can think of it in terms of time, but not Necessarily, you can think of it in terms of just ontological hierarchies where I'm a soldier in an army and we're a bunch of guys and we're goofing off, and then suddenly we remember that we're soldiers and we are in this order, let's say, of principalities. And that is how I. Even though I'm not the general, right, I'm not the president, I'm a soldier. But by remembering, then I'm able to reconnect and kind of reconnect these levels together in a proper way. So it means that multiplicity would necessarily have the possibility of evil, but would not necessarily have to produce evil if it remembers. I don't know if that might be using language that you're not used to. So I'm sorry if I'm kind of pushing you a little bit far in the way the language I'm using."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":3737.4,"end":3781.08,"speaker":"Don Hoffman","text":"I think those are really fascinating ideas. And you can see why, as a scientist, I would like to take them and make them mathematically precise so that we can actually start to prove theorems about this kind of thing. Because these are the kinds of deep questions that actually deserve that kind of respect, that deserve to be taken seriously enough that we start giving mathematically precise answers to them. But in the Bible, Jesus talks about a deep unity between all of us when he says, for example, when he talks about heaven. And most of us typically think of heaven as some glorious place that we're going to go to after we die and so forth. But Jesus was very, very clear about it. He said, the kingdom of heaven is within you. Now the kingdom of heaven is within you."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":3781.08,"end":3891.47,"speaker":"Jonathan Pageau","text":"This is the kingdom part that I'm talking about. Kingdom is memory. Because kingdom is the effect of a principality on its possibilities, right? So it's like the kingdom is the capacity of the king to reign over a set of people. And so the idea of heaven and the kingdom of heaven are not the same. Kingdom of heaven is something like memory of heaven. That is, it is our capacity as multiple beings to all look towards the king and follow the king, and therefore exist as a body, like the idea of the body of Christ, let's say. And so that's what I mean by memory is that. So when Christ is the kingdom of heaven, he's not saying, although other statements that he makes seems to actually imply deification. But in that particular statement, he's saying we are able to be a body of heaven. The body of heaven, like the kingdom of heaven, the body of Christ, all these images that are used in scripture to talk about this memory between levels. And so the reason why, I'm sorry, I'm insisting on this so much is just because it's, again, the difficulty of formulating a relationship to consciousness as false or as, you know, that multiplicity is an illusion, all these types of things, because there is also a. I think there is a little bit of a danger sometimes in that, because Gnostics, that's the way they presented the world. It's like all of this is an illusion in a certain manner. All of this is evil. So we have to escape this. We have to escape this in order to enter the one and often that created very strange behaviors in people. Whereas the idea of memory, for example, or the idea of connection between the levels is admitting for the possibility of breakdown and evil and illusion. And all that seems to fix the problem of just positing our experience as illusion, let's say, right?"}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":3891.79,"end":4037.77,"speaker":"Don Hoffman","text":"So my understanding of the spiritual traditions on this is that we don't want to fight what is we don't want to fight this moment. The Bible is very, very clear to give thanks always for all things, right? That's pretty clear. So that means that I'm hungry. I should be grateful. I have a broken leg. It makes no exceptions. It says, give thanks always for all things. So anybody who says that we should be angry and fighting this and so forth, you know, if I see disease, I should. And I'm a doctor, I should go and help treat disease and so forth. And as a scientist, I should go find ways to. But in the process, I should be grateful for the situation that I have right now. There is this disease, and it gives me the possibility to find ways to ameliorate disease and so forth. So there's this. It's a subtle thing, but it's on the one hand, not resisting, not fighting. What is on the other hand then choosing to take actions out of love and so forth. But the issue of Jesus tried to use, I think, metaphors to point to things that are difficult, like the kingdom of heaven, I think might be translated the realm of heaven. And heaven just meant, like, spaciousness. I think that he was pointing more to what you might just call a sense of spaciousness or being that we all share. And I think that he suggested that all of us have this. When he was confronted by some religious leaders at the time who wanted to kill him, they were getting stones to throw at him to kill him, because he said, I'm the son of God. And he said, well, look, in the psalms it says, I have said you are gods. And if they call them gods to whom the word of God came, why are you trying to kill me? Because I say I'm just the Son of God. Jesus is making it very, very clear that he's not better than the rest of us. We're all unequally sons of God and gods. And so when he says the kingdom of heaven is within you, I think he couldn't be more clear that saying, we're all essentially, we're children of God, but children of a person, children of humans are humans, children of God are God. And so I think the message from the Bible to me is that we are one and you and I are God under a veil, under a projection, and we'll take the veil off and greet ourselves and recognize that we are that one."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":4037.85,"end":4104.58,"speaker":"Jonathan Pageau","text":"Yeah, Well, I think that, I mean, maybe there would be, of course, a few little. There would be point differences that say, with official Christian theology, people watching will know, let's say, what I think about that, but I don't want to insist on it, but there is. So there is a difference. Like, and you see it, and I think you totally agree with me because you talk about this idea of self sacrifice, or there is a difference between the taking off of my veil, let's say, or the grabbing of the apple that we see in grabbing divinity for ourselves, which is what we see as the fall, and this rather kenobic mode where I actually empty myself of my false self. And in doing that, that is when I, let's say, encounter divinity or that is when I am deified. But that there is, there is a difference, let's say, between those two movements. And, and I think it's, for me at least it's important because there seems to be a. A tendency, a normal human tendency to want to grab that for themselves and say, oh, we are gods. And so, yeah, that's mine. Like, I am. I am God, let's say, in that way."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":4105.06,"end":4216.94,"speaker":"Don Hoffman","text":"Right. Whereas I think what Jesus, and by the way, I should say I'm not a theologian. So that's okay. Don't worry as an amateur. But my take on is that when Jesus said, you know, if anyone wants to follow me, let him deny himself, take up his cross daily, that it's really letting go of identification with your form and your space, time, location and so forth, all the stuff that you identify with, and then competing with everybody else and trying to be better than them and so forth, letting go of all, when you let go of all those identifications in Some sense, Jesus was saying, recognize that this is just a headset, and you're wearing the headset. You're not a little thing in the headset. But if you think that you're some little player inside the game, inside the headset, you have to let go of that illusion and recognize that you're not that. So here I am in a virtual reality Grand Theft Auto game, right? And I don't know that I'm just completely lost in the game. So I get really angry when someone hurts my car, and I want to go and hurt their car, and then I want to grab all these, and I want to get this mansion and I want to. But eventually I realized, holy smoke, that was just a virtual reality. And I was all worked up over nothing. And if I just understood that this is just a virtual reality headset, that's the deep spiritual insight, all of a sudden I would have equanimity. You want to hurt my car? Hurt my car? You want my money? Here's my money. Because this is just a game. And that's. That's what my. My take is that in some sense, you know, you're taking up your cross and denying yourself is recognizing you are not your avatar in the game. Recognize that that avatar is just an avatar that you have when you have the headset on. Don't identify with that avatar. And as soon as you do that, that's complete spiritual realization."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":4217.43,"end":4237.59,"speaker":"Jonathan Pageau","text":"And so maybe I'll ask you a last question. What do you see as the. What do you hope the future will be in terms of, Especially maybe in terms of the discussion we've had in terms of the manner in which your theories will connect both the scientific world and the more philosophical or spiritual traditions. What do you see, let's say, in the future, in terms of those types of discussions?"}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":4238.15,"end":4349.62,"speaker":"Don Hoffman","text":"Well, I look forward to really productive discussions between science and spirituality. You know, the history, it's been bad. Galileo, imprisoned by the church, house arrest, and so forth. The spiritual traditions, Christian and Eastern, mystical and, you know, Sufism and so forth, have for thousands of years said that space, time isn't fundamental, that there's a deeper realm. But they haven't had any rigorous. They haven't had mathematical models of it. So they've had the deep and I think in many cases correct. Of course, not completely correct, but in many cases correct. Intuitions. Science, on the other hand, has stuck to space and time for the last few centuries and things inside space and time. But they've sharpened these amazing tools of mathematical precision experiments, and then the scientific method where you actually then take your theories to task and find out where they're wrong and then transcend them. The two have been separate strands. Now it's time for them to meet. Because the science has now recognized that even though focused on space time for centuries, space time is not fundamental. Space time is doomed. But they have the tools. It was good to study space time so well that we developed the mathematical tools and the experimental tools. Now as we step outside of space time, we're stepping into, I think, the realm that the spiritual people and saying is there for all along. But they haven't had the tools. The scientists now have the tools. And so the two can start to work together constructively. And that's why I say it's going to be both exhilarating and difficult on both sides, because we all have things that we deeply believe that will end up being shown to be deeply false or not nearly as deeply true as we thought on both sides. And so that. But that's how we learn and grow. We wake up from our dogmatic slumbers."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":4350.26,"end":4360.18,"speaker":"Jonathan Pageau","text":"Donald, thank you so much for your time and for, let's say, accepting my freaky questions to try to understand your thinking. I really appreciate it."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":4360.66,"end":4363.62,"speaker":"Don Hoffman","text":"My pleasure. And my apologies for my amateur theology."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":4364.98,"end":4370.74,"speaker":"Jonathan Pageau","text":"I have no sense of the science. I think your theology is better than my science. So thank you so much."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":4370.82,"end":4372.34,"speaker":"Don Hoffman","text":"Thank you very much, Jonathan. Okay."}
{"episode_id":"SW - #245 - 2022-08-03 - Prof. Donald Hoffman - Proving Ancient Wisdom Through Mathematics","start":4372.98,"end":4435,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon, the Pageau videos as well and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
