{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":0.48,"end":13.6,"speaker":"Richard Rohlin","text":"There's got to be a way. And I know you've done videos about this, but I'll just say there's got to be a way to both love your ancestors and also be honest about their sins. Yeah, there's got to be a way to do that. And right now it seems like we can only do one or the other."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":13.76,"end":111.8,"speaker":"Jonathan Pageau","text":"That's actually a function of idolatry. It's an image of idolatry. Because one of the things that happens is that because we don't have the fractal relationship, because we don't have this hierarchy that leads all the way up to God, we actually expect of these lower rungs to be perfect. And if they're not perfect, we hate them because they're not perfect. And so there's a sense in which, if things were properly laid out and we don't treat these figures as idols, to worship them or to cast them down, either way that we. We see them as just manifestations that are gray because they're not God. You know that all these leaders, all these heroes have dark sides. Obviously there's no way around that. Then we could celebrate their heroism and also recognize their sins. This is Jonathan Peugeot. Welcome to the symbolic world. Hello, everyone. I am very excited, as usual, to be here with Richard Rowland for the continuation of our universal History series. This time we're actually going to look at the idea of national epics and the way in which different nations would tell their own story, how in some ways they tried to pop out and to have their own particular vision, but then also how that ultimately still fits into the idea of universal history. So I'm excited to go along with this. So, Richard, it's good for you to be here."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":112.17,"end":159.87,"speaker":"Richard Rohlin","text":"Thank you. Before we get started, I will say more about this at the end because it is cleverly related to our topic today. But graceful segues abound in this in today's episode. But we have a. I have a Kickstarter going. It should basically already be live when this video drops or within a day or two. So there'll be a link down below. It's to a tabletop role playing game called Role Playing in the World Under Starlight. If you want to know what the World Under Starlight is and why we're doing it as a role playing game, not some other medium. I'm going to answer those questions at the end of the video. It's funny when Jonathan, when you posted my. We shared the Kickstarter, like the landing page, you know, like a couple of people in the comments like on YouTube or whatever were like, you know, Christian shouldn't be, you know, role playing game."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":159.87,"end":162.79,"speaker":"Jonathan Pageau","text":"Playing games and all. Dungeons and Dragons is satanic."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":162.87,"end":214.47,"speaker":"Richard Rohlin","text":"I know. Yeah, right. Well, so anyway, I'm going to talk about, I'm going to talk about actually very soon I'll be doing a video with Father Deacon Nicholas Kotar who where we'll be talking about that question specifically. So I'll say more about that project at the end because it's kind of related to the topic of today's video. But yeah, so part of the reason I wanted to talk about this is because I have recently met a bunch of like symbolic world folks in the wild. Sometimes unexpectedly, you know, usually they just show up at my church, shout out to Samuel, if you're listening, Samuel, who came to vespers on Wednesday night. And he's like, wait, what are you doing here? Well, this is my church. What are you doing here? But you know, but no, it was, it was great. But so I've been talking to some people who are kind of new to the symbolic world and the universal history train. And so I thought it would be useful because we've been doing these videos for almost two years now, I think."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":214.47,"end":214.95,"speaker":"Jonathan Pageau","text":"Crazy."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":215.11,"end":217.59,"speaker":"Richard Rohlin","text":"Yeah, maybe actually two years. I'm not even sure anymore."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":217.59,"end":218.07,"speaker":"Jonathan Pageau","text":"Amazing."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":218.23,"end":246.8,"speaker":"Richard Rohlin","text":"We've been, we've been doing them for a while so I thought it might be useful to revisit a little bit and maybe kind of put in some new terminology what we mean by universal history. Because one of the things that I've noticed in my conversations with people online and in person is that sometimes people sort of get a little confused about what we mean by medieval universal history and will mistake it for things that look similar but maybe have completely different goals. So that's where we're going to start."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":246.88,"end":247.6,"speaker":"Jonathan Pageau","text":"Go for it."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":247.68,"end":261.28,"speaker":"Richard Rohlin","text":"So the symbolic medieval universal history is, let's say it's a combination of the, what let's call the Christian mythic content. And by mythic, obviously I think everybody should know by now I do not mean false."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":261.68,"end":262,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":262,"end":315.24,"speaker":"Richard Rohlin","text":"But Christian mythic content in the, in the sense that it's a myth that we live into a sacred story, etc. So there's a Christian mythic content which is obviously the Bible. It's also the apocrypha, by which I mean the actual apocrypha, not the director's cut of the Bible. And then it's also like the lives of the saints and then all the squiggly folklore, traditions, weird stuff, you know, dog headed saints and the head of St. John the Baptist, flying around haunting people. We were just talking about before the recording started, like stuff like that, like all that stuff that's kind of out there more in the margins of the tradition. That's all kind of part of this Christian mythic content. Yeah. So it's that plus the mythical content of Greece and Rome and specifically the great classical epics, the Homeric epics and the Aeneid. Like if you want to really drill down to the core of that. Yeah."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":315.24,"end":329.32,"speaker":"Jonathan Pageau","text":"And there's a little bit of foray into more local mythic traditions, I'd say like Scandinavian traditions, but the Greek and Roman mythological always ends up being connected in some way, even to those Scandinavian traditions. Yeah."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":329.32,"end":352.46,"speaker":"Richard Rohlin","text":"So I'll get to the more local stuff here in just a sec because that's the next part. This. Right. So. But this is the. This stuff together, Right. Becomes the. I've been thinking about it like in terms of hierarchy, but it's almost like when you, when you hear me say hierarchy in this instance, it is better to understand it as like a series of like nesting dolls rather than like something that's really top heavy and like an upside down pyramid or something like that. Right?"}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":352.54,"end":365.51,"speaker":"Jonathan Pageau","text":"Yeah, it's a fractal. Like it's the best example of a fractal. It's like little identities exist in larger identities and connect, you know, vertically up to. Into the biblical narrative, you could say."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":365.59,"end":474.37,"speaker":"Richard Rohlin","text":"Right. And so this container of the Christian mythical content plus Greco Roman civilizations mythical content, the container of those two things together becomes a container which is like large enough and sort of robust enough to then contain this multi tiered hierarchical identity within it. So this is, this is so identity in the ancient world, unlike the way most of us think about identity today. Talk more about that later. Is it's hierarchical, that is it's conveyed from the top down or from the outside in. Right. If you're thinking about nesting dolls and it begins with God and it ends with me. So you have God. Right. And then you have the sort of like the, the almost parallel streams. And I realize there's a whole very long running historical debate about who has priority the Pope or the emperor or whatever. Or if you're in the east, you've got the patriarch and the emperor, but in any case, you know, you've got God and then you've got the Pope or the patriarch and the emperor, and then down from there you have these various increasingly localized principalities. So if you're talking about the Church, then you've got under the Patriarch. You've got, like, there's the holy, you know, your local bishop and then your local bishop. There's the priest that he's basically deputized to act on his behalf, like, all the way down to you. And then if you're talking about that on a national level, I mean, it's not for nothing that the original, like, diocesan structure, like a diocese, is a. Is a Roman imperial, like, division of geography. And people like. So, like, the original, like, metropolitan diocesan structure of the church in the early centuries was basically they just used what the Roman Empire kind of already had in place. Right. So that you would have these increasingly local nested identities that are basically parallel."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":474.69,"end":504.42,"speaker":"Jonathan Pageau","text":"Yeah. It's important because, you know, when a lot of modern historians, when they notice the gestures, for example, that some local, what they would call a warlord makes towards the emperor who is like, so far away, and they have nothing to do with. They tend to dismiss that as just irrelevant and just. And just, you know, just words. But if you understand the way that people saw identity, then you can see that, no, this gesture is very relevant to how they anchor everything together and make every. And make everything make sense in their world."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":504.74,"end":600.63,"speaker":"Richard Rohlin","text":"Yes. So in the way that, that worked for, like, worldly power structures or ecclesiastical power structures, it also works for stories. So at the, at the top or the outside, you have this. Oh, and the other thing to say about that, you know, social, ecclesiastical hierarchy, is that there are holy people. A good example would be like your local patron saint, Right. Holy people sort of exist outside or kind of bridge the hierarchy in unexpected ways. So if you live in a small medieval village in Central Europe or something like this, you know, you've got the emperor and the patriarch and everything way up here, way up above you. But then, like, there's also your local patron saint. Maybe it's Saint Nicholas. Right. So, like, if things are. If things are really getting out of hand, you have a. A path of, like, appeal, let's say, right? You can. You can go to St. Nicholas and he can go around. I mean, you know, he can go around the Pope or the patriarch or the. Or the emperor or whatever and to kind of like, help you out in your situation. So you've got holy people. And of course, the problem with. Problem with modern people trying to understand this is we all want to be the person who's outside the hierarchy, Right. And it doesn't, you know, but it's. But it's really just the holy people. And when I say holy, really hear that, not just in a sense of this is a good person or a nice person, but that in the sense that this person is sanctified or set apart because there's also such a sort of a thing as let's say like the secular holy person, which I'll come back to in a minute. Right. So anyway, secular in the holy person in the sense that somebody's like a secular, but they're, that they're set apart and because they're set apart they're also sort of operating outside the normal hierarchy of things."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":600.79,"end":609.83,"speaker":"Jonathan Pageau","text":"So it's, in some ways there are ways in which the hierarchies, these are, how can I say it? Like in terms of a system, it's like fail safes in the hierarchy."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":610.14,"end":610.94,"speaker":"Richard Rohlin","text":"Yes, yes, yes."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":611.02,"end":628.54,"speaker":"Jonathan Pageau","text":"That's the way to, I mean it's not, it's not as simple as that, but it's a good way for people to understand why the hierarchies are never, even, even when we talk about hierarchy, they're never just this simple top down thing. They have a kind of variability and, and ways to, to shortcut when things go wrong along the, along the hierarchy itself."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":629.02,"end":742.88,"speaker":"Richard Rohlin","text":"So before we started talking about, before we started the recording, we were talking about the Arthurian stories a little bit and the like, but the, the Knight Errant is a good example of that kind of a person in, in that sort of story, right? Because they, they have this role that puts them outside the normal hierarchy. So they show up in like a baron's district and the baron is evil and he's awful and he's oppressing people and it's like, well, where's the king? Why doesn't the king know about what's going on? But, but actually the Knight Errant, he has like a, he has a pipeline to the king, right? So he's here from the Round Table, he's here from the king's court and he sets things right. And then he goes back, right, he goes back to the court when it's over. So anyway, that's, that's an example of that kind of thing. So if this is true for like you could say social, ecclesiastical hierarchies, it's also true for the hierarchy of stories when we're talking about universal history. So we start with this kind of one grand foundational story which is sort of mythic, the mythic content of Christianity plus Rome, right? That's the ground foundational story into which you have these increasingly localized identity conferring patterns. The story of. Well now here's what, here's the story of My people when we converted. And then beyond that, you might have. Here's the story of my city or my village. And beyond that you have, you have like, here's my family history all the way down to this is how my parents raised me and all of that stuff. And of course, what I'm really describing is the idea of tradition. Yeah, right. All of that stuff confers identity at all these different levels, but it has the capability to kind of each of those levels to be nested. And obviously, obviously, there are certainly places that converted. I mean, this is why we actually kind of started the series with Ethiopia. Right. Is because there are places that converted that were outside the Roman Empire. So in that case, they're, they're actually like the best proof case for like, how this works. Because not like they had any like, political, you know."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":742.88,"end":756.88,"speaker":"Jonathan Pageau","text":"Yeah. They had no political reason to play this game at all. Or the Armenians for the. In the same way. Another great example had no exam, no reason, because people always say that it's just Constantine and Rome. And we have several case examples where that seems to not be the case."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":757.04,"end":777.84,"speaker":"Richard Rohlin","text":"Right, right, right, right. So. So, yeah, so any of these identity conferring stories can be aggregates or a pastiche. And actually this is better. And this is another thing that, to kind of point out, this is why for purposes of what we're doing here, I'm deeply uninterested in questions like authorship."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":777.84,"end":778.32,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":778.72,"end":854.52,"speaker":"Richard Rohlin","text":"Doesn't actually matter. Right. And the reason it doesn't matter is because certain kinds of things, not everything, but certain kinds of things actually have more authority when either we don't know who wrote them or, or, or made them, or when the person who wrote or made them is. It has become a mythic person in some way. Right. So to give some, some examples of this, actually a really good example of this is the Divine Liturgy and the, the divine services in the Orthodox Church. Yeah, right. There was no committee that at any point in time sat down and said, here's the way we're going to do things. And there is not, there's not a regulatory body across all the Orthodox churches in the world that says, all right, everybody, we're making this change to liturgy this year. Right. It's not how it works. You can dig down into the history and I've done this. And there are lots of people out there who have done this. You can dig down in the history and figure out, oh, this part appeared here. Yeah. Or this prayer we, this prayer maybe came from Saint John of Damascus or, you know, like the The. But even then, that's a saint. That's a holy person, that somebody who's become a mythic person. Right. But it's actually, because it wasn't just created by committee, that it has the kind of the weight and the authority and the sense that you can't just do whatever you want with it. Right."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":854.6,"end":856.2,"speaker":"Jonathan Pageau","text":"That it comes down from heaven."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":856.68,"end":865.8,"speaker":"Richard Rohlin","text":"Right? Yeah, it comes down from heaven. Right. That's the. That's. But when we say something like that, that's what we mean. We don't mean that like the typical one dropped out of the sky, it."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":865.8,"end":867.8,"speaker":"Jonathan Pageau","text":"Landed on someone's head somewhere on somebody's."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":867.88,"end":878.12,"speaker":"Richard Rohlin","text":"You know, what a silly image. But, yeah, we don't mean that. But what we mean is that this is. This is really passed down through the life of the church. Right. As opposed to."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":878.45,"end":883.33,"speaker":"Jonathan Pageau","text":"It appears like it appears in. So. Because it's the same with some of these icons not made with hands. You know, people."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":883.33,"end":884.29,"speaker":"Richard Rohlin","text":"Yeah, yeah, yeah, yeah."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":884.29,"end":918.99,"speaker":"Jonathan Pageau","text":"There's a way in which the idea that the icon not made with hands was never made by anybody. I understand. I don't want to be. I want to be careful. Right. It's like the idea that these icons appear. They kind of appear out of nowhere. They find them in the water. They. They find them somewhere, and they. They're kind of not. They're just. They just happen. And we don't know who made them. We don't know where they come from. But there's always. There always is like, material causes if you make. Spend a lot of. Try to dig into them, and that's not how we receive them. So that's why we kind of see them as this pattern kind of descending from above and manifesting itself in the world."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":919.47,"end":1004.45,"speaker":"Richard Rohlin","text":"That's a great example of this because. Yeah, there are some icons that. That, you know, we do believe when we say they're not made with hands. Maybe, you know, what we're really saying is, you know, there's something miraculous about the creation of this icon. Right. The. The. The icon not made with hands. Right. The one that Christ, you know, made of himself. Right. That's the. That's like the ultimate example. Right. But the. But yeah, when it comes to some of these icons, especially of the Mother of God, you know, where this icon appears in the field. Right. The curse root icon, I think, is a good example of this. There's another icon. I can't remember the name of it now, but I. I got to venerate it. When I was in Lithuania, it was this tiny little sort of Russian village church and really large icon, very beautiful. And it just sort of. They found it in a field one day. Where did this come from? How did it get here? Right. And so. So it's an icon not made with hands. Not because. Not because anybody there is saying, nobody ever painted this or touched this, but it's just sort of. It was just received. Right. It just came from heaven in that sense. Right. So, yeah, typically speaking for these things, like, they have to have some kind of a mythic authority. Right. This is why, I mean, all the way down on a fractal level, this is why sometimes when your parents tell you something, you won't listen because, you know your parents. Right. But then some other adult who you do not know as well, they tell you the same thing, and suddenly it's got cachet. Yeah, yeah, right. But I mean, this is actually why."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":1004.61,"end":1010.05,"speaker":"Jonathan Pageau","text":"It'S the Jordan Peterson clean your room. It's like, why is it that. Right, right. Everybody thinks it's genius."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":1010.13,"end":1044.92,"speaker":"Richard Rohlin","text":"It's a perfect example. Perfect example. But. But I mean, I mean, for instance, this is why it's actually, you know, better if you don't know what shenanigans the pope or whatever, bishop or like, whatever patriarch so and so is up to. Like, it's better if you don't know those things, actually, because it, you know, because the. The mythic, let's say, like the mythic distance, that's actually part of the way the hierarchy is supposed to work. Yeah. Right. And of course, this inverts ultimately at the moment of communion when. When everything gets, you know, collapsed into the single point. But. But just as like a normal way of operating through your life. Yeah. It's better if you don't know."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":1045.48,"end":1082.88,"speaker":"Jonathan Pageau","text":"I want to say something about this, the hierarchy of stories, too, that's important for people to understand is that this, again, is one of the problems of our thinking is that we tend to confuse quality and quantity in the way that we see things. And so when a lot of modern historians look at these. These original histories, they'll notice that there's, like I said, there's a gesture at the outset which says something like, you know, we're connected to this son of Noah, this related relation to the Trojan War or whatever. And then they'll go into their natural history and spend a lot of time on it. And so they'll tend to dismiss first part and say, well, what's really important is this."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":1083.2,"end":1083.68,"speaker":"Richard Rohlin","text":"Yes."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":1083.76,"end":1102.64,"speaker":"Jonathan Pageau","text":"Just because it's one sentence or one page or one paragraph doesn't mean that for the People who wrote it. It isn't primordially important to be connected in this way that it wasn't. Like, the reason why they even wrote their national story is based in this first little part that you dismissed and you don't. You don't think is important."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":1103.12,"end":1229.56,"speaker":"Richard Rohlin","text":"This is such an important point that you're making here because I've had conversations with, like, old Norse scholars and stuff, you know, about the. What's sometimes called the Younger Edda or the Prose Edda, which is. We'll get to it eventually. But it's basically, it was like, this is where, like most. Most of the stories from Norse mythology probably come from this text. But the text itself is a. It was a manual for poets written by a Christian man named Snorri Sturluson, right in the, you know, 14th century, I think. 14th, 15th, somewhere in there, anyway, long time after paganism had already died out. And he's writing these stories down because Norse poetry requires the use of what are called kennings, which are nested references, and sometimes they go several levels down. So if you don't know the story that's being referenced by the story that's being referenced by the story, then you won't know how to use this in your skaldic verse. And so poetry as an art form was kind of dying out. And so Snorri tries to basically gather all the old stories. And I strongly suspect when he didn't actually know the story, he just made something up that sounded good to him. But anyway, nothing against him. It's just like some of that. Some of the stuff in there is, I think, a little questionable. If you wanted to really convince me that a 7th century Baltic pagan actually believed, like, this is what they thought about Thor or something. But anyway. But the point being. Point being that. So he writes it for that, but then he begins it with this very. Actually quite. Quite a long chapter which connects it to the Christian story and connects it to Rome, where you find out that all the Norse gods, they're actually refuges from the Trojan War, and they were actually famous men at one point, and powerful wizards and all this other stuff. Right? But when I. When I've talked to Norse scholars, like scholars of old Norse literature about this, you know, I'll mention something like, well, the Prosetta, you know, it's got. It's. It's got these features to it, and it's, you know, it's actually from a Christian perspective because of this stuff. And. And they'll look at me like, you're Crazy. I'm like, well, what about the beginning, though? And then they'll say, oh, well, we don't count. That. That doesn't count. That's not, you know, like, that's. He just had to do that so that the church wouldn't, you know, as though."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":1229.88,"end":1230.36,"speaker":"Jonathan Pageau","text":"As though."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":1230.36,"end":1282.79,"speaker":"Richard Rohlin","text":"As though nobody in Christianity, like, had ever, you know, told a story before. Like, you know, and so it's just I. I have a hard time even articulating how much this sort of thing irritates me. So, yeah, those. Those little bits. There's like, the little proem at the beginning of Sir Gawain and the Green Knight, which connects the whole establishment of the kingdom of Britain, of which Arthur is now king, connects it to Brutus and the fall of Troy and all of this stuff that was actually deeply important to understanding what the Arthurian story was even about. So much so that that particular Brutus gives his name to some of the early Arthurian poems, Lyamon's Brut, for example. But without that context, the story wouldn't have been the same to them. But of course, no, the stories are actually about, you know, feminism and power struggles and, like, all this other stuff, and so just."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":1283.19,"end":1285.03,"speaker":"Jonathan Pageau","text":"That's way more convincing, right?"}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":1285.19,"end":1347.75,"speaker":"Richard Rohlin","text":"Yeah, yeah, yeah. Right, right, right, right. I'm actually probably just still irritated about the Sir Gawain and the Green Knight film that came out a couple years ago. Still pretty salty about that, but anyway. Okay, so the other thing to mention when we're talking about these. These kind of nested hierarchies of stories, which is really what I mean by medieval universal history. Right. Is. Is that folklore has the same kind of function as, like, your local patron saint, as folklore is something that kind of is able to jump outside or, like, buttress the hierarchy kind of from the outside. And so folklore will often just, like, bring two things together that don't really, like, you know, these two people could not have lived at the same time, or these, you know, this, you know, well, this obviously happened here or not here or something like that. But folklore can collapse those distinctions in a way that supports the symbolic structure of the hierarchy. Yeah. In the same way that your patron saint can, like, collapse the distance between you and the emperor or whatever. So. Yeah, yeah."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":1347.75,"end":1357.23,"speaker":"Jonathan Pageau","text":"Well, I mean, you see that even in hagiography. What is it? You know, you can do it with saints because they can kind of come back from heaven and do things. You know, what is it?"}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":1357.23,"end":1357.71,"speaker":"Richard Rohlin","text":"Yeah, yeah."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":1357.71,"end":1362.99,"speaker":"Jonathan Pageau","text":"Julian, the apostle. I forget that. Is it Saint Demetrius? Who is the. Who's the emperor."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":1362.99,"end":1364.07,"speaker":"Richard Rohlin","text":"Oh, oh."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":1364.07,"end":1365.71,"speaker":"Jonathan Pageau","text":"It's like during his life. Right?"}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":1365.71,"end":1370.15,"speaker":"Richard Rohlin","text":"It's like after his life, you know, God forbid. I can't remember right now."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":1370.15,"end":1370.79,"speaker":"Jonathan Pageau","text":"I know, me too."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":1370.79,"end":1371.23,"speaker":"Richard Rohlin","text":"It's horrible."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":1371.23,"end":1379.35,"speaker":"Jonathan Pageau","text":"But they say Demetrios is shown in an icon killing a king, like killing. And it's not during his life. It's like, you know, after I think of."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":1379.35,"end":1511.68,"speaker":"Richard Rohlin","text":"I'll think of what saying it is probably like before the end of the video. But yes. Yeah. So the ground grand foundational story of the Christian world is the Gospel, you could say, especially the story that's from Genesis to Acts and then the Apocalypse. Right. But especially the grand foundational story of the Christian world is the Passion and the resurrection of Christ. And this is why in traditional Christianity there's so much emphasis placed on Holy Week or Passion Week and on Easter or Pascha. I mean, if you want to, if you want to get like irrationally irritated at English language Christianity. A great book to read is a book by an English historian. I've talked about it before on the show, but an English historian named Eamon Duffy, and he wrote this. He wrote a bunch of great books about prayer in the Middle Ages, but he has a fantastic book called the Stripping of the Altars. And there's a long chapter in this book on basically how they celebrated Pascha or the Easter vigil in England before the Reformation. And just like your average parish church. And it's so. It's so Orthodox. Like, it's so. It's so similar to the way that orthodox Christians are used to celebrating Pasco or Easter today. And like. And you just sort of realize, oh, no, we had this at one point and it was all stripped away from us. It took me a while to get over that, to be totally honest with you. Right. But so then after this, you have a wide range of stories like we're talking about with increasing locality that nest the local and the specific within the universalizing and the cosmic. So in our universal history series, we've been mainly focused on these kinds of stories. This is what we've been mainly looking at. Right. How did people groups, as they converted, nest their identity within the Christian and within the Roman story, even when they themselves maybe fell outside of the empire? And just to. To emphasize again before we get into the next section, is that these identities, they. They stack or they nest? And if you don't understand this, then you will make the mistake which, as I'm going to try to argue, is basically the mistake of 19th and 20th century nationalism, which is to create Something that's very top heavy, where it's more about, here's the narrative that actually has to control and oppress everything beneath it rather than serve as a container for it."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":1511.92,"end":1576.02,"speaker":"Jonathan Pageau","text":"Yeah, that's really important. And that's when you can see, I mean, in general, that's when you can see how when any identity goes wrong is when it doesn't respect the normal nesting of identities that are below it, right? It's like as a, let's say a family, a father, it's like, okay, the father is the head of the family, but the father is the head of the family in the way that is there to make his children and his wife be fruitful and succeed and be themselves. Right. And have their own lives ultimately. And so that's the way that all identities should function. And that's the way God functions, and that's the way that all identities should function. That's why people are. When we talk about nationalism, they become very tense because they always think that all that means is like you said, the way that the Third Reich presented their nationalism as this completely identity that takes over. But it's not just the Third Reich, like Napoleon and a lot of modern national identity had that feature, but it was not a feature of ancient thinking."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":1576.26,"end":1691.89,"speaker":"Richard Rohlin","text":"Yeah, I think a much overlooked vision in scripture is Nebuchadnezzar's like, first dream, right? The one, I think it's his first one, but the one of the tree, right? So he has the, Everybody remembers like the vision of like the statue being destroyed by the, the, you know, the stone cut out of the. Cut out of the mountain, you know. But in his vision of the tree, right? It's the idea of the tree. And of course, the tree is the king. The tree is, is this beautiful tree. It gives shade to the plants beneath it. And also the birds of the air come and nest in its branches. The wild beasts kind of gather around it. But that's what the king is supposed to be. And you could say that that's what, whatever your, your story that gives identity. That's what it is supposed to be, right? It's supposed to be this tree that, you know, the birds of the air, these various principalities, and the beasts of the field, which are, you know, the things that are lower down, right. They can come and still they can find shelter and shade and protection. And of course, in his dream, ultimately because of his pride, the tree gets cut down. But the point is that this is what the king, or you could say the grand story, like whatever it is that's how it's supposed to function. And obviously this didn't always function perfectly, but it functions surprisingly well, let's just say, right? Even when you have somebody like the Pope saying, I think it's maybe the fifth century saying, okay, nobody in the west is allowed to read the Book of Enoch anymore, you know, but then there were still places on the, you know, the outer branches of, of the west, you know, in, in Scotland and Ireland and the British Isles particularly, where, where people kept all of these things, right. They sort of kept them, they still remembered them and it was still part of, again, not just like a book at a monastery, but, you know, teaching from Enoch, teaching from the apocryphal books was actually a major part of parish life in Anglo Saxon England. Right. And so there's, there was space. Even when you, when you had somebody who tried to totalize things in some way, there was space for this stuff to kind of fit in."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":1691.97,"end":1730.11,"speaker":"Jonathan Pageau","text":"Yeah. And one of the reasons why, that's why it's hard for us to think that way is that because we live in a technocratic society, we confuse authority with power. We have the capacity now for authorities to have indefinite power. And so when, when the president or whatever, when the authorities say something, they can implement it completely into. Whereas in an ancient world that wasn't the case. You know, the Pope can be in Rome saying whatever he's saying and it's going to have influence, but it's not. He doesn't have the means to enforce it all through Christendom. And so there's always this organic variability that installs itself just naturally by just normal human mechanisms."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":1730.59,"end":1785.62,"speaker":"Richard Rohlin","text":"So, yeah, along comes the Protestant Reformation. Right. And the result of the Reformation, it has to be remembered that the Reformation took place in Germany. Right. It was primarily at, in its beginning is primarily a German religious movement. Right. Obviously it gives France and Switzerland and England other places, but originally it's primarily a German religious movement, except that the Reformation didn't take place in Germany because Germany did not exist. Germany is a made up country. Fake news, everybody. No, Germany's a made up country right there. If you look at a medieval map, there's no Germany on that map. No, nobody who lived in the place that we call Germany now would have called themselves Germans. Actually, they still don't call themselves Germans. But a really fun game is actually what's the name of German in other languages? And like every, what's, what do you call, what do you guys call it in French?"}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":1785.86,"end":1786.66,"speaker":"Jonathan Pageau","text":"Alma."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":1786.98,"end":1791.26,"speaker":"Richard Rohlin","text":"Yeah, right, right. Because like the, all the main Region. Right, right."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":1791.26,"end":1791.62,"speaker":"Jonathan Pageau","text":"So."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":1791.62,"end":1862.79,"speaker":"Richard Rohlin","text":"So it's. Yeah. Nobody who lived there called themselves Germans. Right. But Germany is a modern construct. Yeah. But the way that it was built, the story sort of begins in the Protestant Reformation. I don't have, like, a ton of time to go into this, but let's say that as a result of the Protestant Reformation, we got something called the 30 years war in Western Europe, which is one of the bloodiest periods in Western Europe, actually. Not. Not the Middle Ages. Right. But. But this is. This is now in the modern period. 30 years were incredibly bloody struggle between Roman Catholics and Protestants over basically a very small slice of. A very small slice of Western Europe. And the result. The end result of the 30 years war is something called the Treaty of Westphalia. And one of the things that comes about as a result of that treaty is that they decide, okay, your religion will be determined simply by whatever principality you live in. So if you live in this little province, and some of these are quite small, basically the size of what in Texas would be a county. I don't know. Do you guys. Do you guys call them parishes or counties or, like, what's your. What's the. What's the unit in Canada, beyond the city?"}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":1863.75,"end":1868.47,"speaker":"Jonathan Pageau","text":"Yeah, we do have. We do have something like that. I forget what they're called."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":1868.95,"end":1939,"speaker":"Richard Rohlin","text":"Okay. Yeah, yeah, yeah. County. Yeah. Yeah. So. But basically these very small principalities, and your religion, if you lived there, would just be whatever the official. Whatever the religion of. And so what happened was that instead of. Instead of the identity conferred by the Christian story being kind of the. At the very outside level is that it collapsed down actually several levels into the hierarchy. And so it goes from being. Here's a universalizing story of passion week in Pascha, right. Of Rome and Greece, of the Trojan War and, you know, St. John the Baptist. Right. All these things like, this is our universalizing story that kind of is the container that holds everything together, and now that collapses actually several rungs down the ladder right to now. It's actually secondary to your political identity. Now, once you kind of understand when that happened and how that happened, you can then understand how it's actually a pretty short trip to go from there to now. My religious identity or my spiritual identity or whatever is something that I confer upon myself now."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":1939,"end":1940,"speaker":"Jonathan Pageau","text":"Personal. Personal."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":1940.24,"end":2153.51,"speaker":"Richard Rohlin","text":"Right. Yeah, But. But also, like. But isn't that also, like, political identity also has collapsed down to that level now? Yeah, so you're. You can freely associate with whatever political party you want, at least in some parts of the world. But, you know, talking to the United States, you can freely associate with whatever political party you want, and everything about your identity has collapsed down to the level of the self. Of the self. So when all of this is going on, though, and before it kind of gets all the way down to that level in the. Primarily in 18th and 19th century Europe, you have the emerging of what is sometimes called the search for the national epic. Yeah. So why do we need the national epic? Because we're not part of an empire anymore, Holy Roman or otherwise. We're not part of an empire anymore, and we are not part of. And we're not even part of the same religion anymore. Right. It's. I mean, and listen, nowadays, Protestants, Roman Catholics, Orthodox, like, we can go out together and we can have a beer and we can talk about our differences and all these different things. Nobody stabs anybody. And that's great. I love that. Don't get me wrong. But if you think for a moment that somebody, you know, in the 30 years war believed that, oh, the Roman Catholic over there and. And me, we're the same religion, basically, and we're just quibbling over a few small differences. Like, this is not how people thought. Yeah, yeah. They weren't killing each other over small differences, let's say. So anyway, so you don't. You're not held together by the same religion anymore, and you're not even held together by, like, the sort of, like the imperial story. Right. And so now what we need to do is to try to find some other narrative that can collect and hold our identity together. And this is why there's the search for the national epic. So something a lot of people don't know. You're, of course, aware of Jakob and Wilhelm Grimm. The Brothers Grimm. Right. And they're famous for a bunch of fairy tales which they did not write. The fairy tales that we know as, like the fairy tales of the Brothers Grimm, they were edited mainly by Wilhelm. But they didn't write those stories. Yeah. What they did was they went around collecting all the oldest stories, like the. The children's stories is what they would have called them, but they went around just like, correcting all the old wives stories and all the old children's stories and things like this from these. These tiny little idiosyncratic, you know, valleys in different places in what is now Germany. And they're collecting. They're collecting these stories because the oldest stories preserve the oldest words. And Jakob Grimm is a philologist. He's interested in really old words. And so his two great works that he composed were the largest and most comprehensive dictionary of the German language which has ever been created. And then also the. An accompanying volume. Sometimes it's called Teutonic Mythology or German Mythology or something like that. It's got its own name in German, which I won't try to pronounce here, since we're on the Internet. But anyway, you've got these two massive volumes. One is this is the German language, and the other is this is German mythology. And they're both fascinating works. His Tutong Mythology is, let's say, has a lot of problems from the perspective of modern scholarship, because once again, there were a bunch of gaps and he just tried to fill the gaps in by guesswork, essentially. And then. But the fairy tales were, you know, basically he was sending his grad students out because grad students are the. The mindless minions of the academic world."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":2153.74,"end":2153.9,"speaker":"Jonathan Pageau","text":"So."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":2153.97,"end":2183.82,"speaker":"Richard Rohlin","text":"So he would send his grad students out to basically collect these stories and then later they edited them together in a volume, and that turned out to be much more popular and, let's say, more enduring than the other two works. But what a lot of people don't know is that following the German revolution, sometimes it's called the March Revolution. When the national assembly of the German people is like the first German parliament came together. Jakob Grimm had a seat. It wasn't just a seat in the parliament, but it was like a special chair."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":2184.06,"end":2184.7,"speaker":"Jonathan Pageau","text":"Oh, really?"}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":2185.26,"end":2261.09,"speaker":"Richard Rohlin","text":"And he had a vote and everything else, and he got disenchanted with politics. It didn't really last. But the reason that they gave him this spot in the very first German parliament ever was because he was the great German philologist. He was the great German, you could say storyteller in that he was telling by collecting all these old stories and trying to package them and arrange them, what he's actually doing is creating an identity that is German. Yeah. An identity that's based in. That's based in the language that you speak and who your ancestors were more than it is in what your religion is or where you live or those other things. And so one of the great questions of the time was, well, as the German state is being founded and there's lots of little revolutions and different governing bodies and all these different things, it's difficult to track, even if you have it all laid out in front of you. But basically, one of the big questions that they're trying to answer is, what does it actually mean to be German? Right. It's not a religious question anymore. It's not, you know. You know, so, like, what does it mean to be German? And obviously, eventually attempts to answer that question are going to develop in some really kind of unhealthy ways. Yeah, yeah."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":2261.09,"end":2305.63,"speaker":"Jonathan Pageau","text":"In more nationalistic ways, the way we understand them now. Whereas the ancient world that, like, if there had been some kind of German identity, let's say in France, there was definitely more of a. Let's say a basic French identity, even though all the regions still. There was still that issue where all the region and, like, your French identity was basically that, you know, you're somehow related to the king of France. Like, that's where your French identity comes from. You know, you owe allegiance to the king, but then you probably don't speak French. You don't speak the same French that the king of France does. You speak some other local dialect or whatever. And. And you don't see that this allegiance to the king of France as this totalizing thing. Right. As this thing that it's like, I am French in the way even that the French would understand that today."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":2305.87,"end":2322.31,"speaker":"Richard Rohlin","text":"Yeah, yeah. I mean, that's the thing about nationalism, as opposed to, let's say, the older mode, is that your national identity is now much more totalizing to the point that it has the ability to actually obliterate the things beneath it."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":2323.03,"end":2358.09,"speaker":"Jonathan Pageau","text":"I mean, obviously, the French is a good example. When Napoleon took over, he basically imposed Parisian French on the rest of France to make it one language. He basically imposed an education system onto all the different regions. And you can see that during the Revolution, you can see that happening, happening. It's wild. You know, the local places that resist the revolution, you know, they get. They get slaughtered, and people just get slaughtered because they. There's this one thing, nation. Right. That's where even the idea is kind of born."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":2358.09,"end":2358.37,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":2358.37,"end":2362.37,"speaker":"Jonathan Pageau","text":"This idea of a citizen of a nation, the way that we understand it now."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":2362.77,"end":2370.93,"speaker":"Richard Rohlin","text":"Yeah. And it's a sort of a weird extension, you could say, of like, the really old classical idea of the city state."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":2371.34,"end":2371.58,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":2371.58,"end":2394.54,"speaker":"Richard Rohlin","text":"But now imposed across many cities and over a very large geographic area until you get to these places where you have the situation today where modern nation states are so impossibly large. I mean, this is part of why I keep demurring on, like, when we're going to do, like, what's the symbolism of America? Video. Right. Part of it is, is that, like, which America."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":2394.62,"end":2423.38,"speaker":"Jonathan Pageau","text":"Yeah, like, well, don't you think that one of the reasons for the success of America has been that it had. Had been, at least for a while, had been able to kind of recast that multiplicity? Right. A sense in which there were local traditions, local places, you know, people, people in different regions just have different ways of living. And we kind of don't feel like the, like the centralized authority has the right or the capacity to impose ways of being, ways of thinking on, on the people in the local areas."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":2424.18,"end":2443.6,"speaker":"Richard Rohlin","text":"Yes, there, yes, there is a. I think that was part of a lot of the early genius of the American project and the two things that really challenged it and maybe broke it. Although we'll see. We're still, I mean we're a brand new country, so we'll see. But one is, one is the, the creation of the interstate highway system."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":2443.76,"end":2444.32,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":2444.32,"end":2494.42,"speaker":"Richard Rohlin","text":"You know, the ability, you know, which is very importantly. It's like, it's like now it's the artery, right? The, the arterial system that connects the country. But very importantly, like it's, it's owned and paid for by the centralized power, the federal government. Right. But then also, and also along with that, you know, kind of developing as well as the, is the, there's something in our Constitution called the interstate commerce clause which basically gives the federal government authority to regulate anything that might possibly touch interstate commerce. And I don't want to get like too much into like American constitutional stuff and politics, but you could just say that the kind of the brilliance of the great localized, you know, being able to recast that locality, like you just said, that started to break down when those two things and obviously airplanes have made things worse. But, but anyway, but it's interesting because."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":2494.42,"end":2530.26,"speaker":"Jonathan Pageau","text":"Here in Canada we can really see where that leads to, is that it actually leads to extremes in some ways. You know, here in Canada we're seeing the other extreme where as we know as the federal government becomes more powerful, it's creating this sense that, you know, diversity, only diversity, like we don't have an identity. This is, this has been. Now the, the, the way that the, the government is framing it is that Canada is a, is a nation list nation. Right. It's a post national nation. We don't. Our only value is openness. Like our only identity is diversity. And so it's almost this like weird collapse like this."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":2530.42,"end":2539.35,"speaker":"Richard Rohlin","text":"I like how you guys took, took the like the joke about Canadians being hyper apologetic for everything and just like, what if we turn that into an identity?"}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":2539.43,"end":2601.48,"speaker":"Jonathan Pageau","text":"Like what if we turn that into our own identity? And so, and it's interesting because in Quebec we have a weird fractal thing about that, which is that in Quebec they're trying to hold on to their identity, but they really think of it in terms of nation, like, really in terms of the French project, in terms of nation. And so it's all collapsing because they're trying to, like, impose language and impose identity over Quebec. But they also. But they don't feel it. It's not an organic thing. And so as they're including, they're like, you know, we have this massive immigration policy, including all these people, but they have to learn French and they have to. They have to kind of fit into this weird thing. It's like. Well, it's not. It's all not working. Like, there's something so inorganic about. About. About that. Let's say in the Roman Empire, you would have had, say, groups of barbarians that would come and maybe settle and they would negotiate with the local person and they would. They would let them settle. They would kind of. They would keep their identity, but they would also pay homage to the ro. It would be of way more organic, natural way. But. But it's almost impossible to do now."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":2601.64,"end":2602.88,"speaker":"Richard Rohlin","text":"Yeah, yeah."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":2602.88,"end":2605.48,"speaker":"Jonathan Pageau","text":"So who thought we would get into politics so much?"}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":2605.56,"end":2710.56,"speaker":"Richard Rohlin","text":"I know, I know. Well, I mean, it's my own fault for picking the subject, Right? Yeah. Because it's like, it's. It is kind of. Especially as you get closer and closer to modern times, it becomes more and more inherently political. So you have, as the old idea of the empire, Holy Roman or otherwise, right? As the old idea of the empire recedes as Christianity as a central unifying story, as that gets pushed more and more to the back burner, let's say, you know, as a result of the Enlightenment project and everything else, something has to step into that space to fill the void that says, like, well, okay, how do I know I'm Finnish, right? How do I. Like, what does it mean to be finished? Like, Finland has been part of the, you know, talking. Talking about the 19th century now, right? So Finland's been part of the Russian Empire for a long time, right? But. But, like, you know, nobody in Finland speaks, you know, like the same language that tsar speaks and everything. So, like, what would a Finnish identity. What would that look like? Yeah. Right. And so they're trying to figure that. Figure that out and answer that question. And because so much of the Enlightenment project looked back at a very. How do I say it? Literally, a very monochrome version of the classical period, right? I say literally monochrome because, you know, they go over to Greece or Rome or whatever, and they see, here's all these beautiful old white marble pillars and temples and things like this. And so they assume, oh, everything must have been like this, and it's so clean and it's so orderly and all this different stuff. And then for decades, for many decades, like when, whenever, whenever evidence would emerge that this statue or that these pillars had been painted. Like, I mean, we've gone to church with Greeks. Like, you can't tell me those people."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":2710.96,"end":2712.24,"speaker":"Jonathan Pageau","text":"Didn'T paint those statues."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":2712.4,"end":2894.92,"speaker":"Richard Rohlin","text":"Didn't paint those statues. Come on, come on. Right, but, but whenever evidence like this would surface, they would destroy it. Yeah, because it destroyed this sort of pristine, monochrome, hyper ordered vision that they had kind of created out of the classical period. In reality, it's nothing like that, but that's the vision that they kind of created for themselves. And I think it was so appealing because it basically offered a structured, ordered framework that was like, oh, look how pristine things were before it was touched by Christianity. And Christianity is what brought in all this awful color and texture and actually diversity into the classical project. And so anyway, so this is the way that, that they were thinking about it at this time. And so looking back at the classical period, they said, well, they had the Aeneid, they had the Iliad and the Odyssey. So if we're going to create a Finnish national identity, then what we need is a Finnish epic. And so I'm just using this as an example because it's probably my favorite from this period is there's a guy named Elias Lonnrott who went around and basically collected all the old Finnish songs about the, the, the sort of like the ancient heroes and the creation of the world. And you know, a lot of this stuff in folklore. Right. So he goes around and he collects the songs from all these people who, you know, can't read, they can't write, but they have hours and hours and hours of poetry just memorized off the top of their head. And he, he collects all that stuff together and then he synthesizes it into a single epic work called the Kalevala. Now there was never any such thing in like medieval Finland. It's a made up epic. It's made up of real parts, but it was created, it was synthesized, it's by the way, extremely dope, very beautiful. It's been like one of the most, I think actually especially in my young life, but even now, like one of the most influential pieces of poetry that I've ever read. So I do recommend it. It's awesome. And it, there were parts of it that also had a huge influence on a lot of Tolkien's development because it was really, I mean, it was just being translated to English when Tolkien was a kid. Oh, yeah, that was like. It was a big deal. But you've got other examples of. Of the search for the national epic. Beowulf is my favorite. The only reason we know about Beowulf, the only reason the manuscript isn't moldering somewhere in a library totally forgotten, is because when they found it, a lot of people started saying, oh, well, maybe this is. Maybe this is our national epic. And so they would say, oh, well, maybe Beowulf. Maybe it's started out the date with the Danes. Oh, it's the Danish national epic because a bunch of the characters in it are Danes. There's a Danish king in here. Right. And then the Germans said, no, it's a German national epic because it's written in Anglo Saxon, which is a West Germanic language, and so is German. So this is a German national epic. And not until like, almost a century later did the English come along and say, well, actually was written in. In English, so. But there are no English characters in the story. Right. So it's. It doesn't really qualify."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":2895.16,"end":2896.92,"speaker":"Jonathan Pageau","text":"There's not anybody complicated."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":2897.22,"end":2932.82,"speaker":"Richard Rohlin","text":"Yeah, it's just not a national epic. It, like, it doesn't fit the bill, but a lot of people wanted it to be. And so that's. That's how it kind of rose to prominence. Obviously you've got like, you know, the. Probably the actual German national epic, right. The Nibelungen lead that, like, which, you know, Wagner's whole Ring cycle is built off of that. The sagas of the Icelanders, which. Which all together, you know, for the Icelandic people, that's their Shakespeare. And obviously, you know, the Cid for, you know, people on the Iberian Peninsula. And I know at one point the Song of Roland. Roland was supposed to be the French national epic. Right."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":2933.06,"end":2940.38,"speaker":"Jonathan Pageau","text":"But it's such a. It's such a. It's such a strange story to be a national epic because it's a story of defeat. And it's like."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":2940.38,"end":2959.66,"speaker":"Richard Rohlin","text":"Well, defeat is. Okay, lost causes are actually some of the best, most successful national epics. But. But it's. I don't know, it just. It doesn't seem to fit the bill for what France is now. I was thinking about this earlier. Obviously you're closer to French culture than I am, but if I had to pick something that now is maybe like the great French national epic, it might be something like Les Mis."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":2959.66,"end":2970.18,"speaker":"Jonathan Pageau","text":"Yeah, that's what I. Exactly what I thought when you were. You were talking. Yeah. Because I would sort of guess in the revolutionary. In the revolutionary mode, it's something that seems to function as something like that."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":2970.18,"end":2973.9,"speaker":"Richard Rohlin","text":"And it's got the right kind of scale, but it's also like a deeply humane work in a lot of different ways."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":2973.9,"end":2978.7,"speaker":"Jonathan Pageau","text":"Yeah. And it's not as mythological because they are modern, a modern nation."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":2979.66,"end":3042.34,"speaker":"Richard Rohlin","text":"And then, of course, when it comes to the Celts, like the Scottish, Irish, Manx, Welsh, when it comes to Celtic people, you have so many national epics, it would be hard to even pick one. They're sort of the people that legitimately just had all the stuff right there for them. Because basically Celtic history is just an extremely long history of lost causes and heroes, like, all the way from, you know, ancient times and like, the. The Tain. All the way up to like, Bonnie Prince Charlie and all that stuff, which has, Which. Which has a. Like his whole story has this kind of mythic flavor to it, despite the fact it's happened, you know, relatively recently, historically speaking. So what all of these things have in common. Right. Is that there are things that for something to be really effective as a national epic, typically speaking, it's gotta belong to a mythic past. So this is part of why it's very difficult to speak of. Like what would be the American national epic, or I assume the Canadian national epic, though."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":3042.34,"end":3078.76,"speaker":"Jonathan Pageau","text":"Yeah. The thing with. About that is that the French Canadians have access to a national epic, but they basically don't want anything to do with it because it's so Catholic. Like the story of the early settlers who came and died and were kidnapped by natives and tortured and like, there's. It's a. It's a. It's really beautiful and intense and in some of the early, like Samuel de Champlain was a. Was an astounding character. It's just that he was so Catholic and so Christian that. That people don't talk. They just can't hold it in them to. To tell that story."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":3079,"end":3143.25,"speaker":"Richard Rohlin","text":"Oh, that's interesting. Yeah. I'd be really hard put to like to say, like, what's the national epic for America? But. But. But again, I think probably America's just too large. Like, you have to think of it in terms of regional epics and a lot of. A lot of our big regional stories, obviously a lot of the big regional stories of the American Southwest, also deeply Catholic stories. Yeah. And of course, American culture as a whole is extremely anti Catholic. There is, you know, the thing, you know, like, you can barely even talk about this on the Internet right now, but. Or even in, you know, polite company, but something like Gone with the Wind. Right. The film. Right. Is. Is very Very close to, like, something like a regional epic for the Deep South. Yeah. Which is not quite the region I live in, but it's pretty close. And obviously that is, you know, that story, you know, for good or for ill, it's got to be discarded now, you know, and obviously there are problems with it, but also. But also, you know, a lot of people found it to be a really beautiful and compelling story. So. But there is something like the Wild west, the Antebellum South."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":3143.33,"end":3152.49,"speaker":"Jonathan Pageau","text":"Yeah, the Wild west is. Has its. Has. Definitely has. Has its mythology. That is a real mythology. Yeah, Wild west is a real mythology. That's pretty powerful."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":3152.49,"end":3166.77,"speaker":"Richard Rohlin","text":"Yeah. So. So there is. There is something like mythological time. And what I'll be really interested to see is, you know, well, who knows what's going to happen, you know, the next two, 300 years, but, you know, a few hundred years on, like, what is. What. What's our. What's our mythical past going to be?"}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":3167.07,"end":3169.71,"speaker":"Jonathan Pageau","text":"It's great that you're hopeful that America will last that long."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":3170.11,"end":3173.07,"speaker":"Richard Rohlin","text":"I'm an extremely optimistic person. I don't know what to tell you."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":3173.87,"end":3177.87,"speaker":"Jonathan Pageau","text":"Sorry to be so. So there's so many crazy things are happening right now."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":3177.87,"end":3184.31,"speaker":"Richard Rohlin","text":"No, I mean, it's a. It's a wild, wacky time. Like, I have no idea what's going to happen, but I'm. I mean, I'm. I am a very optimistic person. So that's one thing."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":3184.31,"end":3226.17,"speaker":"Jonathan Pageau","text":"So let me ask you a question. So how do you see. So let's say now, you know, we're kind of thinking about this and this rediscovery of stories, rediscovery of legends. Do you think that there are ways for us to. Because there are. In these national epics are beautiful and powerful. But like you said, there are some ways in which, for example, Wagner is almost demonized because of the way that the Nazis use Wagner. But the mythical elements of the story are powerful and could be very useful today. Do you think there are ways that we can recapture, kind of rethread some of these elements together to. To maybe rediscover this more fractal relationship? You know, that. That used to be the ancient way of thinking."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":3226.33,"end":3303.4,"speaker":"Richard Rohlin","text":"I mean, yes, I think. And I. Not only do. I think it can be done, I think it's got to be done. Yeah. Because, I mean, there are a lot of great. Like, there's a whole genre of. Of novel called, like, the Southern Gothic novel. Right. That is. That's really built around the. The romance and the trauma of the Southern United States. Right. And Basically, it was just built out of people, like, trying to work through this stuff by telling stories about it. And I think that. I mean, Wagner's Ring Cycle, for instance, has already been extremely successfully retold in the Star wars franchise. Yeah. You know, like, the first three Star wars films are. Wagner. Right. It's, like, operatic in its scope. It's got the same, like, use of light and darkness. Everything else, the whole idea of. Of the son replacing the father. Right. The son has to kill the father in order to. In order to ascend. Right. That. That whole idea. Right. Super Wagnerian theme. So. But I think that. I think that, yes, these stories have to be retold, and we can retell them in a way where we're also kind of honest about, you know, there's got to be a way. And I know you've done videos about this, but I'll just say there's got to be a way to both love your ancestors and also be honest about their sins. Yeah, there's got to be a way to do that. And right now it seems like we can only do one or the other."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":3303.8,"end":3380.06,"speaker":"Jonathan Pageau","text":"But that's actually a function of idolatry. It's an image of idolatry. Because one of the things that happens is that because we don't have the fractal relationship, because we don't have this hierarchy that leads all the way up to God, we actually expect of these lower rungs to be perfect. And if they're not perfect, we hate them because they're not perfect. And so there's a sense in which, if things were properly laid out and we don't treat these figures as idols to worship them or to cast them down, either way that we. We see them as just manifestations that have. That are gray because they're not God, you know, that all these leaders, all these heroes have dark sides. Obviously. There's no. There's no way around that. Then we could celebrate their heroism and also recognize their sins. Like, you know, and. And in some ways, you know, I think that the idea to cover their sins to some extent in the sense that, you know, we want to emphasize the positive because we want them to be examples in their good things towards us. Like, you know, what's the point of. Of just pointing out all the evils of the people that came before you? What you want are examples, but if you can't find examples, then how can you get better? Like, how can you even live up to the beautiful aspects of what has been given to you?"}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":3380.06,"end":3386.64,"speaker":"Richard Rohlin","text":"Yeah. Yeah. I don't know, I'm trying to solve the world's problems right now, but."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":3386.72,"end":3391.44,"speaker":"Jonathan Pageau","text":"Well, we, we need to do it first of all by telling good stories. Like, that's how we do it, but."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":3391.44,"end":3399.6,"speaker":"Richard Rohlin","text":"That'S how, that's how this starts. So just a couple more things about the national epic, and then we'll all segue into. Into some telling good story stuff, hopefully."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":3399.6,"end":3400.16,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":3400.8,"end":3480.5,"speaker":"Richard Rohlin","text":"So all of these things, let's say, you know, we go back and we talk about, you know, Beowulf or the Kalevala or the Ring cycle, something. All of these things have the capacity to be nested into the Christian story. Right. Not just historically, but still now. Right. You know, like, you know, elites don't want you to know this, but storytelling is free. You can just tell stories. Right. But if you don't do this, I mean, this is the problem, right. This is why things got really murdery in the last century. Right. Is. Is that if you don't nest them and you try to put on, you know, I think idolatry is exactly the right language for it. If you try to put more weight on them than they can bear, then they start to develop some problems. First of all, they're just for one thing, just insufficiently universalizing. Right. So, like, what do you, what do you do if you're trying to tell a story about German people living in this country we made up called Germany? Well, now what do I do with all the people who aren't German? Right. Turns out the answers to that question were pretty ugly. Right. One step in. But the other thing is that there, there's still a step in the, in the downward fragmentation of identity. Right. These stories did not. Were not enough to hold identity together over the long run."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":3480.66,"end":3486.5,"speaker":"Jonathan Pageau","text":"That's right. And that's a, that's important because it's like, it's. Now we can see patently that is true."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":3486.74,"end":3487.22,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":3487.22,"end":3521.56,"speaker":"Jonathan Pageau","text":"It's like maybe when those stories were cast and when these nation national identities were cast, you could have prophesied it and people could have believed you or not believed you. But now, as we notice, everything turned to mush. We realized that, no, those stories, these national identities, even here in Quebec, because us, it's like a very short, concentrated time. You know, it's like we went from the 1940s, 50s as the most Catholic place in the world to the 1970s with this major nationalist movement, to basically the 2000s where all of that doesn't matter anymore and we're all just global mushrooms."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":3522.03,"end":3577.95,"speaker":"Richard Rohlin","text":"I mean, pretty fast here in the US Especially, like Growing up, you know, very, like, conservative, fundamentalist, right. We had the Founding Fathers. Right. We didn't have any saints, but we had the Founding fathers, right? George Washington, Benjamin Franklin, Thomas Jefferson, all those dudes, right? And there was a lot of work expanded in trying to really build up a kind of a Christian mythology around them, even though many of them were Christians, many of them, you know, universalist, atheist, deist, et cetera. But. But there was a lot of work put into trying to basically build up a mythology around that as well. If we could just get back to these guys, then America would be what it's supposed to be. Right? And just as a story, it's not strong enough. It's. It doesn't have the capacity to confer identity. You know, like, what do you do with people who don't fit into. Don't fit in the story or what? I mean, you know, like, you know, even in."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":3577.95,"end":3583.27,"speaker":"Jonathan Pageau","text":"In your own, like, whatever. Declaration of Independence, like, who are the not people?"}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":3584.63,"end":3715.08,"speaker":"Richard Rohlin","text":"All men are created equal. Women slaves. Yeah, that's a different thing. But men. Yeah. I mean. And I'm not just here to, like, rag on my country. Yeah. That I live in. But. But. But my point is. My point is that that story is itself. Is actually great. Right. Those men actually lived, you know, flawed human beings or whatever, but actually lived interesting lives and did courageous things. And it's not wrong to love them or praise them, but if you try to put on them the weight of the whole American story, it's. It's too much. It's too much. They can't. Can't hold it, right? So the other thing is that very often this kind of story, one of the deep flaws that it often has is that very often this kind of story is not participatory. All right? There's. There's really, like. Now this. This differs. I mean, a lot of the. If you're really into American history, there's a lot of pretty cool participatory things. You can go to the east coast, you know, and do. You can go to, you know, Washington's farm and, like, they have, like, a Bourbon night there once a year and think, like, you know, okay. I mean, there's. There's a really cool place called Colonial Williams Williamsburg where everybody's, like, dressed up in period costume and they try to stay in character. And, you know, that's all fun. So. So, like, there are some ways you can participate in the stuff, but. But. But ultimately it's not very participatory. Right. And then you then, like, well, okay, but what if you're black? How do you participate in Colonial Williamsburg? Right. So it's like. There's, like, different. There's just. Is one of the. One of the problems with this kind of story is that for a story to really confer identity, it's gotta be something that you can actually participate in. You can make it a part of your life. So it's happening. James Taylor talks about this. For Orthodox Christians, this would be a really familiar concept, But James Taylor in a secular age, he talks about this idea of, you know, chirotic time. The idea that. That this moment that's maybe a mythical moment or Something that happened 2,000 years ago becomes closer than yesterday. Right. That's what happens at Pascha. Is that at Pascha, the resurrection of Jesus Christ, a historical event, a mythical event, all these layers to it, but on Pascha night, on Easter night, it becomes closer than yesterday. Yeah. Right. In terms of, you know, and so most of these stories don't have the capacity to do that. And when you see."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":3715.08,"end":3718.72,"speaker":"Jonathan Pageau","text":"Or at least not completely, they have not capacity to do that."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":3718.72,"end":3719.12,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":3719.12,"end":3721.16,"speaker":"Jonathan Pageau","text":"You can celebrate the Fourth of July or whatever they're thinking."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":3721.16,"end":3722.2,"speaker":"Richard Rohlin","text":"Right, Right. Yeah, fair enough."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":3722.2,"end":3730.96,"speaker":"Jonathan Pageau","text":"But like you said, they don't. They don't. They. They just. If they try to stand on their own as the totalizing identity, they. They. They end up being dangerous."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":3731.76,"end":3814.36,"speaker":"Richard Rohlin","text":"Yeah. And then, of course, I mean, one of the questions we've been dancing around for a long time is, and then what if you're a brand new country? Right. Well, what is your mythic time? Right. And I think we've kind of addressed that. Yeah. So let me. Let me. Let me give just like, a couple of, like, practical applications for people. It's the Baptist preacher in me. I can't totally get away from it. But also, it's a couple of practical applications, but then also a little bit about the project that I've been working on and why it's tied into all of this. So if you wanted to, like, come at all of this stuff and you're trying to figure out, like, what do I do with it? What do I do with this universal history stuff? It's very. It's very fun to, like, how do I. How do I actually participate in this and integrate this in my life? The first thing that I'd say is for, like, for you as a Christian, the liturgical year is your epic. It's your sacred story. It's one that you can totally participate in. We have this prayer as part of our evening prayers in The Orthodox Church, it comes from the service of compline and it's addressed to the Mother of God. And I'm not going to unpack this or defend this for our Protestant friends out there. Please understand, we mean something by this. That's maybe not. Well, anyway, don't freak out. I'll be happy to explain this sometime later. But we have, in this prayer we say, you are the salvation of the race of Christians. Now, salvation, we mean like a lot more things by salvation than, you know, like a."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":3814.52,"end":3815.72,"speaker":"Jonathan Pageau","text":"Than dying and going to heaven."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":3815.88,"end":3876,"speaker":"Richard Rohlin","text":"Yeah, than dying and going to heaven. So that's not what we're talking. But she's the salvation of the race of Christians. In what way? Because Christ comes from her. Right. And in that sense every single Christian is descended from and is a child of Mary. Yeah, right. But the thing to kind of focus in on there is actually that last bit, the generation or the race of Christians that when you pass through the baptismal font, you become something more than just your, you know, this is why St. Paul, you know, this is why the church can simultaneously we can talk about there's no Jew, Greek bond, free male, female, but then also preserve distinctions between those things in important ways. We can do both because of this. Right. And this is why, I mean, it's tied back to my, my long running theory, right. That you're not really a Christian country until you have like a definitive national icon of the Mother of God. You know, that's when you become, that's when you become a Christian people. Right. Is because there's some connection between her and the Incarnation. Some connection between her, between the land, between the notion. Yeah. Between. Yes. Yeah."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":3876,"end":3878.52,"speaker":"Jonathan Pageau","text":"All those body. Right. It's all these things that are there."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":3878.52,"end":3879,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":3879.72,"end":3880.64,"speaker":"Jonathan Pageau","text":"That which holds."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":3880.64,"end":3880.84,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":3880.84,"end":3887.56,"speaker":"Jonathan Pageau","text":"It's like that's what, that's in some of the motherland or however you want to think about it. All these, all these ways of describing it."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":3888.04,"end":3991.39,"speaker":"Richard Rohlin","text":"So then, and I'll say this especially to my like fellow Orthodox converts, right. Is that just sort of understand and accept you've received a faith which is, you know, like serial Greco Jewish in its origins. Right. Like all the early writers. Right. All the, all the early hymns, all these different things, they're not written by people from America. Right. So you're receiving this. I know, listen, that's a dumb thing to say, but also it's like, it's like weirdly freeing to realize that. So just like realize that you're, you're receiving this faith that's so much older than you and that wasn't made with your tastes in mind. And when people get, like, really, like, let's say, agitated about how, you know, well, when are we going to inculturate? When are we going to have, like, a single American jurisdiction? When are we going to have, you know, like, American culture really represented? And what about the music and. Yeah, yeah, yeah, all that stuff. Like. Like, just, like, settle down. Yeah, settle down and accept the faith that you've been given. But know that by doing so, by just, like, faithfully saying your prayers, going to the services, participating as fully in the life of your parish as you can, that you're not just hopefully participating in the salvation of your own soul, but you're also participating in the salvation of your ancestors and of your culture. And I cannot stress enough how important it is to fully accept and receive this deposit of tradition. If enculturation is ever going to happen in a natural way. Yeah, it's just like we were talking about committees. Can't do it. It won't stick. It's gotta naturally arise."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":3991.47,"end":3998.27,"speaker":"Jonathan Pageau","text":"It's gotta just. It's gotta just arise out of. So then in things that we won't be able to describe afterwards."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":3998.51,"end":4010.49,"speaker":"Richard Rohlin","text":"So then in 500 years, when the Autocephalous Orthodox Church of Texas has officially replaced hummus with guacamole as the Lenten dip of choice, you know, like, but."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":4010.49,"end":4012.61,"speaker":"Jonathan Pageau","text":"But just like, nobody will remember how it happened."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":4012.69,"end":4013.37,"speaker":"Richard Rohlin","text":"Nobody remember."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":4013.37,"end":4014.69,"speaker":"Jonathan Pageau","text":"But it's like the way we do things."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":4014.69,"end":4059.52,"speaker":"Richard Rohlin","text":"In 500 years, we'll have American Orthodoxy for good or for ill. It'll exist. Right. But we're not going to get there by, like, just trying to force things. So anyway, so save your family, cultivate just kind of a normal holy life, and wait a few hundred years and see what happens. But. So all of that with that graceful segue. Just real quick here. I know the video's kind of gone long, but just to talk a little bit about the project, right? So it's on Kickstarter right now. There'll be a link down below where you can click to it and go, I would love it if you would go and consider backing even just, like, a couple of bucks to watch the project or whatever. If we get enough people backing, then it kind of, like, favors it in the algorithm, and then Kickstarter will start promoting itself and it'll have a much larger reach."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":4059.52,"end":4060,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":4060.16,"end":4185.74,"speaker":"Richard Rohlin","text":"But just to say something about this project, why is this a thing that I'm doing? Why is this really important or significant? What's it have to do with the symbolic world and symbolism and all this stuff. When I was growing up, I was part of a, you know, came out of just extremely fundamentalist, conservative American Christianity, you know, in the Deep south, all that stuff. So growing up in that, but also growing up alongside Chinese culture because, you know, because we came from a missionary family and they adopted, and so a lot of, like, Chinese relatives and things like this. And, you know, like, the. Actually, the food that I grew up mainly eating was, like, Chinese food. So, like, for me, that's nostalgia. That's. Oh, that's Mom's cooking, right? Is. Is Chinese. And because she grew up over there and, you know, a lot of her siblings. She has, you know, Chinese siblings and everything else. So I kind of grew up, like, in this one culture, but also right next door to this other culture. And, you know, I mean, to the point that, you know, Mandarin was my second language as a child. And so I grew up right next door to this other culture that was actually really rich and old and had a sense of its own aesthetic, right? A sense of philosophy, sense of aesthetic, sense of storytelling, and, you know, a certain way, a certain mode of expressing things. And this is, like, bright and colorful. And then the thing that is, you know, the lane that I'm in is just, like, very beige. I mean, literally beige. I mean, aggressively, we chose to, like, make our churches beige as a color. Like, why. But anyway. And so trying to wrestle with that as a young person is how this project was birthed. And it started out as trying to. Trying to answer the question, well, what does it take? What does it. What. What do you need to have a culture? And so when I was young, I started reading Beowulf and the Song of Roland first, and then, like, a lot of the other epics, medieval epics. And I became totally in love with this idea of the epic and the national epic and all this different stuff. I hadn't. You know, I was pretty. I was like, 10 or something at the time, so I hadn't really connected the dots on, like, you know, you know, where some of the stuff ended up leading."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":4185.74,"end":4188.66,"speaker":"Jonathan Pageau","text":"Yeah, if that's what you were reading at 10, we'll forgive you, Richard."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":4188.66,"end":4366.79,"speaker":"Richard Rohlin","text":"Yeah, yeah, yeah. Well, anyway, so I just fell totally in love with this stuff. And so later on, as my literary powers grew, I began to basically attempt to compose a national epic, like, do what Tolkien did. But Tolkien did it mainly linguistically at first, and I am a linguist, so there is a lot of that in here. But I was mainly focused on the idea of what would be the story that could be then passed on like that people would get their identity from. And then as I grew older, I came to understand more and more that it's not enough just to have a story, but you actually need a sacred story. And you need like a sort of a sacred participatory narrative. And so I kind of went from there to developing, you know, to doing these kind of what if questions. Tolkien and Lewis, Lewis especially famously used to talk about this. You know that when he was writing, you know, the Narnia stories, he really just started out with like a what if? Well, what if I change this one thing? Right? And so for, for me, my what if question was like, what would a Salter be like in a fantasy world? Like, how would you like if, you know, if God is still the God of the fantasy world but, but the Christian religion, the incarnation hasn't happened. The Christian religion doesn't exist. But like, you know, like, what would that look like? How would that play out? And so, and so like, how do you, how do you make a, like a fantasy religion that is, that's still true, it's not idolatrous, it's not demonic, et cetera. But also you're not just like doing fantasy Christianity, which in my opinion is actually worse. It's actually worse. So anyway, so I started developing and kind of tinkering with these things and then the histories and the poetry and everything else kind of developed into this much larger mythic cycle. And in a nutshell, all the stuff that I've shared with you today and all the stuff that we've shared over the last two years of our symbolic world, universal history conversations is stuff that I originally worked out by doing this. You know, I'd go read like an Irish story or I'd go read the Kalevala, and then I would try to try to figure out what that story was about by writing a story like that. So, like working out my ideas, but trying to work them out in this creative way because for me the creative voice has to come before the analytical. And so as for, you know, why it's a tabletop role playing game. Like I said. I'm going to do another video soon with Father Dick and Nicholas Kotar where we talk about that particular medium. But basically the short version is, I think it's a powerful and very overlooked storytelling medium. There are a lot of. It's almost the only thing left. It's almost the only means left that has that of telling a story that's not totally controlled by Hollywood and by the big five publishing companies or big three or whatever it is now. But just like, there's a stranglehold on storytelling and like, to, to ever get back to where we could even make a good Christian film. Yeah. We've got to first learn how to go all the way back and just like tell stories around the, around the campfire."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":4366.79,"end":4392.01,"speaker":"Jonathan Pageau","text":"Yeah, it's a. I think that's a great way to phrase it. It's almost like a kind of laboratory of storytelling. It's like sitting around and learning what stories are made of and then people recognizing, as they watch people make decisions in the story, like watching what the results of that are. Cause they have real, real kind of consequences, I think. Think if you phrase it that way. I mean, I don't see how anybody could object because we don't know how to tell stories anymore."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":4392.41,"end":4571.28,"speaker":"Richard Rohlin","text":"And so, and this is the great thing is that as a storytelling medium, it's participatory. Yeah, Right. Which is the whole reason it's a role playing game is because I've been working on this stuff for years. And one day a good friend of mine was like, hey, would you just run a game for us setting? Because I've been doing a Tolkien game for a long time. Would you just run a game for us set in this world that you've been working on? Because I would like to know more about it. But, you know, it's kind of poetry is pretty inaccessible to a lot of people, et cetera. And so we just started doing that and then it kind of spun out from there. But what I would, so what I would encourage people is if this sounds cool to you and you're not freaked out by it, maybe go back to project, check it out. But, but also, also to, to encourage everyone that we need to be telling these stories. Like, it's, it's weird. Like, lately I know a lot of people like you, but also other friends who are, who are trying to get films off the ground and things like this, where we've been talking for years and years about, okay, as orthodox Christians, as traditional Christians, etc. We need to get out there, we need to start telling stories and making movies and things like this. And we're the people with the most beautiful tradition, so let's share that with the world, etc. And then as soon as, like, people start trying to work on these projects and get people to fund them, like, everybody just kind of dries up and they're like, oh, I don't know about this fiction thing. And I'm not sure about this. What about this little detail? And, you know, and like, people suddenly get really cold feet. They get really, really nervous. And I want to, I would encourage people to boldness and of course, yes, we're going to make missteps. I'm going to make some, you're going to make some. But we have to do this because, you know this. Because at the end of the day, this, this deep fragmentation of identity has come down to now where we have multiple identities warring within ourselves for who we're supposed to be and what we're supposed to be and what our bodies should look like and everything else. And if we don't have some, you know, if we can't return to a narrative framework that at least offers, you know, we don't have an emperor, we can't force this on people. But if we don't return people to a narrative framework that at least offers to heal them and reintegrate them into this kind of nested hierarchy, this nested framework that ultimately comes down to Holy Week. Like, if we can't, if we can't offer some people an alternative in that way, then we're, we're letting them down, we're failing them, and we're not really. We won't effectively communicate the gospel. Right. The reason Christianity spreads, the reason it takes off when it goes places is because, you know, obviously with some fits and starts and mistakes and everything, but it always finds a way to contain the culture. Right. Where you can, where you can then be a Russian or, you know, again, Russia also made up country, but you can be a. You can be a Muscovite or you can be a Kievite, or you can be from Novgorod, or you can be from Vilnius, or you can be from London, or you can be from Paris and also a Christian. And those things nest in on each other. So that's actually secretly. That's what the whole project is about. So I hope people will check it out."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":4571.28,"end":4574.8,"speaker":"Jonathan Pageau","text":"Cool. So remind people, tell them the name and until when they've got to do."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":4574.8,"end":4588.58,"speaker":"Richard Rohlin","text":"This because, yeah, it's called Amboria Roleplay Playing in the World Under Starlight. It's launching on Kickstarter, hopefully the same day that this recording drops out on YouTube. And I think that it's going to run for a month, so I would encourage people to get out and back it."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":4588.58,"end":4597.78,"speaker":"Jonathan Pageau","text":"All right, everybody, you heard Richard. And so Richard, thanks again. And we'll be paying attention to the Kickstarter and we'll talk again very soon. Thanks."}
{"episode_id":"SW - #287 - 2023-05-24 - Richard Rohlin - Universal History - The Symbolism Of Nationalism","start":4597.78,"end":4598.58,"speaker":"Richard Rohlin","text":"Thanks, Jonathan."}
