{"episode_id":"SW - #400 - 2025-07-19 - A Dangerous Movie in the Best Way Possible","start":0.16,"end":59.17,"speaker":"Laura Diaz","text":"Tucson, the weight is over Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight and serious risks at mediweight loss. I got the same medication but with a customized plan, weekly check ins and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today."}
{"episode_id":"SW - #400 - 2025-07-19 - A Dangerous Movie in the Best Way Possible","start":59.25,"end":106.37,"speaker":"Jonathan Pageau","text":"That's mediweightloss.com but your movie has within the aesthetics of the movie. So it's like the very way the mov. The story is told and the very way it's shot and some of the images embed the holy fool structure in it. So it's not like, you know, you're using a nice kind of normal way of people. The way people. A modern cinema audience looks at a movie like here's a. Just a frame, a box and I'm watching a story. But you use aesthetic means in the story to bring about the thing. And so there's a. There's an interesting modern aspect to what you're doing. But that's why I think the movie is so. It's so particular because of that. Because. Because the very means by which you tell the story are making you experience what it is. The movie's."}
{"episode_id":"SW - #400 - 2025-07-19 - A Dangerous Movie in the Best Way Possible","start":110.83,"end":111.07,"speaker":"Josh David Jordan","text":"Foreign."}
{"episode_id":"SW - #400 - 2025-07-19 - A Dangerous Movie in the Best Way Possible","start":117.87,"end":237.51,"speaker":"Jonathan Pageau","text":"This is Jonathan Pedro. Welcome to the symbolic world. Hello everyone. I am here with Josh David Jordan. Josh is a Texan filmmaker. You can tell just by looking at him, he. He just put out his. Well, not put out like he just finished his second feature film which is called El tanto po Cristo. It is a really beautiful and poetic exploration of this imagery around the holy fool and kind of the. This edge of the world symbolism of this monastery in Texas. It's a very beautiful movie. I had the chance to see with Richard Rowland Deacon Seraphim maybe a months ago and was kind of blown away. I've been following the. This movie for several months, for like a year now, I think. You know, I met Josh before and I'd seen a kind of rough cut of the movie, but finally seeing the final movie was really quite something. And so Josh is doing something that is wild. It's. It's a monastery in Texas. It. It is. It has this kind of Southern feeling to it, but it also is very. It has all of this beautiful poetic approach like Ingmar Bergman and Tarkovsky. It really is an art movie. And so I decided to get involved in any way I could to help promote this because it's definitely worth your time. And they are right now doing a Kickstarter where they're hoping to do a theatrical release. And so they need some funds to be able to get the movie out there so people can see it. And there are all kinds of amazing tiers where you can, you can participate, have your name, the credits. You can, you know, there's the top tiers. You will fly out and you can watch a movie with. With Richard Deacon, Seraphim and I and Josh and stuff. So. So Josh, thanks for coming on and, and tell us a little bit about like, why you made this crazy movie in the first place."}
{"episode_id":"SW - #400 - 2025-07-19 - A Dangerous Movie in the Best Way Possible","start":237.51,"end":606.67,"speaker":"Josh David Jordan","text":"Yeah. What an intro. I got to take you everywhere I go that I feel really good. I can, you know, accomplish a lot today after that. Yeah. So, you know, El Tanto per Christo came about really from me almost not wanting to make a film like this. So I've been Orthodox for 11 years now. I was a filmmake from Dallas, Texas. I'll even go way back. My dad was a traveling evangelist growing up. And so we were on the actual road with my dad. We were in a. A station wagon. Me and my brother were polyester three piece suits. We opened up. We were part of the act. Act, the part of the service. And in between that, there was a lady named Geraldine. She looked like Loretta Lynn and she had a puppet named Ricky. They went on and then my dad would, you know, close the White center revival down and we'd go on to the next town. And as a kid, you only know what you know. You know. So my dad was an actor before he became a preacher in high school and in college. So maybe genetically that's why I was attracted to it because I would always find the puppeteer at the vacation Bible school or the summer camp or the church, and then obviously being the opening act for a lady who was A ventriloquist. She gave me my first puppet. And so I was always in this world of imagination. My dad said they'd be traveling, you know, 10 hours driving. I'd pop up from the back seat and just do a whole show, a whole puppet show. And, you know, growing up like that, this is. You know, this is the 80s. And so we're in the backwoods of Mississippi. I'm not really even watching tv, really, and. But I knew I was drawn to this theatrical thing, this drama, you know, and they talked about Noah's Ark, and I. I could. I saw it, you know, I saw how it looked. And, you know, fast Ford, you're in the middle of nowhere, and I'm not in LA or New York. And to be there, you had to go to, like, NYU or USC to do film because you. It was film back then. It wasn't digital, right? Yeah. And so the closest thing I could do was really acting. So I went to University of Missouri, I did acting, came back to Dallas, did. I was in feature films. I did the sitcom, went out to LA and did the sitcom Scrubs for an episode or two, and the commercial work. And there was something, like. I felt like something was lacking, like I wasn't a part of the storytelling because you're there for a day, and people are there for, you know, the months and months and a year's editing. And I didn't know that I wanted to be a director until I started making music videos, and then I started making short films. And then I was like, well, let's just make a feature film. So I made this role Won't Break, which is about a Dallas, Texas, singer songwriter who doesn't make it and how it all comes about and how most of my work comes about. As my wife. I was watching Netflix one night, and I was just scrolling, like we all do, and she was like, what do you want to watch? I said, I want to watch a movie about a country singer who doesn't make it. You know, we have the Fall From Grace, you know, the old guy. We have the guy who makes it, and he plays the theater. I was like, what about the guy who wakes up and he's 40 years old and he's still playing bars? What does he do? What's that movie? And she goes, why don't you make it? And so, challenge accepted. I. We went and made it, and I realized I was able to make feature film that people wanted to see them. And this. That film traveled the world. We went to Australia, went to Ireland, Scotland and this whole time I'm Orthodox and I'm planning my next films, but in the services, I would look around at these icons and my mind would wander a little bit. I'm like, well, what's the story there? What's the story there? And I start reading books. Then I'm really reading the Desert Fathers. I'm really reading about the fool for Christ. I'm just like, become obsessed with this. And I'm writing, I'm reading, I'm reading. I'm not even writing yet. I'm just reading. And. And then I'm realizing I can't focus on these other projects that I want to make because I feel like I need to make this film. And the thing that dawned on me was like, you know, I'm a convert. I've only been Orthodox for. At this time, it was nine years. And I'm like, am I Orthodox enough to make a film about a holy fool? I don't think I am. But I realized, like Jess said, the world that I live in and Orthodoxy here in Texas. We have a monastery here in Texas, and there's only two nuns there. And we go out there and help mow the yard. And it's Texas, you know, Mennonites live next door and they, you know, they help out. It's just a whole nother world. And I was like, well, that's my Orthodox world. I can make that. And I started looking around and, you know, because you want to look for things as artists, as inspiration, examples, there just wasn't anything out there. And when I would talk about it, it did seem foreign. And that's when it clicked, because I love foreign films. I love European cinema and, you know, I love Wings of Desire, I love the Seventh Seal, I love or Debt. These are all films. And when you watch El Tanto Per Cristo, if you're a. A lover of films and a cinephile and like those Criterion style films, you'll see the inspiration in there because it's just like, it just flooded through. And it was a subconscious thing. I remember I was. We were filming a scene in the movie. It's the kitchen scene when they're baking the bread. And it wasn't working because I had it like a Bergman film. It was in my brain and it wasn't working. It was becoming really, really funny. And it was humorous. And our lot, we were losing the lighting. And I remember my actor pulled me to the side and he goes, I think you're trying to get a certain thing across. He's like, just Let it go. He's like, it feels like this is like dead man. Like Jim Jarmusch's dead man. He was just, let it be. Let this be your own film. And that was on day like three. And it just opened up the doors. And I think if it wasn't for Frank Mosley, who's a phenomenal actor, really saying that, and he's, you know, he's not orthodox, he's not even Christian, and. But he was so moved, I think, by the process, the reverence of how things were going. And he was like, just roll with it. So that was a long winded way of saying, what, El tanto per Cristo. How it came about, maybe."}
{"episode_id":"SW - #400 - 2025-07-19 - A Dangerous Movie in the Best Way Possible","start":606.67,"end":693.43,"speaker":"Jonathan Pageau","text":"Yeah, yeah. And so when I watched the film, in some ways you hinted at it already, is that there's something very surprising about the clash of the different images. In some ways, the style of the movie. For people who've seen clips or images of it, it's a black and white movie. It's a very composed movie. It has the kind of composition, the styles of composition that you see in a Bergman film where there's this black and white. It helps because the monks are dressed in black. You know, there's something about already the setting that makes it very beautiful and very interesting to look at, but that clashes with this kind of sweaty Dallas, you know, feeling of the. And then, you know, there's a fish shack and there's this whole sense of. Right. It's like this, really. And so you have all of these surprising clashes, which seems to go well with the kind of holy fool imagery. But, you know, what was your. I guess my question is, it's like, what attracted you to this foolishness? Like this sense of the. Because people haven't seen it yet. But there's really is, in some ways, it's one of the most surprising and deep explorations of imagery of folly in the context of a monastery that I've seen. So what attracts you to that particular type, the carnival kind of foolish imagery that you bring into the movie?"}
{"episode_id":"SW - #400 - 2025-07-19 - A Dangerous Movie in the Best Way Possible","start":693.83,"end":699.11,"speaker":"Josh David Jordan","text":"You know, I think it's like, you know, goes back to my childhood. It was like I was almost in a carnival, in a way."}
{"episode_id":"SW - #400 - 2025-07-19 - A Dangerous Movie in the Best Way Possible","start":699.19,"end":704.47,"speaker":"Jonathan Pageau","text":"Yeah, yeah, you said that, like, when you talked about the puppeteering and your dad. Minister, it's like."}
{"episode_id":"SW - #400 - 2025-07-19 - A Dangerous Movie in the Best Way Possible","start":704.63,"end":876.43,"speaker":"Josh David Jordan","text":"Yeah, and I think it was, you know, and there was a lot of, you know, it was very evangelical and it was very theatrical and. But, you know, I think if I wasn't doing that, if I wasn't doing acting, if it was like back in the Day as a vaudeville, I'd probably run away with the circus. That's just how my mind. That's how I really see the world. You know, I'm not a scholar, you know, I'm not an intellect in that type of. Of way. But I do visualize and see. And I think, you know, being in the theater, as an actor, being an actor based, you really can't have any pride per se. On the stage, you know, you are sort of a fool, you are sort of a clown. You are entertaining the audience. And so that part made sense to me. When I read about saints, I was always attracted to the ones who did wild things like, you know, climbing a tree and not coming down and living in a tree and sleeping in a tree and just praying. For some reason that makes sense to me, you know. And, you know, it's like I always tell my wife, I'm like, whenever I'm writing and creating, if someone were to take my phone and listen to my voice memos, they would put me in a mental institution because I do the characters, voices before I write everything down. I act things out. It's really how my brain works. And so when I would, you know, I was just reading so much about the Desert Fathers and about the fools for Christ. And it made me understand Christ. It made me understand God. And that's maybe a broad way to say it, but in a simple way, that's how I really understand it. I understand foolishness. I mean, I feel like, you know, forgive me, Father, I'm a fool. That's something that I say time and time again. Not that I'm trying to be a fool for Christ, but I'm just like, man, I am sometimes just an idiot. And you know, that word is used a lot in, in drama and in writing and stuff. And it totally makes sense because there's a comedy to it. You know, when people act bizarre or strange, it's borderline humor and comedy. And but in that is one step over it's, you know, it's seriousness and Dr. Very focused. I always go back to like Robin Williams, who was like the funniest person in the world. But he also was like a very quiet, deep thinker, you know, and it's that they're. You're walking this fine line and there's just something so attracted to that, to me. And I really wanted to make sure that the audience was enjoying themselves. And so what better than to be able to freely write for a Texas monastery on this coast with this fool for Christ who's played by Matthew Posey, Father John, and just watching his exploration from being a fool to being. Yeah. Don't want to give away any spoilers. Yeah."}
{"episode_id":"SW - #400 - 2025-07-19 - A Dangerous Movie in the Best Way Possible","start":876.43,"end":935.43,"speaker":"Jonathan Pageau","text":"But so the movie. So the movie is fascinating because in some ways, you know, we talk about. We're talking about it as if it's an orthodox film. Okay, this is not an orthodox film. Like, this is a film. And it's not a. There's no. There's absolute. One of the things that attracted me to it is that the message or whatever message there is is embedded within the entire aesthetics and the entire, you know, the story itself. There's no. How can I say, it's not an evangelical film the way that a lot of Christian films are. It really is just a beautiful film. And so I was curious to get a sense of. Because now that you probably had quite a few people watch it, you've had people that are in the church, that are outside the church, people that are. That are maybe some orthodox, some Christians that aren't orthodox, and then some people that are completely secular. And have you seen how do people react to it? Like, what is. What has been people's take from these different slices of reality?"}
{"episode_id":"SW - #400 - 2025-07-19 - A Dangerous Movie in the Best Way Possible","start":935.67,"end":1033.36,"speaker":"Josh David Jordan","text":"No, that's a great question. You know, it really does seem like as of right now, because the film hasn't been released widely, like you said, it's only been screened privately maybe a handful of times. And we had the big showing which had some of our investors who were not Orthodox. And that's something else, as the majority of the patrons of the arts, the big patrons of the arts of this film are not Orthodox. Some are not even Christian. I think that they saw the. The what art we were producing. We did sort of a lookbook. We did a test with Matthew Posey, and we filmed some stuff so people could see what it's going to feel like. They loved the idea that it was going to be shot in this 1:6:6:1 ratio, black and white, a nod to European cinema. And they were all in. You know, a lot of people have questioned that are Orthodox. We get lots of messages and it's, you know, has this film been blessed? Is this film Orthodox enough? Is it. You know, and I get where they're coming from. Like, who's this based on? How is this fictional? You know, how is this. That's the one thing that I was. I think, because it hasn't been done in America before, which is a narrative fictional feature. Most things that we see in the Orthodox world as, you know, is documentary. And they're like, mainly made in Greece or Russia, and they're beautiful, and I love those things. But, you know, orthodoxy is young in America, and I wanted to put my fingerprint on making narrative features. You know, there's the Russian film Ostrov."}
{"episode_id":"SW - #400 - 2025-07-19 - A Dangerous Movie in the Best Way Possible","start":1033.68,"end":1123.68,"speaker":"Jonathan Pageau","text":"Yeah, that's the biggest that. I was just thinking about that movie. I was thinking, if you want to compare your movie to a movie, movie that exists, that is the one to compare to in the sense that it's a fictional story about a monk. It also has this holy fool aspect to it. And so. So it's not like there is no precedent for this. Like there are precedents for these types of stories, but. But your vision is. How can I say this? Like, this is hard. I think people understand is like, Ostrov is a beautiful film about. About this character that is ambiguous to many people, and it's kind of acting in a. In a kind of holy fool way and is affecting people's lives. It's a really. It's worth watch. Everybody should watch that movie. It's beautiful. But your movie has. Within the aesthetics of the movie. So it's like the very way the movie, the story is told and the very way it's shot, and some of the images embed the holy fool structure in it. So it's not like, you know, you're using a nice kind of normal way of people, the way people. A modern cinema audience looks at a movie like, here's a. Just a frame, a box, and I'm watching a story. But you use aesthetic means in the story to bring about the thing. And so there's an interesting modern aspect to what you're doing. But that's why I think the movie is so. It's so particular because of that. Because the very means by which you tell the story are making you experience what it is the movie's about. I don't know if you see the difference between what I'm trying to bring about."}
{"episode_id":"SW - #400 - 2025-07-19 - A Dangerous Movie in the Best Way Possible","start":1123.92,"end":1124.32,"speaker":"Announcer","text":"Sure."}
{"episode_id":"SW - #400 - 2025-07-19 - A Dangerous Movie in the Best Way Possible","start":1124.4,"end":1146.47,"speaker":"Josh David Jordan","text":"And I think a big thing and the thing that was always, you know, written in ink was it was going to be in black and white. And a lot of people are like, why is this in black and white? Even like a lot of producers or distribution companies at first were like, because when I was doing it, black and white wasn't this big thing that now has kind of taken off. Like, there's been the TV show Ripley that was in black and white. The."}
{"episode_id":"SW - #400 - 2025-07-19 - A Dangerous Movie in the Best Way Possible","start":1146.87,"end":1148.87,"speaker":"Jonathan Pageau","text":"The lighthouse was in the lighthouse."}
{"episode_id":"SW - #400 - 2025-07-19 - A Dangerous Movie in the Best Way Possible","start":1149.51,"end":1222.49,"speaker":"Josh David Jordan","text":"And then Roma, which won Academy Awards, is a. A Catholic film called Eda by a Polish director, which is a phenomenal it won the Academy Award is in black and white. And I wanted. That was so important to me to make it black and white was. If anyone's ever been inside of a cathedral or an Orthodox church, the icon. The iconography is gorgeous. You know, all of the, you know, the candle. The candelabbers and the candle holders, you have the smell of the incense. You're constantly moving. It's, you know, you're participating in that way. And I wanted to take away all of that, you know, and not rely on. Because we can, as filmmakers or as artists, just be like that shot. So beautiful because of the color, but it does not help your film. It doesn't push the film along and the narrative along. You've sort of. You've cheated the audience in a way. Right. And I think making this black and white, the audience almost participates and they're watching the story. And it's not about. Like you said, it's not about Orthodoxy. It's about these men who are at this monastery. And, you know, there's not a lot of them. That was something that was really important to me because the monasteries I go to here in Texas, there's not a lot of."}
{"episode_id":"SW - #400 - 2025-07-19 - A Dangerous Movie in the Best Way Possible","start":1222.49,"end":1225.65,"speaker":"Jonathan Pageau","text":"That's right. Not a lot of months in. In Texas."}
{"episode_id":"SW - #400 - 2025-07-19 - A Dangerous Movie in the Best Way Possible","start":1225.65,"end":1239.57,"speaker":"Josh David Jordan","text":"No. You know, I've never. I haven't gone yet. We're going this year to Greece and, you know, get a chance to go to Mount Athos. I haven't been there, and I'm glad that I haven't been before making this film. Yeah."}
{"episode_id":"SW - #400 - 2025-07-19 - A Dangerous Movie in the Best Way Possible","start":1239.73,"end":1279.43,"speaker":"Jonathan Pageau","text":"There's also something else like that. I'm gonna say this, and probably people are going to get annoyed with me, but there's also. Because of the fact that there aren't many monks in North America, there is a very particular thing that happens, which is that not all the monasteries, but some of the monasteries end up being a very strange, ragtag group of very quirky people that end up becoming monks in North America. Whereas in countries where there's a lot of monasteries, you know, things kind of even out. But. But here in America, some of the monasteries, they. There's some really very strange. Strange, strange people that end up in those places."}
{"episode_id":"SW - #400 - 2025-07-19 - A Dangerous Movie in the Best Way Possible","start":1280.31,"end":1335.32,"speaker":"Josh David Jordan","text":"Yeah, that was. And that was really important to me. And as some. A priest also said, you know, I've been an abbot of a monastery for a very long time, and you nailed the monastery. And I was like, okay, good. I was a little bit worried, you know, and it was all, you know, lots of grace, just writing and reading things and letting it subconsciously, you know, as an Artist, you just have to let things subconsciously come out and you tell yourself, is this wrong or is this right, or will the audience like that? And that's something that I really had to, you know, throw out the window. Was, is the audience going to love this? Is the Orthodox audience going to love this? Are Protestants going to be drawn to this? I had to really just knock all those things out and just make a film, you know, make a feature film, make an art film. And that was. Was. That was the most important because I think if you do that, then truth will come out for sure."}
{"episode_id":"SW - #400 - 2025-07-19 - A Dangerous Movie in the Best Way Possible","start":1336.52,"end":1367.69,"speaker":"Jonathan Pageau","text":"And so what. How can I say this? Like, I'm still wanting to get a few sense of the reactions of the people like that. Let's say your, your investors, when they watch it, like, what was their. How did they react? What. How did they see this? Like, what. Because if a lot of them weren't even Christian, weren't Orthodox, how did they perceive? Like, did they get. Yet were they missing some of the cues? It's hard to see from the, like, from the outside, because we have our own perspective. Were they able to follow everything? Like was. Was something so esoteric that they couldn't really catch or."}
{"episode_id":"SW - #400 - 2025-07-19 - A Dangerous Movie in the Best Way Possible","start":1367.69,"end":1459.48,"speaker":"Josh David Jordan","text":"It's so wild. Because the non Orthodox or non Christian, mainly non Orthodox people who've watched it have never said that they were ever confused. They. They totally grasp the picture. I've had several Orthodox say that they need to watch it again. I've had several Orthodox people say, well, some of those things didn't seem very Orthodox that were happening in the film. And maybe I've never. And a lot of people have said, like, I've never seen Orthodoxy like that before. And maybe it's because they have their own bubble of how they've perceived Orthodoxy, if they've been, you know, cradle or if they've been a convert or however it's been. We all have our different takes on it, but if you're not Orthodox, you're almost watching it like it's the seventh Seal or Wing of Desire. You're not coming into it, seeing if things are correct or if things are right or wrong. But we did. I mean, as you know, we had a lot of council on this film. We had priests and bishops and the Metropolitan. We had a lot of people reading the script, giving notes. We had someone there every single day. Father Theophan was there every single day, making sure everything that was liturgical was liturgical. We have, you know, our composer, Michael Paris Gavis, who has just come off the Disney show Agatha all along his dad was the choir director at St. Seraphim for 40 years. And, you know, he's Orthodox. Yeah."}
{"episode_id":"SW - #400 - 2025-07-19 - A Dangerous Movie in the Best Way Possible","start":1459.48,"end":1475.03,"speaker":"Jonathan Pageau","text":"By the way, the music is a big part of this movie, you know, because it was interesting. I watched the early cut of it, you know, and I could kind of get it. But when it came together with the music, it really. It really ties everything together. The. The score is really well done."}
{"episode_id":"SW - #400 - 2025-07-19 - A Dangerous Movie in the Best Way Possible","start":1475.51,"end":1475.99,"speaker":"Josh David Jordan","text":"Yeah."}
{"episode_id":"SW - #400 - 2025-07-19 - A Dangerous Movie in the Best Way Possible","start":1476.23,"end":1476.63,"speaker":"Jonathan Pageau","text":"He."}
{"episode_id":"SW - #400 - 2025-07-19 - A Dangerous Movie in the Best Way Possible","start":1477.75,"end":1617.9,"speaker":"Josh David Jordan","text":"Michael, wanted to. We talked about having, like, an American Gothic sound, a Texas. A little bit of an Appalachian sounds. There's banjo, but there's also banjo and cimatron. And then we have. My wife's in the band, the Polyphonic Spree. And so we had the Polyphonic Spree choir sing on parts, and then we had the Saint Seraphim choir sing on parts. So there's this back and forth. It's how I feel as a Texas Orthodox is you still have your roots. You're still. You have your Southern roots, but you're also entering into Orthodoxy. And, you know, how does that look? It looks different. When I was first Orthodox, there's a film festival down in Victoria, Texas, and we. It was during Pasca. It was during Holy Week, and we had gone to service, and I was new. I was newly. We're catechumens at this time. And I walk in, everyone's got beards. And, you know, they're. There's chanting involved, and they're singing. And the. The main priest comes over to say hi to me. And I'm thinking. In my brain, I'm thinking, he's either Greek or he's Russian. He's like, what are y' all doing in town? And it was just like. It's. You know, it's so jarring in this. He's like, y' all want to eat? We have some chili and corn, you know, cornbread. And you're just like, oh, man, I love that. And that's what you. When you go back to, why did I choose the full for Christ? Or why is it Texas? It's just this. I love things that are abstract and things that are constant. You know, I love things that are, you know, both at the same time. So, yeah, I think with. With some Protestants, you know, I think it's more. It's foreign. It's foreign to them as well. There's a lot of Catholic people who are really, really excited that have watched it, that are. That are really, really moved by it. So I'm really, you know, I'm really interested, as you are, to see, like, what everyone's going to really, really think, because like you said, it's, you said, I think once, this is a dangerous film in a good way. And I think that's the kind of cinema I'm drawn to. And I think a lot of people like to go watch something that you participate and you're gonna, you drive home and you're processing it. And that's what a lot of people who are not Orthodo said. I've been thinking about your film, Josh. It's really beautiful. I'm ready to watch it again. So that's encouraging to me for sure."}
{"episode_id":"SW - #400 - 2025-07-19 - A Dangerous Movie in the Best Way Possible","start":1617.9,"end":1724.08,"speaker":"Jonathan Pageau","text":"Yeah. One of the things that happens when you watch the movie for sure is, you know, it's a demanding film. Like it demands of you because there are some things that it doesn't give you, right. And it kind of takes you long and then, and it doesn't hand them to you. It's like you actually have to go get them. And then once you get them, you realize, oh, and then things kind of come together and, and, and you can see the image, you know, let's say, coming together. So it's, it's a demanding film, but it also is this, it smashes things together that, like you said, people aren't used to seeing being put together. So you have this kind of home grown sense of Texas, you know, this kind of, you know, rural feeling of Texas, right. And then that is smashed. Like on top of that you have this sense of orthodoxy and of liturgical practice and the monastic life. And then on top of that you have this whole weird kind of fool for Christ carnival imagery for people who don't know there's actually like an actual little person who's a monk in the movie that, you know. And so it brings, that adds all this kind of sense of a like, like. Yeah, like an old, old style carnival. I won't, I don't want to give things away, but there are a lot of these elements kind of coming in together. And then on top of that you have this whole kind of European vision of cinema of like Tarkovsky and Bergman, a kind of surrealist element as well, you know, this visionary cinema approach where it's like. I've never seen anything like it. I don't, like, I, when I try to explain it, it's like it just all these layers, but it does it. But in the end it comes together as an experience that is quite powerful and beautiful, but it will be, it is demanding of people. It's not. This is not popcorn cinema. This is, this is art. This is an art film."}
{"episode_id":"SW - #400 - 2025-07-19 - A Dangerous Movie in the Best Way Possible","start":1724.16,"end":1833.3,"speaker":"Josh David Jordan","text":"Yeah, there's times, even the opening scene, and this is no spoiler, but it's. The opening scene is an eight minute long take. There's no cuts. And I've had several people have said, like, I was waiting for it to cut and turn and see Father John, but you never, you never let us. And it just sets a precedent for the film just to say, like, sit back, you know, there's not going to be, you know, the Marvel 23 second cuts every, you know, every five seconds that we're really gonna, we're gonna sit with this almost like theater. But you did touch on something when you said, you talked about the small person, the little person, Seraphim in the film, and he's based on St. John the Dwarf. And so when people do talk to me, they say, well, is this, you know, is this orthodox based? All of the fool for Christ and all the monks in the movie are based on stories of the orthodox saints. There's nothing that I made up besides dialogue that was. Did not pertain to some, some things just filling in the gaps of dialogue and. But anything that is spiritual in the film, anything that's full for Christ driven, those were all taken from, from stories. And it was such a honor and it was such a blast for me to be able to take those stories that we all know. And it's like an Easter egg that people who are orthodox have been coming up to me and being like, oh, is this that scene? Is that because of St. John of Shang? Or, you know, we start to break things down and it's a conversation and then say, I need to watch it again. Because I think I missed, I think I missed that scene. Like when he's doing the. There's a silent film scene when he's in the cathedral and he's doing his, his gifts. That's taken from orthodox stories as well, about."}
{"episode_id":"SW - #400 - 2025-07-19 - A Dangerous Movie in the Best Way Possible","start":1833.3,"end":1905.21,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah, yeah. There's every. Like, like I said, we don't want to spoil it, but there's like, there really is. Because the thing is that you think also like you said, we are already hinting at this, is that you have this sense of, okay, it's called the fool for Christ, right? But then by the time the movie's over, you're actually like, well, wait a minute, who is the fool? Who's the fool for Christ? Actually, then you realize that it's actually a smashing together of all these little kind of Christian folly layers of images that have kind of been brought together. And so anyway, so we'll let people discover it on their own. But. But. Yeah. So that's also part of kind of the. And it's something that I think a lot of people, you know, it'll come to them later, they'll watch it, and then you're sitting at home and you're like, oh, wait a minute, I thought I got that. And then it's like, no, no. These other images are kind of layering themselves into your memory, and you realize there's something that you. That you kind of saw, but you didn't really completely understand. So it's a. Yeah, I think it's definitely a movie that warrants evil, will warrant for several people that aren't 50 people that aren't used to watching kind of art films and are used to just being handed everything. Like, they'll probably want to watch it more than once."}
{"episode_id":"SW - #400 - 2025-07-19 - A Dangerous Movie in the Best Way Possible","start":1905.61,"end":1959.83,"speaker":"Josh David Jordan","text":"Yeah, it's so bizarre. Like, you probably are the same way here, Jonathan, but like, a lot of the stuff that I create, art and stuff like that, it's like I can go back and watch it sometimes. It could be a little cringy because of something. Maybe I was going, it's dated. Or. Or maybe I wish I would have. That's always the thing of his art. I wish I would have done this. It's so bizarre with this film. The. I love watching it with audiences. I love watching it because even I watch it and I find new things that I guess, was a subconscious move from the actor or from my cinematographer or from me, or maybe I wrote it a certain way. But being so busy making the film, being so busy, like, editing, doing the sound design, now promoting it, now, you know, raising the money to put it into theatrical release, I can watch it as an audience member, and I'm really excited to keep watching it with people and talking to people about it because, yeah, I have a lot of questions."}
{"episode_id":"SW - #400 - 2025-07-19 - A Dangerous Movie in the Best Way Possible","start":1962.71,"end":2069.9,"speaker":"Jonathan Pageau","text":"So, folks, I would say we're going to put the link to the Kickstarter in the description. We talk about culture on this podcast. We talk about art. We criticize the current state of. Of artistic production. We're also trying to ourselves kind of create new things, beautiful things, powerful things that are. That are going to transform culture. And so this is a great possibility for you to participate in a beautiful, powerful movie that is. That is being made, you know, to be a part of it, to be able to help advance a new vision of culture, a new way of doing things, and one that isn't naive, but is deeply ingrained in everything we can learn from cinema, from our tradition. All of this kind of brought together as a vision of what's possible. And so really, folks, I encourage you to go there. And it's cool because some of the tiers are really participative. You get to have your name in the credits. You get to have a special credit on IMDb. Like I said, they're really being generous with what they're offering for people to. To participate in this. So this is a chance to. To. Yeah, to not. To not just be in despair of what's happening around us and the state of culture, but participate in. In the future. So. So go and check this out. And Josh, thank you for. Thank you for doing this. You put a lot on the line to do this. You kind of, you know, obviously, you know, you were able to get through it. It's. People don't understand how insane it is to make a movie on your own. Like, it's really crazy. So, yeah, thank you for. For holding the vision and getting that done. And so maybe give people a last. Last sense of what it is you're hoping to see. Like, what. What you want to see happen and. Yeah, and then we'll let people go to the Kickstarter."}
{"episode_id":"SW - #400 - 2025-07-19 - A Dangerous Movie in the Best Way Possible","start":2069.9,"end":2166.54,"speaker":"Josh David Jordan","text":"Yeah. I think it's really exciting that this is something that hasn't been done before. We talked about, which is a North American fictional narrative feature with a background of orthodoxy. And it's very important to watch this in a cinema. I think, you know, we all get distracted. I do, too. I have the Criterion Channel and I get distracted, you know, grabbing a snack or checking pizza or looking at your phone. This film really does demand your attention, like you're going to the opera or going to the theater. And so you can be a part of this Kickstarter. And by just donating, you can purchase a ticket and if it's not coming into your town, you can have a live screening event where we're going to show it on your computer, on your tv. And I'll take questions. Yeah, we're trying to get this thing in most cities in the U.S. and then we're gonna go overseas. We'll be in Romania and Greece this November. And so we're building towards that. And really, I think it's going to be fun because we're also doing a vinyl record that'll have the soundtrack. It's a double vinyl. It'll have the music that's not even in the movie. It'll have stuff from Saint Seraphine. Choir will have dialogue like Walt Disney used to put out in those Disney movies. They would have the dialogue from the movie. So there's so much exciting things that are happening. And if everyone just shares this and then goes and brings friends and discusses this film, it really will, I think, transform the landscape of what else can come from that, other people following. You know, I have, I feel like I have a machete and I'm. There was no path to this and I'm making a machete and hopefully people will follow along and we can keep creating beautiful art."}
{"episode_id":"SW - #400 - 2025-07-19 - A Dangerous Movie in the Best Way Possible","start":2166.78,"end":2202.58,"speaker":"Jonathan Pageau","text":"Yeah. And like, you know, like you, you hinted at one of the lowest tiers on the Kickstarter is like, like pretty much the price of a ticket. It's like $20. You know, you get exclusive VIP showing of the, of the movie. And so it's like if you even plan to even just see this movie, like, just go and support the Kickstarter and it'll help them be able to, to participate in, in the theatrical release. So, Josh, thanks for everything and I'm excited to see this come out and I'm, I'm looking forward to seeing it again. I mean, I've watched it only once, completely finished. And, and, and hopefully we'll, we'll, we'll get that done."}
{"episode_id":"SW - #400 - 2025-07-19 - A Dangerous Movie in the Best Way Possible","start":2202.66,"end":2208.18,"speaker":"Josh David Jordan","text":"Yeah. Thank you for being a part of it. It really means a lot and I'm excited for everybody to finally see El Tanto per Cristo."}
{"episode_id":"SW - #400 - 2025-07-19 - A Dangerous Movie in the Best Way Possible","start":2208.98,"end":2209.86,"speaker":"Jonathan Pageau","text":"All right, thanks."}
{"episode_id":"SW - #400 - 2025-07-19 - A Dangerous Movie in the Best Way Possible","start":2210.34,"end":2211.46,"speaker":"Josh David Jordan","text":"All right, bye. Bye."}
{"episode_id":"SW - #400 - 2025-07-19 - A Dangerous Movie in the Best Way Possible","start":2212.1,"end":2227.11,"speaker":"Jonathan Pageau","text":"If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase, so go to thesymbolicworld.com and thank you for your support."}
{"episode_id":"SW - #400 - 2025-07-19 - A Dangerous Movie in the Best Way Possible","start":2227.59,"end":2290.72,"speaker":"Laura Diaz","text":"Tucson the weight is over mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me, this isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication, but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better, and lose weight the right way, mediweightloss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com looking for your next Go."}
{"episode_id":"SW - #400 - 2025-07-19 - A Dangerous Movie in the Best Way Possible","start":2290.72,"end":2355.99,"speaker":"Announcer","text":"To Smoke Shop Stop scrolling. I've got you. Headshop.com is the number one online smoke shop already trusted by over 100,000 happy smokers just like you. They've got it all Dab rigs, vaporizers, glass bongs, smoking pipes, even THCA flower all in one place. Need a new daily driver? Grab a smooth glass bong or a classic smoking pipe. More of a concentrate fan. Their dab rigs, E rigs and wax accessories are designed for smoother, harder hitting sessions. And yes, they've even got legal THC flower. Best part Every order ships fast and discreet, which is why thousands of smokers keep coming back. So don't waste time hopping between shops. Shop the best in dab rigs, vaporize visors, glass bongs, smoking pipes and thca flower right now@headshop.com the number one online smoke shop, headshop.com has what you need. Check it out today. Oh, and because you're listening right now, you get 10% off your next order when you use the coupon code HSHOP at checkout. Go to headshop.com now and smoke smarter."}
