{"episode_id":"SW - #139 - 2021-02-06 - Rudolph the Red Nosed Reindeer as Modern Mythmaking","start":0.8,"end":768.55,"speaker":"Jonathan Pageau","text":"So a few times in the past people have made some jokes. I've seen jokes on Twitter, on Facebook, even in YouTube comments. People say, you know, why don't you do the symbolism of Rudolph the red nosed reindeer? There's somehow I have a joking element to that question. But I thought that I would dive into the symbolism of Rudolph because I think that in the figure of Rudolph the red nosed reindeer we do have an image of a birth of a mythological figure where it Rudolph seems to more than the Marvel superheroes, more than the Star wars world, seems to be playing a much more mythological function than all those other characters. And so we'll look at why that is and why his story seems to fit in order for Rudolph to enter into a more participatory mode. This is Jonathan Peugeot. Welcome to the symbolic world. So kind of like the modern Santa Claus is a rather modern figure. You know, the figure of Rudolph the red nosed reindeer is even more recent. In fact, we even know who created Rudolph. His name is Robert Louis May and created him in 1939, wrote a small pamphlet which was published by Montgomery Ward department store. And since then, right away the figure of Rudolph entered into the common imagination. And it seems like Rudolph has become the closest thing to a kind of mythic structure that we have in the modern world, let's say, I would say even more than Star wars, even more than the Marvel comics. And I will give you you a few of the elements which make us understand that so that you can see how, why it is that Rudolph seems to be playing a kind of mythological role, let's say. So one of the ways that you can know that Rudolph is playing such a mythological form is that most people don't know who created him. Even though he does have a definite author. We don't feel like Rudolph has been created by someone in particular who we just feel like he kind of rose up out of, you know, the full folkloric ancient folklore and just appeared as this figure which completes the story of Santa Claus. And so that is something that is important. Understanding these, why how a story becomes mythological, it actually has to become more removed from its, let's say, more mundane, its more mundane source. You know, one of the reasons why the Marvel comics are also approached the mythological structure is because although they were created by actual people, because they end up being handled by all these different kinds of people. There's, there's almost a kind of complex system which sets itself up, which weeds out some elements of the story. Keep some, add some. And there's this, this Selection process which creates a figure that has more, let's say, oomph, more ontological force. And so in the case of Rudolph, it seems like right away was there at the beginning, but we just forgot who it is that created him. And Rudolph became a character on his own who, who just manifests the story of Santa Claus. So why is it that he's so powerful Now? One of the reasons why Rudolph is so powerful is because in the very structure of his story, he manifests something about the relationship between the end and the beginning. And so Rudolph is. In the story of Christ, there's this image that Christ is the stone that was rejected by the builder has become the angle stone, or the capstone sometimes is a better term to understand it, the keystone which holds the arch together. That is maybe the best way to understand what Christ is. So it's the stone that's different from all the other stones. Let's say you're building an arch, you have all these stones that are the same. It's. And then at the end you need something to hold the arch together. And then you see this one stone that is different from all the others, and that's the last stone that you put together which holds it all together. And so in that sense, Christ has. That talks about that process, which is that something which doesn't seem to fit through the whole process can at the end appear to be the very source of the. Of that process. And that's what we see in the story of Rudolph now in the story of Rudolph. And it fits our modern way of thinking as well, which is the kind of, you know, the underdog mentality, which I talked about a little bit in my video about equality and sub and inversion. You know, it fits the notion of the, the. The underdog who's rejected, that nobody loves, and then finally becomes the hero. But in this, it's more than just becomes the hero. Although, although the story of Rudolph does follow that. That trope which you see in every single movie, which is that someone is rejected at the beginning and at the end everybody celebrates him. You know, there's something a bit diluted about that story, but in the story of Rudolph, it's that he actually becomes the head of the sleigh. And so structurally, he goes from being marginalized and rejected to becoming exceptional at the. At the edge of the sleigh. And so it's not just that he, he overcomes his difficulties and then becomes the hero. It's that the very thing that makes him exceptional and makes him rejected is the Thing which makes him ultimately come to the head of the sleigh and lead the other reindeer. And so you have this, this relationship between the transformation of the end into the beginning. But also when what you have is, if you look at the, at Santa's sleigh, if you kind of understand it now, all of a sudden, something like a Christmas tree. You'll see by adding Rudolph to the top of the sleigh, you bring the sleigh together into this point. And so think of the sleigh as the Christmas tree. You have Rudolph at the top. You have the shining exceptional light. You have the star, you have the angel which is at the top. You have the principality of the, of the, of the. The tree. And so. And then in the tree, I've talked about this in my video of, about trees in the tree, you have all these shining other shining lights which are lesser than the top one, which are, which shouldn't, you know, you shouldn't have an ornament in your tree which is attracting more attention than the star. The star should be the top ornament, should be the, the one that kind of everything all leads to. And so you have all these other lights inside all these other smaller principalities. And then finally you have the bottom of the tree in which you have the potentiality of the world, which, in which you have the wrapped gifts that are hidden in potentiality. And so when you put. If you imagine the sleigh of Santa Claus going up, you have the exact same structure. All of a sudden. You have Rudolph at the top as the principality as, as the, the exceptional light at the top. And then you have the different reindeer that are like stars, that are like other principalities. And then finally you have this sleigh which acts, you know, acts literally as a bowl. And in that bowl now you have this big sack full of gifts that are hidden inside. And you don't know who it goes to, and you don't know what's inside. And so you have. The very structure of reality is represented by, by the, by the, the structure of the sleigh. You know, by the rate Rudolph at the top with all the reindeer and Santa Claus at the bottom has the exact same structure as the Christmas tree and the exact same structure as the Christmas story. I've talked about this, how this image of the star above and, you know, the lowly bowl at the bottom with the, you know, in the darkness is the structure also of the Nativity icon. You have the star above, you have all the, the. The angels which are singing you have also the, the shepherds which are hearing. And so you have kind of this link between heaven and earth. And then you have in this dark cave in the manger, in the place where the animals eat in the very, all these images of this dark potentiality is where you have the hidden principalities, the ones that aren't manifest yet. And you have the one in the story of Christianity you have that which will, which ultimately also go rise up to the top. But in the story of Santa Claus, that's not necessarily the idea. It's more this idea of this potentiality, potential treasures that are hidden in darkness. And so you can see that. So when someone kind of came up with the idea of Rudolph the Red Nosed Reindeer, it is an owned property. You know, it's, it's, it's, it's actually not a mythic thing. It's, it's owned by something called, the, what is it? The, the Rudolph the Red Nosed Reindeer Corporation or something. And so it's owned by, so the image of Rudolph is owned by the corporation. But we don't get the sense that that's it. And I don't think they can actually control the image of Rudolph, you know, has entered so much into our folklore that they have to be careful not to control it too much or else it's going to backfire against them. And so it seems like, like the image of Rudolph is probably there to stay in the story of Santa just because it actually takes up a space in the story that was missing something which was kind of calling to be filled. And you know, the fact that some guy came up with it almost doesn't matter. What really matters is that it, it ends up recreating the right pattern, the pattern that we recognize. The pattern that is the same as the Christmas tree, the same as the nativity of Christ itself. And so it's interesting to see, it's interesting to see that even despite the fact that the, let's say we could surmise that the rise of Santa Claus and the rise of figures like Rudolph the Red nosed Reindeer in a way are there to push aside the more Christian element of Christmas and to try to find secular alternatives to, to Christmas. And we can kind of see that as a frustrating thing and a subversive element in, in Christmas. But we can also do the do just as these things are trying to push them aside. What we can do is actually show how even though they try to, they end up manifesting the same pattern as the Nativity. And so in the very act of trying to cast aside the Nativity of Christ, they end up reaffirming it by manifesting the same pattern. And so as Christians, as people who want to celebrate Christmas, I think the best way to deal with these stories is to integrate them and to try to show how they are just one more image of this transformation which happened 2000 years ago. This child that was born in a manger which revealed to us the mysteries of the universe and gave us a way to enter into this mystery of the Incarnation, showing us, you know, what the solstice ultimately refers to, what these other, even pagan, images ultimately refer to. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well and on SubscribeStar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
