{"episode_id":"SW - #066 - 2019-10-23 - The Anthropology of Mysticism","start":0.16,"end":112.07,"speaker":"Jonathan Pageau","text":"I'd like to welcome you to the Symbolic World Podcast. On this episode, I will be playing for you a conference that I gave in Seattle at a conference called Shared Inheritance, which was a conference organized by Byzantine Catholics, which Orthodox speakers were also invited. Father Stephen Freeman, who has been on this channel, you've heard him on the podcast, was also there and it was a great time. And I tried to look a little bit more about at how the Orthodox tradition, how the Christian mystical tradition offers us perception, a way of understanding the human person, which can be very helpful for us today, you know, helpful for us to understand this notion of the center and the periphery, this idea of attention, of memory, all these questions that are becoming primordial in science of consciousness and in, in all the, the, let's say the new, the new questions that have been asked by people like Jordan Peterson, John Vervaeke and others. I was trying to. To give some keys to that, using the Church Fathers as a backdrop. And so, as you know, everything I'm doing here on the Symbolic World podcast is thanks to your support. So if you like what I'm doing, please consider going to thesymbolicworld.com support and there you will find different ways which you can help out the podcast. For all the supporters, I'm offering early access to some of the videos. There are all kinds of tiers, tiers where you can ask early questions in advance on the Q and A. Tiers where you can have private discussions with me or enter into small groups that I'm leading. And ultimately, though, for all the supporters, I'm making one extra video a month, which is the interpretation of a fairy tale, a myth or some ancient legend. And I've been having a lot of fun making those. So please enjoy."}
{"episode_id":"SW - #066 - 2019-10-23 - The Anthropology of Mysticism","start":126.05,"end":127.25,"speaker":"Jonathan Pageau","text":"This is Jonathan Pageau."}
{"episode_id":"SW - #066 - 2019-10-23 - The Anthropology of Mysticism","start":127.65,"end":129.33,"speaker":"Jonathan Pageau","text":"Welcome to the Symbolic World."}
{"episode_id":"SW - #066 - 2019-10-23 - The Anthropology of Mysticism","start":140.45,"end":2841.88,"speaker":"Jonathan Pageau","text":"So for those who were. So those. For those who were here last night, you heard Father Stephen speak. And it's been a few times that I've talked after Fr. Stephen. It's always a bit daunting to, to speak after Father Stephen, but it's also very strange because in the last conference I gave, where we were speaking together, I felt like he was also in the same mind space as I was, that he was looking at the same sources at the same fathers and bringing his ideas together in a way that I found exciting and felt went well with what I'm doing. And so as Father Stephen talked to us about this ontological transformation, the salvation as an ontological change which comes through the incarnation, but also that shows us the source of reality. And so that is what interests me mostly, is because I am an artist and I'm someone who looks at imagery, who looks at narrative, who looks at patterns. What I try to do is to try to show people that the stories that we have in the Bible that are liturgy, that are rituals, that they're not arbitrary, that they're not just these arbitrary things that we engage in that will somehow bring us to heaven or whatever you. How you conceive it, but rather that the stories that we find in the Bible and the traditions that are brought to us through the Church, they're actually helping us participate in reality itself, that they're showing us how. How reality works and how we can participate most fully in reality. And so the mission that I've kind of given myself in life is to help people, to the extent that it's possible, see what this looks like. See that it is not just arbitrary, that there are these powerful, beautiful patterns which underlie our tradition. And those patterns are talking about something. They're talking about our experience, our experience in our relationship to the infinite God, and how those all of that comes together in the wonderful, amazing moment of the Incarnation, and how the Incarnation is that the source of everything. So what I want to look at today is hesychasm. Does who here knows what hesychism is? All right, so it's definitely not the majority. So hesychasm is a technical word to talk about the mystical tradition of the Eastern church, the mystical practice, and the ascetical tradition. But it's a way of also viewing the human person. The hesychast, the Christian mystics, describe the human person in a certain manner. And my contention, as I see the way that the hesychast describe the human person, I can see that that description is the same thing or the same pattern as the architecture of the church, as the iconography that we look at. It's the same pattern as the stories that we find in the Bible that all of these things come together and are just one more manifestation of how reality lays itself out. So it's going to sound abstract at the beginning, but you'll see it slowly land into very practical reality, I hope, as I go through this. And so you could synthesize pretty much all of the Christian mystical tradition in this one phrase that Christ uttered. And so to. To speak, of the heart. That's especially what I'm going to try to speak about. What are we talking about when we talk about the heart? What is. We use it in colloquial language we talk about the heart. Even, even the most, you know, the most bland kind of non denominational Christian will say, you need to accept Jesus in your heart. You know, who knows what that means? But they have an intuition of the truth in that sense. And there's an intuition about this notion of realizing something about your heart that is still, even though it's kind of deformed and strained, it still connects to something intuitively. Right? And so the way that we need to come to understand reality, let's say, is to understand it as macrocosm and microcosm. And this is how many of the Church Fathers talk about reality. Saint Maximus the Confessor. And a good way to understand it, the notion of the center, is a good way to see that. The tree is a good example of how this works. It's this idea, you can understand it as a fractal reality that there are. If you look at how a tree is made, every branch of the tree is the same structure as the tree itself. So every time there's the basic tree, but every branch is a little tree, and then every branch of that little tree is also a little tree. And as many branches as there will be on the tree, every single branch of that tree will be a little tree. So every single branch is slightly different, but they all follow the same pattern that the tree itself has. Okay? And so that is how this notion of macrocosm and microcosm is going to work. And as we look at it, you'll see how the Church Fathers interpret it. And so the Church Fathers, the Church Father especially Saint Maxworth the Confessor, really emphasizes this idea. The idea that the human being is a microcosm of the entirety of the cosmos and a way to. It's very important to differentiate the terms that we're using. One of the problems we have today in the modern world is because we've given our mind so much to technical understanding and to scientific interpretation. When I use words like cosmos, when I use words like heart, you think of, you think of just, you know, like a valve in your body when you think of heart and when you think of cosmos, you think of all these planets and, and, and stars. In order to, in order to enter into the mind of the Fathers, in order to enter into the mind of the, the Bible and our narratives, we have to come back to our experience and understand that human experience is the first experience. It's the first point of departure for any knowledge, any understanding. We are a being in a body, a conscious being that is looking out and the world is presenting itself to us in this field of perceptions that we have. And so we need to try to enter back. It's not that hard to do that. It's not that hard to do that because we live in that space. We live in that experience. But we've been so used to thinking that somehow technical descriptions of reality which are accurate, they're not inaccurate, but they are secondary to our experience. Okay, so when I'm going to talk about the heart, I'm going to talk about the heart in terms of something that you experience as you're living in the world. And the beating pump is part of it, but that's not the totality of it. And so St. Maximus talks about. He says the entire cosmos consisting of the visible and invisible things is man. And man consisting of body and soul is cosmos. For the intelligible things participate to the substance of the soul, as the soul has the same reason as the intelligible ones. And the sensible things bear the image of the body as the body is the image of the sensible things. The intelligible things are the soul of the sensible ones. The sensible things are the body of the intelligible ones. It's a complicated quote, but if you look at it simply, it doesn't say that much, which is complicated. What it's saying is that you are made in the same way as the entire cosmos. That the way that you're constituted in terms of the fact that you have an invisible aspect to you, you have something which is not. Cannot be quantified, cannot be measured. You know, what we call the soul, what we call the spiritual aspect, the intelligible aspect of our existence. That is also that which is how the cosmos is made. And now this is something which I know, like I said, for the technically minded it is so difficult to understand that because we're so used to thinking only in terms of quantifiable phenomena and measurable things, you know, all this science and all that. And like I said, there's nothing wrong or inaccurate about that. But as. As we move further in time and even as scientists start to come to the limit of their capacity to analyze the world, they're hitting a wall. They're hitting a wall which is the wall of the intelligibles, the qualities of things. Why do we see unity in anything? Why do we think that something has an identity? You can't measure the identity of something, of anything. Anything in the world could be a cup, it could be a person, you know, the cup. Ness of the cup. You can't measure it, because the cup is made of a lot of different details. It has parts. So why do we think that those parts come together and become one thing? What makes that happen? What makes things that are multiple come into one? The scientists are looking around and they're realizing, okay, this world is just a quantum field, they call it. It's just a field of potential, whatever. And so how does it jump from that up to John or Joe or a tree or. They can't account for those jumps in qualitative reality. They just, they just can't because those are, they're invisible. And so if you look at even recent, recent physicists, some of them are toying with what they call the anthropic nature of the cosmos, which is that they understand that the cosmos has to somehow be shaped in a way for consciousness to exist in it. And some go even further and say that consciousness is an inevitable aspect of the cosmos. It has to be. Without consciousness, there are no qualities. The world is just flux. Right. Without name. You could say it. You could use the Bible way to say it. You could say, without, let there be. Without. Without a mind that says, let there be light, let there be this. That thing doesn't come out of the potential. It doesn't come together. Okay, sounds a bit. We'll keep going. Hopefully it'll, hopefully it'll come together as I, as I go further. And so what's important to understand is that Saint Maximus and the church fathers and the whole of Christian tradition, they place the human being at the center of, of this whole thing. That's why man is a microcosm, because that's what we do. We are the ones who give meaning to the world. Man is the vehicle by which meaning enters into the world. And without meaning, it's not clear what actually exists. And so St. Maximus talks about man as being the pinnacle of. Of creation, that man was created on the sixth day, the last creation, because he was meant to bridge the invisible, bridge the essences, bridge the names, bridge the invisible meaning with the material world. And so as we look at this notion of the heart, St. Isaac the Syrian says, apply yourself to entering your interior chamber and you will see the celestial chamber, for it is one and the same door open on the contemplation of both. The ladder of this kingdom is hidden inside you in your soul. Wash yourself of your sin, and you will discover the degrees by which to ascend. And so this is this notion of the heart, this notion of the heart is starting to appear the way that the Christian mystics will Talk about the heart as being the. If you think about what I, what I told you about this tree that has a branch which is the same shape as the tree, you could see it this way. The human being plays the same role in the world as the heart plays in the human being. It has the same structure, right? So the human person has a structure, the cosmos has a structure. And in the heart of the person there is that same structure. It's like an embedded, it's like an onion. It's like this embedded, these embedded centers, one into the one into the other. And we see it like it's not just in the church Fathers. There's an amazing quote by St. Paul who says, for it is the God who commanded light to shine out of darkness, who has shown in our hearts to give the light of the knowledge of the glory of God in the face of Jesus Christ. And so this, this text is suggesting that there is a relationship between God saying, let there be light, and not only the incarnation, but the light which shines in our heart, the light which enters into our heart. And that light is this, this, this image of God that we're talking about. Like this is the, this consciousness is supposed to be about what is this image of God that. St. Gregory of Nyssa, some of the fathers talk about this divine spark that, that in, in the heart of hearts, of hearts, of hearts. You know, you know, hidden invisibly in the person is a spark of God. And as you remove the veils of the heart and as you enter into that central space, then you encounter your own origin. You encounter your own origin, you counter as much your own nature as a human being, but you also come into contact with your very creator, who is hidden in the heart of heart, of hearts. You could say. So St. Maximus talks about the human being as this all containing workshop, that binding all together in himself. So as into God. So as much. No, sorry, is it into man? Yeah, as much as he has also been given the power of unification thanks to his proper relationship to his own different parts. So as much as the human being unites his own parts into his heart. Right. He doesn't use the word heart, but the Fathers will slowly start to use the word heart. More, more, more. Exactly. So man was further brought into being as the last of God's creatures because he was supposed to be a natural link between all creation, mediating between the extremes through the elements of his own nature. And so that, this is what I was telling you about, that the human person mediates the extremes of the world. The human person unites in them the invisible and the visible. And it's like, it's not complicated to understand because like I told you, human beings are the ones that give meaning to the world. Animals don't give meaning to the world. We are the ones studying the animals. The animals aren't the ones studying us. We are the ones who are studying nature. Nature isn't studying us. And so we are. The human person has a central place to play in any meaningful arrangement of the cosmos, even if it is. Even if it is a scientific description. Behind that scientific description is this fact that human beings participate. And in participating in the meaning of the world, they are acting in the image of God. They are enacting their nature, which is to be that link between heaven and earth. So when I. When I think about this, it's funny because my mind actually goes to a very famous Confucian saying. Many of you probably have seen this. This saying before. If there is righteousness in the heart, there will be beauty in the character. There is beauty in the character. There will be harmony in the home, there is harmony in the home, There will be order in the nations. When there is order in the nations, there will be peace in the world. And so you can see in that image, this embedded microcosms, you can see how it starts in the human heart that if the human. That we have this saying, right, that the just uphold the world, that the saints are the. Are actually the pillars of the world, without saints, the world would fall apart. That with that our saints who pray and who are in communion with God are actually holding the world together. They're actually acting as that link between heaven and earth. And if I say it like that, it sounds. So. It sounds mystical and kind of esoteric and weird. But I mean, just think about it in your own very personal life, you know, what happens when your own life is somehow a little centered? What happens when, you know, you're able to move away from your sins? What happens when you're able to be in communion with the people around you because you are able to be in communion with God? It's. The effects are dramatic. Your family comes together and then the community comes together around those people. And you always, if any church that is fruitful and that is growing has those people in the church doesn't even have to be the priest, but you have to have those people that are working on doing that. And then they end up being magnets and ordering the world by their own transformation, you know, and so it. There is. It's not something which is kind of esoteric. It is actually how reality works. So we have this notion of this center. And one of the things that has actually, actually this is an intuition, this notion of the center of the heart, of this seed, you know, of the pearl in the field, you know, the, the, the, the, the, the smallest seed, all these images that Christ uses. I, I, I had this intuition a long time ago about that, about this idea of this divine spark which is hidden in the world, which is hidden in us, you know, which is hidden in creation. And the one thing that always bothered me, even when I was becoming to orthodoxy, is that there's also this other tradition which is that all evil also comes from the heart. And so this idea that, that not only good comes from the heart, but also all our, all the badness of our self. And I didn't understand it at first. There's the one, there's the one famous, one famous verse that Christ talks about when he says, but those things which proceed out of the mouth come from the heart and they defile a man. For out of the heart proceeds evil thoughts, murders, adulteries, fornications, thefts, false witness, blasphemies. Those are the things which defile a man. But to eat with unwashed hands does not defile a man. And so I really struggled with that at first because I was like, how do you reconcile those two ideas? Because I could see it, right? I could see this kind of concentric space even in the church. That's how the church is built, right? You have the altar and you have the chalice. And in the, you know, you have the, you have the, the church itself. And then in the church you have the altar. And, and then in the altar you have the actual altar. And then on the altar you have the cup. And then in the cup you have this invisible transformation which is the thing which brings us into communion, you know, so even the actual structure of the church is the same structure as the sings are like, why then this, where's this idea of the evil coming out of the heart? And so there's some really, even, here's this one, right? So Saint Diadocus of Photici, he says there in the heart is Satan. But the key, the key there is in the second part of his quote, and that's where I started to understand it, is that there is there in the heart is Satan, though he is not at its core. And there's another amazing quote also by St. Gregory Palamas, and he says thus, when God's grace does not dwell in man. Then the demons make a nest at the bottom of the man's heart like real snakes. And they never permit the heart of man to desire the good. And so Saint Theodocus uses the image. We're talking about. We're talking about spatial. Spatial. I'm an artist. I talk in spatial terms. Okay? So St. Diocas imagines the center, and he says, I'm still saying that in the heart of hearts is that seed, but in the heart it's. It's. It is these embedded microcosms. So the heart is the image of the man is the image of the cosmos. So the same thing that happens in man is still already there in the heart. In the heart already is the same structure. It's just like, embedded into itself. And so he says it's not at its core. So it's like the heart has a first veil, you could call it, right? And that veil could inhabit. That's where those first evil thoughts kind of come out of. And then they come out. And it's. Even when I started to think of it in terms of the cosmic aspect is when I started to understand it. Like, let's say that I wanted to change Diadocus citation. And I can make it cosmic. Instead of saying the person, what if I said something there? Like there in the garden is Satan, though he is not at its core. That doesn't surprise us, right? Because we know the story, right? We know the story. And then we can. If we look at the image. Let me put up the image, right? If we look at the image, we can see exactly that, right? So there's that. There's the center, there's this axis in the middle, and there's that first little veil around the access, right? So right there in the garden is the tree, and around the tree is the snake. And that's the same. That's the image that Diadochus of Photici is suggesting is how our heart works. And so you can imagine that in the heart, right in the center of a person. And I hope by now that you don't think that I'm talking only about the little pump. If there's anybody who still thinks that, you're going to be very, very confused. When I say that in the heart is as if there's a little heaven and a little earth in the heart already, you know, and that's what St. Gregory of Palamas seems to suggest when he says if the grace of God is not there, is not active in the heart, then at the bottom of the heart, all the snakes, right? Think of the leviathan now at the bottom of the cosmic ocean. You know that you've got a little leviathan inside your little ocean in your heart, right? So these structures, the imagery brings it all together so that we can see this pattern. And so a good way to understand it, if we look again at the, the story of creation and the story of the fall, we can see what happens. We can see it in that story because we have to understand it as a separation. St. Maximus talks about how man's purpose is to unify heaven and earth, that man's purpose is to unify the intelligibles with the manif, the, the sensual world. That's our purpose. And so the, the problem happens when they, when there's a split, when it breaks apart, right? And we see that right there in the, in the story of Genesis because it starts with, it starts with a desire to be God, right? So you've got this split. That's not. That wasn't, that wasn't the. That wasn't what we were meant to be. We were supposed to be united with God, but we were supposed to do it in that incarnational, that, that unit, that capacity to unify the two together. But Adam and Eve have this desire to be God. They, they try to go up. Saint Maximus the Confessor talks about what he calls sins of the right hand and sins of the left hand. You could call sins of the right hand the sins of, of heaven. You could call them something like that in the sense that pride, self sufficiency, it's this rising up, like pulling, you know, putting yourself up above things. And so then they reach up to become God and the opposite happens, right? They fall into shame. So they move from pride to shame in a second, right? In one second they move from pulling themselves up and then falling down into this sense of shame. And then sense of shame is the realizing that you need, that you're no longer in the heart. Because what do they want? They want a covering. They want to cover themselves, right? They want that veil. They want it. They're moving out already. They're moving out of the heart. And when you move out of the heart, you encounter, just like when you move out of the, the holiest place of the church or if you move out of the temple in the Old Testament, you find veils and you cover yourself and you move out. And it happens right away in that first moment in the story of Genesis where you see that, yeah, you see the structure of everything right there. And so this is probably Saint Nicodemus is a later Hesy cast. But I think that this, this description is a very beautiful description which, which kind of brings everything together in terms of what I'm talking about. So he says, we must therefore keep in mind that as the center of a wagon wheel has a certain number of spokes going out to the circumference of the circle and returning to the center where they meet. So also is the heart of man like a center where all the senses, all the powers of the body and all the activities of the soul are united. And so then this is this basic idea that I'm telling you about, this idea of the center and periphery. So a person has. Has extensions, right? We have thoughts, we have feelings, we have. We also have our body, we have desires, we have all these elements about us. And the purpose of the Christian mystic comes to be to enter into the heart. And by entering into the heart, just like if you think of a wheel, what happens to the spokes of the wheel when you get closer to the heart? They get closer and closer together and then finally they fuse into the center of the wheel. And as you move away from the heart, the further you get from the heart, the further and further away are the spokes from each other as they are from the heart. And so Father Stephen yesterday talked about how. Talked about this notion of moving away from being into non being, right? This moving away from being into non being is exactly that. Because it's not that things stop to exist. Nothing stops to exist, right? God. That's not how God created the world. Things don't stop to exist, but things will fragment, will start to dissipate, will start to fall apart. And you can see it. You can imagine that a wheel that becomes so big at some point from one spoke, you can't see the other one. You don't even know that it exists. And that's how someone can become just a passion, right? Someone can be completely taken over by a passion or completely taken over by an aspect of themselves where they think that that's all that they are because they're so far from their heart that they can't see anything else. All they can see is that one passion which has led them far, far away from their core. And so this is. This is a like. And this is like an image of a person. You could say the church fathers use different words. And they're not. It's not a system. This is not systematic. But I've taken. I've taken some of. I think what are the best Words and the best concepts to help us understand the basic structure of the person. And so I kind of separated into the structure of the person. The operation of the person is what you do. And then the actual. Even the actions of the body, because we do live in a body. And so the way that the fathers understand the person is that at the center of your center of center, you know, there is. You have the grace of God in you. You have a. You have a. You are in communion with God. You have the capacity to. To enter into the life of God. And I know Father Stephen, yesterday, he used the word deification. And some people in the crowd just got. I went to see some people jump, you know, and that's a word that is not. Is not of. People are not afraid of. In the orthodox tradition, you know, that if it's properly understood, we don't believe that we become God by nature, that we lose our human nature, but that we. That the purpose that God created us for that is why God created the world. God created the world so that we could participate in his life, because that is the love that he has for his creation is to enter into a true communion. Like a man and a woman become one body. So too, God unites himself with our soul. And that is the. That is the. The ultimate goal of everything. Okay? It's important to have that. Or else if we don't have that idea, then we run into trouble later on when we start to understand what religion is about. Because if we don't know that that's what it's about, then we end up calcifying in our rules, as Father Stephen talked to us about. We need our rules. We need them, but we need to be careful to think that this is not about legal moral problems. It really is about transformation of the person to enter into God. And so the fathers talk. Talk about a capacity that we have, which is the noose, which is the intellect. It is the capacity to directly intuit the presence of God. It is above. And it's hard because we don't very often have access to that anymore. Our world is the. Is the enemy of this capacity. The entire modern world is there to extinguish the noose as much as possible. So it's very difficult. We kind of. Sometimes we kind of have to take it on faith for a while, but then we do have. I think that everybody sometimes does come in contact with the noose. Sometimes they don't know that that's what's happening, that we have these. Sometimes these intuitions, these little Little spot, you know, these little wake up moments when you, you kind of see things come together. You can, you can see, all of a sudden you feel like you can see God work in the world, how God's will manifests itself and often lasts like a fraction of a second. Sadly, you wish it could hold. I mean, that's what the saints want to do. They want to hold on to that and kind of make their life into that, those little moments. But so that is the, that is the highest aspect of man. Then we have our thoughts, right? Our imagination, our will. All the things that modern person thinks is the summity of a person, let's say, like the fathers will tell you that you are not your thoughts, that you are not your will, that you are not your imagination, you are not your desires. You know, those are, those can participate in your being. But if you identify with those things, then you are going to be on one of those spokes which is moving away from the center. And if you, if you go too far, then at some point you become possessed. You act. You know, they use images of demonic possession. You become possessed by that thing because you think that it's all that you are. And so they talk about how we have also a desiring capacity and an irascible capacity, the capacity to be annoyed, to get angry, to, to, to, to, you know, to be impatient. All of that can, can be also, is part of our, of our, our makeup, you could say. And so the Hesy Castle, they have a. Obviously there is the participation in the liturgy, there is all that. But more particularly, they, they developed a spiritual practice. And the spiritual practice is meant to lead to this theosis, this deification. That is the purpose. And what it does is it uses operations of the soul, like attention, like memory, like invocation, to enter into the heart. And now you have to, you have to think about those things. They're not arbitrary. Obviously they're not arbitrary. This idea of attention, what, what happens when you pay attention? What is that? We use another word, we call it focus, right? What does that mean? It means exactly that. It means concentrating means to concentrate, means to move towards the middle. That's what attention does. And so this notion of being attentive is a integral part of the mystical practice. So what are you attentive to? You have to be attentive to the other parts of yourself because you see them go wild all, all, all around you. You have to be attentive of what's happening. And then you have to remember God. Now think again about that image. Think of that wheel, right? What makes. Because all your parts, that wheel, all the spokes, there's nothing wrong with them. There's nothing wrong with your thoughts. There's nothing wrong with desiring, nothing wrong with your body. There's nothing evil about any of those things. They only cause a problem when they forget, right? When they forget what they're attached to. And that's memory. Memory is the capacity to stay connected to something when you're in a distance from it. So you remember your origin, you remember something that you didn't even participate in. You remember as you. As you remember. And obviously the ultimate act of memory is communion, which is, let's say, perfect memory, where even though we are eating bread and taking wine, even though we are in a church in the 21st century, the memory is so perfect that we are completely also united to that which we're remembering, that we are completely. We are also participating in that moment where Christ gave his body and his blood. We are united to that. And so these are the. These are the faculties, you could say. And invocation is the same. The invocation is a. Is what's called the Jesus prayer. People, who here has heard of the Jesus prayer? Maybe most people now. Okay, so most people now, I've heard of the Jesus prayer. And so the Jesus prayer has several forms. It's the most complex form. Lord Jesus Christ, son of God, have mercy upon me, a sinner. But the fathers say that it can be contracted to a point where it's only Jesus or only Lord Jesus Christ, depending on the situation. And so it is ultimately an invocation. Now this is, if you think again about this. This wheel, right? Think about this idea also of the. Of the invisibles in the Bible and in any traditional way of understanding, that is what names are. Names are. If you name. Once something has a name, it has a being. If it doesn't have a name, it doesn't have a being. Okay? A name brings things together. I know that's probably a little hard to. That's really hard to get. Okay, so Adam names the animals. And by naming the animals, he. He participates in their capacity to have meaning. And so we have to understand that unless something has some meaning, it. Let's say it splinters, right? It splinters into infinite detail. Once you have a name, well, you can experience it. You can experience it in your life. You can experience it. The difference, let's say I always tell people, if you're sitting on a bus and you're surrounded by strangers, right? And then someone, you know walks into the bus, what happens? Where does your attention go, right? That person will glow, Will glow. That person will shine. It will. They'll stand out like a beacon. Everybody else is just gray. And then all of a sudden, that person stands out, right? And that's. That's the. That's because you know their name, okay? And knowing their name is not just a technical thing. It means you know who they are, you. You know, their being. You. You. You have encountered them. You have been at least somewhat in communion with them to a certain. Enough so that you recognize them, right? And so this notion of invoking a name is really this capacity to be in communion with something, to know something, is to invoke a name, you know, and this is so kind of understood that even in, like, popular superstition, if you go to, like, if I lived in Africa for several years, this idea that you should not reveal your name to certain people was very important, because if you reveal your name to the wrong people, then they have power over you because they know you. And so this is a very, very deep. It's a very deep understanding of how the difference between something which has. Has a name and something which doesn't is that you have this communion with it. And so the invocation of the name of God, like we do in prayer, the invocation of Christ, is this call to be in communion with what ends up being our own origin, what ends up being the very source of our being, which ends up being the very thing which we are aiming towards, which we are we, which we are going towards, hoping to live in the fullness of the image of Christ. And then. And I'm wondering if people are concentrating, if I've lost everybody, watching everybody. I'm like, interesting. I won't ask who's lost and who's concentrated. I will not ask that. All right, so I'm going to go quickly over this last part, but I think it's important to. To mention and. Because the. The. The. The hesycast also had a physical practice, right? And it was the repetition of this prayer. Often it was a looking down either at their center, looking at their heart, sometimes looking at their navel. And then they would also time their. Their prayer with their breathing. And they would talk about entering into the heart and compressing even the air as you breathe in, compressing it and pushing it down into your heart. And I want to talk about this a little bit because it has been extremely demonized. In the early 20th century and the late late 19th, early 20th century, this practice was demonized even within orthodox circles. And I think that the reason why it was demonized was because of an infiltration of this modern way of thinking, this technical vision of the body where we don't understand that these embedded microcosms that I'm telling you about, the fact that all these structures fit into each other also includes the body. The body is not excluded from that. The body fits into that pattern. The body has to pray as well. And so this idea, for example, if you think of just breath, it's not that hard to. The fathers talk about how inhaling is gathering of attention and exhaling is the dissipation of attention, right? But that's actually true. I mean, what's the first thing we do when we're born? Right? What's the last thing we do? Right, okay. And think about anybody. Think about when you're. Who here, most people have experienced it. Who has experience concentrating on something and realizing that you're holding your breath, right? This is not. This is. This is. This is. There's nothing arbitrary about the practice that the fathers developed that we do in fact, concentrate when we hold our breath, right? And the expiring of the. Of the. We've even used the word expire to talk about dying. The expiring, exhaling is also linked to death and to dissipation in our experience, in the human experience. If you think about this idea of gathering. So now think of this wheel, right? Think of the wheel that I told you about. Think of the spokes and think of this notion of gathering all those spokes, connecting them to the middle, bringing them into the center, right? Now think of the creation of Adam. How was Adam created? So Adam, God gathered the dust of the earth, gathered into one place, and then what did he do? He blew air into Adam. So that's the shape of a human person. That's it, right? This gathering in and this breathing in, that's what makes us. That's what makes us human. And it has to do with this capacity to attend, right? The capacity to remember and then to be that unification of heaven and earth. All right, this is. So this is the. When we talked about this notion of dissipation."}
{"episode_id":"SW - #066 - 2019-10-23 - The Anthropology of Mysticism","start":2842.36,"end":2842.76,"speaker":"Jonathan Pageau","text":"So."}
{"episode_id":"SW - #066 - 2019-10-23 - The Anthropology of Mysticism","start":2844.6,"end":3796.87,"speaker":"Jonathan Pageau","text":"This is senger grevinisa, liability to death, then taken from brute creation. Now remember, this image of heaven and earth, okay? So taken from the material world, let's say, was provisionally made to envelop the nation created for immortality. It enwrapped it externally, but not internally. It grasped the sentient part of man, but laid no hold upon the divine. Image. This is really important, by the way, to understand this, the problem of this notion of the Fall. And what exactly is the Fall? The mystical tradition of the east has always contended that the image of God, that spark, never went away. The image of God was always active in the human person. And the fall consisted in this veil that, that came about around that divine spark and these multiplicity of veils that kind of covered this spark. So that we forgot that it was there, that we were too far on that wheel and we forgot our origin, we forgot what it is that actually made us live. And we became obsessed with all these things on the periphery, all these desires, all these. And so then he talks about how the sentient part, however, does not disappear, but is dissolved. Disappearance is the passing away into non existing, but dilution is the dispersion again into those constituent elements of the world of which it was composed. So here you see this fragmentation that we talked about. And if you think about it, that is also what death is, right? Death is decomposition. That's what death is. Death is. You have something, a person, and it's holding together. It's a bunch of mush, but it's kind of. It's kind of holding together. And then at some point it starts to break down and the elements that constitute it start to pull away from each other. And that's death. That's death physically, that's also death spiritually. It's the same process where your thoughts, your desires, your peripheral elements of yourself, they start to pull you apart and they rip you. And everybody has experienced that. Come on, right? You can even experience it literally at the same time. You can have two contradictory desires pulling you apart. And you're like, how is it that I can have these two desires? They don't seem to fit together, but they're happening at the same time. And you're like, okay, I'm literally being ripped apart by my desires. And I think everybody has experienced that. So here's this image that I, that I told you about of the creation of man and the breathing in, right? And so you can imagine, you can imagine in that little moment, you cannot imagine Adam as a hesy cast. And he is. And that breath is coming from Christ and that. And. And Adam is saying, what is he saying? He's saying, Lord Jesus Christ, he's saying, that's his. He is invoking. He is invoking. As he is receiving that breath, he's recognizing his Lord as he is being created. And you can even see in his gesture that he is acknowledging Christ as he is being created. So here is Saint Hezekiah of Sinai. This is what I'm talking to you about in terms of the wheel, this wheel, this distraction. So it starts by suggestion. Then comes attachments. Our thoughts mix with those of the evil spirit. Then there is union. Two kinds of thoughts hold, counsel and design the plan for sin to be committed. Then comes the visible act, the sin. If the spirit finds itself in a state of attention and sobriety and by contradiction and invocation of Jesus Christ, prevents the imaginative suggestion from developing, it does not have continuation. So in this quote, what you have also is a very, very powerful link between the cosmic and the personal. This is something that people really struggle with too, when they, when they read the Fathers, I think. But once you understand the idea of the human person as a microcosm, all of a sudden this whole problem of demons becomes less complicated because, you know, the idea that there is a cosmic version of your passion, you could say there's a cosmic version of your sin, and you mingle with that when you're moving in that direction. And you know there's a cosmic version of it. You know why? Because all of you are going to have the same experience. So if all of us have the same experience of sexual desire or of thoughts of control over others or of. Of pride or all of that, and there's a pattern to that experience, you can describe it. The Church Fathers describe it and we recognize it, right, is because this, because there is a cosmic version of that, and we participate in that by being microcosm. So there's a link between our sins, our passions, and the, the principalities, you could say the, the. The. The cosmic forces which are there and are pulling us, are pulling us as well. So, okay, so now hopefully most of you have kind of followed me in where I'm going. So my contention, at the very beginning, long time ago, I know my contention was that this structure, this idea, this wheel, this, this, this. This relationships of center, of memory, of attention, of dispersion, all of that, that's the structure of reality. It is not arbitrary. It is not just personal. That's how the world works. Okay? So hopefully I want to show you a few things that will help you to see that it's there. Ok, so I want to look very quickly at the story of the prayer at Gethsemane. So, and they went to a place called Gethsemane, and he said to his disciples, sit here while I pray. And he took, he took with him Peter and James and John and began to be Greatly distressed and troubled. And he said to them, my soul is very sorrowful, even to death. Remain here and watch. And going a little further, he fell on the ground and prayed that if it were possible, the hour might pass from him. And he added, and he said, abba, Father, all things are possible for you. Remove this cup for me yet not what I will, but what you will. And he came and found them sleeping. And he said to Peter, simon, are you asleep? Could you not watch one hour? Watch and pray that you may not enter into temptation. The spirit indeed is willing, but the flesh is weak. And again he went away and prayed to saying the same words. And again he found them sleeping, for their eyes were heavy and they did not know what to answer him. And he came the third time and said to them, are you still sleeping and taking your rest? It is enough. The hour has come. The Son of Man is betrayed. Into the hands of the sinners. Rise. Let us be going. See, my betrayer is at hand. And so look at the image. The image helps you to see what I'm talking to you about. And so there's a mountain or the Mount of Olives. So this is this structure, right? This is the. This is the mountain which goes up to the top of the mountain, which is that place where God and people meet, right? Every time you see a mountain in the Bible, you have to remember that. That it's. That that's the place where heaven and earth meet. It actually literally is. The place where heaven and earth meet is at the top of a mountain, right? It's. This is. This is based on human experience. It's not a. It's not. It's. It's arbit. It's not arbitrary, because it's actually. What if you go, you know, the experience of seeing the sky, the higher you are, the closer you are to it, you know? And so Christ leaves the disciples below and he tells them to do what, tells them to be attentive. I'll use that word instead. He says, watch, be attentive. Stay awake. Don't be distracted. Don't sleep, right? In Christian symbolism, sleep is always akin to what, death, right? Don't sleep. And then he says, you know, so that temptation does not come to you. And you think it's very strange. All those things are actually very intuitively right. But there's kind of strange that all those things are kind of brought together, but they're. They're exactly right, if you understand what I. What I'm talking to you about. So he leaves these multiple. All the disciples on the edge. And then alone, he goes up. And what does he do? He submits to the Father, right? He. He accepts what he is there to be. He accepts what he is there to do, you know, and he doesn't do it without difficulty. He doesn't do it without sacrifice. He doesn't do it. He does it in tears, but that's what he does. So he be. He becomes, you know, he's. For our sake, he was. He's Obviously, the Logos doesn't change, but. But for our sake, he shows us that he is what he's there to be. That. That he is entering into the space that he is meant to be. He's already entering into that space where he will be sacrificed. And so you have even have this constellation of heaven which comes to him, which is amazing, you know. So you have. He goes into the mountain, goes up to the top, goes into that central space, and the disciples on the edge, and they are not able to stay attentive. They're not able to stay awake. And then he received this consolation. So it's a cosmic version of that story. You have this central space which he goes up to. You have this margin on the side with this multiple people, and they have to attend. All right, let me show you one more. So I'm going to give you two seconds to try to see what I'm talking about here. Okay, so now in this image, we have the heart itself. We have this cave in the middle of the image, right? And then in that image, we have that seed. And every time you see Christ represented as a child, remember that it also is there to manifest to us this notion of the Christ hidden in creation as well. So here's Christ hidden in this cave, just like Christ is hidden in us, just like the divine Logos is hidden in the heart of heart of hearts of the world and of our souls. We see this beam of light that comes down from heaven. Remember St. Paul, who talks about the light that comes down into our hearts? So you see this light which comes down, and then already in the heart, they have their animals already there in the heart. So those animals are that. There's that structure. There's that structure with the star above. And then in the heart, you have the animals that are there kind of like this first veil around. Around Christ. And then if you look at it big, if you look at the bigger sense, you have this gathering in of the shepherds and the wise men who are being gathered in and are coming now towards Christ to worship him. And then above you have the spiritual principalities that are participating in this. And then below you have the distraction. So there is St. Joseph who is being distracted by the devil. The devil is saying, yeah, you know, you should, you know, I'm not so sure about this. And he's, and he's, and he's, he's wondering. So there's a reason why we also, we put him at the bottom of the icon. And so this image becomes a, another microcosm of the same, of the same story. And I could, like, I could go on, like, I, I always give too many examples, but there are so many, many, many examples. Everything has the shape. Let's look. You look at the, the, the, the pattern of the holy schema. Right there is the center of the cross. There's the crown of thorns around the center, just like those animals were around Christ in the, in the cave. You know, just like that first veil. Then down at the bottom you have, you have death, you have the ultimate sleep, the ultimate distraction. And then at the top you have the announcement of the king of glory. Right? The same with the church. The church has the same structure. Then it's more, it's more of a mountain structure. We have the altar, like I said, you have the cup, you have the communion inside the cup. Then you have these veils and veils until you reach the narthex where we are there to be distracted. We could add the church hall, which we are allowed to be somewhat distracted in the church hall. Right. As we kind of move out towards the outside. And so I hope that especially, I hope that with the last example that I gave you, it landed a little bit more into reality. But this is true of anything thing. If I have a cup, the cup has a heart. There's something which is making it a cup. It has a heart, right? And it also has parts which could distract it. And if I break it into pieces and I fragment the pieces, then we lose the memory of the heart. We lose the memory of what that is for what its identity is. And that is just everything is like that. Everything has a core, has an identity, has a logos. Everything has parts. And those parts have to be connected to the middle, have to remember it. That is just the shape of, like I said, it's the shape of reality as we experience it, as we engage with the world, as we are conscious beings which are looking out and engaging with the world. So hopefully that little meditation will get all your gears rolling and. Yeah. Thank you for your attention. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description and so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved you can also support the podcast financially going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
