{"episode_id":"SW - #251 - 2022-09-10 - The Kingdom Of Heaven","start":0.48,"end":1214.94,"speaker":"Jonathan Pageau","text":"So in my last video, I did a reaction to a quote by Sam Harris that we saw in an interview looking at what exactly is heaven in the Christian conception. And to be honest, you know, I didn't only do it as a reaction to Sam. I did it because I noticed that a lot of Christians were confused about what that was. And a lot of Christians have a very literalistic or materialist, only materialist version of what it is that heaven is in Scripture. And so in the last video I used Dante and I used Heidegger and a few other examples, and on social media I've quoted from the church fathers. But I thought it would be a good idea to go straight into scripture and to look at the words of Christ himself and what he seems to be talking about when he mentions heaven. And so we're going to look at the. The story of the two tenets, which was yesterday was Sunday's Gospel reading during in the Orthodox Church. And we'll see how it helps us understand what heaven is. This is Jonathan Pedro. Welcome to the symbolic world. So the parable of the two tenants is in Matthew 18. So I will read the text for you and we'll look at how it helps us understand what it is that heaven is and what it's referring to. And so it starts in chapter 2, in verse 23 it says, Therefore the kingdom of heaven is like a king who wanted to settle accounts with his servants. As he began the settlement, a man who owed him 10,000 bags of gold was brought to him. Since he was not able to pay, the master ordered that he and his wife and his children and all that he had be sold to repay the debt. At this, the servant fell on his knees before him. Be patient with me, he begged, and I will pay everything back. The servant's master took pity on him, cancelled the debt and let him go. But when that servant went out, he found one of his fellow servants who owed him a hundred silver coins. He grabbed him and began to choke him. And pay back what you owe me, he demanded. His fellow servant fell to his knees and begged him, be patient with me and I will pay it back. But he refused. Instead, he went off and had the man thrown in prison until he could pay the debt. When the other servants saw what had happened, they were outraged and went and told their master everything that had happened. Then the master called the servant in. You wicked servant, he said, I canceled all that debt of yours because you begged me to. Should you have had mercy on your fellow servants, just as I had on you in Anger, his master handed him over to the jailers to be tortured until he should pay back all he owed. This is how my heavenly Father will treat each of you unless you forgive your brother and sister from your heart. So the first thing to notice is that there are a few layers of meaning that are brought together, a few analogies to help you understand what it is that heaven is and what is the kingdom of heaven. And so the first thing that is mentioned is, of course, a king, because the kingdom is related to a king. Therefore, a king is a good image to understand what it is that heaven is, that is what it is that is above you in terms of a hierarchy, a hierarchy of relationship, a hierarchy of causality as well. Here we're not talking so much about a hierarchy of causality directly, but something like a hierarchy that, let's say, lets the level underneath it existence without being completely subservient to it at the top, giving a certain amount of freedom for lower levels of hierarchy to exist. There's this hierarchy, and the servant owes the king amounts of money that are, what is it, 10,000 talents in the original text, something like millions and millions and millions of dollars, something that he could never pay back. And so his existence is dependent on the king is dependent on the mercy of the king. And the king offers the mercy despite that he owes everything to heaven, that he owes everything to that which is above him. The king lets the lower level of the hierarchy exist through a kind of grace, you could say, by letting it exist on its own without being so dependent on the higher levels of the hierarchy that they are complete slaves and completely imprisoned by a tyranny of authority, you could say. And so it is, first of all a beautiful example of the manner in which God lets us exist, or how God created the world in a way that is not just a bunch of robots that are there to serve God, but that there really is this sense in which the way Christians understand creation, we understand that every level of this hierarchy of beings, this hierarchy of relationships, has its own existence to a certain extent and is not completely. Is not in an illusion or is not completely dependent from. From the levels above him. And so you can understand that. So you can see that the manner in which the kingdom of heaven is described is as the relationship in a hierarchy between that which is above and that which is below. And so when people tell me that this is some kind of superfluous interpretation, that this is something that comes later, it's something that we superimpose on a bunch of materialists who Think that heaven is just the dome in the sky and that Jesus is sitting above on clouds and is going to come down. And it's completely this materialist interpretation. You can see that this is already discounted in Scripture itself. It's already discounted in the words of Christ, who describes the kingdom of heaven as a relationship, hierarchical relationship of different causality. Now, in other places in Scripture, he'll describe it in different ways, but it will always come back to something that. Like this. The relationship of a seed to the fruits or relationship of the heaven to the earth in terms of a hierarchy of procession of authority or procession of grace or whatever. It is the manner in which it's described. It is described as a relationship of that which is above. Very much in the way that we understand a boss today or something that we describe metaphorically as being above. This is also the manner in which Christ understands heaven. And. And so he is, of course, giving an allegory. He's giving a story to help you understand the relationship of God to creation. And what's interesting about this is that the manner in which Christ describes the relationship between that which is above and that which is below is actually the notion of a pattern to be embodied. That is that what we receive from heaven, we have to embody it ourselves in the world. That is the grace that we receive from heaven and has to be embodied in the world, or else it loses its reality. It is not a kingdom of heaven. It is not the rule of heaven over the earth. And so the image of the king, which. The example that the king gives or that which the king gives is completely a complete other level of value to that which the servant is able to then give horizontally, let's say, to the other servants in the house. And so this is a way to help you understand that actually a difference in quality, which is very hard to capture in a parable. It's hard to capture in general, the difference of quality. But here it's represented as an amount so much that it actually would be completely impossible for any normal person. For any person to pay that back. So he owes so much that he could never pay back it back. It's a kind of apophatic way or a kind of negative way to help you understand that we're dealing with another level of grace, another level of relationship between the servant and the king to then the servant with the other servants at the same level that he is. And so the kingdom of heaven is when that which we receive from above is now reproduced on the horizontal level. That is you have to embody the pattern which comes from above. And that is how you are a participant in heaven. That's how you receive the kingdom of heaven. And so there's nothing arbitrary about the way it's described. It is completely coherent in terms of what it is that heaven is. And then what happens is that if you do not embody the pattern from heaven, the higher patterns, then you will be, you could say you will be cut off, you will be tortured, you will. The pattern of heaven, that which is above you will. Will appear like a judge. It will appear like a judge because it is an ideal that you're not embodying, though you should. And now the ideal appears as something which pains you, which makes you suffer. So you can understand that, of course people will get annoyed because it sounds all cruel and God is cruel. But this is something that you can experience all the time, which is that if you want, you know, sorry, I'm using a lot of sports analogies these days, but it's a good way to understand it. That is, if you have an ideal in playing a sport, and that ideal, let's say, would be the reason why you're in this sport in the first place, but you are completely incapable of embodying it in the world, then that ideal, to the extent that you remain within that sport, is going to make you suffer. You're going to suffer basketball, you're going to suffer football because you're not able to embody that pattern, or you're not willing, or you're not willing to practice or whatever it is you're doing. Say you're not willing to practice. And because you don't practice, then you can't really play very well. So what's going to happen if you stay in that sport is that you're going to be captured by it, you're going to be tortured by it until you're able to pay it off, until you're able to justify your connection to the sport. So maybe if you're on a team, you're going to stay on the bench the whole time. And in other types of images that Christ uses, maybe you'll be cut off, that you'll be thrown out of the team because you're not able to. You'll be judged and thrown out by the team because you're not able to be in the kingdom of basketball. You're not able to be able to participate in the kingdom of whatever it is pattern that you're trying to focus on, to concentrate on, or to embody. And so what's important to understand as well is that it really is, you know, it's not just a bunch of. It's not only also only a question of ethics. It's not just a question of morality. It is a question of. It is a question of that which makes you exist at the level you exist. And that you embodying it is what is continuing to make that world exist. And so this idea that you owe something to God is a good image to help you understand. It's like you actually, your connection to that which is above is a connection of existence. And if you don't embody it properly, then you're going to suffer in that existence. And you can understand it again. Like, if you think about a sport, it's not about just the rules of the sport. Like, you can know all the rules and you could even follow the rules of the sport. But that doesn't mean you're going to embody the spirit of the sport you're playing, that you're going to embody it at a horizontal level. That has more to do with a kind of practice, a kind of, you know, a kind of engagement, you know, dedication, and also just a focus and an energy that you put into something. And it's different than the notion of ethics or doing ethics in the way. The weird way that we talk about morality today or even the idea that we think about in terms of rules. It really has more to do with allegiance to the pattern that which gives the pattern above and then manifested in the world. And one of the things also that is shown here is that these types of patterns, they actually don't appear so much as abstract things. And so sometimes I represent them as abstract things to help you understand. Because the truth is, most of these types of patterns are personal. They appear as personal examples that are then embodied in the world. And so you can see it like you can imagine. Let's use an image of a basketball again. And so the sport of basketball is started by people who have given the examples and the rules of the game. Like, there are many games that have been invented in the world. There's thousands of other games. Why is it that basketball is particularly interesting is that there have been in the sport figures that have shown that really were shining. And there's something about the embodiment of the sport which manifests a grace, which manifests something that people are attracted to and find valuable. So in the world of basketball, think of someone like Michael Jordan. And so you can imagine that someone like Michael Jordan in the world of basketball has done something like ascend into heaven. And so he has reached a level of principality. And so it's not just that he's a good player, it's that he has become an example in ways that actually make the sport more. And so Michael Jordan has raised the level of what is possible in basketball and has therefore established a path and an example for people to follow in order to embody more basketball. And so before Michael Jordan, certain moves, certain ways of playing, certain things weren't possible, they just weren't on the horizon of possibility for people. But now that someone has risen up into heaven, has risen up in excellency in a manner that is so high, then that becomes an example, a point of light that others can now follow. And so you can see in that world the game of basketball was transformed and elevated because someone went up into heaven. Of basketball, you could say, and this is true of a lot of sports. For example, you've probably heard the story of how people used to say that a four minute mile was impossible, that nobody could ever run a four minute mile. But then as soon as someone elevates themselves and reaches that impossibility, you could say then they something like ascend into heaven. And now all of a sudden they open the door for those behind them. And now all these people very quickly will be able to manifest that which was manifested by that pioneer, that first person. And this is true of many, many fields, many, many examples. But it can help you to understand, you know, what it is that we're talking about when we're talking about heaven. Of course, I'm not talking about basketball. I'm talking about in general the notion of the relationship between principalities, the relationship between that which gives the example or that which reigns over a certain amount of reality in the world. And of course in the case of God, that is all things. In the case of Christ, of course, we also believe that he has gathered all of this into himself. Like you can see in St. Paul at some point he talks about how Christ is at this moment, you know, ascending the hierarchy and dominating over all these principalities and thrones and whatever. And so the idea is that he is, you know, invisibly becoming the head of something. So you don't see the fruits yet. And you know, you can think that Paul was just imagining things, but after a few hundred years when Rome completely converted and, and you know, huge amount of the, the world converted and it's contin. Still happening. People are still, you know, in Africa and Asia there are still mass conversions There are these huge movements towards Christianity that you could say that Christ is ascending, still ascending. You could say in a, in a secret way, ascending the hierarchies of principalities and still subjugating different principalities to himself. And so that might sound like magic, but if you understand it, then you can understand a lot about how the world lays itself out, can make sense of a lot of things. And that actually, you know, even our countries, our families, we don't base ourselves on ideals, we base ourselves on examples. You can put up all the rules you want for your family, you can decide your family is going to do this and that, but if you don't, as a parent, you don't lead by example. It's just not going to happen. Kids look at people as examples and it's the same. A country is not based on abstract principles. Countries are based on founders. Countries are based on people who have left stories behind them, who have left institutions behind them, who have pioneered and we follow. That is actually how the world works. And as we try to move towards abstraction as that which leads us or that which constitutes reality, then we will watch things fragment more and more. And if we try to destroy the story of our origins and destroy the story of our leaders, then we will find ourselves scattered and in despair. This is inevitable. And so hopefully this was just another little example to help you show that when we talk about heaven as a hierarchy of causalities, a hierarchy of, of relationships, let's say that this is not something that we're making up or even something that you find only later in Dante that, like I was quoting, but it's something that is there already in Scripture because when Christ talks about the relationship between what God does and the fruits that we manifested in the world, that is just how hierarchies, that's just how hierarchies work. You know, if you're in an army, if you're in the army and the, you know, the commander sends down a command, hopefully leads by example. If he's a general, especially the old style generals, like if you think of Alexander, who would lead by example into battle and then would expect his men to follow him behind him, and if they didn't, then they would not be in the kingdom of Alexander, they would be in trouble, they would be under judgment, you could say, and there's a million millions examples of things like that, some of them can actually be negative. Like they could be, you could follow something, a false hierarchy, right? That's why, you see in Scripture, you know, the, the devil is called the, the Prince of the Air. Or you see that in different traditions, the notion, you know, the, the king of this world. And so there are, there's also false versions of this, false hierarchies, you know, twisted hierarchies as well. But even though they're twisted and false, if you even, you looked at, at how twisted they are, I can still help you understand what it is that we're talking about when we say that, that, you know, the devil is the Prince of the air or, you know, the, the king of this world. We're not talking about the fact that he floats around in the sky or that he sits on a throne, though those images are perfectly acceptable analogically, to help us understand what it is that we're talking about. And so thank you for your attention. Hopefully this was helpful. Thanks again everybody for supporting what I'm doing. I really appreciate it. I know things are getting wilder and wilder out there and that it's also becoming more difficult financially. And so to all of you that have continued to support my work, I truly appreciate it. And, and hopefully we'll continue on from today. So talk to you very soon. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon, the Pageau videos as well and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
