{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":0.16,"end":62.57,"speaker":"Laura Diaz","text":"Tucson, the Weight is Over Mediweight loss. They're officially open on North Oracle Road. That's right, no more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight and serious risks at mediweight loss. I got the same medication but with a customized plan, weekly check ins and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com if I was asked what."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":62.57,"end":128.05,"speaker":"Fr Josiah Trenham","text":"Is the number one most difficult Christian behavior that must be assimilated to by catechumens, I would say it's learning to endure yourself. Being patient with failure and not freaking out. Recognizing that you're not a saint, that the Lord is going to make you one. And you may make a lot of progress in the life towards that destination. You may make less and everything in between depending upon how much you're engaged. But you're not going to make any until you learn to put up with yourself. There's only one virtue that Jesus ascribes by itself salvation to. It's called ipomoni in Greek and it means patient endurance. And for that one alone, he says the one who has ipomoni, the one who endures to the end, will be saved. Yeah, you might be a wreck, but if you can endure yourself, keep yourself in the church, keep yourself repenting and keep getting up, you're going to be saved."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":140.35,"end":185.78,"speaker":"Jonathan Pageau","text":"This is Jonathan Pedro. Welcome to the symbolic world. Hello everyone. I am overjoyed to be here with Father Josiah Trenum. Many of you who are watching this will have already seen him. Father Josiah is the priest and the pastor of St. Andrews Orthodox Church in Riverside, California. He's also the head of Patristic Nectar publication that publish books, they have podcasts, they have videos, and you have probably seen him Talking about Orthodoxy and also other subjects, all on the social media. And so, Father Josiah, thank you for talking to me."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":186.1,"end":188.42,"speaker":"Fr Josiah Trenham","text":"Thank you, Jonathan. Very happy to be with you."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":189.14,"end":265.57,"speaker":"Jonathan Pageau","text":"And so Father Josiah and I have seen each other a few times. I've been to his amazing parish. It's a. It's astounding what it is that they're able to do. They have a school now and they're looking towards all kinds of taking over some of the social services that we think of helping people, doing all kinds of wonderful things, full of families and there's even like a brewery associated with the church. It's quite, it's quite. It's quite an astounding thing. Like, I have to say, I was. I feel very inspired by the parish. Another thing that inspires me quite a bit is also to see the effort that Father Josiah and his parish are doing to get through the ethnic problem of Orthodoxy. You know, they're joining, they're making these beautiful way in which they're joining the music of the different jurisdictions, some Byzantine chants, some Russian chant, and, you know, chants from different traditions kind of joined together. And so Father Josiah has been on the forefront of something that seems to be happening in America. A kind of reawakening of people towards Christianity and in our case, more specifically towards Orthodoxy. And so, Father Josiah, maybe you can tell us a little bit about when it is that you started seeing this happening in your parish."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":267.33,"end":352.21,"speaker":"Fr Josiah Trenham","text":"Well, thank you, Jonathan. I've been a priest for 31 years. I was ordained in 1993. So I've been trying to fulfill the priest's calling, a portion of which is evangelization. Any decent pastor has to both lead his people towards God and take care of his flock, but also study the culture. This is the tradition of the church is that priests have to be students, both of the scriptures and that which is unchanging and also of the culture to form a bridge and to be able to preach the gospel to people. So I have been watching and I would say that I have seen a number of movements and cycles in these three plus decades. But the most exciting has been really the last four years. The last four years. So there has been, when I first was converting, this is the late 1980s, the early 1990s, there was, had been a large movement towards Orthodox Christianity that had been going on for about 20 years. Remember at this time, from about 1955 on the great ascendancy of Roman Catholicism, which was just exploding from the turn of the century, from 1890 really until about 1955, people like the great Archbishop Fulton Sheen who dominated the television. I mean, he was the most watched person in 1955."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":352.6,"end":352.84,"speaker":"Jonathan Pageau","text":"Really?"}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":353.24,"end":628.11,"speaker":"Fr Josiah Trenham","text":"Yeah, can you believe that? And all he was doing, all he was doing was he had his little Beretta. He was quite an educated man. He had a PhD from the Louvain and he would write, you know, theological like lessons on a chalkboard and he was the number one watched show. And Hollywood used to send their movies to Archbishop Spellman, Cardinal Spellman in New York City. And if he didn't give the thumbs up, you know, the producers would reconsider or make changes. You know, I mean, we can't even imagine that world. But that's what it was. They had in the 50s, they had, the Catholics had 6 million kids in their schools in this land today they have 1.5 million. Wow. A 75% reduction. So something was really going for them. In the first half of the 20th century, mainline Protestantism was strong, but really from the middle of the 50s on, there was a massive kind of over assimilation to American life. Just imagine President Kennedy, you know, the first Catholic president, when he was being grilled by a mostly Protestant Congress and public, he made it very clear that he would not allow his, you know, religious faith to influence him in his governance. You know, what a bizarre thing to say. I mean, you're not going to allow your religious. But that's what he had to say to get elected as a Catholic. But he did it. And that was a major accomplishment for the Latins. But they have been, you know, the multiple scandals, they've been suffering terribly. The Latins have just been tanking the last half century. And the same thing happened with the mainline Protestant churches. So most of the second half of the 20th century, the mainline Protestant churches became very secularized and many people came into the orthodox faith. For instance, the man who catechized me had been a very influential Episcopal priest in Los Angeles. In 1977, when the American Episcopal Church began to ordain women, that was it. He left and he became Orthodox under the late Metropolitan Philip Saliba, who was a tremendous evangelist for Orthodoxy in America. During his archbishopric, which was from 1966 until 2014, almost 50 years, he received so many Protestants. When I became Orthodox in 93, I met Priest after priest. The vast majority of our priests were converts from. They had been Catholic priests, they had been Lutheran pastors, they had been Episcopal priests, and now they were Orthodox. And so that was just the milieu into which I came. After about 10 years, around 2004, that really the incursion into the Orthodox Church from non Orthodox clergy really stopped. And the great sense of Orthodoxy coagulating groups together and with the hope of becoming an American Orthodox Church, really collapsed around 2004. And since that time, up until Covid, I would say we were in a period of very serious decline, very serious. All jurisdictions were shrinking, some shrinking more quickly than others. And then out of the blue, comes the COVID catastrophe, and death shows its face. And the next thing we know, we went from shutting our churches down by order of the state. And here in California, it was really bad, really bad. Our governor, Governor Newsom, passed orders forbidding us even to sing, like literally regulating singing. Such a catastrophe. Such a catastrophe he actually was. His orders were refuted five times. He lost five cases before the Supreme Court before he even acknowledged losing one, and loosened things up. Thankfully, in the county where I live, we didn't obey him at all. Our sheriff went before our county supervisors after the first unconstitutional order and said to them, if you think I'm going to support the shutting down of churches and, and enforce your unconstitutional laws, you have another thing coming. So nothing happened here. We just cannot went on as usual. But since that time, really since death showed its face, I have seen a massive, massive movement towards the church. I'll give you some numbers. Over the course of my pastorate until Covid, I would have maybe 20 or 25 catechumens. And I considered that pretty good. We worked hard."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":628.27,"end":629.87,"speaker":"Jonathan Pageau","text":"That was amazing. At the time."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":630.51,"end":717.64,"speaker":"Fr Josiah Trenham","text":"At the time, we were feeling really good about it, but everything's perspective, and we were feeling pretty good. And we were working constantly, praying for more and trying to fulfill our duty to make a bridge to our brethren in our community. And then Covid hit and it just spiked. And it's continuing. It has shown no sign of stopping. And as of last Pascha, we received our converts into the Orthodox faith always on great and holy Saturday. In the eve of easter, we had 110 catechumens. 62 of them we received into the church. Others needed a little bit more time. But since then, we're back up now to about 95, almost 100. And I suspect we'll be at 120 or 130 by the time that Easter comes. Those numbers just are continuing to increase. And I usually do about 10 or 12 trips every year around the United States to give retreats at different parishes or universities. And everywhere I go, Jonathan, everywhere I go, the numbers are massive. I was just in Ben Lomond two days ago. I was in Walla Walla a couple Washington a couple days before that. I was in Raleigh, North Carolina before that and I was in North Royalton, Ohio before that. All like in the last two months. And in every one of those places, one had 80 catechumens, one had 54 catechumens. I mean, just shocking. Absolutely shocking."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":717.96,"end":728.2,"speaker":"Jonathan Pageau","text":"That's amazing. I mean, some churches, I'm seeing it like they're doubling, tripling, they don't know. They just. Some people, some parishes just finished building their building and they already have outgrown it."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":728.2,"end":730.64,"speaker":"Fr Josiah Trenham","text":"You know, what a great problem. What a great problem."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":730.64,"end":772.67,"speaker":"Jonathan Pageau","text":"What a great problem. Exactly. And so what is your, what is your vision? I mean, what do you think? Do you think it's, it's just Covid. Do you think there's something else afoot? Do you think there's, you know, I, before we started recording, I mentioned how everybody now and their brother is writing a book on re Enchantment. You know, some people were kind of ahead of the curve. I know Rod Dreher, for example, he's been kind of harping on, on this subject for several years. But now even Ross Douthat is publishing a book on re Enchantment. So, you know, what, do you, you think there's something spiritually happening at a, even at a bigger scale than just, let's say, what's happening in orthodoxy? What do you see that's going on, Father?"}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":774.03,"end":897.52,"speaker":"Fr Josiah Trenham","text":"Well, first of all, I should say all of those people published in the books, it's a compliment to you, Jonathan. Many of them have been listening to you and you've been helping us think about these things for a long time. So it's good that more books are being written and your message is being received. I think a lot of things are going on, larger issues, both culturally and spiritually. So when I say the rise of COVID it wasn't just the bug, right? It wasn't just the disease. The disease is serious. And especially in a very wealthy, pleasure loving, self centered culture, which, forgive me, I'm speaking about the United States. No offense to Canadians, but probably it applies directly to you also. You know, the one thing we can't stand thinking about is death. We just can't. We have no way to process it in our secular culture. Secularism has no answer for death. And so we've hidden it. We've worked for decades to hide death. All of the traditional rituals associated with death, not, not just for Christians, but even for people of other religions have all been squelched. People are mostly dying alone, mostly dying in hospitals and then they disappear. They get within an hour. Usually they're in the hospital basement in the morgue. Someone calls the mortician, he comes and picks them up and puts him in his basement, charging you $250 a night more than a nice hotel room. Really, really. The, the scandal of the mortuary movement, which is a very recent, phenomenal, an 85 billion dollar industry. It is a scandal of immense proportions. We've hidden. And then even our funerals. For a lot of Christian people, funerals don't even involve a body anymore. They're celebrations of life. The person's already been cremated or buried somewhere. More often than not cremated because of the cost involved these days to bury. It's like buying a new car."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":897.84,"end":898.32,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":898.64,"end":1001.88,"speaker":"Fr Josiah Trenham","text":"For all of these reasons, we've just kept death away. And there's nothing about COVID that in which you could do that. It was too shocking. It was too shocking. On top of that, you had just prior to Covid, this whole rise of the new atheism, this hokey kind of reassertion of a classical atheism, but very poorly done, very thin. But a lot of people bought it because they were so dissatisfied with the declining religious leadership in the West. As I mentioned, what was happening in the Catholic Church, the grotesque scandals of immense proportions. And I'm not talking about, you know, small scandals. The largest Roman Catholic archdiocese in America is here In Los Angeles, 4.4 million members. Archbishop Gomez just signed an agreement, $880 million settlement, the largest settlement ever for sexual abuse by clergy. And his predecessor, Cardinal Mahoney, was just an absolute scandal and catastrophe for decades. So I think the, the incredible lack of leadership among. In the Christian community in America made it easy to think that Christianity was cheap and not very serious. And the new atheists came along. A lot of people bought this. One of the new things about catechumens today in the church is they come and I have them describe their previous religious commitment, if any. Almost all of them have at least a small stint in atheism, which is astounding."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":1001.88,"end":1006.36,"speaker":"Jonathan Pageau","text":"It's really astounding to see that. It's like it's atheists coming back to church is what we're seeing."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":1006.6,"end":1078,"speaker":"Fr Josiah Trenham","text":"Yes, yes. So I think the combination of really us being so bad. We had a really terrible second half of the 20th century as far as Christian leadership in our country. If you look at the statistics, for instance, for evangelicals. One of my areas of interest and expertise is marriage. I wrote my doctoral dissertation on marriage and the church fathers and so I'm particularly interested in that the stats on divorce for evangelical Christians. The divorce rate amongst evangelical Christians is higher than the national average. I mean, what can you do with that? You expect your churches are going to grow? When the witness is that poor, it's that poor. So you know, our Lord says the great apologetic for the growth of the church is Christian love, faithful love. By this all men will know that you are my disciples. You want to convince them the ultimate apologetic have Christlike love, selfless love. And of course if you're throwing your spouse out or cheating on your spouse, the witness disappears very soon."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":1078,"end":1078.64,"speaker":"Jonathan Pageau","text":"Yeah, exactly."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":1078.88,"end":1148.12,"speaker":"Fr Josiah Trenham","text":"It's completely gone. So I think that the declining Christian leadership, the appearance of really grotesque secularism, the breaking forth of COVID plus all the machinations, all the sudden arising of non American standards with regards to cultural life, the compromise of free speech, the incredible manipulation by the three letter agencies, I mean this is all for an American. My forefathers came on the Mayflower, literally. Francis Eaton, 1620. My family has been here for a bloody long time. To see this appearance very recently of such non American forms of being, it's just outrageous. I think all of those things have created this incredible ball that has been rolling down and smashing obstacles that have kept people unwilling to make radical changes in their life. And I think right now, since all of those, those phony foundations have been knocked out, people are asking bigger questions, much, much bigger questions."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":1149.32,"end":1161.92,"speaker":"Jonathan Pageau","text":"One of the things we're seeing, at least the things I'm noticing, is that it's a preponderance of young men that are converting. I don't know if you, if you've seen the same thing. And what do you think about that? What do you think on there?"}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":1164.64,"end":1341.43,"speaker":"Fr Josiah Trenham","text":"In my own parish it is still a majority, but it's only a small majority. But I think you're right. If you look across the west, the majority, the greater majority are men. But I'm very happy with that right now, actually, I'm very happy with that. That doesn't mean that this is going to turn out well. That's a different subject, which I hope we'll talk about. But so far, I mean we're at the very beginnings of this, I'm hoping. But to see men confronted with a serious time tested Christian faith. I'm speaking now just about my own experience as an orthodox Christian. One of the things that really drew me to orthodoxy was the sense of solidness. The fact that I wasn't very important in a sense like my opinions mattered almost nothing. I was told A funny joke. When I was first exploring Orthodoxy, the person meant it just as something trite, but it really impacted me. The person said, look, to understand us, you have to understand this joke. He said, how many Orthodox bishops does it take to change a light bulb? And I'm like, what? The person's talking about? And then he smiled and he said, change. Now, that can be read two ways, right? One is that in general, we don't change, but also sometimes it's just a light bulb. Yeah, yeah, it needs to be changed, right? It needs to be changed. So sometimes we're not on the cutting edge of good things because we have that mentality. But I was really impressed with that, the idea, you know, when I was a Presbyterian, I was born and raised a Presbyterian. When I was a Presbyterian seminarian, I was being licensed by my local body of pastors called the presbytery. And you get tested, you have to defend, you know, your faith and get the acceptance of the other pastors in order for you to get a license to preach. And so when I went before them and I was confessing my faith, I brought the standard, which was the Westminster Confession of Faith. And they asked me, do you have any. Do you want to make any exceptions to this? I said, well, actually, I do. And they said, well, tell us what they are. So I told them all 15. All 15 exceptions. Things I disagreed with, mostly because of Orthodoxy. I had been studying Orthodoxy. I wasn't yet ready to become Orthodox. One of them was not giving communion to infants. So Presbyterians don't do that in general. And so I took an exception, and they ended up approving me and license me nonetheless, even though one of my theology professors at seminary had been sick, and he came to see me the Monday after I got licensed on the weekend, and he told me, if I was there, you never would have got licensed."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":1341.99,"end":1343.71,"speaker":"Jonathan Pageau","text":"He said, I know what you really think."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":1343.71,"end":1374.52,"speaker":"Fr Josiah Trenham","text":"Yeah, it never would have happened. But I thought to myself, you know, that that's it. That's just it, right? That they want to uphold the standard, but they approve 15 changes, 15 alterations. And, you know, the. The 16th, the end of the 16th, 17th, and the early part of the 18th century were periods of. Lots of detailed confessions were written both by the Catholics and by the Protestants. And the problem with writing all of these detailed confessions is that you say too much."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":1374.92,"end":1375.48,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":1376.04,"end":1483.49,"speaker":"Fr Josiah Trenham","text":"You know, you say too much, and then you have to revise them, and then where do you stop? What can you. What can you throw out? What do you have to keep? I went to a Protestant, Evangelical Protestant liberal arts college in Santa Barbara called Westmont, really loved my time there. And they had kind of the standard at the time, Protestant confession of faith. Some years after, maybe 20 years after I graduated, I got an email, as everyone thought did from the school, from the president, informing us that they were changing their statement of faith. And it went from this very long, detailed statement to, like, very short, like four paragraphs, but not the four paragraphs of the Nicene Creed. Right, right. Their own four paragraphs. And I thought to myself, if you were a founder, like, people put their life savings into starting this university, and if they thought that in, you know, 40 years, 50 years, the leadership was going to gut what they consider to be basic Protestantism and invent something very kind of new and simplistic, what would they have said? Are they going to give their money to that? That kind of phenomena in the Western Protestant world is so thin that I think people, young men especially, are seeing Orthodoxy and its unwillingness to budge matters of the faith. I remember I told people when I first got ordained as an Orthodox priest, I was so happy because if I stood up and preached and I said something that was untraditional, something that was not creedal, the ladies, the old ladies in my church literally would have called. They would have grabbed me by the ear and they would have just walked me out of the door. That would have been the last time I preached. They didn't need the bishop. I mean, they would have called them for sure, but they would have taken care of me. They would have taken care of me themselves."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":1483.81,"end":1498.13,"speaker":"Jonathan Pageau","text":"Yeah. There are canons in some of the Russian, later Russian synods that say exactly that. They say if a priest in your parish says something which is not traditional, kick him out. Like, you don't. Don't wait for the bishop. It's really funny."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":1499.09,"end":1500.45,"speaker":"Fr Josiah Trenham","text":"Throw them in the Bosphorus."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":1500.69,"end":1536.5,"speaker":"Jonathan Pageau","text":"Yeah, there you go. And so one of the, like, one of the things, too, that. How can I say this? One of the things that your parish has done well is also paid very much attention to beauty, both in terms of the music, but also in terms of the icons. You know, for those who don't know, there's a little chapel at Father Josiah's church that just has some of the most splendid painted icons I've seen in North America, to be honest. Beauty is expensive, Father. Like, it's difficult and it's expensive. Why are you putting so much effort into that aspect in your parish?"}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":1538.9,"end":1747.81,"speaker":"Fr Josiah Trenham","text":"This is our way. This is the way of the church. Just think of the widow's mite. Think of Mary when she broke that, you know what $10,000 vase of sacred ointment on our Savior and the apostles were scandalized. Why'd you do that? Why such an extravagant act of devotion when that money could have been better used elsewhere? I think our commitment historically to building the most splendid buildings and always making them better than anything else is a measurement of a love for God. You know, the church is for God and it's for the people. And if we're going to spend, we look at all these people who are rich and they have fancy houses. That doesn't scandalize us. But Christians meet in gymnasiums. I mean, what's the message there? You need beauty for yourself, but the church can just be ugly. No, I don't think so. I think it's a measure of devotion, which is why for 2000 years, as soon as we could, you know, for the first three centuries, in most parts of the Roman Empire, if there was a military garrison near, you could not build because you would be arrested and punished. The only archaeological remains that we have of churches before the Edict of Milan in 312 are on the outskirts, you know, near Armenia and places like that, where there weren't soldiers to kill us. And even then, we met in the best houses, and we did our best to make them beautiful. We. We had beautiful vessels in the first three months. We had beautiful tapestries, we had beautiful painted gospel books, we had beautiful crosses. But we just didn't have any churches because it was impossible. But it was like a compressed spring. And as soon as we were legalized, as soon as Emperor Constantine began to give our properties back and allowed us to actually have assets, it was like the spring just exploded. And we commandeered great Roman buildings and we made them explicitly Christian. We took these great basilicas, and we made them gorgeous. And then in the 6th century, we invented the expanse dome. And that changed everything. And we've always had this commitment to the sacred arts. Architecture, sacred music, iconography, wood carving, all of those for the glory of God. And this is just the church's way. When I was becoming Orthodox, one of the things that really drew me was the sacred arts of the church. I remember when I was in seminary, as I was mentioning earlier, as a Presbyterian, there was a new Orthodox church just down the road that was built. And I used to drive by it all the time and watch, just watch the architecture going up. And they had put in new icons, and I was too timid, actually to go in, but they left the doors open. Often. So I would just go out and, like, look through the doors. I had some sense that if I went in, it was over for me. It was over for me. And sure enough, as soon as I did start going in, I went in for Great Vespers eventually, and that was it. I would always go on Saturday nights and still go to my Protestant church. But very quickly, I looked at my wife, I said, sweetheart, why am I so motivated to go to Great Vespers every Saturday night way more than I want to go to church on Sunday morning? And the beauty just grabbed."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":1747.81,"end":1858.14,"speaker":"Jonathan Pageau","text":"Yeah, I think. I mean, of course, you know, I agree with you. I asked that question. But, you know, I totally agree with you that, or else I wouldn't have done what I did for so many years. But there is. I think also there's that contrast, you know, the contrast that's related to the situation with COVID you know, this extreme loneliness, this facing of death and also facing of tyranny at the same time. Like this contrast of what true, organic, organized liturgical community looks like. I think it's the same with beauty. Our neighborhoods are mostly ugly. If some of our neighborhoods aren't so bad, then for sure go to the shopping districts, these strip malls, and the highways and all this. There's a kind of ugliness about our world that when you go to Europe and you go to the old towns in Europe, you realize just how ugly we're used to. We've accepted how ugly the world is. And so the draw of something absolutely, you know, unapologetically beautiful. I think, like you said, there's a. There's a kind of powerful strength in that. But it's not for our sake. You know, it's. You could make a big gilded something for whatever. But when it's dedicated to God, there's a. You know, there's a sense in which it's like, well, who is this? Who. Who did this to their own glory? It's like, well, no, it's not to anybody of glory around here. You know, it's dedicated to St. Andrew. It's dedicated to God. You know, this is. This. There's. And because of that, it feels like we can almost. It makes not. How can I say this? Like, it makes certain things that if you put them in your house, it would actually be completely unacceptable. Like, if you did so much luxury in your own house, it would almost be a scandal. But because it's dedicated to God, we can just smile and. And enjoy."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":1858.14,"end":1956.93,"speaker":"Fr Josiah Trenham","text":"You know, I don't think there's anything selfish about it, it's for the glory of God. It reveals heaven. So it's also a witness about what our future is. There's a huge shot of encouragement into the hearts of everyone who comes. This is why when we come into the church, it's one of the reasons, there's many other reasons. We literally are altered. We come in, our hearts are changed, our minds are uplifted. Even physically, if we're sick, we feel better when we're in the community, when we're in church. It is of course, a heavenly realm where heaven and earth mixes. There are angels present, there are saints present, but the beauty is overwhelming and sanctifying and healing and it's the revelation of heaven. But it's also, for us, it's also so normalizing and it makes all of the divisions of society come into a sense of harmony. You know, the rich and the poor are the same in the church. Everyone has the same access, everyone has the same experience. Doesn't matter if you have a lot of resources or not. You could be a general in the army and some new recruit comes in and you kiss each other and talk to each other by your first name when you come to the chalice and when you greet each other in the midst of the church. So it's so uplifting. It's so absolutely magnificent. It has nothing to do with self centeredness. I remember reading an article recently, I mean, maybe it was a couple years ago, about an archaeological dig in Rome and they found, you know, Emperor Nero the insane. He used to have this big ballroom and he had a rotating floor, a massive rotating floor, and he had a massive statue of Apollo, carved statue. And at the top, Apollo's head was him."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":1957.09,"end":1957.65,"speaker":"Jonathan Pageau","text":"Of course."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":1959.41,"end":2004.58,"speaker":"Fr Josiah Trenham","text":"It was Nero, right? So they found that. And I thought to myself, okay, so that's his icon, right? His self glorification effort, self deification effort. And the Romans were into that, right? They loved doing that for their emperors and they wanted us to go along with it. We're like, no, no, no. Oh, we're not going to bow down to you. We're not going to light the incense before these emperors. But that's not because we were against it, against the idea. No, we're against the. It's the wrong person. Put Christ's face there and we're there. Absolutely, we're there. It makes perfect sense to us. And that, I think is what we're expressing in the worship of the church. It's a great love gift of him who is worthy."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":2006.26,"end":2079.01,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah. I, I mean, I Think. I think it's wonderful because the excesses of Nero right now think about, like the excesses of Nero of the emperor there in the day, but now we have those types of excesses, you know, but for private citizens, you know, or there are people who have that type of excess in the. In the private world. People that have absolutely no responsibility. Responsibility to the public, at least. Nero had to pretend like he was actually, you know, kind of responsible for the people there. And so we are in this weird, contradictory world where luxury is actually abundantly available to people more than ever, but the people don't have any responsibility. And so the church, I think, also once again becomes such a bulwark to that in saying, okay, you know, yes, we actually, in North America, we are the richest civilization in the history of the world. And so why can't we make beautiful churches? It's so hard for us to. I mean, some people are doing it, obviously you're doing it. There are other examples of it. But so many people feel like this is impossible to them, despite the fact that luxury is so abundant to us."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":2079.01,"end":2129.72,"speaker":"Fr Josiah Trenham","text":"You know, yes, it's a representation, I think, of a little bit of our worldliness in the church, which we need to correct. We need to repent the idea that any parishioner is going to live in a house that's more expensive than our church building. That's just impossible. That's just impossible. And for us to call our people also, our whole view of dispossession, this is very hard for us Americans. You know, for us, the temptation is, if you think God loves you, that you're going to have. Everything's going to go well, you're going to be blessed, you're going to have, you know, money flowing in. You give him your tithe and he's going to open the windows of heaven and put money in your pockets, baby, it's going to be so great. This is not. This is the mentality."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":2129.88,"end":2130.68,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":2130.76,"end":2168.22,"speaker":"Fr Josiah Trenham","text":"And that's not the teaching of the church. For us to be wealthy means that you have no expectations and wants. You can have very few dollars in the bank, and you can be exceedingly wealthy if you don't want anything. If you have a lot of money, but you always want more, you're a pauper, you're a poor man. I call it the golden handcuffs. There's so many people who have a lot of money in our land, but they can't. They just never have anything to give because they increase what they think they need proportionally to their income. So they're always strapped, they're always in debt."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":2168.22,"end":2193.87,"speaker":"Jonathan Pageau","text":"Yeah, I've seen that for sure. People, it's like as soon as they can increase their debt level, they just increase their debt and they live, you know, like up to here in debt constantly. And they have nice things. But, you know, just the worry of that is so detrimental to your soul to have to be basically a slave to those debt, to the, that debt. That's true. That, that's such a modern phenomenon."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":2194.11,"end":2320.3,"speaker":"Fr Josiah Trenham","text":"Yeah. And it's a, it's, it's epidemic in our culture. Right. I mean, I was shocked. It's amazing to me that in America, when I was young, the Republicans were all about balancing the budget. I mean, that was one of their absolute non negotiable principles. And they, of course, would just tell everybody what we all knew. If, if you spend more than you make, you're going to go into debt and you're going to ruin your life. We all understand what it means personally in an individual level with credit cards. But nationally, in the last, what, 10 or 15 years, no one talks about it. Neither the Democrats nor the Republicans. No one has a plan for it. And the Democrats and the Republicans are exactly the same. They're all going to blow through our money. We started using the word trillion like we used to use billion, like we used to use millions. Now we have a $35 trillion deficit. I saw even President Trump recently interviewed before the election about how he was going to balance the budget. And I've heard him speak about this before, so I wasn't expecting much. And when he spoke, he didn't give much. He said, well, you know, when you think about $35 trillion and that interest on our debt is now our third line item, we spend more on the interest on our debt than we spend on the military, which is saying something in America because we spend so much money on the military. And his answer was, well, you have to remember what our assets are, how much oil we have under the earth. And I thought to myself, oh, terrible. I only received encouragement when Elon Musk came along and said that he had convinced President Trump to hire him as an efficiency czar and that he was convinced that he could remove $2 trillion from the annual budget. When I heard that, I thought, lord, thank you, thank you. Because that's exactly how much we're over budget. Two trillion is how much. Every year for like the last four years, we have been over budget. If Elon can actually do that and help us to recover basic cents that you don't spend more than you make. I mean, it's so basic. A 10 year old knows this, but."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":2320.3,"end":2371.82,"speaker":"Jonathan Pageau","text":"Our, it's astounding that we went from, you know, in some ways the idea that borrowing or lending on credit was like a sin. It was like you had to go to confession, you know, and now it's just, it's actually the way that it works. The whole system works based on, you know, it's basically a big usury system. It's such a, it's such, that's such an example of, you know, moving away from Christianity and how rapidly. Some of the consequences of that, of that are not the ones you would have thought at the outset, but, you know, end up in this situation, like you said, where you're basically servicing your debt at the highest level of your budget. What happens when, you know, the servicing the debt of the country becomes the number one item? What happens when it's higher than your gdp? Like, I don't know what limit there is for this to go. Who knows?"}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":2371.98,"end":2379.25,"speaker":"Fr Josiah Trenham","text":"Plus increase in medical costs and aging population, less taxpayers putting their money in because people aren't having kids. I mean, it is a recipe for."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":2379.25,"end":2438.56,"speaker":"Jonathan Pageau","text":"Disaster, it seems, it seems, it seems. So I want to ask you a question that one of the things we've seen in the return to the church is people call them orthobros. I don't personally like the term, but there is definitely something that I'm seeing is that a lot of the people coming into the church are very, they're very heady. Like they're very, they have an intellectual. And so for the good, you could say, because it's pretty amazing to have, you know, intellect. Usually in the past, people who would come to the church, it was often, you know, personal crises, right? It's like you, you know, you lose someone, you go through a very difficult time and then God kind of reaches out to you. But now we have people that are coming in through a search for meaning and therefore they're also quite heady and sometimes amazingly, but sometimes also with great difficulty, like they come in with all these ideas. And so I'm wondering how you see that and kind of how you deal with that question."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":2440.8,"end":2706.64,"speaker":"Fr Josiah Trenham","text":"I share your perception of what's happening and I thank God, I thank God for the level of Orthodox books, excellent pedagogical instruction about life in general. None of this existed when I became Orthodox. When I became Orthodox, Very few Orthodox books. One of my oldest parishioners, who I just buried two, three years ago, she converted in 1963. There were three books that her priest could give her in English. Three books. And they were small. Today we have tens of thousands of orthodox books. They're not all, you know, quality, but certainly we have an abundance of catechetical material. And it's important. The mind has to be engaged. It's very important. But that's the beginning. That's just the beginning. And I always tell my catechumens, it's not just the beginning. That's the easy part. Yeah, yeah, it's the easy part. Now you have to transfer that thought into your heart and into your behavior. And this is why getting involved in a serious catechetical program is very important. And a catechetical program is not just an informational program. Of course priests are going to teach the faith. They're going to teach who God is, what a human being is, what sin is, who Jesus is, what Jesus has done to save us, who the Holy Spirit is and how he'll inspire your life and connect you to God, what the Church is, what repentance is, what faith is, who are the saints. I mean, this is all constituent elements in a. In a catechism. That's basic, but just as important is coming to the services, learning how to stand in the presence of God, learning how to fast, learning how to feast. Those both have to be learned. Learning how to forgive. That's a huge issue and very, very important. And of course, the Church has whole services designed to teach us how to do that. Learning how to listen and follow. Obtaining a father confessor, that's a big deal. Yeah. Having an accountability, it's of course a great blessing too, because you have an unbelievable support that you never thought you would ever have to have a father confessor, learning to relate to a bishop, learning to relate to a priest, learning to have elders in your life. This is also one of the gifts of the church. When people, young men, come especially to the church, they get a family. All the old ladies in the church and all the old men, they become their aunts and uncles in reality. I mean, we actually believe in the reality of spiritual relationships that are constituted in baptism and by sharing a common childhood that are just as real, sometimes more real than our biological relations. All of that takes time, which is why catechism absolutely cannot be done quickly. Assimilation takes time and submersion and is a lot more than just thoughts in the head. And I'll tell you, if I was asked what is the number one most difficult Christian behavior that must be assimilated to by catechumens, I would say it's learning to endure yourself. This is being patient with failure and not freaking out, recognizing that you're not a saint, that the Lord is going to make you one. And you may make a lot of progress in the life towards that destination. You may make less and everything in between depending upon how much you're engaged. But you're not going to make any until you learn to put up with yourself. There's only one virtue that Jesus ascribes by itself, salvation to it's an amazing reality. He, of course, hymns so many virtues and teaches us so many virtues, not just by his behavior, but by his own pedagogy. But there's one that's unique and that is it's called ipomoni in Greek and it means patient endurance. And for that one alone, he says, the one who has ipomoni, the one who endures to the end, will be saved. Yeah, you might be a wreck, but if you can endure yourself, keep yourself in the church, keep yourself repenting and keep getting up."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":2707.36,"end":2769.34,"speaker":"Laura Diaz","text":"Tucson, the weight is over. Mediweight loss. They're officially open on North Oracle Road. That's right, no more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss club clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication, but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, Medi weight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com you're going to be saved."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":2769.66,"end":2827.54,"speaker":"Jonathan Pageau","text":"Yeah, I think, Father, that's amazing because I've obviously experienced that myself, especially coming from the context where I came from, you know, some strain of Protestantism that I came from. I remember a pastor once saying in church, you know, Christians don't sin anymore. And he said, well, he said at least we don't practice sin. That was the thing he said. He said, we sin occasionally, but we don't practice sin. And I was sitting there, you know, whatever. I was like 19 years old, and I was looking at him like, well, I don't know what to say, because obviously this is. So I guess I'm going to go to altar call every week. It'll be like my Protestant version of confession, because I definitely sin all the time. And there's this sense in which, you know, the kind of way we beat ourselves up sometimes, morally, is actually because we think we're better than we are. You know, it's like we think, like, how could I do that? I should be the same."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":2827.86,"end":2829.64,"speaker":"Fr Josiah Trenham","text":"I agree. Yeah."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":2829.64,"end":2894.5,"speaker":"Jonathan Pageau","text":"And that's what I've learned, I think, through confession, is because the thing about confession, people who haven't practiced it, especially if you try to do it, you know, often. I'll have to be honest with you, as I travel, I don't go to confession as much as I should these days. But there are moments in my life where I've gone to confession as much as possible, and you just keep saying the same thing. And so you're like, wow, you know, and then you realize, I am nothing. Like, I really can't do this. You know, there's. And. And then the surprise, at least sometimes, is that at some point something happens that you don't totally know what it is. Through prayer, just through going to church, through going to communion. You're like, oh, wait a minute. This is actually this thing that used to. I used to confess every week. All of a sudden it's gone, or it's almost not there anymore. What happened? You know, it's. And this is the sense in which you see that God is working, is working through us, you know, without even. We always have to make efforts, but God is always working. You know, sometimes even in the moments when you think that you're lost and nothing you're doing is working and you just keep falling and falling. God is still working."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":2895.46,"end":3138.77,"speaker":"Fr Josiah Trenham","text":"Yes. I love that text that the Lord Jesus quotes from the Old Testament and applies to us, where he says that God resists the proud, but he gives grace to the humble. Humility is so beautiful. It's so beautiful. And the church is. By asking us to keep our eyes on ourselves and not upon others, or in St. Paul's language, to esteem other people as more important than ourselves. You know, Jesus modeled, of course, putting a towel around our waist and washing people's feet, esteeming them that highly, that Brings grace like a magnet into someone's life. And the more that we can learn to endure ourselves and not make up stories about who we are or how much we've progressed, not looking down on other people, the more that we can avoid doing that, the more that we can become more settled in the grace of God because he pours out his grace upon people who choose to take the humble position. And that is the most secure position of all. It's only when we raise ourselves up that we get insecure, is when we lift ourselves up, then we can fall. If we can keep ourselves low, there's no place to fall. Like we're spiritually crawling on the ground and we're looking up towards people. It's so peaceful and it's so safe, and it keeps us from falling into the horrible position of judgment. One of the things I'm trying to convince converts of constantly is that when you see something terrible, you see something that's a lie or dark. And how can you live one day in our culture and not see those things all the time? You have a choice right then what you're going to do when you see it. How are you going to respond to this? If you choose to, like, point at it and to criticize it, to judge it, what you're doing right there is collaborating with the one that we call in the scriptures the diabolos, the one who points the finger. You're actually collaborating with Satan himself or with a demon in actually promoting a spirit of darkness on the land. The scripture says that Jesus did not come into the world to judge the world, but that the world might be saved through him. And yet he is the judge. If he wanted to exercise his judgment, he could have done that, but he didn't. He wanted to save us, not judge us. And so we have the better choice. When we see something that's terrible every day. I think we can do two beautiful things. One is we can collaborate with Jesus in bringing grace and salvation to someone's life. So when you see something terrible going on, you can lift up your mind and you can say, lord, look on this person. Open some spout in heaven and cause grace to come down upon them because they're in great need right now. Send your mercy to them right now and save them from this catastrophe. Then you're actually collaborating. And a second good thing to do is be convinced that God only allows his children to see horror so that they can discern some portion of that horror in them. Whatever we see, in some way, it's in us. And if we turn from what we see and say, lord, I know that's in me too, please get it out, get it out. Those are two very gracious grace summoning actions that would collaborate with Jesus in bringing grace to the whole world, which is what we're about. You want every single person, Jonathan, I want every person on planet Earth to be baptized, to have their sins washed away, to have God come and live in them, to be established in peace forever so that they can live a beautiful life. This is what I'm. This is why. This is the Christian vision. We're interested in everyone. We want everyone, and this is our task. Yeah."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":3141.02,"end":3190.09,"speaker":"Jonathan Pageau","text":"Kind of change the subject here, all over, because there's a bunch of stuff that I was wanting to get your opinion on. One of the things that we're seeing, and you mentioned that a little bit, is, you know, you mentioned how the people that come to church have some atheist aspect to them. You know, the sense that I also have is that there are also a lot of people going into all these weird religious directions. You know, we have the spiritually not religious and everybody has their own little kind of new age version of. Of spirituality or something. And I'm wondering if you're seeing in your own parish people that have gone in that direction, kind of coming back, and how do you account for that? Or what is it that you're seeing? You know, what is it that's touching these."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":3194.1,"end":3205.86,"speaker":"Fr Josiah Trenham","text":"I think I understand what you're. The question you're raising. And it does exist. The re. Enchantment. Right. Isn't always finely tuned theologically."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":3206.74,"end":3207.78,"speaker":"Jonathan Pageau","text":"No, that's for sure."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":3209.14,"end":3220.02,"speaker":"Fr Josiah Trenham","text":"So we have. If you come to my parish, you're going to see, what shall I say, a collection of tattoos from."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":3220.02,"end":3221.1,"speaker":"Jonathan Pageau","text":"I never thought about that."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":3221.1,"end":3327.46,"speaker":"Fr Josiah Trenham","text":"Norse gods, you know, witches, covens. People have tried these things. You know, they've just, you know, I look on it and. Forgive me, but it was an improvement. It was an improvement. If you look at the ancient pagan world. Forgive me, the ancient pagan world was a lot better than. Than our secular society. I'm sorry. So much better in many measurable ways. How they treated the unborn, even though they were terrible compared to Christian standards, way better than what we do. How they treated marriage. I mean, many Roman men had mistresses, but they also took care of their wives. They also knew that they had to support their children when or else society would collapse. People weren't giving up having kids. No one was that stupid. The pagans were a lot smarter than us. They had bad gods. I mean, I'll give it to you. But at least they believed in the divine and supernatural realm. They knew that they owed something to that realm. They knew that they were accountable to that realm. The idea that today our people think that, really, despite all the evidence that every society in the history of the human race has recognized as evidence of the divine, now all of a sudden, it's not there. I mean, how stupid do you have to be? So I've told people. I've told people, look, you can't call people today pagans. That's a compliment that they don't. They don't deserve that compliment. It's not nice at all. I tell them, especially in. I've had quite a bit of. What shall I say, a little wrestling, a little interaction with the LGBT community."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":3328.05,"end":3328.37,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":3329.17,"end":3439,"speaker":"Fr Josiah Trenham","text":"And this is an area, I think, of particular evidence. So there is no precedent for the sexual chaos and anarchy of our current time. There is no precedent historically. The best you can do if you're. If you're a gay man is to look to the Greeks, look to the pagan Greeks. But even there, the. There's nothing that parallels what's going on today. I mean, the relationship of older men with younger men, the sexual dalliances in Greek pagan culture, yeah, they existed, but it was very clear that these did not involve that putting aside of marriage. Many of these men had their wives and they had their children. I'm not saying that they were being good to them, but they didn't think, you can just dispose of marriage, you can just dispose of family life, and everything is going to be okay. That is not true. And they also were very. The Greeks were 100% opposed to the unnatural reality. Forgive me for being so graphic of anal sex that was verboten in Greek society. I don't want to go into it too much because your listeners might be scandalized, but they had other ways, if you understand what I'm saying. But it didn't involve that. That was considered. Considered the breaking of the vessel, the breaking of, like, you're hurting yourself. You're going to destroy yourself. And that's the only precedent that really can be appealed to. We are so off the rails in continuity with previous human generations that, what can I say? We've lost our minds. We really lost our minds. So there is some. In some way, if people get involved in crazy religious experience, it's probably better than secular atheism."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":3440.84,"end":3496.63,"speaker":"Jonathan Pageau","text":"All right, so I have to ask the question that follows. This, obviously, is one of the things that has been in my circles, and it's something that I didn't expect. And at first I didn't even know how to react because it was so far from my own world, was the whole psychedelics thing. And so my friend Jordan Peterson talks about psychedelics. And then other people that I meet, I've met actually, Father, this is because I never thought about that ever before. And so all of a sudden, I'm meeting people in my own parish that tell me they've converted because of psychedelics. But then I also meet people that have had absolute psychoses and have lost their mind because of psychedelics. And so you live in California, and so I imagine that you have to deal with this. What are you trying to say as a priest? You probably have to deal with that. And so I'm curious to hear what you think and what your advice is to people that are asking themselves this question about these substances."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":3499.67,"end":3539.56,"speaker":"Fr Josiah Trenham","text":"My experience is very similar to what you're describing. There are, in fact, plenty of cases in which, under the influence, the Lord himself appears and can pull someone towards him. But that doesn't mean that the event itself is wise or justifiable. And just as often as not, the exact opposite happens, which is a terrifying reality. That doesn't mean that a terrifying reality can't catapult someone into sobriety. I think that's what's happening. I've noticed recently, I watched that clip from Tucker Carlson about him being attacked by a demon. Did you see that?"}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":3539.72,"end":3544.36,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah. I knew about that story, actually, for a while, but I didn't think he would talk about it in public."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":3544.36,"end":3697.72,"speaker":"Fr Josiah Trenham","text":"Yeah, yeah. I. I didn't know about it, but I presumed it just by his awakening. I would say there's been so. And I think it's. It's broadly across our culture, is that the darkness has appeared and that has awakened people to the reality of the unseen world. And as sad as it is, they're actually helping us, you know, C.S. lewis, in his Screwtape Letters, talks a lot about how the demons scheme to be unseen. Because if they can keep people believing that there is no supernatural world, they've got them exactly where they want to be. So they don't want to do anything that's too, you know, shocking that might waken them up to the unseen world. And now that's very much the case today is that so many crazy things are happening, spiritually speaking, that fewer and fewer people are maintaining the fiction that there is nothing unseen. Whether they're going to come full circle to a Christian position, an orthodox position, which is that the unseen world is the primary and most important world, and that it itself gives meaning to the visible world. You know, that bifurcation, which is right in our creed, right? We say, I believe in one God, the Father Almighty, maker of heaven, heaven and earth, and of all things visible and invisible. That bifurcation is very important in Christian theology. And I always tell people, look, the obsession with the physical which inspires our culture, especially our education, you know, stem, everything stem. I always laugh. I'm always poking fun at my own parishioners, who are so many of whom are academics. I'm always poking fun because I'm like, you know, that's great and all. I mean, I support medicine. I mean, technology, engineering, it's all great, it's all wonderful, but nobody dies for that stuff. That all the most important thing. All the most important things in life are unseen. All the most important things are invisible. God, the soul, love, truth. I mean, these are the things that you die for. These are things that give you motivation to get up and go to your engineering job. If you don't have the invisible, what do you care about the physical? Nobody cares. But today, it's, you know, it's just the opposite. You know, everybody's acting like STEM is just a great thing and so important in society. No, no, no, no, no. Read philosophy, read books, find out about your soul."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":3699.08,"end":3730.94,"speaker":"Jonathan Pageau","text":"Yeah, and I think you're right. I kind of see it as there's a constellation of things peeking in. Like, there's a constellation of things. There's these people going into all these New Age kind of practices, people who are doing psychedelics. There's also this obsession with the UFOs and Supernatural. People are also obsessed, again with, like, hauntings, and they're obsessed with astrology, which, like, I didn't expect that. You know, all of a sudden, my daughter, she said all her friends, all the teenagers, they just all. They love astrology. They just talk about astrology."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":3730.94,"end":3731.74,"speaker":"Fr Josiah Trenham","text":"Horoscopes."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":3731.9,"end":3800.94,"speaker":"Jonathan Pageau","text":"Yeah, exactly. Everybody's reading their horoscope, which is, you know, which shows you that. That just in the popular culture, things are shaking. Like, the materialism isn't enough. And so people are grasping at all these sometimes ridiculous or at least incomplete ways of doing it. Sometimes they're also kind of materialistic. The UFO one is, to me, often seems to be a desire to encapsulate any type of experience into materialistic categories. But then all of this is showing us that there's a kind of. There are fissures in the wall. Like, things are kind of cracking and that the future is going to be religious. It seems that that's the case. And so the question is rather what is that going to look like? And at least I know in the long term what it's going to look like. I know in the long term Christ wins, there's no doubt about that. But at least in the short term, and even AI too, that whole idea of AI, of how this desire to kind of build an intelligent machine that, that will, that will influence us, all of that is, is, are symptoms of the same thing that's happening in our society."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":3801.18,"end":3804.3,"speaker":"Fr Josiah Trenham","text":"Yeah, I share your sentiment."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":3804.94,"end":3814.54,"speaker":"Jonathan Pageau","text":"Have you thought about the AI thing? I don't know. I'm just asking because it's, it's just everybody, it's, it's happening everywhere. What is your perception of that? What do you think of this, of the AI thing?"}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":3817.59,"end":3817.91,"speaker":"Fr Josiah Trenham","text":"Wow."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":3819.91,"end":3822.55,"speaker":"Jonathan Pageau","text":"Am I the only one who's ever asked you that? Father Just signed public."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":3823.35,"end":3907.04,"speaker":"Fr Josiah Trenham","text":"I think maybe I am. One of my catechumens is employed as an ethicist for artificial intelligence for a big tech company. And we collaborated a bit, matter of fact, we contemplated. There's a big conference going on actually, I think it's going on this month, end of this month in Athens. And we, we submitted a proposal, a joint proposal to talk a little bit about ethics and artificial intelligence. I begged out of it, much to my happiness. I just. My traveling is driving me crazy. Yeah, yeah, absolutely crazy. Just can't do it. But this is whether we want to think about it or not. It is apparently upon us. How can we not think about it? I have a spiritual son who's doing his PhD in Byzantine studies at a big university, I won't say where, here in America. And he's taing right now some graduate classes. And he's been giving. He gave a test recently to his grad students on some aspect of Byzantine history, very complex aspect, like between the 12th and the 14th century, very neglected portion of Christian history, which means that the AI resources for that are very limited."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":3907.28,"end":3907.92,"speaker":"Jonathan Pageau","text":"Are thin."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":3907.92,"end":3994.88,"speaker":"Fr Josiah Trenham","text":"Yeah, yeah, they're very thin. And so this is a way that he discovered that even top level, I mean this is a very top level university in America graduate class. He got a paper back that was just superb. It was perfect. Except it made no reference to any of the Greek texts that he had these grad students read that were not popularly in the English language. And he asked in his requirements for the paper that they reference these texts. Well, when the paper was turned in, there were no references to the text. So he knew Immediately this was a fake paper. He went to the head of the department of the department at the university to ask what should he do? He said, this is a perfect paper, but it's a complete fake. And the professor said, who was head of the department said I agree with you, it's clearly the case and there's not a thing we can do about it. They don't have the apparatus to address it and it would be a he says, she says thing and very hard to prove. But that is catastrophically horrific. People are now able to fake their intelligence by a dependence on chat, GPT or something else. And what's that, what is that going to mean when we need competence in human beings and you don't have access to your phone to, you know, make a fake paper?"}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":3996.64,"end":4073.31,"speaker":"Jonathan Pageau","text":"Yeah, it's a while, it's definitely a wild time. It's an amazing resource. Like I use ChatGPT because I mean you can have, if you have very, actually sometimes very esoteric questions, very difficult questions, you know, especially the new version, they just give it to you. It's, it's quite astounding. But at the same time it is in some ways, you know, the problem that Plato brought about in the Phaedra, right, this problem of the exteriorization of memory and the exteriorization of thought. And so like you said it, at some point the people, the only thing skill that will be useful for humans is the capacity to use the AI. That's the skill that you'll have to develop. It won't be to actually learn anything, it'll just be like, are you good? It's kind of like now it's like are you good at searching on Google? That's what it was for a while, that that's what made you smart. And now it'll just be are you capable of using the GPT? But yeah, so I think one of the things that might do interesting, love father, is that it might bring us back to old school stuff. Like you'll be in the class with a pencil and a piece of paper and then it'll be like, I'm sorry but anything you do right now is going to be from your own memory or else it doesn't count. And then people will be forced to, to actually make efforts that they didn't have to make even 10 years ago to prove that they know what they know."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":4073.47,"end":4081.71,"speaker":"Fr Josiah Trenham","text":"So we might go through the pain though. Are we going to have to go through the pain first and then recalibrate? I just wonder, you know, I have."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":4081.87,"end":4085.15,"speaker":"Jonathan Pageau","text":"Do we ever do anything in any other way. Father like."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":4086.03,"end":4177.66,"speaker":"Fr Josiah Trenham","text":"Well said, well said. I have these two marvelous priests here who work with me. There's the three of us at the parish who work full time, and they're younger priests and they're far more technologically savvy than I. And one particularly has been working from a priest perspective with Chatgpt, and he's been showing all sorts of things about I'm giving this talk to this kind of group. I need high level Byzantine graphics. I want to emphasize, especially these Church Fathers. And, you know, he's been walking us through the creation of these incredible presentations that you're able to make if you know how to ask the right questions and to lead the intelligence the way that you want. But I looked at him and I said, after he, you know, showed this to me, I said, never use that. It's gonna stunt you. It's gonna stunt you. So you're gonna miss, you know, a priest speaks from his experience and he wrestles with the Scriptures and he wrestles with the saints that he reads. And you develop relationships with them. I mean, you pray when you're reading St. John Chrysostom's text, right? You're praying to the saint, you're asking him to help you. You're entering into his life and it's satisfying. It's the same with the Scriptures. When you're interacting, you're asking for the Spirit's illumination. If we miss all of that, the whole process of discovery, the whole process of learning, it's so deeply human and so deeply satisfying. We're going to be so sad. We're going to feel terrible."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":4179.58,"end":4246.61,"speaker":"Jonathan Pageau","text":"Yeah, yeah. Father so we're kind of coming up on time very soon. I want to give you, I want to ask you, I guess, one last question. It's a two part question. You know, in some ways I'd like to get your intuition about what's coming. You know, let's say. I know it's. I don't want you to feel pressured, but, you know, I think that mind, you know, I've seen you as a very intuitive person as well. And so I'd like you to give us a sense. You know, the election was rough for America and people perception of themselves and people's perception of what's actually happening in the world. There's a big divide in your country, but also here in Canada, we're seeing that divide appear. There is all this. There's all this searching that people have, and it's leading people into all kinds of directions. And so I would like to ask you kind of at least a little bit what you see and also, what's your advice for the young people, especially the young people that are watching and that they want to know how to be in the world and where to look."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":4250.37,"end":4675.16,"speaker":"Fr Josiah Trenham","text":"What a question. You know, there are two important symbols that everyone should have in the forefront of their mind, and they should have them in the proper order. The cross and your nation's flag. In my mind, those are two very, very important symbols. And for Christian people, it's very important to have them in the proper order. You know, to be a parishioner, to be a Christian and to belong to a church, become a parishioner. That word comes from a beautiful Greek word, parikos, which means sojourner. There's an incredible letter, an epistle, that's usually bound in our books on the Apostolic Fathers. It's called the Epistle to Diognitus. It's an incredible text. It's anonymous. We don't know who the author is, but sometime, probably around 200, 150 to 200, and he describes the disposition of Christians, and he says, Christians consider every foreign land to be a home country and every home country to be a foreign land. And of course, that's a biblical concept, right? When God called Abraham out of the polytheism from Ur of the Chaldees, ancient Mesopotamia, a very developed culture, he called them to walk out. And for the rest of his life, following God, he was a sojourner, and he built altars and he erected and established worship as the foundation of his life. He fulfilled civic duties. You know, he had good relationships with his neighbors. Sometimes he even went to war for good purposes. But he never was acting like his earthly attachments were the most important. He was looking, St. Paul says in his Epistle to the Hebrews, he was looking for a city whose architect and builder is God, an eternal city. I think that we orthodox Christians prosper when we keep those relations distinct, the cross supreme and the flag second. And we have duties, of course, to our nation. We love our nation, but we never put the flag above the cross. When we do, we die. We die. And that's been my experience in Orthodoxy in America, when we emphasize our nationalism above the gospel, we trivialize ourselves and we're disappearing and we shrink, and we should shrink because we're not being good Christians. When we exalt the cross above the flag, we have a proper relationship to the flag. You have certain patriotic duties. You love your country. Of course, this is your ground that God made you from. I'm not denying any of that. I'm patriotic myself, very much so. I love my country, but I love God more and I love his kingdom more. And I evaluate my nation according to his standards. I try to make a contribution according to what is unchanging. I feel very uncertain, very uncertain about the earthly scenario right now, if you ask me. Like, I'm uncertain if President Trump is even going to make it to inauguration. That's how uncertain I am. The things that are going down in our land are so outrageous. They're so outrageous. These assassination attempts, the amount of manipulation, of deceit that is just in the heart of our existence. It's completely sobered me. It's completely sobered me such that I. Every day, I don't know what to expect. I'm hoping for the best. I'm hoping for the best. I'm hoping that this will be the beginning of a major reorientation, I think it's possible, a major social reorientation in which there can be a return to the importance of religion, the importance of morality. This is one of the most grotesque expressions of contemporary life. You know, in 2003, the late Supreme Court justice here, Antonin Scalia, he issued a minority opinion in this case called Lawrence vs Texas, which was an LGBT staged case to strike down anti sodomy laws, which used to be so normal in America and they still were on the books in Texas. When he wrote his minority opinion going against the majority of the Supremes who did strike down these anti sodomy laws, he said, this is the end of morals legislation in America. And if you don't have morality inspiring your legislation, what is? It's the end of justice. He could have written that just as easily. If morality is not undergirding your law code, then you do not have a just law code. And we have we. That is us now. That is us. So I think how that doesn't take a great theologian to articulate. I mean, that's so basic, it's so normal. You can't abandon morality. It's inescapable. You either have an articulated true morality or you have something made up. And who's making it up? Whoever's making it up is the God of the nation. I mean, you go up the moral law to the author and then you have the God of the nation. If it's not from God, it's not Jesus, who is it? Exactly. That kind of religious chaos. And I look at it even religiously speaking. One of the things that's fascinated me is on The Trump side, you have this collection of Hindus. It's mind blowing. They're very attractive to me. I mean, J.D. vance's wife is a Hindu. Vivek Ramaswamy is a Hindu. We have, of course, Kamala Harris claims to, you know, have this background as well. We have all this. The rise of Hinduism, which is full blown polytheism. And are we. That doesn't matter. That's not going to have an impact on what we think about justice or what we think about the dignity of a human person. Ultimately, I'm hoping that part of this radical readjustment in our society will lead us back to some basic rock solid. You can acknowledge God. You must acknowledge God. Even if it's in some way that's, you know, more generic compared to an orthodox fine. But to acknowledge God, to acknowledge the Ten Commandments, to acknowledge the existence of morality, this seems so basic to me. And I just can't imagine if we continue down this path of pretending that none of this exists, it's going to end well."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":4677.72,"end":4719.01,"speaker":"Jonathan Pageau","text":"Well, Father, thank you for your time, you know, and thank you for, for everything you're doing for your witness, and also for showing us what's possible, even at a parish level, for people who at least try to put the right, let's say, the right order of priorities, the beauty and also the dedication. I mean, when I was at your parish, I think one of the things I could see on everybody's face was just this, this is my home, you know, and you can feel that in the way that people are with their kids crawling around and, you know, it's just. It's really astounding. And so thank you for everything you do. And I hope, you know, I hope we can also, also talk again very soon."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":4719.01,"end":4723.49,"speaker":"Fr Josiah Trenham","text":"Father, please keep enchanting us. Jonathan, please keep enchanting us."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":4724.05,"end":4741.6,"speaker":"Jonathan Pageau","text":"Thanks, Father. I really appreciate it. If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase. So go to thesymbolicworld.com and thank you for your support."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":4742.08,"end":4806.06,"speaker":"Laura Diaz","text":"Tucson the Weight is Over Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iHeartRadio. And you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project. Ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweightloss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com pack up though, because Chevy."}
{"episode_id":"SW - #369 - 2024-12-21 - Fr Josiah Trenham - Orthodoxy in America","start":4806.06,"end":4833.07,"speaker":"Fr Josiah Trenham","text":"SUVs have the capability to take you to some incredible places like an adventure in the middle of in the Equinox, an SUV that will help you get away with confidence, or head off for a night in the in Chevy Traverse with all the tech you need to stay connected. While the undeniable value of Chevy Trax will keep you moving from here to over here to way over here, get to all the places you want to be with Chevy SUVs. See Watson or O'Reilly Chevrolet."}
