{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":12.56,"end":82.08,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the Symbolic world. I think that we should start to be more deliberate about some things, like in terms of. Because I see that there's so much crossover between the Bridges of Meaning thing and then the symbolic world thing. I think that because of that, it would be a good idea to be a little more deliberate about ways of collaborating and ways of working together and building on what each other and what we're doing so that we're actually building something for that will last. That'll last. Or that will produce fruit, let's say. So I think that that's something that I'm looking forward to next year when I get settled into my house and hopefully things are going to calm down and I'll have more time and energy to get involved in that kind of stuff. Like, I've visited your, your bridge is a meaning thing a few times and I kind of dropped in. I don't even know how discord works. So I always like, I drop in on conversations and people and then I don't even have my mic on or something. Anyway, so we'll figure it out."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":82.81,"end":120.78,"speaker":"Paul Vander Klay","text":"No, I think that would be a good idea. I don't know exactly how the Bridges of meaning thing. It was members of my local meetup that started that and it has continued to evolve and it continues to evolve. One of the things that I struggle with is how we can use these platforms for good but not be overly innocent or naive about the distortions that they bring into patterns of relationships."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":121.02,"end":121.5,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":122.14,"end":187.13,"speaker":"Paul Vander Klay","text":"And, you know, we, you know, before I started recording, we were talking about, you know, I'm glad, I'm glad I'm doing this in my 50s, because if I had done something like this in my 20s and 30s, I'm really concerned about how this would have formed me. Because the, the, the relational dynamics that, you know, it's, it's immensely flattering to have the kind of influence that one has where people are listening to me for. I mean, the people who listen to my YouTube channel hear me far more than the people in my local congregation. And they lack the, they lack a bunch of the collateral information that is normal in face to face relationships. And I think what that means is that there's distortion in sort of the relational. I don't even have the words for it."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":188.33,"end":271.06,"speaker":"Jonathan Pageau","text":"No, there is, because like we talked about, I guess we're going to go back. There is an aspect of the screen that creates a celebrity, weird celebrity thing. And you know, I think it has to do with the fact that you're watching Someone who doesn't see you. And also the fact I've talked about this, just the fact that you're looking at a person that's emanating light. I think something as simple as that, where you're standing, you have a frame, like, it's like a speaking icon. You have this frame and you're looking at it and it's talking to you and it's emanating light and you. And it doesn't see you. So I think that there's something about that interaction which is obviously dangerous because we're doing this on a screen, there's a frame, and we can control that frame to a certain extent. Right. Because even in reality, you can control the frame a little bit, but on this, it's much easier. You don't know anything about my private life. It's just not apparent. You don't see me fight with my wife. You don't see me being patient with my kids, which would be something that in a normal relationship, in a church or in a community, you would be able to see my foibles and all my, you know, all my. My darker side. Not all of them, but at least enough of them so that the frame wouldn't have taken over. Whereas now I have almost total control over what you can see of me, you know, and so it's a. So it's a dangerous way of interacting with people."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":271.22,"end":434.69,"speaker":"Paul Vander Klay","text":"Yeah. One of the. One of the things that we've done on the Discord server lately is we started. It kind of has morphed into what we're calling open studio and sense of. And an art Open studio. And that we're. We have our cameras on. And I, in the Discord server, I've wanted to, at least to a degree, create a community where there are cameras on. Because, I mean, what we're doing. That distortion that you just Talked about on YouTube is all over the Internet because you have an avatar, you have a false name, you. There's a context lessness. And that. That of course, creates the environment of trolling, where people drop in, you know, unleash their payload and evaporate out. And one of the things that you see in real life communities, before I got to this church, this church had a bad history of destructive congregational meetings. And part of that was people stand up in a big room, unleash their anger or frustration and sit down, and the community suffers. And so one of the things that we did early on was if I knew we were going to have a congregational meeting to talk about hard things, I would split them up into groups of eight or 10, put chairs in a circle. So if you had to say a hard word, you had to say it to people's faces. And so if you said something painful, you would see the pain on the face that you just delivered the thing to. And this, I think, is a big piece of overall, the brutality that we see in our culture that there's so much, you know, if you're going to be a human being and you're going to hurt someone, you. You should have to live with the sight of the pain that you inflicted. And so I don't know. I think about that in terms of, okay, so what's my goal? I mean, I don't know. Maybe you've done more reflecting on this. I mean, I backed into this thing and it's, you know, don't get me wrong, it's been fun. It's been some of the most fruitful ministry of my life. But I am concerned because of the ways that it is unreal in these respects, and it is ephemeral. It can just float away. Unlike when you invest in a real living community."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":435.49,"end":444.5,"speaker":"Jonathan Pageau","text":"Yeah. Are you afraid? Also, this is the thing that has bothered me or kind of preoccupied me is the problem of it replacing also."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":444.9,"end":445.38,"speaker":"Paul Vander Klay","text":"Yes."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":445.46,"end":458.98,"speaker":"Jonathan Pageau","text":"Normal. Normal community. And so people don't end up joining a church or don't end up joining a community because it's like they have this thing online that they. That they get something from, but it's. But that it's a kind of a pale version of real community."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":460.02,"end":490.48,"speaker":"Paul Vander Klay","text":"Yeah, I think so. I. And so I've, you know, over the. I've watched Brett and Eric Weinstein do their thing and the whole Plan B idea, I mean, and this gets into the COVID Reset all of these ide. Is that, okay, we're going to remake the world now and we're going to use these tools. And I watch them and I listen to them. And I think, number one, I don't have a lot of stock in your level of wisdom as to what the world should be."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":490.64,"end":491.28,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":491.28,"end":602.26,"speaker":"Paul Vander Klay","text":"But also, number two, they spend no time that I can see. I mean, again, now, both of us are Christians here, so people might roll their eyes a little bit at this, but the whole point of Tom Holland's book to me was that Jesus reset the world in such a deep and profound way that to me, even in terms of public knowledge, it seems really hard to argue against the fact that fact. And then. Then I pause and ask, okay, you know, three years of public ministry Pouring himself into a dozen official disciples, one of whom betrays him. You know, there's another group of 72 or 120. So there's a small group of people. And what Jesus unleashes, you know, begins to roll out, of course, to the degree that Constantine, for example, adopts under this banner. He goes. And Constantine doesn't quite understand what he's doing. And to me, this okay, you want to change the world? Why don't you look at what I think is the man who changed the world more than anyone else, and look at how he did it instead of running up YouTube metrics, political organizations. I mean, not to say that those things don't have impact, but it seems to me, well, if you really want to change the world for the better, and you actually embrace certain aspects of this man's value unwittingly and unconsciously and continue to want to promote it and maintain it in the world, and. I don't know."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":602.26,"end":725.96,"speaker":"Jonathan Pageau","text":"I don't know. Yeah, there's that. It's interesting to understand that the text from Paul, I forget in which. Where it is. I'm not good with the. The chapters and verses. But he talks about how at this very moment, Christ is dominating. Like, he's ascending the hierarchy and he's subjugating principalities. And it's like, it looks like he's talking about a weird science fiction thing that's happening in the background. That he's doing these things almost like in a. I don't know, like some Japanese manga or something. But then you realize that it was actually happening because 300 years later, the entire empire converts to Christianity. So it's like secretly in the background, Christ was. The fruits of what he did were increasing secretly. And all of a sudden it started to show. And then finally you can see that the world had been transformed. And actually understanding that that's how reality works is super interesting because you can also see it. You can even see how a weird, you know, the weird flip that happened in culture. Let's say how, like, the United States went secular and Russia became Christian. Like, you can understand it, that you can understand that change that way. Whereas each country was secretly trying to influence the other. Like, you know, America was sending Bibles to Russia and, like, sending secret missionaries to, like, go encourage the church. And Russia was, like, sending. Was sending, you know, stuff to, like, encourage radicalism and encourage revolution and encourage racial tension. All this stuff was being happening from the other side. And then in secret, the seed grew. And then finally the two fruits appeared and they would look like they had switched places. And it's just interesting to think that that's how actually reality works, is that the fruits grow in secret first, and then finally. It's not about changing this. Changing systems. Doesn't. You need to change the hearts. Like changing hearts is what actually transforms reality. It just takes time. Doesn't happen fast."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":726.84,"end":870.98,"speaker":"Paul Vander Klay","text":"Well, I don't know. I mean, your work has really impacted me in this way. I mean, part of what I've been. I did a video on. I don't quite have the language for talking about what you're doing. I don't. Because what I, you know, the last couple of days, what I've been thinking about is I see Cartesian dualism coming to an end. And I see. I think back on some of the previous conversations that we've had, and I think that's sort of the way your work has been colonizing me. I mean, the second conversation we had was about angels and demons. And again, I had the experience of. I wasn't quite sure what you were talking about, but I knew it was important. And so what I'm seeing happen is that this Cartesian dualism of sort of a. Of imagining the world as particles and substances, that this is going away and your more pervasive paradigm as sort of the sort of, at least in the imaginary, the base level of experienced reality being patterns. That's, you know, that's. That's what's been seeping into my head. And, and so your conversation with. With Adam and Rationality rules. I mean, those, Those to me, sort of elicited the most dramatic contrasts because. Made it. It made it exposed the fact that they, in a sense, were building the world from the ground up on matter. And you were asserting that matter doesn't determine anything. Matter is always colonized by something."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":871.46,"end":1144.69,"speaker":"Jonathan Pageau","text":"Yeah, it's always, It's. It's always formed by. By light. It's always formed by logos. It has to because. Because. Or else it's just a sea of potentiality. And it's really like a technical thing because underneath the world, even in scientific terms, is whatever they call it, quantum field or whatever. It's possible positions of subatomic particles. That's what's underneath everything. And so it's not even determined. It's a mush. Right. It's like a mush of indeterminacy. And so. And then stacked up on that, you have these identities. But, you know, these identities stack up in terms of meaning. They don't stack up. That's how they stack up meaning is that which forms the world. And I think the greatest thing that's happening right now, and that's really the most exciting thing, is I think we're in a place where people can understand that it's hard. And like you said, it's hard because you can see in those two conversations I had, especially the one with rationality rules, I think it's like they don't see it at all. It's like it's a blind spot. And so you try to point it out and they're like. They don't know what you're talking about. It almost kind of just floats over, and then they want to come back to the things that interest them. But then when you assert this type of reality, it just kind of. It's weird. It kind of just floats by and you see that. And I think this is the thing that I saw, even with someone like Bret Weinstein or other characters in these types of discussions, is that if you try to point out how reality works, it's like, I don't know, it's hard to understand why people can't. I don't understand anymore why people can't see it, because I've been seeing the world this way for 20 years. But I encounter people who tell me, like you said, like you said before, I didn't know what you were talking about. And then one day, or slowly it started to click. And then it's. Then I started to see, oh, this is he. This is what he's talking. This is what he's talking about, right? So I think that if there's one thing that I'm doing, I hope that that's it. Like, I hope it's to help people understand the inevitability of meaning and the inevitability of. And that this is what scripture is talking about. Like, the description in Genesis is a description of an ontological hierarchy, right? It's more that than anything else. It's a description of how there are analogies above, of light, meaning, breath, all of these things that are talked about in the first chapter. And then there are analogies of below, darkness, unformedness, chaos, emptiness, water. Like all these images. And. And it's just like a massive. Putting all these analogies together to try to help you understand how the world exists and still exists. Now. The world exists the same way that is described in the first chapter of Genesis. The manifestation happens in the same way as what's described in that book. It's still light, meaning logos, that comes from above and that which Calls forth, you know, from the earth forms. And also there's a. There's even in creation. So there's a kind of freedom there because God says, let the earth produce. And so it's like God is giving a main category. It's like, let God. Let the earth produce, you know, plants that produce seed of their own, of their own kind. And so God is giving the meaning and he's using the seed thing. It's like, let's produce plants that have the same identity, a continuous identity, and we'll continue on with that identity. And then after that, there's all this variety which kind of comes up. And that variety. It's almost like God didn't have to say all the different names of all the different plants. He just. Like there's the main category which comes down and then there's this filling up. I use the example. I don't know, I forget which part of. I think I did use that example. The rationality rules discussion. Or maybe it's not the one that was recorded where I say, God says, let there be cars. And then Audi and all the companies start producing all these different varieties of cars. You don't need to. From above, you can have larger, larger categories. And then they kind of scale down and start to disseminate into the world. So it's like that's how reality works. Even now, God is. The world's still being created that way."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":1144.77,"end":1169.66,"speaker":"Paul Vander Klay","text":"Well, yeah, and you can see that in markets that, you know, once. Once, you know, let's say the computer manifest there was compact and IBM and HP and, you know, hundreds of little places where computers were manifesting all over the place and let there be computers. And suddenly there were. There were computers all over the place."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":1169.9,"end":1253.11,"speaker":"Jonathan Pageau","text":"Yeah. And then there's this, like. I forget which term John uses, but John has all these great terms to talk about this, this system of how there's like an exchange between the identity and the multiplicity. And there's this. This kind of breathing in and breathing out, you know, where. Where there's a pushing and pulling and then that's how. So it's not a static reality. It's a dynamic relationship between identities and. And their potential. And so it's like it just moves back and forth, you know, and it. And it ends up being like a. Like the breathing in and breathing out of reality. So I think that that's like, if I can get help, people understand that and also understand that if someone asked me something like, do you believe that the Genesis creation account happened? It's like, not only do I believe it happened, I believe it's happening now. It's always happening. It's the most happening. It's the most. It's the best description of reality that has ever been written down. So it's like, not only do I not want to discount it, it's like I based my entire world on it. Everything that I think is based on that account. And I feel no qualms or shame about saying that. And I don't feel like it's a stretch of my imagination. I don't have to push my imagination anywhere. It's. That's how reality really, really, really works."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":1254.07,"end":1356.7,"speaker":"Paul Vander Klay","text":"But I think if you. It's. I really liked your conversation with Guy, and I know. I know, you know, you might have felt this is too much talking about me, but I think. I think it's really, in a sense, people have to sort of walk with you through your story to get to where you are now. Because if you look in a tribal frame from what you just said of Genesis, a whole group of people in Christianity and certain segments of Christianity would say, oh, I'm so glad to hear Jonathan say that. But they still have absolutely no idea what you're talking about, because they are materialists. And the entire conversation, I mean, the Western church. The Western church ripped itself open over this question about how material is Genesis 1. And, you know, so John Walton, who taught Old Testament at Wheaton College and has written some books, the Lost world of Genesis 1, this lost world Series, he. I mean, even when he, in the evangelical space, starts talking about the fact that this really isn't about materiality, that, you know, certain parts of the evangelical world hear that and get nervous. But then the other side of it. So you have the fundamentalist modernists, the other side of it sort of cheer."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":1356.94,"end":1359.46,"speaker":"Jonathan Pageau","text":"But for the wrong reasons."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":1359.7,"end":1360.34,"speaker":"Paul Vander Klay","text":"Exactly."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":1360.42,"end":1361.86,"speaker":"Jonathan Pageau","text":"No, you're right. I totally agree."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":1363.14,"end":1517.13,"speaker":"Paul Vander Klay","text":"And so I think it's important, you know, I think what you're doing is vitally important because you can't take this thing on directly. You know, one of the most interesting moments of the Gospels that always shocks me is, so Jesus is heading down to Jerusalem with his disciples, and he says, okay, this is what's going to happen. We're going to go down to Jerusalem first. They're really nervous about going down to Jerusalem for real reasons. And we're going to go down to Jerusalem. I'm going to be turned over into the hands of Gentiles, I'm going to be crucified, and three days later, I'll Rise again. They didn't seem to hear anything about the rising again. They did not register. And the only thing they heard was the political layer of this, that I am going to be. I am going to. The Gentiles are going to have me in their hands and they're going to have their way with me. And of course, Peter stands up and says, I'll never let this happen and get behind me, Satan. And I think that's. I think that's an instructive. That's an instructive lesson in how people change. And even. Even the entire. So when I was in college, you know, so I grew up. I grew up a minister's kid. You go way to college. I went to a Christian college. But Calvin College sort of had the theme of, we're not going to be your parent if you want to drink. And if you want to. If you want to rebel, you go ahead. It's CRC Rum Springer. So if you want to rebel, go ahead and do that. And so I start reading. Start kind of thinking, okay, do I want to be a Christian? So I start reading the Gospels. And I was immediately frustrated by the Gospels because they didn't seem to be talking to anything in my life. But now, the longer that I think about it, Jesus, through those stories, was reprogramming the world. And of course, even. Even the story layer doesn't quite hit all the layers down. And so what was even more clear was that even though the disciples didn't understand Jesus at all, he was reprogramming them. And so then that gets me to the question, okay, what happened in Pentecost? Because in my old frame of, let's say, Cartesian dual substances, there's a material substance and a spiritual substance. But basically, through your work, I'm seeing that as not a helpful way to imagine the spiritual world."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":1517.37,"end":1789.84,"speaker":"Jonathan Pageau","text":"Yeah, I think that. I think that what happened in Pentecost is what happened at the beginning of Genesis, like in the creation of Adam. So basically, what you have is something like Christ came and then gathered a body together and also gave them all the information. And so he gave them all this information, and then they gathered and they gathered, but they didn't have yet what it took to be alive. And then Pentecost is the moment in Genesis where God blows air into Adam's nostrils and makes all those disparate elements come together. And so you can understand it as a. In my discussion with Guy Sengstock, I talk a little bit about my experience of that, where it's like I grew up In a more kind of evangelical background, where we had all the Bible stories. But I never felt like you said that there was any. It was almost, like, arbitrary. It was like, here's this story, which is true, but it has an arbitrariness to it. And so there are all these stories from all the. From the. And they tried. They really tried hard to find morality tales in these Old Testament stories because they're really hard to. If you see them that way, man, you're going to struggle, because a lot of those Old Testament stories have very little morality tale to them. But so all these stories are there. And then when something happens at some point where it's like the curtain opens up, and then all of this information, all of this. This conglomeration of things joins together and becomes a body. So I think that that's what happened at Pentecost. It's like they received the Holy Spirit, the breath of God blew down, and they became an actual body. And that included several things. It included that they cohered together. It included that they stopped being afraid because they had confidence, they trusted in why they were together. And so all the elements of what makes something one kind of came down upon them. And so, you know, and so Peter stood up in a kind of leadership position. And then, because they had this kind of coherence, they also. But Pentecostal, the thing about Pentecost is that it's both a coherence and a kind of wild multiplicity. It, like, fills up everything because it. It both has them coming together, understanding what this was all about from the beginning, cohering as a group, but then having the capacity to reach the end of the world, like going and speaking in a way that can be understood by anybody who's there to understand. Right. Tongue of Fire, the idea that they can speak into multiplicity. And so it really is like this cosmic event where, like you said, the reprogramming that Christ was doing started to bear fruit in this body that he had accumulated. And then it started to grow and it started to lay itself out in time. And the way it laid itself out was people imitating Christ and understanding that the martyrs are the seeds of the church. And this is an actual reality that if. If people who die for. Who die like people who would end up dying for Christ would create little seeds that would go in, and then bodies would accumulate around those seeds. And then the church just started to grow and to grow and to transform, to transform reality, both in terms of ideas. But even physically, like geographically, the geography of the world changed as The Christianization happened, like cities started to manifest around martyrdom sites, and all of the whole political sphere started to be transformed as these new sacred spaces were being installed. You know, and then Constantinople was the biggest deal of that. Where, you know, people always say Rome fell. It's like Rome fell because Constantinople grows in glory, too. It's not just. It's not just that Rome fell, is that this. This new city, this Christian city, which never had a pagan temple, became the new center of the world. So I think that that's it. Pentecost is such a wonderful image of how reality works. It just shows you it's a real instantiation of a new creation. You could say it that way."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":1790.32,"end":1861.44,"speaker":"Paul Vander Klay","text":"Well, that leads so many interesting places because, I mean, this continues to happen in Christianity in that. I mean, the center of mass. People do these weird mass about the center of mass of Christianity. And unlike Islam and a number of other major world religions that they basically continue to have sort of where their center is, is where their center always has been Christianity. It just moves around the globe. And I mean, in Africa and in Asia and in Latin America, although Latin America is a very interesting story because of the Roman Catholic and then the evangelicals. But I. So having said that, to come back to what we mentioned first, what is happening right now through the symbolic world and through bridges of meaning, discord, and through YouTube, I think. I don't know. Did you think your channel would get this large?"}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":1862.16,"end":2124.35,"speaker":"Jonathan Pageau","text":"I don't think that way. Like, I just don't. I don't plan that way. My life, my whole life is not. Is never in that sense. I just kind of do the things that are there and try to do them fully. And that's usually the way that I approach things. So to me, what I see. Let's say what I hope. I can tell you what I hope out of this is I kind of. I think that this. I. The way I talked about this before with a few people, which is that this is the future, like the symbolic worldview. Whether you frame it exactly the way that I'm framing it or that, or whether you frame it, you know, in terms of the way that John Vervecki frames it in terms of cognitive science, or if you frame it the way that Ian McGilchrist frames it in terms of the right hemisphere kind of global vision, all of this is the future. And I think a lot of people are realizing it. And so what I. But it's also the thing is that it's also one of the things that is bringing about some of the madness around us, the fact that symbolism is coming back into the world and manifesting strongly is one of the things that is also causing the craziness of the frame shift in media, for example. And so one of the things that people are understanding is how framing information is more important than information. And everybody now is seeing that, right? Because of, because of the way that even just the way your election happened was crazy. Like the things that they decided to report on and the things they didn't decide to report on and the way that they frame what's happening is more important than any information that's there. So everybody's seeing that and some people are taking advantage of it and then creating very weird ideological cliques and creating weird new social rituals. And even a lot of the COVID stuff has a weird religious tone to it in terms of also, the BLM protests and all of that had a lot of religious overtones to it. So this is it. Like, you're not going to stop this. And although the new atheists can whine all they want, they're not going to stop it. It's religion's coming back. It's coming back. And now the question is, how is it going to come back? You can't stop it. And so what I hope is that in speaking into this kind of frenetic transformation that's going. Going on, that, that, that we can help create stable places or stable people, people that have enough vision and enough centeredness that they can act as seeds in their own communities, that they can go back into their church and help their church prevent from going crazy. Because it's going to get worse. It's going to just keep getting worse and so be part of the people that are helping their churches to not go crazy, that they can go back and it doesn't necessarily have to be a church, but in their communities, helping them prevent the madness that's going on by having a balanced vision of this heaven and earth hierarchy in all its aspects, both the negative and positive, understanding the role of the margin, understanding the role of the center, and then seeing all of this as a necessary part of the cosmos. And so that's what I hope. And I don't know if it's going to. I don't want it, I definitely don't want it to become this weird kind of inner discussion too much where we're all talking amongst ourselves and we're all kind of, kind of happy that we understand things, you know, and winking at each other, because we can see that other people don't get it. That's not what I don't wanna be. That's not what happens. You know, I really hope that it's going to produce fruits in the world, which is why, like which of why on the symbolic world we started a blog and I wanted people to kind of train themselves to write on symbolism and I'm gonna start to probably appear on some of the YouTube channels of the different people on the symbolic world Facebook group just to kind of help people train them to get a little army of symbolic thinkers that can then go into their own domains and start to have fruit. You know, that's what I hope and at least that's what I, that would be the, if you could boil down what I'm doing to one thing. I think that's probably, probably it."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":2125,"end":2165.08,"speaker":"Paul Vander Klay","text":"Well, I think your emphasis on community and on in real life community is vital. No, I think that's right. And part of what I see, I had the thought a couple of days ago that I wonder if, say the period from the last 500 years as Charles Taylor talks about, I wonder if 200 years from now that will be looked back upon as a dark age and find the, find the embracing of the world, the word enlightenment to be horribly ironic."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":2165.56,"end":2167.72,"speaker":"Jonathan Pageau","text":"I think so. I definitely think so."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":2169.08,"end":2224.72,"speaker":"Paul Vander Klay","text":"And I think, you know, as a, I think a lot of churches, I mean this is, I mean what you're describing is happening in churches because the, I mean my own little church, this certain way of doing churches dying, that has been the dominant paradigm in Protestantism at least. I mean the Catholics have always kind of gone through their own transformations and of course the Orthodox are coming online in North America I think in a growing way. But the how this, how then the church, how this changes church for people, I think will be profound. And I, I don't know what it looks like. I really don't know what it looks like."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":2226.32,"end":2366.98,"speaker":"Jonathan Pageau","text":"I, I, I understand that. I think it's the one thing it's not going to look like and I hope and I don't think it's possible and I don't even want that is that one thing it's not going to look like is a bunch of people like for them, in my case, like a bunch of people who understand these things because that's not understanding for example, symbolism is really not that important. Like it's important now because we're in a weird upside down kind of end of civilization period. But in normal world you don't need to understand it, you have to enact it. You just have to the inside and enacted. And so what I'm hoping is that the people that are kind of influenced by what's going on, these discussions about meaning and everything, can then go back in their world and then produce other things. Not symbolic discussion, but rather help people live the liturgy better, help people live the. Help people see the value of their stories and then also create new versions of old stories and get people involved in that. And so to me, that'll be the key. And also just the excitement, the excitement about scripture and the excitement, the feeling also, like, the sense of confidence about how true this is in a different way than what the materialists have said, which is kind of crumbling and always fraught. I think that. That. That's going to be. That can be infectious as well, because. And I've seen it, like, I've talked to some of the old pastors that I grew up with who are kind of very materialist. And if I talk about it in the right way, if they see in my eyes that I love the Bible, that I really love scripture, and that it's like, I am so excited about scripture and about all the potential, all the stuff in there that you haven't totally seen yet. And, like, and I'm talking about the relationship between, you know, the garden and the temple, and. And I'm showing them the pattern, how it. How it, you know, like, let's say, like, how I laid out Pentecost for you just before. Like, I've noticed that that gets people excited. Pastors who. Who have been studying scripture for a very long time, they don't feel threatened by it if you present it in the right way. And so it's like that, that type of excitement."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":2366.98,"end":2367.34,"speaker":"Paul Vander Klay","text":"And."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":2369.11,"end":2382.55,"speaker":"Jonathan Pageau","text":"I think that can be wildfire, and then it can be transmitted, but it's not necessarily going to happen in an explanation of what these things mean in the end. Participation."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":2382.79,"end":2454.04,"speaker":"Paul Vander Klay","text":"Well, and I think that's part of the, you know, part of the deception that's happening on these screens and in these little frames on smartphones and computer monitors and televisions, I think, is that through this medium, we can only do certain things. And one of those things are conversations about symbolism, or we can only do certain things in this little frame. And the real frame that things have to happen in are the incarnational frame of, okay, what does it mean to be faithful to your wife and to build a community and to actually have logos shape and colonize and reform all the materiality around us? And I think this is part of the reason that it's critical that you're an artist because even though. Well, maybe now you're sort of well known as someone who explains Rudolph and vampires."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":2454.28,"end":2454.76,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":2455.72,"end":2462.36,"speaker":"Paul Vander Klay","text":"The. You know, what, what you're. I mean, iconography is."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":2463.24,"end":2463.64,"speaker":"Jonathan Pageau","text":"Is."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":2464.68,"end":2489.53,"speaker":"Paul Vander Klay","text":"Is iconographic itself. And that's, you know, that's. Okay. I've come from an iconoclastic tradition, and so, you know, this is. There's a little bit of dissonance involved in this for me, but it's the, it's the practice of the church. I mean, Leslie Newbegin had this. Had this great quote. The. The church is the hermeneutic of the gospel."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":2490.33,"end":2490.81,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":2490.81,"end":2503.85,"speaker":"Paul Vander Klay","text":"In. In that. Okay. What. Why did. Why was Jesus able to conquer the Roman Empire in 300 years?"}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":2504.17,"end":2504.33,"speaker":"Jonathan Pageau","text":"Three."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":2504.48,"end":2558.35,"speaker":"Paul Vander Klay","text":"Through his spirit. Because the Holy Spirit is the spirit of Christ. It's also the spirit of the Creator. I mean, it's. That's why you have a trinity. And how was Jesus able to conquer the Roman empire in 300 years? And the answer is the. His pattern. Because no one of us can fully manifest the full pattern of Christ. But the pattern of Christ gets manifested in. In these communities and in their life and in what they do. And always, you know, always in a limited way. Always, but. But yet sufficiently so that it literally toppled the empire and that entire way of life. And again, that's what. That's what Tom Holland has been documenting, that Christ conquered the empire."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":2559.44,"end":2655.5,"speaker":"Jonathan Pageau","text":"Yeah, definitely. And it's wonderful to have that book. It's such a great. It's such a gift. I really. I was reading it while I was cheering and while I was carving and I was cheering in some of the places. Like, I was like, yes, I can't believe. I'm so happy that he's saying this. And he's saying it so well, way better than I could ever say it. So. Yeah, I totally agree in terms of the embodiment. And it's really, like, for me, it's a lesson. I need to make sure that I say that because I. It's like I, you know, I have. If people who follow me carefully have seen that I've talked about my own alienation towards kind of French Canadians and their. And their rejection of Christianity. And so it's like, I'm also. I also know, like, I know and I feel it in front of me, like, I feel it in front of me that I need to be involved, like, physically embodied involvement in this. This. This place where I am and need to be more involved, because or else my soul and my body and spirit are going to start to split apart. Because here I am saying these things online, but I'm also have this thing that I need to heal in my life where I need to now kind of dive in and be. And be like a French Canadian person in this society that is, that is acting and being involved. So, so it's like this is like the next step for me. And I know that it's coming next year. This is going to be next year especially because we won't be able to travel anyway. So it's like all of God is putting. It's like this is in front of this. Is it Jonathan? No, more like you need to, you need to live by what you say."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":2658.86,"end":2713.41,"speaker":"Paul Vander Klay","text":"That's true. That's true. It also strikes me as, I mean, part of what's happening in the world via this technology and the Internet is that, I mean it's, there's always kind of a. Both sides. And I've been thinking about empire and what, I mean, we, we, we're near. We nearly have a one world culture in some ways because of the Internet. And so, and that is corrosive, you know, so the French Canadian, the French Canadianism that came about because of the, you know, because of the way, the way that the waves happened in North America by different European countries that created something. And part of what the Internet is doing is sort of, you know, reducing all texture in the world."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":2714.69,"end":2715.17,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":2715.25,"end":2772.63,"speaker":"Paul Vander Klay","text":"And. But it's, but there's always this tension. There's always this tension in, in evangelism that, you know, it's the one in the many. And I think again, you're, you're, your symbolic vision has been really helpful for me to kind of manifest that, that there was always something at the heart of Protestantism which was an, which was an unhelpful uniformity that by virtue of the. Let the earth bring forth, let the seas bring forth, there's a healthy diversity and a multiplicity in that, that, that God affords and that Christ affords, but that a certain Protestant vision of the world tends to."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":2773.51,"end":2928.64,"speaker":"Jonathan Pageau","text":"Yeah, but I think it's more, I think it's a Western thing because it happened, it happened also. There wasn't just Protestantism. Like if you look at the way that the Latin Church enforced itself on England, for example, and how Latin was enforced in the Celtic lands, you can see that there's a strange thing that happened in the west, that even in Catholicism and then in the Counter Reformation, the Council of Trent was like this massive uniformization of the liturgy, uniformization of the, you know, of Latin kind of just going all the way into anywhere that Catholicism was. So there's something about the west which has this desire to create uniform systems and then. Which obviously then goes into everything else, like in terms of how we view government and how you can look at the way that the different revolutions happened and how there was this desire to kind of make education uniform, make language. Everybody. Before Napoleon, no one spoke French in France. Like, this French idea came from. Napoleon just enforced one version of French on the entire country. But before that, it was all local dialects and local languages. So there's something about Western culture which has. Which does that. And, uh, you know, and I don't know, like, people will trace it to. To. To whatever they want to, but it's. It's not. I don't think this is necessarily a Protestant thing in the Orthodox tradition. It's like a weird tension. Right. It has its positive and its negatives. Like, it has a. It has a positive. Because they tend to translate. Like, they'll translate right away. When they converted the Russians, they translated everything into. They actually created the Slavonic language, and then they translated everything into Slavonic. You know, they created a written version of the language that was spoken there. And so then they developed their own thing, I guess, and that kind of happened all over the place. But in Protestantism, that's part of the. Protestantism has the two extremes because it also has the extreme variety, like radical variety, where the translating of the Bible in every single tribal dialect that you can imagine, you know, it's like a goal. And then you have all these. All these idiosyncratic versions of. Of Christianity all over the place, the world. So it's like. It's like a. I think the west has, like, the radical. The two radical sides of, like, total enforcement, and then just like this free for all. I guess something like that."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":2929.12,"end":3036.33,"speaker":"Paul Vander Klay","text":"I was. I was yesterday on the. So we have this little open studio, and Sally Jo came in. She's an artist, and she. She came in and she said, I tried to have a conversation with a Protestant about art in church. And. And I almost wanted to hide under the desk because I knew exactly where this was going. Because this. This gets into this question of the one and the many. Because it gets into this. This question of when you start. When you. When you start instantiating a vision in. In visual media. There's a power there that in some ways, preachers kind of get to sidestep by keeping everything verbal. Yeah. And, you know, when I mentioned that when I went down to Nicaragua, I went down to Nicaragua during the Sandinista revolution in my more radical college days. And there was, you know, they had these revolutionary churches where you had Sandinista rebels hanging on crosses nude with these huge phalluses. And I mean, it's. I'd really, you know, and when Sally Jo was talking to me about, okay, so, you know, if you had. Okay, so how do you represent that we're in the season of Advent now, heading towards Christmas, how do you represent the story of Mary and Joseph visually? And, you know, and to me, it's a big deal."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":3036.33,"end":3039.33,"speaker":"Jonathan Pageau","text":"Like, even in the orthodox tradition, like, that's a big deal."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":3039.57,"end":3154.17,"speaker":"Paul Vander Klay","text":"Well, that's why I told him, I said, you gotta talk to Peugeot because, you know, immediately when you raise this, it is a huge deal. And when I look at your story. Yeah, I mean, that. That's why I don't think you should be too bashful about your story, because you yourself were the matter in which all of these stories came down and, and manifest themselves. And this. And this struggle of, you know, Sally Jo said, quite rightly, she said, you know, all these Protestants are resisting. Are resisting the visual arts, but. But they still have to do architecture. And so they're still manifesting in their architecture, in their liturgy and their music, in all of these ways, they're still manifesting culture. They just sort of have a willful. She didn't quite say it this way, but they have a sort of willful blindness about it that if we construct our campus to look like a junior college, we can sidestep the question of if we're going to have Mary and Joseph rolling into Cleveland in a. In a 96 Honda. Because once you. Once you locate Mary and Joseph in a visual art medium, you have questions of race, of class, of. Of nationality. You know, we have all of these layers that get manifest in a visual medium. And when I look at what you've done, you've said, basically, okay, I'm going to go to the traditional. And, you know, when I remember your story, that's a big deal for you, because what was happening in other ways is that people were, you know, okay, we're going to put Sandinista rebels up on a cross. And I'm really curious about what to do with this, because this is at the heart of what we're struggling with."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":3155.21,"end":3386.47,"speaker":"Jonathan Pageau","text":"So you have to kind of see it as if you see the tradition as this kind of organic living thing that almost like, you can almost use weird evolutionary terms, like, to talk about it where it's like there are propositions and there are propositions. And then some are kept and some are discarded. So there's a system of weeding and weeding in, weeding out that happens. And then sometimes someone proposes something which is a little too radical, and then maybe like a church council or a local council has to kind of smack it down, right? And then another. Someone produces something which is actually extremely powerful. And then maybe the authorities will nudge people in that direction and will say, like, there's, for example, like the Russian church one time said, you should make images. Like, now is mine. His name is not going to come to me. Like Rublev. You should make images like Rublev. And so they actually named an artist and said, you should make images that copy his style. And so what happens is, because it's like a theological process, then what ends up being kept ends up being extremely theological, because there's like this organic process of weeding in and weeding out, you know, and then. So then when you want to propose something different, you always have to look and try to understand, why is it this way? Why. Why do we show things this way rather than another way? Because it's like the whole idea of, like, not removing fences, like, even if you don't understand why it's that way, you should probably respect it because a lot of energy and a lot of, you know, a lot of energy went into it by a lot of people. It's not just someone who. Someone probably did come up with it, but then the fact that it was preserved and that it was slightly modified through time, then it ends up being. So I think that that's a good way to understand why traditional images have the power they do and why they're really a good starting ground to understand how to represent things visually. And so, like, for example, in terms of Mary and Joseph, a good. A good thing that you would. You will notice if you look at Orthodox icons is that they'll never show Mary and Joseph like a couple. Like, you know, those images of the Holy Family. That's not Orthodox. Like, Orthodox Orthodox, that when you see. Every time you'll see an Orthodox person maybe making one of those, you'll get a bunch of. A bunch of angry comments, like, people are not happy about showing Joseph's arm around Mary. And like, so you have Joseph's arm around Mary and then you have baby Jesus in her arms. And so it's like, if you understand what images do, like, images suggest meanings. Like, they. They're not arbitrary, right? So if you suggest a sexual relationship between Joseph and Mary, you're actually Calling into question the virgin birth. Like, ultimately, you're. You're calling that into question. And so, like, the. The image of. The image of Nativity is actually pretty scary for some people because the Nativity icon shows Joseph outside the cave, like, wondering what's going on, like, not understanding what's happening. And Mary is. Is inside the cave alone, and she was helped by, you know, by. By what's the name of. By women. Like, there's women who helped her give birth. It's not Joseph. Like, there's no way in the world that in 2000 years ago a husband would help his wife or a man would help his wife give birth. It's such a modern thing to think about that. And so. But there's a reason why they do that, because they really want to avoid anybody thinking that Joseph is the father of Jesus in every way. Like, you can't have anything suggesting that. And so it's. It's a theological decision, and it can. It can offend our sensibilities because we want to show the family."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":3386.71,"end":3387.11,"speaker":"Paul Vander Klay","text":"Right?"}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":3387.43,"end":3392.31,"speaker":"Jonathan Pageau","text":"Right. But there's something higher that is more important than just showing a nice, happy family."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":3392.55,"end":3392.87,"speaker":"Paul Vander Klay","text":"Right."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":3392.87,"end":3398.09,"speaker":"Jonathan Pageau","text":"Which is this idea that Christ is the son of God."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":3400.48,"end":3442.41,"speaker":"Paul Vander Klay","text":"I laugh because Google's getting off of Google music. And so now I'm playing around with YouTube music. And just yesterday I was thinking, okay, I'm just gonna. I'm just gonna search for Christian, popular Christian Christmas Music 2020. And, you know, there's all these. Again, what struck me was there's all, you know, a lot of this is evangelical music. And so many of these attempts are, okay, let's show Joseph and Mary and Jesus as the. Dare I use the word, Iconic nuclear family."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":3442.65,"end":3457.84,"speaker":"Jonathan Pageau","text":"Yeah, that's the way people want to present it. But it's a bad move. It's a really bad move, I think, theologically, to do that. There are other families that you can find to do that, I guess, but it's not a good move."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":3460.4,"end":3530.68,"speaker":"Paul Vander Klay","text":"Jonathan. No, no, no, you don't have to apologize. But to me, it's symbolism happens. And, you know, part of what I struggle with is, say, looking at the Orthodox, looking at Orthodox representations, I wonder, I mean, our first conversation, you asked me how was your liturgy? And I told you it was a mess. And I still hold to my answer because it continues to be a mess. But. But part of what. Part of why it continues to be a mess is that I have. I have lived such a. Such a multicultural life. So my. On my father's side, my ancestors were Jews who probably Left Spain, found, you know, fled to the Netherlands, which was sort of a place of tolerance. You know, one of the guys on our Discord server is a, was, was a, was an ultra Orthodox Jew. And he did some genealogy, I shared some genealogy, says, well, you've got a bunch of distant relatives who are prominent rabbis in Israel."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":3530.74,"end":3533.53,"speaker":"Jonathan Pageau","text":"And, and it's like, that's hilarious."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":3534.33,"end":3751.3,"speaker":"Paul Vander Klay","text":"And so I, you know, then, you know, a number of generations back, my great great great grandfather start marrying Dutch girls. And my great great grandfather sends my great grandfather to America to Western Michigan to assimilate with the Dutch. And my grandfather becomes a minister and my father becomes a pastor in a black community. And I work in the Dominican Republic and then come to this multi everything community in Sacramento in a Dutch Calvinist religious tradition. The world is such a blender. And I think part of all of these strains do not disappear. And so the question then becomes, how do all of these patterns find a degree of harmony in Christ that blesses the world? You know, and I see some of, you know, I don't know, obviously your life to the same resolution that I know mine, but young man raised in an evangelical context, obviously, I mean, you spoke with Guy about your father and the ways that you've spoken about him before. You know, a good man and a Christian man. You go on your own journey of exploration and wind up, you know, you spend some time in Congo, you wind up now in orthodoxy. But part of what I, when I talked to a guy in my channel, Bern Power, who is an American who grew up Jesus people in California, then moved to New York City so he could be in the music and art scene and then moved to Alaska and, and now is living in Tbilisi, Georgia. Whoa. And so I asked him about orthodoxy there and he talked about, because Georgia is one of the, you know, a deeply orthodox country. And so I talked to him about some of these issues and orthodoxy in America is going to be a different thing. And part of what happens in America is there's sort of a ghetto phase and maybe the French Canadian is kind of a really large ghetto. My only experience there, I visited Montreal once when I was young and we were at some sort of an amusement park and I was in line for some rides and some French speaking kids didn't treat me real well. So there's what's back in my lair. But what I see happening in terms of these dual tensions of globalization which sort of, sort of reduces individuality into this broad consumer culture, yet the, the contextual, the textuality of every different place and every different story. I'm. I'm deeply interested in. In. In what the Orthodox Church is going to look like in. In this context, because it will be very different from what you find in Tbilisi, Georgia."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":3751.62,"end":3967.9,"speaker":"Jonathan Pageau","text":"Yeah, for sure. And I think that's inevitable. Orthodoxy definitely in America has a Protestant flavor, especially the convert type Orthodox. That's just. It just happens, you know, it's hard to avoid that. And that can actually have some positive elements, you know, because the rigidity, let's say, of systems like in any system can be a danger. For a highly hierarchical system like Orthodoxy, it can be a problem. And that's. I think some of the things that led to the revolution were the problems inherent in these types of structures where you have corrupt individuals who nonetheless remain in power and then, you know, use the church to their own. And then all the kind of stuff that led to the Reformation too, you know, that the stuff that led to the Reformation was real. Like there were really were all these problems. I don't want to. Even though I tend to not side on the side of the Reformation, I can recognize the reasons why people were angry, you know. And so I think in America, there's a fascinating thing where the kind of Protestant flavor, it gives an energy which is really good, you know, and it gives also a love of scripture and a desire to be. To desire to not take things lightly, like, to not take the way that Protestants are, like serious Protestants don't take scripture lightly. You see, the same with people who are Orthodox in America, where it's like they don't take liturgy lightly. They don't take the Church fathers lightly. They tend to really want to get down to the bottom and not just gloss over things. And I think that can be useful sometimes. It creates a kind of rigorous, weird rigorism that is there too in America in the certain Orthodox convert groups where they're extremely rigorous, like super, super rigorous. And, you know, it's like they know all the canons of all the councils and they know all the things, and they're extremely. They try to be very, very rigorous, which in my opinion is not. It's not the best way to go, but, you know, you need a bit of that too, because. Or else it just. Everything gets floppy. But so it is fascinating to watch. And it's also very. It's in the image of America. It's a weird, multicultural multiple. And it's actually not how Orthodoxy shouldn't have all these different churches. Right? So it's like, you know, in Greece, there's a Greek. There's the Orthodox Church, and there's the bishop and their priests, and there's the archbishop. And whereas in America, there's like the. There's the. There's the Oca, there's the Russian Rokor church, there's the Antiochian church, there's the Greek church, there's the Ukrainian church, and so Romanian church. So it's like. It's actually a weird. It's actually a weird freaky thing where you have all these competing and parallel hierarchies kind of working together, which is maybe in the image of America, makes it even more in the image of America. So. And people can just, like, it's weird because, like, a lot of people. A lot of people, like, they leave Protestantism to become Orthodox because they're like, oh, finally, like, I'm gonna be. I'm gonna find the thing. But then within Orthodoxy, they keep switching churches. They keep going. They'll go to the Greeks, then the Russians, then this. And so they're still acting like Protestants within Orthodoxy because there's that capacity to, like, move from one hierarchy to the other. If the one. The one you're in doesn't suit you for some reason or whatever."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":3968.06,"end":4018.42,"speaker":"Paul Vander Klay","text":"Right. It's almost. We won't know we've done something until we actually exercise this consumerist spirit that leaves the consumer at the heart, you know, because that, in many ways, that. I mean, that's a deep problem in Protestant churches as well, which has. I've seen that grow. In the Christian Reformed Church, 50, 75 years ago, you were a member of a church. Pastors kind of came and went, but the church was the community. They invested, they held, they cared, and pastors sort of were role players. And in America, you know, the celebrity pastor is the heart. And then the people act like consumers, which means that there's no actual community. Yeah."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":4018.42,"end":4052.86,"speaker":"Jonathan Pageau","text":"And there's also, like, the service church, you know, where it's like, I go to that church because it has a good youth group. It has a good. This. It has. You know, it's like you. You look at the menu that the church offers, and then you. You see, oh, well, the church has this, this, this, this, this. And so it's like, I'll go there because it has this. It has, you know, it. It has the options that I like, you know, and so that's obviously, that's seriously a difficulty. It's so hard to break free from that. Cause we're so used to it. It's almost so ingrained in us to see ourselves as consumers that it's hard."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":4053.26,"end":4055.58,"speaker":"Paul Vander Klay","text":"Well, it's a manifestation of what's at the center, Right?"}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":4055.58,"end":4056.14,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":4056.54,"end":4071.66,"speaker":"Paul Vander Klay","text":"It's our ideology at the center. And church and God and the world are here to serve me. It's so completely opposite the heart of the gospel."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":4072.11,"end":4072.31,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":4072.31,"end":4118.08,"speaker":"Paul Vander Klay","text":"Well, to swing back then again to the symbolic world, Bridges of meaning, these channels. Because. Well, and because, you know, when you ask that question, I mean, part of. And I was. I started making videos partly because I watched. I watched Jordan basically cut a hole through the fabric. You know, maybe that wasn't the right image. Maybe I saw him create huge ripples in the pond. And I watched someone recently had a tweet where they said, first I listened to Sam Harris, then I listened to Jordan Peterson, then Vervaeke and Peugeot and Vander Clay. And now I'm thinking about being a Christian. I blame Sam Harris."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":4118.08,"end":4128.18,"speaker":"Jonathan Pageau","text":"That's right. That's hilarious. I love that tweet. That's so funny. And it's like, I've heard. I mean, I'm sure it's the same with you. I've gotten so many messages of people that have that story. Very similar."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":4128.74,"end":4194.29,"speaker":"Paul Vander Klay","text":"But then. But then the question is, part of the reason I started making videos was as a pastor, I knew that Jordan sort of moving through the zeitgeist as a televangelist with his books and his videos. People, you know, disturbing people, they're having new insights, and then they start looking around for, you know, all very intuitively, what. Where can I keep going? And I knew that when you do this to people, okay, let's say you. Let's use Jesus parable. If you clean the house, if you don't fill it with something, that vacuum will attract other things into the house. And so part of why I got into this was I knew that a vacuum was being created. And I didn't know to what degree I could help, but I wanted to at least give people something. Okay, you're interested in the Bible. Here's. You know, let's keep talking about this. Because the Bible can go a lot of weird ways, as Protestants generally show."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":4194.29,"end":4276.86,"speaker":"Jonathan Pageau","text":"And not just that, but it's like you can see it. Like you've seen the moment. You've seen the moments of, like, Douglas Murray saying this would be a good time to make up a new religion. You can see Bret Weinstein talking about creating. And we talked about this with Adam Friended, this wanting to create, like a superstructure that would manage all the other structures. And so there is this. This desire in this void to say, well, we're going to build the tower and you know, it's gonna. It's gonna reach heaven. And so it's a. It's actually. You're right. In a way, it is a dangerous time, you know, especially even the psychedelic stuff. Also, you can see that it's like we're gonna fill this void with psychedelics or some weird version of like a new religion with psychedelics or something. And aliens and alien aliens, interdimensional beings fall. Right. And so, and so I think that. I think that you're right. I think that we, that we. It's our responsibility and it's our. We have to. If we had this weird opportunity that was kind of almost thrust upon us to kind of talk into it and to hopefully be a little nudge of people to go back into the story that we're still in. Like, we're still in this story. It's not. That story isn't gone where at the. We might be, you know, towards the fringe of it, but it's still the story. So."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":4277.34,"end":4330.53,"speaker":"Paul Vander Klay","text":"Well, and that leads me into, you know, your question. I mean, two things have sort of developed around us. I look at the symbolic world and you've got a blog. I really love JP Morceau's follow up on the miracles conversation that I had with Vervake and the Lewis conversation. But the, you know, some, some people out there say, well, you need to, you know, Paul, you. You're starting a new church. And it's like, no, that is not what I want to start. And, and I really appreciate the fact that you're orthodox for that reason, because you're in that way even further from the Protestant impulse of every new ripple in the pond start denomination. And which, which there's a. There's something which is deeply problematic about that. So."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":4330.77,"end":4373.48,"speaker":"Jonathan Pageau","text":"But there's something about the fact that you, I think the fact that you, you follow Lewis, I think that that's one of the effects that Louis has had is to point people back to their Christian roots without starting a new thing, without saying, like, I'm going to start a new movement or a new church or a new. A new denomination. And so I think the fact that you place yourself kind of firmly in Lewis's footsteps, I think that's a good sign. Like, it's a good sign that you're not trying to start a new, like a new Protestant denomination, but rather just help people move through their own struggles and their own crisis, their own meaning crisis, so that they then go back in their communities, you know, and get involved."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":4374.52,"end":4415.63,"speaker":"Paul Vander Klay","text":"How. How serious? I mean, part of what Tom Holland impressed upon me is the, you know, my denomination. Well, and orthodoxy too. I mean, there's a strong antithesis element to Christianity where you're in or you're out, and that's, you know, that's. That. That is not going away. But part of what Tom Holland's work talks about is the latent. The latent Christianity, even in celebrity atheists around us."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":4415.87,"end":4416.43,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":4417.79,"end":4513.58,"speaker":"Paul Vander Klay","text":"And, you know, part of what I'm at least dealing with, and I think you probably are too, if I read the comments on your videos correctly, we're dealing with a lot of people who. I had a conversation with Poe, the person from the uk, and they're sort of in the. There's some in the Vervi camp is sort of. They're a little more comfortable with the woo and the New age ish stuff and the circling and, you know, the Vervriki camp is over there, but there's still another element over here who are the engineers. And, you know, Vervaeke just feels a little scary. And they. They're saying, boy, I really need something in my life like a church. But, you know, and so pastorally I'm trying to figure out. And in some ways the Discord server for me, I just did a couple of conversations with a guy named Topher from Toronto. People are working through this stuff and like Topher was. And that's sort of where my estuary concept has come in, because people are working through this stuff and they need a space to. They need a space where they can play with things and have permission to play with things. And that's always a dangerous space for people to be in, but it's usually a necessary space for people to grow."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":4515.9,"end":4635.33,"speaker":"Jonathan Pageau","text":"Yeah. And I think. But I think that that's it. And I think that that's the best that the online thing can offer us. And it's important to see that it's a place where change can. It's a place where exploration and transformation can happen, you know, because it is safe. It's like. It's a little. It's. It's kind of this exploration, but a kind of safe exploration because you're just sitting at home, right? You're on a screen and you're listening to things, you're watching things. And so I think that that's a great. It's a great thing if you can offer that to people and the opportunity to discuss in a safe, like, not safe in the. In the kind of safe space idea, but in a with people that they feel are at least asking similar questions. And, you know, and so I think that that's. I think that's great. Like, I dropped into the bridges meeting as a. As like this boomer that doesn't know how discord works. And I'd like, drop into conversations and people were like, jonathan is here. But then my mic wasn't on. And then I saw. Like, they were just thought it was just. Anyway, it's just weird. But, like, I've seen some great. Some. Just some great discussion and a lot of people getting involved in helping each other and giving people, giving each other advice. And. And so it's a. I think it's a. I think that it can. It really can nudge people to. In the right direction, that's for sure. But like you said, there are. We just need to. I think we need to be careful not to think that. Not to let it become like a new religion or a new. Or. Or, you know, a new centralized thing. That. That. But. But that's. Yeah, I think that. I think at least I trust you. Like, I don't think you're gonna. I don't. I don't think you're gonna. Next time I talk to you, you're gonna be wearing a new funny hat with, like. With some kind of liturgical clothing, and then you'll be Archbishop Paul of the Church of Bridges or something. You know, Like, I just. It's not possible. I mean, who knows? But I don't see it. So I think you're fine. I think you shouldn't worry too much about that stuff."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":4635.49,"end":4651.06,"speaker":"Paul Vander Klay","text":"Well, what do you want to do with a symbolic world? I mean, this has. It's a blog. It's your videos. You've got a Facebook group where you have discussions. I mean, where do you want this thing to go?"}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":4651.46,"end":4743.42,"speaker":"Jonathan Pageau","text":"So, to me, what I see is. I see this as a training ground. And so what I notice is I see people who watch my videos and are starting to think in terms of symbolic thinking. And so these people that are thinking that way, that have the capacity to do so I see it, that they need to kind of play with it and experiment and test it against other people. And so the Facebook group seems to be doing that, and it's doing it without me. I haven't even run that it's being run by Jacob Russell and a few other people. And so I can see people propose symbolic ideas. And then. Then you have people adding and testing and wondering about what they're saying. And so that's what I see. And the same with the blog is. I want to. It's like a training ground for symbolic thinkers that I hope will then go back into their own communities and produce fruits and help others embody it. Also create stories, a mix of understanding and production. Like having artists create new things, you know, and also being sensitive to the propaganda and culture and how, you know, they use symbolic. They use. They kind of distort symbolic language to influence society. So that's what I see. I really do see it that way as a. As a. As a kind of little army. Like a little army of symbolists that will then go back into their own world and have effects."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":4743.97,"end":4745.17,"speaker":"Paul Vander Klay","text":"Little army of Symbolists."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":4745.17,"end":4747.01,"speaker":"Jonathan Pageau","text":"Little army of symbolists."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":4747.33,"end":4748.93,"speaker":"Paul Vander Klay","text":"How do you feel about being a leader?"}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":4750.13,"end":4796.95,"speaker":"Jonathan Pageau","text":"I really don't feel like a leader. I wish I don't. I think that I've actually. Maybe to the dismay of some, I've actually kind of not been too involved on the Facebook group. Like, I'll like things, you know, and I'll write a few comments, but I try not to be too involved just because I really don't want people to follow me because I feel like it just doesn't make any sense. Like I'm online, for goodness sake. Like, you don't know me. People don't know me. People can't see all my. My foibles and my problems and everything. So I really don't. I really don't. I don't. I really don't see it that way. So hopefully I can point people back to their own authorities. Like in the church. Something like that."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":4797.11,"end":4800.37,"speaker":"Paul Vander Klay","text":"Yeah, yeah, yeah. Oh, good."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":4801.97,"end":4803.17,"speaker":"Jonathan Pageau","text":"We've been going for a long time."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":4803.17,"end":4804.93,"speaker":"Paul Vander Klay","text":"You are a leader, though. And."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":4804.93,"end":4805.89,"speaker":"Jonathan Pageau","text":"Is that what you think?"}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":4806.29,"end":4878.75,"speaker":"Paul Vander Klay","text":"No, you are. That's. But it's. You know, this gets into my questions about this whole space and about what YouTube is and about what can be accomplished in a Facebook group or on a Discord server and about the. This is. This is two dimensional. And if people. I keep trying to emphasize this with people, that nothing two dimensional is real enough. And so you might participate on a Discord server in a Facebook group, and you might watch a YouTube channel and you might grow from. I certainly want that. But it does have to manifest in three dimensions. In time, in locality, and any. We, yeah, we have to. We have to come to terms with the limitations of this medium so that we really resist the distortions it creates."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":4879.17,"end":4963.13,"speaker":"Jonathan Pageau","text":"Yeah, no, I think you're right. I think it's a good call for all of us. People watching and then us as well. Both you And I, to be attentive to that and to be careful. It's a, it's definitely a minefield. Because you have to be honest, like if I, when I, if I receive comments of people thanking me for what I'm doing, it's like that's that man that goes straight right up to, right up to the, to the ego. And so it's, it's a dangerous, it's always like a dangerous situation. And so hopefully God protects us from, from, from pride in that, in that moment. But. Yeah, but I think that the, like I said, the, the fact that I'm seeing people kind of take it on, take on their own. Like, I love to see what JP Maxeau is doing. I think that he's just such a great character. Coming up. Like, we've had some wonderful people writing for the blog recently that I think, you know, there's a. For someone, his name, Richard Roland, who wrote an article about Saint Dionysus the Areopagite. Well, he's now like becoming the co host of the Aman Seul podcast, which is about Tolkien and orthodoxy. And so it's like seeing these people kind of move out and you know, not like they're only. But they were in this discussion about symbolism and then starting to kind of apply it in other field. And that's what excites me more than anything, you know. And so that's what I hope to see. See, you know, other than seeing starting the Church of Jonathan or something."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":4963.53,"end":4964.81,"speaker":"Paul Vander Klay","text":"The Pajoian Church."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":4964.81,"end":4965.69,"speaker":"Jonathan Pageau","text":"The Pajoian."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":4966.33,"end":4967.37,"speaker":"Paul Vander Klay","text":"The Pajoans."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":4969.61,"end":4974.97,"speaker":"Jonathan Pageau","text":"It's good that that doesn't roll off the tongue, huh? It's actually probably pretty good Pajoian. It doesn't sound right."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":4975.13,"end":5086.63,"speaker":"Paul Vander Klay","text":"Well, it's. But it is a tale of warning because both Luther and Calvin would have been horrified by the fact that there are religious traditions named after them. You know, there should not be Lutherans, there should not be Calvinists. And the Apostle Paul makes that clear in the Book of Corinthians. Yeah, and, but, but that is, that is a, that is a natural thing. That is the natural way we use labels. But I don't know. I feel the same way. I look at the Discord server and I look at Job and Jeff and Luke and Sherry and Andrea, and I see leaders that you cannot, you cannot have a healthy community without leaders who, who manifest usually different things in the community, but around which the community coheres. And when things start going off to the side, they're the ones who, who pull it back, say, no, we're not going to do that. We're going to do this. We're going to, we're not going to talk that way. We're going to talk this way and that, you know, then the community starts to cohere and grow and to become a place where people can change and be formed by Christ. And what's so interesting is that, you know, Job, you can watch Job's conversion with my conversations with him over time. You can see elements of it and, and, and none of us are fully formed, but the formation is happening and the, the, the witness to the former is manifest in the forming process. And we're watching that happen and that's tremendously exciting."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":5086.79,"end":5088.63,"speaker":"Jonathan Pageau","text":"So, yeah."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":5090.87,"end":5091.35,"speaker":"Paul Vander Klay","text":"Go ahead."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":5091.35,"end":5113.48,"speaker":"Jonathan Pageau","text":"It's a good note to end. And I, I really enjoy our conversations and for sure, I really feel like we're on similar paths and we're kind of, we can learn from each other as well. I've been spending more time on your channel, especially in the past month or so, and so, and so I think we need to continue our ongoing discussions."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":5113.8,"end":5192.31,"speaker":"Paul Vander Klay","text":"I agree, I agree. And again, it sounds terribly fanboyish, but I, I do think. Well, let me say it this way. I've been watching this migration in my own denomination in church planters for a while, long before the Jordan Peterson thing or long before I knew your name. And I'm seeing. So this isn't just idiosyncratic Jonathan Peugeot who somehow, you know, caught a wave. This is, this is, this is a bigger movement by the spirit in the world that we are, you know, we, we are participating in. And, but your work has, has been tremendously helpful to me to, to sort of get beyond a dual substance model into a vision which is, I think, is, which is more unifying and I think actually more biblical. So I keep doing what you're doing because it's, it's, I think it's really important stuff, so."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":5192.31,"end":5193.95,"speaker":"Jonathan Pageau","text":"Well, thanks for the encouragement, Paul."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":5195.71,"end":5200.67,"speaker":"Paul Vander Klay","text":"And enjoy. I hope your move to the, to the old house goes well."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":5200.67,"end":5216.33,"speaker":"Jonathan Pageau","text":"Yeah, this is it, people. I, this is. This, this Sunday I move, I'm moving on Sunday into my house that was flooded a year and a half ago. And so we're really excited about that. And yeah, that's pretty much all I can think about right now. It's very difficult to think about anything else."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":5216.49,"end":5223.53,"speaker":"Paul Vander Klay","text":"Well, and I hope Covid relents and maybe September 2021, I can meet you in Thunder Bay."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":5223.61,"end":5225.05,"speaker":"Jonathan Pageau","text":"That'd be awesome. I would love it."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":5226.97,"end":5230.48,"speaker":"Paul Vander Klay","text":"All right, Jonathan, it's great to talk to you. Take care Bye bye."}
{"episode_id":"SW - #140 - 2021-02-10 - Paul Vanderklay - The Future of Online Discussions on Meaning","start":5231.2,"end":5296.2,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description and so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially going to www.thesymbolicworld.com support or else on Patreon Pajo videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
