{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":0.4,"end":27.66,"speaker":"Jonathan Pageau","text":"Yeah, it reminds you of what is real like and what is not real. The online world is really in some ways like the chattering of demons, like these, an anonymous troll type people, you know, you also know that the, not all of them, but a lot of people, that's not their whole personality anyways. It's almost like I'm gonna go online and I can play this like role, you know, and then they go back and they, they like live their life. It's almost like a little, like a little video game."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":27.66,"end":37.34,"speaker":"Greg Hurwitz","text":"It's a first person shooter video game. Right. I'm going online, I'm going to own the libs. I'm going online, I'm going to dismantle MAGA people and that's my way. I'm virtuous."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":48.78,"end":135.87,"speaker":"Jonathan Pageau","text":"This is Jonathan Pedro. Welcome to the symbolic world foreign. So hello everyone. I am here again with Greg Hurwitz. Those of you that follow my channel will have seen him on my channel. He is a best selling author. He's written Orphan X and several other series including Batman of which I'm a big fan. But he was also part of the Exodus group that met to talk about exodus for like 32 hours. And the, the videos of Exodus have been doing. It's crazy, the first episode is more than 2 million views on YouTube. And they've also had, you know, similar types of success on the Daily Wire, our Daily Wire platform. And so I thought it would be great with, with Greg to talk about our experience there, you know, kind of where it led him in his thought and in my thinking and, and hopefully, yeah, start from there. So maybe Greg, if you want to start us off, you were in some ways the, you were like the, the strangest character in the group in the sense that you kind of came from, from like, you know, you, you came from a more secular world. You know, you're, you're, you're writing novels, you're more, you're not like someone who would spend that much time in the Bible in your life. And so for you it was like a discovery. So I'd like to know a little bit what your experience was in, in talking about this with us."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":138.6,"end":292.55,"speaker":"Greg Hurwitz","text":"I mean the first thing that I thought about that, as you know I move between a lot of different communities and groups and it's one of the great things for me about being a novelist is I get to just explore. I'm fascinated by how people think. I'm nearly impossible to offend. I don't share a lot of the kind of hard, partisan ideological lines and have lots of different discussions. I mean, the first thing that struck me was, you know, just. It was really an honor to be around a table with that many people who have that level of expertise in something. It's really. It was humbling. It's really interesting. It's my favorite form of engagement. I like doing things from time to time where I'm the kind of neophyte or the one who's. Who isn't the expert. Right. So there's certain areas and perspectives I had talking about narrative. I have, you know, I have read the Bible. I have taken courses. But like, you know, you put me next to you or, you know, Prager or James Orr or Os Guinness, and, you know, it's like a. It's like a third grader playing basketball with Michael Jordan. Now, that said, you know, one of the things that's amazing when talking about something is as, you know, epic and essential and enduring his Exodus is it's like every view is welcome and valued too. Right. So it's not like there was a. A bar that we were having conversations about historical references. We're finding a way in towards meaning. And I thought that everybody was very welcoming towards me. And it's. What a great way too, to engage with everybody's best part, in a way. You know, it's funny, it was. It was a different deal for me probably than anybody else who was in that seminar in that there's certain people from certain communities who I'm from who have very strong opinions about other members of the group in certain arenas, particularly when it gets into partisanship. But it's like, you know, that's also part of the problem is that we've made politics the sort of apex thing that shines the light on top of everything. And the whole point of having community and having intellectual discussions and having fellowship is that you meet people around common ground and territory. Right. Where they have grace and wisdom and generosity. And I thought that was very much on display. Yeah. But, you know, in terms of how it changed my thinking, it was pretty revolutionary for me on a bunch of fronts."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":293.51,"end":316.12,"speaker":"Jonathan Pageau","text":"Yeah. I know that one of the things that you brought up in, in the. During the seminar, but also during conversation was this vision in Exodus that they have about the relationship between the center and the margin between kind of identity and the fringe. So maybe you can tell us a little bit about what, let's say how that, how that surprised you or how that affected your thinking in terms of what's in the Bible."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":317.32,"end":497.36,"speaker":"Greg Hurwitz","text":"Well, there's a line in it I Forget where we were talking about the fringe. And one of the things is, is I like the fringe being the fringe. You know, and we were saying. I was saying, you know, we were talking about this with like, gender and presentation and artists. And I think there's one point where I said, look, having one, Prince, the artist, the artist formerly known as Prince, is amazing. If you walk in and there's 50, you kind of don't know what to do with yourself, you know, so it's sort of this interesting notion that in a lot of ways I think maybe, maybe certain secular thinkers have this notion that when people talk about the center of the center holding, it's to the exclusion of the fringe. And I think that in part, that actually can be a relationship if the fringe and the center are arranged properly, that nourishes and protects and holds the fringe in its meaningful place. Right. Whatever the fringe is. I'm not labeling that specifically, but, you know, my understanding, like from where I come from, my personal beliefs, the fact that I'm a writer, based on my, you know, what are the things? Big five personality traits, right? I'm super high in openness. Like, I have. I have traits that map onto a more liberal worldview. You and I have talked about at length the necessity for both liberal and conservative thinking to navigate complex change. Right? The liberals are the brakes, and the liberals are the gas, and the conservatives are the brakes. And if you stop on the brakes, you don't go anywhere. And if you step on the gas, you go off a cliff or run into a wall. And so the negotiation between those sides is essential. But, you know, I had this sort of reawakening that I really like the fringe being the fringe when I'm visiting it on the fringe to have a more open, liberal, artistic community or sub community. Right? And even I grew up south, you know, in the San Francisco Bay area. A lot of the politics in that region are going to be more liberal. Some of them now tend left in a way that I'm not a particular fan of. I'm much more of a liberal than I am a lefty. I mean, I'm not a lefty at all. But also this awareness that, like, that's a beautiful thing about San Francisco, but it should be San Francisco. It shouldn't also be Iowa and the whole Midwest and the South. And Oz said something when we talked a little bit about Miriam. I think we might have discussed this previously. But, you know, two things that really struck me was, you know, Miriam coming in and having her sort of excessively pure remark when Moses wanted to have Ethiopian wife. And then, you know, the joke of God coming down and turning her like, you know, a leprosy snow white. And she had to be excluded from the camp before allowed back in. You know, the warnings against excessive purity, which makes the center unwelcoming. Right. And ossified. And so it was very interesting for me how that was like built in with a ton of care and consideration. You know, likewise the fact that, you know Caleb and it's Jacob. Yeah, we're the only ones center the."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":497.36,"end":502.2,"speaker":"Jonathan Pageau","text":"Promised land and Caleb are the Joshua. I mean, the only one promised land."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":502.52,"end":763.07,"speaker":"Greg Hurwitz","text":"And that Caleb was from the mixed multitude. Right. He was not necessarily like, you know, that, that, that these different, different people, outsiders were welcomed in and integrated in certain ways, but there's also certain rules and structures that have to be in place in order to accommodate that. So for me, it was very eye opening to see the sort of care and thought morally and strategically and spiritually and psychologically and lovingly about how these different parts play. And you told a story which I don't want to share. It was a personal story about in the church and how you've managed to have certain members who felt more fringe, almost literally in terms of where they positioned in the church and how the church welcomed them. So that part was key. And the other thing for me, Os Guinness had a remark to me at one point and it was this funny moment. Sometimes you have a remark where you feel like you cross a threshold into a different understanding. And it's something that's really obvious. But one of the things he was talking about when we talked about globalism, I come from a perspective, a more liberal perspective of globalism's great. We have better trade, we have cheaper goods, we've lifted half the world out of poverty. There's all this positivity. And Oz, just in a private conversation with me, just had this little reframing to be like. But imagine a global morality that goes with it where everybody at some higher level determines what's better, down to the locality of every different choice. And what a horrifying vision that is. That's like a. A vision of such an authoritarian. The amount of force and bureaucratic might and authoritarian might to lock that into place, like in a China, let's say. And in combination with the conversation we had about Exodus, about the distribution of power across and vertically, it just really struck me. And then I started to think about everything in that regard to. It kind of cracked open for me an understanding of some of the criticisms of, you know, carbon edicts handed down from Brussels that need to pertain to Canadian farmers, right, or notions of trans rights that get farmed out through social media so that a, you know, a community with no elective body and no spokespeople all of a sudden are going to have a mob mentality or online mob made up of people that nobody even knows who they are. Half of them could be foreign players, right? From a St. Petersburg troll farm screaming about how values have to be affected in every sort of community all at once. And then also just about the efficiency of moving resources up and down. And the more that they're moved up at a higher level, there's more sort of codified corruption and rot in the system, which I'd understood already a good amount. But just thinking more and more about the necessity for, for local kind of governance and value setting once a baseline has been established. Here's baseline. American values right around dignity and freedom, but to allow variance within the sub communities because there's no other way to do it. And for a long time I've been thinking about, you know, America right now is in a standoff and what is not going to happen is that one side prevails and dominates and rules over the other side. That's not going to be an outcome. That is a world anyone wants to live in. There's got to be some sort of partnership and there has to be a return to value sets and relationships that are differentiated at a local level. So I've been thinking really differently since those conversations and then also starting to understand much more. You know, Dennis talked about, you know, one of the beautiful things in Exodus is it's the law, but it's wrapped in the sacred, right? And if you don't have the wrapping of law in something transcendent, right. Then it will become overgrown and cancerous and turn into HR departments or endless countless regulations. Right. Or like, you know, endless school administrator bureaucratic states within educational environments where they start to eat the primary point of education."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":763.88,"end":764.2,"speaker":"Laura Diaz","text":"Yeah."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":764.6,"end":781.96,"speaker":"Greg Hurwitz","text":"So I've been chewing on a lot of this and it's been altering a lot my thinking about how to balance and integrate the best of what liberalism needs to offer, which is sort of watering and nourishing the culture with new ideas and people so it doesn't stagnate and the essential nature of how you hold center. Yeah."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":782.04,"end":846.06,"speaker":"Laura Diaz","text":"Tucson. The weight is over. Medi weight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. And hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project. Ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication but with a customized plan, one weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweightloss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com pack up though, because Chevy."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":846.06,"end":873.05,"speaker":"Greg Hurwitz","text":"SUVs have the capability to take you to some incredible places. Like an adventure in the middle of in the Equinox Active, an SUV that will help you get away with confidence. Or head off for a night in the in Chevy Traverse with all the tech you need to stay connected. While the undeniable value of Chevy Trax will keep you moving from here to over here to way over here. Get to all the places you want to be with Chevy SUVs. See Watson or O'Reilly Chevrolet."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":873.77,"end":981.03,"speaker":"Jonathan Pageau","text":"No, I think that's great. And I think that also in some ways I think was the most, most striking thing for me during the Exodus seminar that that was able to come out that that structure like that kind of subsidiary structure where you know, even the 12 tribes exist independently. Right. They all have their own identity but they nonetheless, you know, all look towards the tabernacle. They all worship the same God and that and they have some aspects like Moses and Aaron and the priestly cast that act as an overarching structure. Interestingly enough, in, in Exodus, that overarching structure like the priestly cast, they don't have land. And so there's like this trade off situation where you don't want to have them have land and have power, but then also be an overarching structure on others. Like you kind of say okay, you'll have this, but you take this. There's this very beautiful way in which they're able to, to have something which, which is over all of them but then remain keeping their crunchy, you know, their crunchy characteristics, you know. And that, that is. That's been even with arc, like people were talking about arc. And you're going to be there as well in arc. That's one of the things that we're trying to help people see is this need to. To understand identity that way. Right. Identity as layers of participation and not just the state and the individual, the way that we kind of tend to look at it in the modern world. And I think your image of America, in some ways that is the best vision of what America could be, which is a kind of decentralized cultures that. That coexist, that recognize each other's value and that understand that also that they don't necessarily agree with each other in all the way, in all their alignment, but have enough in common so that they can exist together."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":981.83,"end":989.62,"speaker":"Greg Hurwitz","text":"And nor should they. And nor is that the goal. The goal is not that we all agree. That is not an American goal. And that's not what's best for America."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":989.94,"end":1072,"speaker":"Jonathan Pageau","text":"Yeah. Yeah. And so yeah, I really, that was really for me one of the biggest, the biggest takeaways from Exodus 2 is, is that that vision came out so clearly. And even rereading the text, you know, sometimes, you know, I'd read it, I reread it occasionally. But rereading it for that seminar and then in the discussion, I was like, wow, there's more about this than I, than I even thought. Like there's just more of this. This. There's even this idea in some ways that gets taken up and in some ways that gets taken back up in Jesus in the New Testament, which is that it says if all the laws have to be contained in their allegiance to God and Jesus says, right, love your God and love your neighbor. It's like that's what the law is for. If you don't have that, then the. All these regulations and laws, you could keep making them more and more explicit. And that's what happens, right. If we lose trust within each other, then we. The more as the more society lose normal trust between people, the longer our contracts become right. And the more like subheadings and like this and that. Because yes, to account for every single possible behavior. Whereas before, let's say or. Or in a family or in a. In a relationship of trust, like the handshake, it's like that's what it's based in. Like there's an implicit laws are there but we don't have to spell them out because we know that we act in trust and in love towards each other."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":1072.48,"end":1377.7,"speaker":"Greg Hurwitz","text":"One of the things I. That's, that's. Yes, that's beautifully stated. You know, one of the things I was thinking a lot about for me, having come up, you know, in a secular world. But that said, my parents sent me to Jesuit high school. You know, I had very great relationships with Jesuit priests in high school. We start, we read. This is the first time I read the Old Testament. I was in bar mitzvah or bat mitzvah. Nor were my parents, nor were my grandparents. I mean, so I'm from a long line of sort of more secular Jews. But really, you know, a lot of my, the embrace and attention that's been paid on the Old Testament of my identity has been from non Jews. It was Jesuits the first year we read the Old Testament. You know, I have a lot of friends who were, you know, longtime friends who are Christian who are very interested in that. You know, this Exodus seminar I was invited in. I mean, I knew you, Jordan and Blackwell were my three people. I knew I wasn't invited in by, you know, Prager and Shapiro. So it's this really funny thing that a lot of the sourcing of my identity or connecting with that all the way back to high school was from Christians, you know. So that's, it's also is an interesting point. But one of the things I was thinking about a little bit since then is as we're discussing all these primary values is that for me growing up, I had this amazing. Ben made it. Ben made a comment that kind of blew my mind. He had two comments that were. That kind of blew my mind. But one of them was he said something in the sort of critical, fast talking Ben, you know, machine gun fire voice. But he said, look, a lot of these institutions are going on the fume are on the. Are on the fumes of the value sets and structures that they had in place from, let's just say some religious foundation. I forget what his exact phrasing was, but I was thinking about that. I was thinking about when I went through. And I had the benefit of going through some really fine schools like this Jesuit high school colleges where the structures were very, very intact. It didn't feel there was ideology creeping in at the edges, but it was not predominant. But a lot of what I felt was holy was were the poets right? Were simply. It was Beethoven, it was Mozart, it was Shakespeare, it was, you know, Plato. For me, it was a lot of the, like the, the, the poets, you know, Byron, Keats and Shelley. And so I was constantly reading and engaging with this stuff that felt like it was sacred. And in a way, as I was reflecting on our conversation, one of the things that. That of course, it's. It's. It's spectacularly obvious to you, but less so for me, is that when you're having a discussion that's specifically about the Bible and what we're talking about is the thing itself. You're talking about, here are the seven virtues, right? Here's the seven deadly sins. And it's not proxy by a poem or by something else or by a play or for me, reading Shakespeare. For me, hearing Schumann, right, Or hearing Beethoven's ninth. And there's something that's very interesting in the space between it, because I think in a lot of my upbringing, I would see that sort of the sacred light shone through, let's say, the genius of creation. Or a brilliant thinker, right. Even if it's a scientific thinker. You know, my proclivity was more towards the arts and towards opera. But, you know, pick your genius, pick your physicist. You know, Ramanujan, like, where you see people are connected with an order that is greater than them. But it's interesting because in a way, even if you're offset just that much of admiring the people in the works that are a reflection of the primary values, there is a tendency to move towards, well, do we value hard work? Do we value brilliance? Do we value the beauty primarily, rather than always knowing that there's the foundational core value of, you know, like, what does true humility really mean? It's not like feigned humility. And so I started to read C.S. lewis more C.S. lewis. And what's so interesting is he has a remark in Shoot, I forget where. I think it's in screwtape letters where he says that the sort of aim of true humility is not claiming you don't have the skills that you want or like fishing for compliments. But if you're an architect and you build the most beautiful structure in the world and you glory in that structure, but you're just as happy in it existing if you creating it as if somebody else created it and it just existed, it's like, it's such an interesting way of looking at it. As opposed to me, I was coming up with sort of like the cult of Frank Lloyd Wright. I mean, he was so bombastic and brilliant. And my favorite stories with him are like, you know, when if somebody had one of his houses and they put up a fence, he'd get mad years later and just Send a bulldozer to knock off the fence, because he's still considered his house. So he's in court all the time. And one time he was, you know, they asked him, he was on the stand, and they said, are you the greatest architect who ever lived? And he said, yes, I am. And he was walking out. It was like a courthouse scrum. And I think his second wife was next to him. She said, frank, dear, did you really have to say that? He said, I did, dear. I was under oath."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":1379.38,"end":1380.34,"speaker":"Jonathan Pageau","text":"That's hilarious."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":1381.3,"end":1610.18,"speaker":"Greg Hurwitz","text":"So it's like. But the studying of this is, for me, of architecture. I thought of it more through the brilliance of what he accomplished and the dance between space and psychology and having that. It's such a simple notion with C.S. lewis of, you know, enjoy and embrace your uniqueness and whatever gifts you're blessed with. Right? Don't eschew them with false shows of humility. But the humility is your appreciation that it can even exist and that you're there to observe it. And so that. That staking of primary values. I've been trying to think about that comment that Ben made about how some of these secular societies are on the fumes. So you get past, let's say, my dad's generation, and he didn't fight in World War II, right? They're a generation past a shared, nationally shared crisis where everybody suffered and learned equally. That hasn't happened in America since World War II. So you have one generation. I'm in the next generation. But by the time it comes to our kids, it's almost like that gap between the core values and the geniuses and implementers and innovators. It sort of widens in your understanding of how to bring them together without a foundational education, let's say, whatever that means, whether that's formal or not, that brings together intellectual venture and artistic venture with a spiritual foundation, right? That's, you know, Greek, Latin, the biblical text, you know, different holy and sacred texts, and then also what these fields of endeavor are, and then the integration of the two and how they're foundationally tied to the real world. And that's another essential thing, as opposed to just sort of floating unattached up here to be like, oh, well, I've published 18 different scholarly articles on, you know, you know, the Jungian shadow and Shakespearean tragedy. And it's not fully connected and integrated all the way. And the process of education is trying to get all of those pieces together. And if you have them, I think you build, obviously stronger relationships, stronger sub communities, and you have yourself organized with the communities across time with different codes and values and communities up and down Mount Sinai. And I love that Exodus is so unabashed. The Jews are always so unabashed. And also showing the reality of Moses is like, I'm going to be right back. I'm just going to go talk to God, like Aaron, just don't do anything dumb, okay? I'll be back in like, just give me like a day and I'll come back. And it'd be really good if there wasn't like a golden calf and a bunch of orgies. So just, you know, hold the tent. So it's very open eyed about the fact that there's all sorts of problems. But if that's the structure that you're constantly and imperfectly navigating up and down, you can imperfectly and humanly move forward in a structure that works, that is, that's reconstituting itself from tyranny and that little loop of fleeing tyranny into the disintegrated unknown of the desert and then reorienting in a way that's embodied and solid to move forward towards the promised land that we won't reach in our own time or way. It's this mini cycle, right? It's everything with psychology. I'm going to give up the tyranny of my victimhood about something. I'm giving up the tyranny of thinking that I have to rely on alcohol. I'm going to give up the tyranny of an abuse story that is keeping me in a way where I'm powerless. And anytime you give up tyranny, obvious or not obvious, you know, what comes isn't joy in the liberation, but the dizzying terror of freedom of like now it's me, it's. It's me and God, I hope in a new understanding. And who, where are my people? How do I do this?"}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":1610.18,"end":1610.66,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":1610.74,"end":1625.2,"speaker":"Greg Hurwitz","text":"And so that that loop is like, it's, it's fractal. Like everything we talk about, you be a choice you make. It can be an emotional state, it can be the orientation of your whole life. But the need to build these things solidly, that all the pieces hold together is pretty staggering."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":1625.68,"end":1704.33,"speaker":"Jonathan Pageau","text":"And so what? So though this is in some ways one of the things that also in the Exodus seminar that came out for me, I was surprised it came out so strong, but to me was important because it's something that I been trying to help people understand. It's, is that in Exodus there's a sense in which the centers worship, like, and that, that it's hard for secular people. And so that's why I'm asking. It's hard for secular people because it's like, oh, man, that's a tough one, right? That's a, that's a tough level. But it seems like in Exodus you can understand it. It's that you have to keep your most precious and highest attention to the highest thing. And it's like if you, if you, so if you give your praise and attention because you're going to do it anyways, right? You're going to worship all kinds of things. You're gonna, you're gonna celebrate all kinds of things. But if you celebrate the highest and it's not just like a mental exercise, at least in Exodus, it's like you have to do it. You have to get together. You know, there's things you do, you, you kill animals. We don't do that anymore. But like, you sacrifice things, you sing songs, you do all this stuff. And so, and so I'm wondering how that. If that has messed with you or how would you, how do you see that for, for yourself? Like that, that, that part of the Exodus kind of came out. Like, you have to, you have to, in some ways you have to pray, you have to worship, you have to, you have to give up praise to the highest."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":1705.93,"end":2028.05,"speaker":"Greg Hurwitz","text":"It's, it's, it's been, it's been quite intense, man. I mean, I have my own rituals that like, you know, Jordan and you and anyone could rightly make fun of me, you know, for being a fruity Californian, you know, it's like, you know, so it's like I do, I do this meditative yoga at 115 degrees often, right? And one of the things I learned when I go there, that's one of the ways that I'm the most, I feel the most connected. I try and do it every night when I'm in town. I do it sometimes during the day, but it's a, it's, you know, one of the things that I've discovered, and we talked about this a little bit, is that some of the poses that you have, right, A lot of them are like heart opening, but they're positions that are not dissimilar from prayer positions that you're taking. And I've thought a lot about how the physiology within our body, you know, if you stand in the rocky pose, your self esteem actually rises, right? Like, there's different poses we have. I mean, that's Jordan's, you know, infamous essay on the infamous and famous essay on the lobster. Right About. But it's so interesting for me, moving through this, which is, you know, a different ancient tradition. But a lot of the postures are like, you know, prostrating yourself for prayer, like that's what they look like. And you hold it in heat, right? For. In 115 degrees, sometimes for five minutes. And you're. And the necessity of ritual has always been essential to me. Right. I don't just write when I feel like writing. I don't just sort of exercise when I feel like it or, you know, I've had a lot of different skills or disciplines that have required ritualizing them. Right. What you have to do with writing, what you have to do with carving is just decide that it's sacrosanct, right? Because if you don't place it above everything else, everything's more important than that acutely. Right. You know, you could go to a movie. You can pick up your dry cleaning. You could do whatever. We have to make these choices around ritual and what we elevate. But one of the things I started to notice is that's a space that I did a lot of really deep meditation and reflection around stuff. And if I don't. If I fall out of that for two, three days, all of a sudden, other parts of my life start to get disorganized. And so after Exodus, I've started to view that time in a very different light and started to view and start my mornings, even in different ways. And then, as I've done that, there's been more rituals. I don't say demands, but understanding of different ways to have threshold moments of reorienting myself that feel different from just like a cog. B. Right Way of resetting. Like, take five breaths and then go into whatever. It's not about just the psychology and the nervous system. It's really about taking time to try and reintegrate and orient to the highest version of something and to ask for that. It's very interesting in Orphan X, when he answers the phone. He answers the phone the same way every time he says, do you need my help? And I never thought about that. Right. He's an assassin who helps people who are in desperate need. But of course, that's the first question. Because if somebody doesn't ask for help, they're not in a position that you can help them. Right. I never thought of it that way, but in a way, that reflection towards the higher good is also an expression of humility that you're open to what will Come like you're leaving space for other solutions and answers, which means I don't have them. I don't have them to go out into the roar of a new day, to control and shape the day. Another thing CS Lewis talks about is, he says the greatest trick that the enemy or that they can foist on other people. Sorry. To protect them from the enemy. And screwtape letters. Of course, the enemy's God, right? And the father is Satan. But he says, is the belief that their time is their own. If you can convince a man that his time is his own, everything's an imposition. Everything's cause for aggravation, right? Anything that comes off their schedule, any aggravation, anything. Like, if you can convince him of that, like your gold, that's a key thing. And so there's so many reflections like that. And for me, a lot of what was. Been really meaningful in CS Lewis is, you know, clearly he's a spirit. He's intellectual, spiritual genius. Right? It's. But the acuteness of psychology is so amazing to me. And so I think a lot of the way that I came to into understandings of sort of archetypes and spirituality and the way that actually they move in the world in concrete ways and move the world and move you, for me, was through Young, right? Which. Which makes sense. It's coming from my background, right. So I studied Young a great deal, right. And did a lot of work on Jung. And you get to the bottom and you start to realize, oh, this. There's this amazing overlap, like with my friends who are born again Christian, where all of a sudden it's like, oh, if I convert some of these phrases and engage with this in this way, I understand people who are speaking Jesus. Right? Because it's a way in to start to understand and go, oh, when you say, you know, it's, you know, leave room for God, that's like Jungian synchronicity, right? There's all these terms that are just different slices and ways into it or into reaching a deeper reservoir of understanding."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":2028.29,"end":2092.34,"speaker":"Laura Diaz","text":"Tucson, the wait is over. Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iHeartRadio. And you can trust me, this isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication, but with a customized plan with weekly check ins and a licensed physician guiding me every step of the way. And the cost the same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better, and lose weight the right way, mediweightloss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com pack up though, because Chevy."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":2092.34,"end":2134.52,"speaker":"Greg Hurwitz","text":"SUVs have the capability to take you to some incredible places. Like an adventure in the middle of in the Equinox, Active, an SUV that will help you get away with confidence. Or head off for a night in the in Chevy Traverse with all the tech you need to stay connected. While the undeniable value of Chevy Trax will keep you moving from here to over here to way over here. Get to all the places you want to be with Chevy SUVs, see Watson or O'Reilly Chevrolet. And so CS Lewis, like, the acuteness of insight. He's so perspicacious about, like, how our mind, how our minds work. And the connection of those to a spiritual frame for me was. Was pretty spectacular. Yeah."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":2134.52,"end":2136.16,"speaker":"Jonathan Pageau","text":"And it's like, look, Divorce, right?"}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":2136.16,"end":2138.12,"speaker":"Greg Hurwitz","text":"You. I read the Great Divorce and that."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":2138.12,"end":2154.68,"speaker":"Jonathan Pageau","text":"Was curious what you thought about the Great Divorce because that's one of my favorite CS Lewis books. I think it's one of the best representation of heaven and hell, like the. The idea of heaven and hell that. That has ever been put together. So I don't know what you thought about that."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":2154.92,"end":2162.2,"speaker":"Greg Hurwitz","text":"Oh, and how like all the ways he just lays bare that we get in the way of our own, of the gifts being offered."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":2163.32,"end":2164.04,"speaker":"Jonathan Pageau","text":"Yeah, exactly."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":2164.04,"end":2176.13,"speaker":"Greg Hurwitz","text":"Every which way. It's like here's. Here's every way that you could show up and be offered everything you want and deny it due to your own, you know, blindness or your. Your lack of cultivated humility."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":2176.45,"end":2176.81,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":2176.81,"end":2241.3,"speaker":"Greg Hurwitz","text":"Yeah. It was amazing. Right. And so you always think about that woman who'd rather have her boy in hell with her so she could continue to provide endless care and empathy and. Right. Like devouring mother witch and Hansel and Gretel ness. Right. She'd rather have that child devoured and taken down than to open and release. You know, there's different value sets. Old Testament, New Testament. In a lot of ways, I mean, the, the Old Testament, there's this like Talmudic reasoning. Right. And there's so much about work and discipline and law and code. And I think a lot of the virtues of the New Testament are around, like surrender. Right. Like there's. I mean, they're, they're through both of them. Of course, this is an oversimplification, you know, forgiveness, grace. There's so much. It's such a different value set. And so watching this bus ride, you know, up to heaven in person after person, I mean, the other thing that was really interesting to me is there's someone who came, who is in the great divorce, who's a, you know, great expert in religion. I forget what their role."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":2241.3,"end":2243.22,"speaker":"Jonathan Pageau","text":"Yeah, that's awesome. That's a great scene."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":2245.38,"end":2375.33,"speaker":"Greg Hurwitz","text":"Yeah. The theologian who like, couldn't join heaven or stay because, you know, he needs to be able to have arguments and differences and it has to be cerebral and he has to retain his own, like, you know, sense of intellectual curiosity and disagreement like, you know, I never would yield and how much we're lost in our prefrontal cortexes all the time. Yeah. So he's. He's amazing. I mean, it was. That's been a pretty spectacular process. And I think about that a lot in relation to people who we see, who are. And in ourselves, primarily in ourselves. First, all the ways we self handicap. Right. All the ways we create obstacles based on our own ego or vanity. Right. Or pride. And you see it reflected in those ways. But it also gives room for allowing more space and freedom for others to sort of have to flower in their own time. Right. Because you can't. I mean, that's another aspect of freedom is anything that's coerced. This is back to the discussion about the sort of global, or let's just say outsourced to the insane roar of the Internet mob mentality to dictate our moral governance, which is. It's so insane, it's almost hard to figure out that we're in America, in Canada, in these countries where free speech is foundational, that we've allowed a state of affairs that random mobs online, on social media apps can bathe for blood, and we have no idea who they are, how they're constituted, how much foreign negative influences in them, how many psychopaths, what the Constitution is. And public figures will come out, like to a town square and apologize in a way that often is disingenuous, just to be left alone, to be allowed to continue their lives without massive financial and reputational damage. We've allowed that to happen. Someone's not been convicted of a crime, someone hasn't been fired from a job, but just a random mob can constitute itself and make that demand. It's insane. Yeah. You know, and."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":2376.21,"end":2412.56,"speaker":"Jonathan Pageau","text":"Yeah, it's, it is, it is insane. And it feels like. Yeah. It reminds you of what is real like and what is not real. The online world is really in some ways, like the chattering of demons. Like, because it's a people, it's satanic. The people who. These anonymous troll type people, you know, you also know that not all of them, but a lot of people. That's not their whole personality anyways. It's almost like I'm gonna go online and I can play this like, role, you know, and then they go back and they, they like live their life almost like a little, like a little video game."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":2412.56,"end":2419.76,"speaker":"Greg Hurwitz","text":"It's a first person shooter video game. Right. I'm going online. I'm gonna own the libs. I'm going online. I'm going to dismantle MAGA people."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":2420.05,"end":2420.29,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":2420.29,"end":2481.24,"speaker":"Greg Hurwitz","text":"And that's my way. I'm virtuous, I'm playing a game and I'm. Well, I'm doing it. But it's crazy that that level of like, really, like we had a pretty good common law system. We have pretty good courts. We did. This is what we're going to decide to do that. Anyone at any time or any member of one group can make a claim of being offended by any member of another group. And if they get enough pitchforks and torches, that other group has to answer to them. Yeah, it's really crazy if you think about it. If we transport ourselves forward from the 80s and said, this is what it is now, it doesn't matter if you're a movie star, a senator, a CEO, an athlete, an iron worker, a coal miner, a musician. Anything you do at any time, a random mob can appear and just in a virtual world and make. You have to come either be in the fight of your life to stand up for your principles or like falsely apologize like you're being marched through the streets in Game of Thrones. That's wild."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":2482.36,"end":2534.64,"speaker":"Jonathan Pageau","text":"Yeah. And I mean, obviously that's in some part what's going on with Jordan right now. But I just want to come back to the CS Lewis thing just because when we saw each other last time, you reminded me of a scene in Portrait of the Artist as a Young man by James Joyce. And I'd read that into my early, early 20s. And I had forgotten about some of the parts. I reread it. And in that book, there's a description of hell which goes on for quite a long time. And it's interesting because that description of hell is this, like, really punitive thing, right? It's like horrible punitive thing that's going to last forever. And it's like, you know, imagine a bird taking a seed of. A mountain of seeds for. You know, and it's like, it's. It's like that's just one second in eternity. And, And. And what I. What I just found fascinating was because I also reread the Great Divorce. I knew you had read it, you had read it."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":2534.64,"end":2535.24,"speaker":"Greg Hurwitz","text":"So I'm like, I'll re."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":2535.24,"end":2607.62,"speaker":"Jonathan Pageau","text":"I read that a few times in my life, and I thought just how powerful the difference is between the visions. On the one hand, Joyce, you know, and you can understand why in some ways it led him away from the church if he really experienced something like that, where it's just this. This. This arbitrary, almost, you know, horrible imposition of. Of a standard that you can't follow until you end up in this. This tortured forever. Whereas CS Lewis has this amazing capacity to show how the suffering of hell, like the suffering of hell is out of your own desire, that it actually is born out of something you want for yourself ultimately, without maybe admitting it to yourself, but that you. You want that. That image that he has of hell of people who have everything they want. So because they have everything they want, they. They. They get annoyed at everybody's little differences. So they said they keep moving away from the neighborhood and building houses further and further away from each other. And so all of a sudden they're, like, alone in these giant mansions, but they're so. They're like a million miles from each other and they can't even fathom to be with another person. I'm like, wow, that's a powerful image of. Of suffering that born out of our own desires."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":2608.1,"end":2678.7,"speaker":"Greg Hurwitz","text":"It's amazing. It's also, and I say this with great love for Catholics and the Jesuits who partially raised me. I mean, in some ways, it's like a Catholic Christian division there, in some ways. And Joyce has, like, the most hellfire and brimstone of anything, so that I think it's the third chapter, a portrait of the artist is just. It's worth just going into, because it's so kind of gloriously hideous. So first he goes through every single one of our senses and talks about how awful it is in hell. Like, your ears hear the screams and your skin is on fire. So as they're teaching him, you know, when he's young, in his. His Catholic school or he's in. In church, you're taught all of the ways that your senses are in a state of unbelievable inquisitional horror, right? And pain and excruciating. But then he says, like you said, imagine there's a mountain that's a million miles high and a million miles wide, and every million years, a bird flies and picks up one grain of sand and flies a million miles and drops it somewhere else. When those mountains have risen and fallen a million times, that's not even an instant in hell."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":2678.7,"end":2679.42,"speaker":"Jonathan Pageau","text":"Yeah, I know."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":2681.18,"end":2775.12,"speaker":"Greg Hurwitz","text":"And so you can see why one of the things Joyce said was to be an artist, he had to be free from family, country, and religion. Those were the three nets that were thrown to constrain an artist, right? And he had to be free of them to be his own sort of brilliant, embodied, creative self. And C.S. lewis, it's so much kinder. I mean, it's. You know, hell is locked from the inside, and you have the key, and it's just right there. And the. The notion of God is. Is. It's so much more patient and graceful. It's sort of like, hey, we're here. You can take the bus back next year if you want. It's all right here. But, you know, if you want to still maintain your own theological distinctions, and that's important to you, okay, you can go back to your house that's in this gray town that's 1,000 miles from the nearest home, where you're separated from an overarching narrative and from each other, which, by the way, I think is where AI is heading. We've talked about this, right? Like, oh, I can get my own. I can push a button and design my own book. Like, I want a Faulkner book that's dialed to my IQ that's 107 with vocab words that's half the length. Using inside jokes from my social media. Boom. I have what I want. It's like pornography, right, boys? I have everything that I want. What. What are all my tastes and preferences? And all of a sudden, you're just floating away in your own little bubble of a world, you know, like, you know, when they die from the feast with the meat of the last, like, gorging still stuck in their teeth with the."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":2775.52,"end":2778.6,"speaker":"Jonathan Pageau","text":"The. Yeah, the flesh meat of the. Yeah, that's right."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":2778.6,"end":2796.8,"speaker":"Greg Hurwitz","text":"That way I have everything I want. And it's like, online, I can do that. I can cultivate my own world. I can move people, I can unfriend people I don't like. I can put filters on everything. It's like, wow. So what you're doing is, is you're removed from an overarching story and from everybody else in reality. Like, why does that sound familiar?"}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":2796.96,"end":2797.4,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":2797.4,"end":3033.25,"speaker":"Greg Hurwitz","text":"And so this. But. But the depiction of the great divorce is amazing, you know, so one of the other things I've been thinking about a lot since Exodus is this notion, like one of the biggest. The biggest fury in a lot of ways that I see of our stalemate in politics. There's two things I want to talk to you about. The biggest one I see is hypocrisy, right? So, you know, and it's. It's abundant on both sides. We don't even get into specific examples because, like, then the comments just blow up and there's a thousand things. But people are outraged with the hypocrisy of why is this prosecuted this way and not this way? Why are you saying it's state rights, but it's not state rights here and the church. You know, one of the things that's the most typical thing to be said in a. In a secular world, these words are so useless. But, you know, we're using these as imperfect proxies for what we're talking about is the hypocrisy of the church, is the hypocrisy of church leaders. Right? There's ways that, like, shockingly, the churches haven't, you know, as all the institutions have allowed in corruption and capture. Right. Academia and the media and Hollywood. Some of that's also true in, in, in church, in religious institutions also, that. That has been allowed. But it's this very interesting thing where there's this notion of, like, well, you say you're a Christian, but you had an affair, or you say you're a Christian but you stole money, or you say you're a Christian but you didn't show grace and humility of Christ, you know, or whatever. And it's so interesting to me to be like, you know, having lifelong close friends. I mean, it's such an. It's such an amusing and callow disregard of it. It's like, okay, because I say that I'm orienting myself towards a certain belief structure. I'm supposed to exemplify the highest exemplar of that in the history of the world all the time, where I'm a hypocrite. It's like, that's the way that I'm Aiming as an individual, if you're a Christian, it's like, of course you're going to. People in that community are going to gamble and have affairs and do all this stuff. That's like saying, oh, you secularist, you have all these laws, but people are still committing murder and people are still stealing things. Like, what hypocrites you are to think that you have a legal system you want to pay attention to when people don't abide it. And so this is the sort of plank in the eye approach of like, we're so scrambling between these worlds of the religious, spiritual, symbolic and the secular, you know, aridly intellectual to cast these aspersions on the other side. But. But, you know, the one thing I think that I will say is a base setting that I have found increasingly useful since my. I had some pretty deep forays into the political space in hopes of doing some good and moving parties towards moderation and discussion and negotiation. Like, I think in a lot of ways, like, I hope to be a sort of bridge builder because as a novelist, the primary thing that I like to do is to really embody other people and perspectives. But, you know, that sort of anger at the lack of embodied perfection. One of the things that I find really wonderful in my friends and community who are more spiritual, religious, or have a belief structure as part of that structure is we're all flawed. We're all flawed. We all have a long way to go, right? And without that recognition, there's not a lot to go. You know, if you have a view where you're like, look, I figured it out. Here's my politics, you know, from either side, here's my politics, here's my structure, here's my community, here's my values, here's all the ways that I fulfill those. I have codes in my life and I fulfill them perfectly. It's like, oh, I don't know how to talk to you. Like, if you really think that, like, you're just not looking, you're just not pulling the curtain back on your mind."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":3033.49,"end":3034.05,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":3034.05,"end":3037.09,"speaker":"Greg Hurwitz","text":"There's so many ways to do everything better all the time."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":3037.33,"end":3138.96,"speaker":"Jonathan Pageau","text":"And in some ways it has to do with this question of idolatry. That's interesting to think about that way. Because what the surprise that we find is that, you know, if we remove the absolute transcendence, like, if we just, like, we don't need this, we just have the state, we just have the. We just have the, the. The social sphere, then what will happen is exactly what you said, which is that we'll treat, will do it unconsciously. We'll treat others as if they should be God. And therefore, as soon as we find one little fault in someone, then we will want to tear them down and destroy them. If you look at the way that the medievals, for example, saw so like history, there was a tradition that's called the nine worthies. And the nine worthies were nine social leaders, three Jews, three Christians, and then it was three Jews, three old school Hellenistic Romans and then three Christians. And the way they would do it is they would say, like Julius Caesar, right? They say Julius Caesar was a great man. Here's the reasons why we admire him and hear all the horrible things that he did. And they would say Alexander, Alexander was what was great. Here is how Alexander was great and the great things he did. And here are his sins, here are the things that he lacked. And there was a sense in which they knew. They, of course these people had faults, right? Of course they had. Just like Moses in this, in the, in the scripture hits the rock and Aaron builds the golden calf and you know, King David has an affair. And like we know that humans are, are weak. And so there's a sense in which we can still say David was a great king and know that he did these horrible things."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":3138.96,"end":3380.58,"speaker":"Greg Hurwitz","text":"Yeah. So in a way it calls to mind two things. I mean, one of them is the Vatican has the devil's advocate as a formal position, right. Christopher Hitchens, who I miss more than maybe anybody, just to know what he would say in this moment. He was so singular, right. I mean, I would love to hear what Christopher Hitchens would say about everything. But he tells this story that he was a big critic of Mother Teresa in a bunch of ways. And he describes the interview. So they got him on like news, I forget what MSNBC or FOX or something as her caskets being born lovingly through like the slums of Calcutta. And he said, here he is with an ill advised goatee, like saying why she was not worthy. But the Vatican actually contacted him to be the devil's advocate to make the case against her. Yeah, there's a formal position to do that. But so we take what you're saying right now about this, about that we find one little flaw and then we, we move into a world where literally we have given up by ourselves. All of our, not all of, many of us have intensely given up a ton of our freedom and a ton of our privacy. And so I had a friend yesterday was talking about a lawsuit and they contacted somebody and they're going to subpoena the tax. And my friend was like, how can they subpoena the tax? And it's like, do you ever read the 60 page things that are the contract agreements, let alone parse it through a team of lawyers? You don't own that. We don't own anything. We've taken this and gone. Let me give everything away. And by the way, also, I'm going to go on social media and post things and make jokes and come from one small culture community and make a joke in another. That's happened. You know, one of our dear friends has been cut out of that a number of times, colliding with my various timelines. And basically what we're discovering is, is that nobody, nobody on the planet is perfect. And so if you want to put a target on Tim Scott or Nikki Haley or Nancy Pelosi or Ozzy Osbourne or, you know, Oliver Anthony, who's the guy who just sung that anthem, or you or me, it's there. You can interpret anybody through a frame and find something that's offensive online. Probably because it's impossible with the, it's impossible to maintain the image like FDR when he was president, you know, suffering from. He had polio as a kid and was in a wheelchair and no one ever knew. The press like very respectfully never shot him in his wheelchair. They'd shoot him behind the desk, they'd shoot him standing. We don't have any of that anymore. So it's like you think you're going to pry into any human. And so this game, we're like hyenas, right? Like something gets turned up, somebody reaches a certain level of ascendancy in the culture. J.K. rowling where do we find something, anything, even if it makes no sense and ripper to shreds. Yeah, it's, it's just, it's just horrible. And you know, in a way, I think part of the solution is a recognition instead of an apology when being caught out to go this is, this is where I am, this is who I am. I'm not going to purport to be perfect under every which way. It's not having a react but we've turned people who want to engage on a more on a wider stage like the amount of hatred even you and I, which is a much lesser level than if we talk about Jordan or if we talk about other people in our orbit on both sides of the fence. Dean Phillips is a close friend of mine who's a congressman who just made some statements that we might Want some more diversity in the presidential race besides Biden? You know, when people are at a high level, the amount of just like vitriol that's directed at them is incredible. Right. And then people get bellicose and reaction. It's this horrible blood sport that we've kind of allowed and entertained."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":3382.34,"end":3442.51,"speaker":"Jonathan Pageau","text":"Yeah. And it's weird. People forget like I. And you see it even from the Christian perspective, it's like forget the words of Christ, you know, that to say judge not lest you be judged. And it's not. And, and I really do believe though that that that statement doesn't mean that you should never judge anything anybody does, but it's rather to always keep that eye inside first. Like always make sure that, that you are aware that you're a hypocrite, that you have fault, that you know, and, and keep that as the, as a, as a bear something that balances out how you pour out your criticism towards the outside world. Because like you said, one of the problems with criticizing the outside world constantly is that it makes us feel virtuous. And it's almost like it can be a little addiction. Right. It's like it. Because it gives you a little kick of a virtue to dispute out everything that's wrong about everybody and everything all the time. And ultimately our eye should be on ourselves first. That's for sure."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":3443.31,"end":3468.38,"speaker":"Greg Hurwitz","text":"That's right. That's right. And that, that discussion I was talking about with Oz of kind of like lifting and lowering my gaze simultaneously right away from sort of a globalist or a farmed out, a centralized morality was the part where I was like, oh, right, I see this differently in a certain way. But it's also, you know, careful what we ask of people."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":3468.7,"end":3530.86,"speaker":"Laura Diaz","text":"Tucson the weight is over. Medi Weight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me, this isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At Medi Weight Loss, I got the same medication, but with a couple customized plan, weekly check ins and a licensed physician guiding me every step of the way. And the cost the same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com you know, you want someone."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":3530.86,"end":3564.37,"speaker":"Greg Hurwitz","text":"Who'S a genius, a big out of the box thinker who like moves fast and has thoughts and shatters things and moves the world forward lurchingly like a Galileo. Or, you know, the accidents and mishaps that lead to solutions like how penicillin was discovered. You know, Picasso, Beethoven, Mozart, you know, Byron, Keats, Shelley. Like these people who were just touched with fire were brilliant to start to judge and constrict all the sides of it. It's like, no, we just want all the genius, we just want all the brilliance."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":3564.53,"end":3566.13,"speaker":"Jonathan Pageau","text":"We don't want the messiness of it."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":3566.77,"end":3686.51,"speaker":"Greg Hurwitz","text":"We don't want the messiness of it and we don't want, we want to make sure that everything's aligned and articulated perfectly. And so I thought about this a lot since our conversation that we had with Jordan, for instance. You know, one of the things that really struck me and you and I laughed about this afterwards was, you know, we're there, we were sort of discussing with Jordan how to tamp down some of the stuff on Twitter, which I still think he should do in a way. But he's also, you know, it's, look, he's figuring that out and he's figuring out a lot of things. But, you know, part of what we were talking about was like, look like have a more tempered or wider view. One of the things that really struck me was and Jordan's talked to me about saying, look, when you get up for a fight with half the world, like, you get up ahead of steam, you know, if you know, you're going to speak some truth, that people are going to crash in. And when you get up ahead of steam, you, there's slop, there's mess, there's force. And one of the things I thought that was so funny is we got to the end of that interview and I thought I'd comported myself pretty well and went back and watched it and I was like, I was way too, like coming in hot on stuff and I needed an edit, like literally to take down some of the ways that I was, you know, like Jordan would see to point and I'd like to hit him again with it like in some ways I was like, wait, I need, I need some grace shown to me for how I'm, you know, coming into a conversation about having more of a steady, even cadence and discussing issues as I'm giving that advice. Right. To somebody else for doing it. And it was kind of. It was a great thing to go through because, you know, that was a stressful set of circumstances for me just coming in to do that. Not bad stressful, you know, but challenging. Challenging is a better word. Like there's a lot of people who could be upset with me from basically every angle within. Yeah. And so to notice and see. Yeah, well, when that happens, people feel that way all the time sometimes. Right."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":3687.15,"end":3699.87,"speaker":"Jonathan Pageau","text":"I think that in your case it was a tribute to you as well, that you were able to see that in yourself too. To see, like, oh, wait a minute, it's like, oh, I also need to take my own advice in this case to some extent, like in this context."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":3700.68,"end":3702.68,"speaker":"Greg Hurwitz","text":"And I'd be reliant on the grace of others."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":3702.84,"end":3703.48,"speaker":"Jonathan Pageau","text":"Yeah, that's right."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":3703.48,"end":3915.78,"speaker":"Greg Hurwitz","text":"Because it was like, hey, I don't want to be, you know, look, Jordan, I go, Jordan, and I can have a bare knuckle discussion that's super loving and great, like as you've seen many times. But when it's in front of of of something that's like that, it's like, it's. It's really difficult. I've been thinking a lot about this. You know, my participation in Exodus had different ramifications in certain communities that I'm a part of. Like, some people were, you know, very upset with me for staring at sharing a stage with certain people who were there or upset that I'd participate or, you know, didn't understand when I came back and was talking about things in ways that they didn't, that weren't usual to them. And some people just recoiled. Like I have. Some people I haven't talked to since almost. And I was put in mind of a couple things. First reaction, I felt more. I felt grievancy more immediately. This is kind of an interesting thing that happened since we're talking about Exodus. But first I was like, oh, you just want all my input and insight about how to talk to and engage with the other side and all the persuasion stuff from my deep dives in with, with these bigger personalities and brains that I do with, you know, respect and trying to learn without any slop. That's what you want. You want me to come to you and say, hey, here's a whole framework of how to talk to people without my brain ever getting stretched or stretched out of shape, or my language being imperfect or the mess of my processing and swinging here and coming back to here and refiguring. And it's like, I don't know how to do that. Like, I can't. I'm not going to come and give you a spit out set of widgets about how we start to engage with different people without there being like room for problems. And some people don't just simply don't want that. Here's the precepts, here's the ideology, here's the ways you need to speak, here's the language that's acceptable if you're confusing any way there you've been infected and captured like you went on and you're not who you are and I don't trust you and your excise. It's kind of wild, like what the range is that people are demanding of something. And I started to think about that a lot with people like, you know, it's not like Elon Musk or Joe Rogan, for instance, are like far right conservative characters by any stretch of the imagination. But if they're doing these sort of bigger ventures and roaring around and smashing their way to truth in ways that are imperfect and trying to accomplish things and making mistakes, if part of the predominant culture is, oh, you can't say that, you can't do that, please don't do this, please just get us to the moon and build tunnels. But like, don't do this piece or don't do that piece, of course. Look, it's a free marketplace, right? Everybody can have corrections on people, no matter how powerful or brilliant. And we should. But if it starts to become that, every bold venture gets, you know, swarmed with mosquitoes and people are, you know, are like blood sucked a millimeter at a time in an endless swarm, you start to understand why people start to disengage right from work that might be more obviously unity based. And that's a lot of what we're trying to do with arc, I think, is to figure out how to have sets of values and make sure that we're not. That we're bearing them forward in ways that are building bridges. It's unbelievably hard to do."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":3915.94,"end":3994.48,"speaker":"Jonathan Pageau","text":"Yeah. And you see, obviously I've had that issue with ARC myself where people are. I mean, some people criticizing me saying, well, here, Jonathan, you know, he's going to build the new wf. He's participating in this new globalist initiative. He's and, and it's like, okay, so, so, so, so, so what? So you, you're just allowed to complain, I guess, right? You're just allowed to complain that you see these great, like, globalist, authoritarian things coming towards you. But if you in any way tried to start a discussion with people on how to find some alternative or how to see differently than you're, then you're doing the same. It's like, well, I'm not like, I can't imagine, I can't imagine just like bitching and not, not, not trying to. The same with like the story, the question, right? It's like, you know, I've been watching people that I, that I respect, you know, and I've been doing it myself for the past five years complain about some of the story tropes that are coming out of a popular culture, right? And I've been, and I've been doing it actively. I'm like, this, I think this is not good. This is leading us towards, towards, towards kind of ideology and it's bad storytelling and everything. But at some point I also have to tell. If I'm not going to start trying to tell better stories, then at some point I have to shut up. Like, I have to stop whining because then what are we doing? You know?"}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":3994.8,"end":4213.39,"speaker":"Greg Hurwitz","text":"That's right. Well, there's another line in screwtape letters. Ruth C.S. lewis is talking about like a man in the house with his, with his mom. He's living with his mother and saying, you know, start to be annoyed with every way she says stuff, right? Or like her tone or how she does this little thing. Like, if you can get somebody in a state of mind, right? Because we're, we're working for our father now. Who's the devil if you can get somebody where they're annoyed by every little thing that somebody does. Well, assuming that none of that's true for you and that every tone they have with hidden meaning you can be offended by, but all of your hidden meanings and energy is them being crazy. And he says something like, we want them forever concerned with the state of her soul, but never her, like rheumatoid arthritis, right? Like, if we can remove people to just only be outraged by the abstract, right? Then you can constantly be annoyed in the details and in reality and you have. Your perfect moral equation is in place. And so I've been thinking about that a lot, also with art, but also this insane notion that, like, who you sit down with and learn from and discuss and what you participate in means that you're fully endorsing everything that can come of it. Like, what a weird notion that I would want to go to this Exodus seminar and sit down with Dennis Prager and Ben Shapiro and in doing so that I agree with every single thing that they think and every post that they've made, an argument they've made and them with me, that somehow association means. Not that you're learning. Right. I could take. There's a couple things that Ben said that were, you know, enormously eye opening for me. That's true. Irrelevant if he tweets a bunch of stuff that I don't agree with for reasons. I mean, same as with Jordan. There's a totality of a human being and all the things that they do and the engagement and the dance with that and ideas. Like what an utterly bizarre notion that we should be that that represents platforming them or contributing to their wealth or stature. It's so bizarre. It's like, oh, yeah, well, we deplatform Donald Trump all the way to the most powerful human being on the planet. Like, how did that work out, this de platforming notion? Let's de platform Joe Rogan. It's like Joe Rogan doesn't need that if there's engagement. And for me, a lot of the work that I do, there's these sort of quotations from Desmond Tutu that bookend a lot of my thinking. He always says, if you want peace, you don't talk to your friends, you talk to your enemies. And another thing he said is an enemy is a friend waiting to be made. And this notion that more separate is good, less tendrils. If somebody's infected, corrupt, captured, judged in any way. Sever all tendrils of connection from them. Send. Sever all bridges and attack them in full. It's like, well, what are they going to do? They're going to move and distant and fortify and come back. Oh well, they're doing that anyways. I hear this. I hear the exact same mirror argument, both directions. I can have a conversation with conservative friends and the claims. I can pick them right up and put them down when I'm talking to more liberal friends over here. It's the exact same argument. The hypocrisy divorce from reality only believing your own experts. Mind control. And it's, it's, it's like there's these, these parallel structures of discussion and the arguments follow the exact same course. There's like eight steps of them that you can walk through."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":4214.43,"end":4264.9,"speaker":"Jonathan Pageau","text":"Yeah, but that, that, that's so. I mean, I Don't understand. I mean, I, I've always struggled too, to understand. I, I don't know. Like, I try, I struggle to get into the psychology of someone who like, let's say, post a picture of a good example in my, like from the more right leaning type people, it's like they'll post a picture of someone with Epstein and they'll say like this. And they'll say like, that's it. It's like this person now is like basically non human because there's this picture that exists of them with someone who's a horrible human. It's like that's crazy. Like, that's a frightening thing because can you imagine really seriously thinking that, that just because you met someone in some conference or in some context and there's a picture that's taken of you that all of a sudden we could compromise you forever because of, because of that? That's a. That's wild. And I also. Look, sorry, go ahead."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":4266.02,"end":4287.46,"speaker":"Greg Hurwitz","text":"Well, as anomalous, it's like I've interviewed outlaw bikers, I've interviewed murderers. I mean, I've interviewed like, you know, heist guys. That's all fine. I can go conduct any interview to understand, to, to focus, to do deep dives on people, terrorists. That's all acceptable. But if somebody has a different opinion about."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":4287.94,"end":4289.14,"speaker":"Jonathan Pageau","text":"Don't talk to Ben Shapiro."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":4289.14,"end":4350.45,"speaker":"Greg Hurwitz","text":"Right, it's done. And the thing that's also so weird is like, let's say even that one of these people is, is. Proves to be uniformly evil. Like that. That's also like an assumption you make when you cancel somebody. They're so irredeemable. It's also such an amazing notion that it's not that everybody's where they are on their own journey of life and that there's always hope for grace or learning or movement. It's like, no, it's done. It's locked right now. Like they're permanently awful. And so you think, okay, let's say that's true. Even. Let's say that we take that leap, that philosophical leap. Don't you want to engage with them to comprehend how they think and where the vulnerabilities are and where the weak spots are and where the points are for even joining or contending? Are there any ways you can align your resources? Are there any ways you can understand the playbook better? Are there ways that you want to deal with and wrestle with an adversary that like just in a straight Sun Tzu, know thy enemy, even seeing them."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":4350.45,"end":4362.97,"speaker":"Jonathan Pageau","text":"As an adversary, you should want to engage with them to some extent, because then, right, you don't know your enemy. Then you'll be taken out without. Without. You know, you'll be taken out and you won't know why? Because you haven't let."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":4363.77,"end":4615.68,"speaker":"Greg Hurwitz","text":"Let alone. If there are people with, you know, giant, you know, sets of. I mean, you know, spheres of influence and relationships. Like, I always think of it as, like, if you're conducting a battle between good and evil, you know, it's like, oh, well, this person over here who you've decided is canceled has, like a battalion of tanks, right? But. Oh, they're bad. We just. Let's talk to them. We're not going to talk. Yeah, we don't. We don't want those tanks. Let's insult those tanks till they come for us. It's like, what are you talking about? Right? Like, this is. This is. It's. It's time. I. I feel like it's time that we have to. You have talked about pluralistic ignorance, right? Is that. Do you remember that? It's in cults. It's one of the ways that cults operate. I mean, there's a bunch of ways cults operate. Like our current culture is operating. You know, one of them is, is they want to cut off access to outside information. They divide people from your family, and they do it in a way that's flattering because they're like, oh, you're so amazing. Yeah, your family's always just wanted to hold you back. Like, you're finally your fullest self, who we see. So you sever people, right? All the. And we think about all these people. I haven't talked to my. My crazy sisters, you know, liberal lefty who's lost. My uncle's a MAGA guy. You sever everybody so that you can't see the humanity in them. So that's number one. Access, you know, limit outside information. Then there's privacy deprivation. If you're up at a cult setting, let's say you have a part, you go. Someone goes with you to the bathroom. Someone's with you first when you wake up in the morning to when you go to bed at night. And everywhere you go, they're dealing with Jonathan Colt. Jonathan. Not Jonathan. Jonathan, then. So privacy deprivation is this now? There's nowhere we go that this can't come and reach. Is it dinner time in most households? Doesn't matter. Are you in class? Doesn't matter. Are you at home in your dorm room at the end of a day, at the end of a work day? Doesn't matter. It's with us everywhere. And the other is pluralistic ignorance that everybody is sort of individually miserable or unfulfilled or far from a truth. They want to speak, but they can't share it because everywhere they look, there's these teams of hyenas waiting to just descend on them and tear them to shreds. So you're not safe to speak out and that social. I went undercover to a cult, man. I went to a thing outside lax. I was researching a book. I wrote a book that took place in mind control cults. I was in a horseshoe. Big, like, ballroom, where they have weddings in one of those big airport hotels. 250 people, and they shape it like a horseshoe so you can see everybody. And when they say, everyone ready for growth, stand up and you sit and 249 people are standing and they all look at you. That's powerful. Yeah, it's powerful. Colts want people who are healthy, who are responsive to healthy reactions, like social embarrassment. Right. They don't want someone who's a delusional schizophrenic. They don't care. So these pressures that are happening where people are, like, I don't know, like, I. I believe in the, you know, that people are allowed dignity and private choices and rights, but I don't quite want to celebrate everything around that all the time. But if I say that, I'll get killed. Let me just be quiet. If 80% of people think that, but they're frozen in a state where they can't communicate it, that's pluralistic ignorance. Yeah. And so much of what I increasingly see as the task that I want to help or the way that I want to help is to try to shatter that through conversations rather than. Well, if we elect this group of people here and this group of people there and they do these things and pass this legislation, then we'll be good. It's like. It's about foundationally rebuilding, like. Like we discussed for 32 hours in Exodus. How are we going to re. How are we going to orient a space in a world in which the center holds right and the fringe holds and has its place, and that place will flourish and feed the center, and the center can hold and protect and provide structure. And I think a lot of that is having the kinds of conversations people don't want. There's so many truths that are just so foundational that people just won't speak, that are just obvious beyond compare."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":4616,"end":4633.61,"speaker":"Jonathan Pageau","text":"Yeah. Listen, Greg, I think. I think we should end it there. That was. That was a great. That was a great finish. And so I. I appreciate your time, and I'm looking forward to seeing you at ARC and then possibly at another discussion. Possibly."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":4633.61,"end":4634.09,"speaker":"Greg Hurwitz","text":"We'll see."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":4634.17,"end":4639.53,"speaker":"Jonathan Pageau","text":"We will see. It's still. It's still being discussed, but that is something that might happen, so that would be great."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":4640.17,"end":4642.01,"speaker":"Greg Hurwitz","text":"Yeah. It's always fun talking to your man."}
{"episode_id":"SW - #307 - 2023-10-03 - Gregg Hurwitz - The Search for Political Nuance","start":4642.34,"end":4643.22,"speaker":"Jonathan Pageau","text":"Hi. It's good to see you."}
