{"episode_id":"SW - #295 - 2023-07-03 - The Symbolism in Jack and the Beanstalk","start":0.48,"end":1142.46,"speaker":"Jonathan Pageau","text":"The story of Jack and the Beanstalk is a story that we've all heard as North Americans, we know that story quite well. So I thought it would be interesting to explore that story, to look at its structure, to look at the symbolism inherent in it. And also it will help us to see a certain perspective on symbolism, a certain perspective on hierarchy, which is the manner in which hierarchy can prevent, let's say, things from higher above from reaching us. Something like that. So we'll. It's a. It's an aspect of hierarchy that I haven't looked at so much. And so I hope that it'll be a good occasion to talk about that. This is Jonathan Pedro. Welcome to the symbolic world. The story of Jack and the Beanstalk can be brought into very simple elements. You know, there are different versions of it, of course, but the most known version, the one remember, I'm going to tell it very briefly. A young boy lives with his mother. He's an orphan. His mother is quite poor. And, you know, they're starving. They have nothing to eat. And finally his mother, you know, all they have is this one cow, and they're at the end of their rope. And finally his mother tells him, you know, go and sell our cow so that we can eat, you know, for one last time, and then we can die. Something like that. And so Jack goes out and he goes out with the cow in order to sell it at the market and hoping to be able to buy some food. But on the way, Jack meets a strange old man. And the strange old man is. Suggests that maybe Jack should trade his cow for these magic beans. And he tells him that these magic beans are very special, very precious. And Jack ends up accepting that deal. He takes the magic beans, brings them back to his mother, and of course his mother is extremely annoyed. What are these magic beans? You've been duped. You've been had. And she tosses the magic beans outside the window. The next morning, Jack wakes up and the beans have transformed in this gigantic beanstalk, which goes all the way up into the. Into the sky, into the clouds. And so Jack starts to ascend this stalk. His mother, of course, doesn't want him to, but Jack will go anyways. He ascends the stalk, and arriving up in the clouds, he finds there is a giant castle or a house or some kind of lair. And in front of the lair is a giant woman. And the woman tells him, you know, be careful, be careful, because my husband is coming. My husband, the ogre is coming. And so this giant comes in, you Know, Fee fi, fo, fum, I smell the blood of an Englishman. And the woman hides Jack in their house. So the giant sits down and he eats. And after he's eaten, he takes out his bag of money. And then he. And he starts to count it. Jack can see this from his hiding place. And finally the giant falls asleep, of course, Jack goes in, takes the bag of gold, brings it down the beanstalk to his mother, and this happens three times where he goes up. The second time he goes up, the same thing happens, but instead of a bag of coins, usually it is a chicken that lays golden eggs. And then the third time that he goes up, usually what it is, it's a magical harp which plays music on its own. And when Jack takes it, sometimes the harp will call out to its master. And the giant wakes up and chases. Chases Jack down the beanstalk. His mother cuts the beanstalk and the giant falls down, you know, and. And dies. And then after that, Jack and his mother live happily ever after. So that's the basic elements of the structure, but let's look at some of the elements one by one, and we'll see what it is. It's trying to talk about. What type of structure is it appealing to? So, of course, this idea of Jack being a orphan, living with his mother, having no father, and being poor, those two things are related. The notion of not having enough to be able to survive, enough money, enough value, you could call it, because the father is gone. He's left alone and poor with his mother. So he's not receiving what. What he needs to receive from above, you could call it. You have this relationship between the rich and the poor. The rich are meant to give to the poor in order to help them to survive. And the poor, you know, are meant to provide work, provide, you know, support for those that are above them, you know, and that's how the chain of value in terms of monetary relationship goes, you know, and so they're orphaned. They're not attached to any principle, to any man, to any. They're just left on their own. And so Jack goes to sell his cow. And the cow is, of course, you know, another image of this. This feminine image that is related to his mother herself. Related to the land, related to, you know, this. This is what they have. They have the land. They. They don't. They don't have the. They don't have an identity. They don't have a family. They're not connected to something which can give them value. And so Jack is the. The old man wants to Sell Jack these beans. Now, Jack intuitively has understood the transaction. He knows that that's what he's looking for. He's looking for seeds. He's looking for the center, for a core, for an attachment to, meaning to. An attachment to an identity, an attachment to a family. Something which connects him, you know, and will give him value. And so this seed is of course, this image of the core, you know, the pearl, the. The littlest thing, the center of the. The wheel. So that's what he gets for the cow. So in the Christian terms, you could say that he has sold the field to get the pearl that is in. Hidden in the field. You know, Christ talks about. About this. No, Christ actually. No. He said he buys the field to get the. The pearl, but this is actually the opposite. But it ends up being the same thing. It's like you sacrifice the much for the few. You sacrifice. You remove the garments of skin, you remove the animal in order to get the seed. You. You get rid of the cow and you get the center. This, this, this, this. The center of meaning. Now, the. The. The mother doesn't recognize the seed. She doesn't see it as something that she can be attached to. She doesn't see the value in the seed. That's often the problem with the seed itself, because the seed, the meaning, the name, the spiritual aspect of something usually doesn't. It's difficult for people to see their value because it doesn't appear as quantity, it appears as quality. You know, you look at a seed of a tree and you think, what is this, this little thing? It's not worth anything. It doesn't have value. You know, you don't realize that if you plant it into the ground, then it will become this gigantic tree. You can't see that. People, the naive person, cannot see that in the tree. But Jack has perceived that if he has the seed, then he will have. In the end, he could have. I mean, he doesn't necessarily consciously do that, but the idea is that if he has the seed, then later he can have more because he can plant those seeds and receive more. Now, the mother tosses the seeds out, and then you have this stock which goes up into the. Now the stalk which goes into the sky is this connection is the connection to heaven. It is the hierarchy. It is the mountain. It is all those things. It is all these things which connect heaven and earth. So it is a. It's a connection between heaven and earth, a ladder, like I said. But it is a connection to heaven and earth seen from below. So you could imagine something like a ray of light coming from above. Um, you can imagine that type of imagery was something coming from above or, you know, a stream of water coming from above, or, like I said, a ray of light, a glory from above. But now it's from the. It's from the bottom up. And so it is this. This vegetable stock which goes up and reaches into the. The sky. And so. So Jack will ascend the stalk. And what is he going to get? He's going to get value. He's trying to connect to meaning, to. To. To meaning in all the ways that. That appears, you know, in terms of identity, in terms of having value on Earth. And so he goes up into the heaven and he, first off, steals gold itself. So that's the first step. It's like. It's like a hierarchy of things that he gets. The first is gold. And gold is, of course, in our world, its value. It's also the highest metal. It has to do with light which comes down. You can imagine all these structures of the Golden Age, the Silver Age, the Bronze Age. You can imagine it as the statue in the dream of the prophet Daniel, where the head of the statue is gold and then silver, bronze and all the way down to clay. So it is this hierarchy. He gets the gold. The second thing he gets is he gets the production of gold. He gets the, you know, chicken, which produces golden eggs. And in the golden egg, what you get is both the image of gold of value, of this ray of light which comes down from above, but also you can get it. You can imagine it also as the seed. It is this egg. It is this, this. This the same as the. It's the heavenly version of the being that Jack got on Earth. Now he's getting the heavenly version of that being, the seed, that which comes from above and provides anchor, provides meaning, all of that. And then finally, the third one is, of course, the highest version, which is he receives this golden harp which plays music on his own, on its own. And so here it's related to the idea of a kind of highest meaning in the sense of the music of the spheres, the patterns of reality itself. That is what he is accessing when he gets the heart. He's accessing the deepest meaning, the pattern, like I said, the very pattern by which the world is functioning. So you can see this hierarchy of things that he's accessing as he is getting the different things from the. From the giant now. And then Jack, what he does is he brings the light down from heaven down to Earth and So he, he, it's of course the, the traditional hero's journey. He goes to get the boon, brings it back and that's what he's doing. He's going up into heaven and he's getting some light from heaven. He's getting some gold, some seed, some patterns, and he's bringing them down to the earth in order for them to have their effect on the, the earth. And so that's what he's doing. Now the question comes is why is it that Jack has to steal those from the giants? Why is it that Jack has to trick the lady giant, has to trick the giants in order to get that light from above? And here is where you can see the hierarchy represented as an obstacle. And this is, this is what is being shown in the image. Now you can understand it very simply, cosmically or phenomenologically. You know, you have, you have this experience of light. Where does light come from? Light comes from above. That's where meaning comes from, because light shows us the world. And so meaning comes from above. And then suddenly what happens, this giant gray cloud comes, you know, in front of the sunlight and blocks the sunlight from you. And so this is what this story is referring to in terms of just phenomena. It's referring to the big dark clouds, the giant clouds that block the sun from us and prevent the sun, its golden rays from coming down to us. And so Jack has to go up the beanstalk, has to go up what he has, he has to ascend this organic, this bottom up ladder and get from, get from heaven what it can get by, by stealing it from heaven. And so in that imagery, you see, there are plenty of stories that have that type of imagery. This whole Promethean notion of stealing fire from the gods and bringing it down to earth. This is what Jack is doing. He's stealing fire from above, he's stealing gold, fire, light. All these are the same types of imagery, meaning all of this. He's bringing down from above in order for it to be able to, in order for it to, to be able to be beneficial to the earth. Um, and that is also the reason why you have, you know, and I talked about this before, you have this notion of, at every level of transition, you can have monsters, you can have monsters below you, but you can also have monsters above you because the world is made of these, of a ladder, of, of, of transcendence. And so at every step of the ladder you can encounter some obstacle, you can encounter something which is going to prevent you from going up further. And that can appear as some kind of a monster. You know, like, we've talked about the. The leprechaun that saves the gold that's at the end of the rainbow. There are many images of the. We've talked about the sphinx or the griffin which guards holy places, or even the cherub which guards the holy place, you know, on the veil. And so this idea that as you're coming, there's an obstacle which. Or even the cherub at the gate of the Garden of Eden, as you're moving in towards light, towards meaning, towards identity, there's all. There are also these obstacles which can manifest themselves to you. Okay? And so the natural function of a hierarchy is to distribute, let's say, the light down to you. So the idea, you can imagine a hierarchy of angels that distribute the glory of God down to the. To the earth, or you can imagine a hierarchy in terms of a social hierarchy. The purpose of the hierarchy, let's say to have a president or a king or whatever it is that's above you in terms of hierarchy, is that they are supposed to distribute what they get from above them down to the lower level. They're supposed to be a conduit by which grace, by which value, by which identity, all of these things are supposed to come down to you. But like I said, because of the very manner in which hierarchy works, it is possible for the. The. The levels above you to act as an obstacle and to prevent, let's say, what's above from coming down. And that's the image, the whole image of the tyrannical king, if you think of King John in the story of Robin Hood, who only takes from below and. And doesn't give from above, you know, and that. That can't work. There has to be an exchange between heaven and earth. And so, of course, in the darker side of this type of representation of, Of. Of a hierarchy, of course there is an extreme version of this which is, you know, the kind of the revolutionary ideal, which is that we have to go up and get. The Tower of Babel is also part of. Of this imagery of the idea that we have to go up the tower in order to reach. To reach the highest, you know, we have to go up and get it ourselves. Because, you know, there is this idea that it's not coming down the way that we think it should come down, or that it's being prevented from coming down by the different levels of an ontological hierarchy. And usually, you know, that's quite negative, but it's not. Doesn't always have to Be negative. It just really depends on what. What is behind it and what. You know. There is also this idea that we do have to struggle. There is a struggle that is necessary in order to be able to access, you know, it's a race. We have to climb the ladder. And the ultimate image of that is, of course, in the image of Jacob. Now, Jack and Jacob, same name, same story. I'm sorry to tell you that that Jacob in the Bible is very similar to Jack in the story of Jack and the Bead Sock, because Jack and the Bead Sock, of course, is a trickster. He goes up, he tricks the. The. He tricks the giant in order to get things from above. And that is exactly what Jacob does in the Bible. Jacob tricks his father to get the blessing because he sees his brother, who's above him, as an obstacle for him to receive the blessing. He tricks Laban in order to get value, to get rich. And then ultimately, he struggles with an angel. He fights an angel in order to get a blessing. And that is the same concept. The whole story of Jacob is the same thing. So he encounters an angel, and the angel is an obstacle for him to receive the blessing. And so he struggles with the angel, he fights with the angel, and. And then he finally receives the blessing. And so in the most positive aspect of this story, we can see it as the need to struggle and the need to actively climb the ladder, to actively engage in life and not let things become obstacles for us to receive what is coming from above. And on the opposite side, or on the negative side, and also the negative side of Jacob as well, is the danger of the revolutionary mindset, which is that I will overthrow what is above me in order to get, to ascend and in order to get what is above from me. And in the extreme version of that, of course, the extreme, extreme, extreme, extreme version of that is, of course, the revolution in heaven or the revolution in the garden, and it leads to death. And so there are ways to recover, let's say, the positive aspect of the story of Jacob and of the story of Jack and the Beanstalk, and be careful of the dangerous and negative aspects of that story. So I hope that this, this version, this explanation of the story of Jack and the Beanstalk was enlightening to you. So, so, yeah. So I hope you enjoyed this and."}
{"episode_id":"SW - #295 - 2023-07-03 - The Symbolism in Jack and the Beanstalk","start":1142.46,"end":1143.54,"speaker":"Jonathan Pageau","text":"I will talk to you very soon."}
{"episode_id":"SW - #295 - 2023-07-03 - The Symbolism in Jack and the Beanstalk","start":1143.54,"end":1144.1,"speaker":"Jonathan Pageau","text":"Bye. Bye."}
{"episode_id":"SW - #295 - 2023-07-03 - The Symbolism in Jack and the Beanstalk","start":1152.26,"end":1189.48,"speaker":"Jonathan Pageau","text":"I'm Jonathan Peugeot, and I'm inviting you to participate with us in our retelling and our celebration of one of the most iconic fairy tales of all, Snow White, A Beautifully illustrated storybook, Snow White and the Widow Queen places our iconic character at the beginning of eight upcoming fairy tales which will speak to each other and harmonize in surprising ways. Snow White and the Widow Queen rekindles an adventure which will make you remember, rediscover, discover, but also marvel and wonder at our rich heritage of stories. A heritage that still has secrets to reveal even after centuries of being passed down to us."}
{"episode_id":"SW - #295 - 2023-07-03 - The Symbolism in Jack and the Beanstalk","start":1189.96,"end":1191.64,"speaker":"Jonathan Pageau","text":"In the past few decades, we have."}
{"episode_id":"SW - #295 - 2023-07-03 - The Symbolism in Jack and the Beanstalk","start":1191.64,"end":1314.93,"speaker":"Jonathan Pageau","text":"Watched many of our stories, our fairy tales, our myths become completely exhausted by efforts to deconstruct them, to reinvent them, and sometimes to even invert their original meaning. It has come to a point where we've almost forgotten the why we cared about these stories in the first place. I firmly believe that for this reason, it is now time to retell and redisrupt our original fairy tales. In a spirit of celebration, of admiration and unashamed joy, I've spent the past two decades meditating on the strange narrative elements of Snow White and other fairy tales. After much thinking, I'm now bringing this story to our common hearth. We find in the fire of time ready to present hidden treasures most of us have never noticed. To accomplish this, I have paired up with Heather Paulington, a world class artist and designer who has worked on some of the most beloved film franchises of our time. Her work mirrors my writing in a collaboration that has produced a powerful synthesis of medieval style with the best 19th and 20th century illustrated. I love the Kickstarter model because we can make the book more and more beautiful with every stretch goal we can offer art prints, a limited edition drawing by Heather, and even a Snow White illustration of my own. Finally, we're planning a super exclusive leather bound edition which pulls out all the stops. A storybook mantelpiece for sure. The profits of this crowdfunder will will be used to start a new publishing company, Symbolic World Press, whose christening publication will be this very fairy tale series. Each book illustrated by world class artists. Jack and the Beanstalk, Cinderella, the Valiant Little Tailor and several more are next in line for publication. All existing in the same world and all fitting together like a puzzle moving towards the final surprising resolution. After all that, there's no limit to."}
{"episode_id":"SW - #295 - 2023-07-03 - The Symbolism in Jack and the Beanstalk","start":1314.93,"end":1315.77,"speaker":"Jonathan Pageau","text":"What we can do."}
{"episode_id":"SW - #295 - 2023-07-03 - The Symbolism in Jack and the Beanstalk","start":1316.97,"end":1324.17,"speaker":"Jonathan Pageau","text":"It's time to reset the clock to retell our stories. So please join us in this celebration and creative venture."}
