{"episode_id":"SW - #031 - 2019-03-12 - A Guide to Turning Postmodernism Against Itself","start":0.64,"end":1682.48,"speaker":"Jonathan Pageau","text":"I would like to welcome you to episode 31 of the Symbolic World podcast. On this episode, I will be discussing the possibility of taking postmodern theory, especially Jacques Derrida and his ideas, and taking them as being a theory that flips the world upside down, but now using some of their own techniques to then flip the world back on its feet. And so I hope you enjoy. This is Jonathan Peugeot. Welcome to the Symbolic World. I wanted to do something a little bit different. I've been talking a lot about symbolism, obviously, since we started all this, but one of the things I've mentioned over and over since we started is this notion that postmodernism can be turned back on its feet. Let's say I've mentioned that Jacques Derrida, for example, who's a thinker that everybody's heard about, related to postmodernism, and how his ideas, if you push them in a certain manner, they actually come back right side up. And so I've seen quite a few comments of people thinking that is an interesting idea. But obviously I haven't really explained how it's done. What I have been doing from the beginning is that I've actually been doing that without explaining what it is that I'm doing. And so hopefully in this little video, I can explain how I try to do that or maybe how it's done. So hopefully all of you can use some strategies to, let's say, push post modernism into post postmodernism, I guess we could call it, or just basically normal world. Okay, so I'm going to use one particular example, and the example I'm going to use is one which, if you have been following my videos, you will have seen countless examples of me talking about that subject in general. And so hopefully you'll also be able to pull in threads from the other videos that you've seen, so you can totally see how this works. The example I'm going to use is the example of hospitality. The notion of the monster, let's say, so Jacques Derrida, one of his positions, one of the structures that he's put about, is this notion of hospitality. And his notion of hospitality can be put in parallel, can be made analogous to other of his structures. Another of his structures is this notion of eschatology for those who don't know what eschatology is. So eschatology is this waiting for the end things. And so usually it's framed in Christian terms of this idea of waiting and kind of calling upon the returning Christ. And so Jacques Derrida goes into this Notion of eschatology. At the end of Revelations, there is a verse which says, come, Lord Jesus, right? Come. This call to Christ to return. And so what Jacques Derrida does is he talks about. I'm going to use. Translate these words for myself, because I don't know. I've read Derrida in French, so I'm not sure what the English versions are. But he has this notion of an open eschatology. And so this idea of open eschatology has, in a way to do with this idea of hospitality, or you could call it radical hospitality. And what it is, in layman's terms, it's what it is when you hear people say things like, you should be open, we should be open. We've heard that all the time, right? Well, you're not very open. You have to be open. So this notion of a radical openness, and this radical openness is in a way, an openness which is so open that it doesn't judge. Right. So Derrida sees it, in a way, as the position we need to have towards the future. Right. If we want to take. We want to stand and look out into the future, and the. Then call upon whatever is going to come. And in his mind, that is how we always act. We stand and we look towards the future, and we kind of call for the future to come. And then as the future is kind of manifesting itself in order to be, we have to be hospitable to the surprise of the future, so that the future can then kind of manifest itself and, let's say, integrate into the world. But his is really this kind of. Really has this kind of radical openness, which is that you. It's almost this nameless, this idea of almost not naming the future, not giving it any name, so that as it comes towards you, it comes towards you in the most in the fullest way possible, let's say. And so there's value in that. There's value in this idea of eschatology, in a way. There's a value in understanding this position of eschatology as one of the manners in which we engage with the world. And there is also. There's a certain positive aspect to that. It actually resembles something that Jordan Peterson talks about, this idea of facing the future, of coming to the edge of being, let's say, and then looking out into adventure, looking out into the future and being willing to accept the surprise of whatever is going to present itself to you. Derrida would always obviously not use the word present, but whatever is going to Come into. Come into contact with you. Okay, so that's the basic idea of hospitality. And you can see how this plays itself out in a lot of things. It plays itself out in a way, in terms of progress in general. People who have this notion of progress, if you ask them, towards what are you progressing, usually they can't really totally answer, because in a way, it's this kind of progress without telos, this progress without purpose, but still this notion that we always need to advance and progress towards who knows exactly what. And so we need to be open towards these. Towards what the world is going to be like in the future. Of course, there's often an insidious part of that where people, in the back of their mind, they know what it is they want the future to be, but let's leave that aside for a moment. And so we can also see it in terms of this notion that we have to be open towards other people's ideas. Open, you know, this kind of total openness to other religions, to other cultures, to other. You know, it's like this idea that we all need to be very, very open, right? And you can pull out all the cultural ramifications of this idea, which wasn't born just in Derrida, but Derrida formulated it in a way that is. It is quite good. And so the idea that I'm trying to propose of how to then turn Derrida against himself, let's say, or let's say bring Derrida so that he kind of flips back up on his feet, is to continue the process of deconstruction. You would say one of the basic tenets of deconstruction is that you can't totally. You can't totally control the meaning of the text because the text is always referring outside of itself. It's always referring to other things. The word outside is also a word that Derdan wouldn't use, but it's always referring to other things. And you can't totally control what it's referring to, either historically or in terms of analogy or in terms of being referencing other texts. It's like you have. So the meaning is always kind of shifting and sliding because you can't totally contain it. And one of the things that Dehydra will do is he'll try to show how even words reference to other words and how analogies reference to other analogies. And then he'll try to use that to kind of break apart the total solidity of the text. Okay? And so what you can do is you continue that Process, you continue it, and I'll show you what happens. So in the context of hospitality and in the context of radical hospitality, one of the figures that there are two figures that decide uses, there's several, but two of them. One of them is this notion of the prostitute. And so his idea, he talks about the prostitute as being this image of radical hospitality, right? So the prostitute does not discriminate, let's say, on who. On who she encounters and who she joins herself with, but it's completely open towards whoever presents himself to her. And so another. Another image that he. He uses is the image of Elijah, because in Jewish tradition, there's this notion that you leave a place open at the table for Elijah. And so it is this kind of leaving an open space, right? Leaving an open space for. For the stranger. Elijah is the island. His name is the stranger. Leaving this open place for the stranger, this open place for the future, this open place for whatever surprise can present itself to you. And so those are kind of two images that he uses to talk about radical hospitality. Now, if we look at the prostitute, for example, we can see that we can find stories, especially if we're looking within the Jewish context, within the biblical context, there are stories which talk about prostitution. And in fact, they actually do fit in this idea of radical hospitality. The example that you can use is the example of the two spies in. In the story of the taking of the city of Jericho. So in that story, the Israelites send two spies into the city of Jericho, and those two spies are taken in by a prostitute who lives in the wall of the city, okay? And so the prostitute hides the two spies and she makes an allegiance with them. And the allegiance is when the Israelites come to destroy the city, then that they will not harm her. And so here we actually see an example of radical hospitality where the prostitute is willing to be hospitable and to be open to the enemies of the city, to those whose purpose is actually to undermine and to destroy the city. And what's interesting in this version of the story is that it's actually. It's not seen as bad in this story. It's actually she's seen as the. As the good person, as one of the heroes in the story, because it is. The story is seen from the point of view of the Israelites. And so the Israelites use the. The radical hospitality of the prostitute in order to send spies so that they can infiltrate the city and ultimately leading towards the destruction of Jericho. Okay? And so what happens? And so this is now where postmodernism flips back on its feet because as you disperse the interpretations, right, as you, let's say, as you let the. As you let the story slide and reference out to other places, and you bring in other stories which relate to what you're talking about, which is this notion of the prostitute and radical hospitality, what happens is certain interpretations will. Will pop out. And for example, the type of inter. The interpretation which leads to the complete destruction of your city, the complete destruction of your identity or your. Your. Yourself is one which will stand out. And. And so, although maybe Jacques Derrida will want to continue, it will want the thing to continue to slip and slide, most people, let's say normal people, people who have care for their life, for their city, for their family, for all those things, are going to notice that you need to take into account that possibility within all the other possibilities. So within the radical hospitality, one of the possibilities you need to take into is the possibility of the spy who will come into your city and then through their actions, will destroy everything you care about. Now, that doesn't mean that that's what's going to happen. Of course not. But because of that possibility, all of a sudden what happens is a hierarchy sets itself up again. A new hierarchy will manifest itself where that possibility of, let's say, your city and your country being destroyed is going to come to the. Is going not necessarily come to the top in the sense that that's how you're going to act, but it will come to the top in the sense that that is the one that you will be attentive to and that you'll be careful about. And so in that hierarchy, then there will still be the normal hospitality towards a stranger, the normal hospitality towards other people, because that brings a lot of advantages. There are a lot of advantages which come from hospitality, trade and enriching yourself, increasing your own knowledge, your own understanding of the world. All that comes from this openness towards the future, this openness towards the stranger. You know, this kind of radical hospitality that Derrida talks about, there's a lot of positive stuff coming from it, but there is that one possibility, which is, for example, that we will create an AI which will destroy us, or that we will create more weapons of mass destructions that will devour us. And so we can't, in the end be completely open to towards the future because of that hierarchy which resets itself up as you look at how. How things slip and slide. The other example, of course, is the example that he uses, is this example of Elijah and So Elijah is the stranger in certain guises, that is that he. In Jewish tradition, and also even actually in. In Christian tradition, there's this notion that Elijah comes before the Messiah, that Elijah manifests itself before the Messiah. In the Christian tradition, we say that the Elijah who manifested himself before The Messiah was St. John the Baptist, St. John the Forerunner. Whereas in Jewish tradition, they still have this notion that Elijah precedes the Messiah. Well, if you look at the story of Elijah, then you can also see exactly the same problem as the story of the prostitute and the notion of radical hospitality. Because in the story of Elijah, the king has so much openness, is so open to other possibilities that he marries a foreign queen. This foreign queen brings in her foreign gods, her foreign ideas, and what happens is the world flips back upside flips upside down, where the normal traditions of that society, the temple, the priests, the priests of the. The God of Israel, are marginalized. You know, they. I've talked about this before in other videos. They. They actually become. They have to hide in a cave. And so Elijah, and he actually participates in flipping that back where at the end of the story of Elijah and of that line, the queen, Jezebel, this queen which brought in all the foreign gods, gets thrown off the wall, gets eaten by dogs. And so there is this whole imagery of the foreign queen finally exiting the city, you know, and the city kind of finding its. At least a glimpse of the possibility of the city finding its integrity once again as this queen gets ejected from the city. And so once again, here's another example of how if in the tradition of Elijah, there is this notion of. Of hospitality in the sense that Elijah also prepares us for the coming of the Messiah. Right? There is this really eschatological aspect of Elijah in the story of Elijah. There is also another aspect which is the decrying of the, let's say, the foreign gods and this idea of a world where the normal tradition of that world is being flipped upside down and being put into the margin. So hopefully that will give you, all of you, a little idea of how it is that postmodernism can be brought back, let's say, as you let it slip and slide. I would suggest that you, that some of you look at this. I don't know if you've heard of a real peer review. You see that on Twitter. It's really worth following that Twitter account because in those tweets is really presented the extreme of postmodernism, some of the most extreme statements of postmodernism. And in those statements you can see how things are already starting to flip back, you know, and it's happening in a very strange way. I would suggest that you pay attention to that. If you're interested, maybe I'll make a video on some of those tweets and you'll. You'll be able to see it. Another very. Even more. Another far more banal example, but I think one that's worth watching is that, for example, a. A traditional position. This is really very kind of basic and almost unimportant, but it's a good example to kind of understand how this is possible. You know, just a normal, traditional vision of, let's say, between. Of the relationship between the men and women is that the masked men are stronger, men are more physical, let's say, in terms of strength and mostly strength, let's say. And it doesn't mean that women cannot be athletic. They can't be strong, they can't be fast. And there are many women who are stronger than men, but on the whole, in general, men are stronger than women. And that's why we've always had. We've separated the sexes in sports, right? So you have men's, you know, men's hockey teams and women's hockey teams, men's basketball teams, women's basketball teams, Right. So now the radical position of the postmodernist is that gender is over. Gender is a construct. Gender slips and slides. There's no stability in gender. There are these in between categories which deconstruct the categories themselves and infect the categories so that you can no longer have stability in the categories. Right. And so then what do you do? Gender just kind of dissolves. It doesn't dissolve, but it slips, and you can't completely contain it. And so then the final solution to that would be to stop separating the genders. And we hear constant calls to do that. For example, that we shouldn't have men and women's bathrooms, or that, you know, anybody can go into whatever bathroom they want. And I've said this before, the question of the bathroom is very important. It's very important because when we talk about the bathroom, the idea of where it is that you evacuate and you make yourself whole again, you kind of remove from yourself those things that are not you. It's very important. I know people think it's kind of silly, and it is silly, but it's very basic, because going to the bathroom is something everybody does, and it's something everybody does which very unconsciously reminds us of what it is that is not us and what it is. That is us. And so the bathroom is very much linked to identity in a very basic way. Okay. That's one of the ideas of letting anybody go to whatever bathroom they want. Okay. Well, the final solution to that is to eliminate the differences between genders. Now, my son is really into parkour, which is this free running. These guys who run around and they jump and they hang on buildings and everything. And there's a show on Netflix called Beastmaster, and this show is basically an obstacle course. So my son, he really wanted us to watch. He really wanted me to watch that with him. And so we watched the season of Beastmaster, and these people that are doing all these obstacle courses, and it's pretty good. It was a pretty good show. It was pretty interesting. But one of the things they did in Beastmaster, which is really interesting, is that they let everybody compete, Everybody compete together. And so they made no differences between men and women. And then what happened, obviously, you know, to anybody who has some sense, is that in the end, the women never made it past a certain level. They never made it past a certain level. And at the end, it was always men who won the. You know, the. Every episode had a champion. It was always men. And at the end, obviously, it was a man who was the champion. And then when you watch that, what you end up thinking is, ah, I wish they would have separated the gender. Like, I wish they would have had a competition between women and a competition between men so that we could see the women that shine and we could see the men that shine. But now when we do that, all we see are the men that end up shining in this competition. And so it sets up, once again, a hierarchy. It happens on its own. Once you level everything, once you destroy everything, the hierarchy sets itself up on its own. Jordan Peterson has talked about this before in Scandinavian countries where, in fact, where they have worked very hard at destroying the differences between men and women. What happened is the. The difference between men and women actually maximizes when that happens. And so that is a way pushing postmodernism to its limit, pushing it to its edge is a way for it to then flip back on itself. And then a normal hierarchy gets re. Established. And so, yeah, so that was just a quick video. I thought that you guys would enjoy it, and. All right, I'll talk to you soon. Thank you for listening to the Symbolic World podcast. As you know, this podcast is, for now based mostly on my YouTube videos, which I am transferring into audio format. Please go ahead and visit my YouTube channel. There are more videos there on different subjects that I'm not going to put into audio. And please share this to your friends. I know a lot of people know about the YouTube content, but not so many people know that this is also a podcast. So share it to your friends. Share it on social media. And if you can, feel free to support this financially as well by going to my Patreon page, which is Peugeot Videos. Strangely, you can go there and you can support it at any amount that you want. A month for all the patrons. I do a monthly Q and A live Q and A in which people can ask questions in the chat, and I try to have a more personal connection with people. The YouTube comments have become difficult to follow and to answer. I'll see you soon."}
