{"episode_id":"SW - #311 - 2023-10-26 - Ritualized Behavior From Animals to Church","start":0.4,"end":1160.43,"speaker":"Jonathan Pageau","text":"You can make fun of the strange hat of a pope or of a bishop, and you think that that's funny, but somehow you still understand why you need a uniform to play sports. You know, it's like these are all different levels of the same reality. This is Jonathan Peugeot. Welcome to the Symbolic. One of the reasons why it's difficult for several people to understand religion and religious behavior is because they tend to want to isolate religious behavior from other human behavior. And so they have this little category here called religion, and it's broken off from all the other things that humans do. So because of that, the religious behavior can appear arbitrary, super superstitious, ridiculous sometimes. Also, people want to reduce religion to a set of things that you believe, rather than understanding it as a coherent set of behaviors and beliefs that kind of go together. I found that the best way to understand religion from a secularist perspective, or from a. Even from a purely materialist perspective, is to see it as an extension of other types of behaviors and even, I would say, as an extension or similar in nature to some behaviors that animals have. And so one of the things that I've noticed is that looking at the way that animals ritualize behavior is actually a good way for humans to understand why it is that we ritualize behavior and what it is that ritualizing behavior can do. And so the first thing to understand is that actually all behavior is ritualized. That is, anything which is moving towards a goal has to be ordered. And so if you don't like the word behavior, let's just use the word ordered. So ordered behavior will happen as you move towards a goal. So if you have a purpose, the things you do, you know, will. You'll probably experiment a little bit at the outset, but at some point you'll realize that, you know, if I want to get to the river, this is the best way to go. At first, maybe I'll zigzag, I'll do this. But then a trail will set itself up in the forest to go to the river. And then that behavior going from the village to the river, for example, will become ritualized in the sense that it will become ordered and will have kind of reduced itself to its best. To its best line, you could say, to get to the river. And so this is something which happens in all types of behaviors. Whether it is, you know, the way to hunt or the way to prepare food, all of these will become ordered. Not like 100% order, but there'll always be a little aspect of variability on the margins, but the behavior will become ordered and so you could say that when you order behavior, the more you order it, you do it in order to avoid the cost of the behavior. So, you know, it's like, if I could get to the river by going all around and going in circles and doing all this. And then I get to the river, and it's like, okay, but that's very costly. It takes a lot of time. It takes a lot of effort. And so what I'll do is that I'll start to order my behavior. In order to reduce the cost that it has. You know, in terms of energy, in terms of time and all of that. And in terms of consequences, you could say. And so you can imagine that this is something that happens even in animal ritual behavior. So think of, for example, ritualized conflict between animals. The animals will ritualize their conflict. And will ritualize their capacity to recognize who is the superior and who is the inferior. And they will do that to avoid the cost. Because if they go all out and they fight it out, then that becomes very costly. Both for the one that ends up on top and for the one that ends up submitting to the higher power. And so because of that, the animals develop this kind of ritualized version of a conflict. Which looks like a fight but isn't complete. Does. Reduces the cost towards something like meaning. And we're going to use the word meaning for now, we could use other words, but purpose, maybe we could say, is a good word. Way to think about it. As you move towards purpose and meaning. And as you kind of encompass, you know, the reason why the fight is there in the first place. Then you can ritualize it in order to avoid the cost. All right, so you can understand how that is true for going to the river. As it's especially true for animals that will ritualize fighting behavior. Or animals that will ritualize a type of mating behavior as well, which is that the animal will have certain. Certain type of dance. Or certain type of colors that will. That will make the choice of a mate less costly than it would if those things weren't there. Like I said, all aspects of behavior are ritualized. They're just different levels of ritual. So you could understand that if you extend that into the human sphere. Then you can see how we, of course, do the same, which is that, you know, we've developed shortcuts. Shortcuts of meaning. In order to avoid the cost of something. So a good example is when you meet someone, we shake hands, we look into each other's eyes. We have found ways in order to encounter Someone in a manner that cuts to the chase, right, Gets to the meaning of it, which is that we're. We're meeting, we're not in conflict. We. We recognize that there's a kind of peace between us. There's a certain level of communion. And. And so we've ritualized that in the type of behavior, shaking hands, all the other ones that, that we have, which reduce the cost of figuring out, you know, how. Who this person is, what it is that they want from me, trying to, you know, trying to move around, asking questions. I don't know what type of other types of behavior could exist in order to figure out the intentions of the person in front of you. But you. You can imagine that, that these types of behaviors, shaking hands and all this, you know, was chosen out of a. A set of possible behaviors that were maybe a little more costly. Okay? And so as you move towards more and more contracted behavior, what you do is you move towards something like meaning. And so what happens in that type of behavior is that what happens in religious rituals, especially those that we consider religious, is that the meaning becomes more and more compressed and more and more pure, more and more crystallized, which is that, you know, if there's a manner in which. Let's say we eat together as, as. As a people, and so we come together, we eat together, and what that does is it binds us together as a people. We've. We notice that if we eat in a certain manner together, if we sit together around a table or whatever, there are multiple ways to do it. But if we aim towards that purpose, there's a limited amount of ways that we can do it, that it binds us together, that it makes us also share in the. In the food, makes us share in the identity, makes us recognize each other as one, for example, then we realize that, wait a minute. If I can scale that up. And so if I meet together with my family or with a friend and I eat, you know, that does something. But if I have like a banquet at the city or a marriage banquet where we all kind of come together or some ritual where it's a big bigger meeting. Let's say we have a. A banquet to celebrate, you know, the. The 30th anniversary or the, you know, 100th anniversary of a city, then all of a sudden we realize that this type of behavior, these ritualizations of. Of ceremonies of coming together, bind us together towards higher purposes. And so you can understand, then at some point, people inevitably started realizing that the more you ritualize it and the. Let's Say, the higher you aim, the higher, the more it binds reality together. And so religious ritual is an extension of the lower rituals or lower behaviors all the way up. So that you're like, oh, wait a minute. If I offer this up to God, if I offer this up to something which transcends my group or transcends, you know, the things down here, then I am in some ways bringing together all these little meals. Let's say that's. Let's talk about a sacrifice of food, all these little meals together. And so I'm giving, you know, I'm pouring out a libation or I'm giving up food to. To. To the ancestors or to the gods. And when I'm doing that, especially think about the ancestors, for example, is a good example. It's like, if I give something to the ancestors, then I am doing more than if I eat with my parents because I am binding myself to something which is bigger, something. Something which holds us all together. And so if I kind of play that out at some point, you realize that giving up to the gods, giving up to principalities which are higher above, whether it is something like paying taxes to the king, that if I pay taxes to the king, then it binds us together as a society. But if I pay taxes to a higher level, if I take my things and I bring and I give it up to a higher level, then it basically binds me up higher and higher. And you could imagine, you can see how people realize that at some point that kind of moves up and up towards more and more meaning until we reach something like the infinite source of all things, Right? The infinite source which is the, you know, the God that is being and non being. The. The God that is the. That is love, which binds the universe together. You know, the manner in which the monotheists start to talk about omnipotence, all of these infinite qualities which end up binding everything together. And so if I act together with others towards that, then I realize that it's an extension of, you know, paying taxes to the king and also binding together as a family, but also even within yourself. So it's important to kind of see how ritualization in terms of religious practice has to be seen in, let's say, the. The scope of all other types of behavior which are ordered. Now, once again, as I say this, you have to remember that all behavior is ordered. And so it's not like religious behavior is ordered, but this other regular behavior we do isn't. No, that's not true. It's like as you move towards religious Behavior, it's more and more ordered, more and more containing meaning. And as you move to the more common space, then it is ordered, maybe less. And the trade off is the trade off between meaning and power, universal meaning and particularity. That's the way to understand the trade off. And sometimes you actually need to make that trade off. It's not, you know, if you ritualize brushing your teeth in the same way that you ritualized the Eucharist or you ritualized a sacrifice to the gods, then you would lose some of the particularity. And so if it would actually become a, it would actually not be the right fit of ordered behavior. And the thing you're doing. A good example to understand this is to understand the way that martial arts develop themselves. So you can imagine that martial arts start as fighting, right? People are fighting, fighting, and they realize that if I order my fighting, if I, if I have a technique, then I can beat the other person because I'm kind of, I am contracting my behavior towards a certain thing. But then there's also a meta thing which starts to happen which is that if I understand certain rules, certain ways of doing martial arts, then I'm also going to limit the all out cost of fighting. You know, just even very similar to the way that animals ritualized behavior. So people notice that if in tribal warfare, for example, there is extreme ritualization, which means that there's still a fight, but often the fight, because it's so ritualized, it will avoid massive, massive casualties. Because the ritualization, you know, and, and it's kind of not even, doesn't even have to be conscious. People just kind of learn this behavior and perform it. The ritualization will be able to show who's winning the fight without completely decimating everything. So you can imagine that even in the world of martial arts, that will happen where certain behaviors are there to manifest. You know, let's say a kind of imagine like a knight, the way that the knights had certain ethics about fighting. It's like the gentlemanly way of fighting, right? You don't hit someone in the back, you know, you look at them in the face. All of these types of behaviors are there to avoid the massive cost of fighting and push it towards more meaning, but still keeping within the, the, the, the arena of beating your opponent. Now you can imagine that in the world of martial arts, especially in Asian cultures, people started to notice that if you ritualize martial arts more and more, it can encompass more and more meaning to the point where it also almost becomes a type of ritual behavior where it is almost metaphysical in the way in which the movements are capturing more and more meaning. You know, if you think of putting Taoist principles into certain Kung fu moves and kung fu forms, all of this is happening and so it moves towards, more towards more meaning. So that actually at some point the martial artist is transforming himself, he is learning about reality, he is moving towards higher and higher meanings as he is practicing his martial arts. Now one of the things that happened in the 20th century is that somebody realized that, that in terms of power, it was losing power as it was moving towards ritualization. So if you look at what the MMA fighters did is that they said, no, forget all these forms, forget all of these, these flighty things that you're doing when you're prepared, when you're doing your, your martial arts forms, it's like get to cut to the chase, use what you need to use in order to beat your opponent. And so what happened is that the MMA fighters were able to make a trade off between ritualization and power and they move towards power. Now this is something which isn't, there's nothing, it's like, it's not that one is better than the other, to be honest, it's just that it's a trade off between ritual and power. So think of an animal, imagine it out in the world of the animals where the animals have a ritualized behavior and they understand and they're, they're kind of dancing where one person show, you know, that, I don't know, the wolf shows its neck and the other one kind of comes and kind of puts their, their paw on the other and to show that they're, that one is submitting and the other is dominating. Now imagine if there was one wolf who was smart and said, man, forget all this rituals. It's like when the other wolf thinks I'm down and I'm showing my neck and he's put his paw on me, I'm just gonna go for the throat. And that wolf would win in the moment, that wolf, by breaking the ritual, the ritual would actually increase his power tremendously. But what would happen is, of course that would also lead to, let's say in the long term, if a lot of wolves did that, it would lead to the all out conflict between, between the wolves. And so this is the same thing that happened with mma and by the way, with mma, you end up having now a new ritualization which is that as you move towards more power, you have to have rules in the fight because obviously you don't want to kill your opponent. And as you move towards power, that possibility of just killing your opponent with one hit or in the right. Doing the right thing to kill your opponent becomes more and more possible. So the type of ritualization that happened in Kung fu or in some of the. In some of the more ancient martial arts gets re encapitulated in the meta rules of the fighting game, which is that you're not allowed to do this. You're now these things you're not allowed to do because you're just going to kill your opponent. And so the ritualization re establishes itself in another way. But what's important to understand is mostly to see just how it is to understand just this relationship between ordered behavior, moving towards more meaning, and then finding the balance of order and power. You say in a behavior in order to accomplish what it is you want to accomplish. And if you do that, then you can understand everything from brushing your teeth to going to church, because all of these ordered behaviors kind of stack up and scale up towards the transcendent, towards the infinite good that binds the universe together. Then all the way down to when I'm learning something new and I don't know how to do it. And so I'm experimenting and I'm kind of fiddling, you know, I'm trying to figure it out. So it's messy and it's. It's experimental. And then when I figure it out, I try to order it at the right level so that I can accomplish what it is that I need to do, moving towards the purpose of what it is that I'm doing. And so hopefully this is helpful to kind of help you understand a little bit how ritualization works and how it is better. And it's more productive for us to understand religion in relationship to all the other behaviors that we do, rather than isolating it when we isolate it, then we just look at these weird types of behaviors and these strange hats and strange costumes, and we're like, what's the point? But if I can tell you that you can make fun of the strange hat of a pope or of a bishop, and you think that that's funny, but somehow you still understand why you need a uniform to play sports, you know, it's like these are all different levels of the same reality. And why you would want the policeman to wear a strange hat, because you want the policeman to be recognized in his role as an authority, but you don't think that's weird, but you think that. That the pope wearing a funny hat is. Is hilarious and superstitious and ridiculous. That's how, if you're able to connect all these things together, then you'll be able to understand more appropriately why it is that religion looks the way it does. So hopefully this was helpful to understand this, to understand things. And don't forget, folks, you know, if you love what we're doing, if you appreciate what you're doing, please consider supporting the symbolic world. At the symbolicworld.com we've been growing quite a bit in the past few years. I now hired several people full time to kind of do this. And, and so all your support is there to make this grow as much as possible. So thanks everybody, and I'll talk to you very soon. Next year, February 29 to March 2, we are going to have the very first Symbolic World Summit in Tarpon Springs, Florida. There'll be some amazing speakers. Of course I'll be speaking, but there will also be father Stephen DeYoung of Lord of Spirits fame. You will also find there Martin Shaw, who's a mythographer, an amazing storyteller, but a bunch of other people, too. Of course, Richard Rowland will be there. Nicholas Kotar, Neil Degrade and Dirt Paul Robbins are actually going to play a concert. There will also be Vesper Stamper, but also a lot of other people involved in the symbolic world community will come together to explore how we can recover, rediscover the ancient cosmic image. But it'll also be a time for people to connect together, to meet in real time, in real space, develop relationships. You know, find people thinking in the same line as we are to further this community and to further this type of thinking and in the world. So I'm really looking forward to meeting you in person in Tarpon Springs, February 29, so hopefully see you there."}
