{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":0.4,"end":35.78,"speaker":"Jonathan Pageau","text":"Jp, you might have seen him on my channel. I've had a few clips where we're in a discussion. JP is part of a group of discussion that I have every month, a kind of private symbolism seminar for patrons. And JP is graduated, just finished his degree in philosophy. He's very keen, very smart. He has had some discussions with Paul Vanderklay, with also John Vervaeke. And so it was a high time that I had him on my channel. You will see in the discussion that we refer to some a video that I put up as a patron only video."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":36.02,"end":37.58,"speaker":"Jonathan Pageau","text":"I think that in general you'll get."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":37.58,"end":61.95,"speaker":"Jonathan Pageau","text":"A good sense of some of the deeper discussions that are happening in the realm of symbolism, how this relates to consciousness, how it relates to the way in which nature reveals itself, you know, just naturally. So we talk about the book of Ephesians, St. Paul, these ontological levels. There's a lot of good stuff in there. And I hope that it will be useful for everybody to follow this discussion."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":74.91,"end":112.68,"speaker":"Jonathan Pageau","text":"This is Jonathan Pageau. Welcome to the symbolic world. Hello, everybody. I would like to introduce to you JP Marceau. Some of you who follow the larger discussion with Paul Van Der Kolley, with John Vervecki, might have seen him around. He's been talking to a lot of people. I've been in conversation with him for about two years. We realize almost already he's been in my private discussions with other people. I've also met him a few times. One time or a few times?"}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":112.68,"end":113.28,"speaker":"Jp Marceau","text":"Yeah, one time."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":113.28,"end":201.55,"speaker":"Jonathan Pageau","text":"Just one time. He just finished his master's degree in philosophy. He works in the world of computers and he's really interested in Christian ontology and figuring out how the world lays itself out, how to bridge modern scientific thinking with, let's say, Christian metaphysics. And so he has a lot of insight to give. And so I thought it would be a great idea to have him on the channel. He also has his own YouTube channel now where he's looking especially at trying to use Panpsychism as a bridge between Christianity and science. Some of you might have seen him on my channel. I have posted a few clips with him as well. So. So, J.P. so, J.P. maybe you can start. We. Maybe I want to start right away and dive into the subject because this morning I tweeted something about the Book of Ephesians because yesterday at church I. There was the reading in the liturgy was the. The epistle in the liturgy was from the Book of Ephesians. And it really struck me. I mean, I knew the book. I'd read it several times. But sitting, you know, being in church, sometimes it hits you even more because you're surrounded by everything. And so it really hit me that the book of Ephesians was a very profound description of reality, and especially the way that we've been looking at reality in terms of symbolism and, you know, this hierarchy of beings and how bodies and minds fit together. And so I tweeted something about it, and then JP right away answered with a video that he had put up, like, yesterday."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":201.55,"end":205,"speaker":"Jp Marceau","text":"Was it last Friday or last Friday, just a few days ago."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":205.08,"end":219.08,"speaker":"Jonathan Pageau","text":"And so I watched a video. And yeah, in the video, he talks about Ephesians and how it's the best. It's one of the best books in the Bible that talks about this destruction. So maybe you can dive right in there and tell us what you kind of came up with and then we can start the discussion that way."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":219.48,"end":339.16,"speaker":"Jp Marceau","text":"Yeah, sure. Especially I added in that video I was especially talking about, I was leveraging some ideas from Rani Girard to figure out, especially the relationship in Ephesians where St. Paul says that, for instance, wives be submissive to your husbands. So you have the idea that the body is supposed to submit to the head, to the higher mind. But on the other end, he also says that the husband is supposed to lay his life down for his family, so that the head is supposed to sacrifice itself. And this really ties in well with ideas from Rene Girard, who claims that, well, if you look at any history before Christianity, any society before Christianity, the only way for people to really come together was to unite themselves against someone. They had to sacrifice a scapegoat, basically. And that was a recurring theme because it's not a stable situation. And then when there are precursors to this in the Old Testament, but when Christ himself came, when God became incarnate, what he did, what Christ did was to imitate the Father, to submit himself to the will of the Father, and to lay down his life for the church. And this. I mean, I'm going through this very quickly. Lots of people have heard about Nishirah by now, but the basic idea is that Christ showed that from the beginning of history, when people were uniting themselves against the scapegoat, they were really uniting themselves against someone was innocent. Whereas that was not clear before Christianity. People generally thought, generally in religions before Christianity, before Judeo Christianity, I should say that when the people were uniting against the scapegoat, the gods were really on the side of the community. Because indeed, after. After the community gathered together in one mind against the skiggle, because they did really call the situation."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":339.4,"end":344.04,"speaker":"Jonathan Pageau","text":"They actually did call the situation. It would create unity amongst the. Amongst the people."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":344.36,"end":433.83,"speaker":"Jp Marceau","text":"Yeah. So afterwards, people really did think that, well, that person must have been some sort of demon or some sort of bad God for having had all that power really, to really cause that problem and to resolve it once we kill that person. But when Christ died and then resurrected, he showed that God was not on the side of the perpetrators of those who crucified him, but was actually on the side of the victims of the scapegoat. So this really forced people to. Yeah, so this showed. This opened the eyes of people that for all of history, people had been aligning themselves behind fundamentally the mind of Satan. They had been uniting themselves in the body of Satan under the mind of Satan. But what Christ does is he reveals that mechanism, that this was. This was an evil mechanism. And also he shows the way out of it. And the way out of it is to imitate Christ is to, as I said, submit to the Father. So you imitate the Father. And what we are supposed to do is imitate Christ. Instead of trying to lower our aim and to imitate or model our desires after something earthly, we are supposed to model our desires after Christ, who models themselves, models his desires after the Father. And we're also supposed to sacrifice ourselves for our bodies in the same way that Christ did for the church. And I forgot one thing in the video and ties in with what we discussed in our last Patreon discussion a few weeks ago. Yeah."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":433.83,"end":449.67,"speaker":"Jonathan Pageau","text":"So just to say so, some people did, I guess. Some people. I put it up as a patron only video where it's a crazy video where JP is there with me and we're talking about, like, all this symbolism. Anyways, I don't want to go but too much into that. It's like it lasts like an hour. But try to be concise if you're."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":449.67,"end":539,"speaker":"Jp Marceau","text":"Gonna go into that. I'll do my. The part I missed in my video, I realized, was the charity. So when. So, okay, so Christ came from the Father, came from heaven. So he lowered himself, sacrificed himself, became man, became a sacrifice, and then was raised up. But he also united people in charity. So when he was human, what he did was to unite people. When he was resurrected, he united people. When he was alive, he was fragmenting people in many ways, setting brother against brother against son. Yeah. And so on. But when, after his resurrection, people started to come together, especially in the church. And St. Paul really stresses charity for this. And I think this. This ties in really well with a Deep metaphysical fact. I think that. Okay, so it seems. The way. The way this seems to work is for something to hold together. Well, let's say the church, to hold together for the. For the earth, really, to altogether, you need. Okay, you need to model yourselves after the desires of the Father. So after God, you need to imitate, you need to follow the higher mind. The higher mind, yeah. So you need to follow that. And then you sacrifice yourself for the people you're responsible for, for your body. But in that body, that body works in charity."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":539.64,"end":578.42,"speaker":"Jonathan Pageau","text":"Yeah. So there's also. So there's a vertical relationship. And those who follow the videos will heard me say that quite a while. Like that there's submission coming from below and love coming from above. Or sacrifice is a good way to understand it as well, since that you give yourself and you kind of empty yourself for that which is below. But then across, let's say, amongst the body, in the body itself, there's also. It's through this conjoining in love that St. Paul talks about in Ephesians, the fitting of the parts of the body together and this working in love. And that is also. It's also an aspect of that very process of the vertical relationship."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":578.9,"end":649.62,"speaker":"Jp Marceau","text":"It's all coming together, sir. And this is what is happening in eating. And that's the link I want to make to your video, to our discussion. Rather than when, let's say I am. I am one, I am the higher being. When I'm. Let's say I'm eating an apple, I am the higher being, and then there's an apple. Okay? For me to eat the apple, all of my cells have to work in one. They have to work in charity, pretty much. They have to, you know, some cells give some chemicals, the other receive them. There's a whole harmony in my. In my body, which is working in harmony. Okay? And then when I eat the apple, I will. I will ferment it. I start by chewing, by chewing on it. I keep the. It goes into my stomach and it keeps fragmenting. And crucially, there's a point where I didn't want to go too much into the right hand, left hand. But I think it's worth talking about vigor and mercy. Yeah, Just this. When I'm. Okay, when I'm fragmenting the apple, I'm applying vigor on it. I'm not accepting it. I'm just keep breaking it down."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":649.62,"end":650.74,"speaker":"Jonathan Pageau","text":"Yeah, you keep breaking it down."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":652.98,"end":750.74,"speaker":"Jp Marceau","text":"Yeah. And I'm just on myself. I keep mercy. I just keep together, working as one unit. But there is a Point where in order for me to digest the apple, I actually have to do some work or some sacrifice. There are parts of my cells which are going to give away some molecules. They're going to give away some parts of them, maybe even full cells, I don't know, will go and finish dissolving the apple to keep breaking it down. So there's a flip that occurs there. So in the beginning, I was just applying rigor on the apple version myself. There's a point where in order for me to digest the apple, I have to start applying rigor on myself as well, where I separate part of myself. And after this, this keeps tormenting the apple. And then the flip continues. Where then now that the apple is dissolved enough, I will absorb some parts of it. I will apply mercy on that part of the apple, and then my body will come, will keep working in harmony in order to spread that energy. My cells will keep working in charity, not to spread all that. That. That energy, all that good stuff. And I will ultimately excrete the remainders of the apple with what I've sacrificed, the molecules that I've sacrificed. So there's a flip that happens in levels where initially I was just. It was just rigor on the side of the apple and mercy on myself. At some point I have to apply rigor on myself, and then I'm able to apply mercy on the apple, apple."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":750.74,"end":751.74,"speaker":"Jonathan Pageau","text":"In order to absorb it."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":751.9,"end":812.41,"speaker":"Jp Marceau","text":"Yeah. So there's the idea, I think, that in order for a unity to enter into communion with another unity, or you have to dissolve one into multiplicity, and then at some point, you yourself, the unity, has to give something away to become multiple so that it can keep fragmenting the other one. And then the multiplicity can be integrated into the first unit. And I think there's something similar going on with. I think this works at many levels. So we can see this in Genesis, I think, when, okay, so initially there's God creates the heaven and the earth, and ultimately the link will be, I think the same way that, let's say I am eating the apple. You want Evan to eat the. The earth in a way. You don't want the event to inform the earth."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":812.41,"end":829.05,"speaker":"Jonathan Pageau","text":"That's really important. It's important to understand that that's also what a sacrifice is. A sacrifice. When you burn the meat and it goes up like the smoke goes up into the heavens, it's an image of heaven eating the earth or smelling. They usually use the word smelling, but it's integrating, it's bringing into itself."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":829.37,"end":916.14,"speaker":"Jp Marceau","text":"Yeah. And so I Think this is what was going on before the Fall, where, okay, so God separated. He created the Earth. And in the beginning, the Earth is one. It's just one ball of chaos. And then God keeps separating it, so the Earth keeps separating. And then he will put man in such a place that there can be an harmony in charity between all of the species, all of what exists on the Earth. And crucially, there's a point where man will work, will do a sort of sacrifice, where he has to tend to the garden. He has to actually. He has to give away some of himself, some energy, so that he can then take the fruits of the garden, the fruits of creation, really, and unite them and turn them to the Father, to the iron mind. So you have the same pattern as we did with eating, where what Adam does is he models himself after all of creation is like ourselves. It's working all together. And it's all following the higher mind. It's all following Evan. And crucially, there's a point of it. There's a point in all of that creation working in charity. There's a point of it which will have to sacrifice. That's what Adam and Eve do when they tend to the garden, and then they get to eat of it. So they sacrifice themselves. And then there's a sort of resurrection where they get to read the rewards of their work. They turn that towards God. So there's harmony there. You think it makes sense so far? Because."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":916.22,"end":997.81,"speaker":"Jonathan Pageau","text":"Well, I think I understand. I think there's something makes sense. I think that we have to account for the fact that work comes after the Fall. Like, it's not clear the difference between tending in the. In Genesis narrative and then that in the Fall is when God says that you'll have to work in order to receive. But I think that. I think that the main. That the main. I think that if we see it in a cosmic vision, like, if we. If we see it in a cosmic vision, and that's sometimes hard to see, but if we see it in the whole story, it seems like that's what happened. That in fact, although the Fall is a scandal, the Fall participates in the whole process of bringing all into God. You know, ultimately, it's like, so man falls down and starts to give. Have to give of himself, let's say, as he's. As he's falling down all the way to Christ, which. Who gives himself completely. And then everything gets gathered back up and goes in. And so there is sometimes a. Even in St. Irenaeus, you do get a bit of a sense that the Fall is a kind of pedagogical thing, that although we won't say that God wanted us to fall, that he knew it was going to happen, that it was, it was part of a larger story that we don't totally understand."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":999.65,"end":1020.88,"speaker":"Jp Marceau","text":"Or even maybe, maybe it turned out, especially after the Fall, that the sacrifices had to get larger and larger ultimately in Christ. But even before the fall, when let's say Adam is created, there's some work there. I mean, it's light. But God does, yes, gathered the earth."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":1020.88,"end":1023.92,"speaker":"Jonathan Pageau","text":"And there's for sure there's work because then it says God rested."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":1024.08,"end":1025.64,"speaker":"Jonathan Pageau","text":"So for sure there's an analogy to."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":1025.64,"end":1177.3,"speaker":"Jonathan Pageau","text":"Work in creation itself. That is, that is for certain. And so there is, you could maybe just, we could just call it a different of levels probably between before the fall and after the fall. And I think it's also because in after the fall, the way it's presented is that it's like it's a, it's an upside down process where man becomes a slave to work. Like he becomes a slave to the lower things rather than, you know, kind of voluntarily engaging, let's say, with creation. So maybe that's the best way to understand it. Yeah, no, that makes sense. I think it makes a lot of sense for people who are kind of, we're kind of not maybe totally following the discussion. The idea that I've been presenting, if you follow my videos, you've heard me say something similar for a while. The idea is that this image of Christ and the Last Judgment and Christ bringing things towards himself and pushing things away from himself. What I've been trying to kind of propose is that that is an actually an image of how reality works. It's not just an image of the Last Judgment, it's an image of the totality of being. And so everything has, everything that exists has an outside and an inside has a margin and a center. And therefore there is a process by which it integrates things and it rejects things. And that bringing in and pulling out seems to be the manner in which the world works. And so we see Christ talk about it. So when you start to understand that, when you understand that, let's say eating is an analogy to the Incarnation, then you can understand things like when Christ says that St. Peter is going to be a fisherman, a fisher of men, that he's going to fish for men, right? And so, and so you can imagine, so Peter is in the boat and he goes and he. And he tosses in his net and he pulls up human beings out of the water in order for God to eat them. You know, that's what it is. In order for them to become God's body. And so, you know, all the imagery of the fish in Christianity seems to relate to that, the idea that we are, I mean, you can use it. The Bible mostly uses sexual imagery in terms of being united with God, but you can also use the imagery of eating. And I think that for sure fish has to do with that. When he says that Peter is going to be fishing for men, it's like bringing them out of the chaos, lifting them up in order for them to become an aspect of the body of God."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":1177.3,"end":1205.98,"speaker":"Jp Marceau","text":"Yeah, yeah. And I think there's something that can help with the Trinity there as well. You have the one which, you have the iron mind and then you have part at some in the body, then some part of it will have to sacrifice. Then as it's reborn, there will be charity across that body. That body will actually work. So you have really like the Father, the Son and then the Holy Spirit. Yeah."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":1205.98,"end":1233.36,"speaker":"Jonathan Pageau","text":"And in Ephesians, St. Paul traces it. He says he actually traces this like three dimensional cross in his description. He says, he says the height, the width and the breadth of the love of God. And so if you can imagine it as like, as an actual, as an, as a, let's say a spatial system with an axis and two horizontals, like. Yeah, he seems to really be talking about the shape of reality in Ephesians. So everybody has to read Ephesians when they're done with this video."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":1235.75,"end":1286.47,"speaker":"Jp Marceau","text":"Yeah, especially since it's so short and it can help with. I mean, I just watched your video with John Verbi today and of course I watched parts of it. I rewatched several times. Parts of it. But this can help with relevance realization as well. I think you have the one which has two. It's still easy in my mind, but I think there's something there. You have the one, you have the Father who creates. Who creates something, who sees all the possibilities in it, all the multiplicity and who has to send his Son to bring it all together in love towards the Father. It seems to be our reality works. And it works with eating, it worked with Genesis, and I mean, we could give tons of examples. It seems to be how everything works."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":1287.27,"end":1350.59,"speaker":"Jonathan Pageau","text":"No, I think so. I totally agree. I really do think that the book of Ephesians really describes how reality works and how. Because this has been the problem, the big problem that we've been having, that not just you, but a lot of people been having is to understand how reality moves up the levels, how it is possible for things to exist at different levels of reality now, you know, and so it seems like this type of thinking, this notion of sacrifice from above, the idea of submission from below, and also the gathering and the joining in love, seems to be the. One of the best ways to understand how things jump or move up levels in the. In the ontological hierarchy. So how. So how you have a person that is joined, you know, that is made out of all these parts, all these different thoughts, all these different feelings, all of this and. Or then. And then how people come together in order. In order to join. Join to form larger groups and to form bodies in terms of communities and stuff."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":1351.15,"end":1387.31,"speaker":"Jp Marceau","text":"Yeah, of course, this ties in with panpsychism, especially when you start talking about how people come together as a whole and you've talked about passions a bunch of times on your channel, but ideally in a person, just for you to exist correctly as one, you need to have all your passions oriented in charity. They all have to work together correctly. Your passions aren't necessarily bad. It's bad to fault on them, but they're good if they're organized in charity. But for this to happen, for all of your passions to be subordinate to your mind, to the art principle, you will have to sacrifice some parts of yourself, for sure."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":1387.47,"end":1414.01,"speaker":"Jonathan Pageau","text":"Yeah, no, exactly. And that is exactly when we talked about rigor and mercy. This is where it all falls in, is that the pulling in and the pushing out is always happening simultaneously. So like when you talked about eating the apple, like, in order to integrate the apple, the apple has to lose some of its idiosyncrasies or else it won't be integrated, you know, and that's the same with any."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":1414.01,"end":1414.49,"speaker":"Jp Marceau","text":"Anything."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":1414.49,"end":1484.96,"speaker":"Jonathan Pageau","text":"Like a friendship is the same, you know, if you want to be friends with someone as you kind of come closer to that other person, you have to give up some of your idiosyncrasies in order for the common space to appear. You know, if you just. And you can see it like people who are. Who are stubborn and just hold on to their thing, then they struggle to be in teams or they struggle to be. To be in a relationship. And so, you know, it's like you have to find that sweet spot between having a kind of integrity, you know, like this kind of integrity that you want to have about yourself, but then also being in a relationship with and giving up some things in order to enter into communion with someone else. And that seems that play, that interplay between, you know, bringing in Pushing away seems to be, like you said, on the horizontal sphere. That seems to be the way that we interact it with friends and with family and everything. And that's how we kind of conjoined together. And then it's. It also ends up being the same. And how we form something higher, like how we form the body of Christ, for example, is that that very process is the manner in which we also are sacrificing our idiosyncrasies as a group in order to manifest this higher purpose, this higher thing."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":1485.04,"end":1527.3,"speaker":"Jp Marceau","text":"And one way, maybe, one thing maybe is it's not us being united in charity. Together we can make space for this higher principle for God to. Yeah, to sacrifice Himself for us. This is what happens at every mass or the liturgy. To sacrifice Himself for us so that we can better come together under Him. So there's really work done by the higher principle. There, There can't just be sort of charity across for the unity to work even. I mean, you can take lower examples like my cells. My cells can't just exist as a. As a bunch of cells. They have to be united under, under me, and I have to work to create."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":1528.26,"end":1532.5,"speaker":"Jonathan Pageau","text":"If you put, if we take care of all your cells, put them in a blender, they're not. It's not going to be the same."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":1532.5,"end":1542.05,"speaker":"Jp Marceau","text":"It's not going to be the same. Yeah, so there's really a place for the, the iron principle, for the iron mind. And. Yeah, so we make space for that every time we go to church or Divine Liturgy. Really."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":1542.05,"end":1670.14,"speaker":"Jonathan Pageau","text":"Yeah. And I think that that's the most important thing that comes out of this. And this is also something that I talked about with John Vervaeke today, is the idea that we have to be careful not to see it only one direction. Right. So let's say the modernists right now when they talk about this and talk about complex systems, they only want to talk about emergence. They only want to talk about this, the lower process. And for me, it's funny because I'm. I'm actually now discovering the other part because I was all top down from before. Like I was all a Platonist, you know, just a Christian Platonist. And so, and so now it's like I. Now I'm happy actually to have discovered this because now I can kind of see the importance of the, of the conjoining in love. But you can't. It can't just be that, like you said, that there also has to be. And I think the idea of the sacrifice is a great idea. There's also something which has to come down from below and be willing to come down and manifest itself in a body, you know, and so. And that's the same like if you think about. If you think about a team, let's say. Let's say you're. You have a purpose. It could be anything. Let's say you're managing a project and you have a logos, you have a telos, you know, you have a purpose. You have a reason why you're together. And so it's the same. It's like that reason. It. It also can't be completely pure. Like, it can never be. It can't. It can't remain completely sharp. It has to mitigate. Like, it has to kind of fall into the specifics of the people who are. And it has to be pliable enough in order to accept the. The differences that, you know, the fact that this is like, if it was made by another team, in the end the final result might look different than. Than this team, you know, so. And so the purpose has to have enough, give enough back in order for it to be able to reach its goal. You know, if the. If the goal is so tight, then it's. Then it won't. Let's say that the joining of heaven and earth won't happen. You know, the goal will remain aloft and will never reach it because it's too. It's just too tight. I don't make sense."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":1670.38,"end":1685.3,"speaker":"Jp Marceau","text":"I don't know that. I thought Tulsi got that. There's definitely one part. One thing that came to mind was that for the abstract ideal, let's say for the plan of the coach to manifest itself in the players, it's to."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":1685.3,"end":1686.42,"speaker":"Jonathan Pageau","text":"Take the players into account."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":1686.9,"end":1708.2,"speaker":"Jp Marceau","text":"Yeah. It has to somehow enter into that multiplicity. It has to reach down to a point where, I mean, the coach will have to say it as an individual. He has to say the plan to all the players. So the plan can become incarnate through. And, yeah, through some sort of work by the other principal to the coach. He has to think about the idea how he's gonna say it, how he's gonna put it, and so on."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":1708.2,"end":1724.8,"speaker":"Jonathan Pageau","text":"And then not just that, he has to understand, like, I have this player. I have this player. I have this player. And so if I, like, this is how I can do it, considering the fact that I have this body. Like this is the body that I have. If I design a play that cannot."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":1725.45,"end":1725.77,"speaker":"Jp Marceau","text":"Yeah."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":1725.93,"end":1738.17,"speaker":"Jonathan Pageau","text":"Held by this body, then it's gonna fail, even if it's the best play in the world. But If I don't have what I need in the body to accomplish it, it's not going to, it's gonna play. So there, there has to be, like you said, work coming from down, from above and from below."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":1738.57,"end":1738.97,"speaker":"Jp Marceau","text":"Yeah."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":1738.97,"end":1806.52,"speaker":"Jonathan Pageau","text":"So. So those two things together that seems like. That seems to be what. And so the identities in the world, let's say like any identity, like a maple, you know, it has enough pliability so that the maple can exist in different places like it. But there's a limit, right? There's a limit, there's a scale. And so the maple can exist in certain types of soil, but there's enough multiplicity for it to exist. But then at some point, at some point it stops. Like you can't. If you plant a maple in the tundra, it's not going to grow, right. It's just not going to grow. But the identity of maple isn't so, so tight that you can only plant a maple, you know, in, on, on 10 square feet of the world. And if you, if it's not in that exact precise thing, then it's. It's going to be a great. It's going to be the greatest tree ever, like, ever. It has to be planted in this 10 foot zone in the, on the entire earth and or else it's not going to grow. Like that's not, that doesn't work. It's not going to happen. There has to be this, this play. I don't know if that makes sense that I'm bringing it down to maples, but I'm just trying to see how it, how this works on the different levels of reality."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":1806.92,"end":1812.92,"speaker":"Jp Marceau","text":"Yeah. And I don't know if we would be ready to talk about the flip, but I'd like to try at least."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":1813.96,"end":1824.12,"speaker":"Jonathan Pageau","text":"All right. We could try just that. I think we have to lay down some ground a little bit in terms of what the concept is. So did you want. You should try it? It'll help me see if you understood what I talked about last time."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":1825.08,"end":1834.08,"speaker":"Jp Marceau","text":"This is it just for my symbolism webinar. But I think this is sort of what occurred in the digestion I mentioned. Okay."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":1834.56,"end":1836.4,"speaker":"Jonathan Pageau","text":"You have to explain it first. Like you have to explain what the."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":1836.4,"end":1838.24,"speaker":"Jp Marceau","text":"Idea is of the inversion."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":1838.32,"end":1840.08,"speaker":"Jonathan Pageau","text":"Yeah. Like for people who are watching this."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":1840.08,"end":1846.88,"speaker":"Jp Marceau","text":"Yeah. Well, I'll explain it in the digestion first. Okay. Then I'll try to talk about the angels. All right. Okay."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":1848.24,"end":1858.84,"speaker":"Jonathan Pageau","text":"That sentence can exist anywhere besides in our conversation. I'm going to start with digestion and then I'm going to say how it works. With the angels. That's awesome. All right, all right. Go for it."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":1859.16,"end":1929.64,"speaker":"Jp Marceau","text":"Well, you know, at the level of full objects, like human or apple. No, I'm just applying rigor. At the highest level initially, before I start eating, I'm just applying rigor. And it's only at the lower level. Once I reach the level of maybe not even cells, but molecules, when I give away some of my molecules. This is the point where the merci and the rigor flip, where I will apply rigor to myself instead of applying rigor to the apple to keep the apple away. I mean, I chew on it, but it's still a weight. It's not in me, really, until I flip at the level of my cells and my molecules and I give some of me away, I separate myself. And then this will keep fragmenting the apple. There's still rigor on it. And then it flips also on the side of the apple where I start to apply mercy on the apple. And I will bring it into myself, integrate it. Yeah. So the flip occurs once I reach a low enough level. So this may be why in the icon you showed that's in the iconostasis."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":1929.64,"end":1961.67,"speaker":"Jonathan Pageau","text":"Nobody knows what you're talking about. You have to be more explicit. Let me just lay it down for me. So my condition tension is that one of the reasons why we don't understand the move of different ontological levels is because we only want to understand it as, like, a coherent relationship between the two levels. But my contention is that it seems like there's actually a flip that happens where what is above actually turns for what is below. Like a mirror or something like that."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":1961.67,"end":1961.82,"speaker":"Jp Marceau","text":"And."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":1961.97,"end":2001.08,"speaker":"Jonathan Pageau","text":"And so. And so. And it's related to the idea of. It's like a change of perspective where if I'm standing in front of you, if I. If, like when we shake hands, we cross over, so my right hand goes across, and your right hand comes and meets me. And so it seems like that which is pushing away from me and pulling towards me on above ends up flipping upside down below. And so that's what Jean Philippe is talking about when he says, it's like if I'm eating the apple, at first, I'm breaking it down. I'm fragmenting it. Right. And. But then at some point, there's a change where I have to. I have to now gather it into myself. Right. So there's this flip that happens at some point. So now go ahead from there because."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":2001.32,"end":2110.38,"speaker":"Jp Marceau","text":"Yeah. And it happened as we went down the hierarchy of being at some point, for me to have Ultimately, mercy on the apple and eat it. There has to be a flip at the level of the. Of the cells where this is. This is the level where finally I can. Yeah. I have to have rigor on myself in order to be able to have mercy on. On the apple. This happened at the level of the cell. Couldn't happen. Couldn't. Couldn't have happened. Just my. My level of me. GP so you have the. The IR principle. For the IR principle to ultimately eat the apple, you need for the art principle to ultimately really assimilate the other unity, you will need to have mercy on it at some point. But this doesn't occur at the scale of the whole human. It occurred at a lower scale. And this may be what happened, because in some icons, you will have, for instance, St. Michael on one side, who is on the side of a rigor. Yeah. As a weapon, generally. And then on the other side, you have St. Gabriel, who has some sort of flower, who is on the side of mercy. And then there'll be icons where. So you have St. Michael, St. Gabriel, then you have Chris in the middle. And then Christ will be judging the goat and the sheep. And so you would expect. Let's see, if St. Michael, the rigor is here, you would expect him to be over the goats. The goats, yeah. Who get thrown away. You would expect rigor to cast away the goats. People have to be familiar with revelation to understand this. No, it's not revelation."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":2110.38,"end":2112.5,"speaker":"Jonathan Pageau","text":"No, it's a Christian. It's one of Christ saying."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":2112.74,"end":2160.69,"speaker":"Jp Marceau","text":"Yeah, it's in Matthew, I think. Yeah, okay. Yeah. So you would expect the angel of rigor to be over the sheep, and you would expect conversely. Yeah, sorry, the golden. Conversely, you would expect the angel of mercy, namely Gabriel, to be over the sheep. But it's actually flipped in the images. And this may be because at the level of angels in heaven, this is the higher level. And then the flip occurs through Christ, through the. In the analogy with the body, it could be like the rigor and mercy would be the angels at the level of the whole human. Then the flip occurs at the level of my cell. And then you would have the molecules inverse. So you would have. Let's say that you see what I'm getting out of this."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":2160.69,"end":2194.19,"speaker":"Jonathan Pageau","text":"Yeah, yeah, no, I see what you're saying. I don't think what you're ultimately advocating is for some kind of apple purgatory. I think is what you're advocating for the purgatory of apples. He's like, oh, man, where did you. How did you go with that he's like, I didn't expect that one to go, all right. But I'm hoping people can follow. I'm going to show. I'll show the icon so that people can kind of see this flip. But yeah, so I think you wanted to try to apply to something. Is that where you wanted to apply to angels? That's the point."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":2194.19,"end":2194.51,"speaker":"Jp Marceau","text":"Yeah."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":2194.51,"end":2194.79,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":2194.79,"end":2201.79,"speaker":"Jp Marceau","text":"There was no point where. I think that's the reason why the angels are flipped in at least some icons. Not always as you."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":2201.95,"end":2238.96,"speaker":"Jonathan Pageau","text":"No, but it's one of the first image we have of the Last Judgment. That's what is there in Ravenna. You see the red angel on the side of the sheep and then the blue angel on the side of the goats. And I was always been very annoyed about that. But then I think I finally understood that there's this cross and there are many places in scripture where you see this crossing over. You see it in the blessing of Jacob, who blesses Joseph's children. And he crosses his hands like this when he does a blessing. And even, you know, Joseph, like, uncrosses his hands, but then he crosses them again. He's like saying, no, this is how."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":2238.96,"end":2239.44,"speaker":"Jp Marceau","text":"It has to go."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":2239.44,"end":2247.28,"speaker":"Jonathan Pageau","text":"Like, I have to cross over. And so there's this, this, this. This sense of this, this flip that happens at the different levels of being."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":2248.08,"end":2324.87,"speaker":"Jp Marceau","text":"Yeah. And maybe we can see if it. See if the pattern works also in the. The incarnation. Okay, so let's say we take still. Still heaven and earth as before the fall, and we try to see how Christ will come to play. Take the place which Adam had. So I guess the. The idea would be that in order to restore the. In order for Evan to eat the. The earth was in rebellion. Who is not aligned with. Not working in. In charity. Yeah. You needed God to become. Oh, it probably works with the. We have to talk about Israel somehow Israel has to fit somewhere in there. So let's say you have in creation. Maybe instead of talking about species, we should talk about different groups of humans, different cities or different tribes. And among them you have Israel. So Israel has been. God has been merciful towards Israel and has separated it from the others. So God has been sort of applying rigor on the other, separating it and having mercy on Israel. But it will flip with Christ."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":2326.15,"end":2329.83,"speaker":"Jonathan Pageau","text":"That's what Paul says. At least Paul seems to say that's what happens."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":2330.15,"end":2377.12,"speaker":"Jp Marceau","text":"Yeah, I mean, God will have rigor in Israel. He will sacrifice part of Israel. He will sacrifice Christ in order to have mercy ultimately on everybody else. Yeah. So the Christ. Yeah, so The Jews will sacrifice Christ, will sacrifice Israel, and the whole world will sacrifice Christ. Then he will die, be cast away. And then as he. As he comes back to life, this is sort of like when, let's see, in the body, when the molecule which was given away or the soul which was given away, so is created back again. Maybe. There's probably an analogy to do there, but I don't want to stress it too much. But then when Christ comes back, he will unite, ultimately the whole world."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":2377.36,"end":2416.93,"speaker":"Jonathan Pageau","text":"Yeah. Well, there's a text in St. Paul, I think it's in Romans, where he talks about. He tells the Romans who are the pagans and who will ultimately become the image of the church itself. Like even all churches model themselves on Rome. He says that, you know, Christ is the tree, you are the branches, you have been added. So the Jews have been cut off, you have been added in, so you've been brought in and they have been pushed away. And he says, but don't boast of that. Like, don't think it's to you, because who's to say that one day God will not cut you off and then bring back the Jews?"}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":2416.97,"end":2417.13,"speaker":"Jp Marceau","text":"And."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":2417.44,"end":2594.03,"speaker":"Jonathan Pageau","text":"And then he says so that no one can boast and so that all can be saved. That's where he says it, that all can be saved. It's like, oh, okay, okay, man. I've been thinking about this text for so long, trying to understand this relationship between this bringing in, pushing out and this inversion that happened. Because to me, this was. I mentioned this in the patron video. To me, this is also about understanding the story of Christianity because there are some very strange things that happen in the story of Christianity. One is exactly that. One is the Romans are the bad guys in the story, especially in the Gospel, the Romans are the bad guys. They're persecuting Israel. They're putting false gods in the temple. They're trying to take over. And then it flips. And so Rome becomes Christian, Rome becomes Christian, follows Christ. And then it's like this. So it's like this weird inversion. And in Romans, in the story of Christianity itself, there's also this inversion in the sense that you get. Christianity enters into the Roman. Into the Roman world through the lower caste, like through the slaves, through women, through people who have nothing. And so those are the ones who are Christians for like three centuries. And then finally, suddenly, like all of a sudden, it flips. And then it becomes the emperor who converts. So it's like, it's. So it moves from being like a. Not only it was the Only religion in. I think. I think. I think Manichaeism and Christianity were the only religions that were outlawed in. In Rome. And so you have. So you have the Mani. The Manichees and you have the Christians who. The Maniches also were kind of weird Christians. Like they, they were. They were heretic, but they, they kind of saw themselves as fallen Christ somewhat. Whatever. I don't want to argue that here. But, but so, so they, they go from being the complete outside to then becoming the religion of the empire. I mean, that flip is crazy. Like, that's a crazy flip. And it. I think that it, it's. Once we start to understand how these flips occur, there's so many keys that, that, that so many ways that people see the world which is wrong. Like they. When sometimes you hear people argue in terms of history, they'll argue something, for example, in terms of Israel, they'll say things like, for sure, Israel was influenced by Mesopotamia and Mesopotamia could not have been influenced by Israel because Mesopotamia is the empire and Israel was this little thing that had no power. It's like, you know what? Actually, I don't think it works that way. Actually, you know what? I don't think it works that way because we have an example and it's our example and it's Christianity where this marginal foreign religion suddenly flipped and then became the religion of the empire. Why don't you think that could have happened before? Like, why is it the only time in all the history of humanity where that happened? I don't think so."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":2594.35,"end":2617.8,"speaker":"Jp Marceau","text":"Yeah. Yeah, yeah. This. I don't know if I'm really into something with my apple thing, but it seems to be what happened there where what was just the apple was ultimately what was. What was what kept. What just kept getting fragmented and multiplied was ultimately integrated and became, you know, your body. Part of me really. It really became part of me."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":2617.8,"end":2631.72,"speaker":"Jonathan Pageau","text":"Became you. Like, it became your. Your incarnation. Like everything that you are had went through that process. Yeah, it's like your whole body is. Was at some point food. Like it had to go through that process in order for you to exist."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":2632.17,"end":2689.73,"speaker":"Jp Marceau","text":"Yeah. And I really had to sacrifice part of myself to actually digest that. So Israel, which had been chosen, sort of like Israel was chosen to ultimately integrate the whole world back into heaven. So it's not surprising that, you know, initially God had mercy on Israel. It sort of kept it separate in the same way that maybe I kept. I keep some. I mean, some. My, let's say digestive cells, I keep themselves. I keep them apart from. From the Apple, I keep them, actually. I think we probably do some special things in order to keep them. They're probably precious somehow, but I had to isolate them and then at some point I give them away so that the whole thing can actually be reborn. The whole organism can be united. So it really flips there what looked like mercy, you know, me really being careful with my cells actually turned out to be. At some point it had to turn into rigor so that I could assimilate the whole thing."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":2689.73,"end":2690.61,"speaker":"Jonathan Pageau","text":"Apple itself. Right?"}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":2690.61,"end":2693.21,"speaker":"Jp Marceau","text":"Yeah, yeah."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":2693.21,"end":2755.99,"speaker":"Jonathan Pageau","text":"No, I mean, I think. I think that. I definitely think that this is. That I'm hoping other people are going to start to think about this because it's hard to think about, but I do think that this could really be. Could help people. Not just in terms of religious thinking. We're using a lot of religious imagery because that's what we care about. But I think that in terms, just in terms of understanding the jump between the different levels of reality, I think that understanding that exchange can be useful and we see it. I mean, Matthir talks about it in his book to a certain extent and I just feel like I've intuitively understood it very recently. And so I'm pretty excited about that discussion. So. Yeah, so, I mean, I think people should definitely in the comment section go wild and we'll try to be involved in the conversation. What's great about these videos is, is that all the trolls, they don't watch these videos like they watch. They watch movies. You know, the Joker video, that's when they watch her. But this video would be only people that actually care about this stuff that'll watch it. So I expect a really great discussion."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":2755.99,"end":2806.67,"speaker":"Jp Marceau","text":"In the comment section and it seems really to fit, I think again to come back with. I just keep coming back also with your conversation with John Vecky today because you have on some point you have. You need the. Okay, so there's two extremes in creation. There's heaven and then there's the earth. The earth is sort of just bare potential initially and it has to be separated. It has to be multiplied to be taken up into heaven and fits well, I think, with relevance realization that what is invisible, the higher, the one has to sacrifice, has to do some work as to sacrifice as it becomes part of the multiplicity, as it reaches all the way down to the most fundamental ground of possibility. So that it can then take it back up."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":2806.91,"end":2935.72,"speaker":"Jonathan Pageau","text":"Yeah, but the taking back up, I think, is really the Christian version. Because if you look at most. Most systems, not all, but most systems, they tend to see that process of the higher coming into the lower as in itself a fall. Like, in itself a kind of degrading of the higher principle. And so, you know, Gnosticism, even in Hinduism. And so you see this idea that it's like the lower beings are less. Like they're less. But I think what Christianity brings and what Christ shows is actually this process is the manner that. By which the entirety is brought back up into the one. Like, that's the actual process of how things are brought into God. And so it ends up giving value to the littlest one. It ends up giving value to the smallest to the extent that it's able to join together in love and participate in this process. So I think that that's one of the things that Christianity really does offer to this question, because we do run the problem every time. And I see it because people are afraid when I talk about hierarchy, and I understand why they're afraid. They have a certain reason to be afraid, because hierarchy can be a dangerous thing, and it can be a reality which sees only the idea of the lower as serving the higher. Or then. Or then if you. If you don't accept that, then you end up having this constant revolutionary thinking where you're always trying to break up the higher. Break it up, break it up, break it up. You reach the end of that. I think we've reached the end of that pretty much in terms of thinking where, like, okay, like now we're in this chaotic mush of thing. We don't have. We don't. We're losing the qualities, we're losing the identities. We're losing the things that brings together. And so we need to find them again, but we need to do it in a way that won't. That won't be just a sword coming down from heaven, you know, Because I know that's what some people actually want, and that's not what we want. That's not what I want."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":2935.96,"end":2991.13,"speaker":"Jp Marceau","text":"Yeah. We have to keep in mind that also the sacrifice wasn't arbitrary. There are times when Christ angers a bunch of people, and then he runs away and he gets away. He chose the moment where he had to sacrifice himself. Like when I. Let's say I'm eating. I don't sacrifice just everything to dissolve the apple. I sacrifice the right thing so that I can actually come back together. It's not trivial for what allows people to actually come together. And there seems to only be, as Girard would say, there seems to be only one way for people to actually come together for good in a way that won't just fragment again. And it has to be towards the highest. And it has to come with the help of the highest, showed us that way. Otherwise it just keeps fragmenting again towards death. Otherwise we don't get the. Yeah, the right point to. Yes, we don't. The path towards the good sacrifice seems very, very narrow."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":2992.01,"end":2993.61,"speaker":"Jonathan Pageau","text":"That's what Christ says anyways."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":2993.85,"end":2995.05,"speaker":"Jp Marceau","text":"Yeah, right."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":2995.05,"end":2996.65,"speaker":"Jonathan Pageau","text":"He tells us that the path is narrow."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":2998.25,"end":2998.81,"speaker":"Jp Marceau","text":"All right, Jeff."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":2998.81,"end":3004.29,"speaker":"Jonathan Pageau","text":"Philippe, I think we've given people quite enough to think about, and I hope."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":3004.29,"end":3005.29,"speaker":"Jp Marceau","text":"That wasn't too crazy."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":3005.45,"end":3029.02,"speaker":"Jonathan Pageau","text":"Yeah, I think it probably was too crazy. But that's okay. That's okay. We can handle a bit of crazy. And so I will tell people that you need to go check out JP's channel. I will put the link in the description where you'll find his discussions, his own discussions, and then his discussions with other people as well. It's well worth your time. And we'll probably end up doing this again, I'm pretty sure. Pretty sure."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":3029.34,"end":3030.3,"speaker":"Jp Marceau","text":"Thank you, Jonathan."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":3030.3,"end":3032.06,"speaker":"Jonathan Pageau","text":"All right. Thank you for your time, Jean Philippe."}
{"episode_id":"SW - #088 - 2020-01-11 - JP Marceau - Emergence and Levels of Being","start":3033.18,"end":3098.07,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube. YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to. To get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
