{"episode_id":"SW - #196 - 2021-11-05 - October 2021 Q&A","start":12.08,"end":6533.13,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. All right. Hello, everybody. Okay, so I guess we are live. We are starting. And so there are a lot of stuff. There's a lot of stuff going on this month. So many things. So I have a few announcements. I was in Florida earlier this month. It was. It was pretty amazing. You know, there. There's. Let's say people are Covid. Are less crazy about COVID And so it was just nice to be with people without masks in the church, you know, just celebrating, and it was just wonderful. And I spoke to the diocese, the OCA Diocese of the south. And so there was, I don't know, 100 priests. I don't forget how many. A lot of priests and two bishops. So it's pretty. It was pretty exciting to be able to participate with that. The archbishop of the. Of the. Of the south is Alexander Golitsyn. And so he is, like a great scholar on Dionysus, the Areopagite, you know, and the divine name. So it's very intimidating to speak in front of him. But I felt like we. I felt like it went pretty well. We even had like, a Q and A together, like kind of Q and A chat, and I thought it went well. So I might post at least one of those talks in the next few weeks. But I have a lot of backlog. I did so many interviews, and when I finished my Covid, I was just like, I just needed to do things. So I just did all these interviews. I've got, I think, like, five or six that are in the. In the waiting list, you know, then we just need to put them out. And so one of the big things that's happening is I've decided that by October 31, all of the podcast versions of these videos. So as you. As. I hope you know, all of these videos are put out as podcasts on your favorite podcast platform. All of these by the end of October will be up to date, which means that hopefully starting in November, when a video comes out, the podcast will come out at the same time or very, very shortly after. Like just maybe the day after or something like that. And so. So, yeah, so I'm looking forward to. To that because I know a lot of people have complained that they see the video come out, but they want to listen in their car. They want to listen to work or whatever, but they can't, because. Because. Because they don't, you know, they. They don't want to stream video in their car. So I get it. So hopefully that will all be fixed. But the biggest thing happening this month is October 31st. Halloween is the beginning of the God's Dog crowdfunding, the graphic novel. All of it is done. There's only a little bit of coloring, a little bit of inking left to do, but the entire first volume of the story is finished. And, and so we've set up a indiegogo crowdfunding campaign. All you need to do is go to godsdog.com so it's just God's dog straight out.com and, or, or find it on Indiegogo. And October 31st. I'm really hoping that people, if you want to, to, if you want to support this, if you want to get involved in the crowdfunding, try to do it right away, like on October 31st or the day after, because the more impact we have, the more, the more indiegogo is going to notice and also the more other people are going to notice what's going on. I'm really, and I have a lot of hope for this crowdfunding. I don't know. I know exactly how it's going to go. I don't know exactly what that means, but to me, this is like a new beginning in a certain way. It's like I'm trying to put something out in the world which not only explains my vision of storytelling, but really puts it in practice. And as you know, Mathieu and I worked on this for many years together, just refin the story, kind of bringing it together. And so we're really excited to put it out there. We've gotten some great reviews already from people like Paul Kingsnorth, Greg Hurwitz and other people. Several people have read it and we've gotten some great feedback from the graphic novel. So, yeah, so check it out. Godsdog.com you can already sign up for like an email list so that when the crowdfunding starts, you will get all the details and you'll, you'll, you'll be right on the, on the cusp of that. So that is, to me, that's the biggest thing going on. I've been spending a lot of time on that, writing press releases. You know, there's a good friend of mine, Renaud Gagne, who's helping me to set up Facebook ads and to do all the stuff that I don't know how to do. And one of the things we might be doing as well is, is an NFT version of the graphic novel. So. But that's something that I need to get the pulse from people out there. And so if an NFT version of God's Dog is something that you'd be interested in. Please find a way to leave a comment in the YouTube or something to kind of make a little bit of noise so I know whether or not it's worth it. I have an idea in the NFTs to have some. To have a few NFTs that are quite rare and will include, you know, we'll link to basically own a PDF file that, that will have a few secrets that other people won't have access to, a few ciphers of the stuff that is in God's Dog. And then the person who owns it can do whatever they want with it. They can decide to, they can decide to share it or to keep it for themselves. But anyway, so that's one of the things I'm thinking of. So I already seeing in the chat that people are saying don't do NFTs. And so. All right, we have one voice there. Let's see, let's see what other voices are coming. Another thing happening is, you know, with the YouTube pressure, there's a lot of pressure. A lot of channels are being deleted. And right at the moment where I finally got my hundred thousand subscriber button that they're going to send me, which, you know, that's cool. I'm happy that they're going to send me the hundred thousand subscriber button, but I'm also being very. I'm a little wary about what's happening. And so I've also set up on, on rofkin, which is a, which is a platform that uses crypto as its, as its structure. Jay Dyer is already there and he's the only person I know there, but there's Sam Tripoli is there and a few other people that I don't know about. And so all the, all of my videos are now being uploaded up to Rofkin. And what I'm going to do is for people who subscribe to, to me on, on Rofkin, people that are subscribed to Rofkin will also have access to the, the, the Patreon only video. So it's a way to think about a transition. I'm gonna see what it does, to see how it, how it works. And so it might be a way for people to, to support what I'm doing, but also have access to, to another platform. And so that's something that I'm going to offer. And so. All right, so enough about me and about what's going on with me. There's a lot of other things it seems that are going on. We'll start with the questions now, this month. And from now on, I've changed the mode of the Q and A a little bit, which is that, as you might have noticed, The Q&As are very long, long and unwieldy. They just become extremely. At some point, at the end of it, you know, I start telling people that they shouldn't ask the questions they're asking, which is not a good sign as to how tired I become at the end of them. And so what we're gonna do is, first of all, I'm not gonna open the super chats anymore. So there'll be no super chats because that's also too chaotic. And, you know, we'll also have moderators go through the questions that are asked on the different support platforms. So the way I do it now is because there's just too many questions. So the way I do it is for people that support me for $10 or more, they can ask questions on the different platforms that they're using. And then what we're going to do is we're going to select about 50 questions from all the questions that are asked. The selection will be done based on whether or not I've answered these questions many times if the question is a little unclear or sometimes if the person makes very long statement before the question. So try to be concise in your questions. Try to ask things that haven't been asked before. That's hard to know, obviously, for everybody. And so, yeah, so let's do it. Let's go. And so I will start with the website questions. All right. So Douglas, Matthew asks, not sure if you're familiar with the La Palma volcano eruption, but there is a belief out there that this could, you might say, cast half the mountainous island into the sea and cause a devastating tsunami across the Atlantic. Can you talk about the symbolism of volcanoes and how that symbolism might relate to the symbolism of the flood? And so the symbolism of the volcano is different. I think I see the symbolism of the volcano. I see closer to something like the destruction of Sodom and Gomorrah and the difference between the flood destroyed by water and destroyed by fire. It's interesting that the flood is like something which starts above and then comes down, you know, on the. On the. The waters. And also it comes out of the earth often in the story, especially in the story of the biblical flood, like water coming out of the ground and. And flooding the world. And a volcano is a mountain. So it's like it's something about fire and light kind of destroying the world. That's the best way I understand it. You know, like judgment, like a, kind of, like a fiery judgment which comes. That which kind of comes down the mountain onto the people. So that's the best way I understand that. So Eric Salander asks, I would like to know the link between creation and singing. Tolkien creates his world through music. And also in the Finnish Kalevala, singing has a big role to play not only in creation of the world, but also in magical battles and spells. Hope to talk to you soon. And so the idea of, of the why singing appears in creation stories, not so much the, the biblical one, but in other cultures. And like you said in Tokin, it has to do with pattern. It's pattern speaking. So there are all these different legends, right? There are legends will say things like that Adam and Eve in the garden used to, used to speak in verse. Let's say they used to speak in poetry. And then as they left the, as they left the sacred space, then they, they cease to speak in poetry. And so the idea that poetry is, you know, poet like songs also have a poetic way of saying and a poetic way of, of writing in, with, with rhyme or with meter, you know, with different structures. And so the idea, it's like it's ordered speaking, right? Ordered speaking, ordered sounds. So I think that that's what, that's what it's related to, you know, this notion that, for example, that the heavenly spheres make sounds and that those sounds are like a kind of hidden symphony, like a hidden musical piece, a hidden pattern that only certain people are allowed to intuit. And so I think that it's all related to that. It's all related to patterned pattern speaking compared to kind of chaotic, you know, informal speaking. So think about it, the difference between liturgy and everyday life, where liturgy is more patterned, more structured, and reveals more of how the world is formed, whereas it's still there in everyday life, but not so much or it's harder to see in everyday life. So I think that's what it is. So James McLaughlin says, pre modern obsession with damnation. I'm reading the Forge of Christendom by Tom Holland. Pre modern Catholics were obsessed with damnation in a way that I would think would seem extreme even to a modern evangelical. What is a good thing? Is it necessarily part of the pre modern view? Were the Orthodox different? And so I think it's important to be, to have, let's say, the memory of death is probably the best way to think about it, to Be aware of your death and aware of your death in many ways. Aware of your death, of course, in terms of your physical death. Right. But also aware of your death in the sense of the place where you break down, you know, and that has to do with the, the, the final result of that, which is, which is the lake of fire, let's say, or damnation. And so I think it's good to be aware of that because what it does is it also, it places your actions in comparison to the ultimate consequences of them. And so it reminds you of your, you know, it reminds you to keep yourself in check. Right. But I think it could go too far. And that is for sure. Especially like with the. There's a kind of. Matt. There's a kind of madness in the over calculating of this stuff, especially like in the calculation of all the years in purgatory and like so many years for so many sins in purgatory and so many this and that and this and that. And there's a little bit of, there's a little bit of exaggeration in that. But so, so yeah, it could go, it could go too far. Like there is, I've said this before, like there is in Christianity a sense in which all things have their destiny in God and that all things are meant to move into God and become part of God's life. And that is balanced out with another tradition which is something more like, you know, if you don't follow the thin, you know, the straight path, which is thin like a wire, and you have to walk on this wire. A sense in which it's difficult and you need to sacrifice everything and you need to focus. And so those two kind of exist together in a kind of tension. And so when you see that obsession with damnation, I think you're seeing one side of the coin. So David Flores says, can you elaborate on the symbolism of hornets, particularly in the context of Exodus 23:28, and I will send hornets before thee, which shall drive out the Hivites, the Canaanites and the Hittites from before thee. Ah, that's interesting. I've never really thought about that. Like, I never thought about the symbolism of hornets in that context. I don't think. I think I would feel ill at ease to answer that question. I would have to think about it more. It's a good question. It's a good thinking. I'm sure Matthieu would have a much better answer to this. All right. Jay Grubb asked, what is the symbolism of the man who was stoned for Picking up sticks on the Sabbath. Numbers 15, 32, 36. The passage follows one which walks about the difference. Which talks about the difference between inadvertently breaking and deliberately breaking the. So I can understand that aspect. However, is there anything going on beyond that? I mean, there is a little bit of interesting. There's an interesting thing in the idea of picking up sticks or picking up trees, right? And so it's as if, like, on the day of the Sabbath, you don't engage with patterns, you don't engage with trees, you don't engage with stable things, right? It's a day of rest. And so picking up stuff, sticks or picking up wood. You have to understand that in. In the old world, when they would just say something like wood, it would mean everything from trees, trees to branches, right? And so that, that. So it has something to do with that, that the day of Sabbath is the day without. Is the day without. Without pattern. It's like the day of rest. So that's the best way I can understand that in terms of the consequence. It's also about, you know, the. How can I say this? Like, rigor, right? There's an aspect of tradition which is that of rigor. And so sometimes there are some stories which emphasize rigor, and they can be a bit ruthless and terrifying. When you think of. It's like, yeah, you did this. Here's the consequence. So Timothy Aspaslaw asks, hey, Jonathan, what are your takeaways from Ronan Bakht's Mythologies? Read the book, but it didn't seem very relevant to me. How should I approach this? It's interesting because I say that I read it and it's like, I don't actually. Not even necessarily suggesting people read it to get the type of insight I got, because I got, for me, what it was. It was like a weird. It's kind of like how Mature talks about the double inversion thing. That's what was going on for me before I realized that's what was happening, is that Gala Ba'ath is describing patterns of behavior in society as repeating mythological and religious themes. And he does it to criticize them, right? He's saying, look at these social patterns, how they're just repeating, you know, these mythological. His mythological tropes. And his. His background is like a Marxist background, a materialist Marxist background. He's doing it to destroy them. He's doing that to expose them so that we can get rid of meaning and live in a purely kind of materialistic world. But what it ended up doing for me was the opposite, was to see the Patterns. And to see how actually what he was criticizing, I found very interesting because I could see how it was manifesting these religious patterns. And the conclusions to it to which I came was that ultimately it flipped to the other side, where it was like, okay, you're right. You see these patterns in all these social structures, but you're right to think that to criticize them and to want to get rid of them, because there is no materialism. Like there is no neutral world. And so that's how. What I got from that book. So you don't have to read it. It's not. I don't think. I think they're way better, way more important and more interesting things to read besides that book, if only to understand the way in which Marxists perceive how me. How meaning itself is almost. Is almost evil, you know, because it's an imposition of a pattern from above. Like, it's an imposition of meaning from above. All right, so, Tracy, Becky asks, can you comment on the symbolism of being pierced in the Bible from the thorns outside the Garden of Eden to the bites of the serpent endured by the children of Israel in the wilderness, to the nails, spear and crown of thorns at the crucifixion. Is our current persecution involving needles part of a pattern? So, so I, I think, I think so. I think that this is a very profound symbolism that you've stumbled onto. And it's one which is going to be very difficult to understand because it actually, it's one of those types of symbolism, kind of like the video I did on the mark of Cain, which is that in the symbolism is contained something like the. The two opposites, which are difficult to. Which are difficult to intuit at the same time. And so you could understand being pierced as a form of insufficiency of yourself. Right? And so you are pierced from the outside. And so in that. And that's what the, especially the, the thorns as the result of the fall is, which is that you are penetrated by all these things from the outside. Okay, that, that is so this. So you are, you're pierced by all these points and it, it's. And you're leaking, right? So because of that, you're basically leaking. You're not self contained. Okay. And so that has to do with that the bites of the vipers has more to do with the idea of once again being pierced from the outside, but almost like in a giving way where the, the thorns pierce you in a way that you leak and the viper pierces you in a way that gives you that Poisons you, makes you. Gives you like a bad. Makes you subject to like a bad. A bad principality, a bad pattern, you know, and so it can almost seem like the opposite of the other one. But then in terms of the crucifixion, it's even an. It's even another aspect which is that in the, in the terms of the crucifixion, it has to do with. With the lamb which is sacrificed at, you know, before the foundation of the world. That is in order for the world. So it's, It's. I'm going to use. I'm actually going to use a symbolism which people are going to find is weird. But there's actually, you know, in. From. From other cultures, but in like Hindu mythology, there's this idea of the cosmic egg, right, or of the. Of the first form, which is completely closed and completely perfect. And so there's a sense in which in order for that to become a world, like a realized world, it has to be pierced. There has to be something done to it or some. It has to concede something, right. In order for the world to then exist. And so now when Christ is pierced, it's out of his wounds come creation. Creation actually leak out of his wounds. And so it has to do with this idea of piercing the cosmic original sphere or the original egg, this kind of pristine world that doesn't have any variety or multiplicity yet. And so it has to be kind of poked at in order for everything to come out. And so you can understand it also then as Christ giving himself, right, so the divine Logos pouring himself out into creation. But also Creation basically is the pouring out. So creation is emanating from him in its multiplicity through the. Through the sacrifice. And so, sorry, because I know that sounded like madness to many people, that sounded like total madness, but. Sorry, you just tripped on a. On a very, very intense symbolism. And so if you want me to make it even trippier for you, there's a man in which all of those are contained. Also there's a man in which all of these different aspects of being pierced are different elements of us, of one symbolism which. Which is impossible to. To. To talk about, which can only be grasped through a kind of intuition. So anyways, yeah, so I'm. Oh, and so does it have to do with what's going on now? Yeah, it has. It does have to do with that. It does have to do with. In our case, it has to do with something like receiving authority. It's a mixture. It's a weird mixture. It's like a receiving authority. Right. So being penetrated but then also accepting the strange at the same time. So it's like authority which imposes the foreign or the strange. And that's, that's what's going on. It's kind of, it's, it's. It has to do somewhat with the kind of 666 symbolism that I've talked about. I'm not saying that it's the mark of the beast. I don't think it is. But it has to do with that. It's a, it's a part of this pattern that is kind of, kind of appearing. So, so don't go around saying, I said it was the, it was the mark. I don't, I actually don't think that, you know, but I do think that it is showing us how this works and helping us see that it's that, that these types of patterns are right there on our horizon. Yeah. Okay. So. Man, I can't believe I answered that question. So Mark from Tbilisi says, I just wanted to share an image that popped out of a dream my wife had a few weeks ago. It made my jaw drop. In my dream, a cow swallowed a wolf. Have you come across this image before? For me, it's an image of the domestic devouring nature or authority devouring liberty, our wildness being tamed, civilization devouring our individuality. Enkidu. Tame. The fall. Yeah, I mean, I don't know the Fall, but it's rather, it's rather a, an idea of civilization, of civilization taking over. Right. And so, you know, that's what I talk about this, the kind of beast system or 666 symbolism. That's exactly what it is. Right. It's the idea of a tyranny in the name of safety. A tyranny in the name of something which is not dangerous. And so, yeah, good call. It's like you have really. You had a really good intuition about that. So a bit not bothered. Says in the 1990s there was an influx of English comic book writers to America via Vertigo comics. Yes. In a documentary about the comic book 2000 A.D. neil Gaiman said Americans trust heroes, the English don't. What influences has Neil and other English comic book writers had on how Americans tell stories in the last 20 years? So I agree. I think that the, that the British invasion, you know, Alan Moore, Neil Gaiman. I always forget the third guy. I forget his name. Anyways, doesn't matter that they are really, man, they on the one hand I think they are part of the really Manifesting the breakdown. And at the same time, they're preparing the world for a new re enchantment. One of the things that. That characterizes Gaiman and Alan Moore's work and the other guy, I forget his name is the idea of the archetype and its idiosyncrasies. The archetype that forgets who he is or refuses to be who he is. Right. You see that in. In the Season of Mists series where. Where Lucifer refuses to be Lucifer. You also see it in that series. I forget the names of all the series, but it was. It was Alan Moore's superhero series where it's basically Shazam. I forget. But he was called something else where he. He wakes up as an adult and he forgot who he is. Like he forgot who his. What his power was. And so. So it has to do with this kind of weird, I think. And also Neil Gaiman did that in the Eternals, his Eternals comic too, where it's like all these gods that forget who they are, you know, and so. And you see that in American Gods as well. The idea of principalities which are just really idiosyncratic, which really are just individuals, you know. And so, yeah, so it's definitely part of the breakdown, but there is something in their. In their writing which is preparing a kind of re. Enchantment, you know, also because Alan Moore was an occult. Is an occultist, and there's a lot of OTO and magic stuff in his. In his comics. And I think that despite himself, I think is. Yeah, I think despite himself, despite themselves, they will be seen as having participated in the re enchantment as it happens. So, yeah, there's a video in the clip channels where I. Where I kind of give my criticism of Neil Gaiman as well. All right, so arose is 77. Can you comment on critical theory? Which of its insights are beneficial? How can some of its theories be symbolically understood and what are its deficiencies? I mean, I'm obviously not a big fan of critical theory. I mean, it's basically a form of cultural. The words you can't use. It's cultural Marxism. That's what critical theory is. It's applying Marxist notions of materialism and revolution to meaning and to cultural forms. That's really what they were doing. And so I'm actually. James Lindsay promised that he would come on the channel, but he's just. He said he's just been busy and been traveling. So maybe one day we'll have James Lindsay on the channel and we can kind of talk about that directly. I think that they are. One of the things which. Which, let's say, which is important in critical theory and postmodern. A lot of postmodern theorists as well is that in their thinking there's something like a re. Injection of symbolism. And you see it in a lot of the. A lot of the postmodern kind of messy, crazy theory theories. And the imagery they use is often very coherent. It's very coherent, but it's upside down. And so the way that they understand masculinity and femininity is often actually quite accurate. It's just that they hate the masculine. And so they try to use, let's say, feminine imagery and. And imagery is of the strange, the stranger, you know, the. The. All of this type of imagery to subvert. And so it's. But in. In that move is. Is already a re. Enchantment. And so like I said, there's a. There's a way in which all of this will at some point start to turn. And I think we see inklings of it already. At least that's my. So if you want to know, like this God's Dog book that Matthew and I wrote, it's part of. It's partly that one of the reasons why we're putting it out on Halloween, one of the reasons why it's. It. Some of it looks weird because it's a monster with a halo. There's all this kind of flavor to it is because we're actually going. What we want to do. What we wanted to do in that story is to. To flip it back. Flip the script back to present a story which has all. All the first glance on the first glimpse of being kind of subversive and weird and disturbing and then. And then surprise people by the way that it turns out. And so. And bringing, let's say, bringing normality out of the. Out of the. The monstrous, let's say. And so you'll see, like, there's some things about it which people. I know some people are going to feel uneasy about because it's going to look weird, especially at the outset. But hopefully you trust us and us. But trust us enough by now to know that. To know that we've got. We've got our own tricks up our sleeves, let's say. All right, all right. So Pneumaesh says, I feel that there's sometimes a little too much shade thrown at Jacob when we talk about him, understandably, when he deceives Isaac, but he really does it at Rebecca's command. And he seems to be hesitant to do it at all. Plus, Esau doesn't appear to care about his own birthright, and he sells it to Jacob. Scripture even says he belittled or despised it. And Rebecca has a confusing prophecy about how the older shall serve the younger. Also, Jacob is given the name Israel, which is something like an angelic or heavenly name. So all that to ask what is the significance of the two names given to Jacob and Esau's names, especially since their second ones are given at turning points in their lives. And so, yeah, it's interesting. Like, man, there's. In Jacob, there's something. There's something really surprising about. About Jacob, which is that there really is something about the trickster in Jacob and about. Something about also the. The second son. The idea of how the first son or the first man falls and then the second son or the second one is able to. To. To get from him. So, so Esau's name is Edom. Edom is Adam. It's just Adam. It's the same name and it means red or. It means red, you know, red earth or whatever. So Esau's second name is just Adam. It's really fascinating. But you can understand how Adam, it's like. It's like Cain. So it's like Adam, Cain, Esau, and then Abel and Jacob. So there's something going on there for sure. And yeah, yeah, there's something about. There's something about how Jacob is able to. To trick. I don't know how this. It's. Jacob is able to. To trick. Not trick, but let's say, contrive God into giving him the blessing. And I don't totally. It's like one of those things which is for us, it's weird. It's like for us, this is. It doesn't work. Like, for us, it doesn't work. And one of the reasons why it doesn't work is because we're. Most of you people that are watching this. We're at. We're Edom, we are Esau, we are Rome. Right? We are the. And so we have our faults, right? We're the ones who tried to kill our. We tried to kill our brother. We. We're the ones who. Who abuse our brother Jacob. We are. And it's. And it's horrible that that's the case. But there is something about. At least there's something about being Rome and being Esau, which makes it hard for us to understand the nature or the reason for. For the trick or for the idea of contriving somehow in this strange sense. So sorry, like, it's. What I'm saying seems even more cryptic than what the question. It's like, I'm not helping you understand it, but I'm giving you some. Some hints and some paths to think about this. Yeah. All right. So Patrick Blonsky says in the story of the Last Supper, Christ reveals who the traitor is. And he answered and said, he that dippeth his hand with me in the dish, the same shall betray me. But it seems like the apostles didn't hear him, because you would think they would be looking out for that and even pursue Judas after seeing him. So you also have to kind of understand that the apostles really didn't know what was going on, you know, and so it's understandable, just in terms of storytelling, because it's like, here's Christ, and he just washed their feet, right? And he just gave them. He just gave them communion. He just gave them his body and blood. And now he's saying, this one is going to betray me. And so I don't think people. I don't think that the. The disciples were able to even understand what was happening. It was just too much. So I think that this is. This is why Christ tells him, you know, and you have to kind of understand that also that the fact that they're dipping their hand in the same dish that they. They both have, you could say they both. They're sharing a secret, right? And the secret is that Judas knows what he's going to do, and Christ knows what he's going to do. And as they dip their hand in the same bowl, they basically are sharing a secret from the two opposite sides, you know, and so. And so Christ tells them to know. It's like, I know what you're going to do. Just go ahead and do it to show him that he's in on the secret. And so I think that that's what's going on there. All right, so curiouser and curiouser, ask, why does it say in Revelation that the leaves of the Tree of Life are for the healing of the nations? Thanks, Jonathan. I mean, there are a few ways to understand this. One is to understand that obviously the leaves are like the outgrowth of the tree. They are the final things. And we also use leaves to make medicine, but obviously we could use other things to make medicine as well. But the idea is that it's the outgrowth. So it's like the edges of the tree, the end of the place where it stops, then that's where the medicine is. And that's where you can heal the nations. And so I've always kind of understood it also as a way to compensate for the fig tree. And so Adam and Eve fall and they take the leaves of the fig tree and they tried to heal themselves. Right. They tried to cover themselves with the fig tree in order to. Right. In order to cover their fall, in order to cover their shame. And so I see this as kind of a. As a trope saying that basically it undoes or it's the right application of this pattern where the tree. The leaves of the tree are for the healing of the nations in the final story. So these things meant to cover. Right. They also are there to heal. So, yeah, hopefully that makes sense. I feel like. I don't know why do I feel like maybe it's because I'm drinking beer. I don't know what. I feel like the answers I'm giving are making it more cryptic and not helping you understand at all. And so hopefully when. I don't think a lot of clips are going to come out of this Q and A, it's like all these cryptic answers I'm giving you. All right, so. So Nico says, why does a bride wear white and the bridegroom black? And what should they wear? This is really just my intuition, you know, I don't think that the idea of the bridegroom wearing black is a super old tradition. It's. I don't think it's very old, but nonetheless, I don't think. I think there's some kind of meaning to it. You know, I think that the bride wearing white obviously has to do with virginity and purity. And the bridegroom wearing black, I think has to do with sacrifice. I think it has to do with a form of dying. That he has to die to himself in order to become a husband. That's the way that I see that. But, you know, that's just my intuition. I might be wrong for sure. The bride wearing white as being pure. That's something which is pretty obvious. But the bridegroom wearing black is maybe a little more cryptic, but I would think that's probably what it is. For the same reason why a priest wears black. For the same reason why. Yeah, why Johnny Cash wore black. You know, it's like an idea of a kind of. A kind of dying to yourself. A kind of. Yeah, giving. Giving. So giving yourself as a bride and give yourself as a bridegroom is not the same. All right, so. All right, so now we've done with the website, we're moving on to subscribestar. Only two questions on subscribestar. I just want to warn you, too, if you put in your question late today, it won't be part of the Q and A. So you have to try to get your question in a little bit before, because we need the time for the moderators to go through the questions and kind of sort them out. All right, so Little Joe asked, why is it that a lot of Christians east and west, see the Eucharist as just a symbol when it is truly. When it truly is Christ? The satanic worshipers try their best to steal it for their black masses. Why do they believe more than some of us? I mean, the truth is, I'm not sure. Satanic worshipers, a lot of them who would want to do this, totally believe it. They, they believe in the sacrilege, which is they believe in insulting what you believe in. That's something that, that they care about. So they care about taking the most precious thing, the most precious thing that you have, and, and showing how they have the power to defame it and to, you know, to take your highest thing and treat it like nothing. And so I think that's what's going on with a lot of satanic worshipers. But for sure, like, why did they see it as just a symbol when it truly is Christ? I think that that is, of course, a symptom of just the move into modernism and the breakdown of symbolic thinking as the main way in which people understood things in the. In the ancient world, you know, where they didn't see the. They didn't see meaning and factuality as opposites. They saw them as joined together, and they didn't see symbolism and reality as being separate. They saw the symbol as making something real, you know, and so I think that that's what's going on there as well. Okay, so also I'm hearing a lot about Orthodox theologian, priest Laura M. Gilles. Sorry. Ask Sergey Bulgakov. Care to give us a summary of his thought influence? Well, I don't, to be honest with you. I'm not a super. An expert on, on these, on these Russian, these Russian thinkers. And so I think the. The thing with Bulgakov that is hard is because he's part of a controversy. And so it's difficult for me. I don't want to speak on him too much because he's part of the controversy of sophiology, which is this desire to kind of express the feminine in the divine. And so he's controversial because of that. And so he seems to want to see Sophia in the Old Testament as being almost like hypostasis of the Trinity. And so that's caused a lot of controversy. So I don't want to talk about that too much. Sorry. I don't like to get into too, too theological controversy. Oh, man. All right, all right. On Patreon, Matthew Mold Mole. Brandon asks. A major problem in times of political strife is turning into the thing you are railing against. I think in the. In the US this is particular problem from PC becoming everything they purport to dislike to the people storming the Capitol to save democracy. Do you also see this decline as a major issue? In particular, what are one of the two stories from the Bible or other traditions that illustrate this issue? Do they offer any solutions or do you have any words of wisdom? Yeah, I think so. I think that an interesting version of this is in King Saul. King Saul seems to be all about that. And so King Saul. I don't know if it's really that people become what they hate. It's just that every side of an opposite, if taken to be the only truth, will not be able to perceive the world correctly and will tend to embody excess and will tend to become tyrannical in its implications, will tend to become tyrannical in the way that it manifests itself. And so I think that that's what's going on. And so people never see their own tyranny. They just see it as the importance of what they believe in. And so it's like if you think something is super important, then you won't. You won't flinch at the ways and the methods that you use to impose them. You can see that with COVID as well, right? It's like people have decided that being safe from this disease is the highest value. And so everything goes, like everything is willing to happen. And so they're not able to see the tyranny of their. Of their actions, you know, And I think that that's. That's what's going on. And there is, in a way, a manner in which extremes kind of meet or extremes look like each other, you know, and what they look. The way they look like each other is by becoming authoritarian, you know, and so you can have an. But you can have different kinds of authoritarianism. So that's what I see. And King Saul. What I meant by King Saul is King Saul is interesting because he. He always goes in excess, right? So he. He tries to do something, right, but he goes too far. And then it becomes weird, you know? And so the great example is when he decides he's going to fast, you know, for God, before he fights a battle. And he's. That sounds great, right? He's going to fast, and he's going to. So he orders all his soldiers to fast before a battle, which is like, first of all, pretty intense. You know, you're going to fast before you eat. But then he goes even further. He says something like, anybody who eats before the battle is going to be killed. I'm going to kill him if he eats anything, you know. And so you see his son Jonathan eat some honey. And so all of a sudden it's like, okay, they're going to kill your own son because of this thing that you said. But then you see that King Saul also, at some point, tries to be flexible and not listen to the law. Like God says that he has to. Yeah, this is the place, the part of the Bible that everybody hates. But he says God says that he has to kill everything and he doesn't want to do it. So he preserves these animals and these. So God reproves him. But then he tries to be too strict to do something super spiritual, but then he goes too far. And so it seems to me like that's something of an example of that. All right. All right. So Drew McMahon asks, All right, can I ask about the procedure? Everybody's asking about that, so that's fine. I understand why you're asking about that. So he said, in. In my digging into this Covid procedure, I stumbled. I'm changing the words, by the way. I don't want to see the word because, you know, I stumbled upon an inconvenient fact, that many of the modern vaccines we are taking have used aborted fetal cell lines in their development. How can a Christian take any vaccine that use such technique? And so I would say that it is definitely an issue. It's definitely a problem. But this is. What I'm going to say is. Is I'm going to say. What I'm going to say is going to be harsh. But you have to. If you're going to go down that line, if you're going to go down the moral line, then you have to be aware of what it implies, which is that any technology that I use, if this technology was acquired or developed through immoral means, that makes this technology invalid. And so you just have to be. If you're really willing to go down that line, you have to be careful, because you can't just apply to this one vaccine now. You have to understand that in your cell phone, in your cell Phone. You have. You have metals. You have superconductors that are. That are taken out of the hands of enslaved children that are working in mines in Congo. You know, you have to know that a lot of the medical developments were developed by the Japanese and the Germans during World War II by experimenting on prisoners. You have to understand that a lot of the. And so I would say just be careful. And so I. I'm not wanting to diminish what's going on. I think that it is a very disturbing thing that we see. And it's very disturbing, for example, that the governments are now trying to prevent people from giving a religious, you know, religious opposition to the vaccine. So. But I would say just be careful not to judge others. Just be careful not to look at other people and say, how can you be a Christian and do this? Because if you do that, it implies a lot of things for yourself as well. So that's what I think about that. But I don't think. I think it is a big deal. And I think that in terms of meaning, the fact that there's aborted fetal cells related to this. You know, the word in Hebrew for a stillbirth or an aborted fetus is a nifal, which is the word we use in Nephilim, that is the fallen ones. And so that's. Yeah, that's something to think about. There's a relationship between monsters and. And boarded fetuses or. Or still births, because they're ill, they're misformed or not fully formed beings. All right, so Wyatt Lawrence asks, of all the icons you've ever carved, which one or ones are you most satisfied with? And so I think for sure, the one I did for Jordan Peterson, because we just spent so much time and effort developing it. You know, it's an icon of St. Michael killing the dragon, which has all these inserts of stone and using kind of these. This basma, which. Like a metallic background and everything. So I'm really excited. And a frame by Andrew Gould. I'm really happy with that. I just find it's probably one of the top icons I've made. But there's another one also. There's an icon of St. Anthony, which I carved, which is a very simple icon, but there's something about the face that I did, which I felt was very vivid and. And. And well, and just. Well done. It just has something about it when I look at it. I like to look at it. I feel like I captured something. So that's another one. All right. And so Reuven Korf asks, I've been having a little difficulty understanding some of the miraculous healings of Christ. Namely, these are the healings of Mark 7, etc, where Christ uses saliva to heal blindness and muteness. I can't shake the temptation to think that these acts as parody of the symbolic structure of existence are using the water from above to heal rather than reveal them properly. Could you help with understanding this phenomena? And so you're right. You have. You're completely right. It has to do with waters from above, water from the garden, that is, that is used to. To heal. But I don't know why. Do you see it as a parody? I'm not sure. I don't see why it's a parody. And it's also even like the, the, the, the. The. The time when Christ heals, the blind person spits in the, in the. In the dust and then makes, like, a paste and then puts it on his eyes. It's like, that's a very powerful image of, like, a new creation, right? Something from above coming down. Now, it's not the breath, but it's the waters from above which mix with this dirt, and then it kind of restores creation or brings about a new creation. So, no, I think you're right. I think your intuition is right. But just because we don't like spit and we find it disturbing is to me that that doesn't mean anything for the story. You know, there are a lot of traditions where you spit on things to bless them. I don't know if you saw My Big Fat Greek Wedding. You see that in that, in that movie where as the bride and groom are walking down, you know, are walking through the church, then people in the aisles are spitting on them, and you think, what the heck is going on? And it has to do with the idea that spitting as a form of blessing. So sending water from above down is a form of blessing. Just like that, you have rain as a blessing, you know, so. Yeah. So Christopher Kant says, hello, Jonathan. There's a trope in storytelling where a woman would dress herself to appear as a man in order to surpass patriarchal boundaries and prove herself in battle alongside the men. An example of this lies in stories like Lord of the Rings with Eowyn and in Mulan. Is there any deeper meaning to this subversion that surpasses the shallow version shown in modern media? I know that Jar Token was support of the traditional patriarchy, which is why the trope stuck out to me. And so. Oh, mercy. All right. And so there's a few things going on, in this. So on the one hand, there is, of course, the idea of the Amazon. And so this is not what you're talking about. And a lot of the stuff we're seeing today is the Amazon. So it has to do with, with these kind of monstrous women that are on the edge of the world that kind of come in and are super powerful and overpower men, you know, and also don't need men. They are, they don't, they don't need men to be their, Their, their spouses. They're not married, you know, so that's one. And so the other one, like the kind of Mulan or the story in Lord of the Rings or, or in Joan of Arc's story, what you see is rather the feminine wanting to, let's say, ascend the hierarchy in a way, in this kind of hierarchy of, of performance in the male world in a way that is in service to a higher purpose and not to the freeing of the. Not in a revolution. There's no revolutionary thing going on. It's like in Joan of Arc's story, she wants to free the king, she wants to save the king. That's what she wants. And so she actually rises up in this hierarchy of excellence, of masculine excellence, but not in a way that is to subverted, but rather to be kind of, to be kind of elevated into that. So. But even Joan of Arc obviously was, was accused of subversion and was. And was kind of dangerous for the system. But I think that that's what you see in these types of stories. Yeah. All right, so Chase and Lindsay asks, hey, Jonathan, I noticed recently that I can't find a single example of a time travel story about people going into the past to alter future events. That was written before the modern age. I have found medieval and ancient stories of the opposite, where someone travels into the future, but not a single example of going into the past or change or attempt to change events. Is there a reason why these stories don't seem to exist before the 1600s? Or if they did exist, why they died out and have been lost. So I think one of it is. One of it has to do with materialism, you know, because you can travel to the past. It's called reading a book, for goodness sake. I mean, you can travel in the past. It means listening to the traditions that are handed to you by your ancestors. By knowing the old stories, the old songs. In that way, you are traveling into the past. But because we're materialists, we have the idea of like physically going back, which doesn't make any sense. Like, it just. Yeah, it's going back in the past and then re. Experiencing what was going on there. And so in terms of the idea of traveling into the future, you can understand why you would have older stories about traveling into the future, because the future hasn't happened yet. And so you would have more explicit stories of traveling into the future instead of a story of someone who just reads a book book. Because there's a sense in which that causality hasn't manifested. So it's like. Yeah, moving into the future. And so. And often these stories have something to do. Obviously, in those stories, the people can't go back. They can't go back in the past. It's not like, you know, you have the story of the. The hurley thingy, for example, with these kings that. The. The king that goes out into the elf world or the dwarf world, and then when he comes back, it's like 300 years later, but he can't go back to his old time. It's like it's over, Right. He's. He's just traveled into the future. You have stories like the Seven Sleepers of Ephesus, where people fall asleep and then wake up so many years later, that kind of stuff. And so, yeah, so those. So. So I think it's just. It's just. It's just materialism. People don't see it as meaning. They just see it as. Yeah, all right. So Annie Crawford asks. I've heard you say that this modern era of dualism inaugurated by nominalism, was inevitable or part of the pattern itself. Can you explain this a bit more? Why did the medieval synthesis have to fall apart if it is fundamentally true? Is this because the cosmos after the fall, like the human person, must undergo decay and death before it is born anew? So it has to do with that. And it also has to do with a weird mystery about the incarnation, which is that the incarnation leads to death, and that in dying there's a covering or filling up. And so there's a way in which. I don't want to say nominalism is good. I don't think nominalism is good. I don't think that these modern tropes are good. Even something like colonialism, I don't think is good. Even something like all of these modern tropes which came out of nominalism. And these. These intellectual moves, they nonetheless fill the world. The breakdown fills the world. And so there's even something going on now, which is that in the secularism, there's a sense in which, in which that breakdown also fills up the world. You know, a good, very simple example, I gave that today, actually, to JP Marceau in our French podcast, this example, which is that, you know, in English, right before we used to say to mark time, we used to say ad, you know, before we say bc, you know, for like before Christ, and then ad for anno, anno Domini, which is the year, from the year of the year in the year of our Lord. And so, you know, it's like a very Christian way of telling time. And now the moderns, they're embarrassed by that. They don't like that. They don't like the direct relation, the direct connotation of Christ. And so they want to break it. They want to destroy it, they want to break it apart. And so they change the term. They say BCE and ce, which is the common era. And so they try to remove Christ by saying common era. And it's just fascinating because they're actually making that. The idea that Christ's birth is a fundamental change in reality. They're either hammering that in by removing him by saying that the birth of Christ or the life of Christ inaugurated a common era in which all people can agree on how to tell dates is doing the opposite of what they think they're doing. And so I think that that's the mystery of this breakdown. There's a way in which, even in the secularism, it's actually revealing the manner in which Christianity has completely imbibed our thinking, completely imbibed our social. Our social patterns. And so, yeah, so I think it is part of the story, but it doesn't excuse it. I'm not justifying what happened. So. Hi, Jonathan. What is the symbolism of blowing candles on a birthday cake? It probably has some pagan roots, but I guess there's some deeper meaning given that it stuck around. I mean, I always thought that it just meant you're. You're blowing out those years. So. Right. You put as many candles as years as you. You've been alive, and then you, then you, you blow them out because they're gone. You're right. You're that closer to death. Sorry for the inappropriate laugh. So. So, yeah, so, you know, I think that's what it is. I mean, it's basically. It's basically blowing the, Blowing those lives out, you know. Yeah, there's something else going on there. There's something also about the cake, about, about, about eating this cake. And so it's like we're eating, we're. The candles are there to represent the number of Years you've been alive. And then you blow them out and then it becomes food for all the people that are there. It's a really. Actually pretty powerful symbolism. Yeah, it's pretty powerful in that sense. Have to think about why it. It. It. Why makes it, why you can have a wish, though. So why is it that you can wish when you blow out the candle? So you blow out the candles, then you offer your. The body of that life to all the people that are gathered. You know, you kind of gather them into yourself by giving. Giving them like your. Your life, basically. And then you have a wish. So I guess there's something about looking up and then. Yeah, I'd have to think about the wish thing. All right, so Dorothea says, what do you think about the claim that we live in an inverted society that rewards extrovert. An extroverted society, sorry, that rewards extroverted behavior and rejects introversion? There's something in scripture or the tradition akin to the notion of extroversion. Introversion. I don't know. I never thought about that. But you're right, it definitely does reward extraversion. And I think that has to do with the idea that we live in a world of science and materialism and things you can look at and calculate and you can describe, rather than things that are happening in the secret and things that are happening without being seen. It has to do also with social media culture and reality. Reality tv. You know, the idea that if something does isn't on tv, if something hasn't been filmed, if something isn't in the media, then it hasn't happened or that it barely happened. And this is the very opposite of a more traditional way of understanding, which is that the secret transformations in your heart, those are the most real. And everything else should be a fruit of that. But we can't rely on outer works and on outer signs to really understand the deeper part or the hidden part. Yeah. I think that traditional societies are at least at different levels. They're always somewhat introverted. You know, they tend to keep to their own, let's say. And there's. There's also a general sense that to be too loud and too boisterous and to take up too much room is always a bad sign. Whereas we see the opposite, which is if someone is quiet and kind of holds his own and doesn't engage with all these people, then we see that as unhealthy. All right, so Jan Peter Jager asks, when people organize themselves, for instance, in a company or for an activist cause, they. They always start to exist secrets, often secrets that have a certain impurity or sin involved. For example, a company tells a lie to sell more products at the same time, in the modern world, we long for transparency, especially from people who have an opposite cause or work for a rival company. Is this normal human dynamics or particular for the modern world? Could you shed light on this topic? And so I think you're right. I think. I think you're right. And I think there's a. The way to understand it. I don't see it as a modern thing at all. I think the way to understand it is there's almost like a causality effect, which is that you have to be careful when you start something of how you started, that when you begin something, that if the beginning is properly balanced and that in the beginning there's the right alignment, let's say, then the fruits of that will show themselves. But that if there is already a lie, let's say in the founding or in the beginning, then. Then that will also play itself out all through the system. And so I think that that's true. And I think so. I think that lies that are. The further down you are in the system, the less it, in a way, matters for the system whether or not there's a lie there. So it's like imagine, I don't know, some. Some random worker lies. It's not good. It can damage. It can infect the system or the company. But if the president lies and the vice president lies and the top organizational people lie, then those ramifications kind of come down the hierarchy and will create a toxic, like a really bad situation. So. Can't believe I use the word toxic. I don't think I've ever used that word ever before. See, I've been infiltrated by certain ways of thinking. All right, so that's good enough for that. I think so. Isaac, Malcolm says hi, Jonathan. Don't know if I have an easy question, but I would love to hear anything you have to say. All right. How do you differentiate between symbolic thinking and poetic thinking? Do you think there is one? And so I think they're. They're very much. They're the same. They're just. Just, let's say one is bigger than the other. So poetic thinking is ordered thinking. You know, it's the idea. It's a. It's a hyper. Emphasis on the fact that language is ordered. It has to be. Right. We've talked about this so many times. You have to order facts into patterns in order for them to be communicated. But there's also a way in a type of order which can also call attention to itself in terms of the order itself, that is that they reveal their orderliness. And I think that that's something that you see in poetic language. And I think that that's often what happens in symbolism, where things that are highly symbolic, we could say are things in which it's easier to perceive the order. So everything you do is symbolic, right? Everything from breathing to, you know, anything that you're. That you can identify as having existence has a symbolic pattern to it. But there are certain things, like, you know, let's say religious songs or liturgy or icons or sacred spaces or all of these things that are more. That are heightened. And I think it's the same with poetry. And so poetry is a heightened order that helps you perceive. That helps you perceive the order itself. Hopefully that makes sense. All right, so Dean Parker says, when we invent something totally new, are we actualizing a form pattern that already exists in waiting or allowing a new new form to emerge? My thoughts were that the forms are persistent and finalized from creation, and anything newly invented is just a derivative of an already established form. So, yes, that's right. That's what you've got. You can't ever invent something totally new. That is a completely incoherent possibility. Well, okay, so let's see it this way. You probably could. You could, but not totally new, but at least let's say on the border of totally new. But actually the way that if you encountered something which was totally new or on the border of being totally new, then you would actually encounter it as a monster. You would encounter it as a monster first because it would have nowhere to rest. It would have no room, no house to live in. So it would appear as this shifty, chaotic identity, you know? Right. There's this. There's this idea. I don't know if it's true, but there's this idea that when the Spanish arrived in. In Central America, the. The people, the. They could see the boats. They could. I mean, the boats were on the water, right? Coming for. For a very long time, but the people couldn't see them. They just couldn't see them. So the boats were coming, but they couldn't see them because there was. They had nothing to connect it to. It was completely outside of their capacity to perceive. And so at some point they had to, because it became. It came so immediate that they had to see these monsters. They had to encounter these. These monstrous beings and then slowly tame them and slowly kind of integrate them into their world. And so I think that, so I think that that's the way that it happens, you know, and, and obviously I've mentioned this before, there's no value in novelty. And so, you know, it's like, I think that this is something, for example, like one of the problems that happened to Tesla I think is what is this? Is that Tesla at first proposed new things and it was like, woo, it was new enough and it was, it was similar enough to the things that already were there, that people were like, yeah, let's integrate it. And then he's like proposed another thing that now was so outside of what people thought was possible. And, and another way of thinking and another way of applying things that it, that it could not be integrated and it wasn't. And you know, Tesla died a poor man, a poor and miserable man. So I think that, that it's actually a little example of like not the totally new, but the almost totally new, let's say. Hi, Jonathan, can you please elaborate on the metaphysics of patterns? If I remember correctly, you said that the pure pattern don't exist. They need bodies. But you also said that the angel of the city still exists when the city, city is burned down. How can we bring these statements together? Thank you for your insights. And so the, I mean, pure patterns exist in the mind of God. Like they, they, they exist as pure patterns, but they, they, they exist in the world with bodies. They have to have bodies. They don't have to be physical bodies, but they, they can have to have some kind of expression, you know, or else they're just, what are they? They're just a pure intuition, I guess, you know, and so they kind of need to embody themselves even for you to perceive them or to be able to contemplate them or to talk about them. So that's what I meant by that. And so the angel of a city exists when the city is burned down. It exists in the sense that, I mean, it exists eternally. His body is the city. And so angels don't exist the same way we do. Right? They just don't exist in time. The same way we do that is that the angel of a city has a body which is the city of which it's an angel. And then when the bot, when that body is destroyed in our world, it's still, it still exists. It still exists. It's still the body of the city, a body of the angel. It's because an angel doesn't exist in linear time the way that we tend to think. So to me, it doesn't. It's not. I know it may be hard for some people to understand. To me, it's just. It's just not a problem at all. Yeah. So hopefully that's helpful. I don't know, maybe I'm not explaining it well enough, but I struggle to find another way to explain this. All right, so Walrus King 14 says, hi, Jonathan, could you explain some of the symbolism behind making the sign of the cross? Specifically, could you go into why the Father is attributed to the head, the Son to the stomach, and the Holy Spirit to the shoulders? Could it have something to do with the intellect, the body, and the directing of. Of will? So I think, I think this is speculating here. I'm totally speculating, but for sure, the idea that the Father is the head, that's not complicated. That's really easy. But I think that when it's not that the son is the stomach, is that the Son is the descent. Right. The Son is descending from the Father is coming down into the world. I think that that's why the sun is, is down and like the belly is the body. You know, you could see it that way if you want, but it's mostly to understand this descent and then this, the, the. The Holy Spirit is more about connecting. Right. Connecting the two together. And so being this connection between the Father and the Son, that's the best you're going to get from me. I'm sure some people have said more subtle and interesting things about that. All right, so Nathan Condon, ask. Hello, Jonathan. What is the best Christian movie you have seen and what is the worst, the best Christian movie you have seen? I don't know. Are there Christian movies really, like, like made by Christians, like, or have Christian stories? You know, I think that, like, it's weird. Like, I keep, I keep thinking like something like Hacksaw Ridge is, is a great Christian movie. It's not a Christian movie. Really? Yeah, I think. But, you know, even movies like Apocalypto, which are, which I'm still in the Mel Gibson world, it's like, okay, so Mel Gibson makes the best Christian movies. Maybe. Although the Passion. I just, I didn't. I didn't. I wasn't to my, to my taste, let's say. But, you know, it's hard to. It's hard to, you know, of course, you know, the, some of the stories of some of the moves, like Jesus of Nazareth is a, is a powerful movie. It's, it's well done compared to some of the other Jesus movies. Let's say, yeah, the worst, man. It's like there's so many bad Christian movies that say, call themselves Christian. Like the problems that I haven't watched. A lot of them. A lot of them. I. What was that movie? Fireproof or whatever? I think I watched that one, man. Just so bad. Just, just moralism. It's just when it falls into just pure moralism, you know, it's just annoying. So. And also one of the problems that every movie that I like is because it has, even though it's not directly Christian, it, it's because it's, it's kind of revealing some aspect of the story of Christ. And that's often why I find it interesting. So, yeah, it's difficult. Someone asks in the chat about the Chosen series. Ah, man. Like, I hate to say this, I'm not a super big fan of the chosen series. A lot of people like it. I get it. I understand. There are some things about it that I like. I, we watched it with my family the first season at least. You know, I like, for example, like the personality of Peter. I like, I kind of like his personality. I think that he kind of got that. But I think that it's just so hard to have someone play Christ, man. It's, it's so difficult. It's like I really don't, my, When I read scriptures, I don't see Christ as a, as a smiley, happy, go, lucky guy. I just don't see that. You know, I see Christ saying some really harsh things all the time. And so I feel like that kind of sober image of Jesus of Nazareth, for example, is more, is closer to what I see in Christ rather than this kind of, this kind of happy, smiley Jesus. But you know, it's like, it's hard because that the Christ contains so many images and so many. All the archetypes are kind of compressed into him. So it's hard because we all have our little, our little Christ, which is not the, which is not really the totality of, of his expression. So we tend to, to be attached to that. So it's like I, I, Yeah, okay. So, Mark Kalashnikov, ask, per your last Ethiopia conversation regarding the notion of the ark, what would it entail for one to be in the ark and what would that require? I don't mean get on a plane and go to a specific church to wait it out more. So if you could lay out a few things to attend to in relation to the concept of being inside the ark. So thank you for your work. So one of the aspects of the ark, which people neglect, is that the ark. People think of the ark as this, like, pure thing which survives the flood. But the ark is not a pure thing. It's actually a complete thing. It kind of has everything in it. And so I think that a lot of people think that creating an ark is going to be something like, you know, we're going to. We're going to do this. We're going to be the. We're going to be the pure ones, right? We're going to be the ones that are. That totally follow the tradition, that follow all the canons, that follow all the rules, that follow all of it. And, like, so we're going to hold out against the modern world. And I think that that type of approach, I think, is leading in part to the breakdown, because it's like an overcompensation for the chaos. So I think that the ark is something which is able to. To kind of have it all, the whole hierarchy of being in it, in itself. And so. So that's why. That's why I tend to. To talk about that, too. Like, I tend to talk about the manner in which there is the pattern, and then there's also the way the pattern breaks down and there's the garments of skin, and that this is ultimately all part of the total pattern. And so. So I think that that's. So being inside the arc, definitely it has to do with. With being someone who kind of participates and someone who is connected to all of this, right? Who remembers. Who remembers God and remembers scripture and remembers that which is important and then acts in consequence with that. Now, does it mean that you need to connect with other people? To a certain extent? Yes, I think so. Now, how that needs to happen, I don't know. Like, do you have to. Do you have. Do you have to go all the way to forming kind of like communities or deliberate communities? Maybe, like, I'm not doing that, but maybe that's the possibility. And so I think that that's. That's the best way to understand the ark. It's not. The ark is not reactionary. Right. The arc is also something which is a kind of positive cohesion. So, sorry if I'm being vague. This whole Q A, I'm just being super vague. It feels like, man, someone says the Left behind films in the chat, it's like, I never watched those. I never dared. I think I can't handle it. I couldn't handle the anger that would come out of me if I watch that series. Oh, mercy. All right, so Garrett Widner Says hello Jonathan. Very much looking forward to God's dog. I recently came across a 17th century Flemish painting by Jacob Jordan's called Moses and his Ethiopian wife Zipporah. And it's a poor is depicted with the headpiece that mig mix a cruciform halo of Christ. I don't think. Have I seen. I have to find this. Oh, whoa. Okay. Wow. That's weird. So best case scenario for this painting is that it was so far in, it was kind of so far in the breakdown of Christian art that they didn't even, they didn't realize that that's what they were doing. It's just a hat basically, you know, but it really looks like a halo with the cross. Man, I've never seen that. What a strange, what a strange image. Well, I have to look into it. People have tried to, to think about it that way. All right, so Nicola Alexic says why did Roman persecute Christians with such fervor? What kind of threat did they perceive from non conformity? It wasn't non conformity. It's that they wanted ro. They wanted Christians to participate in the cult. They wanted Christians to worship the emperor and they wanted Christians to participate in the public cults because they believed, and they believed rightly, that if some people didn't participate in the public cults, then the world would fall apart, right? Then the world would break down. And so that seems to be one of the reasons, you know, one of the other reasons is that the Christians became the scapegoats, you know, for all the problems, especially starting with the fire, right, the, the, the Neronian fire where Nero blamed Christians for starting the fire. And so they were the scapegoats. And they also did participate in, in kind of in a public romance rituals. So yeah, you know, but the thing this is you could say the secret about the Christians, which is that the Christians were bringing in a higher form of the pattern and that the Romans weren't able to perceive that at the outset, but the Christians. And one of the proofs that that was the case is that the Christians didn't try to cause a revolution. Didn't try to take over. Didn't try to. Yeah, didn't try to take over. And so they just were trying to be, you know, honest citizens in the Roman Empire, except for the, the, except for worshiping the emperor. And so that's maybe can help you understand the difference between, let's say this new pattern which is arriving on the, on the horizon, if it trying to devour the one that's in place explicitly, then already you have a problem because it's setting up this revolutionary pattern, which is just always a cycle waiting for another one to come. Get it? All right, so Norm Gronay said in your recent discussion on the French podcast with JP Marceau, you discussed Peter, John, Martha, Mary's example of contemplative and active. This idea. Is this idea akin to what Mathieu describes as meaning and matter? Yes, it is akin to that. It is akin to that. And so you have the meaning which is still and which is, let's say, attentive. And then you have the matter which is busy and multiple and embodying, you know, and so I think there definitely is a relationship between that. So, incidentally, why does Mary go out to meet Christ in the street after Lazarus dies, but Martha is the one at Jesus's feet while he teaches later in the house? I think you're confused about the story, because I don't think Martha is at Jesus's feet. I think it's Mary that is at Jesus's feet. So unless I miss something from the story, but that's my. That's how I remember the story. All right. Manuel Montiel, Ask. I don't know if that's how you pronounce your name, Manuel, but it just sounded right. Do you think it's relevant to look at the Old Testament prophets, specifically Isaiah and Jeremiah, as relevant symbolic patterns to what is occurring in the West? I can't help but notice a stark similarity between the messages of the prophets and how applicable it is towards modern Western culture. Yes, I mean, I think you're right. It's just hard because it's like you just. Sometimes I feel like even myself, I'm just too much of a. Of a doomsayer all the time, and it's just. It's kind of heavy and annoying. So you're right that there seems to be a need to cry out in the wilderness right now. But, yeah, it's difficult because no one. Not only will people not hear you, but they might hear you and then destroy you and, you know, say you're. You're crazy that you're all the things people accuse others of today. So Stephen Bishop says. Hi, Jonathan. In Icons of the Harrowing of Hades, the saints at Christ's right hand, usually Saint John the foreigner and the King of Israel, are depicted with halos, whereas the saints on his left, Abel and various patriarchs, are without halos. Why is this. Is this some right left hand symbolism? So why is John on the right hand of Christ instead of his usual left. Thank you. So, yes, I think it is related to that. And I've seen those images. I think especially one image or the image in Serbia, I'm not sure. Yes, I have seen them. And I have to be honest with you that I don't totally get it either. I. Yes, it is this idea. It is the idea of the right hand with the halos and the left hand without the halos in the sense of the sheep and the goats. But I don't think it's as simple. It's obviously not the sheep and the goats in the sense that the, you know, Abel and the patriarch and these and the patriarchs are not goats. But there's definitely a desire to show a distinction between the two. And so I think that that's why St. John is there on the right is because they want to have him with the halo. But. But I'm not sure how they decided which goes where because they're both, in a certain manner, part of the body of Christ. And so. Yeah, so I'm not sure. So. Don Diego de la Vega asks. Hi, Jonathan. Hope you are well. When the practical necessities of the world start pressing down on you, is there any specific prayer with symbolic significance that helps you fight despondency and to keep taking action on the task you need to do? I'm going to be boring, but it's just a Jesus prayer, to be honest. You know, it's just the Jesus prayer is the go to prayer to refocus yourself and to. Yeah. And to kind of find your center again. Michael Mueller asked thoughts on the Star of David. From an Orthodox perspective, I found the symbol infinite. Insightful to understand how the breakdown is part of a larger pattern. And so, yeah, the star of David, the hexagram, which has six points, so is. I think it's super insightful. There's a lot of interesting things there. You know, it's so it's. It's. It's two triangles, one triangle going up, one triangle going down. I think the best way to understand that is really as a joining of heaven and earth, you know, of a womb and a point and of joining together a cup and a sword, you know, like a masculine image and a feminine image, heaven and earth, basically, as being joined together, you know, and so I think that's what it is. And so it's so. So it's similar. It's related to a cross in that sense. Right. Because it's a joining of above and below. And so that's how I see it. So you can see it as, in a way, kind of the six days of creation with the seventh day as being the center or the kind of secret, the hidden. The hidden meaning. So I think that's. That's a good way to understand the. The hexagram. All right, so Janet Horstman says, what would be the correct way to understand a generational curse or. Or sin? I listened to your talk with your mate Tom, and I thought the way you explained the connection between sinful behaviors and principalities made so much sense. But do these principalities become more granular, like in the case of mental illness, alcoholism, substance abuse? That seems to run in the family. Is there a more particular principality over that reality? It's not that hard to understand generational curses or generational sin because your children are extensions of you. And so they. They kind of carry not just you, but, you know, of your ancestors, of your line, you could say. And so they. They kind of manifest those aspects in the world, you know, and that will include the positive and the negative aspects. And a good way to understand a generational curse or sin is to understand that patterns are more subtle often than we think. And so let's say, like the pattern of alcoholism, let's say it's good. See, Use that example. There'll be all these subtle things around it which won't necessarily be just the drinking, and they'll imbibe the group or imbibe the family. And so, you know, it. It could be all kinds of things. You know, paravalcolism could mean that, you know, the father's grumpy in the morning. You know, say he's an alcoholic, he's grumpy in the morning. Or he, you know, he's. He's distant, he's absent. And there's all these things which are there which make it very difficult because they kind of imbibe the structure. And so then let's say the child says something like, I'm not going to be like my father. I'm going to be against alcohol, and I'm not going to drink. You know, I'm going to be dry because my father was an alcoholic. Then they're participating in the pattern. They can't avoid it, right, because they're opposing it. But they're also probably imbibing some of the subtler aspects of that behavior, even though they're not. They're not drinking. And then. So then that can fall down into. Into the lower. Into the next generations. And so that's why sometimes it's so traditional peoples will maybe Sometimes describe it as something like a form of. Almost like a form of reincarnation or a form of cycling of the souls. Right. Some of some Jewish traditions have this idea where it's like these souls cycle. But you don't have to understand it in a kind of. Very kind of gross, you know, a kind of gross idea of reincarnation. You can understand it more as like psychic patterns which fall down onto the next generation, which imbibe them with certain behaviors, which lead to other behaviors. And so, so like I said, so you could try to break the pattern by saying, I'm not going to drink. But even by doing that, you're ultimately bringing about the possibility that your child is going to drink in reaction to you now, or by imbibing some of the more secondary patterns that you are still in, that you're still participating in. I don't know if that makes sense. I think that that's the way to understand that, you know, but there's also a way in which the positive behaviors are also. They also fall back down on your family. And it's often in the same way in. Almost like in a kind of unseen said on, you know, an. An unsaid way that if you act certain ways and if you are certain ways, you speak certain ways, if you treat your spouse with love and respect, then without telling your kids to do that, they will also imbibe that, you know. And so, so you can understand this. Like, you can understand it in ways that maybe are. Are easier to understand. You can maybe understand it. So you can see sometimes something like the children embodying the actions or the subtle patterns of their parents. And so you can find a child that will actually express the anger of the spouse, even though the spouse isn't expressing it will become like a vehicle of their anger or a vehicle of their resentment. And so the spouse might not even have said, would never even say to the child, like say bad things about. About their husband or their mother. But the child will receive, will notice, will mimic patterns, and will see the implications, even unconsciously, of what is happening, what the dynamic is. And then will kind of, as a fruit will embody that. And so it's complicated stuff to. It's complicated stuff to deal with. I think that that's why you kind of almost have to deal with this as a. At a higher level. You have to deal with it at a. At a level which has more to do with, you know, going to church together. I don't know what to tell you, like just being together and sitting together and sharing positive patterns together so that the negative ones don't take over. Man. Why is it that this entire Q and A, I feel like I'm just speaking things which will give fodder to kind of secular atheists to say that I'm just spouting gibberish. I'm not. What I'm saying is coherent, but I may be not expressing it super well today. All right, so Arie Fisher says, hi, Jonathan. Is the Lamb slain before the foundation of the world the only way there could be something rather than nothing? Is it right to understand the sacrifice of the sun as the necessary way in which finite things could come into being out of the infinite? So I think so. I really think so. And I think it's very mysterious and it's something which is obviously. It's. Obviously might be controversial to some, but I think, like I talked about earlier in the Q and A about this idea of the. Of the pristine form which has to be pierced in order to. For the world to exist. You know, I think that there's something of that which is necessary. It doesn't necessarily have to be the cross. It could be something more subtle. You could see it like something like the divine Logos eternally gives himself up to the Father and then gives himself for creation. And it doesn't necessarily have to involve, you know, putting to death like we see on the cross. Although. Although that's a legitimate version of that pattern. It can have a higher expression, let's say. I don't know if it's higher or maybe a different one. All right, so Amy says we are commanded to be obedient to our. Our authorities. But if the system coming does end up looking like the looking dark mark of the beast, would taking the procedure be a qualitatively higher engraver participation in that pattern which than any other time we sin and choose a worldly good over obedience to God. And so it's very simple. Like, I think it's important that I'm clear about this. Like the mark of the beast, the way that it's presented in Scripture, is that it is a form of apostasy. That is that there's something about receiving the mark which includes an apostasy, which includes a form of turning away, explicitly turning away from God. It's not accidental. It's not like you could have taken the mark of the beast without knowing, and then you find out that you took it, you know, whatever. And so that's important. And right now that's not there. It's not there at all. I mean, not at all. You can feel it moving towards that, but it's not there yet. And so, like I said, one of the dangers, one of the manifestations which is closest to this is the idea of having to have a passport, a sanitary passport, in order to go to church. That I think is the closest thing to coming right up to that symbolism, because then it's about a hierarchy of priorities, right? Where it's like the state is now the. The gatekeeper of religion, but it's no different than Peter the Great or, you know, making the church a bunch of. A bunch of state workers, making them into. Into state, you know, civil servants or whatever. And the same with what happened in Europe in the. Especially in the Protestant countries. So all that is part of the symbolism, you know. All right. And so James Cortidi says, are you familiar with Alexander Dugin? I've just been exploring his work. Seems. Seems to be lots of fruitful ideas to explore. And so, you know, I think that for sure, Dugan has good insights, especially insight into the breakdown, insight into what's happening in the world. I think that my difficulty with Dugin is the same difficulty I have with Julius Evola, which is instrumentalization of religion, which is basically seeing religion as a tool to bring back a form of government and a form of state. And as you. If you watch my videos, you know that I don't think that the way in which the religious lays itself out and how that affects the state and the way the state will lay itself out, I think those aren't completely unrelated. But all the times when the church has become just a tool of political ideology, things go completely haywire and go off the. And so. So, no, I'm not. I'm not a big fan of Dugan because of those reasons. Jason Gadawalt says, What are the 14 trees? Book of Enoch, Chapter 3. Observe and see how in the winter all the trees seem as though they had withered and shed all their leaves except 14 trees, which does not lose their foliage, but retain old foliage from two to three years till the new comes. I don't know why. Fourteen, two times seven, I guess. And so two years, two weeks, two years. So the idea of a pattern which persists as the other patterns fall apart, like a kind of a pattern which is more. More is stronger than the others. So I think that's what it seems to be, you know, just. Just patterns that last longer, you know, and so as the others kind of fall apart, holds the world together for longer. So. And maybe it's 14. Because it's like two weeks. Like the idea that it's not just one cycle, it contains more than one usual cycle. So Jeff Dunlop says it's a roughly finished cabin. A masculine structure, as I've always thought. Or is it actually a feminine structure that invites the masculine? Yeah, I think it's mostly that. I think it's mostly that, you know, it's. It's, you know, in a way, the. The men. Men are attracted to the wild because they're attracted to, you know, just like. Just like men like to ride horses, right? They're attracted to potential, you know, they're attracted to cars that are attracted. Make. That are. That have a lot of power, you know, that have a lot of. Whereas women are almost. Almost like attracted to the opposite of that, which is meaning, you know, which is ahead, which is something. Which. Which shows. Which shows the structure. Right. And so that's what they're attracted to. That's the way I see it. I don't know. So, Matthew F. What is the symbolism of the healing power of Peter's Shadow in Acts 5? Yeah, that's a really interesting. Really interesting story. I have to think about it. I have to think about it. Something about death. Turn against death, I guess. But, you know, that's easy to say. I've never thought about that. So the wakeful. Ask, dear Jonathan, can you speak a little on the symbolic difference between exclusion and the marginal wakeful? They're the same thing. And this is where. This is actually where my. My postmodernism is still alive, or where Deida is still kind of alive in me, is that there's no such thing as total exclusion. That is, anything which can be named is within the margin of the identity, anything which can be recognized. So complete exclusion means that it's no longer even. You can't see it. You can't recognize it. It's actually not. It doesn't have any hook onto the system because even excluding you exclude in relationship to something. So exclusion is always in relation. So even the outside of an identity is related to the identity. It has to be. That's why we won't say that the. The. I don't know. Like. I don't know how else to say it, right. And so as soon as something is seen as excluded from something else, it's still connected to it. It has to be because it's excluded from that. It's not excluded from something else. It's excluded from this identity. And so it is, in a bigger sense, it's still within the Identity, it's still within. It's still affected or connected to the being, which excludes it. And so it appears as margin, it appears as scapegoat, it appears as monster. It appears as. As, you know. All right, so Marcus, David said, what are your thoughts on NFT art? Would you consider offering your artwork as NFTs? And so. And so, I mean, yeah, I told you that I might be doing God's Dog as a. As. As NFTs, but I'm not sure yet. Like, I'm still figuring this stuff out, I'm still seeing how it works. And. And so there's also Neil Degrade of Derpo Robbins wrote me today and said we should do an NFT project together, which could be cool to do that with him just for fun. But for sure, if I do an NFT for the comic book, I want to make sure that it's not just a gimmick, like I would like to. To create a sense of added value, you know, of. Of added value to the. To the property, you know, instead of. Instead of just rarity, for rarity's sake. And so I. That's why I have this idea of creating rarity with certain ciphers or certain co. Certain keys to some of the symbolism, which is. Which is layered in God's Dog. So in. When you read God's Dog, when you end up reading the comic, you can read it straight through in like an hour or whatever. It's not. Doesn't take long to read it. If you just read it through and you. You'll get the story and it'll be totally fine and it'll be an entertaining story and it'll have interesting characters and it'll have character arc and all that stuff that you find in stories. But there's all these things going on in the background, even in the images that will be. Won't be, let's say, visible to a lot of people at the outset and also continue on in the other stories. And so the idea would be for those people that are willing to kind of dive into the NFT world, we would offer keys to this. These symbol. These symbols. And once they have the keys, then they can do what they want with them. They can. They can keep them for themselves or they can share them with others. They can. Maybe they won't even understand the keys. They might have to ask other people to help them decode the. Even the hints. So that's kind of what we want to do to create a more participative treasure hunt feeling with the NFTs so anyways, we'll see. I don't know if we're going to do it. It's a plan, it's an idea. If you like that, make sure to tell me so that I know it's worth the effort, because it's going to. It takes quite a bit of effort to plan this stuff out. And so. So, yeah. All right. So Chandler Turner said, I had the great pleasure of attending a concert recently. And regardless of COVID it took no time at all for a mosh pit to form a curious phenomena. And I have seen people walk out of them with broken fingers, black eyes and the like. Yet when you ask people this is often what they enjoy most about going to shows. So my question is for you is what is the symbolism of the mosh pit? I mean, it's the symbolism of fighting, but it's just a. It's like a toned down version of fighting. It's a. It's a toned down version of. Of or not toned down, but it's similar to rough and tumble when you're fighting with your brothers or your cousins when you were young. You know, it's kind of experimenting with the limit, experimenting with your own strength, your own capacity to. To absorb danger, to come in contact with danger, to, you know. So I think that that's what's going on in. In mosh pits. Um, so, yeah, all right, so I think in theory, the other questions, either they didn't make it on time or they've been kind of put aside. All right, so let me go through one or two. It's ten. Like, I'll give you another five. Five. Another five minutes. I was hoping to make these like two hours tops now. So. All right, so Divided Differences says, hello, Jonathan. I followed you for a while now, and I've begun to incorporate some of the symbolic patterns you've described into my creative writing. People I trust have commented that some of my writing and the form of the stories seem cliche in a sense. It doesn't bother me since I want to tell stories about truthful patterns. However, I want to strike a balance between authenticity and instantiating the pattern, which have affected me very deeply. If the comparison fits between iconography and writing, where do you draw the line between authenticity and relating patterns? And so I think that if you truly kind of are able to embody the pattern, then you're able to have intuitions about their. Their depth, then it's not going to come out so much as a cliche for most people. And so cliches are Often when people just use tropes and not completely understand their implications. And so that's, I think, what happens when cliche. And so it's almost like a. It's like a pattern, but a very superficial one. So I think that's. It is just to really kind of. And I would also like. I've told people, be careful when you're writing, not to think about symbolism while you're writing. You should kind of write intuitively and then go back and then edit with symbolic thinking in order to kind of hone things and rearrange them, reorder them, so that they're closer to the patterns. But I think it's better not to think about symbolism because you'll usually. You'll just be frozen. You'll just freeze because. All right, so let's see. Let's see. Last one. Let's see which one we do. All right, so let's try this one. Cormac Jones, Ask. In the navigatio of St. Brendan, there's a part where St. Brendan and crew come up on an island with a tree that is completely covered with birds. St. Brendan asks God what the deal is with all those birds. So one of the birds flies over and tells them they are fallen spirit spirits, casualties of the fall of Lucifer. They say they did not consent to their demise, on account of which God preserves them from pain. But they are cut off from the faithful spirits and forced to roam the earth annually at Pascha, they are allowed to gather and praise God. St. Brendan spends the paschal period singing and worshiping God with the birds. Is there a right and wrong way to understand such a story, man? Yeah, you gotta love hagiography. They dare things that, you know, are kind of on the. On the edge. I mean, so the thing you can get out of this is to understand that. That ancient people and that in terms of structure, that birds are related to angels, that there's a relationship between birds and heavenly patterns, you could say, and so you could understand. So the idea would be that if, when the angels fall, they. They, you know, they. Because they're not so bad. Like, if they were really bad, they would have fallen into snakes and pigs, right? Like Christ puts them into pigs and sends them into the deep. But because they're not so bad, they're like the jinn. This is actually maybe a good example of the jinn, because I've asked Father Stephen de Jong from AD Lord of Spirits, you know, whether or not there's a notion in Christianity of jinns, which are these intermediary beings that are kind of fallen but not so much or in neutral or not so much. This actually seems to be to be at least supporting my theory that this is a. This kind of has to be a part of the. Of the structure. And so yeah, I think that that's probably the way to understand it. There are some patterns which seem to not be totally evil, but also seem to kind of be in between or neutral or. Yeah, so that's the way I would understand that. And so I think we're done because it's 10 and so look, I know some people will have been disappointed that I didn't get to your question, but it was just becoming too unwieldy for me. And so I hope you can understand that I. That I kind of have to do it this way. And so this now. So now it has for the patron. This has become a competition. So I didn't mean it that way. But yeah, the sense that. Right. Concise questions, interesting question. Things that I haven't. Haven't said before. And so. And so. Yeah, so. So go for it. And so I'm looking forward to. To next month, please, if you can think about it, you know. Sign up for God's Dog on Indiegogo. You can go to godsdog.com to find the. It points to the preview of the crowdfunding. Sign up for the newsletter. On October 31st, on Halloween itself, we launch and we're really hoping to send a message with this to send a sign that we are the future. I mean, not me, but I mean in the sense that the world is being reenchanted and we need to put our stake down to stake into that re enchantment. We need to open up for the possibility of telling different kinds of stories. And so hopefully this will be my little launch and Matir's little participation and quote Cord and Philippe Cartin who made the colors like it'll be our little contribution to trying to bring about a new type of storytelling. So thanks everybody for your attention and yeah, I will see you very soon. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon the Pageau videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
