{"episode_id":"SW - #172 - 2021-08-24 - June Q&A","start":12.56,"end":7798.54,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. First of all, for those that are new or just showing up, the way this works is people that support me on patreon for like $10 or more, they get to ask questions in advance. And so I usually go through all the questions. I've been able to go through all the questions until now, unless some, some, sometimes some questions I just, I just kind of skip over if they're not appropriate, if they're, if they're too long, maybe. But most of the time I get through all the questions and then if people put in super chats, then I will look at those when I'm done with all the questions. So that's the way it works. And I have a few announcements to make. I am going to be. For. This is going to be like my first trip since the beginning of COVID I will be speaking at the European Men's Gathering. It's the first week of August this year in Denmark. So it's in Jutland, in Denmark. You can look up on the website. It's called manifesto.com but it's man like M A N I P H E s t o manifesto.com and, and so yeah, I'm going to be speaking there. It's a wild bunch. You know, they, they have a whole mixture of kinds of guys there. Alexander Bard, who maybe you have seen online, is part of that group. Andrew Sweeney, who I've had discussion with before on my. That I was on his channel recently, and a bunch of other guides, people from all kinds of backgrounds, all kinds of ideas. And so it's going to be wild. But I'm really excited to have been invited there. I feel honored to be invited there as well. There's also an Orthodox priest who will be there, who was there last year, who will be there as well. And so it's going to be like. It's going to be a pretty intense kind of clash of the minds and laboratory for exploring ideas. And so I'm pretty excited to go there. So if you want to sign up, I'm sure there's still room there, especially with COVID and everything. I'm sure they still have room for people who are willing to, to go to Denmark and participate in that. So that's pretty exciting. I am still working hard on my new website. I've slowed down a little bit just because I've been able to have the, the branding and the logo done by an amazing artist. Her name is Heather Paulington. You can look her up online. She's actually the one who's doing the costumes for the new Lord of the Rings series. And so she's really amazing, and so I'm working with her on my logo, and she's going to help with some of the branding. So all of that is kind of coming together. All right, let's start with the website. It is super hot here. I know it's hot in a lot of places, but, man, today was a tough one. Okay, so here we go. Let's start with the Grubmeister asks. I recently saw a map that showed UFO sightings are overwhelmingly in America, Western Europe and Australia. Other parts of the world have a much. A much lower number of sightings. What is that? What it. What is it that predisposes people in these countries to see UFOs? I have a feeling it has something to do with an inability to see organic link between spirit and body as a result of living in a highly materialistic society. But I'm interested in your thoughts. And so I would say that. I would say that you could describe it in two ways. I would say that there are secondary causes. The secondary causes probably have a lot to do with the fact that we live in a extremely technical society in which we have replaced the. The lights in the sky with all kinds of other lights. You know, with their satellites, planes, all these things kind of going around. And probably some things we don't know about, obviously, some, especially in America, there are probably some secret vessels that nobody knows about. And so because of that, there are a lot more UFO sightings. That's one of the reasons. The other one. The other reason is probably a more kind of mythological reason. And it has to do with. It has to do with the relationship between aliens and the kind of the end of a. Of a world. You know, if you want to understand that, one of the. One of the best people that has actually put that in. In. In narrative form is in the movie Apocalypto, where you see the. You know, you see the. At the end of the movie, you see the Spanish ships on the horizon appearing, and when by the time they shake the hands of the Spaniards, you know that their world is over. And so this is something which I think has different layers of manifestation, but UFOs seem to participate in that same. In that same. In that same phenomena. So you could understand it as the fact that you have unidentified stars. And so unidentified principalities are kind of appearing all over the place. These strange principalities are remanifesting themselves. And so. And it's kind of like this Flood of this lack of cohesion appearing as all these gods appearing on the horizon. Whether, whether you. Doesn't matter what the material cause is, it's just happening in that way and through all kinds of means. Whether it's all the people taking psychedelics, whether it's people wanting to re. Embrace pagan, old pagan religions, whether it is people who worship science. All of these things are all related if you understand kind of the symbolism of the book of Enoch and the. All the traditions that are in there. So it's not a good sign, that's for sure. When we're flooded with UFOs and UFO sightings, it's not a good sign. Yeah. And short answer is there are more demons, just more demons in the US than other places right now. Sorry, I don't want to like Bash. And not just the US but just like in the west, let's say, you know, the floodgates are open is the best way to understand that. So yeah, yeah. Drag Brekker says the stranger. So yeah, indeed, that's it. It's so it's. But it's just a different levels of reality. The idea that the stranger is kind of flooding in it. You don't have to take it only at the political level. You have to kind of understand it in terms of ideas, in terms of technology, in terms of. Of. Of lack of breakdown of identities. All of this is kind of happening all at the same time. So. Exactly. All right, so let's continue. I think if I take too much time on each of these questions, it's going to go on forever. So I'm in a weird mood too, man. When I get in this mood, it gets strange. All right, so Pneumaesh asks, how should we understand the nature of tradition? It appears to be a part of the body of Christ's participation with that which was handed down from the apostles in scripture. Keeping in mind that not all things that come to be traditions are equal in status. Yes, I also can see the tradition helps us connect to the past and helps us not rely on our understanding of things. But I also see a danger in that too. Those who came before us could set a bad precedent. Future generations could build on top of that. Or something that gets integrated as a tradition that should not have been is accepted. I know a lot of times bad ideas can be weeded out, but it's not automatic. And bad ideas can still linger for a long time too. So yes, you're absolutely right. And so the best way to kind of understand that is to understand that ultimately the church or the body of Christ has a. Has a kind of natural mechanism by which it will. It will integrate certain things and will kind of cast out other things. And it's going to happen organically. It's messy, but it's not. It's not. It's not. It still happens. The best text to understand kind of tradition is really a text by Vladimir Losky, which I've recommended several times called Tradition and Traditions. You can find it online PDF of it. And it really kind of shows how tradition, that which is handed to us, which is the idea of understanding what tradition is, that which is handed to us is a very inclusive term and includes Scripture. And so when we say something like Scripture is part of traditional, we just mean we have to understand it as that which has been handed to us. Because the reason why we trust Scripture is because it has been handed to us to a certain extent, or at least the reason why we attend to it in the first place. So, of course, Scripture has its own validity that you can, to a certain level that you can discover and the richness you can discover in reading it. But the fact that we give it authority in the first place is because it has been handed down to us by those that we. Those people that we trust and those people that we see kind of in line behind us between us and Christ. So that's the best way to understand it. So there are different types of tradition, different levels of tradition. But ultimately, tradition is also just a way of seeing the world. And it has to do with what people sometimes called the mind of the Fathers. And so it's kind of a lens by which to view reality. And so I think it's easier to understand that today. So. So, yeah. All right. So Nelson, Justin Evans asked, what is the symbolism of malicious compliance? Malicious compliance means being obsequious, to show flaws in leadership of others. Malicious compliance, I don't think I've ever heard that term before. People conform into the letter, but not the spirit of a request, okay. By strictly following orders of a superior while knowing or intending that compliance with the orders will have an unintended or negative consequence. Okay, so that's the idea. So the idea is it's. You follow. You basically follow the rule to the letter, knowing that by doing so you will actually cause harm. Right? And so, like, what is the symbol of malicious compliance? I mean, it is. It's something like. It's something like a death. Like when Christ talks about, you know, with the idea that the Spirit is living but the letter is dead. And so that's an example where it's where you know, if you, if you try to follow the letter then you can actually twist it and you can kind of turn it towards something which is, which is false. I to talked about this before where like reality is actually held up from above, it's not held from below. I know that for a lot of kind of scientific types this is going to sound frustrating, but below down here is variability and, and, and fluctuation and, and you know, and idiosyncrasy. And so it's like you could read a law or you could, you could read, take something and be extremely idiosyncratic in the way that you interpret it. And it can be actually accurate based on, on the, the text, let's say of the law, but becomes a way to actually, to destroy, to destroy the, to destroy the body, to destroy the being. So you know, it's like whitewashed tomb, right? That's what Christ calls, calls that kind of, that kind of behavior. So Timothy Aspisla asks, hey Jonathan, I love how pleasant Islamic geometric patterns look. And I've seen pictures of churches where they are being used. I'm fond of the idea that we can properly integrate this artistic tradition, but I don't know how to read them. What's the meaning of these patterns? And so I mean the meaning. They're patterns, they're really kind of pure patterns. And so they depends on which pattern. But you know, the way that you encounter a pattern or a shape will also depend on what it is. And sometimes it's not, it's not necessarily a narrative meaning. It's more, it's like it's, it's a structural meaning or a structural pattern. And then sometimes it can be applied to narrative structure. So it really just depends on the pattern. But I agree, like to me one of my favorite times or artistic moments in history is what we call the Normand, the, the Norman Sicily where the Norman were kings in Sicily, but they were also very close to the Byzantines and at the same time had very good relationship with, with, with, with, with Muslims that were in Northern Africa. And so if you look at those churches like the church in Palermo or the church in Cefalu, you have these amazing synthesis of Christian architecture with Islamic mosaics and then beautiful Christian, Christian mosaics as well of images and stuff. And so yeah, I agree. I think that there, there are ways to kind of int. That could be really powerful. All right, so Luca Askovic says what is holy anger? In your video about Prince Ivan and the Great Wolf. Prince Yvonne's mouth gets mount, gets eaten by the gray wolf, but then the gray wolf becomes his mount. Yvonne's tame body was replaced by a wild body, which is more powerful but also more dangerous to Ivan. And that's when you mentioned holy anger. Can you elaborate more on it? What is it, who had it, and what are the examples of it? And so, I mean, holy anger can be manifested at moments when the integrity of. The integrity of an important body is in danger. You know, and so there, There is a way in which, for example, you can. How can I say this? There's a way in which you can self sacrifice, and that is the highest form of virtue. But there's also a way in which you can defend the weakness. And that is also a very high level of virtue and spiritual manifestation. And so, you know, a soldier who will defend the. Defend a noble cause or defend a weak can manifest holy anger in seeing something which is beautiful, something which has integrity, something which is. Which has coherence, be destroyed by people with bad intentions. And so I think that in scripture, you see. You see examples of that, and it mostly has to do with kind of desacralization in scripture, especially, you know, when, you know, when somebody profanes something holy, then there's like a holy anger which manifests itself and then tries to cohere that holy place and prevent it from being, from being, from dissolving into the world. And so that's how I see holy anger. I mean, holy anger is kind of an extreme way to stop the world from being completely destroyed. So, yeah. Okay, so Josh the mover asks, can you discuss the symbolic relationship between oil and blood? Also, any plans to chat with Father Silouan Giustiniano? I've seen him making the rounds on some other podcasts. And so can you discuss relationship between oil and blood? And so it's difficult to. What you mean? Like, do you mean, if you mean something like oil? Like oil, for example, for anointing and then blood, maybe. So if it's something like that, then I would say that oil is more related to. How can I say this? Oil is more related to kind of naming in the sense of, like, showing what is true. So it's like, imagine like liquid light if you want, like liquid light coming down from above. And so you anoint a king, you anoint a person, you anoint the pillar, like Jacob anoints the pillar in the. In, you know, when he has the dream of the. Of the ladder. So imagine like liquid light, which is kind of coming down and showing where the light falls. Right. And so you imagine the person has oil on their forehead. They're shiny, you know, therefore they're reflecting light. And so. And then blood has more to do with covering it. So it's more like that. It's more like a kind of. Kind of covering. And. And also obviously it's related to. To a form of purification. And so that's as. That's as close as I can get. You know, as for Father Silouan, I would love to have Father Silhouette on my channel. I would very much love that to happen. So. All right, so C. Mange says, what is the symbolism of naming after something? Children? Cities and places are often named after an influential person, a saint or an event. Occasionally it is reversed. A child is named after a city or place. We now see traditional or classic children's names being replaced with trendier names, thus connected to something. Neighborhoods and streets are sometimes named after an influential person in the community, schools, business theories, movements, et cetera, often named after people. Typically the person who was the first in the domain. Exactly. Or who inspired the domain. So you already kind of have your answer in the question. It has to do with Principality. It has to do with the idea of becoming the. The head of something, becoming the origin, the head. These things are very much related. And so the origin and the head of things are. Is. Is very related. And so it's like the point that unites certain. So imagine it's like you. You have a point that unites certain things together. And you want. Especially if you name something based on a founder or. Or someone who's important in a field, you realize that that person becomes like an axes around that field turns. And so you want to name a laboratory after an important scientist or some cure or whatever, you know, because you realize that that person is already a. A point of culmination, of meaning in being an origin of a field or something like that. Now, in terms of naming cities after people, it mostly has to do with a kind of recognizing of that which we model. Right. We model these people. And so we name things after those that we model. And that is actually how Principality works. That's how these heads and bodies that kind of lay up that layer themselves in the world. That's how it functions. So. So I hope that makes sense. And the idea that right now people are naming their kids after like, meaningless names that they just put. They try to find the most random thing to like, name their names or just sounds that sound nice. Yeah, it's a nice. That's a nice sign to break down, if you want to know. It's like, it's. It means that we have nothing that we all look towards, nothing that we all look to, you know, so you can imagine it like, even, let's say, in terms of a smaller scale, the idea of like naming someone after your father or naming someone after your mother, naming one of your kids after your father, you know, that's the kind of thing where it creates this line of. Or this order of principality. And it. It b. It binds you together. Closer it binds. It creates cohesion. It actually works that way. All right, so from Mikal, what is the symbolism of mermaids? Anderson's Little Mermaid, not the Disney one, had a vibe. A confused angel attempted to join herself with a man that would bruise giants, but instead sacrificing herself and becoming a proper angel. Disney flipped it upside down. Yeah. In Western Christianity, mermaids seem a bit like cherubs guarding cities like Copenhagen and Warsaw. Germans even had a weird story of a bishop fish from the Baltic Sea blessing the king of Poland with a sign of a cross. So mermaids are just hybrids. That's what they are. They're hybrids. They represent the edge. The edge of. Of the world. They're like other hybrids, like centaurs and. And sa. All these kind of hybrid creatures that live in the forest. But now in terms of the water, there were these. These hybrid fish, man, you know, hybrids. And so they become. So you can understand them, you know, as becoming the object of. Of desire. You know, like they become erotic figures because they are the strange woman. Like in an extreme way. You know, it's like people like all those. All those freaks. I'm going to say there's all the 4chan types with their cat ladies. It's like there's something about the. There's something about the hybrid on the. On the edge, which is. Which is attractive, but it's also. So it represents. Also in this. At the same time, it represents kind of inaccessible potential. Right. And so obviously you're not. You can't. That's what the. One of the ideas of, let's say Anderson's Little Mermaid is that you can't cross these ontological levels. Like you. To do so is. To. Is. Is dangerous, right? It. It is. It creates a problem. So in terms of. Of the Little Mermaid, it's not exactly the same as the. The angels and. And humans. It has more to do with something lower. Right? More. Some. Something like. Something more like hybrid animals. Something like to, you know, sweet tooth and all that kind of stuff. Stuff, it has more to do with that, you know, and so it's like this idea that identity would, would kind of dissolve. But yeah, in terms of the, the, the Anderson, I'm not sure, I'm not sure that his symbolism is, is the proper one. I don't know what to tell you, and I'm not that big a fan of, of Anderson's fairy tales, to be honest. It seems like in his fairy tale it has to do with something like class culture where, you know, the idea is like, know your place, right? You can't move from where you are. Almost like a caste system where if you try to pretend you're something you're not, then it's going to split you in half. It's going to, it's going to cause you pain and all of that, which is not completely false, but is also. Yeah, it's definitely not like the Christian idea, let's say, of, of. And I think also like she. He actually changed the ending of his tale. If I remember correctly, the first one he had just kind of dissolves and becomes seafoam. And then, and then people didn't like that. So if my understanding is that he changed the ending to make it more kind of make it look kind of like you said, like that she. Now she's kind of brought up into heaven or whatever. All right, all right. So Goof asks, is the act of creation a type of precursor of the fall? It would seem to me that creating heaven and earth is a move towards multiplicity. And at this higher level does not yet denote a negative connotation. However, it appears that this move to multiplicity is the pattern that can or does become a fall at lower levels of being. The act of creation seems to destroy a unity or oneness in a way not with the Trinity, but in turn releases everything it creates the other. Typing it route right now, I realized that this would make an act of creation the act of creation sacrificial. The first sacrifice. Maybe that is why sacrifice is baked into reality. Sorry, I'm rambling. I would very much appreciate your thoughts on that. So, yeah, so the idea is that. Is that this is a really important question. It's a very important question because it's the reason why everybody loves Gnosticism again, because people struggle to kind of understand reality as the union of love and to understand that unity does not preclude multiplicity. Multiplicity is gathered within unity. It exists potentially in unity and it can exist even explicitly, you know, let's say out of unity. But remaining within unity if it remembers the one. And so the multiple that remembers the one is participating in the unity of the one. It's actually participating in its unity. And so Saint Ephrem the Syrian has one of the most beautiful images of that where he says, you know, the saints, the saints, they come down the mountain of paradise and then they walk on the water of the ocean. And so in, in this image, it's as if all of this multiplicity now is, is positive. It's like it all has this kind of positive beauty. It's like it's the glory of God, right? It's not, it's not at all a fall. It's like the creation then becomes the glory of, of the infinite in its multiplicity. And so that's what you would say would be the positive aspect of that. And when, when multiplicity wants to have, let's say, wants to exist on its own, that's when you experience the fall. But there's, that's the mystery that I've been trying to point you guys to. This mystery, which is very, very deep, deep, deep and difficult mystery, which is that there's something about death, which it's like if you were able to experience death in the right way in Christ, let's say, then that death itself would be. Glory would be changed when I say, I say changed into glory. It's not just not changed in the sense that it becomes something else, right? It's changed in the sense that the very meaning of death is now exposed in the light of, of Christ and it becomes glory. So anyways, talking about that kind of stuff is probably not very useful. All right, so here we go. So. So. VSAC 2008. I think this is blessed fee to Pentecost. Jonathan, I've been reading Exodus lately and I admit always struggling with the plagues of Egypt. I know it's a big topic, but I was reading the one on hail today. Could you share any insights on that one? There are a few things I noticed. First, for this plague, Pharaoh's servants hear the warning and act to save themselves in their households by taking refuge in their houses. Second, once Moses raises his staff, there's thunder and hail and very interestingly, a fire passes on the earth. Finally, there's a focus on damaging things in the fields, especially structure bearing things. Men, animal grass and field trees are mentioned. Thank you. So. So the best way I think to understand this, it has to do with this, this kind of, these kind of opposites. And so you can understand that it's. I Mean, first of all, just the idea of like water, of like destructive water coming from above, or like this hard water that's coming from above, and then then also fire at the same time. So it's like there's hail and fire at the same time, which seems like a complete contradiction. But you understand it, if you understand it exactly as that, as kind of the two opposites happening at the same time, rather than the opposites alternating with each other. So here's a good example of another way of seeing this, where when the Hebrews leave Egypt, then what they have, they have alternating fire and water. So during the day there's a column of, of of water, a column of, of a cloud, and then during the night there's a column of fire. So they follow the column of fire during the night, and they follow the column of water during the day. So you can understand it like no matter how you, the totality of its meaning, you can, you can understand it as this alternating reality, like a motor, right? So it's like the day, you know, the hot day is led by the cool water and the cool night is led by the hot flame. And so think of it as a yin yang symbol if that, that's useful to you. You have like the white with the black dot and the black with the white dot. The opposites are led by their other. And this is what is making the cycle turn properly, let's say. But then when there's a confusion and then both happen at the same time, then that is when it, it causes a breakdown. And so this is actually probably a really good time to understand that, you know, the idea that it's like fire and water at the same time. Like, think of our day, think of our age where you both have the most intense level of control that has ever existed, you know, police state that has ever existed in the history of humanity with the most control and quantification and calculation that has ever existed. And at the same time, this sense that we live in a constant carnival and that anything goes and then anything can happen. And so it's like the beast and the together, right? They're just somehow, they shouldn't be together, but they're together. And so this is this image of, let's say, hail and fire at the same time. At least that's my, my kind of understanding of that. So I think that the fact that it destroys things in fields or it destroys trees especially has to do with this breakdown. The breakdown of, of of the world is destroying the structures, it's destroying the things that are holding them together. And so. Yeah, and then maybe the going. The taking refuge in the house and taking your animals into the house with you is like an image of the ark, I would imagine so that's the best way that I can understand that. Anyways. Those are hard. I mean, they're hard to understand those kinds of things in scripture. All right, so CS Street Soul says about a month ago, a castle, which is purported to the basis of Count Dracula's castle, made in international news by giving free vaccines. Sorry. The castle made advert signs and masks where the victims syringe. The vaccine syringe were the vampire fangs. This is hard to believe. The castle also offered a free tour of their torture exhibit. If and when you got the vaccine from them. What are your thoughts about this event? Is this an example of symbolism happens? I would say, yeah, it definitely is. I mean, is it really a necessity to. To say what this means, like, or what. What is going on here? Yeah. You will be a slave of the vampire. I don't know what to tell you. You know that movie there, like those, those early, early versions in vampire movies, like of. Of actually Bram Stoker's Dracula, where you would. You would see the woman, you know, with the pale eyes, who'd become just a. A slave to the vampire and does all his will. Yeah, that's right. All right. Becky Baumgartner asks says in your conversation with Richard Roland, you characterize the US As Babylon and the US west coast as the ultimate margin. Born and raised in the Seattle area. I can attest to the freakish strength of the principalities here. Can you discuss what role the US west coast might be playing in the strange apocalyptic time we live in? So this is actually an opportunity for me because someone wrote me. I forget his name. Sorry, I forgot your name. But someone wrote me also in private. And it was someone who was a member of the military and who had spent many of his life, much of his life, defending his country. And he was a little bit taken aback to the fact that I said that the United States is the in Revelation. And I understand that. I actually, I felt sympathetic because as soon as I said that, I regretted it. Like I was. You know, it's one of those things where you say it, it's too late, and then you kind of regret it a little bit because I feel like it was too easy for me to just say it that way, but that I probably should have been able to explain it a little more. And the US Is the edge of the world. And if you Want to understand the West Coast? It's the edge of the edge of the world. It's the end of. It's the western point in civilization. It's the place where the sun goes down. California is the end of the world, folks. I don't know what to tell you. And so I can use the image of California maybe as an example of why I think why I said that, you know, and, and I probably don't even have to tell you, you know, what California is like, everything that it's related to in terms of Hollywood, in terms of music, entertainment. Yeah. Pornography, all of that. It's all California. Right. And so, but there's something else going on, and this is also the, the, the something else going on in the United States as well, which is that I also believe that just like in Revelation, I'm going to tell you something here that I've never said, I guess maybe publicly. So in Revelation, the best way to understand it is that the beast, the. And the New Jerusalem, they're all images of the city. They're all images of Rome. You could say there's something of Rome in all of those three. And the idea that Rome becomes Christian and something like the founding of Constantinople, where it's the first Christian, the great Christian city, becomes an image, a little image of this new Jerusalem. And so it's not the new Jerusalem, but it's like an image, a fractal image of this change, this, this kind of beast killing the. If you can imagine someone like Diocletian, right, clamping down on the Roman decadence, and then, and then after that, you have this change where you have a conversion, and then finally the, the, the. The arrival of Christian Rome and the founding of Constantinople. So I think that the. In the United States, something like that is going to happen as well, that the United States is not just a whore, but is in a way, the horde, the beast, and possibly the place or the potential out of which something like the New Jerusalem will occur. And you can already kind of see it because you can see that on the one hand, Christianity is dying and most visibly attacked, you know, at least ideologically, right now in the United States. But it's also the place where it's still has one of the strongest bastion and one of the most authentic bastions. And so someone in the chat is mentioning Father Seraphim Rose. So, yeah, Father Seraphim Rose and his monastery are in California too. And in California, you have everything. You have all the worst and you have all the best. And that's the strangeness of the end, that's the strangeness of this final moment where you can't completely separate the wheat from the tares. And you know that it takes Christ to return, let's say, in order to do that and to. And to be able to separate one from the other. And so hopefully that will help to at least mitigate a little bit my comment about the United States. But I, for sure, I think the United States is going to play one of the most important roles in how all of this moment plays out. Like all of this, whatever it is, breakdown, whatever it is, it's going to happen. It's gonna happen in the US Guys. A lot of it's gonna happen there. Okay? So. Yeah. Okay, so let me give you an example, for example, of the difference. So imagine a, right? So A is a place where all the nations come onto this. You know, all the. She. She shares her body with all the nations. And so she's not. She doesn't discriminate. She just. She trades with all the nation. That's the Right. And so she. She's completely. She's full of wasted seed of everybody, right? And so that's. That's what the. Is. Sorry, it sounds explicit and everything, but it'll help you to understand, right? And so that's the. The. It's a place of mixture, right, where all the. All the seeds just kind of mix in her. Right? And so. But then there's the image of the New Jerusalem. And the image of the New Jerusalem, it says in that image, read it in Scripture. It says that all the glory of all the nations will be gathered into the city. So what's the difference. What's the difference between the whore, which is the place of mixture and breakdown of identity, and the New Jerusalem, which is the place where all the glory of the nations get gathered into one place. And so it's the difference between mixture and synthesis. It's the difference between chaos and hybrid and a kind of synthesis which gathers all things into them hierarchically, right? And so you can imagine that the. The new Jews him is above and gathers all the best things of the city into itself, right? And so it's the opposite of a. But you can understand how they're related because they're opposites. And the idea that one can flip and become the other, that Rome can become Constantinople, Right? That. That's part of. That's part of the mystery of. Of Christianity. So. So, yeah, so sorry. Symbolic means. I'm a Symbolic means says I'm on no fap. I'M gonna. Not gonna. I'm gonna. Not gonna imagine a horror. Sorry about that. If I'm. If I cause you to sin, I am very sorry. That's not. That's not my purpose. I just want you to understand this because it is important. Like, it is important to understand the difference between mixture and. And synthesis. If you. If there's a problem right now in the world, it's that people can't tell the difference between a hybrid and a truly synthetic being, you know? All right. Okay, here we go. So Keenan Cronin says, as our churches start to stray by bringing in foreign gods or denying Christ or generally following the Judas pattern, what is the right thing for a parishioner to do? Man, it's just tough. Some people online seem to recommend changing church for a better one, but that feels like a revolutionary move. Should we try to save our churches by appealing to the leadership? Or could there come a time where someone might need to leave their church to find a new one? Yes, there is a time where you need to leave your church to find a new one. I'm sorry to say this. And you should follow what it says in scripture. Now, the difference is now this is important. So you don't want to leave to start your own church. If you're doing that, you're wrong. Like, you're completely off, right? But there is a point where things break down so bad that you need to reattach yourself to something, but you need to reattach yourself to something that has authority, that's not just made up. It's not just. You know, and so sometimes it can mean that you can just leave a parish to go to another parish. It doesn't mean that you have to leave the whole thing, Right? You can just try to. Try to identify priests, pastors that are coherent, that aren't completely swallowed up by this madness, and attach yourself to them. And so, you know, I. I know it's hard. It's a. It's a hard moment, guys. It's a. It's a tough moment. So I would say follow what it says in scripture. If you. If you have a priest or if you have some. Your pastor or the person who is responsible for you, if they're saying insane, crazy things, you should go to them and you should tell them what it is. That's a problem. And if they shrug you off, if they don't take what you're saying seriously, then you have to go up, you should write to the bishop, you should go to whoever is above that person, and then you should talk to them. And if you find poison all along that line, if you find corruption all around, then, yeah, then you need to find. You need to find someone, you need to find another body. I mean, I'm saying these things and it just sounds horrible, but this is not an easy time and it's going to be messy and it's going to, it's going to cost you something. It's not going to be cheap. It's going to cost you and it. And it's going to be painful. But sometimes it's necessary. I'm not saying I'm not, I'm not. Don't use me as an example. Like, don't go to your, your priests or whatever and tell them that Jonathan said that I should leave the church. Because that's not what I'm saying. Saying you should take it very seriously and you should approach it carefully. But sometimes the world is. There's a lot of rot right now around us and we need to. We don't want to. We don't want to subject ourselves to something which is completely rotten. Like if you're in a liturgical church, there's some hope for you in the sense that if the priest, if the priest is saying stupid things but is doing the liturgy and is accomplishing the sacraments in a straight, upright way, then already you should be careful to leave because the sacraments are proper and the liturgy is doing its role. And you can still worship because the things that are being said are right. But it's harder if you're in a church where everything depends on the pastor. And so. And so it's like the pastor basically decides the tone of everything that's going to happen. Then that makes it more. More difficult, you know? Yeah. All right. So Phil says, Jonathan, I enjoyed the Symbolic World episodes on Sir Sir Gawain and the Green Knight. I wonder if you've seen the Trainer trailer for the latest film adaptation. Yeah, I did. See. So what are your thoughts on reviving this tale as another big budget movie at this point in time? Assuming it is true to the story, does it point towards a renewed interest in the symbolic? Maybe. I think it's possible. It depends how it plays out. It's almost impossible to know. It's almost impossible to know how it's going to play out. Now the world is so topsy turvy that they could make this. They could. They. People are. When you see an ad for like a traditional story being shown in a movie or in a new version of a novel or whatever, it can Be really bad, because it can be just another desire to subvert it and to kind of infect it with these viruses that are going around. And so we'll see. I'm looking forward to seeing it. It looks powerful. Like, it looks like it's actually kind of following. You know, it has a kind of mythological sheen to it. When you look at it, there's something about it which seems to be trying to be almost kind of operatic in its visuals. And so I'm looking forward to it and hope that it's going to be. That it's going to be straight. But I could probably bet that he's going to sleep with the. With the wife of the. Of the guy in the castle. There's no room for chastity in our world. But if he doesn't, then I will applaud and I'll say thank you. Thank you for. For some, you know, a hint of. Of. Of. Of straight. Of straight thinking in the world. All right, so David Flores says most traditional legends have heroes riding horses, lions, griffins, wolves. But in your recent Revelations video, I realized the whore Babylon is writing is a writer mounted upon a dragon. Indeed. How does the mount influence the characteristic of the writer? And so, indeed, you can understand the mount as a kind of. As an expression of the writer. And so think of it. A good example is, of course, the cherub. So you can imagine in the Psalms, it talks about how the. How God is writing the cherub across the sky. And so think of it now. So imagine God is riding the cherub across the sky. And then now think of Christ in his glory with the four beasts of Ezekiel, who are also the four evangelists that are manifesting him. And so that's a good example. And so you could imagine that Christ's chariot is the Gospels, right? Christ's mount is the Gospels. It's scripture. It's the material substrate that carries his message, that carries his story into. Into the future. And so that. So then the. The idea that, yes, there will be a relationship, the mount will be an expression of the writer. A good. Actually a really good. A movie that gets that really well is how to train your dragon. They get that. They actually get it very well. They treat the dragon and how to train your dragon as a. As an expression of the person, as a. A kind of almost animal version, you know, like. Kind of like the more animal side of the person, which is being. Which is being controlled or directed by the writer. And so. So how to Train youn Dragon. Do it really well. Yeah. And then but then it becomes really weird because they make it really clear that that's what's going on. Like, some of the dragons even, like, physically resemble their. Their. Their writers. If you. If you look at the other people in the. In the. The Vikings group and then in the last movie, then they. They. They. They have this weird situation where the dragon of Hiccups is trying to. Is having, like, a weird romantic relationship with, like, the. His mother's dragon. It's weird, weird, weird. And like, his. And then his father dies, and so. And then his dragon and her dragon are having this, like, weird kind of romantic thing. It's just very odd. It's very. When I was. I was watching, I was like, what are they doing? Why are they doing this? It's very disturbing. Anyways, I hope I'm the only person who saw that. Oh, no. Now I've infected all of you with that perception. But it's like, it was just very odd. All right, all right. Okay. So we are done with the symbolic world, so let's move on to Patreon. All right, here we go. All right, so, Tanner Mathis, now it's on. Patreon asks in your recent videos about marks have made me think about how glasses are a mark. They give their users the ability to see properly, but they also are also a signal of a deficiency which requires technology to be corrected. Why do sunglasses not have a similar impact on our perception of someone? Is it because they only solve a problem which everyone has, so they are not really a mark of deficiency, or does it have something to do with their ability to obscure the eyes? Yes, there you go. I was like, I hope he gets there, because you're. That's what it is. That's what sunglasses are. And that's the double aspect of the veil, right? The double aspect of. Of the supplement. Like, one of the aspects of the supplement or one of the aspects of the veil is to protect the. To protect with that which is behind it. So that's why you hide something. That's why you wear clothing. So you protect. So you wear clothing to protect. To protect yourselves from the cold, but you also wear clothing to protect yourself from the stares of others. Right? You want to. You want to keep decency inside. And so the sunglasses, they act as a way to shield your eyes from the sun, but then they have. That's the original purpose of the sunglasses, but then there's a secondary purpose of sunglasses, which are to hide your eyes from other people. And you can see it like rock stars use sunglasses that way. You know, you saw that, you see those interviews in the, in the 80s or 90s with rock stars that are wearing sunglasses and you don't know where they're looking, you don't know what's going on. You, you, your face with like a mask. And so that is the, the, the other aspect of sunglasses, which is more kind of a social, social version of what the social, the sunglasses do. All right, so I'm new to this. So Jason, Jason, Jason Schweitzer. I'm new to this and I'm not sure if this is where I submit questions. Yes, it is. To the best of my knowledge, the name Benjamin means son of my right hand. But every time someone is described as left handed in scripture, it states that they are from the tribe of Benjamin. What on earth is going on here? Maybe it's obvious and I'm just not getting it. Also, thank you so much for everything you are doing. God bless you and your family. And so, man, if you only knew, ah, if you only knew how much I've thought about this. And it, I. In that, in that thing, in that, in that question, there's the whole, there's like a whole relationship between the, like the crossing over from the left hand to the right hand. This, this, this thing that I've talked to you about and makes. Drives me crazy, the relationship between the left, the left when applied to myself, right, the left when I am acting on the left hand and then the left when I am acting on others. And so it has to do with that, it has to do with this flip which happens between the left and the right hand. And so I'm afraid that one day, so I'm telling you, I'm promising you guys one day I will make a crystal clear video about this that clearer than anything you've ever heard on the symbolism of the left and the right hand. It's almost there, but it's not quite there. And then hopefully in that video I will find a, I will find a final solution. I think that materials probably figured this one out more than I have should ask him. So Anne Herrera says, I've noticed that you threw a lot of shade towards charismatics. I find this amusing. And so I'm asking this question in the same spirit. Besides the obvious perversions and pitfalls of that any expression of Christianity can fall into, what exactly do you disagree or dislike in the charismatic tradition? I've read your bro's book and it seems to me that charismatics, especially in worship, have this beautiful meeting of time and space in which they wholly submit themselves to God, hierarchy, order, and fully open themselves up. The potential of the Spirit to move in unexpected ways. And then she says that I should ask people to vote for the. The questions. That's probably something that will happen at some point, because right now there are too many questions. And so I struggle to get through them. And so first of all, I want to apologize. When I throw shade at different branches of Christianity, it's not the proper way to do it. And I. And I've been. Several people close to me have told me that I have to. I. That I should avoid doing that. And I will, and I will try to do that just because I don't think it's the proper way to approach things. There are some things that I disagree with in terms of Protestants, but there is no need to do it that way, especially when we're in this kind of moment of. Of breakdown. We need to encourage each other as much as possible. But having said that, I will nonetheless answer your question. My impression of charismatics is that they are something like that. The issue that they have is something like a kind of wildness of spirit. Like there's a kind of. There's actually is a, A, A lack of stability, let's say. So that's why charismatic groups tend to split all the time, you know, because there is a sense in which there. Because there is a. There's an attachment to this kind of direct connection to the Spirit. And there isn't a grounding, a proper grounding in the kind of stabilizing forms of hierarchy and of tradition. Then there's a tendency to, to kind of, to lose yourself in the spirit, right? To, to kind of, to only keep. This is. So, so imagine like in Pentecost, there is an element of Pentecost, which is that everybody perceived them as drunk. And so there's a drunkenness that is real, let's say, in. In. In. In the. The Spirit. But it's mitigated by other aspects of the church, you know, by the fact that St. Peter rises up and kind of acts as the leader of the apostle, by, by all of these, all of these different things that, that, that are kind of holding it together. That is what I feel is the danger of the charismatic tradition. And, and so it goes in all these directions and all these gifts and all of these miracles and all of this stuff. And, and it tends to fragment. So. But, you know, I think I've met many a charismatic person that is, that is extremely. That are extremely sincere and extremely dedicated and so. And so. And I've learned quite a bit from some of them, so I want to make sure that that's out there as well. But I do disagree with their theology and their ecclesiology as well, so. All right, hopefully that's good enough. So Bjorn Olson says hello, Jonathan, I hope you're doing well. This is more of a request and a question. I would really like to see your symbolic interpretation of Frankenstein, specifically the original novel by Mary Shelley. Now, there's your AI for you. Yeah, the novel also has some quite interesting themes of turning death against death. Perhaps a future Halloween video. And just to bring an actual question, what kind of music do you like? And so, yeah, I agree. I think Mary Shelley's Frankenstein is a prophetic book and I think it manifests a lot of the issues of. Of the arrogance of science, the arrogance of man, you know, the arrogance of artificiality. You know, if you think of things like Frankenstein and the story of the golem and the. The appearance of robots on the horizon, let's say around this a similar time, in terms of a concept, all of that is. Is. Is. Is very important to understand. But, yeah, I could definitely do that. Maybe it's a good idea to do it on Halloween. You know, I have read it, so. And what do. What kind of music do I like? I don't listen to music anymore. I used to listen to music, you know, I actually really did used to like Kanye West a lot. And I listened to. And I kind of grew up on. I'm in a guy of the 90s, you know, I grew up on that kind of music. Just kind of. I was a skater, so I like punk music and I liked kind of alternative music. You know, what is it? My. Like, was it the first concert I went to the Pixies in the. In the. In the early 90s or late, late 80s, early 90s. So it gives you an idea of what I liked when I was a teenager, but. But I don't listen to music these days. Actually, the only music I listen to now is Bach. I just. Especially when I need to do something in which I'm focused, I like, listen to Bach and then. Then it helps me get super focused, so. Hi, Johnny. So, Anders, dad says hi, Jonathan. Can you tell me about the most extreme memory that you have from your time in Africa? Maybe it involves the basket behind you. Yeah. Was this a symbolism happens kind of moment? Yes, it was. And so indeed, I think I mentioned this in a video before, but for those who haven't heard that basket that you see behind Me, right here, this is a Rwandan basket. And I. We actually. My wife and I actually bought it in Burundi when we were in the Great Lakes area of Africa at some point. And when we returned to Congo, we came to. To the east of Congo. And we were supposed to be there just for one day and then take a plane back to Kinshasa. And. And a war started while we were. While we were staying there and we got stuck in a Swedish guest house. We actually were in the newspaper in, like, the national Swedish newspaper. There was a picture of us caught in that between two walls as they were bombing and shelling the city. And so I just have the memory because at some point we tried to get the UN to come get us. And so luckily the head of the UN in Congo was the Swedish guy. And so the people from the Swedish guest house had, like, an inn with him, so they called him. But they could never come and get us because every time they would talk, it would start shooting again and there would be shelling and explosions. And it was weird. Like, we. People were trying to kind of relax as the. The whole place was. Was being bombed. And so they watched the Meet the Parents, they would, like, play the movie, and then the bombing would become so loud that they would have to stop the. That they would have to stop the movie while we were just sitting there. Sorry, I'm laughing. You know, I laugh in the worst possible moments. It's just I'm not supposed to laugh here. Anyways, so finally they get in contact with the head of the un and so they decide they're going to come get us at the guest house, but we need to get our stuff in our room. We were, like, in a common building and we needed to go get our stuff in our room. And that basket was in our room. And so I left the main building where you were, and there was a shooter that was on the corner of the wall of our. Of where we were staying. And. And so there were bullets that were whizzing through the trees. And I actually, at some point, like, these bullets were whizzing over my head and I had to. I had to kind of like, duck on the ground. And I just remember feeling this, like, rush. My goodness, it was like. It was the most insane rush that I've ever felt. And so I went into the room and got this basket and we were. We were evacuated to the UN compound. And there at the UN compound, everybody was drunk. Everybody was completely drunk, and it was just absolutely insane. Anyway, so that's the most Intense memory I have from Congo. It goes on, and it involves being threatened by weapons, you know, being caught in our. In our. In our house. Because everything broke down after that and there were riots in the street. It was an intense, very, very intense time. But if you were interested, it's very strange because where we were staying in the UN compound, there was a punk band that. They're called Sum 41. And they were in the compound with us. I didn't know about them at the time. I learned about them later. But they were in the compound where we were, and they actually filmed everything. And so you can find it online. There's a video called Rocked in Congo which documents this whole event. And so I only watch it like 10 years later, or maybe less. Maybe like eight or nine years later. I watched this video, and I'm watching this thing that I went through in this, like this. This video by a punk band. Anyways, it was. It was a wild. It was a wild times. That was my most intense. But there are many, many that are at a similar level of intensity. Yeah. So that's why I keep that basket there, to remind me of death. All right. Okay, let's see. Let me just check something. All right. So I needed to look it up because someone says, can you comment on Psalm 133? It's only three verses. And so it says Psalms 133. Let me read it. How good and pleasant it is when God's people live together in unity. It is like precious oil poured on the head, running down the beard, running down on Aaron's beard, down on the collar of his robe. It is as if the dew of Hermon were falling on Mount Zion. From there the Lord bestows his blessing, even life forevermore. So you can see it if you want to, if you. Okay, so let me say it as a mystery, if you would like. And then because it's only three verses, you can figure it out. If you want to understand the relationship between emanation and emergence, if you want to understand the relationship between top down and bottom, up there is your image, and we talked about it before. So oil, light, this light coming down from above and running down the head and the beard of the priest, you know, and then going down all the way down. You can imagine, like, it goes down all the way to the fringe of his robe, let's say. I wonder if. I'm sure that when it says down the collar of his robe, I'm wondering if it's going down to the fringe of his robe. Let's Say, and so you have this, this light coming down and then it says, the dew on Mount Hermon, the dew of Herman were falling on Mount Zion. And so now you have this dew on the ground right on the mountain. So you have the light coming from above, you have the dew on the mountain, which is something like, you know, the. Let me say this. It's like the bubbling up of the earth or of. Of possibilities, like this little water on the ground that is waiting. You know, it's kind of like the feminine down there. And the. The dew on the mountain is. Is the feminine, let's say. And so. And then it says, you know, from there, for there the Lord bestows his blessing and life forevermore. And it's like, that's how life works. It has from above and from below, meeting together, meeting of heaven and earth. That's what's going on there. Why Lauren says, what do you think of. Think the massive popularity of ASMR says about modern society, hey, whatever. Just another freak. Just another. I mean, just another thing that is in an idiosyncrasy, which is. Which could be another idiosyncrasy or all the. All the weird stuff that get people excited. So Don Diego de la Vega says, hi, Jonathan, your man of explaining the symbolism within Christianity was one of the significant missing pieces that brought me back to the face. So thank you. Well, it's my pleasure. In the movie Beowulf, Beowulf sneers at the Christian faith, saying it has ended the age of heroes and left them with only weeping martyrs. Movie ends with Beowulf sacrificing himself for his loved ones from the dragon he created through his own sin. Then he dies on the beach with tears in his eyes. Hoping you've seen the movie. Would you have any thoughts on that? Yes, I have many thoughts on that. And the thought I have on that is that here again, am I going to go on a rant on Neil Gaiman again? Here is Neil Gaiman not understanding Christianity, but being haunted by Christianity because it's a Christian story which is criticizing Christianity. The version that he created is such a Christian story where he. Where he has to, like, where he. Where he sins and then his sin comes to haunt him and then he has to make atonement for his sin. It's like. And then he sacrifices himself as the final atonement for his own sin. It's a good Christian story for a story that goes. That is all about bashing Christianity. Oh, man. All right, so Dusan Babik says, hi, Jonathan I feel like I'm, I'm in a weird mood. I'm going to say something really weird is what I'm afraid of here. Why? In hagiographical text, it is often said that the pagans worship stone and wood when we know they have different stories about, for example, Zeus as a real living entity doing stuff. Didn't they think of idols or statues of gods as representations of real gods? Thank you for your work. Greetings from Serbia. Yeah, that is, it's an interesting point you make, and I think your point is the best way to understand this. And biblical scholars are going to hate me for saying this, but the best way to understand it is that you can understand it like the Hebrews were encountering the fringe of the tradition, right? They were kind of encountering the, the, the. These other traditions in their, at their end, where in fact they had kind of devolved in something like our materialism. Not exactly, but something like it where they were confusing the letter for the spirit. And they were. Even, even though their idols were already suspicious because they were these wild principalities that they. It was even lower than that where they were just basically, you know, worshiping the matter of it. You know, worshiping the matter. So if you think that's not possible, it's like, what do you think the new atheists were like? What do you think all this, all these scientific materialists are doing? They're doing exactly that. So it's not that weird to think that that's what they were encountering. They were encountering something like a completely decadent tradition. Yeah. So. Walrus King 14 I Jonathan, nowadays it seems that most people either understand luck from a materialist point of view, where it's seen simply as a numerical possibility, or from a sort of divination perspective where luck is a force to be controlled. Lady luck and the use of things like charm, special clothes and personal rituals. How do either of these understandings compare to how the people of the ancient and medieval eras understood luck? And how do we reconcile the notion of luck with our belief that everything happens according to God's will? Does luck have room to exist within the Christian mind? So lots have room to exist in the Christian mind. And so you can understand it as luck in the sense that on the edge of reality there's a place where order breaks down and that things become idiosyncratic and that they don't follow logic. And so that's lots. And so lots are ambiguous. They can become the place of the highest insight. And you see that in scripture for Example, you see that the ancient Hebrews had these stones that they used to discern the will of God that they would probably cast and that they would be able to read. And you see it also in the election of the new apostle, where they cast lots in order to discern the will of God. So you can understand it as a possibility of a place where there's insight, but it also can devolve into the other aspect of luck, which is this giving in to the illogical and giving yourself of the place where, where logic breaks down. So gambling. You see, in scripture it says that the. There's a. There's a place where it says that, for example, so the Hebrews had this ephod with the, with the stones on it, and they would use that to cast lots. But there, There's a place, for example, in Joshua where it says that, that they became. That they, they kind of. What's the word that they use? But something like they defiled themselves with the ephod like that. Basically this same word, this ephod became, Became a place for them to kind of become like to, to kind of fall into chaos, into. And to, to defilement. So you can understand it as these extremes, you know. So, you know, the, the idea of the wheel of. Wheel of fortune is a good, is a good example of that that was kept in the Middle Ages where the sense where if you give yourself over to fortune, then fortune is a mistress, right? Fortune is a wheel, fortune is a. Is a trickster. And you know, if you give yourself just to the world of that kind of world where you give yourself the fortune, then you will, you will find yourself above, you find yourself below. Like you, you. You know it go. The wheel of fortune goes round and round. And you don't know, you don't know where, where. Where it's going to. Where it's going to take you. So, so. Yeah, so something like. So I think the word, best word to use is chance. You know, the use of chance. All right, so Vianney Duternois says hello, Jonathan, why the altars have four horns? They're linked to the patristic tradition that the burning bush had thorns. What about Abraham finding a ram with his horn stuck in a bush on Mount Moriah? May God bless you, your family and your work. So the four horns have to do with just four. In general, it has to do with four extensions. And so it has to do with a square, has to do with a box, has to do with the idea of four corners which create stability. And so Imagine the four horns on the four corners of the altar. Something like the four. The four glories. Not exactly, but the idea of these four manifestations, right? And so you have four directions. Those are four horns as well. You have, you know, it's, it's the creation of stability. You know, the idea of four. Now a horn is a point. It's a, it's a. It's a point. So it's like four points. You need four points in order to create stability. If you just have two, then you have duality. If you have three, you have this kind of dynamic relationship. If you have four points, then you have a kind of a stable thing on which the world can work. And so think of it more like. Think of it something like the four directions, if that can help you to understand it that way. So it's like, it's an extension of the world in its, in its different directions. So the altar is like a little microcosm which has four directions. And you cover them with blood in order to cover the world with blood or cover the extension of your, of your manifestation with blood. Extension of the country, extension of the people that are coming to sacrifice. You cover them, you cover the corn of the altar. And it, it's like a. It's like a ritual act which represents the covering of. Of space itself, right? So it's just. Space itself is a good way to maybe understand it. A square. That's the best I can do with that. So Artem Carnock asks. Hi, Jonathan, thanks a lot for your work. Some Orthodox churches, including the church in Ukraine that I belong to, use church Slavonic language and liturgical and everyday prank practice. What is symbolic meaning of using a language that people have a hard time understanding? Does this function like a veil that protects the altar from being fully exposed to the people? I also thought that using it can function like a remedy for the fallen human nature that is attracted to something foreign and marginal. So this is, I think it has more to do with unity. And so the idea is that you use a language which binds more people together. So you can imagine you use Greek. And so Greek binds the entire. At the beginning of Christianity, Greek is something in which all the different peoples of the Mediterranean had access to. So it was actually a way to create a kind of universe, a small, you, universal language that people can. That can function under. So now imagine now you have these Greeks and then you have these Russians, these Slavic people. And they have nothing to do with you. Like, they have. No, they don't understand your, your thing like, they're not Greeks. They have no there. They're not connected to the world. So now you want to evangelize them. So what do you do? You. You're like, okay, so if I evangelize them, if I try to bring them the message of Christ, am I going to do it in every single one of their, like, dialects? Am I going to. Like, am I going to. Or rather, is Christianity actually going to become a way to bind larger groups of people together? And so the. The missionaries go to the Slavic lands, they actually give the Slavic people there an Alphabet. And in giving them an Alphabet, they. They modified the language. They had to. Or they had to at least condense it, symbolize it, right? They had to bring it together into something which could be recognized by everybody, but also not be exactly the way everybody speaks, because everybody speaks different. Everybody has their little dialects and little accents or little ways of doing things. So you have to find a way to join all these people together in a common language. And so that's why it looks that way. The same thing with Latin, the same thing with, like, Amharic in Ethiopia. The same thing with any liturgical language. It's a way to bind more people together. But it does have a negative. There's a negative aspect to that, which, like you said, which is that if the languages that it's supposed to bind together move out too far, then at some point it loses its capacity to bind them together, you know, and so then you have to find some kind of compromise. And so you'll see it in parishes. Like, sometimes they'll say, okay, well, we'll do the liturgy in Slavonic, but we'll do the gospel in Russian or Ukrainian or in the local language, you know, in order to also condescend to. To. To the local place where I am, we'll do the homily in. In a local language. But you have to understand that Ukrainian, Russian, all these Slavic language, they all have commonality in. In Slavonic, right? Just like all the Romance language have commonality in Latin. And so that's why even today, the Catholic Church, to its strength, keeps Latin as its official language. Even though they translated all the liturgies, they still use Latin in terms of all their. If you write a. Like a theological treatise for the church, if you write like an encyclical or whatever, it has to be written in Latin because it's the. It is nonetheless the language in which all of Western Christianity kind of finds its unity. So that's how you kind of have to understand it. So it's so. So the idea of like, of translating and moving towards multiplicity and unity, it's a tricky thing. And you really have to understand it. It's tricky. So let's say this. Like you. So you translate the liturgy into English. So which English are you going to translate it into? Right? Because if you go, if you go to Queens in New York or if you like, go to Arizona, if you. Depending on where you go in the US and depending on which level of education you're dealing with, the English is not going to be the same. And so you have to find a way to translate it into English in a way that binds people together. That is not too high, it's not too low, that is somewhere in the middle. So even when they translate it into local languages, the problem of Slavonic that you pose becomes the same problem. It becomes the same problem. It's just not as immediate because people, because something like Slavonic, it's kind of far behind. And languages have changed so much that people struggle to see, to recognize the place of unity, let's say. So it's tricky. So Chase and Lindsay. Hey, Jonathan, Is materialism just a giant century spanning anti magic spell or network of anti magic spells? Yeah, that's a good way to understand it. The good magic and the bad magic. But it's a spell with a countdown. It doesn't last. And then when it runs out, then it leaves, then it. For some reason, all the dark magic comes in first. So you know, it's not great. So Dorotez says, hi, Jonathan, is Jesus sweating of blood, a mini version of the blood and water coming out of his side of the cross? Also, is there a relation to giving birth and opening blood and water? So for sure, when, when Christ is pierced on the cross, there's a relationship with giving birth. You see that in the church fathers all the time. You know, you hear it in the hymns during the, during the Holy week. And so. Yes, I've never thought about that in terms of. But I think you were onto something. I think you're definitely onto something. The idea of sweating blood as a mini version of that. Good catch. Yeah, I think you. I think you're onto something, Johnny Rath. Jonathan, what's the symbolism of the 5 second rule? If you drop a bit of food and it's perfectly fine to eat, it has only been on the floor for five seconds. I don't. And then two. How do you feel being the intersection between the IDW and the afcu? I don't know what The AFCU is. What's the afc? The AFCU is. Does somebody know what that is in the, in the, in the chat? All right. I have no idea. And what's the symbol of the five second rule? I mean, it's, I think it's, it's the symbolism of understanding that the earth is the place of death and that if something is on the ground for too long, then it's dead. You can't eat it and you can't. If you can't, you can't consume it anymore. You know, it's a funny, funny way of thinking because we eat stuff from the ground all the time. But you know, I think that's what it is. It has to do with recognizing that the earth is a place of death. Someone. Samuel Ramillaris is AFCU American First Credit Union. Yeah, I think it's probably not that. I think it's probably not that. All right. Okay, so Oana says hi, Jonathan, thank you for all you do. Her. Jesus sanctified the life stages of people's lives just by living them. Wondering about old age though. Any insight? I mean, he saves Adam. So, you know, it's good enough in terms of, in terms of sanctifying. In sanctifying old age. That's the best way I would see that. So John Nathan Hart said, Jonathan, sorry if you address this already in recent set of videos on satanic imagery as I've not gotten around to watching them all yet. But what is the meaning of Saint Peter being crucified upside down? My instinct is that it's signifying the descent of God to earth through his church, mirroring humanity city's ascent to God through Christ. There's this, there's a lot of mystery, dude. There's mystery in that and there's mystery in St. Peter. There's some mysterious stuff in that. I think. I don't want to go into that now. I, I promise you that I will one day make a video on that. And it has to do has. Well, I could say it simply. It has to do with the double symbolism of Peter. It has to do with the fact that Peter is both the stone on which Christ builds his church and the Satan at the same time. You can't just have, you can't just look for one in Peter. If you look just for one, you're missing something. And so you can understand that the cross is upside down in the sense that it's a, it's a, it's a reflection of Christ. Let's say in a pool of water. It becomes also like a. Like a foundation, like a. Like a pillar planted in the earth, let's say. But like, let's say Peter's head is planted in the earth, let's say, and it becomes a foundation stone. And then Christ's head is above. And so that means that he is both the pillar. Yeah, that's. That's. That's the mystery of Peter. Yeah. And it seems to be a cosmic mystery of some kind that will. Yeah. Anyways. All right, let's keep going here, E.B. how should we think about organ donations that Christian participate in this? I think it's okay. I don't. It doesn't bother me just because it's like the body is. You know. Yes, you. You manifest yourself in your body, but you're getting body from other things all the time. It's not like your body is just something that you don't get from the outside. And so I think it's okay. So Annie Crawford says it was Harry Potter that fully awakened me to the symbolic world, or what I usually call a sacramental worldview. Forgive me if I have already. If you have already talked about this somewhere, but in general, what do you think of the way Rowling uses symbolism in the Harry Potter story? Maybe. What would you think is a symbolic highlight in the story and. Or symbolic myth? My personal favorite is the demonic inversion of circle imagery in Voldemort's cave in book 6. I have not read the books, by the way, so it's like I'm not like, I have this big. It's not like I have this big understanding of. Of. I just watched the movies once. I wasn't super impressed by Harry Potter. I'm sorry. I just. I don't know why. I don't necessarily have a reason. There's something about it which was so technical. It's. I really hate the idea that something like magic is just treated simply like a technical thing, like a. Like a. Kind of. Just like a chemical formula that you. That you get right. And then because you get this chemical formula right, then. Then all of a sudden it's like you're a powerful wizard. There's something about that which I really dislike in terms of the use of magic in a. In a. In a more story, in a kind of storytelling. And so. So, yeah, I think that's probably why I didn't like Harry Potter. I just didn't really completely get attached to it just because I. There's something about the way that they treated. They treated that. That I didn't enjoy all Right. So Stephen Bishop says, I've often seen icons of the martyrdom of St. Ignatius of Antioch being eaten by two lions, one upright on his right and one upside down on his left. Is this formation. In this formation, they almost make a circle as though they were going to flip. Is this an example of turning death into glory? Yes. I don't. I think it's mostly an example of kind of the right hand and the left hand and him being the center of these two extremes, let's say. That's what it seems to me. I really also am very attracted to that image. I find it. There's something about it which is very powerful. And so you can imagine like two snakes, let's say, like the idea of the caduceus with like, the two snakes, like a left hand and a right hand snake, or the bishop's. The bishop's crozier with the two snakes on the side. It seems like there's something to do with that. But the proper understanding that one snake is going up and one snake is going down, which is probably a better understanding of those two. Those two tendencies, let's say. And so, yeah, it's definitely an image of standing nation becoming like the center and then animality being around him. And, you know, he becomes almost like a ladder or he becomes an image of this place where things connect together. And so I think it has to do with that. Like the two serpents, all of that. So Kenan Wang asked, in icons of Pentecost, there's often a man symbolizing the world. What is the significance of how he is represented and where he exists in the picture? So he, he's outside. That's the most important part, is to understand that the, the dark space at the bottom of the icon of Pentecost, which, in which is black, is the door to the outside. And so the, the. The king. King cosmos, you know, is, is the outside itself. It's kind of like the, the. The old cosmos, the old world, let's say, that's reached its end. And so usually if you see him, he's. He's holding. He's holding like a veil or like a cloth. And in the cloth there are, like, there are 12 roles. So those 12 roles are something like the 12 teachings or the 12 extensions of the. The 12 apostles or the 12 that are there, because it's not even the apostles that are there. It's like a kind of a more synthetic image of the 12. Let's say that the idea of these 12 and extending out into the world and being Received, you know, in 12 languages or 12 different extensions of, of Christ manifesting himself. And so that's the way to understand that. So it's like a, like an old dead man who is at the edge of the world and is in darkness and then receives the, the, the, the, the out. The expression of these 12 rays of light, you could say. And so it fills the world. Right. It's all flesh. When it says in, in, in the Psalms and in different places in the Old Testament that the Spirit will cover all flesh. And so that's what it, it seems to represent. But not just all flesh, but all things. So it's like, it's not just people, it's also all of creation, which is filled with the spirit of God. Yeah. So Drew McMahon says, Any thoughts on Rasputin? I don't have any thoughts on Rescue. There seems to be different opinions about him. I've met particularly Orthodox people who see him almost as a saint, and then other people see him as basically the cause of all of the, the breakdown of Russia. So I don't know. I don't know enough about Rescue. So G. Garcia says, what's the symbolism of body switching stories? It's mostly those, Those stories are mostly about. They're mostly, they're mostly about this weird, this weird kind of duality that people think exists between the body and the soul, which is a, which is a. It's an illusion. Illusion. The idea that your, that your body is just a, Is a shell. Right. The ghost in the shell idea that it's just a shell and you're like, that. You're like this kind of pure spirit. That's not how it works. You know, identities have to be embodied in body, so you can't switch bodies. It doesn't mean anything like who is you that is switching bodies? So that's what I think. I don't, I don't. I, I, I find, I find them. I find that they're, they're an image of the kind of Gnosticism that we engage in and just in popular culture. So Garrett Widner says, I was wondering on the symbolism of nuclear power, specifically when the atom is split and the radiation associated with that, it has to do. It has to do with the idea that power is contained in matter, you know, in a, in an extreme potential way. And that, you know, you have to be careful unleashing that, because it is. It is. There's a lot of power hidden underneath the world. Let's say that that's what is hidden underneath the world, is power. Is potential, but there is a lot of it. And so you have to be careful when you go down there and tried to break, you know, he tried to break these little, these little identities. So Charlie Longoria says, what do you think of John Verve telling Jordan Peterson he thinks you are a more radical Christian than you realize? I don't know. I don't know what I think of that. I have to talk to him about it. You know, Jordan, Jordan Peterson. John Revake and I are going to record a video together. We, we already have a date in September. We're going to do like a three, three way discussion, the three of us. So hopefully that'll go okay. I'm a little nervous about that because the discussion between John and Jordan was like, it was kind of hyper. It was like this weird hyper mode and Jordan was being really mischievous for some reason. I don't totally understand why, but I'm still looking forward to it. I think it's going to be interesting because I think, I think John has a lot to offer in terms of, in terms of places where we can connect, you know, spiritual understanding with kind of materialism. So I think that he's really helpful and I think Jordan gets him. And so, so yeah, I think, I think it'll be interesting. But I don't know, I don't know totally what he meant by that because Jordan kind of took him off, right? He always takes him off. He would, during the whole conversation, constantly like taking him off the path of what he was saying. And so I didn't totally understand what he meant. I could ask him, you could tell me. So Daniel DeMarco says, Jonathan, there are many lists of names in the Old Testament, including Chronicles, Ezra and Nehemiah. They're often interspersed with short descriptions like musicians, gatekeepers, etc anecdotes. What, if anything, can I make of these lists of names? Is it worth reading them diligently or can they be skimmed or skipped over? So list of names are really important. They're super important. They're just difficult to attend to. Usually they like, like genealogies are very important. Lists of names are very important because usually you can find in the meaning of the names, you can actually find a kind of little story in the list of the names. And so if you have the capacity to pay attention to that, I would say it's definitely worth it. But it's, it requires a lot of effort. All right, so Mark Peters says, hi, Jonathan. How can symbolic analysis be used to say more about our experience of time given our ability to, for example, watch a YouTube video or of a performer singing on TV in the 1970s and juxtapose another video on screen of the same performers singing the same song on the same stage on TV 15 years later. I don't know what to tell you. I'm not sure with your example, what you're saying. Yeah, I'm not sure. So, I mean, for sure, technology is messing up our. Our technology is messing up our understanding of time and of space. That's for sure. Right? Because in the Internet, you are. You're standing in one space, yet you're basically everything is reduced to time, where all space seems available to you, you know, in time. But at the same time, like you said, this media is also somehow. And sometimes giving you a sense that it's kind of collapsing time at this. At, you know, at the same time. So I don't know. It's. It's definitely another example of things breaking down. Chandler Turner says, could you do a short symbolic analysis of the anarchy A. Huh. I don't think I've ever thought about that. Interesting. I have to think about it. All I can say is I had to think about it. It's definitely a pentagram, so there's that. So it definitely has something to do with the pentagram, but I'd have to think about it more. That's a very provocative question because it still look. Because it's still like an A. So it still seems to have a kind of hierarchy to it. And you think about it. Good question. Michael Mueller says, maybe this is something you have been hinting at for a long time. But I'm noticing many parallels between Peterson and St. Christopher, such as the similarity structurally between Peterson's asking why it's Christopher wanting to serve the most powerful king. How should we consider such manifestations? I mean, yeah, if you watch the video I did on the. On the metaphysics of Pepe, you'll notice that I'm pointing at that all the time. So you can watch that and you can get a sense of the relationship between the frog, you know, taking the golden ball out of the water and St Christopher crossing the golden child across the river. And, you know, that kind of stuff. So Kevin Peterson says, when we die, why shouldn't we stay with the saints? Why bother coming back to Earth and getting bodies again if we can exist without them? I shouldn't laugh because obviously it's a great, really good question. It's like. It's like one of those questions which nobody dares to ask. And so this is. This is why it's so ambiguous. Like, okay, when I'm gonna tell you, don't take what I'm telling you as, like, this is the rule. But, okay, so feel free to disagree with me and feel. And don't call, like, on priests to come and get me because I'm saying something which sounds weird, but I think the best way to understand that is that the saints are already in the eschaton and that they are something like they are already answering us from their resurrected bodies. That's the best way that I have to understand that. Because there is a. There's a sense in which. That we're not. We don't exist without bodies. And so there really is a sense in which you can feel it every time you hear descriptions of the afterlife where there's an ambiguity. There's like. We don't. There's like a thing they talk about the particular judgment, the universal judgment. There's a way in which they try to kind of fudge it to. To say, you're in a waiting place, like, whatever. Who knows? Like, it's not. It's all kind of. I mean, and I don't want to criticize the way that it's been described before, but for me, that's the best. That's really the best way to understand it, is that the kingdom of God is there among you, and the eschaton is already available, because it's not. Doesn't participate in time in the same way that linear time does. And so it's already there, and that the resurrection is mysteriously already there. So there you go. Don't take that. Don't take that to the bank, though. All right, so angel Terpstra, does the song have an angel? I've noticed there are multiple songwriters who approach songs as if they have a spirit, as if songs are patterns not inside, but outside. The songwriter which. Whom they tried to connect, are they, from a symbolic perspective, connecting to the angel of the song? Or would this maybe be the logos of the song? Or this. Or is this basically the same? So I think. I think it's probably not the song that has an angel, but it's. It's, let's say, patterns. Certain patterns have angels. And so to the extent that a song will participate in a certain pattern, then, yes, it will be subject to. To a principality. But it's not necessarily. Just like. You don't necessarily have to understand it that each song has an angel. And it's like. Think about it. Like the muses, for example. Like the muses, they didn't you didn't have to have a muse for every, for every, for every single artwork that was produced. But rather they had separated the muses among the different arts as kind of these inspiration principalities for the different arts. And so I think it's probably better to understand it some, something like that. So David Goliath and El Hanan. I've been raised in a Christian home all my life and have been orthodox for over a decade. Two days ago, while listening to Brett Weinstein, I heard him speak of Elhanan. Never in my life have I heard this view. What do you know and what can you share about this topic? And so I don't know, like, I don't know what he said. You'd have to hear what he said about Elhanan in the idea that Elhanan killed Goliath. And so there, there are plenty of ways to deal with that. One is to understand that Goliath is a title and not a, not, not a name, like a name in the, in the proper sense. And so there were different. There are several Goliaths and David slew a Goliath and Elhanan slew a Goliath and there were giants in the Canaanites and in the Philistines and all of them. So that to me, like in terms of, in terms of just narrative, that's not a big deal. But I don't know enough about Elhanan and his own slaying of Goliath and what that, like what that can mean, because usually we, we attend to David because there's a longer story which describes his killing of, of Goliath. So. Yeah, but if it bothers you in terms of narrative, like in terms of it being a contradiction or whatever, I don't, I don't see why it would. It's not a big deal. So, Norm Grandin, in your conversation with Ray of Kelly, you talk about your beliefs being grounded fundamentally in intuition of the pattern. Do you think that our beliefs, regardless of whether we try to ground them bottom up or top down in the end, always come from above, from a fundamentally unidentifiable mystery or intuition that rests upon a felt but unprovable axiom? Perhaps the limit of the bottom up crowd to recognize this or scale beyond the individual to cities, nations, beyond, is due to their inability or unwillingness to admit mystery and there are things that exist that are beyond our fundamental ability to understand. Well, yeah, I mean, I think for sure what you're saying is, is, is right. Yeah. All right, so Don Pelano, my question is regarding the relevant relevancy of Christ's imperative to not resist evil in relationship. The deeply disturbing and seemingly unsurmountable drive for transhumanist goals to merge with body with machine. What does it mean to be a temple as an image bearing human in this context? And besides the mark, where else might it be aligned for us to pay attention to? So, I mean, it's very simple. There's a difference between. Don't. There's a difference between not resisting evil and not collaborating with evil. Those are not the same thing. And that's it. Like, that's the difference, right? The. The idea that ultimately the highest. The highest. The highest form. The highest form, let's say, of. Of transcendence would be something like that you're not defined by the outside at all, and so you don't have to resist evil. So it's like if someone slaps you, it doesn't define you. You don't. You're fine. You continue on your life. And so you're not defined by the outside in any way. Right. That's the highest aspect. But that doesn't mean that if. That if. I don't know, if someone comes and says, here, come with me and let's rob this person, that you're going to say yes. You're not going to say yes. So you cannot resist evil and you don't have to give in to this, to the transhumanist goal to merge body with machine. It's not a very complicated. It's not. I mean, it's complicated in the practical. Because we're surrounded by this stuff and. And we fear the pressure on all sides, but at least morally, it's not. It's not. To me, it's not a complicated question. All right, so Matthew Mulbrandin asks what is the margin geographically in modern cities? The suburbs in North America are viewed as white and. Or normal and predictable, but would seem to be the edge of the city. Is there something radical inside the suburbs we don't see, or is it simply economic expression outside of the traditional urban framework of the past? So there. So the thing is that. So this is. The thing is that there are different aspects of the margin, and the margin is not always negative. Like, the margin is also positive. So you can understand the margin. This is. This is going to be tough for people to understand. So there's an aspect of the margin which is conservative. It's like an ark. It preserves, it keeps. It's like. It's like the ark of the covenant. It's Like a box that keeps things. It's like the earth that you can dig and you can hide things under. So the earth is both a place of decomposition and the earth is also a place where you find treasures. And so. And it's a place that preserves, just like it also destroys. It's hard. It's hard to kind of understand that, but that those are the two aspects of the margin. And so there's an aspect of the margin, like, say you take Lord of the Rings, there's an aspect of the margin which are the Orcs and Gollum and Mordor. There's an aspect of the margin which is the Shire. The Shire is Bag End. That's what the. You know, it's like Bag End is the, Is the bottom. It's. It's the bottom of the world. The Shire is the bottom of the world. The Folk are the bottom of the world. The, The. The. The Common. The commoners, right, they are. They're also the basket. They're also the, The. The place where things are held together. They're also. The conservative element of society will also be found in the margin. And so when the, when the, when the priest and the king go crazy, the folk continue to do their thing, and they're very difficult to change. Like, regular people are difficult to change. And that's good. That's great, you know, and so that's, that's how you have to understand that. So you're right. Not this. So like the suburbs, but let's say the outside of the city is more conservative. It's more traditional. It's more working class. It's more, you know, it has, you know, and especially if you go towards the flyover zones in. In the us it really even takes up that aesthetic, let's say. And if you look at the, the election in 2020, you can see this idea of like, the kind of democratic elite cities and then. Then the kind of Republican countryside, let's say. And so that's it. That's the. That's the Shire, right? That's the. That's that aspect of the margin. So. All right, so we have a few questions on subscribestar. Look at me. I'm getting better, though. I used to be able to, like, go an hour and a half. I could go two hours. And now I feel like I'm pretty good. I could keep going here, so I'm gonna keep going as long as I can. All right, so Mary Pope Osborne says, is there a modern reading source other than the Bible that expounds on the patterns of Christianity that you referred to. Sometimes I can't see the forest for the trees. And so I mean there are plenty. I mean Matthew, my brother's book is a great place to start if you want, if you want to start here unplugging his book again. But you know, I, I think it's worth it. It's, it's a really good book on symbolism. It's called the Language of Creation. You can check that out. It's definitely worth it. But there are people right now that are, that even like in the orthodox tradition you'll find just in, in terms of homilies, you'll see go to a church, you'll, you'll hear people talk about it. The different use of, of typology in Christianity is popular all over the place. I don't know like how to point you to a specific thing. But even in terms of modern scholarship right now, like you can go to the Bible Project, they're Protestant group but they're doing great in terms of understanding Bible symbolism. You've got, you've got people like what's the name of the, the, the Theophilus Institute with, with James Jordan and all of these people. You know, you've got, you've got people all, all around. I think there, there are places to look if you want to look for kind of narrative patterns in, in scripture, you know. Yeah, I don't know. It's best to read the church fathers, read St. Gregor Venissa and read St. Basil and read St. Maximus the Confessor. You can read text on the Church Fathers as well in which they try to kind of help you see that, you know, there's a great introduction on, on Saint Maximus the Confessor by Andrew Louth, which is worth it. So XRD says, hi Jonathan. Are you familiar with Neon Genesis Evangelion? I think the Internet would break if you analyzed it's symbolism. You're not the first person to tell me this. So I don't know. I mean maybe one day I don't watch a lot of stuff anymore. Maybe one day. So Big Lasagna asks. Hello, Jonathan. I was thinking about what myths can bring us out of the situation we are nowadays in. I thought about the myth of the Devil's Bridge gives us a possible solution to the question of technology. Do you know the myth? No, I don't know the myth and though I don't know how to answer that and since we're coming to the end of the questions, I don't think I'm going to look it up right now maybe I'll look it up later and see what it is. So Adrian Malion says, hi, Jonathan, I have a. I've got a strong intuition that the next step in your thread of understanding the identification of Rome with Troy is the story of Dido. Yes. And Aeneas. They are associated with Roman Carthage and an internal conflict between the city on the hill and the city on the water. How do you interpret this? I mean, I don't know if there's a relationship between Aeneas and Dido and Rome and Troy. I'd have to think about it like in terms of. I never thought about their relationship as being related to, to me, Dido was like the strange woman. That's what she is. That's what she. That to me, that's what she represents. She represents the strange principality which is very attractive and is honorable and has value. But if you attach yourself to it, then you're going to get lost, you're not going to be able to continue your line, you know, and so that's what I see in Dido mostly. So. All right, all right. So the golden thread asks, you've answered so many questions about the nature of divine beings, principalities, power, logi, etc and their eternity versus our time. I still struggle. What are your sources on this? What do I read? Start with Plato. I'm willing, I, I think that if you're, if you're somehow somewhat of a Christian, you might as well, you might as well go with say Maximus. And you know, like I just mentioned the book by Andrew Louth, which is just called Synaxis the Confessor. I think that's a good place to start a nice cosmic, a nice kind of cosmic vision of, of Saint Maximus's theology. Okay, that was for 20 USD. And so the ABC 123-456-399 SIM gives me a hundred dollars and just says Sarms gang. I don't know what that is. Thank you, that's very nice. So Meebla for 499 says, I read Matthew's book and it got me thinking. Is it legitimate to interpret the cross of Christ as a manifestation of the spatial axis? And so yes, it is, but it's more than that because it both has horizontal and vertical. And so it's both the axis and the kind of the extension. Right. So it's the, the cross is the axis. It's also the center. It's also the extensions to the edge of the, of a world, let's say. And so and it also, because Christ is on the cross and it's also the serpent or the spiral around the. The axis at the same time. The cross is just everything. I don't know what to tell you. Sorry. It's like I keep saying things like that, but it's true. It's just true. So process raw wills for $5 says, can you give your thoughts on the Euthyphro dilemma? I don't know what that is. So it is the dilemma in which Socrates asks Euthyphro, is the pious love by the gods because it is pious, or is the. Or is it pious because it is loved by the gods? So I wish I could tell you that there is an answer to that, but the answer is in Psalm 133, is that it's happening at the same time. It's top down and bottom up at the same time. That's how reality works. So Kimberly Bulger, for $30 CAD says, what does the resurrection of Christ symbolize? Does this relate to what Christians believe about going to heaven? You're amazing. Thanks. So, Kimberly, I cannot answer your question because I don't know, I'm not sure. The resurrection of Christ doesn't symbolize. It symbolizes. It's everything. I don't know what to tell you. It's how death becomes life. It's how something dies and lives again. It's. It's the cycle of everything. It's the cycle of. Of the world coming to each other. It's the end and the beginning. It's the eighth day, it's the seventh day. It's the, you know, it's the. The first day and the eighth day. So it's the. It's the. It's the very end and the very beginning. There's so much to say. I couldn't, sadly. I couldn't sadly tell you all that the resurrection means. You'd have to watch all of my videos to. To get a sense of what I think the resurrection means. So. But thank you for saying I'm amazing. That. That's very kind of you. So Kirsting Queering for 9.99 says, Today's my birthday. So I thought I'd treat myself with the question, what are your thoughts on intellectual property? Owning ideas? Can you own something without a body? Thank you. I understand the practical reason for intellectual property, but I definitely think that it's a problem, like you said, it's definitely a serious problem in terms of kind of ontology, the idea that you can own. So what is it you own? Do you own the pattern or do you own the idiosyncrasies? Especially in terms of art, especially. It's the hardest for me. It's just hard to get it. I can understand why you could own some scientific application or something like that. So. Yeah. So squilliam for $10 USD. What is the orthodox view of what Christ accomplished to his passion? In other words, what is the good news of the Orthodox Church? Man, you guys, how can you ask these questions? How can you ask me what Christ accomplished to his passion at like 10 o' clock at night after two hours of speaking? I would say read the Bible. I don't, I, I would say, yeah, I don't know. It's, it's too, these questions are too encompassing. They're too big to be answered quickly. So what did Christ accomplish through his passion? He. He went into death and then abolished death. There you go. That's the best answer I can give you. So, jail for six Australian. What's the symbolism of desalination? Making seawater pot. Potable. How do you pronounce that word? In French we say potab. Potable. If you use the term bitter waters and I'll be a happy man. Yes, that's what it, it's definitely related to that. It's definitely related to the idea of changing bitter waters into clean water. And so it's the, you know, the, the, the symbol of the cross kind of come. The, the tree being put into the water in order to, in order to change the bitter waters into sweet waters. So it definitely has something to do with that, but I'd have to think about what it would mean to do that artificially because I mean, this idea of making seawater drinkable is something which happens all the time. That's what the sun does. The sun makes seawater drinkable again. All right, so Andrew Davis, for $10 USD, do you see a parallel between the Tower of Babel and modern day globalism? It appears Satan is once again trying to gather the world to unite in a new system against God. That's, I mean, it seems like, I mean they don't, it's hard not to see that. There's a poster, I've shared it once on social media. There's a poster of the European Union. When they were trying to put together the European Union, they, they had the gall to use an image of the Tower of Babel in one of their advertisements of Bruegel's Tower of Babel. You know, the one that's unfinished, kind of showing that they're going to finish. The Tower of Babel is such Pride. It's insane. So it's, it's simple. The world exists through fractal hierarchies. So in order for the world to hold together, the, the pattern of the world has to repeat itself at all the different levels of reality. And so the, the, the world exists through a hierarchy of associations, right? So you, you, you find your identity and yourself and your family in your friends, in your soccer team, in your clubs, in your interest groups, in your, in your city, in your nation, in your. All of this is all manifesting the pattern, the same pattern at all the different levels of reality. And it's acting like a, like a, like a, like a set of roots that is holding all, everything together so that, that, that are fractally, structurally, at every level of identity, manifesting itself. Now, the problem with something like the Tower of Babel or the idea of globalism is to want to break down these intermediary units and just unite everybody under one thing. And that doesn't work. It's going to do the opposite. Things are going to start to fragment. They're going to start to break down because, because the, the, the totalizing identity is going to present itself as being in competition with these secondary identities. And that's not how it's supposed to be. It's supposed to layer itself up, right? Your family is not in competition with the city. It shouldn't be. These are just different levels of identity. And so this is the problem with this, with the Tower of Babel, it's a problem with globalism too, is that they just want us all to be united under one thing. I'm not sure what it is. Is it like pride? Is it just environment? Is it, Is it. I don't. It's hard to totally understand what it is they want us to unite under, but they want to replace these, these secondary hierarchies with just one thing that now fills up the world. So, for example, if you look at this, the kind of WOKE infiltration of organizations, you can see that that's what they're trying to do. They're trying to replace every goal of every organization that they infiltrate with the WOKE ideology. And they want to make that the purpose of everything. So the purpose of a soccer team isn't to win the soccer team soccer championship anymore. It's to be diverse, right? And to be intersectional. So the purpose of the post, the purpose of the U.S. mail or the Canadian Post isn't to deliver mail anymore. It's to be diverse. It's to be intersectional. And it's that becomes true in every organization. But it doesn't work. It just doesn't work because it's breaking down the world. It's as it's trying to unite it under one thing, it's actually destroying the real hierarchies that are holding the world together. So it doesn't work. So something new for $5 asks what is the symbolism of soldiers? I'm a service member. How can I best understand meaning my profession and the role I play? And so, I mean, soldiers are there to protect the integrity of what they're protecting, whether it's their nation, whether it's a police practicing, you know, protecting the integrity of cities or of neighborhoods or of families. That's the purpose of a soldier, is to protect the integrity of things from outside attack. Because when there are different identities, sometimes the outside of one identity is a potential for the other. And so it's like your land is potentially my land. And so you have to. You have to somehow protect the integrity of your land to prevent me from seeing you as just potential for me, as food for me, you know, and so that's what soldiers do. So Mr. Highway, for 99 cents sends me a banana peel. Nice. Austin Rush 499 says, after watching Tenet, I'm wondering if you see Nolan playing out the pattern of the saint of his namesake. Thank you. Glory be to God. I never thought about that. Have to think about it. Yeah. Tenet is definitely interesting in terms of all the whole symbolism of inversion and flips that we talk about and how this kind of plays with the world. But it's. Yeah, I'm not sure it's totally coherent in terms of. Or not. Not totally coherent, but that it's. I'm not sure it exemplifies something for sure. One of the things that exemplifies is the capacity of the. Of using the future to destroy the. The. The present. And that's an interesting idea. You know, that's a different. That's an interesting idea. If you think about things like transhumanism using the potential of the future to destroy the present, though, in Tenet you have some of that going on, which is very interesting. So KK item tag for 1999 USD says Happy Birthday in advance. Thank you. I was listening to the Lord of Spirits, and Father Stephen said a body was a nexus of powers, which is only the church described as the body of Christ instead of the whole creation in scripture, which is only the church described as the body of Christ instead of the whole creation in scripture. And so you have to see it as these nested realities, you know, and so the church. So think about it like, think about it like, so think about it this way. Think about it like the Church is the body of Christ, but the Church is also something like the priests of reality. And so the Church acts as a nation of priests which intercedes for all of creation and is also participating in the manner in which all of creation can become a nexus of powers for the Logos to be embodied in, through, through the church and through. And then see it nested at different levels. The saints act like that for us, and then we with the saints act like that for the whole of reality. You can see other levels if you want, but that's the best way of understanding it. So Kyle Hoffer, 5 USD, says, what did he mean by people can't tell the difference between hybrids and artificial beings? No, no, no, I didn't say hybrids and artificial beings. I said the difference between hybrids and synthetic beings. That is the difference between. Okay, so it's very simple and it's, it's very intuitive. It's so intuitive that you, some people might miss what I'm saying, how intuitive it is. It's that look at something, can you say what it is? It's a dog, it's a cat, it's a lion, it's a human. Now look at something and then you see it as a hybrid. Oh, it's not a human, it's a human mixed with a cat. Oh, it's not a cat, it's a cat mixed with a rabbit. That's a hybrid. A hybrid is something you can't identify with a category. You have to identify it with two categories. It's really very simple. And so there's a way in which multiplicity unites into unity. And so it contains multiplicity, right? And so you're a person, you have eyes and nose and a mouth. You have all this, this multiplicity. But when I look at you, I don't say, well, that's an interesting mix of an eyes, nose and mouth. I say, no, that's a face. I see a face. And so it's very intuitive, but it's, it's a real experience. There's a difference between the experience of a being that unites multiplicity into itself into one, and a being that appears as a confusion between two identities. And I can't tell you when one becomes the other because it's not something that is completely clear cut. So here's an example. And so England for, let's say Great Britain for a while is made out of Celts and Anglo Saxons and, and, and like Saxons and Angles and all these different types of people. And so you have a sense in which at some, or it's actually probably easier with the French because the English still have this idea that they're not completely. No, no, you could say that, that, that nonetheless there's a capacity they have to kind of maintain their own specific identity, but then nonetheless all appear as British and they can all kind of see themselves as British. They, they, they're able to unite their multiplicity into one common identity. And so there is a way in which you can recognize a British person despite its multiplicity. But you can imagine that for a while it was just a bunch of tribes fighting amongst each other and kind of, you know, competing for power. And then they didn't have this unity. And so it's like there was no Great Britain. It was just a mixture of different, of different tribes. And then at some point things happen so that at some point it joined together sufficiently that you're able to see it as one thing instead of a mixture of things. I hope that makes sense. But it's important because it's like if you want to reduce one of the problems of our world into one thing, it's the incapacity to tell the difference between a synthetic being and a confused being. That's pretty much. And, or even. And to confuse one with the other. To think that multiplicity necessarily means hybridization and mixture and confusion and that that's good, but it's not good in itself. There has to be a balance between the two. Right. Because obviously you can go, you can be excessively one as well, but you need to find a balance between unity and multiplicity. All right, so the golden thread for $10. What's the symbolism of me enjoying drinks and a midsummer sunset while watching the lightning bugs over pasture and listening to Kevin Kwaji answers from this distributed community of symbologists. So I don't know with the, I mean, the symbolism of that. I don't know. It's a nice moment. It's the evening you're done your work and you're allowed to enjoy some rest. And so hopefully you, you, you feel like my, my speaking for you at least is, is not work that it's kind of leisure. So. Andrew Komaromi for $5 USD says longtime listener, first time caller, thanks for your work. What do you think of meaning Wave and a cure. The dawn. I like the scent. Exist when with you. Yeah, I think Akira Don is great. I like. I like what he does. I think. I think he's. I think he's. He's a. I think he's a very intelligent person and he's very positive, and I really appreciate that about him. And. And I think that I say in general, he's doing. He's doing good things. You know, we're not completely aligned in terms of our vision. He's more on the. He's more on the kind of, let's say, on the kind of more psychedelic side of things and the more liberal kind of. That kind of stuff, which is. Which is fine. But I. I think that. I think that what he's doing is cool. And I also really enjoyed the. The song he did, the Christmas song he did about me. I was thinking one day that I should have him on the channel, but I would have to find something like. I think we'd have to find like an angle to the conversation that would make sense to have them on. And so if you guys think of something, you can tell me. Maybe. Maybe it'll prompt me to. To invite him. So. Symbolic memes says. Any comments on Father Seraphim Rose's critique of the theory of evolution, seeing it as incompatible with the orthodox worldview? And so I think I've kind of said what I need to say about that, which is that I think that the. The description of. The description of the process of selection and the process of that was described by Darwin. I don't see a problem with that in terms of the actual process of biological selection. The problem with evolution is the narrative problem. For me. I do feel like the narrative of evolution, the way it's presented to us, is not compatible with the orthodox vision, but I nonetheless feel like it's not talking about the same thing. The problem is not that they are competing scientific description in Scripture, between scripture and evolution to describe the world. It's rather that there's a. There's a competing lens by which we look at the world. One which is a kind of. A kind of weird materialist, you know, lens which is nonetheless trying to use materialism to. To trace a story between millions and millions of years. I guess it's. It's very particular. And the powerfully told story, the synthetic story which is told in Genesis, which is by far superior and by far more useful to you as a person rather than the other one. So I would say that I agree with Father Seraphim in terms of. In principle, I don't. I probably wouldn't have the exact same approach as him just because we're also in a different time. But, but I, I agree that it's, that that's a story. It's not compatible, it's not compatible with us. You can't live in that story. And if you do and you, you try to replace the story in Genesis with the story of evolution, you try to live in that story. Yeah, it's dark roads ahead, you know, but I don't mind talking about, about, about selection and about, you know, the, the, the processes that were described by Darwin and then the people after him. All right, so Fred Wiedenman for $10 says, I'm in residential construction and I'm wondering if you could shed some light on laying out the design of a home, specifically as a domestic church. So I've talked about this quite a few times in terms of. You can understand a house as a hierarchy of intimacy is probably the best way to understand it. And also a kind of union of different purposes into one whole. And so it really is a little microcosm, you know, of, of reality. And it is very, it is similar to a church. So you can think of, you can think of, sorry, a house having something like a porch or an entrance, which is like the vestibule or the narthex in the church. And then you have a common area which would be like the living room, dining room, which is a place where you can have guests. Like, you know, you encounter strangers on the porch or at the, in the entrance of your house, you don't necessarily let them in. And the people you let in are people you know better, you are closer to. And so you have your friends, you have acquaintances into your living room, you have your good friends, your family at your dining room, where you meet, eat together. And then you have the intimacy with your, with your, your husband or wife in the bedroom, which is not meant for strangers and is not even meant for your friends. People shouldn't go into your bedroom. There's. Unless they really have a reason to. It's, it's, it's odd to do that. And so it's a, it's a hierarchy of intimacy is the best way to understand it. So the ABC 1, 2, 3, 4, 5, 6 gives another 20 USD to just right. No FAP gang. So. Well, I'm happy that you're in the NOFAP gang. So, Ron Wood for 1999. Hello, Jonathan. Have you read Far Eastern Folklore? I've read some and see a lot of symbolism I understand, but I also find some things like the use of snakes in the legend of Tano of Japan that I kind of place. Well, I don't know. Like, I've read some, but I don't know. Like I don't know that legend and I don't know. I don't know enough. But I. Once in a while I like to listen to, to kind of other fairy tales from other countries because they, they can sometimes come at an angle that you don't expect and surprise you. So normative for 1999 brothers, it is later than you think. Hastened therefore to do the work of God. Good encouragement. So the new guy, 999, says, what are your thoughts on Protestantism? I know you've expressed less than positive views on it, but want to know what your main criticism are? Do you think of it as false or confused Christianity? I just said like late. You probably weren't listening at the beginning. I said that I want to try to stop constantly criticizing Protestantism, but I would say that, that, that, that my basic criticism, proselytism, is born in a revolutionary. The problem of revolution and how revolution removes legitimacy. And once you've done that, then you're in trouble. It's like I always say that I agree with Luther in his criticism of the corrupt medieval church and the different abuses that were there. But as soon as Luther, who wasn't a bishop and wasn't even a priest, starts to name priest, then I'm done with Luther. Because you can't give yourself authority. Like actual. You can say your opinion. Like, it's like I can give you my opinion. You know, I can, I can say things, but I don't, I can't, I can't lead you guys in a real way. And I don't want to. That's why I keep sending people to church and I go to church. Don't, don't, don't follow me. Like, you can like what I say and you can agree with things I say, and it can kind of help you in your life. But I'm not your leader and I don't want to be. And if I was, then you should flee me like a plague if I would try to be your, your leader or your like, spiritual leader or whatever. And so that's it. Like, that's my problem. So Michael O' Connor for 20 said, do you ever consider Catholicism? Because before he became Orthodox? And so I did, because I was from, from French Canadian. And so I did consider Catholicism before becoming Orthodox, but I felt like. I felt like, like it was, it was coming. I was leaving the kind of Protestant Church. And then I could see that the Catholic Church was kind of coming towards the Protestant church in terms of, is the way that he was doing things. And so, so it just didn't, it just didn't die for me. I have friends who became traditional Catholics that were kind of in the same meaning crisis as I was when I was younger. And they, they seem happy there. So, you know, so I mean, I have, I, I have respect for, for serious Catholics. I have respect for all serious Christians. It's like, you know, I think you have to be careful. Like when I'm also criticizing different types of Christianity that I, I think we have to be really careful because just because someone's orthodox doesn't mean that they can be just. They can be a horrible person and a horrible Christian. And it's not just because you're baptized and you go to a certain church that it definitely. That it immediately gives you value. You know, they're, they're very. There are people that I would, that I would hesitate to criticize in all the different denominations because they, they embody, they seem to embody. They seem to embody Christ. And so, so we have to be careful. So. Yeah, so I think, so, I think we're done, guys. 10:30. So, yeah, so we got through this and so, so thanks everybody for your attention. Thank you for your time. And so let me get one question from the chat. Look at me. I'm actually getting questions from the chat. So Jonathan, can you. Samuel Ramalera says, can you explain briefly how the Consulting on Symbolic World website works? I'm actually not taking any consulting. I should probably remove that from the website. I'm actually not taking any more consulting contracts just because I'm really overwhelmed with everything. So. So yeah, so I'm not doing that. So anyway, so it was good to talk to everybody and I will see you all next month. Thanks for your attention and I'll talk to you very soon. Bye bye. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pajot videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
