{"episode_id":"SW - #034 - 2019-04-09 - Food, Sex and Communion","start":1.12,"end":51.74,"speaker":"Jonathan Pageau","text":"On this episode of the Symbolic World podcast, I will be looking at a question that was posed to me by some of my patrons, some of my supporters, which was trying to understand the symbolism and the reality of communion. So, of course, the symbolism of communion is one which is very difficult to exhaust. But in this video that I did, I try as much as I can to try to show the relationship between food, communion, how it is a form of knowledge, and its relationship to the union of opposites, even in terms of sexual symbolism. So please enjoy. This is Jonathan Peugeot."}
{"episode_id":"SW - #034 - 2019-04-09 - Food, Sex and Communion","start":52.14,"end":53.82,"speaker":"Announcer","text":"Welcome to the Symbolic World."}
{"episode_id":"SW - #034 - 2019-04-09 - Food, Sex and Communion","start":64.2,"end":1449.61,"speaker":"Jonathan Pageau","text":"This is something that I could talk about forever. And so I don't think I will be able to cover the entire question of the symbolism of eating and the symbolism of communion and the especially the specifics of communion. But I will try to get as much as I can into this video. And if you feel like there's something missing, if you feel like there are some things that aren't clear, go ahead and write it down in the questions and I will maybe make a second version, a second part of this video. Now, first, the idea of eating. Now, the notion of eating is extremely important because it has to do with this idea of knowledge, right? I've talked about this notion of knowing as joining ourselves with something, okay? And so there are several images of that in the Bible. One of the images. One of the images is sexual union. This idea of joining yourself, a man joining himself with his wife, that it is a form of knowledge, okay? Eating is also a form of knowledge. What it is, it is just. You could say it this way. Just as a man and his wife are joined together to become one body, so too when you eat, you are making body. You are taking the stuff, taking food, and you are gathering it into yourself, and it becomes your body. Now, that becomes an image of knowledge that is an integration of manner in which heaven and earth are integrated, is that the human being, man, as microcosm, as the central point, gathers the food into himself and it becomes a. It becomes the potential out of which his mind, his thinking, his spirit can then manifest itself in the world. Okay? If you watch some of the videos that I did with my brother Matthew, he talks about that in those videos as well and explains it quite well. Now, in terms of understanding the specifics of communion, there are several things to understand, okay? The first is the notion of eating together, okay? Now, eating together is a manner in which we participate together in making a body. And so as we sit together and we eat the same thing together, we are, if you will, Using the same potential in order to create body. We are becoming one body in that sense. We are in communion in that sense. That is, we are participating in the making of body, okay? And so that is a good way to understand also a manner in which the idea of, you know, Matthew, in the video we did, he talks about how the notion of how a city eats people. And so by eating people, right, it integrates all those people into this one identity. And it becomes one thing, it becomes one city. In the same manner, if we sit around a table and we are all eating the. The same food, it's not exactly the same image, but in a similar manner. We are all joining ourselves together in that body. And so it is, right? So that's, let's say, the basic idea of why food is such a symbol of knowledge and why it's related to this notion of eating the fruit of good and evil. We. Which is the fall. Because in the notion of eating the fruit of good and evil, we are eating the fruit, the result of the opposition of good and evil. And by doing that, we are joining ourselves with that. And then especially in the way that it happened in the story of the Fall, it's actually a kind of falling into the body, right? Not that the body is evil, not that the body is wrong, but there is a manner in which we can kind of fall into the body where we lose. We forget the higher aspect, we forget the aim, which was the tree of life. We forget this notion of our higher aspects and we kind of fall into the body. And that's why all the images of the Fall are related to this adding on of body, the adding on of the garments of skin. It's kind of the world becomes hostile. And then also procreation happens after the fall. So all of those, all of those images are images which talk about the same thing. This kind of, this kind of descent into, into flesh, let's say. Okay, but like I said, it's important to understand that people have been so confused in thinking that somehow the body is bad or that flesh is bad or that, or that sexuality is bad. None of those things are bad, but they're bad to the extent into which we lose ourselves into them, right? To the extent that we, we forget our humanity and we become, become animalistic, we become subject to our own desires, okay? So we come, we become subject to our body, okay? Now you can see that as much with the, the belly as with, with sexual desire, whereas we can, we can lose ourselves in making body. We can, we can become a slave to the making of body. Okay? So now that's. We kind of have to understand this basic symbolism of eating first before we understand how it plays itself out afterwards. So now if you take the notion of the notion of eating, so eating is the cause of the fall, eating the fruit of the tree of the knowledge of good and evil, and then so too, eating in the end is also one of the images of salvation. It's one of the images of the undoing, or let's say the transformation of the fall into something higher, into something which actually brings us closer to God. And so now, I've talked about this before. One of the aspects of Christ is that Christ brings everything together, right? He brings everything into itself. And so the image that you have in communion, and there's no way that I can exhaust the symbolism of communion. It's not happening. If that's what you're hoping for in this video, it's not going to happen. But I can give you some hints. I can, because I couldn't do it myself. I don't have the knowledge to exhaust the symbolism of communion, but I can give you some hints to help you understand the connection between the two. Now, so remember, Adam and Eve, they eat the fruit of the garden, of the fruit of the tree, of the knowledge, of good and evil, they fall, they accumulate flesh, right? They accumulate flesh, but they also accumulate death. Okay? That's how it's presented. If you eat the fruit, you will die. God gives them these garments of dead skins, and now they accumulate all these layers and layers and layers of death up to the flood. Now, what Christ does is he flips everything around. He's able to bring everything together in a way that makes your mind explode. Because he's saying the manner in which you will now participate in the life of God is to eat. And he says you're going to eat first of all the fruit, so the bread and the wine. But that bread and wine is flesh and blood. So think about it. Think about it this way. Adam and Eve, they eat, they fall. And then these falls, these layers of death get added to Adam and Eve. And Christ says you have to eat all that, right? You have to be able to take in death, right? And it's his death because he's the one who fills all of that together. So he's saying you have to eat the body and drink the blood in order to fully be able to participate in this total mystery, which, which is how Christ fills up the entire hierarchy, from the highest to the lowest, goes down into death and Then consummates the. Consummates the fall. He dies. He does exactly what Adam and Eve did. He eats the fruit of the knowledge of good and evil. He dies on the tree. And then we need to eat the fruit of that in. In order then for everything to kind of come together. Okay. And I know that this is the symbolism of communion is not easy. It is the highest mystery. And so for it to be the highest mystery, it contains everything inside it. And there is an aspect of scandal. Scandal to the symbolism of communion. Right? Because you can imagine, even at the beginning of Christianity, the Romans heard of this sect of Jews who said that they're eating the blood and body of their Savior. And it was like, here are this cannibal sect of people who are eating human flesh. And so you can imagine how the Romans understood what Christianity was. But just like Christ became sin without sinning, just like Christ entered into the bottom of death without being subject to death, without being totally subject, or he made himself subject to death, but in the end conquered death, so too, this notion of eating the body and blood, we're eating bread and wine, we're not. Right. We're not literally ripping pieces of flesh off a human body, but it's real at the same time. And so the notion of saying that it's real, but it's also something which transcends the categories, which joins them all together, is able for us to understand how the scandal is part of this totality, but we also transcend the scandal by eating bread and drinking wine. Okay, I hope this is making sense to you, because it's not an easy. It's not a totally easy subject to understand. Obviously, that's why we say it's mystery. But there's also, like I said, this other aspect, which is this notion of the communion table, the altar being also a table and in which we enter into communion with God. Okay? So the image that we have in the Orthodox Church, we use this image of the hospitality of Abraham. And in the hospitality of Abraham, these three angels appeared to Abraham, and Abraham served them food, and it has become an image of the Trinity. Those three angels have become for Christians an image of the Trinity. And so we have this image by Andrew Rublev of the three angels who are symbolizing for us the Trinity. And then there's this open space at the table in front of us, which is that we now come and enter into communion. And the image of the communion is that we come to share a meal with the Trinity. Okay, Obviously it's an imagistic form, but Then the communion table in the church becomes this entering into the life of God by eating the flesh of the Logos. We commune with the Logos. Just like we have the same body as God, we participate in God's body, that is the body of Christ, that is the church. Okay? Although all this imagery is completely coherent, even though on a purely rationalistic side, it might be difficult for people to understand, but it's important to understand it's not just a mental game. It's not just abstractions, but. But by actually eating the. Taking communion, physically taking communion, we have to do it in a physical sense in order to fully enter into that relationship, in order for the communion to not just be a mental game, not just be something that we think of in our own mind, but to actually come together around the communion table, eat the same bread, drink the same wine, participate in the sacrament altogether. And at the same time, knowing that participating in the sacrament is entering into what transcends it, right? Entering into the life of God. That is the whole notion of what communion is, of what liturgy is, and of what the orthodox notion of participation in God and participation in the life of God is all about. So I think that that is really the basic idea of communion. Now, in terms of why flesh and blood, why bread and wine? I've talked about this a little bit. Obviously, once again, I cannot exhaust the symbolism. You would need to read the whole Bible to kind of get a sense of all those places. But we need to understand the basic category. So you have bread, which is a staple bread, which is a. You know, it's the basic food of life, and it's also solid, okay? So you have this notion of a solid food that you eat. Then there's wine, which is first of all liquid, okay? So it is an image of change, an image of kind of a bit of a chaotic influence. But then wine as well, which is a form of fermentation. So fermented elem, you know, the fermentation is basically a form of death. And so wine is a kind of turning of death against itself. And then when you drink wine, you also are inebriated. You are in a state of flux. Here again, for those who have read Matthieu's book, you will understand what it is that I'm talking about. And so you have bread, you have wine, which is these two basic categories. You could say space and time that are part of communion, but then they're taken up, that transformed into something which is both at the same time, you know, higher, but also at the same time, a kind of scandal which is the eating of flesh, which is akin to bread, which is in our body. It's our solid, it's our solid state. It's our, it's our, you know, it's the basic, it's our basic understanding of what the body is. And then blood, which is once again the liquid free flowing aspect of ourselves. At the same time, in the tradition of the sacrifice, you really had this idea of blood representing, let's say the more spiritual aspect. In the Bible it says that blood is the soul of the body. And so this idea that blood represents the kind of more spiritual aspect and then the body represents the more physical, you know, the more incarnate aspect. And then the way there was this weird exchange where when they would sacrifice an animal, they would sprinkle the blood down, right? Sprinkle it onto the horns of the altar and then also they would pour it out on the ground. So it was this kind of, this thing coming down to the ground. But at the same time they would offer up the flesh, flesh to God. And so God would eat the flesh and then, you know, acquire a body which was also our prayers, which was also our communion, which was also the coming together of the people which would become the body which was offered up to God for God to be manifest himself in your life and in your, and in the life of the people of Israel. That's, that's one of the ways to kind of understand ancient sacrifice. Now in communion we have once again, it's like mind blowing thing where we consume both the bread and the wine, we consume both the flesh and the blood, which is absolutely unheard of. There's nowhere in the Old Testament that the priest or anybody would consume the, the blood of the, of the sacrifice. But they would eat the meat of the sacrifice. So they would burn, they would cook the meat and then they would, they would eat the meat of the sacrifice and the smoke would go up, would go up to God, but they would also participate in eating the meat, but no one would ever eat the blood. And so for Christians to eat the meat, eat the flesh and also drink the blood is, it has to do again with this notion that Christ fills up the whole thing, contains the whole mystery, right? And in him is both the highest and the lowest. So both the thing that comes down all the way down and drips down into the, into the bottom, but the thing that's from down, that from below and goes is raised up into the highest. And Christ contains those two things together. And so that is, that is one of the. That is a hint, let's say, to help you understand why it is those elements which are brought together in communion. Like I said, I'm not exhausting this, and there's much more to it that I could encompass in a video. But hopefully this will give all of you a little sense of why eating is so important, why, how it's related to knowledge, and also how it is, how it comes together in communion. And maybe one last little thing that I can mention is that in eating there is also two aspects in order to. If you want to understand eating, it can also help us to understand sexuality, because sexuality and eating are very close together. If you look at the stories in the Bible and in other stories as well, in other traditions, you'll see how closely related they are, even in the fall. But there are two aspects to eating itself. And so eating has a nutritional aspect. You could say there are three parts. Let's say eating has a nutritional aspect, which is we're building body. We're eating in order to be able to continue living as human beings. There's an aspect of. Of eating which is. Which brings us pleasure, okay? And then there's a third aspect of eating, which is when we eat together, it creates this community and it creates this community where we eat together and we participate in the same body, okay? And sexuality has the same aspects. That is, there is an aspect of sexuality which is to propagate the human race, okay? And so it is there for the humanity to continue to exist, just like food is for you to continue to exist. There's an aspect of it which is. Which brings pleasure. And there is an aspect of it which is on a larger scale, which is communion. Communion with the person with whom you're having a sexual relationship, but also building community by creating family. And these families clump together and create larger community, okay? And so in a Christian understanding of both eating and sexuality, all of those elements have to come together, have to be united together somehow. It doesn't mean that. It doesn't mean that you can't have an ice cream cone, right? And it doesn't mean that you have to only eat things that are just so healthy for you that, you know. But. But it means that there has to be a pattern where all those things come together where. Where in your life you are eating to. To. To. To. To build your body, you're eating to also. To. To encourage communion, and you're also enjoying what you're eating, okay? And it's the same with sexuality. So that's why in Christianity, the notion of marriage is so important. And one of the reasons why it's so important, because in marriage you have that pattern where all those three elements of sexuality are gathered together into something, into a symbol, right into this whole idea of what I talk about when I talk about symbolic relationship. That is, they're brought together so that their essence appears in all these elements coming together so we can see what eating is. And then it can help us to understand communion, because the communion with God has also those, let's say, those three elements together."}
{"episode_id":"SW - #034 - 2019-04-09 - Food, Sex and Communion","start":1452.17,"end":1469.45,"speaker":"Announcer","text":"Thank you for listening to the Symbolic World podcast. As you know, this podcast is for now based mostly on my YouTube videos, which I am transferring into audio format. Please go ahead and visit my YouTube channel. There are more videos there on different subjects that I'm not going to put into audio."}
{"episode_id":"SW - #034 - 2019-04-09 - Food, Sex and Communion","start":1469.49,"end":1469.65,"speaker":"Jonathan Pageau","text":"And."}
{"episode_id":"SW - #034 - 2019-04-09 - Food, Sex and Communion","start":1469.8,"end":1491,"speaker":"Announcer","text":"And please share this to your friends. I know a lot of people know about the YouTube content, but not so many people know that this is also a podcast. So share it to your friends, share it on social media. And if you can, feel free to support this financially as well by going to my Patreon page, which is Pajot videos, strangely, you can go there and you can support it at any amount that you want."}
{"episode_id":"SW - #034 - 2019-04-09 - Food, Sex and Communion","start":1491,"end":1492.84,"speaker":"Jonathan Pageau","text":"A month for all the patrons."}
{"episode_id":"SW - #034 - 2019-04-09 - Food, Sex and Communion","start":1492.84,"end":1508.1,"speaker":"Announcer","text":"I do a monthly Q and A, a live Q and A in which people can ask questions in the chat. And I try to have a more connection with people. The YouTube comments have become difficult to follow and to answer. I'll see you soon."}
