{"episode_id":"SW - #032 - 2019-03-19 - Zombies, Postmodernism and Art","start":0.72,"end":23.04,"speaker":"Jonathan Pageau","text":"I would like to welcome you to episode 29 of the Symbolic World podcast. On this episode, I will be playing for you a talk that I gave at Furman University last year. It is called Zombies, Postmodernism and Art. And it looks at subjects that I've been talking a bit quite monsters. The reason why monsters are so prevalent in our culture today."}
{"episode_id":"SW - #032 - 2019-03-19 - Zombies, Postmodernism and Art","start":23.2,"end":26.04,"speaker":"Jonathan Pageau","text":"I talk specifically more about zombies, a."}
{"episode_id":"SW - #032 - 2019-03-19 - Zombies, Postmodernism and Art","start":26.04,"end":39.76,"speaker":"Jonathan Pageau","text":"Little bit about John Vervaeke's book on zombies, and finally, how all of this development can be seen in the history of art of the 20th, especially the late 20th century. And so enjoy."}
{"episode_id":"SW - #032 - 2019-03-19 - Zombies, Postmodernism and Art","start":53.6,"end":57.2,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the Symbolic World."}
{"episode_id":"SW - #032 - 2019-03-19 - Zombies, Postmodernism and Art","start":68.48,"end":2108.91,"speaker":"Jonathan Pageau","text":"So sorry, everybody, for the delay. I was great. I arrived today at Furman and I saw the campus. I was able to walk around a little bit before we started, and it's very beautiful. I was really happy to discover this place. So I'm an orthodox icon carver, as you heard. You can see. These are my. These are a few examples of my works up there. But I'm actually not going to talk about my work. I'm not going to talk about icon carving. I'm actually going to talk mostly about monsters. I'm going to talk about what monsters mean and how they, let's say, fit in the world. And I was given a title. I didn't choose the title. I don't even remember what the title is, but it's like Zombies versus Icons. What is it, Art and the Apocalypse or something? So, yeah, so I am going to talk about art. I kind of weave that through. Hopefully everything will come together and make sense. But as an artist and as someone who has been studying Christian art for a long time, I'm very interested in Christian symbolism. And as a student of symbolism and also as an artist, I'm very sensitive to cultural images which appear on our cultural horizon, let's say. And so one of the things that I've noticed, and I think most people have noticed, is that we live in a time of monsters. It seems that since the beginning of the 20th century, the horizon of our storytelling, let's say, the narrative level of our culture is filling up with levels that it's almost difficult to fathom with images of the monsters. And it's been going on for quite a while, and it has accelerated quite a bit in the last few decades. And the monsters, they've moved away from the stories of fear, from the horror stories, and they've made their way into the most comfortable places, even into our children's stories. And for those. I'm 42, and for those who are my age and maybe a bit older and a bit younger. We grew up with Sesame street, which told us that monsters were our friends. And so, let's be honest, the world, our world, is obsessed with monsters, with things that are strange, with aliens, with things that are marginal, with glorifications of the exception, things that are in between, things that don't fit. If we remove the moral interpretation of the monster, let's say I'm not here to talk about good or bad. If we look rather at the technical definition of a monster, in fact, a monster is something that doesn't fit. It's something that doesn't fit within the usual categories of the human experience. Monsters are too big, they're too small, they have too much or too little of something, too many arms, too many heads, just one eye, just one foot. Or else they're a mixture, a mixture of different categories, a mixture of different animals, or a mixture of humans and animals. And ultimately, say the ultimate monster might be the confusion between life and death, the mixture between life and death, the ghost, the vampire and the zombie. But we'll get to the zombie pretty soon. So the monster is a breakdown of meaning. It's a place where categories fall apart. They're the exceptions, and they appear on the edge of meaning. And in the ancient world, monsters were seen as signs. In fact, the word monster means a warning, a portent. In French, it has the same word as the same root as the word montre, which means to show. In English, we still have the word demonstrate, which has the word monster inside of it. But the idea of showing in terms of the monster really needs to be understood in the sense of this warning, this portent. And the question is, what is the monster warning us about? There's a scene in the. The romance of Alexander the Great. And for those who don't know, these are legends of the life of Alexander the Great. And they're actually very important in the Western canon, let's say. And for some reason, I don't even know why those stories are important. From England to Greece, you find them in the Middle east, in Persia, all the way in Israel, all the way to India. They all have their versions of these legends of Alexander the Great. And they're really important in terms of understanding world culture, world history. And for some reason, they're being forgotten in our time. And so this image is a cover of a book, but you can see that it's actually a Persian miniature of Alexander the Great sitting on his horse. Who's coming to meet the Brahmin in India who are seen as the naked philosophers. And so in the legends of Alexander the Great, the Brahmin didn't wear any clothing. They were seen as this kind of pure knowledge. They didn't have any belongings. And so there is this. In the legend of Alexander the Great, there's a story of a woman who gives birth to a stillborn monster. This is a Byzantine image of that story. And so the monster, the stillborn monster that is born is a human form from the waist up, but is a mixture of different animals from the waist down. And the human part was dead, but the different animal parts are still moving. Described as being like the great monster Scylla, which we hear of in Homer's Odyssey. That is this multi headed serpent. But this writhing spaghetti has the characteristics of leopards, lions, wolves, wild boars and dogs. Human above the waist, but a writhing octopus of conflicting beasts below the waist. And I'm sure most of us have experienced that once in a while. So the woman, she runs to Alexander with this monster. And when Alexander sees the child, he knows that it's a sign, but he doesn't know what it is a sign of. And so he calls the Chaldean magicians, he called the Chaldean wise men, to interpret this sign. And although some actually tried to hide the meaning of the sign to Alexander, there is one of the magician who tells them the truth. With fear and trembling he tells them that, O bravest of all men, you are the human body and the wild animal formed are the soldiers who are with you. If the human part of the body were alive and moving, as are the animals beneath it, you would have been destined to rule all men. But it is the very part that is dead and the beasts are alive. So just as it has left its living state, so have you too departed. For example, the animals that are bound to the human body have no kind of consideration towards man. In the same way do those who surround you not love you. And there will be many upheavals in the world when you depart. And those about you will fall out with one another and will bloodily slaughter one another. So what Alexander encountered was truly a monster. And you could say that it is the archetypal monster. You see, the sign, the portent that the monster is showing is nothing but what it is itself. The monster is the lack of a unifying principle, right? It is the harbinger of that state, a harbinger of chaos. The beasts which intermingle and fight among themselves because they have lost whatever it was that held Their multiplicity into a coherent whole. And so here the conscious agent, the human part, was dead. And the beastly, chaotic parts were left to fight amongst themselves. If you think of a person like a hierarchy, if you think of a person like a hierarchy, with the head as the teeth, let's say, and the lower parts, the bottom, the edge, the periphery of the body as the. As the edge of the body, we can see, you know, how the breakdown in this particular image, this image that Alexander saw was in fact an omen of something larger. It became a cosmic image of what was going to happen when Alexander died. And we know that is what happened. His empire immediately began to fight amongst each other and to fragment. So we can see this sign, the sign that Alexander saw. We can see it at a social level. We can see it the type of civil war that erupts when the different factions of a polity can no longer agree on what unifies them. Or we can experience it as the conflict of our own passions, our own desires. When we're not able to steer and manage those desires, they fight amongst each other and. And they rip us apart. They can destroy our lives, they can destroy our families, they can destroy our friendships, and they can even destroy our own human integrity. So we need to pay attention and pay attention very carefully. Because the obsession of the modern world with the monsters is no longer just in fiction. It's no longer just in stories. In fact, the monsters have left the dark spaces under our beds. They've left our nightmares and they've come out to play. And I think we all feel this loss of unity. We all feel this loss of meaning that is creeping into our societies at the social level. We can feel and we can see all around this growing polarization, the acceleration of what we can only call a structure strange breakdown, the decomposition of culture, the progressive dissipation of any center which can rally us as societies. And it's difficult not to come back to the famous poem by Yeats, that poem that we've heard a million times, but that it's worth to revisit. I think it's the poem that is the most cited in modern poetry. Turning and turning in the widening gyre the falcon cannot hear the falconer Things fall apart, the center cannot hold. Mere anarchy is loosed upon the world. The blood dim tide is loose and everywhere the ceremony of innocence is drowned. The best lack all conviction, while the worst are full of passionate intensity. And this poem is the most famous poem of modern poetry because it rings so true. Because we stand here in what feels like this widening gyre, this acceleration of time on the edge of the world, where the wheel is spinning so fast that sometimes it feels like it's going to come off its axis. And we can see that Yeats is using the same structure that we saw in Alexander's monster, the falconer as the human agent, as the intelligent agent, losing control of the predatory beast, which gets farther and farther and farther from his control, and things fall apart. And so here we stand on the edge, it sometimes seems, and it is here that we find the zombies wandering aimlessly in a world that is losing its center. Now, the zombie, unlike the other ancient monsters, the other traditional monsters, is truly a harbinger of contemporary nihilism. The zombie, at least the 20th century version of it, the recent version of it, it has no magic. Its arrival is an accident, some kind of freak event, a disease, a plague. It has no reason. It's couched in a biological accident. The zombie is just an animated corpse, and it habits the indeterminate space between life and death, living death. The zombie roams around in packs, and it shows us this mindless wandering of. Of a mindless mob with an insatiable hunger for devouring others, for swallowing life itself. So if the vampire would be the monster of aristocracy, let's say the zombie is truly the monster of the masses. It is the monster of the accidental. It's the quantitative leveling. The zombie is the atheist, insistent on the absence of the illusion of free will. And it's this image of nihilism and idiosyncrasy taken all the way to its extreme into decomposition. Now, in almost every major city in North America, they have these events, you might have heard about them. They call them zombie walks. So people dress up as zombies and they walk in thousands down the streets dressed up to make them look like corpses. They shift around with dead, empty eyes, pretending to be the walking dead. And some of these are huge. If we were generous, we could call it a zombie procession. Maybe we could say that they're liturgical zombies, if there's such a thing. If you want to know what a society is, you simply have to look at what it processes around, what makes it come together and process. It'll give you an idea. Look at social rituals. And so the zombie typifies the mob. Yes, but not only the zombie also typifies the absolute individualism, the absolute isolation of contemporary life. Because the zombies, they only interact with what they desire. They never interact with each other. They're a mob, but they're not a whole Not a community. And the trope of cannibalism, obviously, that's a very ancient trope. It's a trope that's been there in the ancient stories from the beginning. We have them in so many ancient myths. But this tweak in the zombie stories of eating the brains is quite important because the zombie is a creature without meaning, without intelligence. It misses any form of person. And so it has this insatiable desire which mirrors what it lacks. It desires what it lacks. Identity, meaning. And this desire appears, you know, as that it appears in that materialist reduction of the person to this clump of cells that we have up in our cranium. So the zombie wants to eat your brains because it cannot eat the mind, because it cannot speak the mind. But strangely enough, the desire to eat the living, it's the extreme perversion of our desire for communion with each other. It's also a distilled image of all our desires, of all our passions, let's say. Because when we let our desires get out of control, we always see that we attempt to feel this unquenchable yearning. What we do is we transform other people into commodities. We transform other people into something that can get me what I want. And so the zombie is both an image of the social breakdown, the person as a meaningless statistic, the disappearance of common values, except the overwhelming desire to consume. But it's also the breakdown of the person itself into a soulless, desiring death machine. And they're a very strict analogy between those different levels of the world. The social breakdown and polarization is to the state with the total abandonment of our desire to consume and to our little idiosyncrasies is to the person. And the zombie inhabits both of those things at the same time. I gave a version of this talk last year in Chattanooga, Tennessee. And since I gave that talk, some of the people who follow me on social media, they pointed me to a book that was written by a University of Toronto scholar. His name is John Vervacke. And it was published the same. Near the same time that I gave this talk last time. And I was really amazed to see in his book how close our thoughts were, how close the relationship of what I was saying was to what he was saying. And Vervaque, he mentions the postmodernist theorists, Deleuze and Guattari, the. Those. Those two people who work together. And he quotes them saying that the only modern myth is the myth of the zombies. And this is. I think it's quite accurate, and I think it's increasingly so, because the zombie is precisely a breakdown in meaning. And long ago, in my own studies, I I discovered that Jacques Derrida, the famous, you know, the father of postmodernism, he himself called the living dead agents of deconstruction. Quote, Zombies are cinematic inscriptions of the failure of the life, death, opposition. They show where classificatory order breaks down. They mark the limit of order. Like all undecidables, zombies infect the oppositions grouped around them. So I hope you're used to hearing postmodern theory, by the way. The zombie is therefore fascinating and also horrific. It poisons systems of order. Like all undecidables, it ought to be returned to order. But this is difficult to do because the zombie is already dead. It is dead and living at the same time. So how do you solve the zombie story? And it's not a simple task to do. Derrida comes to the end and says, the zombie might be in erackitable, it might be impossible to eradicate it. They might return. Possibly. Undecidability is always with us. If not figured in the zombie, then something else. Ghosts, golems, or vampires between life and death. Derrida knew exactly what a monster is, and to be generous with him, he wrote this long before the zombie craze, like long before the permanent impact of George Romero and the contemporary wave of the nihilistic zombie, before the zombie hoards which brought about cultural phenomena like the walking dead in the modern zombie story. There is no solution to the zombie narrative. Not really. Some have tried to give us some relatively happy endings, but we all know that in a zombie story you just survive as long as possible. As what Derrida calls the undecidables encircle you to devour what is left of quote, classificatory order. Like civilizations, families, friends, and any hierarchy of meaning, mere anarchy is loosed upon the world. And finally you are infected yourself. And the virus infects your own will with the zombie state. And your own center cannot hold your own narrative succumbs to the mindless wandering and insatiable hunger. Now, the cultural manifestations of our world, they have meaning. They are not arbitrary, they are signs. They are portents of where we stand in the patterns of history. I am a liturgical artist and I'm trained in contemporary art. And the signs of the monstrous and the zombie apocalypse were there in fine art before everywhere else. They're there within the modern art world itself. I mean, one needs to look no further than Picasso to see a breakdown of the person, a breakdown of the point of view, the breakdown of meaning was already there, becoming clearer and clearer after the stark realization of World War I, after the desperation of World War II, the vision that the hopes and dreams of progress were then laid bare in the millions of corpses slaughtered and lying in mass graves. We can see it develop how the fragmentation of early Cubism, which you see as the first image, which almost looks mathematical as a mathematical game, now becomes more frightening. Breakdown in Picasso's later images. And if you doubt that it's there in Picasso, if you doubt this breakdown, this breakdown makes itself seen in the later waves of artists. What Inticaso might for some seem like just an exercise in visual exploration is unveiled in someone like Francis Bacon as beaten, deformed and decomposing flesh. Anyone who has seen a zombie movie has seen this face. Though Bacon painted these years before the zombies graced our screens. I'm from Montreal and not too long ago the Museum of Fine Arts in Montreal, they bought a church. You can see it in this image. It's the church that's right next to the museum. They needed a church to. They needed more space to expand the collection. So they bought this church and then they gave a commission to a Canadian sculptor. His name is David Atmed. And he produced this for them in front of the church. So it's a broken down angel with a hole for a heart and with a kind of cancerous blob weighing down its wings. And the flesh is coming off his body, you know, to show us that it's just a construction and it's a. It's a fallen angel. And we know that it's a fallen angel because At Mid has made an entire series on the subject of the fallen angel or the giants in Genesis, the Nephilim, the giant race of monsters in the pre diluvian story. These are more of Ahmed's work. And these giants, these monsters have a long history in Jewish and Christian lore. And they were seen by some as a result of. Of the fallen angels that mixed with human beings and created these giant monsters. So the professor I talked to you about, John Vervaca at University of Toronto, he has some pretty interesting ideas about the zombie and he tells us that, quote, while the zombie is a versatile enough symbol to stand for many kinds of human defilement, the symbol ultimately draws its aptness from being a perversion of the Christian mythos of death and resurrection, that most of its traits and features have emerged from and hearkened back to the matrix of the Christian worldview. We will contend that the zombie has evolved to become a representation of the loss of the sacred canopy traditionally provided by Christianity, and that its features have evolved along the fault lines of this loss, representing a world that no longer explains itself nor provides us instruction for how to live within it. So when you hear that, all of a sudden at Med's angel, at Med's sculpture takes up all the sense. Because here we have a church that has been basically made hollow and changed into a museum to show modern art. And in front of it is an angel with a hollow heart. And that is decomposing. So, yeah, symbolism happens. And I agree. I agree in large part with Virvaka. He's not a Christian at all. He's actually a secular Buddhist. But I totally agree. And so I think maybe we can look. Then we can look at just how the Christian worldview, and in many ways the traditional worldview of many cultures, how they made sense of the monster. I think that our stories, they can help us understand the world, our ancient stories. If we can kind of forget the polemics that exist, especially in American Christianity, about historical, literal or whatever, all that stuff, we forget that and we look just at the story. We can see in these stories some powerful patterns that can help us view the world in a different way. It can help us view the world as. We can see these stories as a kind of map, a map that traces patterns in the. In life, traces patterns in history. And this is especially true of the early stories in the Bible. So in the Garden of Eden, when Adam and Eve fall, God tells them that if they eat the fruit of the knowledge of good and evil, he tells them that they will die. Now, for the sake of our discussion, you have to see this warning in relation to the monster I mentioned at the beginning in the story of Alexander the Great, the monster with the dead human and the writhing beasts. That might seem a bit strange to you, but give me the benefit of the doubt. Also, keep in mind the poem by Yeats describing this falcon, this predatory animal who no longer hears the command of his master and who whirls uncontrollably in the widening gyre. You see, God tells Adam and Eve that if they eat the fruit, they will die. But that's not really what happens. That's not really what happens in the story, is it? Right, they eat the fruit, but then they don't die. And what happens is that God chases them away from this central place, from this central tree. He chases them away and they start to move out from this axis of the world, start to move away. And as they move Away, they encounter the limit of the garden and they encounter this cherub with a flaming sword which guards the entrance. And as they move away, God gives us, God gives them these garments of skin. And the garments of skin are these dead covering of animal skins. And so you can see this moving out from the center and then this adding of layers and layers upon layers to each other. So God gives them these garments of skin. And in the church fathers, in the, in the Christian tradition, these garments of skin that are given to Adam and Eve, they're seen as not just the garments of skin, but they're seen as everything that we add onto our nature, everything that we add on to our human nature. So that includes, it includes technology, it includes society, it includes civilization. And so this idea that God gives them these dead skins that are around them. And it's very strange because why does, why would God give them this layer of death to protect them? As he's chasing them out of the garden and pondering that thinking, thinking of this idea of a layer of death which is placed around our nature as we move out further and further away from the center, is going to be the key to understanding the possible meaning of the monster. And if you don't understand it right away, you can actually, you can think maybe just of what a vaccine is. A vaccine is made from the disease that is trying to cure you, just like an antivenom is made from the venom that is trying to cure you. There is this relationship between death and this moving, this, this possibility of being protected from death. And so in the Bible."}
{"episode_id":"SW - #032 - 2019-03-19 - Zombies, Postmodernism and Art","start":2110.76,"end":2111.04,"speaker":"Jonathan Pageau","text":"From the."}
{"episode_id":"SW - #032 - 2019-03-19 - Zombies, Postmodernism and Art","start":2111.04,"end":2518.41,"speaker":"Jonathan Pageau","text":"Fall of Adam to the flood, right, it can be seen as this increasing, this adding on of layers and layers to the descendants of Adam as they multiply, as they spread out, each furthering layer is provoked by some kind of fall in a manner, a consequence of the fall. So Adam and Eve leave the garden, they fall, they leave the garden, then Cain kills his brother and, and then begins this cycle of revenge. And it said, whoever kills Cain will be avenged sevenfold. And then Cain founds the first city. Those things are not arbitrary. And as we move further down the genealogy of Cain, we find Lamech who says, if Cain will be avenged seven times, I will be avenged seven, 77 times. And we see this increase in vengeance, but we also see an increase in technology in the lineage of Cain. In the descendants of Cain. We find those who now live in tents, we find those who develop musical instruments, and finally they develop weapons of iron to increase their possibility of war. And so as we Move further and further. We have to imagine it in the world once again in the word of Yeats, this falcon moving out further and further and layers and layers of protection which prevent humanity from seeing the heart, seeing the garden which now, as Cain is moving further and further away from this garden and this tree, he can't see it through all these layers and layers of protection and increase. And as we get towards the end of that, then we get this idea of these crazy mixtures, this notion that the sons of God went into the daughters of men, whatever exactly that means. Some people think it means angels had relationships with women. Other people think that it's, let's say, the more pure people who kind of mixed with these chaotic, crazy people. It doesn't matter what exactly it means. What's important is to understand that there's confusion. There's confusion that comes at the end. And these monsters which appear on the edge of history, and so these giants appear as the last of this sequence of falls. And then there's the flood. And the giants, they were said, if you look at the traditions of the giants, you can get a lot of information about what they mean. It was said about the giants that they created King Chimera, that they like to create these hybrid animals that had, you know, beak of this bird and feet of this animal. And so there is this idea of confusion which comes. And this confusion is the very cause. It is the very line which brings us to the flood, which is a return to chaos, which is a return to the chaos which was there at the beginning, before creation, this chaotic sea and the chaotic waters. So in the same way, we can see it in history, right? You can follow the line in history going from Adam in the garden all the way to the flood, but we can also see it in space. And so this story, it echoes how the ancients viewed the world itself. The ancients, the ancient Greeks, the ancient Romans, and in so many other traditions, they view the world as this giant island, this giant island which was surrounded by a vast and serpentine ocean. And on the edge of the world is where the monsters are, on the furthest reaches, on the edge of the ocean, in a place where we can only imagine is where the monsters lay. And so these are images of the ancient, of the monstrous races that were described, imagined, who knows, by Pliny the Elder in Roman times, and who lived on the eastern edge of the world. So I always wonder what Pliny would have said if he. How he would have described our own faraway specimens. Now we have to be. I Have to be careful. We have to be careful. I talked about the analogy between the person and society. And we have to understand everything that I'm saying applies as much to ourselves as people, as it does does to society, as it does to history. And so we find on the edges of ourselves the same thing, the same conflict, the same chaos. If we let ourselves go too far into our own chaotic thoughts, our own chaotic feelings, then we find the same type of monsters that we would find on the edge of the world. I think we all have noticed the zombie growing in our own dark places. And so as a, as a Christian, I always go back to this promise that Christ made before Christ left the world. In the story, in, in the beginning, in the Gospels, Christ makes this promise to his disciples. He tells them, I will be with you until the end of the age. And so, following the analogy, we can also imagine going to the end of the age as going also to the ends of the earth, being able to his message, being able to reach all the way to the edge. And so if you look at this, this image from visually in France, it's actually a mixture of the ascension of Christ, when Christ told the disciples to go out into the world and that."}
{"episode_id":"SW - #032 - 2019-03-19 - Zombies, Postmodernism and Art","start":2518.41,"end":2519.53,"speaker":"Jonathan Pageau","text":"He would be with him until the."}
{"episode_id":"SW - #032 - 2019-03-19 - Zombies, Postmodernism and Art","start":2519.53,"end":4178.53,"speaker":"Jonathan Pageau","text":"End of the age. And Pentecost, when the fire of the Holy Spirit came down on the disciples and made them able to speak in all the different languages of all the people. So if you look at the image, you'll see around Christ, the whole ark around Christ, it's all these different types of people, all these different types of people from all over the world. And then around him again at the top are all the signs of the zodiac and then also all the seasons. So we have this analogy of moving through to the edge of time and also moving all the way to the edge of the world. And in the Orthodox tradition especially, we have this sense that moving to the edge of the world and this promise that Christ made to move all the way to the edge of the world is also a promise to go to the bottom of the earth, to go to the bottom of death. This is an image of the resurrection, which is actually an image of Christ descending into death and going all the way to the bottom of the world in order to find Adam and Eve and pull them out of death. I told you about this notion of the garments of skin and this idea of the vaccine, this notion of death. In the Orthodox tradition, as we move towards Pascha, we know at Pascha that we will hear that Christ trampled down Death by death, that there is a mystery about the edge of the world. There is a mystery about the very bottom of the world, which turns, which flips. And that is really the mystery of how the end is transformed into a beginning, of how death can change into a resurrection. Now, this cosmic shape that I mentioned at the beginning, these layers upon layers upon layers, you know, they were the structure not only of the stories, not only of the map of the world, but they were the structure of the tabernacle that the Israelites built. They had a holy of holies, and then they had these layers of veils, and. And the last layer on the tabernacle was this garment of skin, just like Adam had this garment of skin protecting him. And then it was the image of the temple. And it is. And it is still the same structure, is still the image of a church, a traditional church, not, let's say, a rock concert hall, a megachurch, but let's say a traditional church still has that structure, that cosmic structure of a center, which is the sanctuary, the altar, where the clergy mostly are, and then the nave, where the people gather, and then the narthex, where. Not in that, where anybody can come. And so in the old, old, ancient tradition of the church, there was actually a time during the church service when anybody who wasn't baptized would actually have to physically leave the nave of the church and stand in the narthex. Because the narthex was this transition space between inside and outside, this buffer zone between what is inside and outside. And so that might seem like a practice that many people would disapprove of today. And to be honest, most churches don't do that today. But if you just think about. If you just think about your own house, just think about your own family, you know, our own houses are built in the exact same way. We have people, our friends, who maybe can hang out with us in the living room. Acquaintances, let's say. Then we have closer friends who maybe will come in and eat with us in our dining room. And then the strangers, maybe they'll stay in the entrance, or maybe they'll stay on the porch. But even your close friends usually won't follow you into the. Your bedroom. So there is a hierarchy of intimacy, which is the same hierarchy of intimacy that you find in the church is the same hierarchy that I've been describing since the beginning as the very shape of the world. Now, this understanding the structure, understanding this basic structure can help us understand the great mystery that so many people still struggle with today, is to understand, I hope that Once I show you it'll become obvious, is to understand why exactly the Western church developed the tradition of having gargoyles on the outside of the church. It's not just in Western churches. There is also a tradition in Georgia, which is an Eastern church, which is an Orthodox church. And they have a tradition which is actually being revived today, where they have griffins outside of the church acting as these guards of the church. To me, I actually wonder why in the world would you not have gargoyles on the outside of your church? Just seems like the obvious thing to do once you start to see this pattern in how the world is made. Just seems like the obvious thing to do to have gargoyles on the outside of your church. And it's just. That's just the shape of everything. They had sphinxes in Egypt, which protected their holy spaces. And we have the cherub, you know, that guards the holy of holies and the cherub that guards the. The Garden of Eden. And if you read what a cherub is, it is a creature with four wings and a head of a lion and a head of a human and the head of a bird and the head of an ox and the legs of a bull. And so you have this creature which protects the holy of holies, which is on the outside of and is and is either protecting or acting as a mount for the divine. So there are images in scripture where God is seen riding a cherub across the sky, or else God comes down and appears on the cherubs which were on the Ark of the Covenant as this support, as this seat for the divine. All of these things are the same structure. Now, it's important to understand this because, you know, I've mused about us being on the edge and being obsessed with the exception, with the monstrous, with the chimera. But we have to understand that on the edge of the world, there isn't just a monster. On the edge of the world, there is also a flaming sword. And I mentioned this when I talked about this cherub that stands as the gatekeeper of the Garden of Eden. So on the edge of the world, on the end of the world, there's a kind of radicalization. There's an aspect of the edge which is upside down and confusion and desire. And there's an aspect of the edge which is a final cutoff, a wall, a sword. And the modern world has been a pendulum between those two extremes. I mean, in North America and in Western Europe, we just happen to be on the one side, on the desire side, on the fragmenting side on the confusion side, possibly, but we can feel it, and I think everybody in this room can feel it teetering towards that other extreme, towards the wall. And we've already seen the awakening of this flaming sword in the 20th century, this desire for absolute purity, a move to eliminate for good all that is extra, all that is marginal, all that does not fit. And if you think one side cannot flip into the other, you are not paying attention to history. Occam's razor can make some bloody cuts when it is applied to society. In fact, there is a trope in zombie stories itself, which is that no matter how bad it gets out there, no matter how much the zombies come and are clawing at the door, are coming to eat our brains, no matter how bad it gets, the real danger is inside. The real danger is when the human group cuts themselves off so much, becomes so isolated that they become completely pathological in their isolation. So we should actually rejoice to see the gargoyles, to see them on the outside of the church, to recognize these ambiguous guardians standing at the limit of the church, showing us the role of the ambiguous, showing us the role of the strange, of those things that don't fit. And so after the zombie apocalypse, the problem is not the monster, not the strange, it's not the thing that doesn't fit into categories, which is the problem. Monsters have a role to play in the grand scope of things. Just like our passions have a role to play. Just like exceptions, just like the unknown are idiosyncrasies, the idiosyncrasies of existence, all of those have a part to play. That's not the problem. The zombie apocalypse happens when there are more idiosyncrasies than there is unity, when there are more exceptions to the system than there are of the system. When that happens, that is the very description of decomposition. A rotting corpse comes about when the elements cease to have unity and break down into their idiosyncratic directions. The problem of gargoyles would be if all the saints in the church were replaced with gargoyles. It's a turning upside down of the world. So let me give you an example. So if modern and postmodern art, for example, was there to break down the systems of representation, to question all the rules, all the presuppositions of art, then the zombie apocalypse is when we have giant state funded museums filled only with art that is supposed to question the rules of art. Can you see the problem with that? You can't be a rebel when everybody is a rebel. It just doesn't work, it just falls apart. In order to be a rebel, you need something solid to be standing outside of and criticizing. So I want to present you one monster. There is one monster in the Western imagination which has taken up a special place. That monster is the Cynocephalus. It is the dog headed man. So dog headed men actually appear in cultures all over the world, from England to China. I mean, they're in every culture. But at least in the Christian tradition, the dog headed man came to us from, guess where it came from? The legends of Alexander the Great. So here are, here is Alexander fighting the dog headed men from a medieval manuscript. So the dog headed man became the very image of this fierce and undescribable strangeness, the fierce and indescribable foreigner. They are encountered as the very image of the unknown. And they are hailed as the enemy of Christ and the enemy of civilization itself. They are the ultimate barbarian. We could say that they are an image of chaos. They are an image of the unknown in human form. That's a dog headed man gargoyle, by the way. So just as the word barbarian, the word itself means someone who barks like a dog, right? Bar, bar, bar. So too the Cynocepolis. You could call that, you could call it a visual barbarian. And it's important to give a caveat. We don't have to imagine, we don't have to think, we don't, even though some conspiracy theories might like to do so, we don't have to think that there was actually ever or is ever a race of people that were a genetic mixture of humans and dogs. That's just absolutely absurd. Just as we don't have to think that a hippopotamus, which means a river horse, has to have a genetic relationship to horses. Ancient people just used different categories. They weren't talking about genetics, talking about experience. So this experience of the unknown, the experience of a category of human beings that you can barely recognize because they're so far away from your capacity to see them, it's hard for us to imagine that because now we've seen everything. But imagine 500 years ago encountering an Australian bushman. Imagine the difficulty of recognizing that person because it's so far away from your own experience. You can still have that experience today. In terms of sound. You know, if I as a English speaker, if I hear a language like German and I can kind of make out a little bit of it, you know, and I can kind of hear some words and pick out some words, and if I hear Something, let's say like Russian, can't hear the words, but I can make out the intonations and I can kind of get a sense of at least where they're going. But when I hear Cantonese, I hear chaos, I can't make out any of it. So we can have that experience of auditory chaos. You just have to imagine the experience of visual chaos, let's say. And so, so the ancient. So for example, so the dog headed men, you have to see them. They're not an actual group of people, they're just a type. They're an image of this encounter with something undescribable. So if Alexander found the dog headed men on the edges of Asia, Charlemagne found the dog headed men as these northern barbarian tribes coming down to kill his men. And then Christopher Columbus thought he found the dog headed men when he arrived in North America. It's just that experience of the absolute difference. So in a way, the cynocephalous became the typical monster of the Middle Ages. I want to show you something. So in the image I showed you before, this image I showed you of Christ and then all the peoples of the world and all of time surrounding him and him sending out his disciples out to go to the edges of the world, there's something you might not have caught in this image. I don't know if you can catch it now. Maybe if you take a little moment to look. Can somebody see them? I'll help you out. And so the dog headed men are represented as monsters. Yes, but as those who you can commune with nonetheless, who are at least part of the potential at the edge of the world, with which we can engage in and which can hear the message in some mysterious way, which can engage with you in some mysterious way. And so this image is in France, it's in Vezelay, but there are also images of dog headed men in Eastern icons of Pentecost. So this is an image from Armenia. So we can see, can you see the dog? Everybody can see the dog headed man. And we also have a dog headed saint. This is an icon of St. Christopher. So you might know St. Christopher as the patron saint of travelers in the west. He's represented as a giant and he's mostly known for these little medals that people wear when they're traveling, or else these little statuettes that are on the dashboard of cars. You know, people have these, these little statues of St. Christopher and in the west he's represented as this giant. But if you've been paying attention to what I've been saying, it doesn't matter whether he's a giant or a dog headed man. It doesn't matter to the fact that he's a monster, just like those giants at the edge of the flood in the story of Noah. And so the fact that he is the patron saint of travelers should probably not surprise us either. As we move away from our own home, as we move away from our own center, no matter what that is, and we move out into the unknown. Our guide, our patron is this holy monster. And the way he was represented in the Middle Ages they relates to his function as a monster. In the Greek tradition, he was often represented above the door of the church. As you're leaving the church, so you would, as you were leaving the church, the last icon you would encounter would be this icon of St. Christopher. And in the west in the Middle Ages, St. Christopher was represented on bridges so that he could represent that in between space, that indeterminate space that lies between categories. So I think, I think St. Christopher is the patron saint of the end of the world. That's my own opinion, but I like to call him that. So I want to end my talk by telling you a story, telling you one of the legends of St. Christopher. So the most famous story of St. Christopher comes from the Western tradition and it has St. Christopher as a giant Canaanite. And the Canaanites are basically these strange residues of the descendants of Cain. And so they were related to these giants that were there before the flood in the Bible. And so he's seen as part of this group. Who knows how they survived the flood. It doesn't matter. What's important is to understand the symbolic relationship between, between this character and these giants that were there before the flood. And so he was this giant, ferocious Canaanite, and he decided he's a warrior. You can see that he's represented as a warrior. And so he said it in his mind that he would serve the most powerful king in the world. And so he set out into the world to find the most powerful king. So he comes to the court of the most powerful king in the world and he starts to serve this king. And then at some point he notices that the king is afraid of the devil. And so Christopher asks the king, he says, who is this devil? And the king doesn't want to tell him, right? Because the king doesn't want him to leave. But St. Christopher says, no, if you don't tell me who the devil is, then I leave. I'm going to leave and not serve you anymore. And so St. Christopher tricks the king, because obviously when the king tells him who the devil is, St. Christopher immediately leaves and goes to find the devil. So St. Christopher finds the devil and he starts to serve the devil. And then one day he notices that the devil, as he's walking down the street, he avoids the cross. So St. Christopher says, oh, there's something going on there. And he asks the devil says, what is this cross? Why are you afraid of the cross? And obviously the devil doesn't want to tell him because he knows that St. Christopher will leave him. But St. Christopher insists, and he says, unless you tell me what's the deal with this cross, then I'm going to leave you. So St Christopher tricks the devil, and the devil tells him about Christ. So St. Christopher immediately leaves and tries to find Christ. So as he's out there trying to find Christ, he comes upon a monk. And the monk tells him, he said, I will show you the ways of Christianity. So the monk tells St. Christopher, well, you should fast. St. Christopher says, no, I can't fast. So the monk tells St. Christopher, then you should pray. And St. Christopher says, no, I can't pray. I mean, he's a monster after all. And so the monk tells St Christopher to stand on the side of the river and to cross whoever asks him to cross. Right now, I need you to remember from the beginning of what I said. This image of the world, this image of the world going to the flood. This image of the island going to the ocean. So St. Christopher stands on the edge of the world. He stands. Stands on the edge of the flood. And then suddenly one day, this young child comes to see him. This young child, obviously the weakest thing you can think of. And the child asks St. Christopher to help him cross the river. So St. Christopher puts him on his shoulder and he starts to cross him over the river. And as he's crossing, the child becomes heavier and heavier and heavier. And St Christopher is struggling to hold the child up above the waters. And at some point, it feels like the whole world is on his shoulders. But he manages to cross the river and comes to the other side. And then he asks the child, he says, why were you so heavy? And the child answers, because I was carrying the sins of the world. And so Christ tricks St Christopher into serving him the smallest thing, the weakest thing, the seed. Trick St. Christopher into serving him. So I think that's really the last image I want to leave you with. Especially as we go towards those of you who are Christian and are in Lent. We're moving towards the Passion. Of Christ or the death of Christ and the resurrection. Just one, maybe one little lesson. Last thing. One of the things I'm trying to do when I give these talks is try to help people see the patterns. So this story, this child on the back of this monster, what does it answer to? What puzzle does it solve that I presented at the beginning? It solves this puzzle. Here's the dead child and the writhing beast. But in the story of Christ, that's the difference between the story, the poem of Yeats is that we don't have this idea of just the falconer standing in the middle and calling out to the falconer. We have this notion of the seed, this. This image of moving out all the way to the edge. And that's the story of Easter, moving out all the way down into the bottom of death and then living in the hope of the resurrection. And so the story of St. Christopher, what it really is about is about the possibility of the resurrection coming out. Death. It's the solution to the zombie apocalypse. So thank you."}
{"episode_id":"SW - #032 - 2019-03-19 - Zombies, Postmodernism and Art","start":4187.73,"end":4243.63,"speaker":"Jonathan Pageau","text":"Thank you for listening to the Symbolic World podcast. As you know, this podcast is for now based mostly on my YouTube videos, which I am transferring into audio format. Please go ahead and visit my YouTube channel. There are more videos there on different subjects that I'm not going to put into audio. And please share this to your friends. I know a lot of people know about the YouTube content, but not so many people know that this is also a podcast. So share it to your friends, share it on social media. And if you can, feel free to support this financially as well by going to my Patreon page, which is Pajo videos. Strangely, you can go there and you can support it at any amount that you want. A month for all the patrons. I do a monthly Q and A, live Q and A in which people can ask questions in the chat. And I try to have a more personal connection with people. The YouTube comments have become difficult to follow and to answer. I'll see you soon."}
