{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":15.84,"end":19.84,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":31.93,"end":54.09,"speaker":"Australian Podcast Host","text":"Yeah, like I was saying too, because in Australia the restrictions are very, very harsh. And I think at the start of it, it wasn't that I was happy, but I kind of took advantage because I'm like, you know what? I'm gonna have a lot of time to do my own thing, learn a new skill, spend time with my, my fiance and all this kind of stuff. But I think a year and a half later it's like, okay, I think this is enough. It's get, it's getting to me now. I'm gonna admit it."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":54.34,"end":142.08,"speaker":"Jonathan Pageau","text":"Yeah, I believe it. You know, I think we all had the same reaction. The same for me, when first, when it started, it was kind of like, okay, we'll have some time together as a family and we'll also, you know, I'll be able to kind of, let's say, because I wasn't traveling anymore, so I was able to invest in different venues that I hadn't, different things that I knew that I need to put some time in, but I hadn't. And so it was actually pretty fruitful. But by now, I mean, it's not as bad here as it is there. But right now, you know, with these passports and the scapegoating and all of these kind of weird political measures that are coming to the fore, it's becoming, yeah, it's becoming more and more frightening, let's say, because it's also at the same time they keep telling us that it doesn't matter if you're vaccinated, you still have to wear your mask, you still have to social distance and there's going to be boosters and there's new variants. And so it's as if they're going to have it all. We'll have quarantines, we'll have vaccines and social distancing and masks and infinite boosters. So it's very. Yeah. And for a disease that kills like 0.1% of the population, I don't know, I mean, it feels like it's a little bit of a stretch to destroy our democracies and to completely change the very mechanisms by which our societies function. So it seems to me like there's something else that's going on and that it's not just about a disease, that there are other, that there are other things at play in this."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":142.08,"end":173.03,"speaker":"Australian Podcast Host","text":"So, ah, for sure. And like, I laugh because it's like I don't know what else to do at this point. You know what I mean? It's getting so it's getting so ridiculous, and I think now more than ever, it's like so much divisiveness, you know what I mean? Like, if you have a certain opinion, it's like you're a piece of crap. How dare you. And it's very black or white communities breaking down this kind of thing. So I wanted to ask you, what is the symbolism behind all this? Like, especially what's going on right now. Is this related to Revelations, or is that a stretch? What's going on here?"}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":174.07,"end":384.41,"speaker":"Jonathan Pageau","text":"I think it depends how you look at it. You know, I think that it's not a stretch. If you understand the book of Revelation as a series of patterns, you could say a series of social patterns. They kind of manifest themselves. And the idea of Revelation is that it's the final version, let's say, the most complete version of this pattern. But if you understand it more as these kind of symbolic patterns that just exists in the world, then it's. Then in Revelation you can actually see these types of moves that happen in culture. You know, the example I like to give is, for example, in Scripture, there's an image of a whore riding a beast. And this whore is all about mixture and about trade and about kind of consuming. And this whole vision of, you know, that that's what a whore is, right? It's just. Just about pleasure and it's just about consuming. It's just. And it's all about mixture and lack of identity and all these things. And so. And then it's sitting on a beast, which is interesting. And this beast is actually an image of control, of civilization because the beast is an amalgamation of all the ancient empires. In scripture, there's these beasts that have. That represent different empires. So you see like this amalgamation of empire with the whore on it. And then in scripture, it says that the beast kills the whore at some point. And there's this whole sense that the beast sets up an image of itself and that this image brings about a kind of state of control and the idea of marking with an identity. And that when you mark the idea of marking with an identity in a way that you can't escape the idea that there is no remainder. There's nothing outside of the system. The system tries to be total and tries to be complete. And if the only thing you can do, basically, is if you refuse to participate in the system, then you're completely excluded, right? You can't buy, you can't sell, you can't exist, that you don't have an existence, basically. And so if you Understand it that way, then you can kind of see these movements towards, let's say, the idea, identification and the idea of tracking and control and, and the relationship. It seems like the vaccine is maybe just a door into these systems of control which are possible because of technology. As we see this coming through, then we see similar things to what we see in scripture, which is that right now I was just watching a video of some minister in Nigeria saying that if you're not vaccinated and you can't show proof of vaccination, you won't be able to go to a bank, you won't be able to go to church. And so this is the next kind of. The next step where they're like inching towards the idea that you can't participate in society at all if you haven't received this kind of sacrament of participation. At the same time as they're telling us that the sacrament of participation isn't as good as you thought and you're going to have to keep getting it every three, four months for the rest of your life. I don't know, it's all very vague. But so it does kind of bring about. We don't have to freak out necessarily and think like this is it, you know, but it does the. So the Soran scripture can help you understand these patterns and understand this relationship between systems of control, how they take over after too much freedom. You could say something is too chaotic and too much goes too much in that direction. Then after that, a system of control comes and tries to clamp it down."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":385.99,"end":406.31,"speaker":"Australian Podcast Host","text":"Yeah, it's very like. Like lately it's been so inverted. I feel like these times, because at one stage, at least in Australia, it's completely illegal for you to go to church, but you can pay a prostitute to have sex. Like, that's fine. You know what I mean? It's like. Wait, wait, wait, wait. I thought this was all about, like, social distancing and all this kind of stuff, but I don't think that it's about that."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":406.55,"end":512.34,"speaker":"Jonathan Pageau","text":"No, there's something else, definitely something else going on. And people often, it's funny because people wonder, what is it? And people don't understand that power is its own motivation. There is no other secret motivation except for power. You see that it's like the capacity for, let's say the capacity for power, which comes into a kind of unholy union with people's desire to feel safe and desire to not be in danger. These two things kind of go together and they. They go together surprisingly well because the Safer you are, the more afraid you are, and the more you feel like you're unsafe. This is really true. It was interesting because I lived in Congo for four years, and my wife and I, and my son and I, my son and us, we actually lived in local neighborhoods with Congolese people in the city of Kinshasa. There were no other Westerners around. It was just, you know, so. So we were. We were kind of in the life, and we lived through the rhythms of the life. And the west, like the kind of Westerners, North Americans and Europeans lived in these gated compounds that had guards and had. Had all this. And they were far more afraid than we were because they were so safe and they felt like this safety. Now all of a sudden, every little danger becomes like an. Like this crazy thing, and it's like, no, you're not supposed to ever be in danger. You're not supposed to ever get sick. You're not supposed to ever die, basically. And this is just. That. That's not true. It's just a lie. It's just a basic lie about how we exist in the world and how risk is just an integral part of being human, and the less risk we take, the more we're afraid of them."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":512.66,"end":542.61,"speaker":"Australian Podcast Host","text":"Yeah. I think that's why I really enjoy traveling, especially to third world countries and kind of just getting thrown into the unknown. You know what I mean? I think it's what I've noticed today, those who are, like, the most strict about, you know, like, getting the jab and lockdown, all this kind of stuff, it's usually those who haven't really stepped outside their bubble their whole life. You know what I mean? And I find that very interesting. Like. Like you said, like, when you feel so safe and comfortable, that's when you kind of get more afraid of getting hurt and taking risks and these kind of things."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":542.85,"end":569.87,"speaker":"Jonathan Pageau","text":"Yeah, exactly. And it's. And it really is a. You know, it just. It's kind of a mode of being in which people embark. And there's something about the mother, like something about this kind of devouring mother that says, you know, it's like, I'm gonna protect you from all danger. I'm gonna make sure that nothing happens to you, that you're not gonna die, you're not gonna get sick, you're not going to hurt yourself, and you're not also gonna be in danger. There'll be no hate speech, no one's gonna insult you, nobody's gonna hurt you. Nobody's gonna hurt your feelings."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":570.03,"end":575.15,"speaker":"Australian Podcast Host","text":"It reminds me of my mother she's like a Latina Spanish mom. So very."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":576.07,"end":578.59,"speaker":"Jonathan Pageau","text":"She's overprotective, but it's like I rebelled."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":578.59,"end":582.03,"speaker":"Australian Podcast Host","text":"In my teenage years. It kind of had the opposite effect of what she intended."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":582.03,"end":617.37,"speaker":"Jonathan Pageau","text":"But, oh, yeah, you were like, okay, I need to break free from this. But imagine that now at a level of systems where, you know, and people struggle to understand that there's a relationship, let's say, with the kind of rise in social justice mentality that was there several years ago, and this desire for safe spaces, this desire to not. To not be triggered, that they know that we're fragile, that we need to be preserved from all kind of danger. And now this situation with COVID is an extension, like a physical extension of something which has been a social phenomenon for quite a while now."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":618.81,"end":623.85,"speaker":"Australian Podcast Host","text":"Is this like a start of a new age, do you think? I just want to say, I mean, back."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":623.85,"end":750.15,"speaker":"Jonathan Pageau","text":"You know, I hope it's not a start of a new age. I mean, for sure, it does feel like something similar happened in Weimar, really, Because Weimar was a wild place. It was a wild, crazy place. And there were all this kind of, let's say, fluidity in identity and fluidity in roles and fluidity in terms of taboos. And all of this was all kind of mixed up. And at some point when there was a crisis, then the only thing to do was to overcompensate and to kind of clamp down and create massive systems of control. And I think that this is what we're kind of seeing is that this little crisis is just becoming an opportunity for systems of control to clamp down. It's hard not to also see that there seems to be something that is transnational about what's happening. There seems to be patterns which are not just about our own government, but that seem to be kind of moving across governments ways of speaking, even types of words people use. For example, like this phrase that's now popular, the pandemic of the unvaccinated. It's being used by different governments, by different authorities in different countries. And you realize that, okay, it's not just. It's like if Justin Trudeau says it and then you hear it in England and then you hear it in other countries, and you realize, okay, I've also heard them say similar phrases like build back better and all these phrases that we're using, they have this kind of weird vocabulary that is transnational. And so that's also kind of frightening. It is frightening to imagine that there are patterns which are even beyond our politics and that are just going to happen. There's nothing we can do about it here. The COVID passport in Quebec, where I am, it didn't get debated in parliament. It didn't get debated legally. It was just said, this is it. It was just mandated completely in a, like a directly tyrannical way. And there was no possible way to discuss it with anybody. There was nothing to say. It was just like, this is we're gonna do. And everybody just says, okay."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":750.23,"end":750.87,"speaker":"Australian Podcast Host","text":"He's the same."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":750.87,"end":755.35,"speaker":"Jonathan Pageau","text":"It's like we're not a democracy anymore. It's like everybody's just forgotten that we're supposed to be a democracy."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":755.75,"end":761.03,"speaker":"Australian Podcast Host","text":"Protesting is illegal, so you can't even like, voice your opinion on this stuff. They shut you down."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":761.43,"end":765.83,"speaker":"Jonathan Pageau","text":"Yeah, well, here, at least yet right now, they don't shut us down. They just don't cover it."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":766.15,"end":769.62,"speaker":"Australian Podcast Host","text":"We're not allowed to leave the country. We haven't since March last year."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":769.62,"end":772.62,"speaker":"Jonathan Pageau","text":"Yeah, you guys, it's crazy. Like, you're not allowed to protest at all."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":772.62,"end":834.23,"speaker":"Australian Podcast Host","text":"No, we're not allowed to leave. I can't leave the city. I can't leave 5km within my own house. I think now they did, like, only one person per household can go for a walk around the block. Playgrounds shut down. Like, it's. Yeah, it's pretty. I don't even know what to say about that because it's like, I think it's going to end, but then it just gets extended again and again and again and it's like, I don't know, man. But I guess a positive out of this whole thing is that it led me to read Revelations and go inwards and kind of explore Christianity. Because I discovered you're working many years ago and I didn't even know what orthodoxy really was. And it's been very mind blowing. And I've really been delving deep into symbolism. And I love your pop culture videos. Breaking down the patterns of movies and why we're so, like, obsessed with pop culture and stuff like this. For those listening at home, maybe for those who aren't very well versed in symbolism. What is symbolism and how do you distinguish that from, let's say, Jungian archetypes?"}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":834.55,"end":957.66,"speaker":"Jonathan Pageau","text":"Well, it's a little bit related. I'm not a huge follower of Jung, but it's not completely unrelated. The best way to understand symbolism, I think, in a modern world is to understand the problem of complexity, which is that when you look out at the world, we see things. We see the world kind of, let's say, appear to us in a certain way, but if we're attentive and we think about it, we realize that every aspect of the world that we see is infinitely complex, right? From the glass that I'm drinking of to the table in front of me, to the sounds that I hear. The glass that I have in my hand is as complex as you. There's an infinite amount of complexity in the glass. It's made of multiple. Multiple parts and multiple aspects, right? Your chair is made out of multiple parts. And so. But there's a way in which we are able to perceive unities in this multiplicity, right? And so there's a way in which unity kind of comes out of multiplicity and appears to us as a pattern, right? And so reality is necessarily patterned. For us to be able to even engage with it, we have to kind of. Our consciousness has to engage with it in its patterns. And so that would be maybe the first way to understand what symbolism is, which is that there's an inevitability of patterns in the way we encounter things. Now, this is true for objects, it's true for sounds, it's true for everything. But it's ultimately true for the way in which we engage with each other. That is, we string a bunch of words together, a bunch of facts together to create narratives, to create stories. And those stories need to have a pattern. And that pattern isn't arbitrary, right? It's an objective pattern that you can discern. And it's the same for images. It's the same for the way we remember things. So for us to remember something, we have to condense all this multiplicity into images that we can remember. So those images will also be patterned. And so the way we represent things ends up being patterned. So that's really the basis of symbolism."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":957.81,"end":957.97,"speaker":"Australian Podcast Host","text":"And."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":958.2,"end":1074.77,"speaker":"Jonathan Pageau","text":"And the idea is that you can study that and you can understand it. And there's also a process by which you could say it this way, that the symbolism is the pattern of attention. It's the way that we attend to the world. And those things would grab our attention the most and for the longest period of time will remain. And the things that don't grab our attention and that we don't remember will kind of fade away. Just like if someone tells you what happened during their day and it's really boring and just a bunch of things that don't relate to each other, you're just going to forget it. But if someone tell you this crazy thing that happened to him, and he almost fell off a cliff, and then something happened and he came up and then you're going to remember it because it's going to have something which gathers your attention. So in the same way, all the stories we've been telling each other for the millennia that we've been around, those have an almost like. Like a natural selection process by which those that end up being preserved are the ones that gather our attention the most. So that's why you can look at fairy tales and religious stories and myths as containing more of these condensed patterns than, let's say, just the common reality in which we exist. But the common reality in which we exist is also pattern. It's just not as distilled as these patterns. And so in the same manner, the way we interact with each other is also patterned. Right? You speak, I speak. We kind of have a way to listen to the other person, to show them we're listening. And we have to follow that pattern or else communication breaks down. But then that also scales up into rituals like handshakes, like saying hello, you know, like smiling. And then ultimately that scales up into something like religious rituals where we all gather together, we act in communion, we act together towards something which transcends us, and then that binds us as a community. So we can understand everything from fairy tales to, let's say, to liturgy, to Christian liturgy or to architecture with these patterns of this kind of symbolic patterning."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":1076.13,"end":1081.17,"speaker":"Australian Podcast Host","text":"And these patterns or symbolism. Is it religious in nature?"}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":1082.13,"end":1161.11,"speaker":"Jonathan Pageau","text":"Well, it's not. I would say, you could say yes and no. That is, it isn't religious in nature if you. It's just reality. It's just the way that reality lays itself out. But you could say that at the. At a most basic level, reality does present itself in a religious manner. That is, even if you understand what religion, the word religion, religion means, means bringing together, means binding together. That's what really connecting things together. That's what religion is. And so it ends up being the ultimate types of patterns move towards religion because they end up being, let's say, recognizing how these patterns bind us together and then looking up towards them, you could say consciousnesses. It's not just even pattern. Even consciousness has this pattern. And so you have something which binds a community together. They recognize it, they celebrate it together, they sing songs about it. They. They end up giving things to it. And so then you have the image of the king or the image of a God and the image of these heroes that we venerate from antiquity. And so it does end up looking religious in its kind of ultimate sphere. But it scales all the way down to, like I said, a Handshake or just kind of simple social rituals."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":1161.51,"end":1169.07,"speaker":"Australian Podcast Host","text":"So are these patterns something that we recognize in our own minds. Or is the pattern a more fundamental reality?"}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":1169.55,"end":1227.24,"speaker":"Jonathan Pageau","text":"Well, this is where it becomes tricky, because there's an. There's a. Even today, like in modern physics right now, you know, they have this whole observer problem and they have. They have this sense. A lot of scientists even now are coming to the sense that consciousness is necessary for reality to kind of present itself. Because. Or else without that, we have something like quantum fields or just. Just this kind of possibility of existence. And so you can't completely disassociate mind from the manner in which reality becomes patterned because it is kind of an invisible pattern which manifests itself in reality. So you can't completely distinguish it. The problem we have is that since. Let's say, since Romanticism and since kind of modern philosophy, we tend to somehow think that mind is subjective and in the sense of idiosyncratic. And like, you know, relative to you. Like, relative to your opinion, let's say."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":1227.4,"end":1229.12,"speaker":"Australian Podcast Host","text":"Yes, that's not."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":1229.12,"end":1282.62,"speaker":"Jonathan Pageau","text":"That's not true. They'd say there's. There's something objective about mind and the. The way in which these patterns present themselves to us. And in that. In that objectivity, then we can kind of recognize them. We don't just recognize them, we participate in them. And that's really important to see the difference between. Also between a kind of symbolic understanding and a more modern, rationalistic, abstract way of understanding. The modern rationalists tends to abstract themselves from the world and think they don't exist. Or they're just this, like, floating being that's looking at the world and then they analyze it. Whereas when you understand this patterning, you realize that, no, you're in the world and you're kind of recognizing and participating and celebrating these patterns. Rather than this kind of cold. Cold. Cynical. Not cynical, but like just cold analysis of science. Let's say."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":1283.5,"end":1291.26,"speaker":"Australian Podcast Host","text":"Do you think it's possible to step outside the patterns and the world? No. That's what a lot of gurus claim."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":1291.26,"end":1396.39,"speaker":"Jonathan Pageau","text":"So, yeah, so I think so. Like, you could say that, yes, but how do you know? But it would be something like a spiritual. Like a spiritual experience. I think that you can have a kind of transcendent spiritual experience. But that transcendent spiritual experience will then when it comes back down, right? So let's say you have a theophany and you see something you like. You not see with your eyes, but like you have an intuition. Is pure intuition of something which is beyond multiplicity. Like as soon as you turn back and you even think about it or even represent it in your mind or even. Or you even talk about it or you frame it, then it comes back into the world of patterns. Does that make sense? It immediately comes back into the world of patterns. And so that's why you can recognize, I think you can recognize a fake spiritual person from a real spiritual person when the fake spiritual person tends to want to destroy the world. And so they say they had this kind of spiritual experience, and then what they do is they say, then they try to relativize everything. It's like, I had the spiritual experience and then everything else is crap. Like nothing. All of this is nothing. Right? Whereas I think the real kind of spiritual insight is able to see that this is the source of the patterns, this invisible transcendent point is the source of the patterns, and so is able to kind of gather them into their experience. There's a beautiful image in a mystical, Christian mystical book called the Life of Moses by St. Gregory of NYSE."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":1396.55,"end":1397.71,"speaker":"Australian Podcast Host","text":"Okay, haven't read that."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":1397.71,"end":1462.19,"speaker":"Jonathan Pageau","text":"Where St. Gregory of Nyssa describes Moses ascending the mountain in order to encounter God in the divine darkness, like even beyond light, into this kind of ultimate, ultimate transcendent space where even, let's say, even vision disappears and you. You enter in this kind of pure being, let's say, or pure beyond being. And so as he goes up the mountain, he removes all these layers, you know, like his sandals, and he kind of removes this quantity and becomes purified as he enters into this kind of transcendent space. But then when he gets there, he's given the pattern of the tabernacle, he's given the pattern of the space of worship. And so. And in that pattern, he sees all the things he dropped as he was going up, right? He sees these layers, he sees these garments of skin, he sees these actions. And so that's the idea, is that if you really attain these kind of high spiritual states, then you. You should be able to gather into them the multiplicity and see multiplicity as an expression of these high spiritual states. I don't know if that makes sense to you."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":1462.27,"end":1523.74,"speaker":"Australian Podcast Host","text":"No, no, it definitely does. I think it's important to reconcile these worlds because I fell into the kind of New age, non dual. I mean, it's not even real non duality, really. Because what I've found out is that orthodox Christianity is a form of non duality. Because non duality just means non, not two. But yeah, I did find this kind of. This path that a lot of People go down in spirituality where they basically try to dissolve the world. You know what I mean? They call it all illusory, it's all relativistic. But what I've experienced is absolute truth. So it's like this dialectical tension. Like you're saying one thing, but then you're acting in a way that's not really congruent to what you're actually speaking. So you can't really live and act in the world that you're. You're speaking about. And what are your thoughts about this? Like, this kind of the. The blind leading the blind, false prophets, New Age spirituality. Why is this so popular? And I understand it because I went full force into it as well and got a bit shaken up."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":1524.54,"end":1534.78,"speaker":"Jonathan Pageau","text":"Well, let's say first off, to give, you know, as we say, to give the devil it's due or to kind of understand what happened is that, yes, Christianity became extremely superficial."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":1535.02,"end":1535.66,"speaker":"Australian Podcast Host","text":"Oh, yeah."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":1535.74,"end":1549.55,"speaker":"Jonathan Pageau","text":"From the time of the Enlightenment, as it slowly moved, let's say, towards the 20th century, there was this. There was an extremely kind of superficial and almost materialistic version of Christianity."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":1550.51,"end":1553.07,"speaker":"Australian Podcast Host","text":"What do you mean by that? How did it turn materialistic?"}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":1553.31,"end":1573.71,"speaker":"Jonathan Pageau","text":"Well, it became very moralistic. First of all, it tended to discount mystical experience. It tended to be legalistic, right into this kind of Protestant idea that you're declared saved. And it's this kind of. It's almost like a legal declaration of your salvation. And it doesn't change anything really. But it's like when you die, you go to heaven, like all this kind of nonsense."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":1573.79,"end":1577.63,"speaker":"Australian Podcast Host","text":"So if you believe in Jesus, you're done. You don't have to really do much work."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":1577.71,"end":1581.29,"speaker":"Jonathan Pageau","text":"That's what spirituality is to you. Like, you just believe in Jesus and you're saved."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":1581.29,"end":1582.41,"speaker":"Australian Podcast Host","text":"Bada bim, bada boom."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":1582.49,"end":1658.28,"speaker":"Jonathan Pageau","text":"And that's it. That's it. Like, I don't know what that is. Like, it doesn't mean anything. So I get it. Right. I understand. And then also this desire to kind of embrace scientism, let's say, in Christianity, and then trying to kind of defend scripture in a scientific way and defend Genesis as a scientific narrative and defend all these stories in a historical, scientific way, and debasing them so much that they just. People didn't understand the spiritual significance of these stories anymore. They would argue about some stupid statuette that they found, the desert in Palestine, but then they didn't understand what it even meant for Moses to go up the mountain and encounter this divine, transcendent experience and then come down with his face shining in glory. Like, do you understand what that's referring to? Or do you just see it as a material phenomenon that happened? Right. So this is the problem that happened. And so as the scientism and this kind of materialism took shape and Christians tried to keep up and tried to stay materialist, at some point just shattered. And then all of these stories just seemed like a bunch of silly, stupid stories. Like, why would it matter that some guy got nailed on a cross 2,000 years ago? Like, that saves you. Like, some guy gets nailed on a cross and then you're going to heaven. Like, really?"}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":1659.32,"end":1660.88,"speaker":"Australian Podcast Host","text":"Yeah, that didn't make sense to me either."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":1660.88,"end":1853.88,"speaker":"Jonathan Pageau","text":"Right. It's like, is that the story? Like, dude, it's just total nonsense. Right? And so it's like. So I get it. I understand why at some point people. And you see it, like, you see it even before the modern world. You see these kind of esoteric. These esoteric groups and these esoteric ideas start to appear Even in the 17th century, you know, you see, with the Rosicrucians and then moving into kind of Blavatsky and the Theosophists, kind of, you have this kind of opening up and Crowley and all these occultists in the 19th century. So you kind of see this. This reaction, let's say, to this materialist, moralistic Christianity. And then that kind of wins. You could say in the 60s, especially, that side of the. Of this. Of this kind of conflict wins. And then there's this explosion of kind of wild mysticism and all these explorations of all these other traditions and a mixture and like, being, you know, going to India to find some guru and then being fascinated by anything except your own. Your own tradition. And also, like, the individualism of the modern world kind of seeped into there, and so it became very idiosyncratic. All the. Everybody has their own thing, and everybody has their own mixture of stone of, like, you know, crystals and these different practices and spiritual buffet, whatever, all these things. Yeah. And so I get it. I get it. But I think that it's important to kind of be able to notice that it's participating in the breakdown of our societies. Right? So you have all these idiosyncratic spiritualities that don't coalesce, that don't kind of come together, or they do as a cult. So it's either you're totally idiosyncratic, or you kind of give yourself completely to this guru that usually lasts a few years, then it collapses, and there's all these scandals that come out. And so it's A just kind of this, this. It's a very disturbing situation. And one of the things that makes it even more disturbing is really the obsession with the strange. That is the idea that my own story is worthless and I can't see any value in it. But I can read some, like, weird tantric text from. From some culture that I have nothing to do with, that has a caste system that I don't participate in, that has. That has all these realities that I can't at all understand. But I find it super interesting and super fascinating and really kind of, I feel like it reveals something to me. So my, like, let's say my take on that or my approach to that has rather been to say, okay, let's go back into our story and let's try to go back and find what was there before the breakdown. Find what was there before things started to fall apart. And that's what we see in the mystics. Like, you read, like I talked about San Gregory of Nyssa, there are these amazing texts written in the early centuries of Christianity which have everything of anything that a New Ager would want in terms of this kind of cosmic understanding and this mystical union with something transcendent. It's all there, but it doesn't have to break down into all these kind of individualistic idiosyncrasies that people participate in and leads them into all these strange directions, you know?"}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":1854.12,"end":1901.53,"speaker":"Australian Podcast Host","text":"Yeah, I think I can understand the allure, I think, with New Age spirituality, especially with the, you know, the understanding of the 19th, 20th century of Christianity, that materialistic, surface level Christianity you're talking about. And I can see why people get so attracted to that Eastern mysticism side, because you can have that direct mystical experience. It's a lot more, I guess, entertaining, you know, a lot more explorations, kind of scratches that curiosity button. And. But like you said, early Christianity, like Orthodoxy, it's got all of that mysticism stuff. It's just that we didn't. We didn't know. And a lot of people who are very against, let's say, Christianity, like Protestantism or Catholicism, aren't even very aware of Orthodoxy. And like early church fathers were teaching."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":1901.93,"end":1997.8,"speaker":"Jonathan Pageau","text":"Exactly. And not only that, but there's been an effort in the past few hundred years to iron over in. Even in the Bible, that is, even in the Bible translations, there's been a concerted effort to. To iron over anything that smacks of something strange or something that doesn't. That. That. That modernists can't deal with. You know, and so, for example, like this whole Idea of this hierarchy of angels and all of these kind of sons of God that are in the council of the divine and, and, and kind of manifest God's will in the world. You know, that's something that people have just been trying to chase out of Christianity for several hundred years and kind of to their detriment, because now people are interested, everybody's interested in angiology and everybody's like encountering all these different angels, but they have no way of discerning what they're encountering. That's completely chaotic. And they think that just because they have an encounter with a being that somehow this is meaningful. And it's like, so they don't have a map to kind of function in this world of intermediary spirits. But it's all there. It's there in scripture, it's there in the tradition, it's there in the iconography of Christianity where you do have a kind of map of this intermediary world. And there are ways to kind of encounter it in a healthy way without, you know, ending up following some, some strange being that you encountered on Ayahuasca. And then you, and then it takes you on down a very dark rabbit hole and you find yourself in psychic trouble, you know, after a little while where all of a sudden you start to break down."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":1997.96,"end":2018.84,"speaker":"Australian Podcast Host","text":"Oh yeah, I've been there, man, I've been there. It's scary stuff. I think having grounding is really important, especially like strong scaffolding. I think when you just get catapulted into these realms, sometimes it's hard to close those doors, you know, once opened. Yeah, and the thing with doors is that it's a two way street."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":2019,"end":2019.72,"speaker":"Jonathan Pageau","text":"Exactly."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":2020.68,"end":2044.68,"speaker":"Australian Podcast Host","text":"It's not just you entering the spiritual realm, it's also a spiritual realm entering your. If you believe in that. And I definitely, I find it hard not to believe that there is a spiritual war out there. And there are principalities. So like, what are your thoughts on this? Like pre. Less spiritual war, good versus evil. How do you reconcile dualism? Is it two independent forces? Like how do you, how do you go about."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":2044.68,"end":2157.35,"speaker":"Jonathan Pageau","text":"This is an interesting, there's an interesting way to kind of understand that, which is that there is a kind of duality, let's say, and the duality is due to the fall. Like no matter how you kind of understand it, if you look at the story of Adam and Eve, that's what you see. You see that they're in a kind of balanced space or in this garden that is kind of a balance between culture and nature. That's a balance between masculine, feminine that has this balanced reality. It's not perfect, right. And there's a remainder in it which is this kind of serpent. And then this remainder tends them into duality, tempts them into seeing duality as final. But duality exists. It exists in the world. And so that's the fall. The fall is this fall into kind of extreme duality. And so you can see it in the human world as this kind of good and evil and these kind of dualities. But you can also see it in the cosmic sphere as these two sides, like you said, the angel and the demons are these two sides of a great cosmic story. But there's also a manner in which these principalities ultimately are resolved in God. And so there's an interesting quote from the. I think it's from St. Gregory Nazianzes, who. He talks about the angels of the left hand, right, that there are the angels of the right hand and then there are the angels of the left hand. The angels of the left hand of God are basically the demons. And the demons think that they're doing their own thing, but they don't realize that they're not. That they're actually ultimately doing the will of God in kind of showing us our own, let's say, weaknesses and manifesting these weaknesses and this darkness in the world so that that darkness can then be covered by God ultimately, in the final image, you could say it sounds."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":2157.35,"end":2161.54,"speaker":"Australian Podcast Host","text":"Like it relates a little bit to Jungian shadow integration. A little bit."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":2161.78,"end":2269,"speaker":"Jonathan Pageau","text":"There's something of that. But the difference, I would say, with the shadow integration is that we really don't. We don't see Christianity. That's really important. Christianity doesn't see darkness or doesn't see sin as a positive force. It's a. It's a. What it. What it is. It's a kind of. It's something not in its right place or something not looking in the right direction. That's what sin is. And so being is always positive, like being is always true. But then there's an. There's a way in which it can become out of whack by, let's say, attracting too much attention to itself or not being in the right place. And so that is the way in which we kind of understand. So that's the kind of. The joke about the demons is that they think that they're dark, but ultimately they'll participate in the greater light, you could say, without. Without even understanding what they're doing, you know. So it's not just that it's not that that God is integrating non being, let's say, or this kind of lack of being, but rather that he's revealing the way in which things actually do participate in the great picture. I don't know that that makes sense. So it's kind of like the image of Christ. Like you have this image of Christ going, when Christ dies, you know, there's this kind of more mythological version of the story in the Gospel of Nicodemus where, you know, you have the devil and Hades in. In hell. And they're like, we won, right? We killed the son of God. Like, this is it, you know, we finally did it. And they're like, excited because here he comes, right? We're going to bring him into death. But then they don't realize that if you bring light into darkness, right, it's not light that goes away. You do the opposite. And so bringing God into death was actually kind of revealing the world and kind of scattering that darkness."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":2270.35,"end":2279.71,"speaker":"Australian Podcast Host","text":"Well, it's even like the physical example of a candlelight. You know, no matter how much darkness there is around it, it can't actually overpower and over consume it."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":2279.87,"end":2292.83,"speaker":"Jonathan Pageau","text":"No, exactly. That's the end. That's a good. And the phrase you used is exactly the phrase that St. John uses in the gospel where he says that, you know, the darkness did not know it, but it didn't. It couldn't overpower it because like you said, that's not how light and dark work."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":2294.19,"end":2319.87,"speaker":"Australian Podcast Host","text":"And even in pop culture, or actually forever, we've been obsessed with this story of good versus evil and the hero's journey and all this kind of stuff. And I remember listening to an old podcast of yours, and you talked about the hero's journey and how ultimately it's Christ's story and that before Christ, there really wasn't at least the version of the hero's journey that is out today. Is that true? And can you, like, get into that?"}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":2319.87,"end":2481.99,"speaker":"Jonathan Pageau","text":"I mean, I think so. I think that because one of the things people talk about is like the dying and rising God, that there are all these ancient stories of these pagan gods that point towards ultimately this kind of story of death and resurrection. But I think they're kind of. How can I say this? I think they're looking back from a Christian point of view into something which maybe didn't have the same type of hierarchy that they think it did, that it was these scattered, you could say these scattered lights that were in the world. But then from the story of Christ, then we can look back into the past and and then all of a sudden, we see these light that are pointing towards ultimately, what is the story of Christ. And so the idea of going into the underworld, right? This descent into the underworld, that's the story that you see in the Hero's Journey, but that you also see just in so many stories, or you see it in the Iliad, you see in so many myths. You know, you see it in the Aeneid. All of these stories have this kind of descent into Hades. And then either you encounter someone, you encounter your father, and then your father reveals something to you, or you go there to get someone, right? You have the story of, I think it's Hercules who goes down into Hades and is able to save his friend out of death. And so you have these little versions of this kind of going into death and bringing out kind of revealing something that death wasn't able to hold on to, you could say, or finding something precious hidden in death, like going into death and then finding some vision that will give you meaning, right? And so it's there, right? It is there. But once the story of Christ happened, then that story, it reaches its limit. There's actually no other story you could say, after the story of Christ. Because in the fullness of the story of Christ, you have this idea that Christ does that, right? Christ goes into death. He doesn't just go into death, he actually dies. He dies. He goes into death. And then when he goes down there, he gathers everybody that's there and takes them out. And so we have this sentence we hear every Easter in the Orthodox Church, where it says, hell is empty. Hell has been emptied by Christ. Christ went down and brought all. I mean, it's mysterious. It's hard to kind of completely understand it, but it is this image that Christ defeated death itself, and that by going into the underworld when he came back out, that was it. And so it's like I said, it's the limit of the story. You go down into the underworld, you solve the underworld, and then you transform it into glory, and then that's it. There's no version which can go beyond, let's say, that version. In terms of categories."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":2484.23,"end":2522.19,"speaker":"Australian Podcast Host","text":"Yeah, it's a very obviously a story, an archetype that resonates with so many people, you know, and even something like. I didn't want to talk a little bit actually about Lord of the Rings, because one of my favorite movies, and it's obviously a movie that just exploded in popularity, and then I found that years later that, you know, the author is a devout Catholic, so it's got deep Christian symbology and I feel like a lot of people don't even notice. But then they become super religious about Lord of the Rings. Even atheists, which I find quite ironic. Why do you think Lord of the Rings connected with so many people? And like, what are the main kind of powerful symbolism behind that?"}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":2522.51,"end":2607.6,"speaker":"Jonathan Pageau","text":"Well, I think that, I mean, what Tolkien was able to do is to really reinstate, you could say, an ancient vision of reality, an ancient cosmic image. And because maybe because he did it in fiction, people didn't feel threatened by it, maybe something like that. And so because of that they were able to just be seduced by it, you could say. And so people know the most materialistic nerd scientific programmer guy will just fall in love with Lord of the Rings and he doesn't totally understand why. If you ask him about religion, he'll say, religion is stupid, it's superstitious, it's all these things. But nonetheless, he is able to be completely kind of engaged and subsumed by this story, which has this entire kind of hierarchy of beings that moves from. I mean, in the Lord of the Rings themselves doesn't necessarily talk about the first God, but it kind of moves down, at least in the middle Earth through the elves and then the humans and then the dwarves and then the orcs. And so you have this kind of movement from light and kind of immortality into this kind of monstrous darkness which is at the bottom of the world. And in the movie they capture it so well. Like, they just do it so well because they have the Urukai, like coming out of the earth, you know, and they're all like filled with. They're all scummy and dirty."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":2608,"end":2610.2,"speaker":"Australian Podcast Host","text":"And that music as well, so ominous."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":2610.2,"end":2698.54,"speaker":"Jonathan Pageau","text":"Exactly. It's very, it's super well done. And so because of that, people just feel like it's right. Even though it's completely silly for a materialist to think about elves and orcs and dwarves and all of these, all of these tropes because they're patterning themselves on just like in a traditional image of angels above and demons below and the men in the middle and the king and you know, these kind of prophet priestly figures like Gandalf that have more wisdom and are able to kind of manifest it to us. Like, you know, all of these tropes and also the fall with Gollum who becomes obsessed and then turns into. It comes closer to the Oryx, you could say, becomes demonized because he's obsessed with something which can kind of give him power. And so it's like, we totally recognize these tropes, but they're really, really just tropes. Right. It's really a religious story, but it's great because it's actually for people that are attending to it, they can say, well, you know, like, I can talk to you about the story that's in the Bible in a similar way, because it's way more than Lord of the Rings. Like, the story of the Bible has way more complexity and subtlety and has all these layers in it and all these patterns playing themselves out in different forms than Lord of the Rings. Because of that, it's actually harder sometimes because it's so big that it's hard to kind of fully get what's going on."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":2698.54,"end":2700.62,"speaker":"Australian Podcast Host","text":"It's overwhelming sometimes. I'll open script."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":2700.62,"end":2707.53,"speaker":"Jonathan Pageau","text":"I'm like, whoa, man, this is my reading. Just fall into some weird thing, especially."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":2707.53,"end":2709.49,"speaker":"Australian Podcast Host","text":"If you open the open one bite at a time."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":2709.89,"end":2718.21,"speaker":"Jonathan Pageau","text":"Yeah. So, like, some, like, weird law about not mixing, you know, a donkey and a cow while you're plowing your field. And what are all these stupid things?"}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":2718.77,"end":2767.25,"speaker":"Australian Podcast Host","text":"How do you reconcile this, man? You know, that's why I. I got the orthodox study Bible. So that really helped kind of fill in the gaps a little bit, you know, not pretending like I understand scripture. Of course not. I'm still an infant, but definitely saved me some time. But it's funny what you're saying about Lord of the Rings. You know, people get so. I would even go as far to say that. Religious about it. You know what I mean? Like, the nerds are, like, crazy about it. And it's funny how, like, we even use it in our language now. Like, if you go on an epic adventure, it's like, all right, we're going on a Lord of the Rings adventure, you know? Or if you. Instead of using the word hell, like, oh, man, I went down to Mordor last night and just got devoured by orcs. You know, it's just like, things like. It's just funny how we use it in our language. And it's like. It's metaphorical, but it also kind of reflects this very fundamental pattern of reality."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":2767.57,"end":2773.25,"speaker":"Jonathan Pageau","text":"You know, that we and the movies were really successful, I think, in terms of visuals they really captured."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":2773.57,"end":2775.73,"speaker":"Australian Podcast Host","text":"So it still holds up today."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":2775.73,"end":2789.9,"speaker":"Jonathan Pageau","text":"Holds up. I watched it just a few months ago, too, with my kids, because they hadn't seen it yet, and, yeah, just. It really does hold up in terms of that this. This kind of world that exists and these different characters, you know? Yeah, it does pretty well."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":2791.34,"end":2829.34,"speaker":"Australian Podcast Host","text":"I was reading A few months ago, I was actually reading your brother's book on the symbolism of Genesis, and I kind of wanted to unpack that just a little bit, maybe for those especially who aren't too well versed in these topics. But before getting into Genesis, I want to know what is the difference between this literal and symbolic interpretation of Scripture? Like, how should we even approach this thing? Because I get that question a few times, like, all the time. Take it literally or do you take it metaphorically? And it's always. We live in a very dialectic culture, you know, it's always has to be this or that. Is it one or is it zero? Like, what's your answer for this?"}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":2829.5,"end":3068.52,"speaker":"Jonathan Pageau","text":"Well, my answer is that I just cut through all that crap. Like, I don't like those. I don't like that opposition. I find that it's a. It's a dishonest opposition. Because if you remember the way that I talked about what symbolism is like, symbolism is the actual pattern by which you're able to attend to something. So it's so. So it's actually, it's so. It's the pattern of a story. It's the pattern of an image. It's the pattern because let's say you take the story of Christ, you know, Christ, I don't know, Christ at the wedding of Cana, you know, there's a million things that were happening in that event. There were indefinite amount of things happening at the same time in that place and notwithstanding around it, right? It's like there was, you know, there's crinkle in his robe. There was, you know, dirt on his sandals. There was. There's a million, like, billions and billions of things happening. And so in order for you to be able to attend to what was happening and to get meaning from it, you have to condense those facts into a narrative. You have to choose facts, and then you have to string them together in a way that I will recognize that this is a unit. And so even the literal meaning of a text is already symbolic. It's necessarily symbolic. Because why are we talking about this rather than that? Why am I mentioning these facts, and why am I putting them together in a narrative that I can recognize? And so there is no neutral reality. There is no neutral, meaningless reality that just there. And then on top of that, I add some metaphorical meaning. That's just total nonsense. There's already a reason why that story is there. There's a reason why the story is constructed the way it is, and that those facts have been chosen to be sequenced in that manner. And so the meaning is already there at the very first layer. Right. And so the best way to understand it, that what you would think as literal just means that you're very paying very close attention to what the text is saying. That's even what literal means. Literal means literature. It means what's written. That's what literal used to mean. It means what's written. And so you pay attention to what's written. You have what's written there, and then what's written there is structured in a way that is analogically related to other things. And then that's when what you would call the metaphorical meaning will appear to you, which is that as you look at the pattern of the story, you realize that it's structured in a way that is similar to your experience, that's similar to a society, that's similar to another story in scripture and then a story from mythology. And so then that's when you get what maybe what people call the metaphorical meaning, which is that I can take a story in scripture which is already symbolic, which is already patterned in a cosmic way, and then I can say, this is similar to your experience, and then I'll apply it to your experience. It's actually similar to the way Tolkien understood storytelling, because Tolkien hated metaphorical meaning. He said, my stories don't have metaphorical meanings, and people don't understand what he meant. And he said, they're not metaphorical. They're applicable. And so he said, you can apply my stories to things, but they don't. It's not like the orcs are the communists, and this aspect of the story is some other political thing. And this needs technology and this. It's like that's the wrong way of looking at the Bible, and it's the wrong way of reading Tolkien, too. It's mostly that the pattern of the story of Tolkien can be applied to your experience or applied to a situation, and then you can use it as a lens to see the world. And so that's the way in which scripture is metaphorical. But you won't find, like, the idea of literal. The way that people think of literal, that is a neutral telling of a story that is completely without meaning is absolute nonsense. It doesn't exist."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":3069,"end":3097.54,"speaker":"Australian Podcast Host","text":"Yeah, well, you know, like I said before, so I think we live in 2. A polarizing society and people very dialectic on both the material side of things and even the kind of spiritual absolutist. Yeah. Person who, you know, like the materialists will deny anything that's spiritual and ground their reality from everything below. And then the spiritualist will deny matter altogether. Yeah, and say everything is one. What does that even mean? What's. What's everything is one?"}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":3098.02,"end":3101.42,"speaker":"Jonathan Pageau","text":"I don't think people who say that and also people who talk about non."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":3101.42,"end":3107.68,"speaker":"Australian Podcast Host","text":"Duality, I used to say it too. And then I realized, looking back, I'm like, wait, that actually doesn't make any."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":3109.44,"end":3124.48,"speaker":"Jonathan Pageau","text":"Nobody dares believe in non duality. At least the way they think they do. They think they believe in non duality. And you're like, you believe in non duality? Really? Do you eat your feces? No, you don't eat your feces. So don't tell me you believe in non duality. What are you talking, what are you even talking about?"}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":3124.8,"end":3128.4,"speaker":"Australian Podcast Host","text":"Why does eating your crap relate to non duality?"}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":3128.64,"end":3249.79,"speaker":"Jonathan Pageau","text":"Well, because you don't eat your crap because you believe in duality. You believe that some things are outside and some things are inside and you don't mix them together. Right? That's because you believe in duality. You know, you live in a house, you wear clothes, you function in duality constantly and you experience duality and you live with duality and you don't. If you believe in absolute non duality in the way that especially people want, and especially in the way that relativizes everything, then. And there are like, there are. You can find traditions that are cannibals and you can find traditions that, that break all the taboos. But I'm not sure many people are willing to go there because it's actually very destructive. These kind of weird tantric traditions are very destructive to reality. Most people don't want to destroy reality. They're lying when they say they do because they actually exist. They exist. They have a life. They have all these things. And so the idea is that love is a better expression. Like love is a better way to understand it. Because love has, has the notion of ultimate non duality in the sense that we all participate in the life of the infinite God, but we're not. We don't. It doesn't mean that everything is relative and everything is illusion. It means that because God loves us, then we all exist at the level that we do. It's as if God's infinite love also kind of, let's say, moves out of himself into this multiplicity as he's gathering it back into himself. So it's not just like either everything is an illusion and we're all just Brahma. Like we're all just drops in this kind of vast Infinite consciousness. It's rather like a balance between unity and multiplicity. But that ultimately, for it to even exist, it has to participate in the oneness. But when people just say things like it's all one or whatever, like John Lennon and that kind of nonsense. Right. It's like we could all be as one. What are you. What are you talking about? It's just. It's just. It's just. Just posturing."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":3250.35,"end":3253.23,"speaker":"Australian Podcast Host","text":"Imagine there's no heaven. Yeah."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":3253.23,"end":3258.23,"speaker":"Jonathan Pageau","text":"Yeah, man. That's one of my least. Does that tick you off?"}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":3258.23,"end":3264.15,"speaker":"Australian Podcast Host","text":"Yeah. He has some good stuff, though. I, I, yeah, I don't really."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":3264.15,"end":3265.63,"speaker":"Jonathan Pageau","text":"I mean, I like to be. Everybody likes it."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":3265.63,"end":3267.83,"speaker":"Australian Podcast Host","text":"Nobody who doesn't like the Beatles. Yeah."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":3267.83,"end":3271.44,"speaker":"Jonathan Pageau","text":"Doesn't like the Beatles. But that song in particular. Yeah."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":3271.76,"end":3306.08,"speaker":"Australian Podcast Host","text":"But it's ironic because, like, you're talking about these people who claim to have this absolute experience and that God is absolute everything, and literally every single particle in the universe is God. Everything in physical reality is just an illusion. But then they're basing their experience of the absolute from a relativistic, subjective experience. So it's like this kind of. I don't know, it's just this weirdness because you're claiming absolute reality, but through a subjective lens anyway, so that you can't really escape that. That duality. You know what I mean?"}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":3306.08,"end":3323.17,"speaker":"Jonathan Pageau","text":"There's so much wrong. Like, if you really. If you really had an experience that. That there's only the Absolute, and all its manifestations are complete illusions. You know what you would do? You would shut up. Because why are you speaking? What are you saying?"}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":3323.73,"end":3324.29,"speaker":"Australian Podcast Host","text":"Yep."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":3324.77,"end":3412.59,"speaker":"Jonathan Pageau","text":"It's all. That's why. That's why you realize that there's just a nonsense to a lot of the, A lot of this type of posturing that you hear in kind of. In this kind of modern spiritualist, you know, reality. And it's not like you don't encounter texts like that in the traditions. Like there are. There are texts or there are traditions would do kind of try to point to the manner in which, let's say, compared to the infinite, like, that the infinite is something which is beyond duality. That the infinite does kind of empty itself and contain everything at the same time. And there's a language of aporia which people use to talk about that. And you see that even in religious traditions. But like I said, this also has to coexist with all the more buffered versions of that in which we also do participate, in which we do go to church, we kneel, we sing, we burn incense, we. We do all of these celebrations, you know, and we don't just have this one, this kind of esoteric vision of the infinite that destroys reality. Because that's the, that's the problem with a lot of this, with a lot of this stuff is that people just say mysterious things. They just say, you know, that kind of stuff. Like, you know, the universe is in a grain of sand. The grain of sand is the whole universe. And you're like, really? Is that really. You really think that? I don't think you do. I think you're just bullshitting me."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":3415.15,"end":3417.95,"speaker":"Australian Podcast Host","text":"Get those social media likes people like to like to hear that."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":3417.95,"end":3420.43,"speaker":"Jonathan Pageau","text":"Yeah, they like that kind of, that kind of fluffy stuff."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":3421.07,"end":3469.88,"speaker":"Australian Podcast Host","text":"Yeah. It's funny because like I started off doing new age stuff, but I feel like because I'm Australian, I have that kind of inherent down to earth casual sort of relationship with it. So I think it wasn't as new age hippie, but I think as I got more grounded over time, people weren't very happy with me. And it's really. Yeah, well, it's something that I, I question because I find it weird how in this kind of world there is no word for pre list, There is no word for false spiritual experience. And even that is very triggering because it's like, how dare you say that my experience was false? It felt so overwhelmingly real. And I've had many of those. And I'm not even saying that it's false or it's true, but the fact that there is no discernment between the two. How do you."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":3469.88,"end":3561.86,"speaker":"Jonathan Pageau","text":"No, but we don't have to question the experience people have. You know, it's mostly like you said, the discernment of that experience. And so, you know, in the orthodox tradition, I think they have the really good way of dealing with this, which is basically saying you should ignore all spiritual experiences. And I know people are going to go like what? Just ignore spiritual experiences? But that's what they say. And the reason why they say that is because they realize that if you really believe even what a new age will say, which is something like the purpose of reality is to be united with the one, to kind of be united with the transcendent reality, then if that's your purpose, then that's what you should be aiming towards. And then these spiritual experiences that you have, that's not it. Right. Just because you see an angel or you have some feeling, or you have some insight, even if the insight is true to a certain extent, that's not your goal. That's not where you're headed. So you have to be careful not to give too much attention to that because you're going to stay there and you're going to turn around in these kind of experiences. And so if you just ignore the experiences, then there's less of a danger of being, you could say, seduced by a demon, something which is off key because you're just, you're just kind of. And you will have the spiritual experiences, right? You will, but you just don't. You don't spend your time on them and you don't, you don't wallow in them. You could say you rather keep your eye on the ultimate goal, which is, you know, which is the union with the divide."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":3562.26,"end":3571.44,"speaker":"Australian Podcast Host","text":"Yeah, yeah. And even test your experience, you know, and see if it's holds up over time, if it still makes cohesive sense with the rest of your conception of."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":3571.44,"end":3607.14,"speaker":"Jonathan Pageau","text":"Yeah. And also the fruits, you know, the fruits. You'll know a tree by its fruits. That is that if you have these spiritual experiences, but you're a total jerk to everybody around you and, and it's like, and you continue to have all these sins in your, in your life and all these things that are your obsessions and your, you know, your idiosyncrasies, then that spiritual experience is pretty meaningless. Like it might have felt real and it probably was real. But it's not moving you towards freedom. It's not moving you towards something which is, which is more than just a. Kind of like an entertaining experience. You could say."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":3607.46,"end":3673.65,"speaker":"Australian Podcast Host","text":"Yeah, that's why integration is so important. Like the work that you do afterwards. It's like kind of reading a book and not contemplating, you know what I mean? It kind of just goes right through your head. Except that it's a little bit. It can be a bit more dangerous, obviously, going into these realms and let's say reading a book. Yeah. But I think, I think a lot of it has to do with like naivety, like, you know what I mean? Just overly trusting. I found that the people who are the most trusting, navigating through these spiritual realms without actually taking it seriously are like usually, yeah, just kind of young, white, hippie, Western people who've never really. I don't know, because I grew up, I've had some like kind of rough experiences and I've met people during my teenage years, like, who are very charismatic and they're very. Actually good looking and handsome and very, you know what I mean? Like they know how to talk to you and make you feel good. But then you find out later that they're actually a snake, but you can see them go out in the rest of the world. Like, people being like, oh, he's such a nice person. But then when you actually peek behind the curtain, you're like, yeah, I know that guy. Johnny's a dick. Don't trust him kind of thing. So there's a lot of."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":3673.65,"end":3737.3,"speaker":"Jonathan Pageau","text":"Yeah, yeah, that makes a lot of sense. I think there's also an aspect of materialism which is part of that, which is that because we've been so hounded and we're hounded in school and we're told that the world is just a bunch of phenomena that can be calculated and be measured. Is that when people have an insight that there's actually something more, then it's like whatever that more is, they're all excited about it and they just want to dive in and they want to experience. So it's like. Like you said it also the materialism leads to this lack of discernment as well, because it's like, oh, wow, there's this whole world that. That they lied to me about that actually does exist. And so it's like, open. The doors open. And it's like, oh, there's something. There's something. It's like this fast. You know, everybody's just excited about it. But it's like, no, no, wait a minute. No, no, that's a. That's a really bad thing. Like, that's a demon. And that's actually a projection of your passion. And that's a. It's like. And so. But at first, people don't. They don't have that capacity because they're used to be complete materialists. And so that's probably one of the problems that we have too. You know, It's."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":3737.3,"end":3756.34,"speaker":"Australian Podcast Host","text":"Yeah, I relate. I went through that too. And it would even. Maybe even some people listen to this right now might be triggered for when people even say, oh, it's a demon. Like, all right, crazy Christian fundamentalist. What do you even mean by that? I mean, if demons are playing the role of God anyway, why does it matter?"}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":3756.34,"end":3882.04,"speaker":"Jonathan Pageau","text":"Yeah, well, people recognize. Let's say. Let's say. Let's. Let's give a simple example. Let's say you're addicted to something. I don't know, you drink too much or, I don't know, whatever it is, you watch porn or like you have this addiction, and you know that it's an addiction because it. It. Because you can't control it, right? Because you try to and then you can't, and then it kind of Pulls you. And so that's a principality. That, that's, that's also a principality. That is, it's a pattern in reality that is cosmic. It's cosmic because you're not the only person with that addiction, dude. There are other people that also have that addiction. That's not an idiosyncrasy to you. It's not just relative to you. It's an actual real pattern that exists in the world in which you are participating. And that you are not only participating, but that by engaging in these bad habits and you behaviors, you are feeding it. You're sacrificing your time and your attention to this pattern and you're making it stronger in the world because you're like, you're a branch of it. You're a body for it. You're a tool for it to appear in the world. You don't need a Ghostbusters way of thinking. It doesn't have to be something like a woo woo science fiction thing. This is just cognitive reality of how things work. So that principality has a cosmic version of it. It has to. Because it doesn't just exist in you, it exists in all these other people. And so that's a demon. And you can encounter it and you can be possessed by it and you can be a tool for it to spread in the world. Like, have you ever met someone who has a bad habit and is obsessed with getting other people to participate in that very bad habit? Why they even know, they even know that it's bad for them. Like if you, if you pry them a little, you know that it's destructive. But nonetheless, they want to get that young kid to smoke and they're, they secretly want to get these teenagers to drink or to do whatever it is that, that they do. And so they're, they're, they're a tool of this demon in the world. It's a real thing."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":3882.28,"end":3910.49,"speaker":"Australian Podcast Host","text":"I'm just getting flashbacks because like you, it's so true. Like when people are so entrenched in their bad habit, let's say whatever, weed, drugs. And I've had these experiences where you're like, nah, I don't want anymore. It's like, just have one, man, just have one. Just have one. Like, they're like. And they even kind of physically transform into that kind of awkward demonic, like, just have one. Come on, man, just have one. And it's like, dude, no. And then as soon as you try to break away from their lifestyle, then they get like triggered and inflamed and like, what do you mean what, you."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":3910.49,"end":3911.41,"speaker":"Jonathan Pageau","text":"Think you're better than me?"}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":3911.49,"end":3915.77,"speaker":"Australian Podcast Host","text":"You know, it's like, whoa, whoa, whoa, man. I just didn't want to do drugs, that's all."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":3915.77,"end":4047.52,"speaker":"Jonathan Pageau","text":"Yeah, no, but you've got the. Exactly. You've understood the right pattern. And so these. So you can understand that. Let's say. Let's say. Think about this. So there are principalities in the world that are trying to get your attention, right? There are some that are light and there are some that are dark. And, you know, like, all the good things, you know, like loving your neighbor, helping your friends, you know, being good to your spouse, taking care of your children. There are all these light patterns in the world, and they are trying to kind of get your attention, and you want to give your attention to them. And then you have all these darker ones that are there as well. Now, you can understand these patterns as just abstract patterns in the world, but we are conscious beings, like, we are persons. And those patterns end up coagulating into something like persons as well. And so that's why we. In the same way that I encounter you, a pattern thing in front of me, right, you're just a pattern, but I encounter your face and your behavior as a pattern being. That is the same for these higher principalities, you know? And so. And so you can. Yeah, you can. Like I said, you can encounter them. They can manifest themselves to you in sometimes in a more immediate way, depending on people's sensibilities. But even if they don't, you can still understand that they're acting on you and you. You know, like. Let's say. I don't know if you've ever. You kind of free yourself from a bad habit. Let's say you have this bad thing that you're. That you're dealing with, and you're able to free yourself from it. And then when you're kind of free from it, you're even like. Like, who is that guy who was doing that? You almost don't recognize yourself. Like, you look at yourself and you're like, who's that guy that was doing this? Like, how is it that he was doing this? And you're like. You almost like, you don't even. There's something about it that you can't even barely. You can barely recognize it, of course, until the day that you're, like, in a weak spot. And then all of a sudden, you don't. Then again, you don't know what's going on. And it's like you wake up and you're like, back in the pattern. And you're thinking, how did I get back here? I thought I was out of this thing. Like, I thought I wasn't in there anymore. So how did I fall back into this thing?"}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":4047.6,"end":4048.96,"speaker":"Australian Podcast Host","text":"Back into Satan's den?"}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":4049.44,"end":4050.08,"speaker":"Jonathan Pageau","text":"Exactly."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":4050.08,"end":4054.81,"speaker":"Australian Podcast Host","text":"I said I'd never do this again. And you're waking up with, like, 10 hookers around you, drugs, you know, you're like."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":4054.89,"end":4119.43,"speaker":"Jonathan Pageau","text":"And you're like, what? Like, how did I get here? Exactly. And so, like. But these experiences are real. Like, everybody's had them. And so we can understand them just in terms of psychology, but they're more than that. And, you know, ancient cultures and Christian culture was able to recognize that this is not just idiosyncratic to you. These have objective reality, these patterns. And there are ways to deal with them religiously. And that something even like exorcism can actually have an effect on you in the same way that a coach. Why is it that a coach who speaks to you before a game would make you better at playing basketball? Well, why does it bother you that maybe someone with authority could. With spiritual authority could affect you in a way that would free you at least somewhat from that. From these different bad patterns that you have? So there are all these ways to kind of be able to look back and see again, these rituals, these practices that we see in. In. In ancient culture and just see how they. They're totally coherent. They're not at all. They're not strange the way that people told us they were."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":4119.83,"end":4165.15,"speaker":"Australian Podcast Host","text":"Yeah, yeah, definitely. And what I really appreciate about the trinitarian view of God is that, well, three. The number three is actually the number of reconciliation. Right. Transcends opposites and something I've been searching for so many years because no matter what worldview I came to, there was always this dialectical tension, as always. This. Or is that hermeticism actually did a pretty good job of explaining, like, transcending duality and dark and lightness and all this kind of stuff. And even in hermeticism, they completely prove that you can't be God because of this, this and this, you know, And I found that very interesting because in this world today, we. Well, either you don't believe in God or you believe you are God, which is mathematically the same thing, right?"}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":4165.55,"end":4197.91,"speaker":"Jonathan Pageau","text":"Yeah, exactly. No, that makes a lot of sense. And that's what you. You end up seeing. Well, we. It's more like. Yeah, we're. We think we're like little gods, you know, and then we kind of act that way. But usually if you observe someone who thinks that you realize that they're just. They're just a series of possessed. Like they're just possessed by all these things, you know, and you kind of see them pop up when you're looking, when you're watching someone, and all of a sudden you like, oh, here comes this thing. Like, here it comes. And you got to see it coming. It's easier to see it in other people, which is horrible."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":4198.79,"end":4199.71,"speaker":"Australian Podcast Host","text":"I know, right?"}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":4199.71,"end":4225.4,"speaker":"Jonathan Pageau","text":"But. But it's true. You can see it. You're with someone, and all of a sudden you can kind of see something coming out, you know, of them. Some. Some, like, obsession or some weird way of interacting with others. Like you, for example. Like, you watch a. You know, you have a friend, a woman friend, let's say. And then, you know, you're engaged, you're talking with her, and then you go to a party, and all of a sudden you see her, like, fall into, like, flirt mode. And you're like, what? All of a sudden she's like a whole other creature."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":4225.48,"end":4228.12,"speaker":"Australian Podcast Host","text":"And you moves and speaks exactly everything."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":4228.28,"end":4238.04,"speaker":"Jonathan Pageau","text":"About her, and you're like, what is this? Like, what's going on? This is. Like, this being is. Yeah, it's not the same being that I was dealing with, you know, an hour ago."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":4238.6,"end":4260.49,"speaker":"Australian Podcast Host","text":"Yeah. That's why I like to just constantly remind myself I'm just human. I'm always infallible, I'm always going to fall. And it's actually quite freeing to think that way versus you are your own God. And you can basically bend reality to your will. I'm sure you can for a little while. But I don't know, man. I feel like there's always a price for everything."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":4260.57,"end":4261.45,"speaker":"Jonathan Pageau","text":"It snaps back."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":4261.53,"end":4264.65,"speaker":"Australian Podcast Host","text":"Yeah, the bill snaps back because there's."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":4264.65,"end":4310.66,"speaker":"Jonathan Pageau","text":"98% of you that you're not aware of. So much of who you are, you're not aware of. Like, you know, in the orthodox tradition, people wonder why that is. But we were constantly confessing sins that we don't realize we've done. We're constantly saying, you know, wittingly or unwittingly, like, confessing the sins that I've done, you know, on purpose or on accident, because there are aspects of my being that I'm not even aware of. And so people who think that they're kind of like these little gods, they don't realize that they have these little imps that are writing them. And so they. They kind of act, and all of a sudden something happens like, you know, this. This aspect of themselves that they hadn't accounted for. You know, kind of springs forth and. Yeah, and then they get, they get sideswiped, you know, so."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":4310.9,"end":4331.93,"speaker":"Australian Podcast Host","text":"Yeah, that's why community is so important. You know, having. I say this all the time, but I think it's good, it's very important to have good friends that will call you out on your bs. Oh, yeah, you know, definitely. Being in your own lone world, having spiritual experiences and. Yes. Gaining so much knowledge, just inhaling all that wisdom and you just. Yes, I'm God."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":4332.81,"end":4333.77,"speaker":"Jonathan Pageau","text":"Yeah, exactly."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":4334.25,"end":4355.38,"speaker":"Australian Podcast Host","text":"And recreating that reality. Yeah, yeah, yeah, exactly. And can't do normal human to human interactions. Yeah, but I get it too. But I actually really wanted to dive into the, like the book, your brother's book. But just maybe for those who aren't aware what is heaven and Earth? Like, how do they."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":4355.38,"end":4455.31,"speaker":"Jonathan Pageau","text":"Okay, so yeah, so maybe my brother. I can just name for people. My brother is. His name is Matthieu Pageau. So he has a similar name. He wrote a book called the Language of Creation. And my brother and I, we both kind of developed the symbolic thinking together when we were in our 20s. And he, I would say he's kind of a. He's a far superior symbolist than I am in terms of his kind of grasp of patterns. And he's almost kind of mathematical in the way he sees things. And so the way to understand heaven and earth is almost in an Aristotelian way. It's like there's actuality and potential and there's. Or you could see it like that there's invisible spiritual patterns and then there is potential for them to manifest themselves in multiplicity. And so that's what heaven and earth is, it's light and darkness. Right. A good way to understand that. So light is that which reveals, and then darkness is that which contains the hidden bodies that will kind of sustain the light, you could say. Or it's also, let's say this idea of just invisible, these invisible spirit. Like spirit is just wind in terms of the words. And so you have this kind of invisible movement and then you have the waters below, let's say. And so that's what, that's what heaven and Earth is, at least in scripture. But not just in scripture. It's the same heaven and Earth that you find in Uranus or in Gaia or that you find in, you know, innate in the aboriginal cosmologies and all these different cosmologies, it's a pretty universal idea. Yin and yang, it's all that stuff."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":4455.95,"end":4462.99,"speaker":"Australian Podcast Host","text":"And how do you, how do you reconcile the kind of physical afterlife Place of heaven. Of what it says in the Bible."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":4463.23,"end":4465.71,"speaker":"Jonathan Pageau","text":"Yeah, well, the Bible doesn't say that you go to heaven."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":4465.87,"end":4466.75,"speaker":"Australian Podcast Host","text":"Oh, there you go."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":4468.11,"end":4472.59,"speaker":"Jonathan Pageau","text":"So there's a difference between paradise and heaven. Okay."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":4472.59,"end":4474.83,"speaker":"Australian Podcast Host","text":"Oh, man. I don't even think about those. Yeah, yeah."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":4474.83,"end":4479.63,"speaker":"Jonathan Pageau","text":"I just assumed. So paradise is the Garden of Eden."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":4480.35,"end":4480.75,"speaker":"Australian Podcast Host","text":"Right."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":4480.99,"end":4553.82,"speaker":"Jonathan Pageau","text":"And so paradise is the. Paradise is the place where the balance between heaven and earth exist. It's the place between. Where the patterns and their balance, manifestation finds its. Its totality. So Christians don't believe that we go to heaven. They shouldn't. Some people do. But we believe that we'll be resurrected, that, that, that, that. That humans will be resurrected and that they will become a perfect union between the invisible and the visible. You could say that's the way to kind of understand the way that Christians understand spirituality. Now, you do see beings that go to heaven in Scripture, for example, Elijah ascends into heaven, Christ ascends into heaven. And you see that, you know, St. Paul talks about, you know, it seems like he's talking about himself, saying that he went up to the third heaven. And so heaven is this the place where identities come from. And so it is possible for a being to, let's say, move into heaven. So a way to understand it. Like, let me give you an example of a being going into heaven. So saints, you could say, to a certain extent, ascend into heaven."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":4554.06,"end":4554.62,"speaker":"Australian Podcast Host","text":"Okay."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":4554.7,"end":4605.44,"speaker":"Jonathan Pageau","text":"Because then they become patrons of things. And so let's say a saint moves up into heaven. And then now we have churches named after the saints. People will ask this particular saint to intercede for them regarding certain things. Let's say Saint Mary of Egypt, for example. So Saint Mary of Egypt is the saint people pray to when they're having sexual temptations. And so she's become. She is, to a certain extent, in heaven because now she is becoming like an angel in the sense that she's like an invisible pattern by which we now congregate, that we come together and recognize, and that we also kind of ask for her to help us in this aspect of reality. I don't know if that. If that maybe helps to understand a little bit the difference."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":4605.68,"end":4607.29,"speaker":"Australian Podcast Host","text":"Yeah, yeah. Interesting."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":4607.29,"end":4607.57,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":4607.57,"end":4626.81,"speaker":"Australian Podcast Host","text":"Cause I never even thought about the distinction between, like, paradise and heaven. But then there's also the, like, what your brother talked about in the book about how heaven is abstract principles, basically, and where the purpose of humans are to inform meaning with matter and express matter through meaning, if I remember correctly."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":4627.05,"end":4654.62,"speaker":"Jonathan Pageau","text":"Yeah, exactly. Yeah. And so that's exactly it. So it's like a two Way street. It's like you have these. You have these principalities which are invisible and are patterns and then they find body in potential. But then it's also matter, let's say, kind of expressing those principalities. Like you need both of them to kind of happen together. Because the abstract principles are useless without expression."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":4655.1,"end":4662.49,"speaker":"Australian Podcast Host","text":"Yes. Can the soul live without a body for it to exist? That has to have some sort of."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":4663.05,"end":4779.18,"speaker":"Jonathan Pageau","text":"It has to have some attachment to body. At least kind of eschatologically, like, at least in the totality of things, it has to be attached to a body. Except for, of course, God does it. You could say everything is the body. Like God's body is the entire cosmos. That's maybe a way to understand it. But you know, even the angels are said to have subtle bodies, for example, that they don't have material bodies, but they have subtler bodies, you know. So a way to understand that is like a very simple way. Very simple. Simple way is that let's say you have an ideal and you're like, you know, I don't know, you're some guy who's 250 pounds. You know, you're watching TV and you decide that you're going to become, you know, the sprinting champion of the world. And then, and it's like, okay, and you may, I don't know, you're 50 years old. Was like that pattern that you're looking towards can't be embodied by you. It's actually not useful to you. That pattern is useless to you. That ideal, that abstract, let's say, direction that you are aiming towards, you can't embody it. And so you always have to find this relationship between, let's say, the principles or the ideals or the things we're aiming for and the capacity we have to embody them. You can't make a car out of grass. It's not the proper body for that pattern challenges. The body of a car has to be able to express the car. So matter has to express the principle. And then principle and the car. The idea of a car is useless unless you can drive it. Like, I mean, yeah, it's nice to think about the idea of a car, but unless you can drive it, it's not going to have much use to you. So you have to be able to find. Reality is about finding the place where these things join together."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":4780.62,"end":4795.9,"speaker":"Australian Podcast Host","text":"And how does Christ join together between the material and the spiritual? How does the kind of triune God reconcile all these paradoxes that we have compared to, let's say, the Idea of an impersonal God or pantheism, things like this."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":4796.74,"end":4875.5,"speaker":"Jonathan Pageau","text":"Well, the idea, like, if you think about it like a mountain, you think about it like a hierarchy. And that's part of. That's part of the way in which the world kind of lays itself out. When I talk about the pattern of attention, this idea of kind of moving, even the idea of moving towards the One, like, as you're moving towards the One, that's what you're doing. You're moving out of quantity, or let's say condensing quantity, so that you move up towards the One which is at the top, right? That's. That's where one is. If the world is like a mountain. So that point is something like ultimately, cosmically, it would be the fulcrum, like the place where heaven and earth meets in a kind of absolute way. And then all the other places that heaven and earth meet, like the place where the idea of the car and the actual car meet, that would be somehow a consequence or down the hill from this ultimate place where heaven and earth meet. And so the idea is that. That has different expressions in Scripture. The mountain of paradise, the mountain of Moses, where he goes up, receives the law. The tabernacle where you go into the holy of holies, and you move from the quantity of the people into the one priest that goes into the holy of holies and then sees the glory of God."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":4875.5,"end":4875.68,"speaker":"Australian Podcast Host","text":"So."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":4875.75,"end":4995.03,"speaker":"Jonathan Pageau","text":"So there are different versions of that in Scripture. And not just in scripture, but in every religious tradition. There's all these different versions of it, Ziggurats, all these different images. But then the idea that what Christians are trying to help people see is that ultimately is man. First of all, we are the place where meaning and the invisibles, we are like the laboratory where that happens. It's kind of through us that meaning appears in the world. And so that's the one thing that you realize in someone like Christ, is that ultimately man is that place where that happens. But then that man, let's say the man that has that position, will also manifest something. And what he'll manifest is that he'll actually fill up the whole hierarchy. He won't just be the top. He will actually contain the whole thing in himself. And so if you want to understand the story of Christ, that's what it is. That's why Christ has to die. That's why Christ is all these things. If you look at the way Christ is represented, he's all these opposites, actually. He's described as a farmer in the sense of Agriculturalists. He's. He's also a shepherd, he's the king, he's a priest, he's a workman, he's a slave, he's a criminal. He's every aspect of reality that is kind of packed into his story and then that kind of condensation of his story. And then it also, like he fills the world up. That's why he heals things. Like he's always healing disease. He's always kind of, let's say, at the top of the mountain and then healing that which is below, right? Going to the stranger. That's why he goes to prostitutes and publicans and all these marginal figures, because he's going to the edge. He's moving out and kind of gathering all things into himself."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":4995.03,"end":5003.47,"speaker":"Australian Podcast Host","text":"Yeah, I won't go sinners. He would drink with sinners, right? Going to these bars and just go to Satan's den, hang out with the homies, meet."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":5003.47,"end":5140.46,"speaker":"Jonathan Pageau","text":"And so if he was able to. He was able to do that without. Because he contains all of this in himself, he was able to do that without losing himself. You could say, like, let's say most of us, if I went into a bar with a bunch of prostitutes, then maybe I would lose myself there. Maybe I wouldn't be the one to bring the prostitute into the love of God, but I would rather find myself being dragged out into the den of hell. And so that's the difference between the way that Christ. So when Christ encountered the prostitute, she ends up washing his feet out of compunction for her sins and wants to transform her life. And so you see the same. He goes to a tax collector who are these horrible corrupt officials. And when he encounters them, they're like, I'm going to give my whole fortune to everybody and I'm going to help the poor and I'm going to. So it's like Christ transforms all these aspects of reality as he encounters them. So it's not just about hanging out with the people on the edge, but it's actually about transforming everything and bringing it into himself. So there's a million examples of how he does that. But ultimately the death of Christ and the resurrection ends up being the ultimate image of that, like I said, which is that he goes down to the bottom of reality. He goes all the way down into death, where everything is broken apart and everything is fragmented into its constitutive elements. And he then gathers all that up and then rises up, resurrects, and then ascends into heaven, right? But now by ascending into heaven, he's actually bringing everything into heaven with him. So it's an image of gathering all of multiplicity, all of death, all of this everything into God. And so that's the. That's what the incarnation is about. And it's something which ultimately happens in all eternity. Right. It happened at a moment in history, but it's actually happening. It's something which is a kind of a cosmic truth about how reality works. It's not just something that happened. It's actually revealing that, you know, you could say that reality is already and always reconciled in God and that Christ kind of manifested it at one point in the story. But this is actually how reality works."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":5142.06,"end":5156.22,"speaker":"Australian Podcast Host","text":"There's a lot of, you know, old mythical stories of people, you know, dying, resurrecting, and all that kind of stuff. But is Christ at least the first claimed person to have fulfilled that story in actual reality?"}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":5156.54,"end":5191.79,"speaker":"Jonathan Pageau","text":"I think so. I don't think I've seen another story where it's not just that because people say he resurrected, but Christians don't just believe he resurrected. We believe that he gathered all of death into himself and brought it up, you know, into the Father. And so it's like, like I said, there's no other story after that. Right. It's like that's it. Like he basically went into death and then gathered all of it, all of, all of multiplicity, all the way to the, to the constitutive elements and then brought it up into heaven. And so I don't think that. I don't if anybody has an idea of another story like that besides the story of Christ. I don't. I never heard it."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":5192.12,"end":5266.92,"speaker":"Australian Podcast Host","text":"Yeah, yeah. I would like to know if there is, because it's really. I find that symbolic story very interesting of, you know, Christ going down to Hades, defeating death and all that kind of stuff. Because even people all around the world, when they get to really hard situations. And I've heard this of like an old. One of my best friends who lives in Chile, they have crazy earthquakes. And there was a time where he was like a materialist atheist, socialist. But then when that earthquake came and he thought he was gonna die, he went on his knees and prayed for Jesus. And there's a lot of those kind of situations where people, they could be the most anti Christian person ever. But man, when you're in a crazy situation where you think you're gonna die, who else are you gonna call? I just find. I always found that part interesting. And I think that's kind of what made me curious to at least explore Christianity is that special place that Christ has because people don't call for Buddha if they're getting attacked by demons, you know, and it's just, it's interesting because people even. I actually want to talk to you about UFOs because I found even that to be the case where certain people have a UFO experience. They'll call out to Christ and then disappear."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":5266.92,"end":5271.2,"speaker":"Jonathan Pageau","text":"Oh, really? Yeah. I've never heard that story. I believe it. I'm not surprised. I think."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":5271.47,"end":5272.99,"speaker":"Australian Podcast Host","text":"I haven't tested it, but I've heard."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":5273.15,"end":5342.06,"speaker":"Jonathan Pageau","text":"Yeah, exactly. I mean, it seems pretty obvious by now that there's at least a relationship between UFOs and, and kind of these dark, these kind of dark principalities, you know, and you. And the relationship between UFOs and, and also psychedelics seems to be coming clearer and clearer, let's say, you know, and it also, it seems like it's also part of the story. Like, have you ever seen Alistair Crowley's his demon? Like the creature that supposedly dictated several of his books. His demon is called Elioth. It just looks like Elias. So A L I O T H and Elias looks just like a gray dude. He looks like a gray. And this is like. Yeah, And I think it's the first image of something like that that anybody had kind of ever seen. But, but he has this encounter, you know, and Crowley and the OTO were, were really hard. Like they were trying to break things open. Like they were trying to kind of just remove the seals, you know, And I think they probably were successful."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":5342.06,"end":5344.42,"speaker":"Australian Podcast Host","text":"And breaking the seat revelations, eh?"}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":5344.5,"end":5360.01,"speaker":"Jonathan Pageau","text":"Yeah. And part of the chaos of what we're seeing is maybe this kind of, this opening that they participated in. And now there's a lot of this stuff kind of flooding through. And so it's interesting that you say that, that, that you've read stories of people who pray and then the UFO experiences vanishes. I'm not surprised."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":5360.09,"end":5378.48,"speaker":"Australian Podcast Host","text":"Yeah, same with sleep paralysis or bad psychedelic trips, things like this. And again, these are people who, you can't even say it's, oh, it's just placebo. Oh, it's just bias. Because it's a lot of times it's coming from people who, if anything, they're anti Christian. So if any, you know what I mean? Like, it makes no sense for it."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":5378.48,"end":5437.74,"speaker":"Jonathan Pageau","text":"To have, but it's just funny. Like people imagine that, imagine what you said. And like people stop thinking. It's like, they say it's just placebo, it's just bias. It's like, okay, well then why don't you call to Spider man and see what happens and see if it's just placebo. It's like, that's not how reality works. It's not true. Maybe there's something placebo about it, but placebo is not arbitrary, even if that's part of it. It's like, you can't just call to anything and then it'll work. It's like, no, it has to be something that you believe in, and that's something which is powerful enough to kind of be there in your story, even though you deny it consciously. And so the idea of just saying it's like, oh, it's arbitrary. It's prejudice. Like, okay, dude, you don't understand how these things actually work. It's like, no, they're not. The reason why they would even work. Even using the placebo argument is not arbitrary, right?"}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":5437.98,"end":5442.3,"speaker":"Australian Podcast Host","text":"Oh, yeah, 100%. Even the word just like, oh, it's just."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":5442.54,"end":5466.93,"speaker":"Jonathan Pageau","text":"Yeah, I know that word every time that. It's just that I'm like, okay, it's just a projection. I've caught you. It's not possible. Think of the placebo effect. Think of the placebo effect. If you get a placebo from your doctor, right, it'll probably work. But if, like, a homeless guy walks up to you on the street and gives you a pill and says, it's gonna cure your disease, man, it's not gonna work."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":5467.17,"end":5467.97,"speaker":"Australian Podcast Host","text":"All right, mate."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":5467.97,"end":5486.02,"speaker":"Jonathan Pageau","text":"Yeah, it's not gonna work. And so it's like, placebo is not arbitrary. It has a structure and it has a way to manifest itself and we can understand it, and it's actually part of reality. It's not. Not something that you can just put to the side and say, this is not part of reality. It is because it works. Like, it actually works. Works."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":5486.02,"end":5499.74,"speaker":"Australian Podcast Host","text":"So what do you think of these? Have you got delved deep into, like, these psychedelic entities that people go into? Like, let's say. Have you heard of the DMT jesters?"}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":5500.3,"end":5501.66,"speaker":"Jonathan Pageau","text":"No. I know a little bit of the."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":5501.66,"end":5502.78,"speaker":"Australian Podcast Host","text":"Machine elves or these."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":5502.78,"end":5504.94,"speaker":"Jonathan Pageau","text":"Yeah, I know about the machine elves a little more."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":5505.1,"end":5507.82,"speaker":"Australian Podcast Host","text":"Yeah. What are your thoughts on that? Like, what is that?"}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":5507.82,"end":5520.76,"speaker":"Jonathan Pageau","text":"I find the. I find the machine elf, let's say, concept or the machine elf experience. Very. It's fascinating because. Do you know, like, I do know about the traditions of the Book of Enoch? You know a little bit about the Book of Enoch?"}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":5521.08,"end":5524.52,"speaker":"Australian Podcast Host","text":"I know a little bit about it. I haven't read it completely, but yeah."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":5525,"end":5539,"speaker":"Jonathan Pageau","text":"So in the traditions of. In the Book of Enoch. The Book of Enoch is a book that was probably written in the Second Temple period. And so it's like, let's say a little bit before Christ came, but refers to tradition before the Flood."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":5539.4,"end":5542.36,"speaker":"Australian Podcast Host","text":"It isn't non canonical or is it canonical?"}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":5542.36,"end":5757.96,"speaker":"Jonathan Pageau","text":"So the story is that. No, I mean it's canonical in some. It's canonical in the Ethiopian Church, for example, and it remained kind of part of the. It's quoted in scripture. St. Paul quotes the Book of Enoch several times. So it's not fully canonical, but it's kind of part of the lore, let's say Christian lore. So in the Book of Enoch, you have the descendants of Cain. They're the ones who develop technology. By the way, in Scripture, you see that, that the descendants of Cain are the line which develop all technology, so music and then the arts and then cities and then metallurgy and weapons. All of this is developed by Cain. But in the Book of Enoch, it expands on the idea that it says the sons of God went into the daughters of men, and then from that spawn giants. So in the Book of Enoch, the idea is that these demons, these spiritual entities come and they teach technical skills to humans. They teach them how to make metal. They teach them how to make weapons. They also teach them magical skills like necromancy. And they even teach them, interestingly enough, like they teach women how to wear makeup, which is very interesting because it has to do with seduction and it also has to do with kind of this using. Using a covering to enhance something, which is what technology is. Technology is basically makeup. You could understand it as. It's like, it's. It's like adding something to you in order to give you more power. Right? You can understand, because once you understand what makeup is, it can actually help you kind of get it what technology does. So, so these demons appear to the. Or it doesn't say how, but they mix with humans somehow and then they teach these skills of making technology and weapons and makeup and all these things. And that is. And the Chimera is important too. So they teach them how to make hybrids, like different kind of hybrids, human animal hybrids and different animal hybrids. And that kind of the excess of that is what leads to the Flood. It's like basically three things just break down and then here comes the flood to kind of recapture the world. And so the machine elves are super interesting because it just seems like it's playing out. It's playing out the story of Enoch and slaying out a book that was written thousands of years ago where people encounter these beings and these beings teach them or show them technological or technical patterns that some, I guess some people are able to kind of apply in the world. And so it's like the idea that our technology comes from aliens is actually. Even though the way that they do it on the History Channel is completely stupid and ridiculous. The trope of thinking that our technology comes from aliens is not completely stupid. If we understand aliens as just these kind of beings that are able to kind of manifest patterns to people without discernment, and then we kind of move into these kind of technological. So I think that it's very fascinating because it seems to be playing along with what's going on. And AI is definitely part of that. The idea of these kind of embodied intelligences, mechanically embodied intelligences, all of this stuff is moving towards something like what we saw in. In the pre flood narratives, you know, seems like it."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":5758.04,"end":5811.01,"speaker":"Australian Podcast Host","text":"And I've had experience with these kind of. I don't know if they're machine elves, but basically it was all of evil and darkness composed into one being. But it had all these mechanical parts, like this kind of soulless, mechanistic, just. I don't know, like no free will, determinism, but evil. Yeah, it's really. It's really bizarre. But when. Because when I've gone through these experiences, I noticed then that these principalities, it's like they're more fundamental than us. You know what I mean? It's like a layer before creation or something like that. I don't know. I might be crazy even saying this, but it really does feel so overwhelmingly real that I understand why people kind of get into it. But there's also, of course, the dark side of it. And I should be grateful that I tapped into the dark side early on and not, you know what I mean, not tagged along until later in life. So."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":5811.09,"end":5815.01,"speaker":"Jonathan Pageau","text":"Yeah. That you. That you kind of saw it and said, okay, well, I need to think about this."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":5815.41,"end":5851.33,"speaker":"Australian Podcast Host","text":"Yeah, it's like basically hell scared. Scared me back into heaven sort of thing. It's like, oh, okay, I want to go like whatever the opposite direction is to that. I'm going that way and just live normal life, you know, just human, human life day to day. Yeah, I think. I think that's very important to be grounded, you know, because I think when you get too lost in these spiritual dimensions without having the grounding, it can be more dangerous. You know, any spiritual practice, I feel. You know, I feel like even Christianity could be dangerous if you don't have that grounding. And I've seen it with people."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":5851.33,"end":5851.85,"speaker":"Jonathan Pageau","text":"You're right."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":5852.01,"end":5860.11,"speaker":"Australian Podcast Host","text":"With people who get too inflamed with pride or something like that, and they become self righteous. Like that typical. You know, I don't say that's a."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":5860.11,"end":5879.03,"speaker":"Jonathan Pageau","text":"Yeah, but even the mystical practice of the church, like in the Orthodox church, we have a mystical practice which is called hesychasm or the Jesus prayer. And it's a. And it's a prayer which is repeated and then it's also coupled with a breathing, with a kind of, with a breathing which rhythms the prayer, you know."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":5879.67,"end":5888.67,"speaker":"Australian Podcast Host","text":"Okay, how do you do this? Is this just a quick thing? Is it like you breathe in, you say half the prayer and then you breathe out? Yeah, yeah. Okay, yeah."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":5888.83,"end":5984.64,"speaker":"Jonathan Pageau","text":"And so this is like, this is really kind of the basic structure of orthodox mysticism. And everybody does a Jesus prayer. Like everybody prays that. But there is an idea that some people will pray the Jesus prayer in a manner that they become. Or the prayer enters into their heart and that they actually kind of. The prayer takes over their being and that they, they kind of become just the prayer. And so there's even this idea that at some point your heartbeat rhythms with the prayer and that your heartbeat becomes the prayer. And so the fathers will say, don't do that. Like, if you don't have a guide, like if you don't have someone to guide you, like, do not do this, you will become insane. Like, it will lead you to insanity if you go in this direction. If you try to kind of do, to pray without ceasing, like to just kind of. Because this is the idea that they try to do is they try to. The monks basically try to become constant prayer where their entire being is kind of caught up in this, in this prayer. And it leads to illumination, it leads to theosis, to basically being united with God. But they tell you, like, don't do it without, without a guide because it's super dangerous. And it, and it would make you drive you crazy. And monks go crazy. You go to, you go to these, these monasteries, you know, let's say on Monathos, and you'll just meet crazy monks, monks who lost their mind because they just weren't, they became prideful or they just weren't being, they didn't, they didn't accept to be guided or they just did their own thing and then they just."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":5985.52,"end":6028.07,"speaker":"Australian Podcast Host","text":"Well, it's funny how that, that attitude is so universal because even in the psychedelic world, let's say with Ayahuasca, a lot of people like, no, don't you dare do this without a shaman. And then even to go beyond that it's like you got to be very careful which shaman you choose, because again, you're. Even in these new age practices, most reasonable people are aware that you are opening doors, you know what I mean? And you have to be very careful with what slips through. And even if something seems good, it might not be good. It's hard to know, like, how can you explore these realms smartly and safely? Or is it one of those. Best not to mess with that kind of stuff? Or it just depends on who you are as a person."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":6028.39,"end":6144.86,"speaker":"Jonathan Pageau","text":"I mean, I've never done psychedelics. It's like I can't speak from experience. I feel like, let's see, from a more traditional perspective, it's definitely more on the dangerous side in the sense that the idea of a real spiritual practice is to be transformed, right? Is to actually rise up in the hierarchy of being is like through humility, not through pride, but like through humility and practice and spiritual discipline that you actually become more like the angels, become more like God. And so it's not so much to just have these experiences of this world, but rather to kind of participate and rise up in the. The hierarchy of being. You would say you see this image called the Ascent of the Divine Ladder, where you see monks going up a ladder and there's Christ above. Christ is the goal, right? You're. We're actually aiming towards Christ to become like him, to be united with him. And then there are angels that are kind of helping along the way, but then there are also demons. You see it in the image like these demons are like pulling the monks down and they fall into like the mouth of Hades at the bottom of the image. And so their idea is not to either experience the angels or experience the demons, right? Their idea is to aim towards the transcendent, aim towards Christ, aim towards the place where heaven and earth meet. And then you will encounter them along the way. But that's not the point. And so the problem, I think, with a lot of the psychedelic stuff is that people can rip open the veil and then move into this world and they have these experiences, but they're not better people. They're not freer from their, from their own demons, they're not freer from their own passions. And so, yeah, so they're more in danger than they would be if they, if they would just kind of stay in the normal world. And by saying that. But look, I'd be honest with you. I know several people that, that, that did psychedelics and then converted and then just became Christian."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":6146.22,"end":6176.37,"speaker":"Australian Podcast Host","text":"I've heard that that's. That's the thing that throws a wretch in the whole thinking about this because I don't. I don't have a. Necessarily a strong opinion of psychedelics of this or that because they're so mysterious and they have so many different outcomes for different people. However, I would say that at the state that humanity is right now, it probably would be more dangerous than it is good. But I don't know if that's necessarily the psychedelics themselves, but just where humans are, because we're very prideful and very naive and can fall into these traps."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":6176.37,"end":6245.3,"speaker":"Jonathan Pageau","text":"You know, and also because we're materialists. And so I can see it, like, I can totally see it because it's like, for all my love of Jordan Peterson, like, I love Jordan Peterson, you know, But I think that this is one of the dangers that he's falling into. It's because it's easy to. You can analyze it, right? It's a mushroom. It's like, here's the chemical formula, right? Here's the thing, it's right there. Just take it, you eat it, and there you go. So it's like, it's super easy. So the most materialistic, the most scientific person can say, like, this is like, it's. It's this, this works. It's a pill. You take it, you have this experience. You can analyze it, you can calculate it, you can. You can look at the person's brain, you can see their waves, whatever going on. And so. And so it seems like a kind of materialist shortcut, you know, to the spiritual life. But I think that that's also why. Why it's a problem. I think that that's why it's a problem is because, you know, look at, look at, even like at the way that. I don't know if you saw that discussion you had with the guy who wrote this. This. What is it like the. I forget what it is. Like something about how mushrooms are at the source of our religions or whatever. Some book about that."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":6245.3,"end":6250.1,"speaker":"Australian Podcast Host","text":"Ah, yes, I actually had him on. Yeah, yeah. The immortality came. Is that right?"}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":6250.18,"end":6287.48,"speaker":"Jonathan Pageau","text":"I think that's. Maybe that's what it is. I don't know. But look at, look at what they're doing. It's like, so. So think of the Mysteries of Eleusis, for example, right? So you have this entire ritual that lasts several days and is extremely engaging and is like sworn to secrecy. You're not allowed to talk about it. There's a whole thing around the entire mystery of elusive. And then Maybe at some point in this thing where they come, let's say, to the, to the edge of it, then there's a substance involved in the experience. But now the materialist wants to just say all that ritual stuff. It's all bullshit. It's the, it's the mushroom."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":6287.72,"end":6289.24,"speaker":"Australian Podcast Host","text":"Yeah, it's the mushroom dude."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":6291,"end":6332.1,"speaker":"Jonathan Pageau","text":"Formula that I can analyze and that I can show you and that I can measure and I can. And so, and so it's, it's just such a materialist way of looking at reality that even if maybe in some, in some cultures psychedelics were part of the process of transformation of the person, the idea that they were the central part of it is complete nonsense. It's complete nonsense and it's super dangerous. And it's like a materialist way of approaching these ancient myths, these stories, these patterns of transformation. Anyway, so I tend to really be very cynical about this stuff."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":6333.06,"end":6358.1,"speaker":"Australian Podcast Host","text":"Well, even Carl Jung was cynical about it. It's funny because even myself, a lot of psychedelic people quote Carl Jung like, he's our lord and savior. But even he's like, yeah, beware of unearned wisdom, don't do psychedelics. Pretty much. He didn't say those exact words. He did say beware of unearned wisdom, but he was very. But then again, man, he went through like a 10 year psychosis. So he's like, yeah, I don't need to open any more doors. I'm good."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":6360.1,"end":6414.85,"speaker":"Jonathan Pageau","text":"Yeah, definitely, definitely. Yeah. He also had, I think that problem where he wasn't, he didn't accept to be guided, you know, and, and there are, there are stories about Jung like, you know, even, even, like from, even, not even from a, not a Christian perspective. You know, there are stories of him, you know, going to India, but all of it then refusing to, even to be guided by the supposed masters that he encountered there and that he wouldn't even meet with them. Like he was just, he's a scientist. Like, like in the end he ended up. And I think that he didn't. Yeah, he just, he was never like, he, I don't think he ever ended up being either a practicing Christian or an initiate of anything. He was just someone from the outside who was trying to explain these things and then got cracked open, you know, just got cracked open is the only way to see it, man."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":6414.85,"end":6446.57,"speaker":"Australian Podcast Host","text":"Could you imagine that, like going to bed, sleeping with a revolver on the Appeal killer and having these attacks by these entities every day? I'm surprised he didn't like, end up killing himself. Man. That's like, yeah, that sounds like hell to me. But I'm glad that he got some knowledge out of it and came out the other side. Thank God. Yeah. Well, it is what it is. Yeah. Jonathan, I would love to just finish this off because I know that you make a lot of videos about like, symbolism unpacking movies and stuff. Do you ever do video games?"}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":6447.29,"end":6471.9,"speaker":"Jonathan Pageau","text":"It's funny because everybody's asking me to do video games forever. And you should. And then I did. I did a video. It was probably because it's also. Maybe I didn't approach it the proper way. I thought, okay, so what I should talk about an early video game to show the pattern and kind of how it was there from the beginning. Let's say even the more complicated games like super had. Yeah. So actually, so I did it on Donkey Kong."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":6471.9,"end":6475.26,"speaker":"Australian Podcast Host","text":"Cause I was moving towards Super Mario, like the old school Donkey Kong."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":6475.26,"end":6517.38,"speaker":"Jonathan Pageau","text":"I did it a video on a video on Donkey Kong and it just totally bombed. Like nobody watched it. And then it discouraged me because I wanted to do it on Donkey Kong and then do it on Super Mario as a kind of a second step to show how it's all there in Donkey Kong. But then it kind of unfurls into Mario and then let's say Mario becomes like the template for. For basically all the games we have now. But yeah, but then I just never made the second video because it was a lot of effort to kind of put it together and to write it and to edit it and then. So you can find it the Donkey Kong video, if you want. I think it was pretty good. Like, I was happy with it, but maybe I will, like, I might do it. Maybe."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":6517.62,"end":6535.51,"speaker":"Australian Podcast Host","text":"Maybe you can even do like something that I would enjoy anyways, seeing you do like a reaction video to one of the more popular games like Skyrim or something like these epic kind of fantasy worlds that people are completely obsessed with that have really cool stories and symbolism."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":6535.51,"end":6589.81,"speaker":"Jonathan Pageau","text":"Yeah, well, I think that, like Elder Scrolls, I think they definitely do a good job at kind of containing a world. Like they present a world that is. That is quite. Is both very diverse, but also coherent enough that it really fits in that. It fits a little bit in that kind of Tolkien. Tolkien is the one who set. By the way, Tolkien is the one who set the map for all of these things, especially for the fantasy video games or the world building video game. It's really Tolkien. You kind of set the standard for that. But for sure, in Elder Scrolls they do a good job at, let's say, embodying it. So, yeah, I Think so. But it's just hard because let's say something like Skyrim, it's like, it's so big about. It's huge, huge game. Even the story itself is really big. And so I think it would. I think it'd be difficult to do like a kind of break it down."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":6589.81,"end":6595.41,"speaker":"Australian Podcast Host","text":"Maybe like breaking down, like literally one mission of a certain story. You know what I mean?"}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":6595.41,"end":6597.13,"speaker":"Jonathan Pageau","text":"Yeah. And maybe just choosing one and then."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":6598.89,"end":6606.74,"speaker":"Australian Podcast Host","text":"I think it could explode. Skyrim is very popular. You're very good at unpacking these kinds of. Kind of myths. So just an idea. You don't have to do anything. But it's something."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":6606.74,"end":6623.3,"speaker":"Jonathan Pageau","text":"No, no, no, no, no, no. But it's not. It's something that. It's been. Obviously people have been asking me to do video games for. For a while. For a long time. And so who knows? Maybe. I don't know. It's possible. It's also. It's like there are so many things to do too. So it's hard to. It's hard to sometimes decide what I'm going to do."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":6623.3,"end":6639.12,"speaker":"Australian Podcast Host","text":"Yeah, I know you want to do all these things at once. Why do people play? Something that I've been fascinated is why do people are obsessed with horror games and stuff like that? Like, why do people get out of the way to pay money to scare the crap out of themselves?"}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":6639.52,"end":6642.28,"speaker":"Jonathan Pageau","text":"So why do people. Why do people like horror?"}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":6642.28,"end":6646.48,"speaker":"Australian Podcast Host","text":"Yeah, just in horror in general. It's something that's been very fascinating for me."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":6646.88,"end":6674.93,"speaker":"Jonathan Pageau","text":"Okay. Well, horror, like horror is. How can I say this? Horror is a reality. There's a relationship, there's a little bit of relationship between something like sacred space and horror in the sense that horror is a category. It's always a category which transcends the rational. Right. Horror is like the irrational, which just kind of smashes against the world, like."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":6674.93,"end":6677.13,"speaker":"Australian Podcast Host","text":"That primal adrenaline sort of thing."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":6677.45,"end":6829.44,"speaker":"Jonathan Pageau","text":"Yeah. But also it's like something which is. Is unreasonable. Right. It doesn't make sense. Right. Even the idea of a mass killer doesn't make sense. And then the more imagistic versions of that, I don't know, like Evil Dead or whatever, like these kind of encounter with these really, really kind of irrational forces that are extremely cruel and that are extremely violent and that are basically will just destroy the world. It's something that. It's something that is. That can make us peek into the idea that there's something beyond the rational. Right. It's called. It's kind of like in the. It's kind of like in the wrong direction. You could say, but not totally. Because if you look at Christianity, horror is part of the sacred, right? The cross is in part. It's not just horror, but it's, it is horror. Horror is in the cross. There's other things going on in the cross, but horror is there. And so I think the difficulty with horror is that it's just in one direction. Let's say it's more about kind of encountering the monsters on the edge of the world. You could say it's something like that. Yeah. But it's not completely. It's understandable because if you read even the idea of there's a relationship between awe and terror, okay. They're just in the experience. So think about like, I mean you can imagine it like just in a primordial experience of kind of encountering a giant warrior, right? And this giant warrior like steps out in front of you and you're like, I know you're 11 year old boy, this like 6 foot 5 massive warrior with a helmet, like just steps out in front of you. It's like you're going to be a lot of things, you're going to feel a lot of things when that happens. You're going to feel scared, impressed, overwhelmed, like let's say frozen in front of this, like this, this revelation, let's say. And so you get. So that's when you can kind of understand this idea of the relationship between, let's say, the terror of encountering God or encountering an angel. You know, like the joke on the Internet. Right, right. The biblically accurate angels. Like there's something about that that is that the angel says. When the angel says be not afraid. The reason why he's saying be not afraid is because he's scary as hell."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":6831.2,"end":6834.88,"speaker":"Australian Podcast Host","text":"Yeah, yeah, don't be afraid. It's like, whoa."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":6835.6,"end":6861.61,"speaker":"Jonathan Pageau","text":"The angel appearing to you is something like a breaking open of normal space and this like this like rushing in of this trans. Rational space. And so there is an aspect of it which is, which is going to be kind of terrifying. And so it's normal, I think. So that's why you hear the angels say that because it's like they're also trying to signal to you which, which side of this, let's say which side of this encounter that you're dealing with, you know?"}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":6861.77,"end":6867.09,"speaker":"Australian Podcast Host","text":"Oh, that's so true, man. Those biblically accurate angels are like, whoa."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":6867.09,"end":6899.86,"speaker":"Jonathan Pageau","text":"That's like, yeah, they're not really beautiful accurate. They're going on purpose to like make them really wild. But like in, in the, in the orthodox version of angels. You kind of. You see something of that, Right. You do have the image of the cherub with the four heads and then the. These. These wings with eyes on them. So these are iconographic. Like, there are iconographic versions of these, of these beings, or like the wheels with wings and eyes and stuff. But some of the memes, like, they just go on purpose to make them look almost like. Yeah, it's like there's a little bit of sensationalism, let's say, in that."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":6900.18,"end":6910.5,"speaker":"Australian Podcast Host","text":"For sure, for sure. Yeah. Anyways, Jonathan, I won't leave you any longer. I really appreciate you coming on the podcast. We had some very interesting discussions."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":6910.74,"end":6914.5,"speaker":"Jonathan Pageau","text":"It was good to meet you and I wish you all the best on your. On your journey, for sure."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":6914.66,"end":6925.83,"speaker":"Australian Podcast Host","text":"Yeah. Thank you. Thank you. It's definitely been an interesting one. It's a long, very long journey because it's not like a sensationalized one where you have, like, experience. You're like, oh, yep, I'm a Christian. Some people do have those experiences."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":6925.83,"end":6926.15,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":6926.15,"end":6931.91,"speaker":"Australian Podcast Host","text":"But for me, it's been a very long process of elimination kind of journey. I guess. I get it."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":6931.91,"end":6940.87,"speaker":"Jonathan Pageau","text":"Yeah. Well, yeah. So I wish you all the best on that. And also in your kind of crazy world of lockdowns, you know, we can wish for the best."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":6941.03,"end":6943.11,"speaker":"Australian Podcast Host","text":"Save this, Jonathan. Please get me out of here."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":6943.35,"end":6944.79,"speaker":"Jonathan Pageau","text":"I wish I wanted to leave."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":6944.87,"end":6945.91,"speaker":"Australian Podcast Host","text":"I really want to leave."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":6946.39,"end":6958.52,"speaker":"Jonathan Pageau","text":"Yeah, I feel the same here. So it's not as bad as you, but I kind of. I'd like. I have all these friends saying, you know, come to Texas, come to Florida, come to Tennessee or whatever. I wish states, but."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":6958.52,"end":6975.28,"speaker":"Australian Podcast Host","text":"Yeah, well, all we can do is prepare for the worst and hope for the best. I guess that's right. Yeah, exactly. But, yeah. Anyways, thanks again for coming on the. On the podcast and yeah, hope to catch up with you sometime in the future. All right, Jonathan, all the best. God bless. Bye."}
{"episode_id":"SW - #193 - 2021-11-03 - Discerning the Spiritual World - UFOs, Machine Elves, Placebo, Prelest & Paradise","start":6976.16,"end":7041.17,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, link leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pajot Videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
