{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":1.2,"end":5.92,"speaker":"Jonathan Pageau","text":"Hello, everyone. I'd like to welcome you to episode 11 of the Symbolic World podcast."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":7.12,"end":8.72,"speaker":"Jonathan Pageau","text":"On this episode, I'm going to play."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":8.72,"end":48.1,"speaker":"Announcer","text":"For you a video that I made in response to a comment on YouTube about science and religion. And in this video, I try to show the inevitability of hierarchy and how a lot of the imagery we use in religion, such as heaven, such as the mountain, is really a language of hierarchy. And so when we see it that way, we can understand what exactly we are referring to when we talk about, let's say, a God in heaven. And so, yeah, hope you enjoy."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":55.93,"end":136.9,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the Symbolic world. Okay, so I should definitely be doing all the other things I need to do, but this is way too much fun. I. On the video that I did recently on the symbolic versus literal interpretation of the Bible, I got a very good and concise comment about atheism and why many people have abandoned religion. I have some sympathy for atheism in many ways, mostly because many religious people have done a dreadful job at explaining things and. And have alienated generations of smart people. And also because atheists often become that way through curiosity and a desire to have an integrated worldview. I mean, when you face literalist religious types, there's a kind of blind unconsciousness that is truly nauseating. I once confronted a literalist type, and when I asked him, when it says in the Bible that Christ was taken."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":136.9,"end":139.5,"speaker":"Jonathan Pageau","text":"Up into heaven, where exactly did he go?"}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":140.46,"end":142.3,"speaker":"Jonathan Pageau","text":"Into the atmosphere, to the moon."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":143.1,"end":149.98,"speaker":"Jonathan Pageau","text":"And that person had actually never thought about that, had never asked themselves that question."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":150.78,"end":153.26,"speaker":"Jonathan Pageau","text":"So, yeah, sympathy for atheists."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":153.98,"end":155.34,"speaker":"Jonathan Pageau","text":"So I'm going to read the comment."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":155.74,"end":245.56,"speaker":"Jonathan Pageau","text":"Which is by a user named Amber Trance, and I'm going to try to answer as best as possible I can. I am an atheist because my pure and honest desire to understand the universe led me to answers from biology, physics, and other scientific fields. These answers are more sublime and precious than anything I know. I believe religions and symbolism can confer meaning in one's personal, subjective life, because I've been on that path before. You could say that that is enough, because all we have in our existence is our subjective point of view. But I believe it's a noble act to care less about that and to desire to know what happens in the universe outside your own personal life. Then how could anyone judge you for being an atheist when science, as imperfect as it is, brought you knowledge about distant stars and galaxies, the small world of atoms, and much more? Mysticism and religion did not enlighten us about matters above subjective and social Aspects. Many other things can replace religion, mysticism and symbolism in creating a stable and moral society. The value that science brought to humanity on the other side is irreplaceable. I will cease being an atheist and become spiritual or whatever, when all these pretty post hoc connections and symbols will make a difference in allowing me to understand the nature of the universe outside my insignificant, tiny life."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":246.36,"end":253.08,"speaker":"Jonathan Pageau","text":"Alright, that's actually a pretty, that, that's actually pretty good. And I, and I hope I chose a comment that most atheists would find."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":253.08,"end":256.6,"speaker":"Jonathan Pageau","text":"Represents a typical journey which would lead one to atheism."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":257.64,"end":262.2,"speaker":"Jonathan Pageau","text":"And to be fair, that's a pretty generous statement. Many atheists might be far more acid."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":262.2,"end":264.52,"speaker":"Jonathan Pageau","text":"In their vision of the symbolic language."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":265.32,"end":271.52,"speaker":"Jonathan Pageau","text":"So there are a lot of things to untangle, but here we go. Symbolism and religious language is not just."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":271.52,"end":273.68,"speaker":"Jonathan Pageau","text":"About the subjective and social."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":274.48,"end":283.16,"speaker":"Jonathan Pageau","text":"And symbolism is indeed a language describing what happens in the universe. So then why might you ask, is."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":283.16,"end":285.76,"speaker":"Jonathan Pageau","text":"It so different from modern science?"}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":286.8,"end":291.68,"speaker":"Jonathan Pageau","text":"Well, the answer often given by atheists is that it's just a less advanced."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":291.76,"end":294.48,"speaker":"Jonathan Pageau","text":"System of what science is trying to deal with."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":295.67,"end":306.43,"speaker":"Jonathan Pageau","text":"We know more today and so we can correct the mistake our ancestors made. So if we take for granted that religious language were there to describe the."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":306.43,"end":308.75,"speaker":"Jonathan Pageau","text":"World in a technical sense, the same."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":308.75,"end":313.31,"speaker":"Jonathan Pageau","text":"Way modern science is attempting to do, then yes, modern science has a more."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":313.31,"end":319.75,"speaker":"Jonathan Pageau","text":"Let'S say, accurate and exact description of natural laws and events."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":321.04,"end":327.68,"speaker":"Jonathan Pageau","text":"But I think to assume that is ill informed and maybe even a bit ill intentioned."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":328.24,"end":333.2,"speaker":"Jonathan Pageau","text":"For if one compares apples to oranges and insists that they are the same."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":333.44,"end":336.24,"speaker":"Jonathan Pageau","text":"While constantly mocking the orange for being."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":336.56,"end":340.08,"speaker":"Jonathan Pageau","text":"A queer, regressive and inadequate apple, well."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":340.08,"end":346.44,"speaker":"Jonathan Pageau","text":"There'S something that's wrong. So then how do we account for."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":346.44,"end":347.85,"speaker":"Jonathan Pageau","text":"The difference between the two?"}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":347.85,"end":355.69,"speaker":"Jonathan Pageau","text":"Well, maybe something like this symbolism and religious language in general are an attempt to understand the universe."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":355.77,"end":356.25,"speaker":"Announcer","text":"Yes."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":356.89,"end":370.25,"speaker":"Jonathan Pageau","text":"But also while simultaneously understanding the process by which we understand the universe. Okay, so let me repeat that in another way."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":370.73,"end":375.91,"speaker":"Jonathan Pageau","text":"It's both a description of the world and a description of how it is."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":375.91,"end":377.59,"speaker":"Jonathan Pageau","text":"I can describe the world."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":378.71,"end":390.23,"speaker":"Jonathan Pageau","text":"So in relation to modern science, religious language would be something like something of a meta process or a metalanguage, because it tries to express the thing it is focusing on."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":391.27,"end":393.43,"speaker":"Jonathan Pageau","text":"Let's say a mountain. Okay."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":393.91,"end":586.03,"speaker":"Jonathan Pageau","text":"While also expressing the process by which that focus is even possible. So if modern science can describe a mountain, height, width, terrain, its foliage, its mineral constitution, religious language is expressing why I have a category like mountain in the first place, why that category is relevant to humans. Basically, what does a mountain mean? So the scientists Will retort something like this, will retort something like a mountain doesn't mean anything. But to say so is to ignore the human variable, ignore that we are the ones looking at the mountain. Even if I believe that that mountain is outside of my tiny existence, it ignores consciousness, ignores why I would bother to have a category like mountain. It ignores that I have to climb a mountain or go around a mountain when it's in my way. It ignores the effect going up a mountain has on human consciousness. All those things are real. They are no more illusions than the scientific data. Symbolism tries to take all of that into account, that is, discuss a mountain without pretending that we are not human beings living in a world of mountains. So it does have a personal and social aspect to it, because it takes into account consciousness. But it isn't just personal and social. And also taking consciousness into account doesn't mean that it's a relative thing and subjective in the way that we see that word today. Subjective in the sense of idiosyncratic, arbitrary to my own particularities and proclivities. There's a universal aspect to the experience of a mountain. So the religious language is above the scientific language and contains the scientific process within it, makes it possible. And I know that Jordan Peterson has mentioned this a few times, but he hasn't had the opportunity yet to elaborate completely how that works in his talks. And I know it's hard to understand and it will seem aggravating beyond belief to many atheists at the outset, but. So I'm going to try to give an example that will unpack this as much as possible. So I think we can keep going with the mountain. I've talked about mountains before in other talks, but it's such a basic image that it can help us understand many things. There are reasons why mountains are often sacred. So the experience of a mountain is that as you ascend the mountain, the width of the base is refined. It necessarily gets narrower, narrower and narrower. As you go higher and higher."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":588.96,"end":589.2,"speaker":"Jonathan Pageau","text":"The."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":589.44,"end":655.46,"speaker":"Jonathan Pageau","text":"Experience of particularity is contained more and more, because as you go up the mountain, you can see more and more, you can see further. So when you're at the bottom of the mountain, you can only see the very particular. The rocks in front of you, the trees around you. But as you ascend, your gaze widens and you get more and more of an encompassing experience. This refinement of experience happens as the mountain itself becomes narrower and narrower, moves from the particular and the many to the one and the universal. So reaching the summit, then your view opens up Completely in a kind of a jump. Because suddenly, as you reach the summit, in that very moment, the entire world seems to appear beneath you. And you can see the mountain itself on all its sides and the horizon all around you. So that experience of the mountain."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":657.7,"end":657.98,"speaker":"Jonathan Pageau","text":"The."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":657.98,"end":985.16,"speaker":"Jonathan Pageau","text":"One I've just described, is the same as any hierarchy. So let's take the army, for example. The men are at the bottom, and get specific orders, specific tasks. But as you go up the military hierarchy, the corporals, the generals are less and less in terms of quantity. There are more men and less leaders. And then they also have a more global vision of strategy. And each level is. Contains the explicit actions of the lower levels within them. So let's say the men have to dig this trench, transport things to this outpost. The higher levels contain that within the more implicit strategies, let's say, reinforcing that front, defending these assets until one ascends, one reaches, let's say, the top general, where the patterns of the battle are set up with the final goal in mind. Outflank the opponent, take this city, win the war. So similarly, the sand hierarchy will have a conceptual equivalent. So, for example, specific species of something, let's say a Dalmatian, a greyhound or a Pekingese, despite their wide differences, can be contained in a higher concept, which is dog, which can be then contained and regulated by higher and higher concepts. Canine, mammal, animal, and then being. So what the language of symbolism does is suggest that there is a structural relationship between all these different versions of the hierarchy, that they exhibit the same truth and so are connected in a manner which has absolutely nothing to do with the kind of quantitative analysis of science and everything to do with language and consciousness. So Christ is the head of the church, just like our physical head is the symbolic head of our body. That is certainly not a scientifically valid statement. So now we're going to take it one step further. What happens is this symbolism, religious symbolism is exactly that ladder. It's exactly the latter. That mountain. It offers images at the base of the mountain, the most particular images possible. These act as a kind of support for the higher levels of meaning. So symbolism is always very concrete, very immediate. A tree, a rock, the earth, the heavens. But the structural patterns then move you up towards more universal and encompassing realities. Now, most of all, we need to understand that this mountain, this ascent, is also an ascent of consciousness. Because we human beings are organized in the same way. We have these desires and multiplicities on our edges. These competing personalities which pull us here and there, tend to pull us apart, pull us into multiplicity. But as we ascend our own consciousness, we find a center, the head or the mind. The Church fathers speak of the nous, and that center of consciousness is capable of transcending and unifying the multiplicity into oneness. Now, the symbolism of hierarchy I've just described the mountain, the ladder is also the root of why we identify the highest things with spirit, air, wind, or with intelligence. Why we identify the highest of high with heaven, that which is so high above us that it is unreachable. The Father, light, spoken word, which comes both from intelligence, but most immediately from the head of the body. So it's not that God is physically in heaven, no reasonable Christian believes that, but rather the analogy of our experience of heaven, of ascension is the root of the support, so to speak, for that which is beyond and cannot be described directly. So hopefully that's clear enough. But I still haven't shown you how that works. I want to go back and read the comment that I was sent and hopefully I can show you. So our commentator says I am an atheist because my pure and honest desire to understand the universe led me to answers from biology, physics and other scientific fields. These answers are more sublime and precious."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":985.4,"end":987,"speaker":"Jonathan Pageau","text":"Than anything I know."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":989.8,"end":1063.76,"speaker":"Jonathan Pageau","text":"Notice she says these answers are more sublime and precious. Now, what is that word, sublime? It's an interesting word because something sublime is something which is elevated. The source of the notion of sublimation was the change of a solid into a vapor. So is that what she means? That the scientific answers are literally like changing a solid into a vapor? Of course not. What she means is that scientific answers are more precious. She said it rarer. Something like the move from the large quantity at the base of the mountain to the rarer and rarer and more sought after summit. What sublime means is that scientific answers are more like heaven that is vapor, and less like earth that is solid. I believe religions and symbolism can confer."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":1063.76,"end":1067.76,"speaker":"Jonathan Pageau","text":"Meaning in one's personal, subjective life. Because I've been on that path before."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":1069.44,"end":1079.65,"speaker":"Jonathan Pageau","text":"You could say that is enough, because all we have in our existence is our subjective point of view. But I believe it's a noble act to care less about that and to desire to know what happens with the."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":1079.65,"end":1082.01,"speaker":"Jonathan Pageau","text":"Universe outside your own personal life."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":1083.93,"end":1085.81,"speaker":"Jonathan Pageau","text":"Then how could anyone judge you for."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":1085.81,"end":1087.81,"speaker":"Jonathan Pageau","text":"Being an atheist when science, as imperfect."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":1087.81,"end":1089.45,"speaker":"Jonathan Pageau","text":"As it is, brought you knowledge about."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":1089.45,"end":1094.01,"speaker":"Jonathan Pageau","text":"Distant stars and galaxies, the small world of atoms, and much more?"}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":1094.97,"end":1129.94,"speaker":"Jonathan Pageau","text":"Now this is where we need to pay attention. Mysticism and religion did not enlighten us about matters above subjective and social aspects now notice again that she uses the word above. Now, does she mean that, for example, that if I had a stack of scientific data, like a pile of paper, let's say that I would place it on top of a stack of subjective and social matters? No, obviously not."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":1131.54,"end":1134.34,"speaker":"Jonathan Pageau","text":"What she's saying is that there is."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":1134.66,"end":1226.62,"speaker":"Jonathan Pageau","text":"A hierarchy of value, a mountain of meaning. And scientific knowledge is, in her opinion, closer to heaven, closer to the oneness of the summit. And that's really interesting because the scientific method is, by its own admission, by its own process, a removal of all hierarchies of value. It is the leveling of the world into measurable phenomena, the removal of all meaning. Yet in order to express the superiority of science, our commentator must resort to, to the same language, the same structure we use to say that God, the absolute, the one, the origin of all multiplicity, is in heaven. So what is fascinating is that she can use that structure of heaven and hierarchy unconsciously. Exactly. Because the scientific method does not include it in its worldview, does not take it into consideration how we exist and how we encounter the world. She said it herself, quote, it is a noble act to care less about our subjective point of view and to desire to know what happens in the."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":1226.62,"end":1229.74,"speaker":"Jonathan Pageau","text":"Universe outside your own personal life."}
{"episode_id":"SW - #011 - 2018-08-09 - How Science Is Nested In Religion","start":1233.5,"end":1467.97,"speaker":"Jonathan Pageau","text":"So she is criticizing symbolic language while using the symbolic language to elevate, to magnify and submit herself to science and its precious sublime answers. But the language of elevation of hierarchy being indeed the manner in which we ascribe value to things, is the religious hierarchy that we find in Dante or in Jacob's ladder, or in Moses, Ascent of the mountain, the great chain of being, as it has been called. It goes unnoticed even as it is being used, creating a form of cognitive dissonance, an unconsciousness of language and of one's own embodied human existence. You know, I used to think that atheists, that when atheists proclaimed their allegiance to the, to the flying Spaghetti Monster, that they were just joking. But now I'm starting to think that because they elevate the scientific process, that they elevate something which is itself a denial of any elevation, that maybe they do worship something at least akin to the Spaghetti Monster because they don't understand that analogies of hierarchy are coherent, that we move from the specific to the specific and quantifiable, which is what science attempts to describe. You know, dig that trench, carry those guns to the origin of existence, the purpose. Win that battle, win the war, the purpose, which is also the capacity to even see, to even consider specific and quantifiable. Things you move from the feet to the head, from the earth to the spirit, from the children to the father, from the darkness to the light. And all religious images are completely coherent as they place themselves on the hierarchy of being. But if one thinks that earth is more sublime, that quantity is more precious, that descriptions of facts are above their meanings and the purpose of why we're describing those facts and not others, well, someone who is able to inhabit unconsciously such an upside down inverted world can put anything at the top of that hierarchy. And I guess the flying spaghetti monster will do so. When our commentator says, I will cease being an atheist and become spiritual or whatever, when all of these pretty post hoc connections and symbols will make a difference in allowing me to understand the nature of the universe outside my insignificant, tiny life, all I can say is already spiritual. You've told me yourself it's only that you're trying to throw mud up in the air, throw mud up into the heavens in the hope that you can then worship it."}
