{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":0.16,"end":62.01,"speaker":"Laura Diaz","text":"Tucson, the weight is over Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks at mediweight loss. I got the same medication but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com and then when we look."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":62.01,"end":144.24,"speaker":"Seraphim Hamilton","text":"At scripture and we ask the question, what's the unifying vision behind the whole Bible? Scripture from beginning to end pertains to the divine indwelling of the world in sanctuaries. And so if you want to see the entire world at once, you go to Exodus 25:31. This is where Moses enters into God's presence. And what does he see when he enters into God's presence? He doesn't just see a bright light. He doesn't just have a numinous experience, though he does have those things. He sees a vision of a blueprint, of a building with furniture, or more precisely, a tent with furniture. And that tabernacle is the architecture of the entire creation because it takes the totality of the cosmos and it compresses it down into a way that can be seen by one person. And so when we look at the structure of the tabernacle, we are looking into high heaven and beyond. And we see the relation that everything in the tabernacle has with everything else. And. And in doing that, we can then look at the real world and see it as an exegesis of the actual creation. And the whole Bible is fundamentally about this principle."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":155.76,"end":159.36,"speaker":"Jonathan Pageau","text":"This is Jonathan Pedro. Welcome to the symbolic world."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":163.58,"end":163.82,"speaker":"Seraphim Hamilton","text":"Foreign."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":170.62,"end":222.26,"speaker":"Jonathan Pageau","text":"I'm here with Seraphim Hamilton. If you paid attention to the channel he has been discussing with me, before he has a very fascinating and powerful vision of scripture. He has his own YouTube channel. You can look him up. Seraphim Hamilton. But we're excited that he is going to be teaching a class for us called Scripture the Key to Reality, the Bible as a symbolic world, you know, and obviously this is something that anybody who watches this believes to be true. But it's exciting to also get people's minds and people's thought into the Scripture, because there are all kinds of ways in which that's the case. It's not just one single way. The Bible is polysemic, and there's all of these powerful structures inside, and people's different tax on it is enriching for each of us. And so, Seraphim, thanks for doing this with us."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":222.51,"end":224.35,"speaker":"Seraphim Hamilton","text":"Well, thank you so much. I'm really excited."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":225.07,"end":236.91,"speaker":"Jonathan Pageau","text":"And so that's a bold statement. You know, obviously I also believe it, but, you know, the idea that the Scripture is the key to reality. Maybe tell us a little bit about what is your perception on that."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":237.23,"end":423.12,"speaker":"Seraphim Hamilton","text":"Yeah, so when you look at the world, you're not really looking at the totality of the world in one gaze. The world is a lot bigger than what you can see around you. And so the question is, how do we understand if we think there is some unifying purpose to the world, if there's some unifying principle which undergirds the relation between everything and everything else? How do you see it all at once? Well, the ultimate answer to that question is you see it in the person of Jesus Christ. You see it in the Logos, through whom everything has its particular existence and communion with everything else. But Saint Maximus the Confessor draws a very interesting analogy because between the Incarnation, the creation, and then the Scripture. So all three of these are expressions of the one person of the Logos in a kind of totalizing way. And then when we look at Scripture and we ask the question, what's the unifying vision behind the whole Bible? Scripture, from beginning to end, pertains to the divine indwelling of the world in sanctuaries. And so if you want to see the entire world at once, you go to Exodus 25 to 31. This is where Moses enters into God's presence. And what does he see when he enters into God's presence? He doesn't just see a bright light. He doesn't just have a numinous experience, though he does have those things. He sees a vision of a blueprint of a building with furniture or more furniture. And that tabernacle is the architecture of the entire creation. Because it takes the totality of the cosmos and it compresses it down into a way that can be seen by one person. And so when we look at the structure of the tabernacle, we are looking into high heaven and beyond, and we see the relation that everything in the tabernacle has with everything else. And in doing that, we can then look at the real world and see it as an exegesis of the actual creation. And the whole Bible is fundamentally about this principle, the way in which God is disclosed as the unifying principle of the world, and the way in which God intends to bring the world to perfection through his relation and dialogue with the human race as a single organism. So that's kind of the overarching vision, no pun intended, of the class stepping into the tabernacle, stepping into the temple, seeing it as the architecture of reality, reading the whole Bible in terms of that, and then in the last couple of classes, and then in a broader sense throughout them all, we're going to concretize that a little bit and see how this isn't just some abstraction which we make ourselves believe. It actually cashes out in the concrete stuff of the world."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":424.64,"end":461.06,"speaker":"Jonathan Pageau","text":"Because you said something really bold at the outset that I'm sure some people might freak people out, is that you said St. Maximus draws this relationship. Right. He says he talks about, of course, the person of Christ as the incarnation, talks about Scripture. And then he said he talked about all of creation as being the fullness of the Logos. And so maybe, I mean, because I know some types of people are going to get really shocked if you express the creation as an extension of incarnation, but maybe you can talk a little bit about that and help people understand why that is the case and why that's useful to understand."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":461.54,"end":616.69,"speaker":"Seraphim Hamilton","text":"Yeah, we don't want to see God as kind of a foreigner in his own world. So when we look out at the world, we see it having all kinds of positive qualities. It has color and it has sound, it has that has all of these things. And when we consider what we believe about God, God is the one who is self existent, meaning he has all existent qualities to an infinite degree. And so there's no thing in existence which could possibly come from anything other than God. You know, in order to have a quality, if you don't have it intrinsically, you need to get it from somewhere else. While we believe as Christians that the creation does not exist intrinsically, it. It is derivative of God. So if the creation has the qualities that it has and it received its existence and its life from God, then that simply means that the creation has to derive or express those qualities which belong intrinsically to God. But we acknowledge that there is, of course, an ontological distinction in the nature of their existence between God and the world, not because they are utterly unlike each other in every sense of that phrase, but because they are the things that we see in limited form in the creation. We see in infinite form to an infinitely greater degree in the life of God himself. And one of the things that we recognize when we think about God's relation to the world is that all of these relations and qualities are instantiated to their fullest degree in the Father's relation to the Son. So we have this thing called a God world relation. God relates to the world as something other than Himself. But we say that everything that the world is expresses or echoes something in the life of God. So what about that idea of relation? Well, the reason that God can have a relationship with the world is because relation itself is something which is infinitely possessed by the Father's relation to the Son. So that's why the Gospel of John says all things were made through him and says that in the context of the Son's being begotten of the Father, the Son is begotten of the Father, God creates the world. Those aren't the same thing, but they're analogous. And thus the creation is brought to its perfection through the incarnation of the Word. And it's not an accident that it's in this context where the Gospel of John evokes the language of sanctuary. The Word became flesh and tabernacled among us, and we have seen his glory, glory to the only Son from the Father. So that's how we enter into that life of God."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":617.93,"end":667.39,"speaker":"Jonathan Pageau","text":"So what is the. This is the question, in some ways, the question that I hear all the time, even the things that I say. If what you're saying is true, then what is the difference between the Christian vision of the world and a kind of pantheism or a kind of immanentism where God is the world? Because you hear people say things like that, right? I hear people now all the time who. Who are constantly trying to avoid saying that they pray and they say things like, I asked the universe or whatever, that kind of language. And so what is the difference? Why do we still have then if God is fully manifested through the world's qualities, why do we need the. You could say the distinction of God as a separate being or a separate source of being."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":667.39,"end":825.79,"speaker":"Seraphim Hamilton","text":"Yeah. Yeah. Well, I think that we wouldn't say necessarily that God is fully manifested in the qualities of the world. We would say that the world runs downstream of God in the sense that God gives it life and existence and being. But then what the world does is it points us upwards and outwards. It points us out of itself. And so, let's see, we see light in the world, and light makes us able to know the things on which it shines. Light is beautiful. It has infinite color inside of it, but it points outside of itself. And this is an important point, I think, about, you know, what we as orthodox Christians call apophatic theology. That we speak of God in terms of what he is not, rather than what he is. That apophatic theology is not a statement that God cannot be known. It is a statement that there's always more of God to know. And so when we look at the finite world, it. It points outside of itself as one which comes from God. But then when we enter into God, we see more of that to an infinitely more beautiful degree than we could see looking at the world in itself. And then this is, you know, another part of the way that scripture frames its concept of reality, which is that, okay, the world is a temple. It's a sanctuary. It's a place where God lives. It's a place which reflects the qualities of God. And God has made man and as his partner, to bring God into the world. So if you look, you know, at the way that the tabernacle is consecrated. Well, the tabernacle is a miniature representation of creation. And the language of the tabernacle is filled with allusions back to Creation Week. But one of the things you find that's really interesting is that at the end of Exodus, Moses and God both are using verbs that belong to God in Creation Week, that Moses finished the work, whereas God was the one who finished the work in Creation Week. That God rested in the tabernacle in his glory, just as he did in the seventh creation day. And so what that means then is that man, as the one who knows God, who exists in relation to God, is then given the mission to bring God more and more fully into the world. So the world isn't that which just directly immediately reveals God to us, but the world points us to God. And then when we turn and gaze upon the God from whom the world comes, we can look back on the world and bring God's glory more and more fully into that world, which is what we're going to be doing for all eternity."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":826.59,"end":886.41,"speaker":"Jonathan Pageau","text":"Yeah, it's interesting that you see that obviously in Genesis at the beginning, when God creates man, you can see that he is giving him a role which is similar to his. He's saying, now, name the animals, which is an expression of what God was doing in creating the world in Genesis 1. And so you really have this sense that the purpose of the human is to kind of continue to be like an emissary of God in the world and to continue his work in reality. But then maybe, yeah, we can ask this question, which is that again, it's related to the question I asked before. And it's something that people say all the time, which is, if creation is this. If creation in some ways is a tabernacle, creation is this place in which God reveals himself, then why do we need. Why do we need temples? Like, why do we need to build. Why was there this need to build a tabernacle rather than to live in God's creation? Let's say."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":886.41,"end":1075.22,"speaker":"Seraphim Hamilton","text":"Yeah. Yeah. Well, I think that the answer to this is related to the mission that we're given, right? So as you mentioned in. In Genesis 1, God shapes things. He takes unformed void matter, and he molds it into different things, and then he leaves it intentionally and complete. So that man is going to perpetuate that work and man is going to bring creation to its perfection. And so then I think what we want to do is we want to ask the question of what we're doing when we actually build specific sanctuaries. What we're doing in building specific sanctuaries is not taking something that's utterly unlike the world and just like popping it into the world. Instead, what we're doing is we're taking the matter of creation and we're shaping it so that it becomes more fully itself by reflecting God. So this derives from kind of the first principles about which we spoke, that the world derives from God as the creation of God. It therefore reflects or expresses symbolically some character of God. Therefore, it finds itself when it comes to more and more fully express the life of God. And so this is something that we see in Exodus as well. So the instructions for the tabernacle, they're given in seven speeches corresponding to the seven creation days. The sixth speech talks about a guy named Bezalel from the tribe of Judah, the same tribe as Jesus. And Bezalel is thus an exegesis of what Adam is meant to do. So God gives Bezalel the Spirit, just as he gave Adam the Spirit. And what he does is he takes all of this stuff that they've gotten out from Egypt. So they came out with lots of spoils. There's a lot of back pay that they weren't getting when they were slaves in Egypt. So they got their back pay. And then God says, give me a contribution from it. And what they do is they take the matter of the world and they shape it, and they mold it in such a way that. That more fully expresses symbolically God's character so that God can come and dwell in it. And then in the language of embodiment, this is one of the beautiful things about scripture, that it uses different patterns of language to express different aspects of God's life. But you see these patterns being married consistently through the scripture, so that they're not just separate. They stand alongside each other. The Tabernacle and the temple, the. They're not just spoken of as a static building. They're spoken of as things like a tree of life or an organism. And so what we see is that man. Man's mission is to guard and cultivate the garden. He's an agriculturalist. And man plants the seed in the world and then grows the environment of the temple like an organism until it totally permeates all things. And that's where you get the image of the cosmic tree. When God speaks to Daniel and Nebuchadnezzar in the book of Daniel, he sees his empire as this tree which extends over all the nations. And then Jesus uses that image for the kingdom of God in the Gospels. But the temple itself is a tree house. The temple is built out of this kind of material."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":1076.02,"end":1154.96,"speaker":"Jonathan Pageau","text":"One of the things I've noticed and that has fascinated me and it's been part of the things that I talk about is that it seems that there is a shift that happens at the fall and that there is an aspect of the consequence of the fall which is this idea of work. Right. It seems that Adam, before the fall, his role is to name. It's almost like an effortless thing. Effortless in the sense that we think of effort, right? In the sense that it was a more natural process of him naming the animals. Whereas after the fall, there's this sense in which he actually has to mold, like physically shape things, and that there's a relationship between that and the Fall, which you see in the fact that human activity and human craft then develops in the line of Cain until the flood. And so that's something that I've been really thinking about. And I definitely see in some ways the tabernacle, then the city of Jerusalem, and ultimately the heavenly Jerusalem in some ways as God Covering or let's say, transforming the Fall into something glorious. Right. Transforming the result of the Fall into something positive. But I wondered if you've thought about that, if you have ideas about that relationship between the fallen world and the tabernacle, let's say."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":1155.2,"end":1341.89,"speaker":"Seraphim Hamilton","text":"Yeah, so one of the things that's really interesting about what you see in the line of Cain is that many of the things which are described in the line of Cain implicitly would be necessary for Noah to build the world into an ark. And so what we see, I think, in the Fall is, you know, man goes into schism from the life of God. And because the life of God is the principle of all reality, that means man goes into schism with the communion in which he would know everything else in God. And what you see in Genesis 2, as you point out, is Adam is ruling the world, as it were, through speech. God has spoken to him, and now Adam speaks out to the world. And the animals just approach Adam. They freely offer themselves to Adam so that he can rule over them. But then in the event of the Fall, the schism from God is manifest in a schism from the world, so that the world begins to resist the natural operation of man. The world rises up and rebels against man. I mean, you wouldn't be able to name a lion in the way that Adam named the lion in the garden. You'd have to go wrestle it to the ground and do all this kind of stuff in order to find it and study it and figure out an appropriate name for it. And so there's this schism between God, man and the world which is then manifest in. I don't know if I would call it work per se. I think I would call it toil. Right? It's a spirit specific kind of work. As God works during the six creation days. But creation just responds immediately to his word. And he invites us to enter that work and thus enter his rest. But then there's a toil which arises out of the conflict between man and the world. And this is where you then get the image of dominion, which was something given to Adam, being expressed in terms of violent conquest. Man begins to go out and take a sword and cut things down and bring destruction into the world and in order to rule over it. And then in the prophetic books, this is one of the things that I'm really going to talk about and emphasize in a lot of detail in the class, the importance of all of the specific phrases that we find in Scripture. The prophetic books take that idea of warfare and they don't just destroy swords and spears. Isaiah does not say, in those days, man will melt down all his swords and break his spears. Rather, the swords and spears are turned into plowshares and pruning hooks. That man has been reconciled with the world through God and therefore is able to rule over the world in a way that evinces the harmony between God, man, and the world, and that is ultimately rule through the divine word. The word goes into our mouth, we then speak, and the world is harmonized with us. And we actually see this in some of the lives of the saints. There's one story about Saint Seraphim where people came and they visited him, and he spoke, and he called a plant to rise up out of the ground. That the spirit of God, who gives life to all the plants, was in him in such a way that it was on his breath. And the world simply responded with obedience."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":1343.49,"end":1360.68,"speaker":"Jonathan Pageau","text":"And so we were kind of going somewhere with the idea that those skills were needed to build the ark. And so what were you trying to. What were you trying to point out in that idea? Like, what. What is it about the ark that makes it special or different from the cities that Cain's descendants built?"}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":1360.84,"end":1509.14,"speaker":"Seraphim Hamilton","text":"Yeah, so when Cain builds his city, it's built on the blood of his brother. So there's that idea of conflict, right? Cain goes into a conflict with his brother, and then he forms a whole society, takes the matter of the world and builds it to facilitate that kind of relation with the world. It's a breakdown of our mode of relations with the world, and then that creates a whole civil. And the things that he does with the world are built out of that principle of violence and destruction and bloodshed. But ultimately, what it is is like any sin, it's not just something that's out of the clear blue sky. It's a distortion of a mode in which we are meant to relate to God and the world. And so what God does then in Noah is. Is he brings that distorted relation with the world back into the life of the righteous human family. And so then Noah is. And this is a major theme in the story of the Flood, what Noah does is he is first obedient to God. God gives him the architecture of the ark. And if you read that text, it resembles the architecture of the tabernacle. And he looks at that, and then he takes the matter of the world and he builds a new world out of it. So the old world is Cain's world. It's a mess. It's filled with violence. You have the breakdown of every appropriate relation. Right. Heaven and earth are meant to relate in a harmonious, beautiful way. But then we get the Nephilim where heaven and earth come together in this really twisted way. So God takes that world and Noah takes out of it those things which belong to Cain and then build it and structures it into something new. He builds a new world, and then that new world gives birth to the world after the flood. And this is all an image of Christ. Right. Because think about the way that Christ not only saves us from sin, but brings the world to glory. It was through a brutal execution by his own family members, the Jewish nation and the nations of the world that he united heaven to earth and man to man on the cross. He reconciles all things through those very principles of violence and bloodshed and destruction which came into the world after the fall. So there's nothing here, I think about, you know, divine providence. Right. The way in which God turns all evil to good."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":1509.62,"end":1539.75,"speaker":"Jonathan Pageau","text":"Yeah. And there's an interesting. In the story of the ark, there is also an interesting hint at that in the fact that you see, like you said, that Noah doesn't compel the animals to come into the ark. Right. The animals, like Adam at the beginning, you know, are become subject to his will in a manner that is not compelled, that is almost like they're offering themselves up, they're coming to him. And there's a reflection. It's not exactly the same, but there's a reflection in some ways that if Adam named the animal at the beginning, Noah is recognizing them."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":1539.75,"end":1540.03,"speaker":"Seraphim Hamilton","text":"Right."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":1540.03,"end":1582.99,"speaker":"Jonathan Pageau","text":"And letting them into this, to this ark to create a new beginning. So there definitely is this sense of the transformation of the work of Cain. One of my insights has been to think that there seems to be that all through even the saving of Rome, how Christ ultimately saves Rome seems to have that image in it. Right. Because Rome was of course, the greatest civilization based on the blood of his brother, you know, the blood of a murderer of a brother, just like Cain. But that Christ kind of from the inside you could say, right. Without compelling, like an inner transformation which kind of transforms Rome into something that it wasn't before."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":1583.31,"end":1644.68,"speaker":"Seraphim Hamilton","text":"Yeah, yeah. That's really beautiful. And I think, you know, to allude to stuff you've done with Richard Rowland, this is like the grand vision of the universal history. Right. That, that this polity is the polity of Cain and that has a history through the scriptures. And you see the way the ancient chroniclers talk about this as well. You know, you have Assyria first rules the world in the days of nineness. And then you go through a sequence of other world powers. But then Ninus empire ultimately comes into the hands of Rome. And then it's that single world empire which is converted by Christ. But in the biblical perspective, Ninus empire, the first Assyrian state, which is founded by Nimrod, the same dude who was involved with Babel, that was a refoundation of the city of Cain. And so Christ takes the city of Cain, he takes the place which is the bloody city, and he remoulds it and he shapes it and he baptizes it and makes it in to the New Jerusalem, or a type of the New Jerusalem in which God's glory dwells with man."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":1645.4,"end":1676.21,"speaker":"Jonathan Pageau","text":"And so what do you think of this? Because this is something that I've been pondering too in terms of the idea of the tabernacle or the temple. Right. Like in the heavenly Jerusalem, it says explicitly there is no temple. There is no temple in heavenly Jerusalem. And there's this sense in which in some ways the structure of the temple is no longer needed because all of society or the entire communion of the saints is a temple. Yeah. So I don't know if you thought about that a little bit."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":1676.6,"end":1803.02,"speaker":"Seraphim Hamilton","text":"Yeah. So, you know, what we're doing when you build a temple is the world is being compressed down to a size that we can engage with the totality of it in miniature. But God created the world obviously, with the intention that in its totality it would simply play that function, that whenever we see an individual blade of grass, we will see the way in which God is uniquely disclosed in that particular blade of grass in a way that he is not able to in anything else in all creation. And then when God becomes man in the person of Christ, the logos of everything is compressed down to size, not just symbolically, but really concretely in this flesh and blood Jew from Nazareth. And so then what you see in the prophetic books is kind of the image we talked about a little bit before, where the, you know, the tree is the sanctuary which grows to encompass the totality of. Of the cosmos. But we come to be more and more fully appropriated to the life of Christ, so that the whole world then is transformed into what the sanctuary only pointed to. So at that point, there's kind of a breakdown or a unification between what we call symbolism and what we call concrete reality. Like the prophets talk about the eschaton in terms of stars falling from heaven and all that kind of stuff. And we recognize this is spiritual language to refer to the change in political Powers and things like that. But as the world comes to more and more fully manifest the Logos in the world, that symbolic language is simply concretized in terms of the actual life of creation. So then when we look in Revelation 21 and we see the city of God, what we're seeing is a temple which has been planted in the world that's now grown to encompass the whole thing. And you see it in the Book of Daniel. Daniel talks about a stone cut without hands which grows into a mountain, the sanctuary, and it fills the entire creation. And that's what you then see in Revelation 21. The city is the mountain."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":1803.98,"end":1859.76,"speaker":"Jonathan Pageau","text":"Yeah. And the more you realize that that's the pattern, you know, you see that it's not just. Like you said, it's not just in the Book of Revelation. It's actually hinted at all through the prophetic books. I was, you know, in this class that I'm giving myself on the. On the symbolism. I was rereading the vision of Ezekiel, and I realized that he, like, the chariot that he's describing is literally the entire creation because he says it's like the dome of heaven, and then there are these four corners, you know, and then there's the. The charioteer, like the God on the throne above. And it's like, wait a minute. He's saying that the whole world is. Is this chariot, Right. And like you said, it's the same with the. With the story of the. Of the mountain. And then you see in the church F. And in St. Ephraim, I love how he describes paradise because he says that the limits of paradise, that the top of paradise is higher than all the mountains and its limit is beyond the ocean. And you think, yeah, wait a minute. He's saying everything is paradise, like the whole world is paradise."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":1860,"end":1898.38,"speaker":"Seraphim Hamilton","text":"Yeah, yeah. This is one of the beautiful things that, you know, we encounter when we work through Scripture with, you know, an eye for symbolism. And this is one of the things that's really interesting, I think, about your work and the work of others who are kind of in the same vein is that we see multiple people independently coming to a lot of the same correlations, because this stuff is really in the Scriptures. And when we read the scriptures with an eye for symbolism and the correlation that one thing has with another thing, we find the same truths manifested in every text."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":1899.26,"end":1942.57,"speaker":"Jonathan Pageau","text":"Yeah. And that's really interesting what's happening now. It really feels like there is an actual. There's a kind of a moment as well, which is, you know, coming out of this materialist period, where we were, we were such reductionist that we basically splintered the text into a bunch of sources, whatever that is. But it feels like now there's this waking up where people are kind of almost as if after a binge, like a drunken binge, kind of just waking up from this, this chaos. And we're seeing it happening, you know, in, in Orthodoxy, in the Catholic Church, in the Protestant Church. We're kind of seeing all these people, like you said, interestingly enough, come to the same, to the same insights in terms of at least the patterns that are there in the, in the text."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":1942.73,"end":1985.55,"speaker":"Seraphim Hamilton","text":"Yeah, there was an article that was posted recently by Father Damick. I think it was from, from Telegraph in the UK or something. And it was talking about people who were encountering Christianity for the first time, time. And one of them said, I just felt like the veil between this world and the other world was pulled back for a little bit. And I think, you know, when I started getting into scripture in a serious way about 13 years ago, you know, the main, I don't know, opposition or whatever, the main non Christian approach to scripture that you would find on the web and elsewhere is, you know, biblical criticism. You take the book of Exodus and you say it's an objective fact that a million different people wrote this book because, you know, they're slightly different styles or I don't understand how this fits together with that."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":1986.51,"end":1992.43,"speaker":"Jonathan Pageau","text":"And it's like the limit of my intellect is the measure by which I'm going to decide what this text is."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":1992.91,"end":2032.93,"speaker":"Seraphim Hamilton","text":"That's really exactly it. And it's a remarkable thing because, you know, without wanting to be dismissive, because the academy, I think, has a lot of really, really good things and they've made a lot of really cool discoveries. But one of the things that I remember seeing is reading, you know, a biblical critic was talking about the different sources of Exodus and he said there's clearly multiple contradictory sources here because God calls Moses up the mountain and then when he's already on the mountain, God calls him up again. And I was just stunned because, you know, these are kind of your Bible symbolism ABCs that the mountain has three different levels. There's the base, there's a middle part, and then there's a top part. So of course God calls them up again."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":2032.93,"end":2062.79,"speaker":"Jonathan Pageau","text":"I know if you had just read Saint Ephrem, you would know. And that's why the tabernacle has three parts and that's why it's like, it's there all through. Like you said, it's just, it is in Some ways, because they don't want to believe that this text has an inner coherence, you know, that they almost find it for them, it's like a sacrilege to look at the other text in order to get a sense of why this particular text is structured the way it is, which is just, to me, it's so hilarious because you can literally do that with, like, Marvel Comics."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":2063.22,"end":2063.54,"speaker":"Seraphim Hamilton","text":"Yeah."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":2063.54,"end":2081.86,"speaker":"Jonathan Pageau","text":"So why. So you can do it with Marvel Comics, but you can't do it with, like, the most important text in the history of. Of. Of Western civilization. And. But. But you. So it's. It's. I don't know. I think that you said, I don't want to be dismissive, but I think it's time to be dismissive about this stuff, you know?"}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":2081.86,"end":2082.22,"speaker":"Seraphim Hamilton","text":"Yeah."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":2082.22,"end":2083.3,"speaker":"Jonathan Pageau","text":"To be done with it."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":2083.38,"end":2144.76,"speaker":"Seraphim Hamilton","text":"Yeah. And that's what's really exciting for me, is that I felt like when I was getting into scripture, like, maybe I'm just nuts, because so much of this stuff that I'm reading from people who are the experts on this, it just seems nonsensical to me. So what am I missing? What am I missing? I must be missing something. Then eventually I became comfortable with the idea that actually those who operate in the paradigm of biblical criticism, chopping things into sources and stuff, they're just missing the point in a dramatic way. But now I think you're seeing more and more people. Yeah. Become comfortable with that and more and more scholars, because there's always been, you know, at least a minority report within biblical scholarship which thought, you know, this isn't really convincing, but they felt they had to treat it really seriously. You're seeing more and more scholars come out and say, look, there's just nothing to this. But one of the things, for me, that. That I felt from an apologetic point of view, because a lot of people had crises of faith over this is. You can't. The best. The best defense is a good offense."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":2144.84,"end":2145.28,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":2145.28,"end":2152.2,"speaker":"Seraphim Hamilton","text":"We want to show people what the Bible does say rather than going point by point through what the biblical critics say it says. And just refuting those points."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":2152.68,"end":2279.91,"speaker":"Jonathan Pageau","text":"Yeah. And showing how, like you said, how the things that we've been told are incoherent, you know, and that, you know, the. And the reason for the doubling is just because it's different sources that are, like, glued together randomly for no reason. And to show that there are these, like. It's so weird because, like, in the text, there are these. These fractal structures, like in the text itself. But that's interesting. Because that's the way that the world is described in the Bible. So the fact that the text does what it describes the world to be shouldn't surprise you. My brother Matthew was talking about the cherub in Ezekiel, and he has a great. He had this amazing take because there are two descriptions of the cherub. One is that the cherub has four faces, right? So a bull, a man, a lion, and an eagle. And then later he describes it again and he says he has four faces. A man, a lion, an eagle, and a cherub. Those are his four faces. So he has a fractal face. Basically. It's like. Basically one of the faces is the cherub. And then it just goes. And he says, it's like these structures are there everywhere in the text. And so when you see a repetition that is something somewhat different in the text, just pay attention to that difference because it's really important. Pay attention to why those texts exist. If you just try to. And even. It's so funny because to me, even the whole sources thing, it's just so irrelevant. Because even if there are different sources, who cares? Like, why. Why is it that you think that finding some trail outside of scripture to the source is more relevant than realizing why they were put together in the first place? It's like, that seems more relevant, you know, And I say that I was joking about Marvel comics before, but I think that, like, imagine if I did an interpretation of, like, Infinity War, and I said, oh, this particular strain in the text comes from, like, some comic series in, like, the 1970s, and this one comes from the 1980s, and this particular version. And that's what my interpretation of the story. I write this huge, like, 400 page book about every single line, how it's taken from all these different authors and everything. Like, who cares? Like, why would anybody care about that?"}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":2279.91,"end":2280.23,"speaker":"Seraphim Hamilton","text":"Yeah."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":2280.23,"end":2287.31,"speaker":"Jonathan Pageau","text":"I don't even understand the people that go into these fields. Like, what is it that you're doing? I don't understand what. What is the thing that's animating you?"}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":2287.31,"end":2288.91,"speaker":"Seraphim Hamilton","text":"Yeah, yeah, exactly."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":2289.71,"end":2295.47,"speaker":"Jonathan Pageau","text":"Sorry. Sorry. If you get me into rant mode about biblical criticism, I'll never stop."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":2295.55,"end":2307.56,"speaker":"Seraphim Hamilton","text":"Me too. It's. It used to be, for me, worse because everybody around me seemed to take it really seriously. But I gotta tell you, it's so satisfying to watch, you know, to watch it crumble. Yeah, yeah."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":2307.56,"end":2364.79,"speaker":"Jonathan Pageau","text":"To also watch, like, the. This kind of. In some ways, it's interesting. This is the thing that I've been finding the most interesting is into some ways. When I was young, I remember When I was in my 20s, like this kind of second temple scholarship stuff, you know, was being used to deconstruct Christianity. Right. Like when, when the, when the. Even Qumran, like they were saying, oh, they were trying to use it to deconstruct. But now as things have kind of moved forward, it's like the opposite is true. We actually are finding things that are enlightening our perception of our own Christianity in ways that had been maybe not forgotten, but maybe a little bit put to the side that had been. That had been less in the center. And like all of this kind of Council of God theology that obviously Father Stephen talks about in Michael Heiser and all of this, like, this is so enlightening to orthodox Christianity. It really brings in. It kind of fills in some of the little gaps sometimes in the references that we struggle to understand what is going on."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":2364.95,"end":2412.39,"speaker":"Seraphim Hamilton","text":"Yeah, this is, you know, this is something that you see when you look at Second Temple literature. A lot of people look at parallels between the New Testament and Second Temple literature. And basically their comment is, well, Paul got this from his Jewish background. That's not the interesting question to me. The interesting question is, why did they read the text this way? What did they see in the text which led them to this conclusion? If they say, and this is something I'm stealing shamelessly from Peter Leithart, who I know you had on the channel, which is awesome. You know, Paul says that the rock which gave Israel water followed Israel in the wilderness. And that's something that you find in the Midrash as well. And you find it in Jewish tradition. And people say, well, that's where Paul got it. But the question is why? It's because God is identified with the rock. He stands in front of it and then he. He goes around with them in the wilderness."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":2413.43,"end":2437.36,"speaker":"Jonathan Pageau","text":"Yeah, it's interesting because that rock becomes very similar to like the Delphic, the rock that is in Delphi. Like this idea of a stone as a central thing. This is somewhere. There are many actually traditions where you have this idea of like this kind of stone that is the central place. And it makes sense because that's how Christ talks about this too. Like he talks about this idea of the foundation stone and all of these. These images."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":2437.76,"end":2481.61,"speaker":"Seraphim Hamilton","text":"Wow. Yeah. Another place which I was thinking about recently is, you know, in Daniel, you have the image of the stone comes down from heaven and cut without hands and it grows to fill the whole creation. Well, Luke loves the book of Daniel. In both Luke and Acts, he makes a lot of reference to it. And that's the theme of Acts is the growth of the temple where the Spirit dwells to grow to fill the entire Roman world. And Paul has this little encounter with folks in Ephesus who, who venerate this sacred stone which came down from heaven. And what Luke is saying is the apostolic ministry is the actual expression of that. And then this is one of the awesome things, is that when you realize that connection, it illuminates other things. Like why are the apostles described as a foundation? Because they have that correlation. The idea of the stone which came."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":2481.61,"end":2517.08,"speaker":"Jonathan Pageau","text":"Down, which came from heaven. Yeah, yeah, interesting, because that's. By the way, people know that that's what's in the Kaaba, that's what's there in the, in the. It is basically, it's a stone that fell from. From. From heaven. And so this imagery of the stone that fell from heaven, I mean, it's, it's like you said, it's a powerful image, but it only finds its, it only finds its fullness in, in some ways in the incarnation that, like this, this stone that comes from heaven, like, it's, it's. Of course there's a. There's a ritual aspect to it which is, which is not impossible, but ultimately it has to be anchored in something that is life giving, truly, you know?"}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":2517.16,"end":2609.48,"speaker":"Seraphim Hamilton","text":"Yeah, yeah. And, you know, this is one of the things that I find really exciting about scripture is, you know, just when there's concrete language like a stone, I think what you want to do is you want to ask, okay, what if I pick up a big stone? You know, what is it like? What am I experiencing? A stone is very heavy and it's very solid. And this is who the Logos is. He's got more stuff in him than anything else because he's infinite, that he's the heaviest possible subject that could come into the world. And that's the language that's used in the Old Testament where the word glory kavod is a play actually on the word for weight. Because God is so full of existence that he overcomes everything else. And if you try to smash yourself against a diamond, you're the one who's gonna smash. And that's the same with God. God is the one in terms of which everything else is molded. He is not himself molded. And that's. I mean, this is one of the things that is so cool, I think, that we both experienced about this way of thinking symbolically, and then just dogmatic theology is that we get in the Scriptures and in these patterns of thinking, the very same theology that you find in the Church, it's spoken of in really, really concrete and particular terms. But the philosophical tradition of the Fathers, it's all there. It's just spoken of in a distinct accent, you might say. Yeah, yeah, yeah."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":2609.64,"end":2661.7,"speaker":"Jonathan Pageau","text":"All right. I have a big question for you because this is something that I'm thinking about. I think I have, like, an idea. I think I have, but I'd like to hear your take on it, which is one of the things we see in Christianity is where there's a transformation to some extent in the shape of our temple. And this transformation appears in the Book of Revelation, where you find the Lamb on the altar and that the procession is around the altar. And so in Christianity, in some ways, what we have is that in the Holy of Holies, we. We have something which is at least part altar. It's not the ark. Right. Because in the Tabernacle, the ark is in the Holy of Holies, and the altar is in the outer court."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":2661.7,"end":2661.98,"speaker":"Seraphim Hamilton","text":"Right."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":2661.98,"end":2672.82,"speaker":"Jonathan Pageau","text":"And there's like this exchange. Right. You sacrifice and the glory comes down. But in Christianity, that place is the same. And so I don't know if you've thought about that and if you have some insight about that."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":2673.7,"end":2872.96,"speaker":"Seraphim Hamilton","text":"Yeah. This is one of the things that we see when you look at the structure of the sanctuary in the Old Testament is that there are gradations in terms of which the divine presence is more or less distant. Right. So if you're in the outer court, you're farther from the divine glory than you would be if you were in the holy place. And you're farther there than you would be if you walked into the Holy of Holies, where you're so close that you're probably going to die unless you take precautions before going in, as the high priest does on the day of atonement. But then when you look at the structure of these three layers, and these three layers are consistent across a variety of sanctuaries, you find that the structure of them corresponds to each other. So, for example, in the Holy of Holies, you have the. The Ark of the Covenant over which God sits, and you have the manna from heaven. So this is the manna, the bread that came down from heaven and gave life to the nation of Israel. Well, in the holy place, you have an altar. You do have an altar of incense, which leads you up to God. And what does God appear in when he comes into the Holy of Holies? A cloud. What's it. What's going around the altar of incense? It is a cloud of incense. And Then, whereas you have manna from heaven in the holy of Holies, in the holy place, you do have 12 loaves of face bread. And you have, overlooking those 12 loaves, face bread, you have a menorah, a lampstand, which represents the Israelite priesthood. And then you look at what you have in the holy of Holies, you have angels, you have cherubim, which are overlooking God's throne, and priests and angels correspond to each other. Then you see the same thing when you go out to the courtyard where you've got a bronze altar on which you offer what gets called burnt offerings, but it means something like ascension offerings, and it gets burned all up as smoke. And. And so you're going through the layers of the tabernacle up to God. And then, as you point out, and this again is one of those really cool things that you described when your brother talked about the relation between the two visions of the chariot, looking at the details, seeing how they correspond to each other, you find so much cool stuff. Well, here as well. The New Testament isn't just being sloppy. It's not being sloppy when it combines these images together, because God, as it were, unfolded Himself in a creaturely way. He unfolded Himself to create a created analog of himself. And then what he does, having extended himself outwards, he pulls us inwards. And so it folds back in without losing any of the particularity which develops throughout creation history. So that Saint Dionysius, the Areopagite, you talk about procession and reversion, things process outwards from God as he extends himself creatively to give the world a contingent life. And then, in virtue of its source in God, things revert inwards so that they return to God in the. In a simultaneous motion. But us who live in time, we experience this in sequence. God extends himself out in creation, draws us back, back in. And the Scriptures are filled with images which concretize that, like a river which flows out from the sanctuary. Isaiah says that that river flows out from the sanctuary, it accumulates the wealth of the nations, that is their productive energy. And then it goes back and it carries all that stuff back into the life of God. And that is all of history."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":2874.08,"end":2919.69,"speaker":"Jonathan Pageau","text":"That's awesome. Yeah, I've been talking a lot about that recently in the. I mean, in the class that I'm giving about this idea of creation as a breathing in and breathing out, and like, all this imagery of how things kind of move out from God and then come back. But that. That's also fractal. Like, we also do that. We are Constantly, like extending ourselves out into the world and then bringing things into ourselves. And like you said, it's interesting because it. In some ways it is. It is a simultaneous moment you can experience when you make something that it's actually a simultaneous thing because as you're forming reality outside of you, let's say you're building, I don't know, a table, that you are both extending yourself into the table, but you're also taking the wood and bringing it into yourself. Like you're. It is. It becomes an extension of you, like a part, like an extension of your body in that way."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":2919.77,"end":2947.18,"speaker":"Seraphim Hamilton","text":"Yeah. That's a really beautiful image because we see it in, you know, in the language of clothing, that Christ clothes himself in our nature. What does he do? He fashions the world. He creates the things which are going to become linen threads and all this kind of stuff. And then he takes that into Himself and he wears it. And when you wear clothing, when your arm moves, your sleeve moves, the motion is simultaneous because you're so closely united with your clothing that it's identified with you. And that's what happened in the Incarnation."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":2947.5,"end":2972.87,"speaker":"Jonathan Pageau","text":"Yeah. There was a priest was telling me recently about how important it was, in fact, in the transfiguration. Like that it's the clothing. Like, it's not just him that. That was white, it's his clothing. And it means us. Like it means everything when it. When it says his clothing. The fact that his clothing is transfigured, it means that all of creation is transfigured, not just his own, let's say, integral body. And that's an amazing hope for us."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":2972.87,"end":3025.82,"speaker":"Seraphim Hamilton","text":"Yeah, yeah. This is one of those other things about biblical language which we always want to pay attention to. We can pass it over because we're so used to talking in these figures of speech. So we talk about a body. Why is it important that Jesus body was raised from the dead? Well, body has a series of extended meanings. Right. You can talk about the physical body in which your soul lives and animates itself in relation to the world. But you can also talk about a body politic, a nation which is constituted around a central state, and it, as it were, moves as one. And we want to fold these things together and understand why. When Scripture uses the language of the church as the body of Christ, it again, is not just using a cute figure of speech. It's not coming out of the clear blue sky. It's something which, if you pursue the whole language of embodiment through the Bible, you're going to find so much beautiful, beautiful stuff."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":3026.78,"end":3102.18,"speaker":"Jonathan Pageau","text":"Yeah. That's awesome. I can't wait. This is exciting. You know, one of the things that I like about your work, like even just in compared to mine, is just how meticulous you are, like an attentive, and you're able to. You provide the sources and the references. And you. You have this approach because I'm. My I. When I talk, I just kind of. Things are a little. They're not as. They're not. I know where it comes from. Like, I kind of know, but I'm not always saying, well, this, this, this. And what I love about the way you do it is that you really, in some ways are. Are training people through the scripture itself. You're giving people references, you're helping them get through the story stories. And so I think it's going to be. It's just going to be great and a great. A great addition to our courses and for people that, that love what I'm talking about. You know, this is. If you want it to be kind of anchored, like, especially a lot of you who are saying, what do I say to my. To my Protestant, you know, family, how do I defend this? And I. And I give you a few ideas, but seraphim can really kind of give you all you need, all the references to kind of show how there is this beautiful symbolic and imagistic relationship between the Old Testament in the New Testament in both the history of the people, but also the prophetic stories that go all the way into revelation. So I am definitely excited about this and seraphim. Thank you for doing this for us."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":3102.34,"end":3108.18,"speaker":"Seraphim Hamilton","text":"Thank you so much. I'm really excited to be, you know, after a fashion, part of the symbolic world body."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":3109.14,"end":3117.33,"speaker":"Jonathan Pageau","text":"That's amazing. All right, thanks, everyone. So we'll have a link in the description. You can sign up. Sign up. Do you know when the dates are for the course?"}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":3117.65,"end":3121.09,"speaker":"Seraphim Hamilton","text":"It starts on June 10, so it starts June 10."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":3121.65,"end":3122.53,"speaker":"Jonathan Pageau","text":"And how many weeks?"}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":3122.77,"end":3127.33,"speaker":"Seraphim Hamilton","text":"It'll be five weeks total. But on July 1, we're going to."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":3127.33,"end":3132.97,"speaker":"Jonathan Pageau","text":"Miss a week with a bit of a break. All right, so everyone sign up and. And I can't wait to see you there."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":3132.97,"end":3133.29,"speaker":"Seraphim Hamilton","text":"Bye."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":3133.29,"end":3133.65,"speaker":"Jonathan Pageau","text":"Bye."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":3134.29,"end":3134.93,"speaker":"Seraphim Hamilton","text":"Thank you."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":3135.41,"end":3150.32,"speaker":"Jonathan Pageau","text":"If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase, so go to thesymbolicworld.com and thank you for your support."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":3151.12,"end":3214.22,"speaker":"Laura Diaz","text":"Tucson the weight is over. Mediweightloss they're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight so safely. With real medical support, GLP1 medications, you can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweightloss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com looking for your next Go."}
{"episode_id":"SW - #396 - 2025-06-11 - Seraphim Hamilton - Scripture - The Key to Reality","start":3214.22,"end":3279.55,"speaker":"Seraphim Hamilton","text":"To Smoke Shop Stop scrolling. I've got you. Headshop.com is the number one online smoke shop already trusted by over 100 happy smokers just like you. They've got it all. Dab rigs, vaporizers, glass bongs, smoking pipes, even THCA flour all in one place. Need a new daily driver? Grab a smooth glass bong or a classic smoking pipe. More of a concentrate fan. Their dab rigs, E rigs and wax accessories are designed for smoother, harder hitting sessions. And yes, they've even got legal THC flour. Best part? Every order ships fast and discreet, which is why thousands of smokers keep coming back. So don't waste time hopping between shops. Shop the best in dab rigs, vaporizers, glass bongs, smoking pipes and THCA flower right now@headshop.com the number one online smoke shop, headshop.com has what you need. Check it out today. Oh, and because you're listening right now, you get 10% off your next order when you use the coupon code HSHOP at checkout. Go to headshop.com now and smoke smarter."}
