{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":12.56,"end":16,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":26.17,"end":33.09,"speaker":"Jonathan Peugeot","text":"My conversational partner is Jonathan Pageau. I'm really excited. Jonathan, it's great to meet you."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":33.09,"end":34.25,"speaker":"Jonathan Pageau","text":"Yeah, it's great to meet you."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":34.25,"end":86.78,"speaker":"Jonathan Peugeot","text":"I'm so happy, man, you're here. So I figured that place I'd love to start this conversation is a few months back, we had Douglas Murray on the show. And when he was on the show, he talked about how in the modern age, we've really pushed forward, say, science and religion. And he talked about these kinds of collapse of grand narratives. In particular, religion he mentioned was one, and he sort of mentioned this kind of push towards secularism almost. So I would just have to just start with a broad question and say if, let's say in the last hundred years that religion has kind of taken a backseat to, say, science and religion. How do you analyze where we are as a society right now? Like, how do you analyze where things are right now?"}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":87.26,"end":208.05,"speaker":"Jonathan Pageau","text":"Well, I think that I could say this is going to sound dramatic, but I think we're at the end of something. There are certain ways to understand when you come to the end of a story, let's say, or the end of a pattern, and it seems like we're at the end of some pattern, we're in a crisis, maybe, is the best way to understand it. And so I think everybody is. We could say that the world in which we used to live has kind of broken down. And we feel that not only in terms of a breakdown in meaning, but we see it as a breakdown in society as well. As we see fragmentation in discourse, we see groups rising up against each other in discourse for now. But obviously we know that if this continues, then it leads to actual physical violence at some point where irreducible opposites start to appear, positions that just can't coexist with others. And so this is what we're noticing in terms of the society, but the story as well. There's a fight for the story. Like, what is the story of our world? And there's a fight to know what it is, let's say. And so all of this is a sign that we're in a crisis. John Vervaeke, the cognitive psychologist from the University of Toronto, he talks about a meaning crisis. I think it's a good way to understand what's going on. And a lot of it has to do with what Nietzsche announced, let's say, how the death of God or the death of Christianity was going to bring about massive amounts of chaos. But it's been going on for a while. And so we could say that World War I, World War II were part of that. And since World War II, we've had a little reprieve. It's almost like a. It's almost like a shock or let's say a post traumatic, you know, moment. And now it feels like the momentum which led to those wars is happening again. The same kind of patterns, the same, the same patterns in terms of extreme, let's say a desire for extreme variety and degenerate degeneracy. And then at the same time we see these kind of totalitarian moves in culture happening at the same time. So that seems to be where we are."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":208.93,"end":220.1,"speaker":"Jonathan Peugeot","text":"I wonder if we are say, perhaps close to the edge of something. Do you think that is it possible to go back? Like, is it possible to save things? Like."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":222.26,"end":275.71,"speaker":"Jonathan Pageau","text":"I said, I hate being the apocalyptic one, but I feel like things are going to play out, let's say, and they can play out really bad. They can play out bad. But I think that we're going to go through a difficult time. Things aren't just going to go back to normal and it's not just going to happen that things are going to get better just like this. There's going to be a difficult time. And hopefully, I mean, one of the things that, let's say my hope are the things that I'm doing and people like Douglas Murray and there are other thinkers out there who I think hopefully are trying to create enough of a bastion to survive the flood. Something like an ark, let's say, enough people that have a better understanding of history and a better understanding of what makes a person a human. All of these things bring brought together so that we have something to survive the flood with."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":276.03,"end":301.29,"speaker":"Jonathan Peugeot","text":"I really like that. I really, really like that analogy. If we go back through history, I was thinking back through civilizations, perhaps the Romans or the Greeks. Have there been perhaps any signs in that you're aware of throughout history of civilization, like signs that a civilization is on the verge of collapse. And are there sort of any patterns with where we are today?"}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":301.85,"end":557.38,"speaker":"Jonathan Pageau","text":"Yeah, there are several patterns. So you can see that at the, towards the end of the Roman Empire, during the crisis, right, the, let's say, what do they call the third century crisis, there were certain things which were appearing, certain manifestations, and they're pretty universal. They, there's a, for example, there's a reduction in birth rate. People stop having children. They become interested in, in strange aspects of sexuality. They become interested in strangeness in general. So there's an interest in the bizarre and the Perverse in the upside down, let's say the carnivalesque of society, the idea of Roman civilization and the kind of orgy culture, you could say that was there in late Roman civilization. And then it leads also to a desire to, how can I say this? There's also a fetishizing of the stranger. And so, for example, young Roman people in that time of crisis would dress as barbarians. They would take on the tropes of their enemies, basically. And so there are many things that kind of signal the end of a civilization. And it's kind of like a universal. It's a fractal pattern. Reality has a fractal structure. You could say. And so you can understand, for example, that at the end of a year in a traditional calendar, you would have a carnival. And this is something that Jews, for example, have at the end of their year called Purim. And in Christian cycles you would have something like Mardi Gras, or you would have the Saturnalia in the time of the Romans. So during the Christian Middle Ages, around the time of the Saturnalia, they would have something called the Feast of Fools or even the Feast of the Ass, like a feast of the donkey. So all of these upside down type of behaviors. And you can understand it also in a society as well. So think about like a town, and then on the edge of town the circus will come or a fair, and then there'll be all this aesthetic of the carnival, right? And so if you want to understand what happens at the end is you can understand it just in terms of how though the end of a year would manifest itself in a carnival. You'd have upside down behavior, you'd, you'd have lewd behavior. All of this kind of stuff that usually isn't permitted in the society would kind of come out for a day and parade around, and then after that you would move to normality. And so that is. So that's a good way to understand, you can say that our world is a carnival right now. Like, there's a lot of the aspects of our world is a carnival, but it's a carnival that's reaching towards the end. And so, you know, in the Saturnalia it was actually crazy because what they would do is they would elect a slave and they would make the slave into like an emperor figure and they would, he would spend a day of feasting and kind of all these sexual stuff that would go on. And then at the end of the day, they would just kill the slave. And it was like, that's the end of the carnival. And now we move back to normal. And so what it feels like is that we're towards the end of the carnival and the ax is whole, is like, is right there above our heads and is getting ready to come down. But, and, and we can see that with COVID as well. Like the types of measures that are being taken with COVID look like a kind of authoritarian clampdown which is on the horizon. And it's being justified. It doesn't matter. It almost doesn't matter how it's justified. Right. It's almost like it doesn't matter how we justify the fact that this is happening. It's just happening as a natural procession of a cycle, which is that after a carnival comes the shutdown, comes the, say, the hammer falls, let's say. And so this seems to. And that's what, you know, if you understand World War II, that's what happened just before World War II, during the, during Weimar Germany. Like Weimar Germany was. We're like weimar Germany times 10. That's a good way to understand what's happening in our society. All the aesthetics of Weimar Germany, we are imbibing them, but like at a much higher level. And so then what comes after that is a clampdown, sadly, which might seem like at a much higher level than even what happened in World War II. It's not. I'm going to frighten everybody, but my purpose isn't to frighten people, but I'm just. I just wish people could be able to just see the patterns and to notice that these cycles, like, I'm not making it up, like this is something that happens at the end of civilizations."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":557.62,"end":599.35,"speaker":"Jonathan Peugeot","text":"And I think that it's very, it's very eye opening to see those patterns and to kind of see where we are today. Like, one thing I've been thinking about is just how much meaning throughout centuries people have derived from religion. And I wonder perhaps what your thoughts are on this, that as perhaps as we talked about, perhaps religion has kind of taken a backseat to science and reason. Have people turned towards other means of instantiating meaning, like social justice, for instance? Is that where they've turned to."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":599.84,"end":748.7,"speaker":"Jonathan Pageau","text":"No, that's definitely right. And so one of my contentions is that what we call religion, that term, it has problems. But let's say what we call religion is inevitable. What you could call something like the ritualization of existence, the desire to, let's say, move together towards something which transcends you with something which is bigger than you, and to do it ritually and to do it through certain mechanisms. Which is the definition of an inside and an outside. You know, this idea of processing around the important thing. All of these things are just inevitable and if we try to get rid of them, they will come back. And that's what we're seeing right now. So 2020 was a year of the return of the religious. It just flooded back in through, you know, a weird fasting right at the beginning of COVID and then a kind of ecstatic moment of communion where everybody went into the streets and started to protest and having these communal feasts. And there was everything that was religious. There were people processing and kneeling and chanting. And so there was. Everything that you would find in a religious setting was being happened, was happening in these events. But there's also something else which was happening, which is scapegoating. And that's also very important, an important part of the religious pattern which is the scapegoating. Because scapegoating is what defines your, is often what defines your identity because you, you identify the foreigner, the outsider, the thing that is kind of a disease and then you want to eliminate it. And so now we have this weird moment right in the, in the Floyd protest. We saw that happening where there was this idea that like in the entire world, like the entire world was, was based on racism and every evil could be just like plugged into this one thing. And if we could just like even put it in one person, an orange haired guy, and then we could just all put it in this guy, then if we could just burn him alive, then everything would go away. It was like, and this is a religious, this is a religious ceremony. It's a. We're noticing a religious pattern. And it's a, it's frightening because it's a, it's, it's kind of an out of control religious pattern. It's almost like a. It has something of the mass to it. It has something of the, of almost like a, almost. If you think of Pentheus, you know, in the backy, who, who, who, who faces this out of control religious manifestation, gets ripped apart by it. You know, that's what we're noticing. That's. At least, that seems to be what's happening around us."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":749.18,"end":768.55,"speaker":"Jonathan Peugeot","text":"It's, it's crazy when you put them in terms like that and you realize just how deeply ingrained these values, traditions, ideas are. And I wondered, do you think that we'll ever be able to lose those meanings that we did instantiate from religion? Is it possible for them to go away?"}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":769.03,"end":870.43,"speaker":"Jonathan Pageau","text":"No, I don't think so. That this is also one of the things that. And you also don't want them to go away. Because the way that I try to help people understand is that, let's say the religious stories are religious patterns. They're actually your. They are your mechanism of perception. Like, they're the way that you perceive value in things. And so science has. Is great. Science is a wonderful tool because it's able to count, it's able to predict, it's able to accurately quantify phenomena in order to understand it and like I said, even reproduce it, which is amazing. But it doesn't offer you quality, it doesn't offer you value. You can use science to create a nuclear weapon, and you can use science to make medicine, which will help people. But. But it's the same science, right? There's nothing in the science which tells you what is valuable, and that is the religious instinct. The hierarchy, what you would call a hierarchy of values is instantiated in the hierarchy. When you say God is in heaven and hell is below, all of this is actually just an instantiation of hierarchy. So when you say that something is better or something is superior to something else, you're participating in a religious pattern because you're saying it's closer to God and you can't avoid it. Like, you can try to avoid it, but you would just be running around in circles because you have the idea of a good. And every time you give value to something, you are pointing towards that good. And that's the religious pattern, right? That's why we say the gods are above and the demons are below, or all this imagery that we use, it's all. That's the same thing as any type of valuing has that pattern."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":870.75,"end":898.72,"speaker":"Jonathan Peugeot","text":"I love that, man. I love that. One thing that I was thinking about, I come from a relative scientific background and I was thinking about this when I was entering into this conversation. I was thinking that there are just so many things that science kind of can't tell you. Like, science can't tell you if you're falling in love with someone. Science can't tell you if you're a good person. What do you think that the kind of limits to science are?"}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":899.28,"end":1066.78,"speaker":"Jonathan Pageau","text":"Well, the limit to science is really, it's the impossibility of identifying quality. So scientists, science can only describe. And sometimes we think that science can identify quality, but that's because people don't realize that the quality is something that we, we add to the science, right? And so that, let's say you could think of. Let's say you could think of science can help you make beautiful flowers. But the beautiful flower is not. Doesn't come into science for the science. There's no difference between an ugly flower and a beautiful flower. There's no difference between an apple that tastes good and an apple that tastes bad. It's just different chemicals. But the idea that you would use science to make an apple that tastes better or that it's more resistant to germs or that is whatever that is based on a value system, right, is based on hierarchy. And any type of hierarchy cannot be given by science. And I would go even further than that. And I would say that there are no identities which can be given by science. Even the identity of something. Like even the fact that we, for example, say that a city is one thing that doesn't come from science. We need something higher to tell you this is a city. And then we can tell science to study it. Like, we can tell. We need something higher to tell us this is a mountain. And then we can have science study it. But science itself can't even come to those definitions, can't even understand how multiplicity emerges into unity. You know, how different, like how different phenomena actually appears to us as one. I always give the example, like the simple example of a chair. It's like a chair is a bunch of stuff. A chair is not one thing. A chair is a bunch of things. It's a million things. It's an indefinite amount of things. And so why can't I see it as one thing? How do I do that? And that cannot be accounted for by science. I mean, science can explain the mechanism, let's say, that happens in your brain, but you can't explain the unity of the chair, right? You can't explain it away. It comes through a gestalt, like this sense of unity, this jump into unity. You could say, and you can almost. And like, in a spiritual way, you would say it's something like a little epiphany or a little, like a little, like a really, like a little vision, right? How things come into one. And, and it's, it's easier to. It's easier to dismiss that, like when it's at a level of a chair. But it's a lot harder to dismiss it when it's at the level of a city, for example, or the level of a country or the, you know, or these, these, let's say, larger or even the level of a family or the level of anything that is beyond the, the, you know, the, the simple things. But the simple things have it too. It's just sometimes people don't see it as well. But if you go up higher into the, let's say the hierarchy of beings, then you can't avoid it. You know, you see that that unity is given. It's not. You can't analyze, you can't analyze to the unity. You can't get there."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":1067.18,"end":1088.51,"speaker":"Jonathan Peugeot","text":"Yeah, man, I really love that. I really love that. I definitely think that there is a kind of. There's a domain of facts and there's a domain of values. And I completely agree that. You know, I wouldn't want to put all my faith in a civilization in the hands of science. You know, there has to be values too type of thing."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":1089.79,"end":1160.4,"speaker":"Jonathan Pageau","text":"There's something else going on it's really important to see is that because you can't avoid it, because you can't avoid the value. What happens is that when someone says it's just science, they've got a card behind their back. And sometimes they don't know. And I will give them the benefit of the doubt. Sometimes they don't even know that they have this card hidden because behind their back. But I think sometimes they do. And so they say something like follow the science. But the science doesn't lead you anywhere. I'm sorry, that's not, doesn't happen. There's something else you're following. So if you're going to pretend that you don't like there's a strange magic trick happening where you tell people to follow the science but you're actually telling them this is the value. Like let's say safety is the value. In terms of COVID it's like so absolute safety is the value. And we're willing, let's say, to sacrifice this and this and this value to towards safety and now follow the science. But at least like we have to be honest about that, right? We have to be honest that it's actually not about science, it's about a competing set of values. And so we, we should be able to discuss it at the level of values rather than, than have this idea that if you don't agree with me, then you're anti science. That's, that's a, that's a rhetorical, that's a rhetorical game that's being played on you."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":1160.8,"end":1221,"speaker":"Jonathan Peugeot","text":"Definitely, definitely. I would love to kind of pick up on this sort of science rhetoric, you know, so I'd like to think of myself as a kind of a critical thinker. So I would say that I'm extremely open minded as our audiences. I think that. And we're Always open to hear, kind of all sides. I think that one issue that I've struggled with is that I kind of do hold beliefs about evolution, let's say, the evolutionary nature of the world, Darwinism. I listened to a lot of your content on this, and I really love your viewpoint on this. How would you best conceptualize your viewpoint on, let's say, Darwinism on evolution? And, like, how do you kind of take that, aside from obviously, the values and the beliefs which you do hold about the world?"}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":1221.46,"end":1563.86,"speaker":"Jonathan Pageau","text":"Yeah, I mean, I think that, let's say Darwin exposed some very important, let's say, patterns of being. Right. In terms of how things come together and how they function and how they. They persist in the world. It's a good way to understand it. It's like they're val. Let's say Darwin identified certain values, which is like, there's a certain idea of necessity. Like, there's certain things which are necessary in order for the being to then continue into the future. Right. And that's actually. It's almost like there is a philosophical aspect to that, and there are certain things which are less necessary. And those things that are less necessary will tend to get. Move out of the way. Like, they will just naturally kind of happen to move out of the way. And so I'm totally fine with that. Like, I have no problem with that. My problem is the problem of narrative. It's the problem of story. I don't think that Darwin offers us a story that we can properly live in and that Darwinism offers us the right story to exist in. And I can give you, like, I can give you a simple example is, please. So let's say that I talk about a work of art. Like, I talk about Michelangelo's David, and I tell you that the origin of Michelangelo's David is the stone. And then I explained that all the. How the stone came about and all the different pressures in the. In the ground and all of this that happened. And so. But it's like, that's not. That's not. That's not the story of Michelangelo's David. Right? Just like, if I would tell you that music comes from, you know, like, that Beethoven's music comes from, you know, pieces of wood hitting on chords. It's like, that's not the story. Like, you can't. We, as intelligent beings, like, we see the value in things. We recognize it. Like, you can say, you can argue with it all you want, but when I look at an apple, I am evaluating it. I'm deciding if it's a Good apple or if it's a bad apple, I'm constantly. Everything. Every identity is actually teleological. That is, every identity is actually. Our perception of the world is based on value. And this is something that is actually coming out in the science itself. It's like. And when you look at a cliff, you don't, first of all, see cliff. You see a place that I can fall from, right? If you look at a rock, you think, is it a rock I can pick up? Is it a rock I can sit on? Is it a rock that I could build with? That's what we're seeing when we're looking at the categories of the world. And those are real, right? Those are real categories. And so the problem with the Darwin. The Darwin story is that we can't live in that story. Yes, we can live like. So religion, what it offers you is a story that you can live in. It's a story that is taking into account the fact that human beings are meaning beings. And it puts that into the story. And then when you read, for example, the story in Genesis like that, then you realize that that story is all about that. It's all about saying, God speaks. The world comes into existence. God sees and recognizes it is good. That's how the world is created. So it's all about meaning, value, and an act of consciousness, you could say, like this recognizing of the phenomenon, right? And then the same thing happens at the level of Adam and Eve. It's all about knowledge, knowledge of good and evil, you know, and then. And then once you enter into the world of opposites, you start to tumble and you start to fall into multiplicity. So it's all these. It's. So you realize that that's the story. That's the story you can actually live in because it's a story about meaning and about consciousness and about how we engage the world. And so that's been. Let's say, one of the works that I've been trying to do is try to help people understand that, like, say, the narrative, the religious narratives. They're not the same kind of narratives as the technical description, right? So the difference would be something like, I can tell you how your car works, right? I can tell you how the carburetor works, and I can tell you how the oil goes through this tube and how there's this and that. And that's. That's fine. Like, there's nothing wrong with that. But what you really want to know is how to drive the car. That's what you really want to know, and you want to know, like, why you would care about it. It's because it can get me to the store faster than my feet. It's like, that's the story you live in. So it doesn't deny that. It doesn't deny the other story. Like, doesn't deny the other aspect of the, of the car, which is like explaining how it works and how all the fluids function with each other. But it's, it's lower on the hierarchy of, of what we are. Right. What we really care about is what we can do with this and, and also how it relates to, to our story, let's say. And so that's how I tried to differentiate the religious stories from the more scientific descriptions or, or even, you know, natural selection. But there's value in, in the idea of natural selection. You can actually use it to understand some symbol, some mechanisms of meaning as well. But it's a dangerous if you try to attach yourself only to that because, like I said, you can't really live in it. And you can see it happening. It's not hard to see. Like, a good example is Bret Weinstein right now is that Bret Weinstein says he's a materialist, says he's a scientist and is an evolutionary biologist and constantly is telling you, we have to escape. We have to escape the story of evolution. And it's like, okay, well, where are you getting this idea? Like, where does it. Does it come from evolution? Like, where does this idea that you need to escape the story of evolution come from? And right away, now you've jumped into a religious world and you just can't avoid it because you're talking about value. You're talking about these mechanisms that aren't enough. Just like the mechanisms of the car aren't enough. You need to escape into. What's the point? I'm driving my car to the store. Not. I'm thinking about the carburetor and all these aspects of how it's actually functioning. Right."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":1564.34,"end":1666.58,"speaker":"Jonathan Peugeot","text":"I completely agree. It is absolutely a mechanism. It's an explanation. It's not a vehicle. Like, you wouldn't want to guide your life with the, you know, with Charles Darwin on your wall. As a. As a kind of prophet, I kind of love to tie all this up. This sort of opening that we've had by you. We've kind of gone back in time. We talked about kind of where we are as a society. You give a. A very, very, very coherent answer about Darwinism. So I would just, you know, kind of think about my generation. So Maybe a younger generation. So I'm 25 now, particularly people I've noticed in generation Z and kind of more contemporary generations that I've spoken with. This seems to be kind of a dismissive attitude, I would say, towards religion and religious values or, you know, whatever is. I feel like perhaps it's that they starved of purpose. I'm not too sure, you know, specifically why. I think that, like, one thing that like, we can't deny is obviously that religion was, is the birth of right and wrong. That's like how we know that we can opt towards secularism. So I would just love to just kind of just ask you, for the person listening now, what would you say is like this, the real value in familiarizing oneself with the history of a faith or religious values? Like, what would you say, like the, Even if they don't necessarily believe in it, but just to kind of get to know the sort of literature and stuff on it."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":1666.58,"end":1943.56,"speaker":"Jonathan Pageau","text":"Yeah, I want to answer just first, your first point that you said, and then I'll get to your question, please. One of the, one of the things that has happened, has, and this is something that we need to really acknowledge is that Christianity in the west became a materialistic religion. It abandoned its mysteries, let's say. And that's the reason, like, I have a lot of sympathy for Nietzsche, honestly, like, I have sympathy, I have a lot of sympathy for atheists because if I look at the level of the 19th century, 20th century Christianity, it's pathetic. Like, it's a pathetic thing because they, they're materialist and they try to lay over on top of this, this weird story about some guy dying on a cross. And like, what are you, like, what is this? Doesn't make any sense. Like, these two things don't, don't stick together. And so, so I, I have a lot of sympathy for, for where people are in terms of their understanding of religion. And so what I, what I've been trying to do, and I think there are a few other people trying to do that, is to try to go back into the roots of the Christian tradition, to go back into the highest thinkers of the Christian tradition and try to bring back a kind of metaphysical vision, let's say, or bring back a cosmic vision of what it is that Christianity was presenting as a coherent world that you could exist in. And so that's really what I've been doing. And that is ultimately, let's say the answer to the second, second your question, which is that one of the problems we have, let's say the Nihilism that we face is that we have no story we can live in. We have. We don't have a grand narrative. That's exactly the problem. And so because we don't have a grand narrative, we have fragmentary narratives which start to appear and they become completely silly at some point, right? They become as silly as fandoms, right? So it's like all these stupid fandoms that everybody has, and they're all attached to all these fictional worlds and, and would even, like, compete amongst each other in their fictional attachments. And so it's like you're not going to get it. You're not going to get rid of, like, religious conflict. It's just going to kind of devolve to stupid things where it's all these strange things that people are looking, looking towards and people want to become. People get obsessed with Star wars or Harry Potter or all these fictional universes because they have this desire to. To. To participate in a story which transcends them, something which shows them a little more about reality. And so I think that that's really the key is to go back and to reread, let's say, or to look back into Christianity in a way that helps you to see how you can live in the world and how you can exist, how you can be part of a story, but not just a story like a body. And that's, you know, when we talk about the church as the body of Christ, we can totally understand that now. It's actually a good time to understand that as we talk about things like emergence and the problem of how things have identities and the idea of complexity and complex beings. We can understand then what it means for, let's say, a body of believers to be together, to love each other in communion and to look towards the same goal or the same purpose, and therefore to become a community. And that's what human beings are made for, that we're. We're made to be communities. We were community, communal beings. And so that is really, let's say that is the solution that going back into a religious way of seeing consciously will bring you. Because if you don't, it's gonna. You're not gonna avoid it. It's gonna come back in all these weird ways. It's gonna happen anyways. It's gonna. It's gonna happen through all these weird fetishization that people have, you know, and these weird ideologies that people adopt and, and who that become religious to them, but they don't realize that they are. And they're more dangerous because of that. You know, it's like social justice is way more dangerous because it doesn't even see itself as having some kind of religious structure. It just sees itself as, this is true, this is real. And everybody else, anybody who doesn't just completely agree with me, has to be eliminated, basically has to be canceled. And right now it's just canceling online. But that stuff boils out into the real world pretty fast. And we've seen it happen. There have been people that I don't agree with, but people have lost their bank accounts, have lost their access to certain financial institutions. And that's going to continue if this culture continues. And it's going to create a new outsider, like a weird new scapegoat mechanism."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":1943.86,"end":1980.38,"speaker":"Jonathan Peugeot","text":"So one thing that I would love to pick up on that you mentioned there is you talk about these kind of grand narratives, how religion gives you a kind of story to live in and a clearly defined set of, you know, set of instructions to follow. I wonder. I was thinking about this earlier. I was thinking kind of why people get so hooked on video games. And the one thing which I think about with video games is that they have bright lines, you know, what to do to get to the next level. They're clearly defined. You're not thinking about anything else. Is there kind of parallels between that and religion?"}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":1980.46,"end":2134.34,"speaker":"Jonathan Pageau","text":"Oh, definitely. There's definitely a parallel between video games and religion because also video games exist in a religious world. They exist in. So one of the things that I talk about, for example, is like the basic structure of a world, right? As the idea of like the earth as a. As a flat, that's a surface. And then the heaven has a dome above. And this kind of. And on the edge of the world is usually some kind of chaos or some kind of limit that you can't go beyond. You know, something like the ocean, this idea of the great serpent around the earth, right? That you can't, you can't, you can't go beyond. And so, so you have this structure in, usually in a video game. And because of the game dynamics, you end up having to create centers, right? You have to have these, these kind of central spaces out of which identities or stories will happen. And then you move out into the wild, right? And then you come back to these, to these centers where it's quests. Whatever kind of game you play will. Will often have these. This quest mechanism where you get. You get something, someone is asked of you, and then you go out, you do it and you come back and then you Receive your reward. All of these, this is all, these are all religious tropes, they're all religious patterns. And so obviously they will give you a certain sense of satisfaction, let's say, to master some element of the game. And so they have some value, but the value is limited, right, because it is, it is this broken off world that, that you know, when you take your headphones off and you move away from the screen, right Then, then it doesn't connect to your life like it's a disk. It's like a strange fragmentation of reality. And so that is, let's say, when you think of, when you think for example of this idea of like the heavenly ladder, let's say, and you see these images in Dante of these, of these heavenly spheres or the spheres of purgatory moving up into the spheres of heaven, that's exactly the same structure, but it's the same structure as a video game. It's like you have these levels and then you attain these levels. It's just that it's not, it's not artificial in the sense that it's actually about acquiring virtues and acquiring chant transformation in your transformations in your being. It's not just about getting the magic ax of whatever, like whatever it is that you would do in a video game, like acquiring some of, some, some virtual object, but it actually is a transformation of the person. So you could see it that way. Like the purpose of life is to go up the levels. It's just that these levels are actually levels of virtue and not just levels of, you know, rant these things that will go away and you'll forget about in the next few years."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":2134.34,"end":2177.53,"speaker":"Jonathan Peugeot","text":"So I really like that. One other thing I was thinking about when I was coming into this conversation and you know, I wouldn't kind of describe myself as a, as a particular believer of a faith. I would say I'm more kind of of a spiritual type of land type of worldview anyway. But one thing that I've realized that I was thinking about, even though I. I wouldn't necessarily subscribe to a God or a particular person, one thing that I thought about was that during hard times, during really tough times, I've prayed, You know."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":2177.53,"end":2178.41,"speaker":"Jonathan Pageau","text":"Surprise yourself."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":2178.49,"end":2191.62,"speaker":"Jonathan Peugeot","text":"I've. Surprised. I was thinking about this. I. I've prayed and I've prayed on many occasions. You know, do you think that even people that don't necessarily subscribe to a religion should pray?"}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":2192.18,"end":2322.67,"speaker":"Jonathan Pageau","text":"I mean, it's. Yeah, it's better than, you know, it's definitely better than killing yourself or whatever or like, or Taking, you know, taking a hit of some drug or whatever. Yeah, I think so. And you might also be surprised at what happens if you take that seriously. You know, I was surprised to hear even Sam Harris say that he prays, basically. You know, in a conversation with Jordan Peterson, Jordan. Jordan talked about, you know, like, calling out and, you know, and speaking out into the world, basically something. And then seeing how it responds. And he's like, yeah, I've done that and it works. And like, what did you just say? That you pray? That's hilarious. But, but, but then the idea, let's say, of praying to God, right, In the, in the monotheistic sense is that you are, you're. You're attending to the highest thing, right? That's the idea. It's like we're trying to attend to the highest thing, not, not just these lower things. Because if you, you can pray to all kinds of things and that will bring the fruit that it'll bring. Like, you can, you can pray to the God of money. And people do all the time, and then they get money, but then they get money, but then that's all they get. And they don't necessarily find satisfaction in that money. Or they, or the God of, or the God of sex. And they pray and they pray for sex and they get sex and then they're like, hey, actually this is, this is pretty shallow, like at some point. And so there's, there's the idea that if you, the, say the Christian vision or the monotheistic vision is that you aim your prayer the highest you can so that the transformation of your being will go beyond these secondary things, will go beyond just getting more of this or more of that, or all the little gods with the little gods can offer you, but rather this idea of this infinite love, let's say that God is. That's what we're aiming towards. And obviously we're not going to get there, most of us. But, but the idea that at least if you're aiming towards, you know, infinite love, the being of infinite love, then, like, that's a pretty good goal to aim towards, right? Compared to all the other little gods, you know, it's like you get, like you said, you talk about a video game, like you can really pray to the God of, you know, whatever game you're playing because you want to really succeed. And you can have this. You can focus and you can kind of send out your desire to become excellent at it, and it'll work. But, you know, I mean, what is, like, it has very limited value let's say."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":2322.99,"end":2361.76,"speaker":"Jonathan Peugeot","text":"Sure, sure. One thing. If we sort of head over to symbolism and your work over there, which I really love. The other day I read this book, the Return of the Prodigal Son by Henry Nouwen. And I loved reading this book. It's called A Story of Homecoming. And of the things that I was thinking about, I read that book, and it's clear that art, music, like music, can, like, deeply, like, affect us, right? Like, even, like, a single note can make, like, the haze on your arm stand up."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":2361.76,"end":2362.28,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":2362.84,"end":2375.37,"speaker":"Jonathan Peugeot","text":"Why do you think that? Like, why is it that great art, great literature, great music can completely, like, just so deeply affect us? Like, why is that? Yeah."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":2375.69,"end":2495.55,"speaker":"Jonathan Pageau","text":"Well, it's because we're. We're pattern. Pattern beings. We are. We are patterned. And not only pattern, but we are producing patterns. Like, that's what we do. That's what differentiates us from the animals, right? Is that we. We participate and we produce patterns. We recognize them, and we recognize them at many, many levels. And so one of the things that art does is it gives you a synthetic version of that, right? So it's like you can participate in the pattern of a meeting. And it takes for several hours, and it gets a little off, and it's kind of crazy. But if I can tell you a story, then all the facts are neatly organized. They've been chosen. And in a way that is really in the pattern. And so then when you see that and when you recognize that, then it gives you. It gives you this almost this little religious experience. And music is the same because music is almost pure pattern, right? And so you listen to a Bach fugue, and then you listen to the. To the. Let's say, to the first statement. And then all of a sudden you're like, okay. And then, okay, where's. What's happening? What's going on? And then you feel a little bit lost, and you're not sure where it's going. Then all of a sudden you see the pattern again kind of coming towards you. And then the restatement comes, and you're like, oh, my goodness. Like, this is what. This is what's happening. Right. I'm exaggerating. I mean, some people might have that reaction to Bach. I have a smaller reaction, but it's there. It's like this little kind of recognition of the pattern which is returning. Then you can play with that. Like, you can create longing by bringing you into a mode where the pattern isn't coming back. And you feel this longing and this suffering almost that it's not happening. And you feel lost. Right. But all these things are condensations of what makes us human, you know, and so. So that is what I. That's what I think. That's why art. Because it's such a condensation of the pattern of being, you know, and that's what we strive for. We're being. We're. We're meaning beings. We look for meaning. That's what, that's what. That's what gives us value."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":2496.11,"end":2525.82,"speaker":"Jonathan Peugeot","text":"I love that. I would. We will definitely come back to that. I'm sure. I was going back through a podcast, which I did before, and on one episode, I said that for me, hell will be when the person that I could have been meets the person that I end up as. And I kind of said it tongue in cheek. But I would love to actually ask you, what would hell actually be like? Like, what would it be like?"}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":2526.14,"end":2703.88,"speaker":"Jonathan Pageau","text":"Well, I'm from the Orthodox tradition, and there's a. There's a particular view of hell which is quite. It's not 100%, but it's quite prevalent in the. In the Orthodox tradition. And it's something like hell is. It's similar to what you said, but you could say it's something like. It's the person I think I am, right, which faces God, which faces the infinite. The infinite good, let's say. And so you. Let's say you think you're. This. You're have a certain amount of good in you, and you think you're pretty good, and you think you've got it covered and you think. Or you think you've been pretty sly because you got away with this. He got away with that. And it's like, you know, I. You know, I'm pretty. I'm a pretty shrewd person. And then all of a sudden, you face the infinite good. And this. This facing of the infinite good can cause two reactions in you, right? It can cause you to recognize what's wrong with you. Like, it can cause you to recognize what's off about you, all the things you've hidden, all the thoughts you've had, but you would never admit all the, you know, all the things you did in secret, but that you thought no one noticed, that you did this, all of this stuff that you've done or that you thought or that you've engaged in. All of a sudden it's like it's. You face it to the infinite good. And so either you can leave, let those things go away, and you can drop them, or you hold on to them and you close off. And so that's hell. That's what hell is. And so a good. Like a simple example of hell is you. You do something extremely evil to someone, like something malicious, something really horrible. And then that person answers you by forgiving you completely and just like, opening up their arms and saying, forgive you. I want to be in communion with you again. And then you have two. There's two reactions again. You can have. You can say. You can melt down and you can accept this, and you can. You know, you can see what you've done, and you can enter into this communion, or you can say, screw you. Yeah, right. And it can make you even worse than what you were before because it shows you yourself. And you just clamp down like you grit your teeth. St. Paul talks about this as this idea of having coals shoveled on your head. And so that's what hell is. And so the idea, like C.S. lewis talks about how hell is locked from the inside, right? You hold the key to hell, and it's. And when you are. When you fall into those states, it's you that's holding yourself there because you don't want to give up this stuff that you hold on to, right? These bad habits, these thoughts, these things you've hidden, all these secrets that we keep, all of this. You don't want to let it go. I don't know if that makes sense to you in terms of understanding how love can cause you to burn. Let's say that's a good way to understand it. It's like hell is actually the infinite love of God facing someone who doesn't want it."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":2704.6,"end":2719.88,"speaker":"Jonathan Peugeot","text":"That's really interesting, and I would love to kind of flip that and ask about heaven then. Is heaven utopia or is it something different?"}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":2721.4,"end":2773.61,"speaker":"Jonathan Pageau","text":"Well, heaven is a complicated concept. And so you could say that heaven is the hierarchy of beings itself. It's the hierarchy of values. That's what heaven is. It's the invisible patterns which call us to the good. Right? And so heaven is that which makes you recognize that it's a good apple. And I say it like, not even in a moral sense, but there's also a moral sense, which is that you recognize what is good. Okay? Those patterns that are actually, you could say, extensions of God, we call them the logos, the logos of the world, the logi, the different aspects of God which are upholding reality. That's what heaven is. But the human person is. The idea that we go to heaven is a really distorted idea about how this works. All of this works. The idea is that we're actually meant to embody heaven."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":2773.93,"end":2774.41,"speaker":"Jonathan Peugeot","text":"Yes."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":2774.57,"end":2849.99,"speaker":"Jonathan Pageau","text":"Right. So it's not the idea that we go to heaven and. Although you could say that in a colloquial way, but the idea is rather that we're meant to embody heaven. That is, we're meant to in manifest form, you know, manifest these higher things, right? So embody these higher values. And those are virtues, right? Those are. When you become virtuous, you are going to heaven or you're ascending the mountain is a way to understand it. You're actually ascending the mountain of being. And then you come to a place where you meet God and you have an epiphany where. Where all of a sudden the being, you know, the. The infinite of God manifests itself to you in that place where all the virtues come together, all the hierarchies of beings kind of come together. So that is. Right. That is the spiritual transformation that we're called to engage in. And so that would be what people colloquially talk about going to heaven. But one of the problems, like you said, is that it's so. It's become so vulgar that people think that it's like you die and you. And you go to heaven and. And it's like it doesn't mean anything. It's just. It just. It really has sadly stopped to have meaning. But if you read Dante, if you read anything that is before the. Before the 18th century, then you'll get a good understanding of what that means, like, of what this transformation is."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":2851.27,"end":2866.8,"speaker":"Jonathan Peugeot","text":"I'm learning so much here. I'm learning so much here. One thing that I think that has confused me over the years that I would love to ask you about is God. Is. Would God kind of be like."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":2869.2,"end":2869.52,"speaker":"Jonathan Pageau","text":"An."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":2869.52,"end":2874.96,"speaker":"Jonathan Peugeot","text":"Abstract set of values or would God be a person?"}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":2875.92,"end":2883.44,"speaker":"Jonathan Pageau","text":"So it's. Okay. So the way that Christians understand it is that God is a. Is a. Is a communion of persons."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":2883.85,"end":2884.05,"speaker":"Jonathan Peugeot","text":"Right?"}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":2884.05,"end":2951.67,"speaker":"Jonathan Pageau","text":"Okay. That's what the idea of the Trinity is. Right? And so the idea. So the best way to understand that God is the infinite source of everything, right? That's the first thing to understand is that's what God is. And the second thing to understand is that anything you say about God is always wrong. Everything you say about God is always a compromise. Okay? And this is something that's just completely orthodox. Like, this is not some New Age stuff. This is really what the church fathers taught is that God's being or God's essence or God's beyond being is not actually a being, is beyond being is something that you can't talk about. Okay, but nonetheless is the source of everything, right? The infinite source of everything, which is beyond everything. And so. And it manifests, it reveals itself to us as a communion of persons, as this, this communion of love between beings. And they're not beings in the. Like I always say, like, if you think that when I say, use the word being, it's. It's like the same thing as your car or as, As a, as, as an apple, then, then stop, then God doesn't exist, then I just, I'm totally fine in saying God doesn't exist."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":2951.67,"end":2951.99,"speaker":"Jonathan Peugeot","text":"It."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":2951.99,"end":2956.39,"speaker":"Jonathan Pageau","text":"For you, existing just means the things you can see and touch and quantify, right?"}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":2956.39,"end":2957.23,"speaker":"Jonathan Peugeot","text":"Sure, sure."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":2957.23,"end":3131.41,"speaker":"Jonathan Pageau","text":"But. But let's say God is beyond that level. And so that is how God reveals itself, as a communion of love. And you could say that in Christianity, the infinite itself and the expression of the infinite and the manner in which the infinite expresses itself in the world is all part of God. And so that's what God is, let's say. And knowing that even that is a compromise in language. You can imagine that all of reality leads up to a point where it stops. So think about. Think about any identity, right? And so it's like an apple, right? I can describe all the elements of the apple, but no matter how many elements I describe, at some point I have to stop and jump up and say apple, but I have to jump up. I have to emerge out of this quantity, out of this multiplicity and jump up into a single identity, okay? And so that's. It's like that for every being, every being has that reality, which is that its identity is above its multiplicity, right? It's. It's higher than its multiplicity. So now do that for everything. So that everything. So people like to say things like, I pray to the universe, right? And it's like there's something dishonest about that because what. How do you even. How can you say that the universe is one? Like, what is this unity of the universe? Like, what are you talking about? And so that's why even that has to jump up into something which is beyond to something which is completely beyond all ways of naming, of manifesting anything that you can think of or quantify. And that is what the divine is. That is the infinite source of everything, the ground of being. You could say there are different ways of trying to talk about this. And then for Christians especially, it manifests itself as a communion of love. And then that communion of love helps you understand how things exist in the world. So it's like the fact that you can see that something is one. And you could say. You could go as simple, even an apple. You could say something like, the apple exists through a communion of love. And you'd say, oh, that's a stupid thing to say. But think about it. It's like the elements that make me recognize that something has being. They're all multiple. There's indefinite amount of them, right? A chair is even better. Like there are all these elements of the chair, and then somehow they come together and they join a single purpose, and then they exist as one. And that's what love is. Because it doesn't also destroy the multiplicity. Right? It doesn't. Doesn't stop the chair from being multiple things at the same time. It's still legs and a back, and it's. All those things are still there, but somehow they're able to kind of come together and become one. And that's how the world exists. That's how everything exists, basically."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":3131.73,"end":3166.33,"speaker":"Jonathan Peugeot","text":"I listened to your podcast with Jon Peterson. By this point, I think I just got over a million views. By this point, it's got something crazy. It's crazy really, really resonated with people. One of the things in that conversation which Jordan said was that he acts as if he believes that God exists or something. To those. To those. To that extent, which I may be getting messed up. What do you think about that as a. As a kind of concept? Do you think that that's a reasonable concept?"}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":3166.81,"end":3177.53,"speaker":"Jonathan Pageau","text":"Well, I think the way that I. The way that I tried to phrase it with Jordan is that because he takes it as a moral, like. As a moral imperative."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":3177.8,"end":3178.6,"speaker":"Jonathan Peugeot","text":"Yes, yes."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":3179.48,"end":3267.19,"speaker":"Jonathan Pageau","text":"I act as if God exists, and that's what holds me together morally. But it also is this heavy weight that he carries that is almost unbearable for him. And so the way that I was trying to help him understand is that this has more to do with the way things exist, more than even just morality. And so the first thing that acting as if God exists, demands of you is not a moral code. It's attention. Because that's how the world exists. The world exists through this capacity to. To attend and to recognize unity and recognize phenomena for what they are. So if you attend to God, then that looks like all the things people hate about religion. It's. It's worship, right? It's singing, it's processing, it's facing the same direction. It's being in a group and all saying the same thing at the same time. It's like that's what. That's actually what Acting as if God exists. That's what it looks like. Because like I said, the most important aspect of God is how God becomes the source of how all things exist together. So if we're going to act as if God exists, we have to participate in how things exist together. We have to participate in communion. We have to commune together and exist as bodies and form communions of love, and that's how we will act as if God exists. Um, and that if you do that, it won't even matter. Like, honestly, at that point, will it even matter if you say that you act as if God exists? Like, it become. It all would almost become like a semantic thing."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":3267.19,"end":3267.63,"speaker":"Jonathan Peugeot","text":"Yes."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":3267.63,"end":3286.82,"speaker":"Jonathan Pageau","text":"Because saying that God exists, it's like, I've said it on several podcasts where I have no problem saying that God doesn't exist in the. In the sense of. Exist as a. As a phenomenon in the world. Like, obviously, God is not a phenomena in the world. Right? The God is a super existent, is beyond existence. So even there, it's like, anyways."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":3289.62,"end":3298.82,"speaker":"Jonathan Peugeot","text":"Why do you think that Jordan Peterson has resonated so deeply with Peterson, with people in this era, in this generation?"}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":3300.66,"end":3387.37,"speaker":"Jonathan Pageau","text":"I think that. I think that really the deepest part of that. I think the really deepest part of that is that. Is that he actually cares and people can tell. And I think that that's really at the basis of what's going on, is that he really does care about people and about the world. You have to just see him talk to people. I have been a taxicab. It's hilarious. I've been in a taxicab with him where the guy didn't know who he was yet because he wasn't famous. And the taxicab just started telling him all his story, his whole story. And I was like, like, who does this happen to? And it's like really deep conversation started right away. And there was something about his capacity to show that he cares about what you're going through and empathize. I think that that's at the core of everything. And then he's also acting as a bastion of just normal things against an insane world. Because the things he says, they're like the things your grandfather like or your great grandfather would have told you. Right? It's like, you know, clean your act up. Do, you know, make up your room. You know, get a job, marry someone, found a family. It's like just basic stuff that everybody should think of. But our world is so insane that we don't even recognize the value of that. And so I think that that's really what. That's, let's say, the second reason, I would say, why people have been so attracted to him."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":3388.36,"end":3394.76,"speaker":"Jonathan Peugeot","text":"I love that. And it's so, so good to have the great man back. It's been. It's been. We missed him. We missed."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":3394.76,"end":3400.92,"speaker":"Jonathan Pageau","text":"Yes. Yeah. Well, I'm happy that he's back, too. I hope. I hope his health will hold up and I think that's the biggest. That's the biggest hope."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":3401.24,"end":3405.08,"speaker":"Jonathan Peugeot","text":"Absolutely, man. There's a couple of quick fire ones which, if you've still got time, I'd."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":3405.08,"end":3405.8,"speaker":"Jonathan Pageau","text":"Love to go for it."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":3407.16,"end":3438.53,"speaker":"Jonathan Peugeot","text":"I think that one area which I've been really interested in is AI. Yeah. So one thing which I'm kind of worried about is giving machines the power of, let's say, gods, just to be hyperbolic, let's say we give machines the power of gods without the wisdom of gods. What do you think about this sort of emergence of AI and do you have any worries about it going into the future?"}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":3439.01,"end":3709.31,"speaker":"Jonathan Pageau","text":"I have many worries about going into the future. I think we are going to witness things that we haven't seen in thousands of years. And this is what I think we're going to witness. We're going to witness some pretty crazy phenomena and it's going to get wild because. So let me give you just a little image of how. So it's like in an ancient world, what they would do is they would build a temple and then they would make a statue of a God, right? And then they would, like, dress it up and then they would open its nostrils and the idea would be that they would like, breathe in the spirit of the God into the statue, and then the statue would become the center of the civilization, and civilization would kind of turn around that statue. And so this is what we're doing. We're building a body for a God. And everybody almost, weirdly, almost recognizes that's what we're doing, even if they don't have the words for it. But we can see it appear in fiction. We can see the story kind of emerge in fiction. Whether it's like Marvel's Vision, for example, is a good example of that, where you have an AI that is more virtuous than everybody else. You have different versions of this that are kind of popping up in culture of this idea of an artificial being who is actually your superior. Right? And so this is it. Like you're. This is a. It's a very. So it's a very scary time. It's a very scary time because this infinite powered machine like you said, people will just inevitably start to reverence it. It's already happening. We already reverence it because we view reality through it, right? The first page of Google search defines reality, right? Your Facebook feed, your Twitter feed defines reality already. And so it's already acting like a body for an intelligence. And so there's an interesting, like there's an interesting story that I've been thinking about. I did a video on it recently. In the Revelation, the book of Revelation, there's this image of a beast, of a dragon, right? This dragon that makes a revolution in heaven and casts all the stars to the ground. Like all these cast all the angels to the ground. And then through a different process, there is someone who makes an image of this beast through different proxies, and then it makes the beast speak. And when the beast speaks and everybody worships the beast, but there's someone making it speak, let's say. So this is the danger of AI is that it's never going to really necessarily be general intelligence, or even if it is or not, we won't know. You can't verify someone's general intelligence. Like I can't verify your consciousness. There's no way to do that. And so we'll never be able to verify the consciousness of the machines. But if we act as if they're conscious, that's enough. And then if there's a puppet master behind, then people will just fall in line. And that's what's happening now. The fact that Google and these companies are being taken over by woke ideologies. So they're being taken over by woke ideologies. They're framing our vision of reality and they're telling us that they're objective. They're doing all those three at the same time. So that's a scary moment. Like, that's a scary. That's a scary reality. That really is this problem of like this idol that is being propped up and that everybody's looking to everybody's worshiping and they don't realize that there's a puppet master behind that is actually defining the miracles, let's say that is actually directing the miracles to what it, to what it wants. So I don't have a lot of hope in that, in that direction, especially with what we're seeing now. And, you know, because Donald Trump seems to have, let's say, unleashed something which was already there but wasn't pointed yet. And now it's like as if he showed us what was happening, right? Donald Trump, by his kind of bombus way of Being or whatever exposed what was our already happening, but it. And accelerated it. And it's basically what Jordan Peterson dealt with. Like what happened to Jordan Peterson in 2016 is what's happening to all of us in 2020 and 2021. It's just happening. It just jumped the level to what was happening in the universities and what Jordan was speaking out against has now jumped to national levels and government levels. And so it is the emergence of a God. Like I'm sorry. And the fact that it's coupled with AI is yeah, be scared for your children is all I can say."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":3709.31,"end":3741.58,"speaker":"Jonathan Peugeot","text":"You know. Yes, yes. I don't have children at the moment. I haven't been praying to the sex God. So I, so I would love to kind of finish this sort of segment. And one thing which I would love to give thoughts on that's been a real kind of emergence in recent observe. Perhaps they've been around for a long time, I'm not too sure, but psychedelics, they've sort of come to the fore. What are your thoughts on psychedelics?"}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":3742.62,"end":3900.85,"speaker":"Jonathan Pageau","text":"Well, I've never, I've never done psychedelics and so I don't, I don't have a first person experience of them. I'm a little worried about psychedelics, I'll be honest with you. Like I've had. Because some people that are coming to me, let's say to my videos into my world are coming from Jordan Peterson, who is, who is a proponent of psychedelics to a certain extent. Not, maybe not like a just all out proponent, but he's definitely talking about it. And I've seen some people like lose it, to be honest. Like I've seen, I've seen. I was in contact with one person who, who while he was in discussion with me and was involved in the discussion went to, to. To. To do ayahuasca and some weird New age thing in South America. And a few months later when Covid hit and last time I talked to him, he's like, he had been, hadn't been home in three days. He was in a panic, he was like freaking out. And I haven't heard from him since. And so I think that if psychedelics has value, I think that in a world of scientists that don't understand the world of values, it's like the worst thing ever because it's like if and. But you have no mechanism of discerning what is above and what is below. Like you can't tell the difference between an angel and a demon. But all of a sudden you're like this scientific type person who's thrust in a world of angels and demons. I don't see that really as being a good thing. Like, I feel like people will be unable to discern what they encounter because they've lost the wisdom that maybe, I don't know, and because I don't know enough about psychedelics, but maybe, maybe in a world that has wisdom and has a teaching about hierarchies of beings and hierarchies of values and the capacity to differentiate, just differentiate light from dark, let's say that it might have not have been as dangerous as it is for us now. And there's a reason why psychedelics are part of the reason why we're here. Psychedelics in the 60s are part of the reason why everything's breaking down right now. And this kind of psychedelic revolution where people had these experiences and had no means of understanding what was happening and then, then started to destroy the hierarchies in the world, just started to like, attack any form of structure, any form of, of, of societal norm. All of this was all bad because, you know, Freedom man and whatever all the hippies were, were experimenting. And so it's like, I'm not so sure that all of a sudden bringing them back now is not going to do something similar. Like, I don't, I. It's just gonna. Because it's just gonna accelerate the, the chaos. To me, it seems at least it's."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":3900.85,"end":3922.78,"speaker":"Jonathan Peugeot","text":"Definitely gonna open up Pandora's box. You know, I, I would, I would love to kind of tie everything off that we've spoken about today. You know, it seems like we are in a very precarious position societally, globally. How do we heal a broken society? What can the individual do?"}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":3923.42,"end":3992.29,"speaker":"Jonathan Pageau","text":"This is where I agree with Jordan Peterson. Like, this is where I really agree with him and his, his solution is to become a saint. Like, and this has been. The traditional Christian solution is to, to work on yourself first, right? To transform yourself, transform your. What you can touch, like what's immediate around you and you know, become a better person, become a better father, become a better mother, become a better husband, become a better whatever it is that you are right, whatever it is that you're doing. Better friend, all of these, all of these things. And then that will, will start to reverberate around you, you know, and so that's in what we need to do. But I think also reacquainting ourselves with the ancient stories and trying to see them through a lens which makes sense for us today, you know, understanding where we come from what are, like, how we are here, having more on a better understanding of history, which is something it seems the modern world wants to erase from us. Having a better sense of history, a better sense of our stories and how we participated them is definitely, definitely a way to go."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":3993.17,"end":4008.41,"speaker":"Jonathan Peugeot","text":"I love it, man. I love it. My last question for you today, we sign off all our podcasts with. Before I ask you to sign off and tell our audience with it and connect with you, my last question for you today. What makes a life worth living?"}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":4011.45,"end":4087.4,"speaker":"Jonathan Pageau","text":"It's not going to sound inspirational, but I think that a life worth living. Sorry, but what makes a life worth living is understanding the proper hierarchy of values which lead up to the highest. It's like understanding where things are and then seeing all goods at the level that they are. And so one of the things that makes us miserable is that we try to put too much good in things that are relative goods. And so having a nice meal is a good thing, but someone who puts all their life in there, it's going to be disappointed. And there's a hierarchy of that. It's like having it. Being in a relationship with your spouse is a good thing, but even that is a relative good and then ultimately moving towards the higher and higher goods. I think that that's what, that's what makes a life worth living because it gives you, like, a track and a path and you can actually see your progress, right? It's like, oh, when someone used to say that before I get really pissed off and I'd like, lose it. And now it's like, oh, I can kind of hold myself in and I can, I can, you know, I can stay calm. And it's like, oh, wow, that's awesome. And then you. And then you just keep going like that and, you know, move towards something beyond yourself."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":4087.4,"end":4105.4,"speaker":"Jonathan Peugeot","text":"You know, man, I've been a huge fan for a while. I feel like I've learned so, so much today. Please excuse my ignorance on a number of the topics, but I really, really do appreciate you coming on. I feel like you are a force of good, a force of good. So, man, thank you so much for coming on the show."}
{"episode_id":"SW - #174 - 2021-09-09 - The Inevitability of Religion","start":4105.4,"end":4186.02,"speaker":"Jonathan Pageau","text":"Yeah, thanks. I really enjoyed this and I appreciate your. Your capacity to, like, really great questions or insightful questions in the sense that I can tell that you thought about what you were going to ask before you asked it. So I really appreciate that it makes for a good conversation. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course, leaving a review on itunes. Everybody knows that's the best way to to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well, and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
