{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":0.16,"end":59.17,"speaker":"Laura Diaz","text":"Tucson, the weight is over Mediweight loss. They're officially open on North Oracle road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications, you can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweight loss. I got the same medication but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":59.25,"end":216.94,"speaker":"Jonathan Pageau","text":"That's mediweightloss.com the secret is, you know, we have rhetoric, we have politics, we have economy, mathematics. We have all these ways of knowing and of seeing and we have science. But art is actually underneath it all. There's the making of space, that is architecture. There's the making of the story and the making of the image. And those three, they are the secret binding for everything else, that everything else exists within that world. And it's like almost like a esoteric secret that is that if you can control the story, not control, if you can tell the story, then you're actually changing the way people see and think about the world before they have any opinion. This is John Jonathan Pedro. Welcome to the symbolic world. About a month and a half ago I went to Ralston College where we had a wonderful roundtable discussion about meaning, about art, about the future of culture. And in that time I had an amazing discussion with Greg Hurwitz. As you know, Greg Hurwitz is a best selling author, but he's also become a friend of mine and we've started to collaborate on some interesting projects. So in this discussion we talk about what it means to be an artist in our different spheres, what it means to work together and also giving advice to young people who are trying to figure out what they want to do now. And you know, I also wanted to tell people that Ralston College is such an amazing place if you are young and you are kind of trying to figure out what to do, they offer some amazing opportunities, also offer great scholarships. You can go there for a year, you can learn Greek in ways that is just astounding. And you can also get a really powerful general culture with some of the most amazing professors. And so I would suggest that you look into it. In theory, the date is already passed to sign up for Ralston, but they told me that for very high quality people they would be willing to reconsider. And so now's the time to take a chance if you're interested in preserving our culture and our civilization. And so in the meantime, please enjoy this conversation with Greg Hurwitz."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":217.9,"end":266.05,"speaker":"Lydia","text":"Welcome everybody. This is a conversation with Jonathan Pageau and Greg Hurwitz, who we are very excited to have here with us at Ralston College. We, we have been holding career and life conversations for the last couple of terms here at Ralston in the effort to connect students with opportunities that they might be interested in pursuing post studying at Ralston. The humanities education is ideally preparation for a beautiful life story, a well lived life and in many directions that can take us. We have had many experts and guests who are here to tell us what they've done with their humanistic pursuits. So with that I would love to introduce President Dr. Steven Blackwood to introduce us to our guests."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":267.49,"end":453.31,"speaker":"Stephen Blackwood","text":"It's such a great pleasure to be able to participate in these seminars which I think, as Lydia just said, so well. There's a lot of questions that people who study the liberal arts and humanities often get cynical or skeptical or at least somewhat ignorant or unknowing ones. They read something like what are you going to do with that? And it's often not a mean spirited question because after all, we all find a way through life and of course put a roof over our heads and all that kind of necessary stuff. But at the end of the day I think we can argue very powerfully that there's actually nothing more useful than that which enables you to live the one life you have in a way that you can make it count that to you it is meaningful. And so these career life conversations on Fridays, which are for those listening who may follow us online entirely offload towards students are really part of helping us think about how we navigate life. In the classroom we're often reading Aristotle or Dante, we're parsing our Greek and all that kind of stuff. And all those things of course redound and resound in all kinds of ways in our lives. But in the classroom we're not necessarily asking the question about, well, how do I get a job? Or how do I present myself to the world? Or how do I think about relationships in the healthiest, most positive and important way? How do I navigate my way through questions of religion and all those kinds of things? These career life conversations are meant to be an opportunity to blow it open and ask anything that's you as a human being at this point in time. The questions that you're asking that you can ask those. It really is for me, just an enormous pleasure to have Greg Hurwitz and Jonathan Pageau here. They are friends of the college. They've both been here multiple times before. They both addressed our students to great acclaim and much adored in the past a number of times. They're also friends of each other. And one of the reasons I was. It may not be the most obvious thing to bring an acclaimed writer and thriller novelist and comic book writer and screenwriter and all the things Greg has been together with this champion of the world of symbolism and theology. And yet at the same time, they are in such powerful ways as I think their friendship attacks thinking about the same or similar questions and the stakes thereof. So with that said, I'm just going to. What I thought would be the most fun would just be to let the two of them engage in a conversation with all of you. Of course, we have formally entitled this why We Tell Stories. I think that is the formal title of this session, though we don't have to say confined to that already limitless question. We can go in any other directions, but you should feel free at any moment to jump in with the question that you'd most like to ask one or the other of both of these. Let's do it."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":459.79,"end":497.96,"speaker":"Jonathan Pageau","text":"How do we start? I'm thinking one of the things we could talk about and this could be a question even to find out, is I have to agree the way Stephen presented it. In some ways, my friendship with Greg is a very surprising thing that's happened in the past few years. It's so surprising that even my wife at the beginning was like, why does this guy like you? Like, what is it like? It doesn't make sense that this Hollywood, you know, kind of successful writer, why does he want to be friends with you? It doesn't make any sense. She's like, he must be some kind of CIA agent or something, like the idea or something. And so maybe we could ask. The question I would ask is, why do we like each other? Like, what is it about?"}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":498.92,"end":500.76,"speaker":"Greg Hurwitz","text":"I can start because you go first."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":500.84,"end":573.19,"speaker":"Jonathan Pageau","text":"You Go first. And so I think that, you know, at first for me, Greg, he was involved in a lot of things that I was really interested as a teenager. Like when I was young, he was writing comics. He was kind of in that world, the world that I had kind of set aside for a long time, but that he was deeply involved. And I was so curious to find out about this guy. Like he's writing Batman. Like that was like my childhood hero. That's how it started. But then I quickly realized that he had like a natural insight about. Exactly, about storytelling. And because of that, a kind of natural insight about human nature that really woke me up. So he has, you hear him talking about, even he perceives. You guys don't know, but he's watching all of you. He can kind of perceive things in very subtle ways. And that insight to me was really refreshing. And for me at least it started there. And then just spending time together at some point, realizing that we're in such different camps, but for some reason there are these places where it bridges. Some of it is storytelling, some of it I think is just a kind of intuition. And so that would be the beginning of that. I don't know what your insight on that is."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":574.07,"end":683.67,"speaker":"Greg Hurwitz","text":"Well, thank you, that's very kind. I mean, it's a little bit awkward now for me to confess that I actually am a CIA agent. My interest in you is being part of the Christian nationalist movement. There you go. Look for me, I think. Hello, friends. This is Richard Rowland and I am inviting you to join me for my new Symbolic world course, Tolkien and Universal History. In this course, we're going to go over the deep mythological and universal history roots of Tolkien's legendarium and see how Tolkien sort of shows us a blueprint for reclaiming a legendary, mythical Christian framework for storytelling. And in fact, we're going to even do some storytelling of our own. This is a five week course, starts on March 3rd. We had to postpone it a week, which means there's a little more time for you to sign up and I hope to see you there. I'm very much governed by the instinct for what is maximally curious and shiny and engaging for me. So everything I did like undergraduate, I studied English and psychology. Like, I only went into arenas that were maximally compelling. And the same thing for me is true for friendships. And friendships are a kind of attraction. And I think that the first level that I connected with you is you're a true artist. And even if your art is something that in some ways seems on an opposite Pole of what I do. Like, you're doing, like, these beautiful carvings that are. That the symbology is foremost. And they're iconic and archetypal and deeply resonant from symbol down. And, you know, when I'm writing, I'm writing. Everything has to grow up from specifics. I can't write a novel that's good if I think I'm writing a novel about the triumph of the human spirit."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":683.67,"end":684.23,"speaker":"Jonathan Pageau","text":"Yeah, yeah."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":684.31,"end":844.04,"speaker":"Greg Hurwitz","text":"Everything I think about is what's a line of dialogue, what's an action scene? What's a way that some little detail is illuminating about character? Is there somebody on the subway across from my character who, you know, has a worn pair of black loafers filled in with magic marker? Cause they can't afford to buy new shoes? Like, what are. It all comes from the specifics and the details. And I'm much more geared towards words. And you're obviously geared. You're immensely, immensely visual. And so the first thing was, in my conversations with you, it was just evident that there was nothing about you that was dogmatic or propagandistic or rigidly ossified ideological. You're sort of a living, breathing embodiment of what it is to be an artist. And that is suffused with your work and your belief system. And I didn't really have Orthodoxy. I'm from a very. Let's just say, a much more liberal, secular Jewish background. Initially, my parents sent me to Jesuit high school. So I have a lot of affinity for Catholics. I have a lot of friends who are evangelicals. But I didn't know a lot about the Orthodox Church. And so I was captivated by you. Like, meeting you is sort of like, you know, it's like winning the lottery the first time you buy a ticket in terms of a point of ingress for that field. Because there's so much in it that is. It's such a muscular belief system. And there's so much darkness that's incorporated, and there's so much nuance and there's so much texture. I think the way that. That informs your thinking and your grounding and then your art and the reasons why you do things is very, very solid. And I think that solidity is something that, you know, we talk all the time and overuse the word fractal. But it's true. Like, you have. Your artistic integrity is aligned by dint of what you do with your belief in your faith and your character. And in a lot of ways, if all people are hypocritical in certain regards, because we're humans. You have the least aspect of that in your Persona and your dealings. And so I always say so. Jordan Peterson, I go back quite a long way. He was my thesis advisor when I was an undergraduate. So I've known him a very long time. But I've said to him before, I say, pageau is a holy person. It's so annoying, you know, and when there's arguments or disputes, there's just a real solidity. And I think in a lot of ways, I'm more exploratory. And you're very grounded in what you think, and everything's really bolted down to the earth. And so, you know, we've been working on a project together recently, and it's been. That's been captivating to work on a narrative project, because it's sort of like meeting in the middle from these two sides."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":844.04,"end":914.82,"speaker":"Jonathan Pageau","text":"Yeah. Yeah. I mean, that's what's so fascinating, too, is that. So Greg and I. I think it was last year. I don't remember how the idea started. We kind of had this idea that we could. Because I think. I really believe that nobody has been able to create a narrative version of Genesis. Like, no one has ever been able to do it. It's always extremely cringy and tacky. And you see two naked people in a garden, and you're just like, what is this? This is not possible. And so we kind of gave ourselves this challenge to dramatize Genesis, and we started just exchanging and working together. And I was really surprised. I was curious to see how that would go. But it's as if it just went as well as you could imagine. Like, everything just kind of flowed together. And when we finally were sitting in the same room, everything was just coming together in ways that was just. Was astounding. And I think we cracked it. Like, I think we actually were able to do it to tell the story of the Fall and of creation and of all of this in a way that is actually narratively compelling. And I think it has to do. It does have to do in some ways, like, in that. Because the way that Greg writes, he would be like. He has this thing he does with his hands. He's, like, reaching. He's, like, grasping."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":914.82,"end":915.22,"speaker":"Greg Hurwitz","text":"I do."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":915.22,"end":922.78,"speaker":"Jonathan Pageau","text":"Yeah, you do this thing. Like. Like, you're, like, grasping. You're like. And then. And then you have this, like, image here. Like. Like a finger with paint."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":922.78,"end":923.46,"speaker":"Greg Hurwitz","text":"Do you remember that?"}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":923.54,"end":960.94,"speaker":"Jonathan Pageau","text":"He's like. He sees this image, and it's like, where is this coming from? Like, what is this? And then he kind of he kind of scratching at it. And then when it comes together, you're like, oh yeah, that makes total sense. But it's like you're really coming at it from the ground up in that sense. Like I. It's true that I'm more top down. I see the structure and I'm like, this is how it should be. But that is also. Can be kind of cold, right. In terms of if you want to have something that's narratively compelling and you have like this kind of almost like really think you're imagining dirt and the leaves hitting their legs and you have this kind of really ground up approach."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":961.5,"end":1225.82,"speaker":"Greg Hurwitz","text":"Well, yeah, I mean, part of what we want to do is really show this. Tell the story in a way that's humanizing. Tell the story in a way that's psychological. So what's it really like if you've never felt pain the first time you feel pain? Like, how angry is Adam at Eve given his sort of cringy blame of her for being the cause of his downfall? The first night that they're alone? What happens the first time she offers him an apple in the fallen world? What happens the first time you see your own blood if you've never seen blood? And how does that. Insurmountable trauma. It's like one of the greatest traumas that's imaginable. Right. How do you tell that as a story of intergenerational trauma that gets passed on to Cain and Abel. Right. And then Seth and then. And then there's a flow for how this moves. That if it's in the psychological, then we feel like we're on narrative pacing and narrative footing. And I think part of this is when I talked about you being an artist is sort of one of the first things that I was drawn to. This kind of collaboration wouldn't work if there was ideology or dogma or ego where best idea doesn't win. Right. Or all those things. Or if you're things are really graspy. I've had a couple movies made and some tv. And one of the things that you realize is that production, when you get to production or creative collaboration, it's like a marriage. It's either getting better or worse. It's never stable. And if you have the right tempo and you set the right value structure, which is the best idea wins. And the project is elevated above individual needs or ego. The actors who always pull you up, like, I just think I need some more lines here. And like you're servicing their ego all the time. If you get those Alignments correct. What happens is it can elevate exponentially. Everything feels like a double trampoline bounce of creative exaltation. And when it goes wrong, you know, and you're the screenwriter, then all of a sudden you feel like you're the drunk asshole behind a bar at four in the morning with, like a broken bottle fending people off to protect your script. That's like going to shit. And there's no. There's no. It's going one way or the other. And I feel like there was this alignment we had where there's not a lot of jousting and other stuff. That's the noise, right? So I have these images and there's sometimes where Jonathan would be like, no, that doesn't work at all. Like, that's completely sacrilegious and we'll offend everyone in the Orthodox Church. I'm like, okay, sorry, we'll just leave that out. But, you know, but there's a. There's a working within it where you want to grab the thing and have it kind of shine and so. And so that interplay where there's not a fence, there's only sort of artistic integrity being brought to this. That's what you're sort of looking for. And in a way, it's a microcosm of what you want in your lives. As you pursue whatever fields you pursue, whatever relationships you pursue, whatever careers you pursue, you want to be pursuing the thing that seats you most fully in your discipline, in your art, in your craft. And those crafts have different sets of ethics that have to hold above all else. You know, one of the things we've seen is this subversion to individual ethic, to the political, where it's like, I'm not a church, I'm really pro politics. I'm not a school. I'm really ideological, right? I'm not a writer who entertains. I need to create propaganda. And you have to adhere to the ethic of the individual crafts that you're doing. And that's a meeting place. And so that's something that you learn and uphold. And then that will inform anything that you dig into. All the Way contains the whole secret of the universe. Like anything that you apply to. You can be a jeweler, you can be a veterinarian, you can be a computer scientist, you can be an artist, you can be a teacher. If you give your full, devoted focus to something and you go all the way down and you watch what it's reaching, it contains the same information, right? And then I think part of the aim is, do you embody or go close towards the top of one dominance hierarchy of achievement and meaning? Right. And then if you get another, all of a sudden you start to have almost like a pattern recognition that seems preternatural, that you can anticipate things ahead and then you can add more things along the way. And I think that if our meeting place is from a place that's artistically pure, it also means you're very rounded and lined out and squared away in your overall belief system and your understanding of your place in the world. And so we can create together then, because you're not bringing in a bunch of friction and static from other things that you have a need to feed?"}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":1225.9,"end":1323.69,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah, that's it. I think you've brought a lot of interesting insights. You know, one of the things that I realized while you were speaking is when you're doing the, when you're doing the right thing, there always has to be the right balance of difficult and easy in the sense that when something is so how can I say this? Like, when something. I, I, I imagine this is something you, you're going through. Because learning Greek is obviously not easy, but there's a sense in which you're putting in effort, but there's also a flow, like a natural flow that you fall into and it carries you through. And what you end up with is like, joy. You end up with joy and more energy and, and more possibility. And I think that a lot of that has to do with disposition, like what you're saying. Basically, you just have to be disposed in the right way, and you have to be attentive to what's happening. And so I think that that's also one of the things that was happening with us. And so we're coming from two completely different, completely different worlds, but we are attentive to the other person, attentive to what's happening, kind of open to, like you said, not holding on to ego, not trying to, not trying to make sure that this one thing fits in. And then we work through it. And it's almost like you're just going downstream almost. It's just kind of carrying you through. And I think that all the things that I've been involved in that have been successful have been like that, where it's hard. Maybe you're poor, maybe you still struggle. You're trying to make things fit together, but there's something that's just carrying you, and it's, and it has, and it produces more joy at the end, even though it's difficult."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":1323.69,"end":1376.91,"speaker":"Greg Hurwitz","text":"You know, we talked about this a little bit last night. I don't know any writers who are successful, whether it's novelists or screenwriters, where the writing isn't a compulsion. It's almost like it's a good illness. Right. And part of what you're striving for in your varied endeavors is to figure out the thing that you're compelled to do, to figure out the thing that. And you get. And it doesn't mean that it's always this way, and it's magical and the heavens open up and the muse is, you know, bleeding on a trumpet. But for the most part, when you're doing what you're meant to do, you want to feel compelled. And when I'm writing well, it's harder for me to not write than to write. And whatever that thing is for you, that's the daemon that you want to pursue and find, follow. You want to follow a source of a compulsion that you have to do something and that you have to know more about it and you have to get better at it. And that's true in any field."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":1377.23,"end":1413.84,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah, yeah, yeah. The. The. The craftsman, you know, there's a saying that you can't pull the craftsman away from his craft. Like, it's actually difficult, you know, because the, the person. Like, when I'm. I'm not carving a lot of icons now, but when I was carving icons, you know, it's like, you know, it's five o' clock and I need to go back. I need to go back to my family. But just. Just another 10. Just another. Just another. And. And you just. You're just like, you know, this is opening up and this is doing that. And. And it's like that feeling is. Is obviously you do have to stop and go, you know, and do the other things, but that sense of like, no, you're just being carried is really important."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":1413.92,"end":1419.12,"speaker":"Greg Hurwitz","text":"My wife and daughter have something. When I say it'll be 10 minutes, they'll go, your 10 minutes or my 10 minutes?"}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":1419.12,"end":1419.6,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":1419.84,"end":1595.22,"speaker":"Greg Hurwitz","text":"With work. Yeah, it's really interesting as you're trying to kind of figure out your way to. That you can see which things shine and which things call to you. I mean, the. One of the things that I think is very important and it's highly relevant to Ralston. None of you are getting degrees. Like, you'd all be way better off going to community college and getting a degree in graphic design. If you're worried about employment, right? Or immediate, easy employment after a degree. But one of the things that you're doing is you're not being trained for that. You're being trained for being artists and entrepreneurs and philosophers and leaders and soldiers and innovators. And there's such a temptation. When I go on book tour, I have a lot of people come up to me and say, yeah, I really want to be a novel. Novelist. You know, I want to be a novelist. But, you know, who could do that with money? I had to make a living, right? So I've been an accountant for, you know, 30 years. But I'm going to retire, and then, you know, then I'm going to really do it because I had a family. And how are you supposed to do it? And I always think like you. How do you exist in the world? That you have a notion that all of your enthusiasm and all of the youthful drive that you have early, you can just pause that and do something else for. For 30 years and then just pick it up again as if you haven't been altered. And so part of what's happening with you, and there's an environment around Ralston that is truly, I think, magical. There's an environment here. There's a quality of people here. We were sitting down, and I said to Jonathan, I said, everyone, the Ralston student is so incredibly varied, but there's a sort of look still, right? For this is the third class that I've met that or the. You just see there's, like an energy around it, and part of it is you have to be the keeper of that, you know, I still remember the guy in a bar my senior year. The Bow and Arrow was like the local kind of shitty bar at my college. And he was back for graduate week. He said, you know, what do you want to do when you graduate? You know, I said, oh, what I really want to do is be a novelist. Well, keep your day job, right? There's so much of this sneering. You'll join me in the real world soon enough, you know, and part of it is you want to shelter the enthusiasm that you have right now, like a pilot light. You want to shelter that and you want to hold it. And you don't want to worry too much about. If you put your faith in pursuing the thing that's of interest to you, obviously you're here, so you're exceptional in a bunch of ways that don't make a whole lot of sense, probably because that's the selection process, and you want to be able to shelter that as you move and continue to grow. That. And not take measures that are expedient and say, well, you know, but I need. And that doesn't mean you don't live in the real world. You don't have to figure it out. You don't need to pay rent. You don't need to get jobs and take care of who you need to take care of and see your responsibilities. But that thing is so important. It's the most important thing that you can do is to shelter that."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":1595.22,"end":1679.53,"speaker":"Jonathan Pageau","text":"Yeah, I totally agree. The truth is, I probably shouldn't say this, but the truth is that our world right now is the best. Best world possible in which to be poor. It's actually like, it's not that. It's not that bad to be poor because there's everything is there to. To prevent you from starving, which is pretty much all you need. You just need to not starve and make sure that, like, that you don't have rain falling on your head. If you can figure that out, then. Then the world is. The world is open, you know, and every time someone asks me about becoming an artist, that's one of the first questions I ask them is like, are you willing to be poor? And that doesn't mean that you will be, but it. You have to be willing to, and that's okay. And it's hard because there's pressure. Like, there's pressure from your family. There's pressure all. All around, you know, people saying, well, you're not being responsible. You're not doing the right thing. Forget that. Like, actually, you just have to. You have to ignore that. If you're healthy, you know, somewhat healthy, and you're eating and you're staying, you have a roof. At least when you're, like, in your 20s, you're good. That's good to go. And you have the time now and the space to develop the big questions that you have. Because that for some people, it doesn't. But for a lot of people, as you get older, that space runs out. Like, it runs out. The capacity to ask the big question just kind of gets taken up by the worries of the world."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":1681.05,"end":1684.33,"speaker":"Greg Hurwitz","text":"Unless you feed it. You have to practice it, or it atrophies."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":1684.33,"end":1749.77,"speaker":"Jonathan Pageau","text":"Yeah. And like you said, I meet people all the time that are exactly the way that you said. They come up to you and they said, I. When I was in my 20s, I wanted to be an artist, but now I'm so and so. And there's this, like, gray in their eyes, like a drab thing. And I keep thinking, well, why didn't you Just do it. Like what? Well, you know, you got to pay the bills. You got to do that. I would say I don't know, but I think Greg is right in seeing that the fact that you're even here shows that you already understand some of that, you know? And the thing. The weirdest thing about it is all the people that. All the people that will criticize you, and I've experienced this myself. All the people that criticized my family when we were, like, dirt poor with three kids, like, just barely making it, you know, they forgot that now. They forgot that that's how they saw me now. And now they're just like, oh, wow, it's so great. You know, you're successful is like, yeah. But you, you know, you were totally like family, even though you're totally judging us and. And having this kind of disdain towards us. And now you're like this. It's kind of funny. So it's like, don't worry about that stuff. Not too. Yeah, it's not worth it."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":1752.17,"end":1767.03,"speaker":"Lydia","text":"Can I jump in and ask a question? Why do you two think you feel compelled to create stories, whether that's through imagery or words? What is it, if you could put a word to it that defines or describes that compulsion?"}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":1769.03,"end":1774.63,"speaker":"Greg Hurwitz","text":"Well, for me, part of it is a novel's the only time I get to speak for 400 pages without being interrupted."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":1778.15,"end":1779.83,"speaker":"Stephen Blackwood","text":"I'm pretty close the rest of the time."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":1782.39,"end":1899.9,"speaker":"Greg Hurwitz","text":"Pot, kettle. You know, I think it's weird. For me, it's almost like, you know, for those of you who have a habit of working out, you know, when you don't work out, you just feel all plugged up and not right in the world. If I'm not writing, if I don't write properly, rough draft writing, I don't feel good. It's almost like it's like the sun to a plant. It's just a huge part of how I express myself. And I always wrote. I mean, when I was a kid, I loved reading. My parents didn't let me watch television, and I read the. The entire young adult section of our library. By fifth grade, I was reading Stephen King, and I thought, anybody who loves stories. My sister is a fanatical reader. I thought anybody who loves stories would want to write stories. I just thought because, you know, we're in our own little world, we're looking at through our own weird kaleidoscope. And I was like, if you love stories, why wouldn't you want to write stories? Isn't that the coolest thing anyone could ever do? I remember Asking my sister, who's now a clinical professor of pediatric gastroenterology, like, when are you going to start your book? When she was in seventh grade, she's like, I don't want to write. I just like reading them. There's things that we like. So it's so weird. It's so integral to who I am and how I function and how I see the world and how I think. I think in stories, I think in words. I've even had really weird dreams. When I was deep editing, I had a dream one time that the dream was in Microsoft and I was editing the dream and then I had another dream that was a nightmare that I was walking through and something came. I was walking through a dark house and something came out and scared me. And a jump scare is always like the cheapest thing in movies, right? And so I thought, well, this would actually be a lot scarier if I had suspense first. So I like rewound the dream and had like bloody footprints too, so that the tension mounted so that when the scare happened, I was more scared. So I think I'm just, I'm very hardwired. It's like a calling for me, really."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":1900.94,"end":2049.1,"speaker":"Jonathan Pageau","text":"I think that for me, you know, the secret is this is I really believe this, that we have, you know, we have rhetoric, we have politics, we have economy, mathematics, we have all these ways of knowing and of seeing and we have science. But underneath that there is a. Art is actually underneath it all, which is that story making. There's three, I think there's the making of space, that is architecture. There's the making of the story and the making of the image. And those three, they are the secret binding for everything else. Everything else exists within that world. And it's like almost like an esoteric secret that is that if you can control the story, not control, if you can tell the story, then you're actually changing the way people see and think about the world before they have any opinion. And so that's why fairy tales, that's why I love fairy tales so much. That's why I love the Bible stories. That's why I love myth, because that's what those stories are there to do. And you know, and there's a sense in which in the last few decades, I would say that the story making element of our society has been. Was colonized or was parasitized by ideological strains. And that has an effect like it actually changes the way people see the world. People don't even realize that they're seeing the world through these New stories. And so it's exposing, I hope you can see how important the story is that. Is that how you frame the world in which you live. And now is the time to tell stories again, right? It really is, because everything is shaking and everything is kind of in flux, and we don't know what's going to happen. And it's kind of wild. Anything's possible. But it also means that those that plant the right stories now, they will be the ones giving the directions. And so can we be the ones that tell stories that are true, that aren't captured, that aren't ideological, but are true in the sense that they have the most reality in it? And so I think that's why I'm so fascinated by stories and image making. I can't be an architect, it's too complicated. But the stories and the image making, it's like I just want to be involved because I know that now is the moment."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":2049.34,"end":2178.56,"speaker":"Greg Hurwitz","text":"There's a tendency, when things are moving a certain way, and I think, just to put a label on it, let's call it increasing postmodernism, right? To think that progress is better than not progress, number one. There's a value judgment, but also that the right side of history is always on the side of the way that momentum is going. And obviously we're seeing that in a lot of cases where that's gone too far into a kind of insanity. And when I think about the way that storytelling has changed, it ripples throughout all of the professions, across everything. So you think just 20th century. So you have the Sound and the Fury by Faulkner, right? Which is one story that's told from four perspectives. One of them is a retarded brother. There's different siblings in one family. You have Rashomon, right, Which is the movie, Kurosawa movie, where it's one story told from four perspectives. You have Cubism, right? What's a nude look like descending a staircase? It's an image of a woman. Woman in 16 different dimensions all at once. You have theory of relativity, where all of a sudden science starts asking those questions. Even in psychology, you have a shift in perspective of Freud sitting, smoking his pipe while the patient lays and stares up at his own, you know, the abyss of his own unconscious, versus Rogers, who sits someone up and looks them in the eye. There's a perspective shift that happens. And all those things are very interesting and compelling. They're movements towards examining and exploring different modes of perception, right? And obviously, theologically, you can talk about all the ways that happen, but when they Go too far. What happens is the form begins to elevate over the function, right? So all of a sudden it's. What's the most fragmented something can be? What's the most diabolical, disintegrated into parts, right? Then you get Dada as poetry. You get urinals hanging on walls of museums as works of art, right? You get the thing that's sort of absurd and it becomes an intellectual exercise that's focused around it. And I think that that pendulum swing has gone far enough into this direction that's so sort of intellectually masturbatory that now there's going to be a time for a resetting and a bringing together again of form and function in a way that the form has to suit it."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":2178.56,"end":2179,"speaker":"Stephen Blackwood","text":"It's."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":2179,"end":2199.37,"speaker":"Greg Hurwitz","text":"Something can be a really cool trick. Once we were talking about Pawlak last night by Jackson Pollack. Something can be amazing if somebody does it once or innovative or new. But if you keep moving in that direction, what you have is a complete shattered mosaic of different impulses, all of which are individual cries of self expression."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":2199.37,"end":2199.73,"speaker":"Stephen Blackwood","text":"Yeah."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":2199.73,"end":2285.18,"speaker":"Jonathan Pageau","text":"And there's also, if you think about how. So let's say you have a story, right? You have the identity of something that's encompassed in an image and a story. And there's room in that story, on the edges of it, to question it, to poke at it, right? To create ironic commentary on the story. And it's actually completely coherent. You see that all through history, right? If you think of Ovid's Metamorphosis, like that's what Ovid was doing in the first century, right? He was basically deconstructing his own mythological tradition. And so there's room for all of those things, things within the tradition. But we have limited. We've come to a point, we've also limited the idea of what it is to be a cultured person to that deconstruction, right? And that's obviously runs out. If somebody just runs, it falls into, like, fragmentation and just breaks apart into a million pieces. And now. And there are moments when it's actually time to recast the story, right? To rediscover the center, to kind of come back to what is the shining light that later someone will deconstruct for sure. And so I think that that's the greatness of the moment now is that I think this is possible because in some ways, we now have the fertilizer of the decomposed, you know, cynical narrative in which to plant a seed of authenticity."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":2285.18,"end":2387.13,"speaker":"Greg Hurwitz","text":"There's a lot like Psychopaths and fraudmen will shortcut the process and just pick up, like, I like Jackson Pollock, I'll flick paint on the wall. And we forget. I mean, if you look at Picasso's early work, he's a staggering traditional painter, Right. It's not like he just all of a sudden made a face on a napkin and everyone lost their minds. So there's something about, you know, I wrote my eighth novel is. Has a sort of a bit of a meta element to it that there's a crime writer who gets accused of a crime and he has to write the story of what's happening to him and edit the. The story, which is the investigation that he's solving. But if it was all meta, all it is is a parlor trick, right? It's pick a card. And so in a way, not that there's ever mastery of an art form, but you want to be as close to mastery of what everything is before you take that and you start to twist it and play with it. And I remember when I wrote a very profoundly mediocre rough draft of my first novel. I started very young. I was 19. But when my first agent asked who I eventually did 16 rewrites with before we sold it, but he said, you know, what is it? It's like. Well, it's kind of an action thriller, but it's a parody of an action thriller. And it's a this. And it's like you can't do eight things at once. Like, what section of the bookstore does it go in? Like what? Like accomplish that first. Right. And if you can accomplish something that's within the. And that's part of what you're doing. A lot of what you're doing with this master's program is you want to get an expert grasp of the essentials, and then you want to grow and embody those things. And then you can start to play and innovate within the form. But if you just skip straight to innovation, there's no discipline in that. There's no responsibility. There's no tradition you're standing on to sort of proclaim things to higher heights."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":2387.37,"end":2387.77,"speaker":"Stephen Blackwood","text":"Yeah."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":2387.77,"end":2398.72,"speaker":"Jonathan Pageau","text":"And it ends up becoming flatter and flatter and just more and more shallow as the cynicism increases and as the. The comment upon a comment. You know, because it's more about you."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":2398.88,"end":2403.96,"speaker":"Greg Hurwitz","text":"It's more about your own narcissistic self expression than a tradition that you've embodied."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":2403.96,"end":2495.91,"speaker":"Jonathan Pageau","text":"Yeah. So I think that that's what this is right now is the right time to be doing that. And what's amazing about what Ralston's doing and for you guys is as people are running away, as a lot of the institutions are running away from the foundational stories that have brought us where we are, you'll have like, a jewel that a lot of people don't have. It's like a treasure, really, is what it is, you know, and it's. This is actually the exciting moment of being at the end of something or at the moment when it's kind of falling apart, is. You're like, you know, you're like in Lord of the Rings and. Or some, you know, some fantasy novel where people have forgotten the tales of the kings and. And now everybody. Nobody knows who they are. And someone finds this grimoire, and inside there's like. Like the secret history of their own people. It's like, actually, this is what we're going through right now. Like, you guys have the chance to do that. Nobody, you know, people aren't reading the text that you're reading. They're not going into the tradition anymore. And so you'll have, like. You actually will have like a. A treasure that will illumine and. And you can see it, like, when people hold that treasure, like people who have a good knowledge of history or people that have a good knowledge of literature, it informs their conversation. And when they're speaking, they don't have to reference directly the literature or the history, but everything they say will have an extra weight because even just in their mind, they know that they're standing on something that isn't just 50 years old. That isn't just the last fashionable theory that people are grabbing onto."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":2496.87,"end":2613.83,"speaker":"Greg Hurwitz","text":"There's a moral responsibility in coming out of here to not just live up to your learning, but also to be interesting. That's a moral responsibility, to follow what is engaging to you and to be interesting in the world. Because that's infectious. And that's a really important part of it to think about. Like, this is a. It's a treasure to be able to spend a year the way that you're spending it. It's incredibly rare. And you're going to have something other people. People don't have. And, you know, for. For years, my biggest frustration has been the people who are sort of. What's a phrase, semi educated, right? You have. You have the degree, you have the viewpoints, you have your six sources of expertise, and everything's sort of rigid and ossified, right? You know what you think about everything. And you go to these dinner parties at times, or I used to, where Everything that everybody says you could write for them in advance, you know all of their perspectives, you know what their opinion's gonna be on everything. And we see this increase. It's like watching MSNBC versus Fox News. Like there's never gonna be a startling revelation of incredible nuance of some received wisdom that they're accommodating and assimilating. And there's a complacency within the academic, the prevailing academic world right now, and there's not a living fire in it. And so part of it is when you can wield that as a living thing, you're wielding fire. And there's an incredible amount of power that you're going to have that you can bring to things, and it's going to give you pause when you're approaching something to stop and step back into. What do you really think? What is really going to be the highest and best good or engagement with something? And you can figure out ways to innovate and ways to also. And ways to kind of shatter through a lot of the codified corruption, whether that's intellectual or moral, that's around things, figure out ways to do things differently."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":2616.23,"end":2631.55,"speaker":"Lydia","text":"When the two of you look back on your 20s, what do you think you did? Well, and what do you know now in hindsight, was something to learn from, something to alter course when you were older?"}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":2635.62,"end":2733.73,"speaker":"Jonathan Pageau","text":"I mean, my 20s were a time of massive, massive change. Like just complete 180 change in my, in my life. So it's hard to, to know, you know, how it could have happened for sure. You know, the. I went to art school and I finished, you know, with. I think I was the first in my program, but I was also. It was not where I should have been. And I kind of, I kind of knew that after. Once I was looking back, I was like. It was. There were, there were things showing me that this was not for me. And then at that, at my last evaluation, you know, my. The professor that was in charge of me, she said, this is at the end of my degree, she said. She said, jonathan, don't worry. You're getting all A's. Like, it's, everything's okay. But I just wanted to tell you that you really don't belong here. And she said, really? Why don't you like, go to seminary or something? Like, you don't belong here. And she was absolutely right. I just, I was in my 20s, I was like, cocky, so I was just like, yeah, whatever. But she was absolutely right. And so I would say that that's something, but it's weird because in some ways you end up recuperating it. Because my understanding of postmodernism and my understanding of contemporary art has been extremely useful for me because I know what I'm standing against. Not completely against, but I know what I'm standing against. And then also wanting to incorporate just enough of it into my stance so that I'm breathing. Right. So it's not just this ossified, weird thing that I know I'm just reacting to it and now I'm against it. So. But. But I. Maybe I could have done that without spending, you know, like, four years. Like, maybe that's possible."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":2734.79,"end":3019.1,"speaker":"Greg Hurwitz","text":"Hmm. I mean, I think the one thing I definitely had the. Like, in the NFL, they call it motor, you know, like, I had the work ethic to out, like. Cause I knew that my job, this career, would take a lot of luck. And I think of luck as, you know, a hatch is gonna open in the ceiling of where you are, and you gotta be ready to go through. You gotta be flapping against that ceiling no matter what. And I was. It's all I wanted to do. And it's funny, you talk about being broke. You know, I was. I graduated college and my roommates were going on to be like, I bankers and lawyers and doctors, and everyone was making, you know, like, starting salary $120,000, which sounded like eleventy billion dollars. And I wanted to be a novelist. And so I kind of stalled. I did a year at. I won a fellowship. I did a year at Oxford, you know, masters in Shakespearean tragedy, just to have a very practical degree in case my primary career as a novelist didn't pan out. But I was just working. And I said at the time, if somebody could come up to me and say, we'll write you a check, you could have $2,500 a month for the rest of your life, and you can live in a studio and you can just write full time. I would have taken that deal. Now I'm elated that I didn't at this point, but it's all I wanted to do. And so I think I had the work ethic. And I also had, at some point, for whatever reason. And it's weird. I'm from a family of, you know, doctors and lawyers and sort of traditional professionals. For some reason, I had the awareness to break from everything and risk everything on myself and just say, this is what I'm doing. And even when I finished, I was pretty fortunate. You know, I sold my first book. I was fairly young, but whenever I did a job. It was like, how do I make the most money the quickest so that I can still have 35 hours a week to write? Like, everything was geared around that. And even when I did my first deal, you know, I thought, if I live that aforementioned 2,500amonth, how many months do I have in the bank to keep writing? Because it's all I wanted to do. And if you're a doctor and you have a bad, you know, stretch financially, you don't have to then go be the janitor or take another job, right? But as a writer, if you mismanage that, you lose the time to do the thing that you love and that feeds you. And I'd say, you know, the things that I learned, it's always. It's hard because now I'm. I'm just on the back half of 50. I'm 51. And so there's this awareness of I can look back and have some sadness distinct from regret about the things I didn't know earlier. But without me going through them and bumbling through them, there's no way that I could have integrated to reach the knowledge that I have to then look back at them. So it's a very weird thing to not be grievancy or resentful or remorseful, but to also just look with sadness at some things that I might have missed at earlier stages. And I think some of that was. I probably. Earlier on, it was hard to figure out the balance of how much you go for and grab and reach for and how much when you do that, it recedes. So later in life, I think I figured out a lot more about that, even just an interaction, let's say, with Hollywood. Like, at one point, my book series is called Orphan Ax. And at one point, I'd adapted it in a few huge ways for a few huge movie stars who had lost all their projects. And it was sort of seen about the town. And I remember my manager calling me about four years ago, three years ago, and saying, like, well, the series has been seen. And so for Hollywood, they're not sure, even if it didn't get made for reasons that I lost these stars. But I had these big deals and it would just. It didn't move forward. I said, no problem. Tell everyone it's not for sale. She was like, what? I said, don't just take it off the market completely. I'm not selling it. I know where the series is going. I have a lot of confidence in the track record. And we just pulled it Back, she said, okay. The first inquiries that came in, it was like, no, he's not selling it. And so a year and a half later, we had seven, eight interested parties. We had four studios bidding, and we steered it into the right deal. And there's something in. In not. If you reach for something too much, it recedes. But you need a confidence to not. And figuring out that toggle. I couldn't have done this when I was 24, writing my third novel. Right. Like, you can't do it ahead of time, but that's a balance. That is something that I think it would have been lovely to know how to manage those things with, I think perhaps a little bit more grace and displaying even less need. And I already started with an advantage with that because, you know, I was a full fledged novelist before I joined Hollywood with screenwriting and then TV and then comics. So I never needed it fully. But there is something about this sort of flow of work and letting things go and leaving them open that is, there's a kind of gracefulness that I think I'm only starting to learn over the last years."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":3019.74,"end":3021.02,"speaker":"Jonathan Pageau","text":"Yeah, that makes a lot of sense."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":3022.39,"end":3030.31,"speaker":"Lydia","text":"Let's open up for your questions, guys, and I will give you the mic. Are you ready?"}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":3032.55,"end":3037.35,"speaker":"Greg Hurwitz","text":"Looks like we covered meaning. Meaning in life and career. What has been the experience?"}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":3039.67,"end":3041.27,"speaker":"Jonathan Pageau","text":"Okay, what has been the experience for."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":3041.27,"end":3043.43,"speaker":"Stephen Blackwood","text":"You and your families emerging as more."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":3043.43,"end":3089.87,"speaker":"Jonathan Pageau","text":"Public personalities, and how have you grappled with that? In addition to the responsibility that I feel like you both have and the interest that you have to contribute to human society and the world? Yeah, for me, it's been more recent. Like you, it's been kind of this just kind of progressive move into the public. Me, it's. It is more recent kind of, in some ways, just maybe since COVID Like 2020 is when people really started to start to notice what I'm doing. And it's kind of increasing. I would say it's like a 50, 50. 50. It's a 50, 50 thing. On the one hand, you know, it's great. You know, there's something, you know, my kids, I think my kids are proud of what I'm doing. Like, they like, they. They like their dad. Like, they're proud of their dad. And to me, that's really cool. I love that because you could have teenagers that are really embarrassed of their dad and like, you know, just like."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":3089.87,"end":3090.63,"speaker":"Greg Hurwitz","text":"Want to shy away."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":3090.71,"end":3135.29,"speaker":"Jonathan Pageau","text":"So that has been, for me, like a great joy. But, you know, I also. It's harsh, you know, because you're married and you have kids. And so you're traveling and the perception of the public, you know, your wife knows that. It's like some of it is bullshit, you know, it's like you're also this grumpy. Jonathan wakes up in the morning and doesn't want to talk to me. Or like, you're also like this other thing that is less pleasant than the one that everybody sees. And so I think that sometimes, at least I feel that, you know, like, there can be a bit of an annoyance that everybody would come up to you and like, imagine, like, imagine your. Like, imagine my wife. Someone comes up to me. Wow, Isn't it? How amazing is it to be married to Jonathan Pedro? And she's like, okay, whatever. It's like, Jonathan Pedro, it's like his."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":3135.29,"end":3138.01,"speaker":"Greg Hurwitz","text":"Only friends are CIA people who try to put him in prison."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":3138.41,"end":3151.72,"speaker":"Jonathan Pageau","text":"It's like, if only you knew, you know? So that's been like. That's been one of the downsides. I've been trying to compensate, like, trying to bring them with me as much as I can, to travel with me and to kind of do the things with me. But it's definitely here even more."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":3151.87,"end":3152.51,"speaker":"Greg Hurwitz","text":"More about how many."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":3153.87,"end":3159.31,"speaker":"Jonathan Pageau","text":"But there is definitely a challenging aspect to that because it takes up a lot of space."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":3159.79,"end":3229.55,"speaker":"Greg Hurwitz","text":"Yeah, I'd say for me, I did. You know, it was weird. I had a good amount of success early. Like by 23, 24. I'm very glad that when my career started, like, I mean, I had a website, but it wasn't online. I got to acclimate a little bit more as things progressed. My wife grew up in a. In a Hollywood family in that environment. And so she had, like, her grandmother figure was Lucille Ball, and her first memory is Groucho Marx rocking her. And what's funny is when we met, I was like, oh, I gotta go to this agent. I was still kind of like younger about Hollywood guy. Like, I gotta go to my agent part. And she was like. Like, she was just so. If there was arrogance or vanity or gatekeeping, she just was so. This wasn't the world she grew up in, you know, she was. She grew up going to, like, Sammy Davis Jr. S parties where it was just, like, welcoming and everyone was great and it was all the real side of things. And so I think for her, engaging with me then at a lower level and seeing, like, big, showy agents being great at parties was completely not of interest. And that was. It was amazing for me. I think we're similar in that we both married women who don't care Whatsoever about, like, material stature."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":3229.55,"end":3229.9,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":3230.05,"end":3468.55,"speaker":"Greg Hurwitz","text":"Like, there's like, zero concern. And, you know, initially it was a little annoying because I was like, well, I'm trying to figure it out. And like, this guy invited us over and he's the, you know, president of this stars company and we have to do it. And she was like, if you don't like the person who. And of course, it's. It's all right in hindsight. And in hindsight, like, anything that was too grabby. It's funny, I was at a party and I still, like, going to a premiere or going to, like, parties, like, now and then, but I was with a friend of mine who's a prominent South African actor, and we were looking around and there's some of the same faces I remember from when I was 24 at the parties. Everyone's just older, they're higher up in the studio, they're more famous actors. And we were having a laugh about, like, God, remember going to this where, like, you'd go around and, like, collect business cards and be like, oh, like, we're gonna. And like, nothing ever comes of any of that, you know. And so that was really helpful, I think, for part of the process that I talked about earlier, of learning to not press or not move in and think that you need to do something. And it's so funny. I settled at a younger age into a real relationship within community, among, let's say, Hollywood or publishing or wherever I move, where it's all genuine friendships with quirky, brilliant, creative people. That's all that matters, right? It doesn't. None of it matters in a way that is expedient of this is a useful relationship. And so. And then once you're in that space, it just kind of proliferates out. So I'd say that the more. The older that I get, but my wife had a significant role in that too. The more comfortable that it is in a lot of ways. And in terms of responsibility, in a lot of ways, what's interesting is the responsibility part comes. I think, for me, it's twofold. One of them is, you know, I've written 25 novels, right? I've been at it a while, and I'm the co president of a group called International Thriller Writers, and we have like 6 billion books in print, right? We have Patterson and Grisha. Like, we have everybody as part of this group. And I've been the co president. And so we've been able to take a lot of these steps with relative little effort. I mean, it definitely is effort. And thought, but, like, the amount that we can help people significantly at certain key junctures, when they want to be helped and when they're the right people to help is just unbelievable. And so there is definitely a different responsibility in terms of turning some corner and then recognizing that, like all the people who helped me along the way when I was young and in my 20s and as arrogant as you with your art teacher, you can do that and you can guide, and there's a real joy in that to be able to have that. And the other thing really is, you know, in large part because of my affiliation and close friendship with Jordan, I've been more and more public. And then in a lot of ways I did. I've done some sperunking into the culture to try and first to try and pull the Democrats back from the far left. I've been on. We did Exodus together, Jonathan and I and Stephen, and we did the Gospels on daily wire. There's been a lot of very public facing things. And I think in the face of that, I have felt more respectful responsibility to hold a kind of center and to be truthful, but also very intensely, not to be reactive and become part of a political system or the culture wars or all these things, but to try and to try to be an adult. Like, there's an age you get to where you kind of look around and you go, things are a mess. And like, we're sort of the grownups now, right? How are we going to handle this? Like, and so, so there is some responsibility from that part of it that comes with trying to be. Trying to adhere to a higher set of standards for myself because it's important. And a lot of that has to do with speaking the actual truth as I feel it, but not also overcompensating and becoming angry or screamy or pushy in a way that then allows for resistance."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":3468.55,"end":3582.64,"speaker":"Jonathan Pageau","text":"Yeah, yeah, yeah. I love what you said about also, like, non instrumentality. I think this is something that, that, like, Stephen has really made me think about. Like, I think that naturally I don't tend to. I don't tend to think that way, but. But especially as you become more known or like, more in the public sphere, this, you have to be more aware of that question. It's like, why am I in relationship with this person? And is it just because it's going to, you know, it's going to, like, you find yourself in this weird position where you're like, meeting billionaires, you know, and. And then, then you're like, well, why am I, why am I talking to this person? Is it just because they have a lot of money? Is that the reason why I'm talking to them? Or is there something else? Like is there some interesting conversation? I mean, obviously successful people often are sharp and intelligent and so it's interesting to talk to them, but what's their reason? And so I found myself becoming more sensitive to that and trying to question my relationships in ways and thinking like, why am I pursuing this person? Or why am I, am I engaging with them? And that's definitely been a lesson. And I know Stephen has been great because he's in, in our discussions about these questions. He's always insisting like the, the, the best world always comes from non instrumental. Like if you, if you treat people with a genuine curiosity and you meet people that are genuinely interesting and just engage with them, that in the end what will come out of it will actually be better than if you were trying to figure out, like, how can I, how can I get something or partner with this person to do something? And that's the same thing. Greg and I in some ways became friends. We hadn't, wouldn't have thought at the outset to write something together, but we just started talking and becoming friends and all of a sudden I was like, hey, this makes sense. Maybe let's try this. And then out of that comes something that I think is fruitful because it's not built on, oh, he's got contacts here and let's use his contacts to get this done or whatever."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":3582.72,"end":3591.04,"speaker":"Greg Hurwitz","text":"Yeah, be, beware. The plan that you like, sort of push and manipulate and grasp your way to. Because then you have it."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":3591.04,"end":3591.84,"speaker":"Jonathan Pageau","text":"Yeah, yeah."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":3591.92,"end":3600.56,"speaker":"Greg Hurwitz","text":"And then, you know, people don't necessarily. All the parties in that aren't all rowing the same direction. Yeah, I think you had a. Oh."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":3600.56,"end":3650.27,"speaker":"Lydia","text":"Yes, I have, sorry, I have a question to follow up on that. And it's like you guys are talking about following your own passions and like you, like, it seems like you never intended to be like, like, like, like famous or something or like, like you weren't trying to gain fame. Like, do you wish you, you, like, like do you ever wish you hadn't entered into the public eye or, or become famous? Is it like a blessing or is that a curse or is it something. Yeah."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":3653.87,"end":3655.95,"speaker":"Greg Hurwitz","text":"You only became a icon carver."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":3655.95,"end":3723.12,"speaker":"Jonathan Pageau","text":"To get there because I was right. I was like, if I could, I could just, I can ride this to the top. Like I, I think for sure becoming somewhat famous has been a total surprise. Like nothing that I would never have expected that the decision that I made in life. And I would say, to be honest, in my case, except for the time and the family part, which sometimes is a challenge, like, because I would say on the whole, it's actually been amazing because the things that I do and the things that I care about, I really care about them. And so for me, the possibility of having more of a reach in order to get that out there is like, wow, that is so cool. Like, so amazing. And then also, you know, living my little life in my very secluded way and carving in my workshop is great. But, you know, I. In that context, you know, I didn't get to meet Stephen. Stephen or Greg or Jordan Peterson or all the people that I'm able to meet. And so for me, it's been amazing. Like, it's just been like an adventure where I'm like, oh, you know, I. I'm talking to Russell Brand. Like, why am I talking to Russell Brand? It's the most ridiculous thing in the world. But it was like, there's been these moments where it's like."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":3723.12,"end":3933.67,"speaker":"Greg Hurwitz","text":"With Russell mostly listening to Russell Brand. Exactly. Russell can talk. He gets these, like, reveries. He's amazing. He just so, like, incandescent. I feel a lot the same way. I mean, I. I had some luck younger. I mean, for me, one of the things that's weird is it's indistinguishable. I mean, my natural instincts and aesthetic is quite commercial. I write big thrillers. I write big thriller, you know, screenplays. And so it's indistinguishable for me to have a successful career with me making more money and me having more fame. They're all kind of tied up in each other. I'd say the one thing that's been a blessing that I didn't think about was I didn't have a massively accelerated amount of fame when I was young because if it had hit me in those arrogant 20s, I'm sure I would have been in suffering. You know, there was a lot of getting knocked down along the way and a lot of, like, six books in, and then the publishing, you know, a thing with my publisher and the numbers tank, and I have to reinvent myself and get back up. And so as it's come slowly in different ways, I feel like it's given me a chance to acclimate kind of at each stage in a way where I hope that I'm wielding it with gratitude and responsibility. And as for the reach part, I love that. I mean, it's like, you know, so part of what I was talking about with following things that interest you. I sort of have two rules in my life in general. I never want to do anything that's not fun. Everything has to be fun or an adventure, and my time for things that aren't. I massively compress or delegate as much as I possibly can because it's not like you can do everything that's fun. And obviously this doesn't involve crises and suffering and family. But. And the other thing is I don't. I try and spend as little time possible. And the more that I. The more money I make, the more resources I have and the more fame, such as it is, that I accrue. I don't want to spend any time doing anything that. I want to spend as little time possible doing anything that anyone else can do who's not me. I want to spend all my time doing things that only I can do. And so that sort of influence, that sort of kind of reach that you get, the kind of. Power's a real word, weird word. I don't mean it that way, but let's just say solidity and being able to say, look, I'll do this thing, but I want to do it this way. It'll be more fun and I want to do it with this person. And I'm on a book tour and I think I want to be in conversation with a good friend who's a big prominent New York Times selling writer instead of me getting up and doing a canned speech. And you get to move in the world in different ways. And then the people is the best part. Especially when I've certainly dismissed the like, oh, I just want to be friends with people because they're famous. Like once you're over that. Because. Because famous people can be terrible and they can be great. It's just like billionaires. Yeah, they're. Some are incredibly brilliant and you understand why they've amassed so much. And some are like a giant pain in the ass who are egotistical. Everyone has all that. But if you can choose through your influence and through people's interest in you, good people, and move through the world that way, it's incredible. It's like you're talking about Stephen and me and James Orr and Douglas Headley and Douglas Murray and just the people in the fellowship that we've had, these are extraordinary people and humans, not just intellectually. And so it's been really positive. But again, if I'd hit. If my first book had been on the New York Times bestseller list for two years and I sold the film deal. I probably would be a fairly profound asshole."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":3941.59,"end":3952.82,"speaker":"Jonathan Pageau","text":"I really like what you said about the fire. That seems essential to make anything meaningful. And I think that applies to the creative arts as well as being students or any."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":3952.82,"end":3956.7,"speaker":"Greg Hurwitz","text":"Anything that you're really being yourself in."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":3957.42,"end":3975.5,"speaker":"Jonathan Pageau","text":"So this question has to do with the act of creating as well as maybe being a student. And yeah, you have the fire and then you have. What's the word? Desperation. Maybe this. This feeling of everything will fall apart."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":3975.5,"end":3978.11,"speaker":"Greg Hurwitz","text":"Unless I do this thing. And."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":3979.87,"end":3985.91,"speaker":"Jonathan Pageau","text":"That can come with the deadlines, which is a very practical and helpful thing for us. The weekly essay for you."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":3985.91,"end":3990.47,"speaker":"Greg Hurwitz","text":"Maybe it's what the publisher has given you. So just how do you keep the."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":3990.47,"end":3993.23,"speaker":"Jonathan Pageau","text":"Fire going and not fall into a sense of desperation?"}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":3995.15,"end":4224.8,"speaker":"Greg Hurwitz","text":"Well, a metaphor for this in writing. I always encourage people when they get stuck, right. I don't get writer's block. And part of that is I'll just go. And I always encourage people to just write a vomit draft. Like, just get something down, because you can't fix a blank page. But if you have something, you can make it better. And I've been conditioning that sort of momentum for a really, really long time. And that fire and the desperation can be incredibly useful. Like the times where I've had to have a reinvention in my career and I feel like I'm writing for my life and I'm in a mini version of. Of it now. As Jonathan I've been talking about, like, anytime there's a dislocation, financially or creatively, you know, the Unknown Contains equal parts opportunity and threat. And the first thing you think about, and when you're younger, you think about threat. And it's important to keep orienting towards opportunity and to be aware of that. Get forward motion, get things down. One of the things I decided really early on, and it actually is an option for everybody, even though you're going to laugh at me, probably. But I just decided to do everything way ahead of deadlines to never even have to think about them. And so I wrote my stuff way early in college. I'm a year. I'm a year and a half to two years ahead, usually on my publishing schedule. I just want to be way out ahead. And if that's something you can figure out and you can do nervous laughter, but it opens up basically fun. I mean, I have a book coming out in two weeks. I'm gonna go on a book tour. That's a month and a half. And if I'm behind on delivering the next book, I can't Come here, right, and have this weekend and like, weird shit comes up all the time. Like, I helped write the opening to the last World Cup. That's such a weird thing. But, like, you know, to get a call and go off to, like, Qatar for a week and then do all this research, like, you need room to open. Also be able to understand as things come in that you have the bandwidth to do as. And so a lot of ways it's like, just make headway. A lot of this is your own sort of stress and your own harsh driver. An important thing to do, too. One of the exercises I find really useful when you have the voices of desperation, which can be indistinguishable from voices of anxiety, or for some people, depression, or for some people, bullets, ocd. When they're going, take them out of your head and just sit them on the couch next to you. And then you can really contemplate just how insane you are. And you can think, if you were a friend, if you're like, God, you're always late. Like, you're so useless. Like, if you can really try to remove that voice and think, is that someone I should be taking advice from? Is that advice I would give my own friend? And if you can separate out that voice and then you figure out what. What's an encouraging voice that you would take if you're talking to a friend of yours about getting on stuff earlier or hitting better goals, and it's probably one. And this is hard. This part is not like, I figured this out in college. This is. I still refigure it. But if you can find a voice and inner dialogue for yourself where you're finding the most adult part of yourself to lead the way, so those voices come up. But it's a younger voice in you, right? Maybe that's you being. For me, I was the smallest kid when I started my high school with 1200. I had a real scrappy, like, have to get it harsh, overbearing voice. And you can identify them. And then you pull them all in, you can invite all of that. And then you figure out what's your highest, best advice for you to excel and unfold and expand and shine. And so talking and working with that, like, what's your voice? Is it being an encouraging coach? Is it being a older brother? Is it being a caring mentor? And if you can try and cultivate that in yourself, you'll have something to go through to. And then more and more when you are in the throws of kind of desperation where you're losing your way, at least you'll know that it's temporary and that an adult's going to get there in the morning."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":4226.08,"end":4226.64,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":4229.12,"end":4229.92,"speaker":"Greg Hurwitz","text":"No, here."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":4230,"end":4305.69,"speaker":"Lydia","text":"And then going to go first. Okay, yeah. Thank you so much for being here. I had a question about how to navigate the. The political, because it seems that there's a story. There's always a story, but there's a collective story that it's missing in our institutions of education and our political institutions. And as we were about to graduate and face the world. And I think, like you, you want to remind people of the story, the story of the west, but everything's just so politicized today that it's difficult to separate both. I guess there was some backlash when you both did the gospel series and you're sitting in a table with Dennis Prairie and Bishop Barron and it's some of the Wire, so of course, Ben Shapiro, then his name comes up and it starts to interfere with your image and how the world sees you. But you're just trying to. At the end of the day, you're just trying to remind people of the story of Christ or the story of the west. And it's beautiful. So I'm just wondering if you have any advice on how to stick to the story and how to navigate the political."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":4307.29,"end":4307.85,"speaker":"Jonathan Pageau","text":"Hmm."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":4310.81,"end":4562.92,"speaker":"Greg Hurwitz","text":"If you don't. So one thing which is first is the backlash and the politics, a lot of it isn't real. Like, I don't have. I didn't pay that much attention. I was so busy. I mean, those are a little further afield from my daily career. They're hugely important to me. But I'm not on, like, reading all these comments and everything else. And so we tend to pay a lot of attention to something, as if we have to respond to something. And a lot of times it's like you don't know who it is. You don't know if Twitter is freaking out. You don't know if that's foreign. You know, a bot swarm, if it's foreign people, if it's anonymous people, it's just kind of not real in a way, unless it really comes to your doorstep. And at times it will. And when it does come to your doorstep, if you've insulated yourself from the constant storm and drawing nonsense that basically is fed by, I think, foreign psyops, bad faith players or psychopathic algorithms, if you're aware of that and not becoming of them and engaging with them, when it comes to. To your door in a way that's real, you have more bearing to engage with it. In a way that's transformational and not getting down in the gutter with it and getting screamy about it and handling it with a bit more grace. I mean, the other thing is, is I always come back to like, you know, there was a big period in writing which I think we're thawing out of, but not entirely of having sensitivity readers. And that to me is like completely insane, right? To have some 22 year old graduate of Haverford reading my shit to see what might be offensive through a framework. It's just bonkers. But part of how I handled that wasn't getting up on a soapbox and screaming. I told my editor, I was like, I don't want it and I don't care about this at all. If this is something. They just been involved in a very big case that legal and other stuff. I said, if you need this to cover your ass on your legal side, that's fine, I'll read it. And if there's anything useful in there, as with anything, I'll integrate it. And it turns out one thing was like I used a Spanish phrase slightly wrong. I have a lot of characters who were Mexican in my books and in this book in particular. But the other thing that I did, and you can see where you could get very reactionary. But for this book in particular, what was so funny was one of my close friends is a novelist and nonfiction writer named Luis Orilla. And I think he's our greatest Mexican American living writer. He's incredible. He's shortlisted, I think he won the Pulitzer for Devil's Highway. I mean, he's just like a no shit knockdown writing genius. And so what I had done with this manuscript, a lot of it takes place in Mexico, is I'd given it to him to be like. Is my slang, right? Is this like I have a lot of colorful cursing. And so he'd sort of gone through the book with me and was like, oh, this is a great phrase and you should do this and here's the food they'd be serving. And like, I did all that the way I do research for my guns and ammunition, right? So as a novelist, there's two things you can't do that'll end your career. If you get a gun detail wrong, you're just finished. And if you kill a cat, like the cat, people just come for you and they'll put you in an early grave. But, you know, so. But I do a ton of research, right? I have a hacking expert. If I'm writing about hacking, I have guns I have ammo, I have demolition breaching. And I treated this with a great deal of respect because there was a lot of stuff that was there. I mean, I'm in California, I'm very close with, you know, I have family, friends, community, all of this. But I wanted to get that right. And what was funny was because I didn't have a big political statement around it, I was sort of like, sure, you can have the. This kid, by the way, like arguably our greatest Mexican American living writer, has already been my subject matter expert on this. And so it was just such a sidestep from a position of solidity that it didn't turn into the political because I was doing the things that were based on the ethic of my field. And that is making sure that my writing is of the highest standard and that I'm checking with subject matter experts so that I can have enough verisimilitude to carry the reader across the suspension of disbelief. And so a lot of ways you can avoid it if you're not reactive into it, too, and you can stay the hell out of it as much as you can."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":4563.88,"end":4668.23,"speaker":"Jonathan Pageau","text":"And I think also in terms of politics, I don't touch politics a lot in the stuff that I do, but I think that it's actually totally fine to be concerned by the political, to be involved in the political. The problem is the partisan politics, because partisan politics is just basically team blue, team red, like, it's just my team. There's no substance to it. And I think the thing that has been interesting and in this space, there is a kind of space where hopefully there are people that are able to talk about politics, still have a side. I think it's okay to have a side in a conflict, but also be willing to understand what the argument is, what it actually is, and to represent it honestly and to be able to listen to the opposition, because the best thing you can have is a good opposition because it's actually reflecting back to you. And so, you know, I think that, at least in my case, you know, for example, like the connection with the Daily Wire is I'm just going to come to the Daily Wire and say the things that I always say, you know, and I'm not going to change my. I'm not going to now all of a sudden start talking about the things that I don't usually care about or talk about. And I'm not going to let them, let's say, overpower what I care about and what I think is important and, you know, and I'll walk along with people as long as I can. And then when I can't walk with them, I'll just make sure that people that you can see that I don't agree with them after that. And to me, that's. That's enough, you know, and people will rail and people will complain, but usually those voices are actually not that, like. Like Greg was saying, they're not that real. There's people that scream really loud, but they actually. If you just. If you engage with them, then you're."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":4668.23,"end":4668.79,"speaker":"Greg Hurwitz","text":"Then they're real."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":4668.79,"end":4673.51,"speaker":"Jonathan Pageau","text":"Then you just start to spiral. But if you just let it, you just ignore it, and you just keep doing what you're doing."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":4673.91,"end":4819.93,"speaker":"Greg Hurwitz","text":"Look, I've had this, like, pretty early days. I mean, my communities are exceedingly liberal and many of them captured. I live in la, right? I was born in the San Francisco Bay area. I'm a novelist. I did a ton of visible work for the Democrats, trying to pull them back and wrestle them back from the idiotic left. Like, I'm very. You know, I'm a screenwriter. Like, if I was any more on Brand, I'd be like a Tesla, you know, it's like I'm very from that world, but so many of my relationships aren't. And I've never stood down for them for a minute, including with Jordan. Early days when all that went bad. But I also didn't move over and pick up a bullhorn from the other side and start screaming. I was always sort of building bridges. But, like, me going on Daily Wire was huge. Like, I didn't know if that could have had massive ramifications for my career in publishing in Hollywood and elsewhere. I had somebody suggest to me that going to a premiere for a Daily Wire event could terminate the morality clause of a contract I had with a major studio. Like, that's the level of insanity. And I've just never treated it like it's. I said, you know, I was like, that's utterly insane. Do you hear what you're saying? That's like the ccp. And I just have not engaged with it in some ways. And I've stood by my friends when they're my friends, and I've showed up. And a lot of times, if you engage and start the fight and start the resentment and start. You don't understand. You need to. That's the thing that makes it real and tangible. And look, it might come in a way that you can't do anything about it. And that's happened to me a few times. And then what you have is the grace and poise that you have from not having given into it and decided to live in it. Because it doesn't matter if it's not real. The people who get killed are those people who have. Who issue those awful hostage statements. Like, there was a prominent actor who mentioned that Ben Shapiro is like, an okay guy, maybe. And then there's a stone who was like, I'm sorry. I'll reexamine my privilege and I'll do the work. And at that point, it's like, look, man, I mean, I learned from Frederick Douglass and Mark Twain, you never apologize to a mob, ever. Especially a faceless mob, based on, you know, deep machine learning and AI patterns on social media. So if you don't do the thing that's revealing yourself, then you're screwed. Because then forever, everybody knows who you are and where you're located. Careful with apologizing, you know, apologize for sure and cleanly when you're wrong, but, you know, don't ever apologize out of fear of repercussions."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":4820.89,"end":4822.73,"speaker":"Lydia","text":"We have time for one more question."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":4827.13,"end":4830.05,"speaker":"Greg Hurwitz","text":"Well, we got three more. Why don't we run them real fast? Okay."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":4830.05,"end":4875.57,"speaker":"Lydia","text":"Okay. I have a somewhat back to the basics sort of question, and this is something that I personally have struggled with. I think a lot of liberal artists, arts students, struggle with this. Not all, but I think one of the problems that we have coming with such a very general background and an interest in, like, so many things, it's very hard to pin down what you want to do. Like, the one thing that you are, like, very interested in or, like, even the several things that, like, you're very interested in and could commit to, like. Like, long term, because I think to, like, develop, like, this sort of this art, you kind of have to commit, you know, and so how. How do we go about, like, figuring out that one thing or those several things that are most interesting to us?"}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":4877.49,"end":4971.86,"speaker":"Jonathan Pageau","text":"Hmm. It's hard for me to answer that because I don't have that problem. So it's. It's like, I. In some ways, I've. I've always. I follow threads. This is actually how I live. I. So, like, they take the icon carving aspect to my life. You know, I started carving icons in 2002, but I only started doing it really seriously in 2000, like, around 2010. So you have a huge gap in between. And. But the way that I function is that there are threads that I see, and these threads are like. They're like little. They're like the trapdoor that's opening, like, the opportunity that's Presenting itself. And then when I see that, I just go and I move in that direction and I hold on to the other things. Like I kind of hold on to them. I never forgot that I would love to carve icons. Like, it was just part of my life for, what is it? Like almost, you know, like eight, eight years or whatever, or seven years. And then when all of a sudden the door was open, I was ready and I just grabbed the thread and I just started moving in that direction. And so it also depends on, on, on, on your, on your opportunities. Like sometimes you just, if you do whatever it is, if you have things in front of you that are kind of glowing, even if it's not like the thing that you want to do, and you do it the best with all your energy and all your love and it has that flow to it. Yeah, you, you'll find your way, you know, it'll lead you. And, and you, when you, once you find the thing that you're doing, you know, you might thought, you might have thought, wow, 10 years ago, I, I never would have thought that this is where it would be. And that's also completely fine."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":4972.02,"end":5083.24,"speaker":"Greg Hurwitz","text":"I think we all early on coming out of school worry about this. And one of the biggest things is you're thinking too far in the future and you're thinking too globally. And a lot of things is the amount of things that will change. Even if you're successful beyond your wildest dreams, it won't be aligned with what your wildest dreams are now. It's not going to look, look like anything that you want, even if it goes well, because there's so much change. And all you have to worry about is if you have your framing right with your value system right. In a bigger way, what is the most interesting thing for you to do right now? That's all that matters tomorrow, this week. What's your next paper? What's your next assignment that you're going to all write ahead of deadline, you know, because if you think out ahead, it's like you're just borrowing tomorrow's trouble. By the time you get anywhere close to that, you're going to have way more information and way more failures and dead ends and opportunities and corrections. There's going to be so much new, more data. But of course, you can't help to be worried about it because you're human. But think, try and concretize it here. What do you want to do right now? What's the, what's a paper you could write? What's a book you're going to read, What's a art that you're going to engage in that will consume you, right? And then even if it doesn't and it's a failure, you get in, you're not interested, that's still progress because you're carving off an option that's moving into something else. Thank you both for coming here today. I had a question about the creative process. When you start with either an image or a symbol or this kind of picture in your mind, do you know that it's going to be something much larger immediately? Is it sort of. Does it sort of marinate until it comes to fruition? How do you go from this interesting snippet to a larger project? Do you know that it's going to succeed? Or if it might just kind of languish on its own?"}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":5086.44,"end":5087.4,"speaker":"Jonathan Pageau","text":"Those are you."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":5092.28,"end":5220.96,"speaker":"Greg Hurwitz","text":"I used to have a quicker cycle of, like, idea to go. Like, one of the benefits that I had was I didn't have a of bunch break between, like, I remember the first time I wanted to write a play. I'm like, let me just start writing a play. And I remember the first job I got in tv, which wasn't really a job. I was translating and counting animated mouth flaps for Dragon Ball Z and matching English words into a badly translated Japanese script that was largely perverse. So we had to get it around the. The, like the sensors, right? Because there'd be like an old guy grabbing a girl's ass and I have to make, oh, let me brush that twig off your dress. So it was like. But the first job I had, I was literally like on the plane with the producer, flying to the studio in Fort Worth, reading a book about how to format screenplays, right? So that the movement was so fast. I just was like, let me go and try it. Let me go and try it. And when you're talking about which ideas take. I think part of it was I used to move quicker into it. Like, I'd have an idea. It's be a book. I'd put all my energy in and go. And as I get older, it's very interesting. I've just been observing this in a very significant way lately. I have some ideas where I think, oh, my God, that's the next book. And I'll flesh out four or five pages of notes and I'll sit on it and give it more time. And it's almost like stagnant. I never used to do this. I used to. Anything that I was aimed at next I would just do and I'm giving a lot more time for breathing. And I just got into a situation with the manuscript I'm working on now. It's my. This will be my 26th or 27th, where I wrote into it 30% and then recognized that the entire ending and direction I was going to go isn't what I want. And I haven't had that since, like, one of my first books. And so there's a weird freedom again, that's happening now where I'm slowing in the creative process to take a lot more. More time to try and, like, measure twice and cut once. That has been a natural process. And I think that part of it is when you first get an idea, if it grabs you, you go with it. Right. It's like being carried by the away in an undertow almost. But also if you write things down, you can see if they continue to live and yield."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":5221.44,"end":5221.72,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":5221.72,"end":5255.94,"speaker":"Greg Hurwitz","text":"A lot of times when I think of a story, it's like when you first lay down on a towel on the beach and it's all uncomfortable and lumpy and you kind of have to adjust yourself into it. There's a form that the story needs to take. And if you can think about it, when you have some notes, you can see if your mind's continuing to masticate on the idea and settle it in more and more. And that's really worth doing to write down a bunch of notes and see are you compelled to return to it and to adjust it and to get into it further? And is it living and breathing and this other thing might be four or five pages of bullet points that you're like, eh, there's no there there."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":5258.98,"end":5259.34,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":5259.34,"end":5280.73,"speaker":"Greg Hurwitz","text":"Thank you both. I was wondering if you could speak to this idea that an artist should maybe create what they're interested in as opposed to catering to an audience, if you think that's accurate or if you should cater somewhat to an audience. And then if you think that, like the retelling of old stories, insofar as that pertains to the previous question, is something that should be considered."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":5281.45,"end":5383.42,"speaker":"Jonathan Pageau","text":"Yeah, I definitely. I mean, I have a different perspective on art in general, which is that I. I really do think that art should be useful. That that's why one of the reasons why I became an icon carver was because there was something missing in the idea of understanding art as a performer and a public that was in some ways alienating. Because there's a sense in which you're. You're creating something that doesn't actually participate in the life of the person. It's like a diversion or a distraction. Entertainment, right. That image. There's nothing wrong with entertainment. It's. It's fine. But there was something about how I wanted the line, the connection to be far deeper and realizing that, in fact, I wanted more an art that was like making a chair for someone, where it's like, well, you make a chair so that people can sit in it and it participates in their life. And that's how I entered into icon. Icon carving was because I wanted the line to be set. I wanted to make an object that someone will take and will be their patron saint, that is that they were given to when they're baptized, or like a cross that a priest wears. And that it's just part of their life. And it. And it doesn't have that. That. That structure of the. The artist and the public that is actually very modern. Like, it's a very. In some ways, it's a quite a recent. A recent idea. Like fictional stories in the past or in the Middle Ages, you know, there would be. They would still be participative in the sense that you'd have a troubadour that would come and would, like, tell the story and it would engage people into it. There was this whole participative sense. Even our idea of the public, right?"}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":5383.5,"end":5384.02,"speaker":"Stephen Blackwood","text":"We don't."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":5384.02,"end":5398.54,"speaker":"Jonathan Pageau","text":"We don't have, like, even. Or in Shakespeare's days, where we don't have the idea that the public can, like, kick the people off stage, that we can yell them down, that we can, like, make them stop because they suck. Like, we don't have that. I know. Like, we're just like the polite public."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":5398.94,"end":5400.22,"speaker":"Greg Hurwitz","text":"Don't give them any ideas."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":5400.86,"end":5518.55,"speaker":"Jonathan Pageau","text":"It's like the pure. This pure, like, alienated, you know, passive public, right? And I'm saying, like, I want to be careful. I'm not saying that that is wrong or whatever. I'm just saying that's not what I wanted. So as I come towards storytelling, I have the same approach, which is I want to tell stories that are. That will enter into people's lives and will become part of their life. And that's why the first. My first tendency is to say, can I grab things in memory that are anchors for identity and now can I represent them in a way that is fresh and alive and that people can re. Enter into them? So even when I think about the entertainment part of it, which is like, you know, I'd say I'm writing a graphic novel series. Like, the graphic novel series is, for me, is something like, yes, it's going to be entertaining and Fun for your 17 year old, you know, guy that's looking for a kind of adventure story. But everything about it is trying to re anchor you back into memory and become a, a track for thinking and for, and for identification. So that's been my, like, that's been my approach to storytelling and I don't think it's the, it's the only one. But at least at this moment in my life, it's the only thing that makes me care about storytelling. And so like that's why Greg and I like if we're going to do something together, for me it was like, well, let's do Genesis because it's like if we could do, if we could pull that off, like if we could create a narratively compelling retelling of the, of Creation and the fall and, and Cain and Abel. I mean can you imagine this in some ways the service we would be rendering Western civilization Like it sounds like, it sounds like it's cocky but really like I believe that it's like that's what Milton was able to do, right? Milton was able to do that and there are very few people that have been able to do it. So I'm like, man, if we could pull that off, that'd be an amazing thing. And I don't only see it as, oh well, we'll keep people happy, we'll divert them, we'll, well, like it's be entertainment. No, I think it's like it's really going to the core."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":5518.79,"end":5737.19,"speaker":"Greg Hurwitz","text":"I, I can answer this from the more I think I'm more consistently in touch with the commercial side of things. And what's interesting is my advice holds, but for slightly different reasons. There's a lot of people who say like right after the Da Vinci Code came out with Dan Brown, right, there's this glut of everybody writing symbology texts, right? Or you know, secret society stuff. By the time you write that, right, That's a year, year and a half, two years. Then a book needs a year lead time on publication. You don't even know where you are. And one of the things is I sat next to a woman on the flight out here who's a pretty renowned comedian, but she's just switching over and doing some writing, a pilot. And she was talking about like, well, how do you do it and what do you want? And everyone's. You always hear this in Hollywood, right? Everyone's buying stuff that's like this. And I said none of them have any idea what they want. Like there's no version under which, you know, somebody thought that what we really need is a. Is a rap opera about Hamilton and that that's going to take over the world. Nobody thought that. Like a magic school for, like, you know, little kids. I mean, Scholastic bought that book for, like, nothing. It was, like, educationally. Right. They're not a big commercial house. There's a judge who famously remarked about pornography, like, I don't. You know, what's the definition of pornography? I don't know, but I know it when I see it. And there is this notion that, like, you're going into this collective being, like, publishing or Hollywood, that anybody knows anything. There's a very famous line by William Goldman, who's the preeminent screenwriter, Butch casting the Sundance Kid at Marathon Man. He says, nobody knows anything. That's the lesson about Hollywood. And so to try to anticipate market or to guess or to say, oh, what's selling right now are quirky medical shows like House that might not be aligned with your inner pattern, which means you might not be able to do that brilliantly. And the one thing you're going to have as an artist or as anything that you are as an engineer, as a vet, as a doctor, as a diagnostician, pick your field, is that when it's aligned with you, when it resonates with you, you have something to say or to give that only you can say or give. And that's profoundly true if you're an artist. And if you're trying to go apply it to some formula of what's going to sell two years from now, when something gets made, you just can't even anticipate it. And all the successes that come between now and then are going to be surprising from things that are made that are undeniable. And so I would say again, my. My own aesthetic happens to be fairly commercial. But when I'm writing, I'm writing to write the best possible version of it. And I'm going to talk about this a little bit tomorrow about what does it mean to be commercial versus literary, but the best version, and what that doesn't mean is that you can be arcane and you can be cute and you can be inside, and you can be snide and you can be intellectual, and you can make a work that's impenetrable. What you want is to write, write something that's accessible. But the best version of writing is where it's accessible to everyone, high or low, and you're not playing games to show how smart you are. Like, I never want me, as the novelist, to be what people are thinking of when they're reading a story. I want them to be thinking about the story. And so in that way, I'm making sure that I'm guiding and in conversation with readers in a way that brings them along, but they don't know what they. We don't know what we want. None of us know what we want. Right. So to take it from readers who say, I'd really love if Orphan X, you know, went to the moon, it's like, no, you don't. You have no idea what you want. Right? Like, you like it, and you're engaged with it because I'm showing you something that you didn't think of yourself, so you don't want to cede to that."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":5738.79,"end":5789.06,"speaker":"Lydia","text":"Well, this has been really a wonderful conversation. Thank you for sharing your friendship and your passion and your story. The best. In closing, I just want to say how honored we are at Ralston College to have both of you here, not only as guests, as speakers, but really sincerely, as friends. You both have given so much to this little fledgling institution. And I think, speaking as an actress, a writer, myself, a storymaker, someone who's so desperately clung to this idea that stories matter, the story of Ralston College comes at a time that I think the world is ready to hear it. And I'm curious from your perspectives if you could leave with us. As a final thought, what does this place, this endeavor? What does Ralston mean to you, and what do you think it has to give to the world?"}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":5790.58,"end":5830.42,"speaker":"Jonathan Pageau","text":"Yeah, I think there really is a confluence of moments and things happening in the world in general, and I think Ralston is stepping into that exactly at the right time. I think right now is the right time. And the thing is that because it's something like what Greg said, the idea is that the luminary is invisible to most people. The thing that is actually going to be the seed that will bear fruit in the future. There are only. It's like it appears as this small light, and you need a certain kind of perception and a kind of intuition to see that that's the thing that is going to."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":5830.57,"end":5830.81,"speaker":"Greg Hurwitz","text":"To."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":5830.97,"end":5939.36,"speaker":"Jonathan Pageau","text":"And when I come here and when I heard about the way that Ralston's doing things, whether it's the culture that they're setting up with you, whether it's the pedagogy, whether it is the way in which they're structuring what you're learning and in what order and how they're doing it by bringing you to Greece. And to do that, I personally immediately perceive that this is a life giving thing, that it is something which will bear fruit in the future. And my vision is that Ralston now is this little thing with like 20 something students, but that this way of thinking and of doing will yield. So because of that and because I can see, like. And it's partly one of the things that makes me see that is also the quality of people that are drawn to it. Right. So you notice, you watch, like, it just happens after you say, oh, look at this person who is interested. Look at this person who is kind of like that and, like, curious and coming and moving towards it. Whether it's the people that are working for Ralston, whether it's the people that are kind of becoming this kind of network of friends, you're like, oh, yes, I can see that this is in some ways almost like a vision of the future. It's a vision of a movement or a new beginning, of something that's growing. And so because of that, I really. I really believe that Ralston is a treasure. And the fruits are not apparent right now. They can't be, because it is a new beginning. It's like a seed. But I trust and I can see that through all of these, with all of this happening, even in terms of what's happening in the world, in terms of politics, in terms of the fragmentation, but this desire to create a new beginning, I see only a bright future. That's my perception. Yeah."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":5940.16,"end":6066.83,"speaker":"Greg Hurwitz","text":"There's a conference we were at last year in London, and Ayaan Hirsi Ali was speaking, and she talked about Western civilization as a beautiful cut flower that's like resting on a table. And she said, our job now is to plant seeds, right? We're severed from our roots in a certain way. And Ralston, I mean, there's a reason you've used that metaphor multiple times. You know, Ralston is a seed that way. And part of how I know when I'm in the right place or affiliated with the right place is a large part. It's how I feel when I'm here. There's an aliveness that is here. There's an aliveness of learning. There's nothing that feels sort of stuffed shirt or rigid or workmanlike. And to me, it's a callback. I went to fancy colleges back when they were still places to be proud of, you know, and so I had. I really had this. I could find a track when I was there with incredible professors, incredible classmates, and it's just. It's so absent. And when I'm here and the people who are around here and I came with my wife who's a psychologist and a psychology professor. We came last year, two years ago. I can't quite remember. It was very similar for her. There's students she's still in touch with of just there's a respect, there's a hunger, there's an aliveness in the students here. There's an earnestness and you know, that's in rare supply, right when snark and snide is ascendant to be earnestly engaged, but with a sense of humor. And there's naughtiness and there's boxing and there's, you know, there's all the things that are going to be necessary for any institution to keep it revivified. But this is an incredibly special place. And so that's part of why I'm always delighted to come back. I'm always delighted to be near it because I feel like one of the best things is when you, when asked to go somewhere to contribute or be of help, you feel like it's nourishing, that the whole process is nourishing also. And that's how I feel when I'm here."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":6084.59,"end":6105.8,"speaker":"Jonathan Pageau","text":"Thank you very much. If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase. So go to thesymbolicworld.com and thank you for your support."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":6107.16,"end":6171.17,"speaker":"Laura Diaz","text":"Tucson the Weight is Over Mediweight loss. They're officially open on North Oracle Road. That's right, no more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication, but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost. The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better, and lose weight the right way, mediweightloss is ready for you. Walk in, get started, and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com pack up, though, because Chevy."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":6171.17,"end":6175.32,"speaker":"Greg Hurwitz","text":"SUVs have the capability to take you to some incredible places, like an adventure."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":6175.32,"end":6177.68,"speaker":"Jonathan Pageau","text":"In the middle of in the Equinox."}
{"episode_id":"SW - #384 - 2025-03-26 - Gregg Hurwitz - Why We Tell Stories (Ralston College)","start":6177.68,"end":6198.16,"speaker":"Greg Hurwitz","text":"Active, an SUV that will help you get away with confidence. Or head off for a night in the in Chevy Traverse with all the tech you need to stay connected. While the undeniable value of Chevy Trax will keep you moving from here to over here to way over here, get to all the places you want to be with Chevy SUVs. See Watson or O'Reilly Chevrolet."}
