{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":12.56,"end":16,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":26.41,"end":66.84,"speaker":"Fr Anco","text":"Today I'm reading an author whose name is Maurizio Ferraris. He wrote a book just recently, several years ago. The title is Manifesto del Nuovo Realismo. Manifesto of New Realism, meaning that we're finding the ontology again and trying to avoid mixing or irresponsibly ontology and epistemology. That's the kind of the base of his. His argument where postmodernism kind of perpetuated that confusion between ontology and epistemology. Okay, that's. That's it."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":68.28,"end":1354.1,"speaker":"Jonathan Pageau","text":"Well, it's great to meet. It's great to meet everybody. And so I am mostly an artist. That's mostly my job. I'm a icon carver. And. But now, through my coming to icon carving, you could say part of it was also rediscovering an ancient language, rediscovering an ancient visual language that bubbled up and developed in Christianity. I always say that if, you know, in the time of Dante, maybe a little bit before, but I would say even still in the time of Dante, if you had been in a church pretty much anywhere in the world, whether in Italy or in Syria or in Constantinople or in France, you would have seen essentially the same thing. There was a patterned language which had come up, and this pattern language had become a universal language. And so it was in part, in discovering this pattern language, also discovering the pattern language that was in scripture and the pattern language that was in architecture and in liturgy, all of these things together, what slowly led me to another aspect of what I'm doing, which is to talk about symbolism and to try to show people the underlying patterns of stories, which I believe to be the underlying patterns of reality itself. And I think that to Franco's point, this, right now, in this moment, in the historical moment, as a lot of scientists are focusing on consciousness, and there's a lot of scientists that are hitting a wall, we could say hitting the wall of consciousness. The problem of emergence and complexity, all of these are bringing us back to the question of pattern and how pattern participates in the way the world reveals itself to you, the way the world appears. So the world appears to us as patterned. And this is something which. It can help us by looking at the old stories. It can help us rediscover these patterns again, which are really the pattern of reality. And in Dante, this is. Dante is one of the masterpieces of this showing, participating, helping us see the pattern, helping us see how this pattern that he draws, which is basically a U shaped pattern, right? A descent and Ascent is not only the pattern of the cosmos in the largest way, and I don't mean scientifically. It's really important to always remember that I'm not talking about the way that science describes the world, but the way that we experience the world, the way that we are able to perceive meaning in the world. Okay? And so this pattern that he draws of this descent and ascent, of this hierarchy of being, you would say it appears at all the different layers of reality. So it's not just a cosmic pattern, right? It's the pattern of your day, it's the pattern of your story, but it's also the pattern of a thought or the pattern of a breath. You know, that just breathing in and breathing out follows that just rhythmic, that rhythmic pattern, okay? What's fascinating about Dante is that he is able to show us this pattern of the mountain, you would say, or the descent and the ascent, the low and the high. And he does it in a way where he connects all the levels of reality together while he's giving us the pattern. And it's such a genius. It's such a genius work. Obviously, it's not the. It doesn't stand alone. It's based. It's connected to other works of literature that are there before, of course, Homer and Virgil. But also, there seems to be very strong similarities between Dante's Comedy and Ibn Arabi's El isra. There was a flowering of Sufi mysticism at the time just a few centuries before. And there. There seems to be a very, very close connection between the way that the Comedy is described and the way that Ibn Arabi talks about his own descent and ascent. He wrote a book called El isra, which means the nocturnal voyage, and is also mapped onto Muhammad's voyage. Muhammad's voyage up the heavenly spheres, the levels of hell. Everything is very, very similar. Even the beginning of the tale where Dante encounters animals is something that you see in Arabi's work. And it's so funny because it has brought scholars to say that Dante copied Araby and that it's a work of plagiarism, that Dante's a work of plagiarism. All this, you know, we've been seeing in the past century, you know, they're just this anti. Kind of anti Christian desire to destroy everything. But that's the wrong way to look at it. It's really the wrong way to look at it because Dante's work doesn't just connect to something like Araby's descent and ascent, but it also connects to other stories that have Been told forever. If you've never heard of St. Gregory of Nyssa's Life of Moses, for example, St. Gregory of Nyssa'S Life of Moses follows the exact same pattern as Dante's descent and ascent. It's not as detailed, it's not as explicit in terms of levels. But you can see in Sangre Grevnisa the idea of Moses crossing the Red Sea. So going down through the Red Sea and then ascending up the mountain to receive the revelation of God is, of course, the same pattern. There's also a book in the seventh century, just before the advent of Islam, called the Ladder of Divine Ascent. I don't know if all of you are aware of this book. It's a book written by a monk. I'll show you a picture of it, of the icon which has become famous. Okay, so this is. This is a 12th century version of an icon, but which was based on the book by St. John Climachus, right at the beginning of the seventh century. And it's the Ladder of Divine Ascent. His book is a mystical treatise on the manner in which we are to be deified, the manner in which we are to become God by participation. And so you can see that the world is presented as a ladder, as a series of steps or a series of levels. And the monks are ascending the ladder. Up above you can see the choir of angels, and down below you can see hell. You can see that they're kind of in flames. And usually it's harder to see if you look at the very bottom of. You see where there's a monk falling down and he's kind of falling into something. He's falling into the mouth of something. It's like the mouth of a monster. And usually in other icons, this will be represented as a kind of monstrous head. And of course, the entire pattern itself is there in the story of Christ himself. The story of Christ is a descent and an ascent. The death and resurrection of Christ in the tradition is presented exactly as this descent into Hades. Whereas in Christ's case, it's a little different than in Dante. In Dante, he's almost like a voyager who travels and seas, whereas in Christ's case, he conquers. He goes down into Hades and he conquers. Okay, so this is an icon of the Anastasis, which is the descent into Hades. And it's based on the Gospel of Nicodemus, which is an apocryphal gospel. But this detail of the story of Christ has been taken into tradition. And so this icon is a fully orthodox icon. It's a fully legitimate icon. And so we see Christ going down into hell and he breaks the doors of hell. So you can see these two things here. These are the doors of hell, and then down below is Hades, who is being tied down. Sometimes there are two characters, sometimes there's the devil and death. And most often it's just death. So death is bound. Christ is now getting ready to go back up and is ready to ascend into heaven and to bring with him Adam and Eve. So this is Adam and Eve. And the patriarchs are there as well, the people who died before Christ's resurrection. I just want to help you to get a sense of how this pattern is really a. So can you see, you can. I mean, can you see the icon here gives you a sense. So, yeah, yeah, okay. So the world. So the entire. This is, this is now the entire cosmos, which is represented again as a hierarchy. So you know, in Dante what happens is you have, you have Hell, then you have purgatory. And then purgatory kind of comes up to the Garden of Eden. And then from the Garden of Eden, then there are the heavenly spheres which go up to the prime mobile, where you reach the infinite or you reach the non duality, like that, or something like that. And so the icon of the Last Judgment has that pattern. But the bottom of the icon here is the Garden of Eden. So it's already the top of the mountain. You would say, okay, so the Garden of Eden is here. And you see all the saints are gathered into the Garden of Eden. The souls fall down into Tartarus, down into Hell. And you can see this big mouth here, the mouth that I told you about is down here. And then the saints are organized in choirs of saints which ascend all the way up to the highest sphere where you have Christ and you have the Mother of God and Saint John the foreigner. And in here, see down here, this is Adam and Eve, okay? And so this is happening, you could say right after the anastasis, right after the descent into Hades. So Christ takes man and woman, you know, takes humanity itself, takes the forefathers, until the seed of man and pulls it up into the highest sphere. And so this is the ultimate. This is the same moment you would say as Dante's apotheosis, Dante's reaching the prime mobile and encountering God. Probably not totally though, because Dante's last moment is above the icon. It's not represented because the last encounter, both Ibn Arabi and Dante, their last encounter is a non personal encounter, right? It's a Peeking into the divine nature, you could say it's almost heretical. Like it comes right up to the non personal transpersonal aspect of the divine, where he sees. And that's why at the end, it's almost like it's these abstract. You guys, you haven't read it, some of you yet, but it's like these abstract ribbons that are kind of pulling the mystic into this divine light or this over light. St. Gregory of Nyssa, he talks about the divine darkness, that the darkness which is so. The light which is so strong that it is blinding. So that the first, so the first thing I wanted to show you is mostly the idea that the pattern that Dante uses. So the pattern that Dante uses is really a pattern which is not limited to Dante, right? It has a long history right away from the, the ancient stories, ancient myths. And then it has several, you could say several brothers and sisters in storytelling, including people like Saint Gregornesa, Saint Ephrem the Syrian, also very important in this structure. Saint Ephrem the Syrian wrote a book called the Hymns on Paradise, which many scholars see as one of the sources of the Quran. And the Hymns on Paradise are this beautiful. It's just such an amazing text. It shows you this mountain of paradise and it talks about, it shows us the fall of man and the effects, ontological effects of the fall, but also the ontological effects of this going up the mountain and reaching into the top of the mountain. So the importance in terms of Dante's pattern, what's really important to understand. There are a few things that I think are the most important. One of the most important is what Franco mentioned before, is that Dante wrote in Latin, didn't write in Latin, he wrote in Italian, he wrote in common Italian. This is something which to a lot of people seems mysterious, but it's not mysterious once you realize that the Gospels were also written in vulgar Greek. The Gospels were written in Koine Greek, which was the common language of the day. And it has to do with the desire to span all aspects, to go all the way down, to be able to show that everything is connected. Right. If you can express the highest aspect, if you can express the nature of the infinite in a common language, then you are actually connecting the levels of the ladder together, right? You're not, you're not. And it really is, it ends up being like a Christian message in the sense that there is a sense in which all of this is really connected and that all of this is able to express this pattern, like this powerful pattern. And so then what he does in the story is that he then shows you that the pattern, this pattern of the mountain or the pattern of paradise, the pattern of the hierarchy is a. It's a fractal pattern. So what do I mean by a fractal pattern? It means that the pattern of Dante's comedy is happening in the story itself. It's also happening in his cosmic telling of the story. That is, the entire cosmos is resolving itself into the top of this hierarchy. But then it's also happening at all the different levels that Dante is talking. So Dante has a cosmic aspect, which is the entire creation, how it participates in this pattern up to the angels and all of this. Then there's a specific Christian pattern which is to connect the story of Christianity. So as he ascends, he reaches different. He encounters different prophets, different saints, different angels, and ultimately he sees the Mother of God in one of the highest spheres as this ultimate image of his beloved being transformed into this universal thing. But there's also other stories. There's also his own personal story is also going through that. Like I said, the fact that Beatrice becomes. Doesn't literally become, but is replaced at some point or is transmuted into the Mother of God, is showing how his personal story is being connected to the universal story. He's showing how his personal transformation, how his passion for this young lady, which was strange, let's be honest, can be transmuted into something higher, right? Can be transmuted into a love of something which will bring him higher. And so it happens at his own personal level, but it also happens at different national levels. Like, he has a historical aspect to his story, where he encounters historical figures and he plays, places them historically in the hierarchy. So what he does is he creates a hierarchy of beings. And in this hierarchy of beings, he places people in the hierarchy at different levels. But the type of people he places are, on the one hand, mythical figures, Biblical, prophetic figures, historical figures, and then also personal figures. So all of these levels are being connected together. And what's being shown is that the pattern of the comedy, this descent and ascent, is happening at every level of reality. It's not just happening at the cosmic level. All right, does that make sense to you guys? A little bit. Like, it can help you to understand also why, like I said before we started, it makes the comedy, on the one hand, an amazing universal tale, which is one of the most universal tales that have ever been told, but it also makes it one of the most personal tales that has ever been told at the same time. And it makes it Very difficult to read the comedy because sometimes he's referring to some obscure squabble that he's had with a noble. And you're like, you can't understand what he's talking about. Unless you have massive notes in your text, you won't understand. But the reason why he's doing that is because he's trying to show the connection of these different levels. And I think that that's really. It's important because one of the problems we've had in modernity is on the one hand, we fetishized the particular, right? And on the other hand, we've also fetishized the universal. Like, we have this idea, you know, you. You talk to people who are spiritual but not religious, right? You talk to people who are. Who feel almost as if being connected to something particular is almost like getting dirty, right? They have to transcend all the. All the particulars. But what Dante shows us is, no, no, you have to express the universal in a particular. There's no other way to do it. He has to express the universal pattern that he encounters inside the Christian story, inside the Roman story. That's really important because that's one of the things that Dante really does. He creates an amazing. He creates the most perfect synthesis between paganism and Christianity that has ever been accomplished. And so he needs to tell a Christian story, a Roman story, you know, story of his city, and then the story of his own. Of his own problems, you could say, of his own love, of his own, you know, his own passion for this woman. But also not just that, you know, the fact that Virgil is the one who appears as his guide is related to his own personal story as well. As a poet. So this is really, to me. And anyway, this has always been Dante. Reading Dante has been one of my most profound lessons. To understand that there is no other way to live the universal, you have to live it through your particular story. Your particular story, your nation's particular story, your religious story, your history, all of this. It's not about denying this, but it's rather about inside that story, seeing the pattern and making it live, right? Making it live again. Making it something that is enchanted once more."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":1354.26,"end":1354.9,"speaker":"Fr Anco","text":"Okay?"}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":1356.26,"end":1573.61,"speaker":"Jonathan Pageau","text":"And that's part of this idea of the re enchanting we talk about re enchanting. Everybody talks about re enchanting the world right now. But it's not an arbitrary thing. We can do it a little bit through fiction, and I think that that's useful. I talk about fiction all the time on my YouTube channel. But Dante's work is not a work of fiction, at least not the way that we understand fiction today. And that's extremely important to understand. He's not like Tolkien, making up a world which is perfect wizards, very well and coherent and beautiful. Like, I love Tolkien myself. There's nothing wrong with him. But that's not what Dante's doing. Dante is connecting his personal story to his religious story, to his nation story, right? To Rome's story, to the cosmic story. That's what he's doing, right? And so because of that, like I said, it becomes a key for us to see how it is possible to re. Enchant the world. One of the important aspects of Dante, which I think mark him as a transitional figure. Elizabeth mentioned this at the beginning. She said that Francis Schaeffer had identified Dante as one of the key figures in the beginning of the breakdown or the fragmentation in the West. And I think this is key. I think that he, among others, is a. He's a. He's like a hinge, right? He's an. He's a hinge between the medieval synthesis, we could call it the great medieval synthesis, and what is coming, the Renaissance, the Enlightenment and modernity, and the slow graying of the world, like the disenchanting of the world. And it has great aspects, like the modern world is great. I love medicine and I love cars. I have no problem with the technology. But there's a side effect which came along which is this kind of graying or disenchanting of the world. And so Dante stands on the hinge. And so as he stands on the hinge, he actually offers us, I think, some keys to this re. Enchanting of the world. One of the things that I have been promoting is the necessity of re. Enchanting. Entering the body, let's say, of re. Entering our experience, you know, of seeing the world through your experience. And that is really the way Dante is doing it. Dante presents himself basically as the. As the center of the cosmos in his story. Like he. Everything kind of is around him, you know, and there's a. There's a certain extent where that can be egotistical and can be nefarious. But there's a certain extent to which that's true because you don't have any other experience besides that experience. You only have one experience. And that experience is the experience of you as a conscious being in a body looking out on the world. You don't have another experience. And we can, let's say we can abstract that through modern science and this idea of objective knowledge. Which there's no. I don't have a problem with that. But we always have to remember that we're always a being experiencing the world through consciousness. Like, you can't. You can't abstract yourself from that."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":1574.09,"end":1574.57,"speaker":"Mack","text":"Yeah."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":1574.81,"end":1575.45,"speaker":"Jonathan Pageau","text":"And so."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":1576.41,"end":1576.97,"speaker":"Mack","text":"May I?"}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":1577.37,"end":1578.25,"speaker":"Jonathan Pageau","text":"Yeah, go for it."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":1579.61,"end":1602.45,"speaker":"Mack","text":"I think that's one of the main problems with society today, where people basically live through screens in such a way where they live someone else's life. Like, they vicariously feel their feelings and they have all these experiences from their own bedroom, but it's not their own, you know, like, they don't own it through. Through a particular sense or anything. It's just."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":1603.09,"end":1603.49,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":1603.49,"end":1605.25,"speaker":"Mack","text":"It's a fragmented sense of being."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":1605.57,"end":1613.49,"speaker":"Jonathan Pageau","text":"Yeah. The drama. The drama YouTuber and the drama Instagram influencer. That's what it's about. Exactly. They lack, like, the."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":1613.81,"end":1621.41,"speaker":"Mack","text":"The depth of experience is what I'm trying to say, by going out and conquering their own, their own demons and, you know, finding their own."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":1624.59,"end":2646.94,"speaker":"Jonathan Pageau","text":"And so the. And so the. One of the problems we've had right now, one of the problems that we've had in terms of religious terms of kind of spiritual, religious ideas that we. Our whole world has been made gray through kind of materialist thinking. Everything has been deconstructed, Right. All the causalities have been broken down. Right. Because you know what? If you go up, up there, there's no prime mobile. If you go up in a spaceship, you're not going to encounter the heavenly spheres, right? If you go up in a spaceship, you're going to run out of air and you're going to die if you don't have enough air, right? That's what's up there in terms of mechanical causation, okay? And we need to first be aware of how that has broken our entire system of meaning. Galileo has basically evacuated our entire system of meaning. Once we took Galileo seriously, he evacuated everything. We still use remnants of it. We still say, you know, he has a higher position. He has a. You know, he's really low. Today we use all those expressions, but it's a schizophrenic use. If we fully accept, let's say, the scientific reduction, then all these expressions, they're schizophrenic, right? You know, I always joke when I talk to priests and priests that are really, really keen on wanting to show me the historical this and that and historical this or that. And I'm like, why do you raise the chalice up? Like, what are you raising it towards? Are you trying to catch the WI FI signal? Like, I Don't know what you're doing. Because in a purely materialistic world, that doesn't mean anything. It doesn't make. It doesn't have any meaning. But what Dante offers us is rather, he offers us in his. In the fact that he's a hinged character. He offers us the possibility of kind of re. Entering, I think, the world of experience and discussing the world through that being. And then the meaning can appear again, right? The meaning can take its shape. I want to read you two quotes that I love from Canto 29. So the first thing Dante does is that he unites the cosmic vision, this idea of these heavenly spheres and the planetary spheres and the prime mobile, as just, let's say, physical description of your. Of the cosmos, the way the ancients described it. He unites that with a Neoplatonic vision, like a clear Neoplatonic vision. He's not the only one who does that. Other people have done that as well. But he does it very beautifully. And so he says, so this is Beatrice who talks to him, and he says, order was concreated and constructed in substances and summit of the world where those wherein the pure act was produced, pure potentiality held the lowest part midway bound potentiality with act, such bond that it shall never be unbound. So you have to think of his structure again, okay? You have to think of his structure. So you have pure act above, and you have pure potentiality below. So let's say you have pure act in the prime mobile, you know, in the heavenly nature or in the heavenly being. Then at the bottom you have pure potentiality, this chaos that's right at the bottom. And he says in the middle. So what's in the middle of his cosmos? In the middle of his cosmos is that place at the top of the mountain, right? At the top of the mountain is the garden, Garden of Eden. And in that place is the place where they join together, where act and potential join in that spot in a place where he says that will never be unbound. Now, that's it, right? That's the pattern that's there in the Bible as well, right? It's not in the Bible. You have heaven, you have earth, and then you have the Garden of Eden. I always keep having to remind people that the Garden of Eden is a mountain. It's not flat. The Garden of Eden is a mountain. And people always forget it's a mountain, because it doesn't say that in Genesis. It says it in Ezekiel that the garden is a mountain. But traditionally, really, you have to understand the garden as a mountain, or else it doesn't make any sense. So the garden is a mountain. You have heaven and earth, pure essence, pure potential. And the place where it meets is the top of the garden, where the tree is, but also where man is ultimately where the cross is, right? Ultimately where the crucified One is. So you have to understand that the top of the mountain in Dante's paradise is the top of the garden, but it's also the top of the Mount Golgotha as well. It's also the place of the crucified. And you see that abundantly in medieval literature, in medieval representations, where the tree, the cross, is represented as the tree of life or the tree of knowledge, or both at the same time, the tree of life and death. You see all these representations in medieval representation. And so that's the spot, right? But that's also the spot where we are called to be. Like, that's the spot where we are called to be as those that unite meaning and potential, right? Name and the fragmentation that's at the bottom, right? And this is something that is not. When I talk about the fractal structure of reality, this is something that is true of all levels of reality, right? That is, I always use the same examples, but any. Anything, any object, right? You know, a chair, for example, is a meeting of meaning, pattern and potential, right? It has a bunch of parts, it has legs and colors and all of this, right? And then it has a purpose. And so for that, that comes together in a place which is the chair. And we play a part in that. We play a part in consciousness plays, let's say consciousness is better. Consciousness plays a part in connecting those two together, that spot where meaning and potential meet. And Dante talks about that as being the very pattern of the cosmos, like his whole pattern, that's what it is, its potential act. We call essences, he says they translated as substances, but probably better to say essence. Let's say essences or ideas or names, and then potentiality at the bottom, chaos at the bottom. And this comes together. So you have a bunch of stuff. You have paint and you have pieces of wood, and you have a piece of leather, and then you gather it together. You gather all this potential, this multiplicity. You gather into an identity which is the chair, and then you have a chair. You need both. You need the pattern and you need the gathered potential. Does that make sense? So you get a lot more of that if you read also some of the other authors that I mentioned, if you look at St. Gregory of Nyssa, and St. Ephrem the Syrian. You really get. Really get that. All right, so last. Last quote that I really love. It's good for us today because of our science problem or because of our deconstruction problem. So Beatrice explains to Dante that when he's standing at the lowest level of heaven, and he says that because Dante encounters these souls at all the different levels of heaven, all the heavenly spheres, and she says that the souls showed themselves here not because allotted this fear has been to them, but to give sign of the celestial which is least exalted to speak thus is adapted to your mind, since only through the sense it apprehendeth what then it worthy makes of intellect. On this account, the scripture condescends unto your faculties and feet and hands to God attributes and means something else and holy church under an aspect human Gabriel and Michael present to you and him who made Tobias whole again. So the idea is he says, okay, so Dante comes and he ascends the heavenly spheres and he encounters these beings. And it's as if Beatrice is warning him not to have like a science fiction interpretation of what he's going through, right? Because we have that right now. All the Marvel Comics nonsense of God as aliens living another planet, like Thor lives on another planet, and all this kind of Mormon nonsense, right? And so you have that possibility. A lot of people talk about that, or they say silly things like that spiritual beings are in other dimensions. And they just mean by dimensions that there are other equal dimensions that are just invisible, but that are on the same, like, material exist. I don't know. Like, I don't totally understand it. But what Dante is saying is like, okay, so you have this experience of beings at different levels of the hierarchy of beings, and you experience them at these different spheres of heaven. And he's like, they're not really physically at these spheres of heaven. They're not. This is a condescension of heaven towards you for you to be able to understand things which are beyond the physical world. And he talks about like, so we represent angels as having bodies, but angels don't have bodies, right? We represent God as having hands and feet and walking in the garden. But God doesn't walk anywhere. God is not a physical being, right? And so this is where I think that we can recapture our experience. Because the experience of hierarchy, the idea of something which is above you and something which is below you, is the best experience that you can have of these transcendent truths. They're not arbitrary. There is no better experience than that light comes from above, light comes from the sun. And so, of course, when we talk about the light of God, we're not talking about physical light, but it's the best image you can use is the sun. That's the best image, and it's not arbitrary. If you understand how the sun engages the world, then you can understand how the essences which come from the divine encounter light the world and make things appear out of darkness, right? Bring order out of chaos. All of this imagery. If you ascend a mountain, if you do what Dante says, and you actually physically ascend a mountain, you will have an experience of hierarchy. You'll have an experience, a spiritual experience. You might not have the insight to make it as profound as you should, but as you. If you're on the ground, on the bottom of a mountain, let's do it even more. Let's put your face on the ground. Put your face right on the ground and look around you. All you're going to see is a few blades of grass, maybe a few bugs if you're unlucky, and some dirt. You're going to see very, very particular. Everything is going to be very. You're only going to see a very particular thing. Now get up, start going up the mountain. And the more you go up the mountain, the more you see, right? All of a sudden, the multiplicity, the particularity of the multiplicity is slowly going to start to coalesce into bigger identities. So what you had first saw were the five leaves of the tree are going to become a tree as you ascend, as you're further up, and then the different trees are going to become a forest as you ascend. And then as you ascend, you see more and more. You encompass more and more. All the multiplicity is under your feet, and you're able to encompass it in your gaze. And as you reach the very, very summit of the mountain, that's an experience. If you. I'm sure anybody. You've had that experience. Reaching the summit of a mountain is amazing because right until the very moment that you reach the summit of the mountain, you do not have a full vision. But at the very second, it's a matter of seconds. Once you reach the top of the mountain, all of a sudden you have a 360 vision. You have the whole world under your feet, right? And it's like. It's a jump. It's a jump from partial to a universal sense of the world. And so that experience, that's the hierarchy, that's it, right? That's how multiplicity comes together, whether it's a chair, right? Like when you have all the parts of the chair, they don't. They're not a chair until you've ascended the chair, right? Until you've reached the very top where now all the pieces are together and you understand the purpose of the chair, then the chair appears fully in its purpose and its reality. But until you're there, it's just a bunch of parts. And that's the same thing in terms of your experience of ascending a mountain. And so that's why I think that Dante offers us the possibility of recapturing the meaning through experience, of saying, yes, I know that the sun, that the earth turns around the sun. Yes, I know that's true, but your life is still based on the fact that the sun comes up in the morning and you just can't get away from that. Like, try to get away from the fact that your life is pattern or on the rising and setting of the sun, and you're going to go insane, right? It's going to pull on your mental. Your mental health quite strongly if you try to pretend as if that truth is not a real truth of experience. And so if we. And so that's what I mean, it's like, we understand that it's a condescension. We understand that the reality, the truth, like Beatrice tells Dante the spiritual truth, are condescended in the experience of the world, that this is not really what it's talking about. It's pointing up towards transcendent truth. But that's the way to do it. There's no other way to experience these. This is the best way to experience these, is to encounter them in our experience. So that's what I think. That's what I think mostly Dante has to offer. I would say that the greatest thing that Dante has to offer to us is this capacity to join personal with the universal, to join his story with universal story, and to do it through different levels, to do it through the different levels of his. You know, you could say your family, your community, your. Your history, your religion, all of these things are the vehicle, right? In one of the Cantos, it talks about how the higher beings see the footprints of God below. And so that's such an awesome thing. It's like, yes, the purpose is to go up, but you see that God's footprints are below that. That that's how God touches the world, is through these particular forms. The particular forms are part of the pattern. We're not Gnostics, at least I'm not a Gnostic. As a Christian, I'm not a Gnostic. I don't believe that particularity is evil. Particularity is the place where the universal finds its ground. So. So if anybody has questions on my. My little understanding of Dante, I will let you guys speak for now."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":2647.9,"end":2651.66,"speaker":"Elizabeth","text":"Hanko, see, what are you thinking?"}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":2653.74,"end":2946.86,"speaker":"Fr Anco","text":"I agree, Jonathan, with a lot of the things that you're saying, especially the, especially the part of this particularity and the universal. You know, how we've lost that unity. And Dante is so much part of unity. You know, he's trying to connect it all, and in some ways he's giving us that line to have that experience. One of the fascinating things that I find, and it's a simple thing, that Dante is never, ever letting his reader forget that he is in the flesh and that he's all the damned from Hell or the purging ones in Purgatory. And even in paradise, there's always something or some sign to indicate that Dante is completing this journey while he's still alive. And this is very interesting because through my studies, you know, first you, you laugh about it, you say, how interesting. You know, he casts a shadow, he moves stones, and the damned are all indicating this and saying, oh, what are you doing here? You know, you're alive, you're supposed to be dead, but, you know, it has also some comic effects. But it's very interesting that throughout the work, he's always reminding me about this and I've asked myself this question, why? Why is he doing this? I know, you know, you don't need to repeat, but yet he finds it important to do this, you know, as if to say that the journey is here and now. Don't forget that. And Purgatory is all about that. It's possible. No matter how old you are, no matter what your experience is that the forgiveness is there and change is possible. And if you recognize the error. Because one of the things in the passage from Hell to Purgatory is that Dante seems. It seems necessary. Dante and Virgil come into contact with the body of Lucifer. Why isn't there just another tunnel to go around Lucifer and you go to Purgatory? No, he found it necessary to. To come in contact with the hairs and the body, to go down that. Almost as if Dante is saying, if you don't recognize the error and look it in the face, there is no change. There is no change that can start. There is no purging. If you don't recognize it once you see it, then it's traumatic. But you have to believe that there is that margin or the picture, the possibility of growth. Because if you don't, you just default back into the fixity, which is Hell. Hell is fixity. And Lucifer being so fixed into that ice, is the epitome of no change. There is a pride brought to an extreme where there is no growth. Sterility at its best there. Right. And I find it interesting that Dante is. In his journey. He's always indicating how difficult he is. You know, he'll faint, he'll have doubts, he'll need to be pushed on, you know, and he communicates. It's not a simple thing, you know, to actually grow spiritually and affirm life, which is paradise, you know, I remember listening to a professor giving the sum of what the Divine Comedy is for him. You know, he's saying, if Hell is fixity and there's no change, purgatory has to be the consciousness of knowing and identifying the error and changing and growing and education, you know, and then paradise, finally, the affirmation of life. Dante becomes self mastery. You know, he can decide, and he has power over his will. And. Yeah, that kind of. He summed it up that way. I thought it was interesting, the fact that this fixity that then in purgatory becomes this pilgrim who so humbly. And the humility, you know, having pride as the very first terrace almost at the base, that all sins kind of branch from pride and humility as being. All the virtues are kind of condensed in humility. Dante really stresses the humility part where you really have to kind of put that ego in check if there is going to be growth and change. I just wanted to add that."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":2947.34,"end":3108.66,"speaker":"Jonathan Pageau","text":"That's interesting. Yeah. One of the. It's that part where he goes down and he kind of crawls across Lucifer's body, basically, or it almost looks like he's being defecated by Lucifer. Like, he goes down. It's hard to go down the body. That's really. It's not. You see that in other stories. In, for example, like in Jonah, when Jonah goes down in the fish and he goes down into the. Into death. Like, down into where he sees the. Sees the pillars of the earth right down at the bottom of the world. When he is. When he comes back up, it says that he was vomited by the fish, right? That there is almost like. It's almost like you have to go all the way to the bottom. And it's as if death, like, vomits him out or like he's defecated by Lucifer. Like, he goes all the way, really to the bottom. And then it. There's this turn, this flip, right? And it's the flip of forgiveness, like you said, right? It's repentance. That's really the flip. At least in Jonah's story, it really is. That's the flip. It's like when you. There's a place in Jonah's poem which is very powerful, where he talks about. He's at the bottom of the water. He's in this fish. And then he says, I. Like, I remember, right? I. God has. I think he says, I remember the temple like I remember God's house. And it's that. That memory which is the flip. And it's the. It's the. The flip from death to life, you know? And there's this sense in the story, like I talked about, this idea of the ladder of divine ascent. And there's a sense in that ladder. If you look at the icon that I showed you, you can see the monks going up the ladder, and they fall from any spot on the ladder. So you're going up the ladder, and at any time you can fall down. And it's this idea of direction that. And humility is part of it, right? The idea of the willingness to change means that anywhere along that hierarchy, you can have access to the ascent, right? Anywhere in your life, at any moment in your life, if you have humility and you have repentance, then it can change. And that's pretty amazing. And it's actually. There's this sense that it's actually better. The direction you're facing is better than the place you are in the hierarchy to a certain extent. Because if you're that monk up on the ladder and you're all the way near the top and you fall down because of pride, it's better to be that monk at the bottom of the ladder who's close to hell, but who's looking up, you know? And so there's this sense that."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":3109.46,"end":3109.82,"speaker":"Fr Anco","text":"Yeah."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":3109.82,"end":3163.05,"speaker":"Jonathan Pageau","text":"So anyway, so I think that. That image of crawling down to the bottom and this turn. Because even geographically, it's really that moment in. Because almost as if the world turns, right? So what is the bottom now? Turns. So he goes to the bottom, and it's like the entire cosmos turns. And then he ascends from that low spot, right? Geographically, we can almost. Can't. You can't represent it. If you tried to make a drawing, if you are to represent. Because the mountain starts at the bottom of the pit. So you have the pit, and then you have the mountain starting at the bottom of the pit. But. But if you understand it that way, you're like, yeah, that's exactly it, right. If you think of it rather as going at the bottom of the water and then this turn, and then all of a sudden you're going back up remembering, you know, remembering and. And repenting. So, yeah, thanks for that. That was a great. I think that that's a good. Yeah."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":3164.41,"end":3272.69,"speaker":"Fr Anco","text":"The other thing I would add is one of the things that are often forgotten is that Dante starts his journey with a false start. And this. In my. In my teaching, I've also brought in Pinocchio, the story of Pinocchio also, which starts with a false start. You have Mastro Ciliechio, who starts to make a puppet, and this piece of wood speaks, and so he gives it to Geppetto. So there's a start, then, a false start, meaning that he won't make anything out of this wood. He won't use it, he'll give it to Geppetto, who in some ways is a different position. You know, a piece of wood can't speak, a piece of wood can't. But in Gepetto's position, there is the mystery, and the mystery still very much alive. Whereas Mastro Chilegio is the materialist. A piece of wood can't talk. There are not possibilities. But with Geppetto, there's the possibility, creativity, there is the creation. Then there's the whole connection and the symbolism with the creating of Adam. Right? With Dante, the same kind of thing happens where he's starting to go up that hill, he knows where he's supposed to go, but then you have the three beasts blocking him. There is a false start there, you know, he knows he's trying to take a shortcut to some place that. For which there are no shortcuts. And Virgil somehow, like in that Robert Frost poem, you know, the road less traveled is the one that brought to virtue and that has made all the difference. It's as if, if Dante, you really want to learn and grow."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":3274.51,"end":3274.79,"speaker":"Elizabeth","text":"You have."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":3274.79,"end":3329.9,"speaker":"Fr Anco","text":"To go another way. You have to go and come in contact with Lucifer himself if the change is going to be real and long lasting and authentic. So there are no shortcuts. It means, I think, you know, and Dante seems to want to underline this even in the. In the second canto of the Inferno. There is that kind of false humility also where I'm not a GNA, I'm not St. Paul, who am I? You know, he's being a coward. That's the false humility, you know, and he Seems to make that, that. Because then the humility at the beginning of Purgatorio is the right kind of humility, which doesn't mean that you shrink yourself towards life. You take on the mission, you go and with affirmative, but you put your ego in check, you know, you become creative and affirmative."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":3331.02,"end":3405.36,"speaker":"Jonathan Pageau","text":"Yeah, I think you're. I think you're bringing up Pinocchio is a wonderful image, because in a Pinocchio you really do have this. It's almost that someone who wants to understand emergence, you can understand in. Through this idea of Pinocchio, like you really do have this problem. Like you said, it's such a great. It's such an interesting problem to say piece of wood doesn't speak, you know, and it's like, I don't know, I mean, do you know what a chair is? If you knew what a chair is, you would know that a piece of wood actually can speak like a table. All the things that we give meaning to in a way have a voice that of course we participate in that voice. But material world does end up having meaning as it is brought together into something. But in Pinocchio you really also see this problem of the, you know, trying to make Pinocchio a good boy, right? Trying to make him a good boy by following these rules, do this, do that, but he has to kind of go down and plunge into the madness and the chaos and even his own passions ends up taking him. But it's down, going down finally. And when he finally does go down and ascend, that he becomes a real boy."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":3405.36,"end":3408.68,"speaker":"Fr Anco","text":"Yeah, he very much like Jonah and the whale."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":3408.68,"end":3409.2,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":3409.2,"end":3435.09,"speaker":"Fr Anco","text":"He ends up up in the fish and he. By the end of that story, what I found very interesting is that the fox and the cat will try to tempt him again after his whole journey, but he'll brush them off with a few proverbs, you know, he's ready, he's self mastering now, you know, and the Pinocchio Dante, you can really do some work there. The parallels are there."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":3436.09,"end":3565.9,"speaker":"Jonathan Pageau","text":"Even the animals, like you said, the tempting animals, the animals that end up being the cause of his fall. You know, if you see Dante coming up to these beasts that stop him from going further, and then you have these beasts that pull. You see that in, let's say, in this hierarchy of beings that I talk about in terms of St. Ephrem the Syrian, you have this beautiful image. For example, Saint Ephrem says that there were no animals in Paradise. We always have this image of animals, you know, the garden with Animals and everything. But if you follow the logic, he says there were no animals in paradise. And Adam went down the hill, would come to the gate of paradise, and then that's where he would name the animals by coming down to the limit. You know, Saint Gregor of Nyssa talks about how when Moses ascended the mountain to go up to the glory of God, that animals were not allowed to touch the mountain. And you can see that the Israelites stay at the bottom of the mountain. And what do they do? They make a bull out of gold. They make an animal, a golden animal. Right. And so this idea of animality at the bottom or at the limit, Right. Your animal aspects of yourself. In Scripture, they talk about the garments of skin, right? God gives Adam and Eve these animal garments around them of fleshy aspect of us, which. Which has a tendency to pull us away. You know, it's not evil, but it has a tendency to pull us because it has its own volition. You know, we have all these desires that pull us in different directions and that, you know, you have to, in a certain manner, deny the animal, you know, in order to ascend up the mountain. St. Gregor, Nyssa talks about removing the sandals, where Moses has to remove his leather sandals in order to go up to have the epiphany at the burning bush and same thing, leaving the beast, leaving the belly of the beast. In Jonah and in Dante, it's not as clear, but the fact that he has these animal block his way and he has to go down and around them basically to finally ascend. There's something similar going on there as well."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":3566.9,"end":3590.74,"speaker":"Elizabeth","text":"Mac, did you want to say anything about what Franco and Jonathan were discussing in terms of the descent and the meeting with Lucifer? Because we were just talking about that, actually in our last session, we were all fascinated with Canto 33 and that descending down the hairy shanks of Lucifer and trying to understand why it was that actual image."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":3592.03,"end":3824.67,"speaker":"Mack","text":"Well, I think it's really important to understand that, like, meeting your own, your own Lucifer is the only real way to humility, because you have to recognize that that's part of yourself. And like climbing up it or climbing down it, that's the journey where you're like, accepting that that is part of yourself and like, traveling towards the core of it. Terms of that hellishness. And it's okay, but now you need to start working towards that. The journey of change, right. With forgiveness and what Franco was talking about, when you recognize your own faults, which are the work of Satan in this context. Right. And ultimately try to integrate them into assets and building towards like a life that you live with, you know, values and a system of belief that respects other people. And you don't have to go to those lower pleasures like we were talking about in Franco's lecture last time. And ultimately, once you realize that, like the breakdown leads to the awareness which leads to the capacity to change, then you're ready. Like, that's, that's the point where you're ready. And for me, it took a lot of mistakes to get to the point where I'm like, I have to own this challenge. It's, it's difficult. But the only way forward is to have proper guidance and to have proper accountability, to not take shortcuts and, you know, act on those, those very alluring desires. Right? Because there's a lot of trickery in the world and I run into it every day. And people always try to pull you down to that animalistic place because that's where a lot of people reside. And I think to ascend past that, I need to sort of have people who've been down that journey tell me how to get to the point where I don't need to like, mingle with those kind of people, you know, and ultimately ascend past the point where, where that's fun anymore. Because I don't think the never changing life of, you know, lower pleasures and seeking the ultimate fix, if you will, I don't think that ever gives me a paradise whatsoever. And the only way to go there is humility, for sure. Because in my experience, I needed to lose every sense of pride that I had, every sense of accomplishment. Like I had to be nothing in order to inherit the earth. Like, it's kind of like that meek will inherit the earth thing that Jordan Peterson was talking about, where it's not really meek as in weak. It's meek as in basically stripped down and ready to inherit the earth. Like, the truth of everything only comes when we lose the constructs that are false. Like our own perceptions that are false. And I just. What are the spheres of heaven? That was pretty cool because I made a thing to perception. And like, as you evolve as a person and your perception changes and then you can see through the spheres of heaven. Is that close at all?"}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":3826.91,"end":3831.97,"speaker":"Jonathan Pageau","text":"Are you asking me why the spheres of heaven are the spiritual spheres?"}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":3831.97,"end":3832.21,"speaker":"Mack","text":"Right?"}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":3832.21,"end":3929.49,"speaker":"Jonathan Pageau","text":"They're the non physical, let's say the intelligences or the essences. As you see in the, in the quote that I mentioned where it talks about above, you have, as you ascend, you have more pure spheres or pure patterns. You could say it that way, something like that. And as you descend, then those patterns manifest in actual beings. So that's so the way, like Saint Maximus the Confessor, who is. He's definitely recommended if you're interested in these, these ideas or these mystical ideas he talks about, let's say, like I say, like the Christian vision is that as you ascend in a Platonic, very similar to a Platonic sense, where you, you, you suddenly see the patterns or you experience the pure patterns of reality, right? Then you also notice, like I said, the footprints of God below. And so St. Maximus talks about how as the mystic ascends and sees these patterns, these pure patterns of reality, he also notices that phenomena is not actually different from it, right? That it's actually those, those two are actually joined together in phenomena. When Dante says that, bound in a manner in which they can never be unbound, which is that the unity of the pattern and the multiplicity of the world are bound together in a way that is not. That cannot be completely unbound. Right? So the pattern of something needs its instantiation. So sorry if that's a bit abstract, but yeah, the other."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":3930.29,"end":4089.66,"speaker":"Fr Anco","text":"I would just add to that, that in those spheres, what's interesting is that they correspond to those seven liberal arts that form Dante. And the tone of the language will kind of reflect those liberal arts. But the, the people or the, the figures that he meets, very interestingly in paradise are people who actually did something about something. They're not their purging. They, they represent like St. Francis of Assis or the saying Dominic. No, they founded orders. They did something, you know, Cacaguida, Dante's great grandfather, who fought in a crusade, you know, Dante is giving you people who actually did something about something and were affirmative of it, you know, and many of the examples will correspond to something like that, right? Because one of the tragedies in the Italian school system over the years, and I think it's slowly changing, is that very little space was given to paradise or Purgatory. And everything was just read Inferno, you know, Inferno, you know, we like to joke about it. You know, these people, they're all trying to justify. We can relate to that somehow. Purgatory to some degree, you know, interesting because people are actually their purging. We can identify with that, you know, flawed people who have seen their error and their purging. But paradise seems so abstract. And today the reading of many professors is. No, no, it's like you're missing the whole point. If you completely discard paradise, you know, you're condemning yourself to a life of no change. So paradise actually has. Paradise now is seen in a whole different light. And I, of course, in my first readings, of course, I was into the Inferno, the Paola, Francesca, and all these characters that seem so full. But over the years, in reading it, you see how empty and how you have to have pity for the characters in hell because they're in that they're living the same day over and over. And I say that intentionally because one of the films that I sometimes use in my teaching is the film Groundhog Day with Bill Murray. If you've ever seen this film, I would really suggest it because he is living the same day over and over and over."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":4089.82,"end":4102.58,"speaker":"Jonathan Pageau","text":"Yeah. And also he follows a you. He goes down because he gives himself to his passions at first, and he's like, oh, here's a chance to do everything I ever wanted, no consequence. Then he kind of goes down and then he's like, okay, what's the point of this? Then he purges."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":4102.58,"end":4104.02,"speaker":"Fr Anco","text":"He's bored. He gets bored."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":4104.1,"end":4108.58,"speaker":"Jonathan Pageau","text":"He tries to become a better person until he can capture the beloved. Like, it's very similar."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":4109.22,"end":4125.93,"speaker":"Fr Anco","text":"Yeah, that film is fantastic because at some point he gets so bored that he starts committing suicide in so many different ways. And then he figures it out, and when he does, the next day comes. So people in hell are living the same day over."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":4127.69,"end":4308.88,"speaker":"Jonathan Pageau","text":"Yeah. Mack, I wanted to say something just in terms of what you talked about. One of the things also that this pattern that Dante, let's say, draws is also the pattern of the Church. And so this descent into hell is also baptism. It's difficult because in the Catholic tradition, let's say that the diving aspect of baptism has been a bit lost. But traditionally, baptism was dying. It's a form of dying. And if you read. Let's say I'm Orthodox, if you read the prayers at baptism, they're amazing. They're just amazing prayers. Because it talks about the monsters and the dragons at the bottom of the water and that there's all these creatures that are waiting for you. And so you go down into the water, right? You go down into the water and then you leave. The superfluous constructions that you talked about, like all your. In theory, the idea of baptism is to drop the garments, drop the animal garments, drop the. Leave the garments of skin in the water, and then ascend. That's why the. The people who would. Usually the tradition would be like, they would wear black garments, then remove the garment, go into the water, and when they came out, they were given White garments to be like these garments of light that you received as you ascend. And the baptism was traditionally also done at the entrance of the narthex. So the narthex is like this transition figure in the church. It's like limbo. It's like the limbo in Dante's structure. And so you have this intermediary structure. For example, in Orthodox churches, in the narthex, we often paint icons of Greek philosophers because they're just like in Dante's limbo, there are these marginal figures, these in between figures, that aren't completely taken up into the story, but are there. They have to be there somehow, because, you know, what are you going to do? You can't have Christianity without Plato's language. You can't have Christianity without the language of the Neoplatonists. Like, you just can't. But they're not totally inside. They're kind of like in this buffer zone in between. And so this idea of this buffer zone, and then you're baptized, and when you're baptized and you enter into the narthex, and in the narthex is the place of struggle. It's the place where we work out our salvation. Right, so it's purgatory. The nave is purgatory, then the Holy of holies. The altar, the sanctuary is the place where the divine meets the human. It's the top of the top of the mountain. Right. The paradise, let's say, the place where earthly paradise points up towards the higher spheres. So the structure of the commedia is also the structure of a physical church. Like the physical. Physically the structure of a church."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":4310,"end":4391.4,"speaker":"Fr Anco","text":"Yeah, I agree. I agree fully with that. There have been studies on the number system in the Divine Comedy, and some scholars have found across in each of the Cantiche, across through the number system, across in Inferno, across in Purgatorio, across, just like a medieval church formed as, like a cathedral built on the shape of a cross. So. And people like Charles Singleton, he did much of this work. And if you get into that, you're amazed. You say, how did he do it? How did he do it? Even, you know, the Italian will show you the rhyme scheme and how Dante's Terza rima connects each of the verses, which is lost in translation. But it's difficult to think that someone would actually sit down and work this out. And yet he did. You know, it's amazing the things that they find in the numbers. You know, the 7, the 3, the 1 and the 3, the 12. All very like in the Bible, the old and New Testament, these numbers, the Trinity and the three. Dante has created a work so systematically organized on these numbers."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":4391.8,"end":4457.79,"speaker":"Jonathan Pageau","text":"Yeah, it's a really an amazing thing. I mean, I think that it becomes less unbelievable if you believe, if you think that Dante's journey that he describes is something that he actually experienced. If Dante experienced that which he describes, then it's less surprising that he could write something like that, that somehow some of it is revealed. Like, I wouldn't say revealed the same way that I would say Bible is revealed because then I'll get into trouble. But that probably something of a mystical experience that also informed his writing. And so therefore the pattern would have been so intuitively grasped by his whole being that it would flow out of him as he was writing it. You know, that's the only way I can understand it because like you said, it's so dense and so worked out that you think, oh my goodness, how could somebody sit down and mathematically work out this whole thing? It just seems impossible. So, Jonathan, just a few comments on."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":4459.15,"end":4463.75,"speaker":"Fr Anco","text":"What'S the end result, maybe, or what."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":4463.75,"end":4465.43,"speaker":"Jonathan Pageau","text":"Is he looking for to happen in."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":4465.43,"end":4470.21,"speaker":"Fr Anco","text":"Himself or in other people who read this or travel on the journey?"}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":4470.53,"end":4587.72,"speaker":"Jonathan Pageau","text":"I don't know if that's a. I would say deification. I don't see any other. I'm sorry, it just seems like what he's talking about in the world, I don't know. I haven't. I haven't been deified. I don't really totally know. I mean, you have glimpses of it. You have glimpses of it, which is to fully realize, not in. Not just in thought, but in being the fully realized, the integrity of everything. Right. To fully realize how everything is connected through this hierarchy and that we participate in that connection and we are called to be joined as much as is possible with the source of all of it. I think that that's the point is that Dante is ultimately joined with God. I don't see. I don't see another. And it's hard to say because, like, I am enjoying with God. So I'm not, you know, I don't want to. I don't want it to sound like I'm being presumptuous, but it seems like that's what he's talking about. Like he's talking about illumination, he's talking about liberation, whatever religious type word you want to use, Nirvana, I don't know. Like he's talking about reaching freedom from manifestation, but also the fullness of, of everything. I don't see. I don't. That's What I see. But it, like I said, it's. And it's interesting. It's interesting that, that Franco, when he, when he talked about how we. Right now we're just obsessed with, with hell. Like we're just obsessed with Inferno because that's our world. Like, it's not surprising that that's what we're obsessed with. Like, that's the thing. The things in Inferno are the things with preoccupy. Preoccupy us in our society, those. So that's where we are. Like we are in Inferno. And so, you know, it's hard to be honest."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":4589.48,"end":4732.01,"speaker":"Fr Anco","text":"I agree. The thing about, you know, the depth experience that Dante is talking about and the infinity, you know, I think it was a lecture I heard of the Father, Robert Barron, he did a lecture on Purgatory and he made this comment on. I think it was something like this, that we're wired, we're hot wired for infinity and we look for it in finite goods which will never respond, our desire for infinity. And we won't get it until we find God put simply. Right. And Dante, I think, stumbled upon this, you know, when he talks about his experience with Beatrice, that experience evolved into something that doesn't happen with poets like Guido Cavalcante, for example, his friend who was Epicurean and the atheist. No. And it's very interesting. Dante will dedicate the Vita Nuova, his experience with Beatrice, to Cavalcante to make the point, to say Cavalcante, this is what you're not seeing, right? Because to make then Beatrice a vehicle towards the spiritual is the big innovation for Dante. That's how we distinguish him from the Dolce sti novisti poets that I studied, where he brings in this other element and the mortality, the death of Beatrice does it. He ends that work saying, I have to say something else, but I'm not ready. So he takes 10 years to read Boethius, St. Augustine, all these Father. And then finally when he starts writing it and his exile, they say really did it. Dante went through some pretty tough situations. He was at the head of his political reality in Florence. And having lost that, some people say that the exile was a blessing in disguise, that all the energy needed to stimulate him to do this was in that experience of the exile, you know, like Boethius in the Consolation of Philosophy, who loses everything. And from that, you know, comes this, this, this work. What do you hold on to when you've lost it?"}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":4732.01,"end":4822.27,"speaker":"Mack","text":"All right, yeah, I had a very similar exile, actually, like the same structure of exile wherein I had a reputation. I had a certain amount of followers, if you will, in this addictions counseling journey of mine. And people look up to me, and then it was all stripped away in an instant. And really knowing what was at the core of my being was the only thing that got me through that. Like, understanding that I was worthy of rebuilding a life that I was proud of and taking responsibility for that really got me through that exile. So I feel like plummeting from that high place, which was false pride. Looking back, it was entirely based on false pride, because I wasn't all that in the first place. It gave me that sense of. Of realness and just becoming a person who's part of something, like integrity. I love the fact that you mentioned integrity, because that word is just so powerful. Like, the full realization of integrity is like, I am part of the world, and I have a responsibility to be part of the world responsibly. Like, I have a higher calling, to be someone who acts integrally to the world. And I thought that was really interesting, too."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":4823.55,"end":4842.27,"speaker":"Elizabeth","text":"Jonathan, I have a question. Are you at all familiar with Kabbalah, the ancient Jewish mysticism? And are there any correlations that you see with Christianity? I know numerology is a really big part of that as well. I'm just curious about the."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":4843.13,"end":5084.99,"speaker":"Jonathan Pageau","text":"Well, I think it's a little difficult because the word Kabbalah is so big and so it's a twisted word because it means all kinds of things for all kinds of people. I think that there are some aspects of Mystical Judaism, let's say it that way, there are some aspects of Mystical Judaism which I think are actually quite powerful and very close to and can help us understand Christianity, can help us understand kind of our spiritual journey. And I think there are other aspects which are less so. And so the word Kabbalah is complicated because there are different strains. For example, you know, if you look at Lurianic Kabbalism, there are some aspects in Lurianic Kabbalism which are difficult for us because they posit the world as being, let's say, almost as if the world is fallen in itself, Right? And so Luria posited. And Lurianic Kabbalism is probably the most known form of Kabbalism right now. And so Luria posited this idea of the. What he calls the broken vessels, which is the idea that the world cannot contain God. And so when God tried to create, put himself in the world, then the vessels broke and shattered. And that's the fall. The fall is a cosmic fall. Before it is a. It's a fall almost at the point of creation, you know, so it's not totally Gnostic in the sense that it's not an evil God that created an evil world, but it's the idea that right at the instance of creation, the world fragments and falls apart because God cannot. The world cannot contain God. And so then the rest of creation, the story of creation is the restoration of those broken vessels. Right, Right. So I think that that kind of thing is. That type of thing is problematic in terms of. At least. In terms of understanding. At least. It's not the Christian understanding of the world. Like the Christian understanding of the world is that all is good, that the world is good, that the world is not bad. It's not. And that, like when we talk about Dante, it's rather that all things can participate in God to the level at which they are. Right. And so the world is actually full of God's glory. The world is full of his glory. But the problem is only when we tend to want things to not be in their place. So pride is the reason for the fall. Not a cosmic accident or not a cosmic mismatch, but it's rather pride. So it's things that don't want to be in their place. That's what causes the fall. So I'm just giving you a little example just to say that Kabbalah has been, in a way, kind of deluded in popular culture as this just basic thing. But it's not. It's just. It's a really complex. And so if you read. So if you read, let's say, very, very, very abstract texts, it's different from, let's say, more magical Kabbalah that is more practical and more based on spells. So if you read the Zohar, in the Zohar, you find spells on how to do this and that and this and that. You know? But if you read the. The name of the. Forget the name of the book, which is horrible, it's gonna come to me. But if you read the more abstract text, then it's different. It's just a different thing. So I would say that. Yeah, I would say that one of the problems is that it's just been diluted in culture to a point where I don't know when people use that word, what they're referring to."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":5086.27,"end":5086.75,"speaker":"Fr Anco","text":"Okay."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":5087.31,"end":5113.99,"speaker":"Elizabeth","text":"Because I know that a basic tenet, if you like, of Judaism is that concept of tikkun olam, which is repairing the world. And if you help one person, you're really connecting to make the World a better place. But that sort of, in my mind, kind of resonated in what you said about action and then. And what Franco said about needing to act, to actually do something."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":5115.35,"end":5144.05,"speaker":"Jonathan Pageau","text":"I agree. No, I think that the idea of restoring creation, I think that is true. That is our function. And so in a way, maybe in the end, the acts that we pose in terms of restoration and in terms of love, like in Christianity, we would say love. We would say that the world exists through love. Right. And love is the manner in which multiple things exist in unity without dissolving their multiplicity."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":5145.09,"end":5145.49,"speaker":"Mack","text":"Right."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":5145.73,"end":5192.97,"speaker":"Jonathan Pageau","text":"So multiple people exist together in one, let's say a family that loves each other, but that unity doesn't destroy the different members of the family, doesn't suck one into. Doesn't suck the multiplicity into the unity. So this balance between multiplicity and unity is the way in which God revealed in the world. It's through love, and it's the mode of being of God. So, but, so like you said, so maybe in the end, the actions that people will pose will resemble that through this, through this, this gathering of the vessels. It's possible. It's possible. But I also don't want to. I don't want to gloss over the differences. Like, I don't want to gloss over the idea of an ontological fall."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":5194.28,"end":5194.52,"speaker":"Mack","text":"Right."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":5195.24,"end":5216.76,"speaker":"Jonathan Pageau","text":"Like a fall which is at the very root of creation, which is something that we. That at least as Christians, we don't want to include in our system, that the reality at the outset was fallen. I don't know if that makes sense. What I mean, the difference, let's say."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":5217.48,"end":5256.49,"speaker":"Elizabeth","text":"Maybe it's just the language, because Judaism doesn't believe in the concept of original sin, for example, but the tree of knowledge has great, you know, symbolic meaning in terms of awareness of the duality of life and good and evil. And then the concept of free will versus the patterns of reality that you expressed or, you know, that. That, you know, that's always been a fascination for me. How those two things can coincide and how much do you need one or the other."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":5256.81,"end":5258.49,"speaker":"Jonathan Pageau","text":"Right, yeah, that makes sense."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":5259.37,"end":5262.93,"speaker":"Elizabeth","text":"Balance of free will and predestination or whatever words you want to use."}
{"episode_id":"SW - #137 - 2021-01-19 - Diving Into Dante's Divine Comedy","start":5262.93,"end":5398.19,"speaker":"Jonathan Pageau","text":"Yeah. The will of God, let's say, and the will, our individual will, how those join together in a dancer of some kind, some kind of symphony of different levels of being that. That kind of play together and interact together. I think in terms of the. In terms of original sin, you might find it surprising that the orthodox also don't believe in original sin. So it's not all Christians who believe in the doctrine of original sin, not in the sin, not in the sense of sin being transmitted like through the line. Now this idea that we inherit the sin of Adam is something that is not it's just not present in in Orthodox thinking. There's an idea of inherited death that we inherit the we inherit death through Adam, but we don't inherit sinfulness. So we don't have so the Orthodox don't have a doctrine of immaculate conception, for example, because we don't need it. Like we don't need this doctrine that, let's say Mary was born without sin. Because we don't believe that you're born in sin, you're born with sin, let's say I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want want to get involved, you can also support the podcast financially going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
