{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":0.32,"end":72.73,"speaker":"Jonathan Pageau","text":"So, hello, everybody. I am here with John Vervecki. Many of you, most of you, pretty much everybody who's watching this will have seen a video with me and John Vervaeke before. And also John had a discussion with Jordan Peterson a few months ago. And that discussion, in that discussion, many things came up that were related to also John and I's discussion and then Jordan and I's discussion. And so Jordan, someone in the group had the idea of doing something with me, and then that added Bishop Barron on top of. And so a few weeks ago, we had a discussion with Bishn Behram, which is going to be online. I'll link it to the description many of you may even have seen was a very interesting discussion, one which at first tried to find its way, and then suddenly we really felt like it just kind of took off and many interesting things were said. So John and I thought it would be a good idea to dive back into the things that we talked about and explore them even more. So, John, thanks for coming. This is Jonathan Peugeot. Welcome to the symbolic world."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":83.3,"end":86.26,"speaker":"John Vervaeke","text":"It's a great pleasure, Jonathan. And it was my idea, by the way, to include you."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":87.46,"end":88.66,"speaker":"Jonathan Pageau","text":"That's very kind of you."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":88.82,"end":105.3,"speaker":"John Vervaeke","text":"Well, no, because, well, friendship was part of it, but the other part of it was you were very much a ghostly presence in the conversation I had with Jordan. And I felt it was unfair ultimately, to not allow you to actually be present and be involved. So that's why I suggested it to Jordan."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":105.46,"end":111.22,"speaker":"Jonathan Pageau","text":"And it's interesting because with adding Bishop Barron, the conversation definitely morphed into something completely different."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":111.46,"end":111.94,"speaker":"John Vervaeke","text":"Yeah."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":112.18,"end":153.52,"speaker":"Jonathan Pageau","text":"Yeah, because he's not involved in this kind of inner. The way that we've been talking about religion, let's say, for the past several years, you and I and Jordan, in our different ways, but kind of coming towards similar ideas about phenomenology or in your sense, more kind of cogs. I and Jordan's evolutionary approach. All of this is kind of coming towards something. And Bishop Barron is just dropping out from outside with. With a more kind of Catholic, Thomas and Augustinian way of thinking. So for me, that was one of the most interesting things, was to watch the discussion move towards a direction where all of a sudden I could see in Bishop Barron's eyes that he was like, oh, this is like, there's something else going on here. There's another type of discussion."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":153.68,"end":174.04,"speaker":"John Vervaeke","text":"Yeah, he just wrote. I just read it this morning. I didn't read it thoroughly. I just read parts of it. He wrote a blurb, a blog about. And yeah, he was very clearly appreciative in all three senses of the word of the discussion. And so I think your observation is accurate."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":175.24,"end":213.38,"speaker":"Jonathan Pageau","text":"I think that this is, to me, it was exciting because I think that the discussion we're having and bringing it back to the human experience in a way that a lot of the arguments that have been going on in the past few hundred years, a lot of them have been arguing religion from a sociological perspective or from a scientific perspective even, which is. That was always the worst, the worst one. But, you know, a lot of it from kind of a more philosophical, metaphysical perspective. But the way that we're trying to bring. Come towards it, although it does include metaphysics and sociology and all of that, it brings it back to the. To this just the way that we experience the world and how it's coherent with those. Those experiences."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":213.78,"end":289.91,"speaker":"John Vervaeke","text":"Yeah, I think that's. I think that's right. I think. And part of what we're doing is trying to articulate and explicate and elucidate the relationship between these things. So what I'm going to say isn't going to be terribly clear. But, you know, there's this. Not only is there a convergence between us, and I share that with you, by the way, that sense, and I'm appreciative of it, I think, you know, there's this convergence around, you know, things, these topics of meaning and wisdom and transformation and connectedness and the central roles of, you know, intelligence in an ancient sense, and attention, the way they're bound. That's what I want to say. The way intelligence and attention are bound up together. All of these things are coming together, I think, in a very powerful way. And I think that convergence between us and between those terms and concepts and topics is also resonant. It's not identical, but it's the deeply analogous to some of the convergence I see happening in sort of the broader culture, at least aspects of it, or what Savella King calls this corner of the Internet. Yeah, it's getting to be a pretty big corner, but yeah, I appreciate that."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":290.23,"end":339.71,"speaker":"Jonathan Pageau","text":"Yeah, it's interesting because this corner of the Internet also, it has its different branches and different emphases, but it definitely is this kind of convergence. I would say the way that I see it is also an exciting opening. You could say it like that. There's an exciting opening where things that people before didn't. Couldn't understand or wouldn't or didn't understand, all of a sudden they're starting to get a sense of what it's about. No, I mean, the Basic idea that religion was superstitious, that religion is silly, that it's just a, you know, that you're, that it's just added on to our experience. You know, this is. Was the common understanding, not for everyone, but it was like a common understanding that was floating around in culture. But now that seems to be breaking down and people are excited to now be able to understand things that before just didn't make any sense to them at all."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":339.95,"end":413.34,"speaker":"John Vervaeke","text":"Yeah, it's. I agree with that very much. I mean, I mean, I think there's a bifurcation. I think that that's happening. There's a, you know, way before COVID even before I did, you know, awakening from the meaning crisis that I was reading about people talking about the religious turn within phenomenology, that that was a broad movement happening. And then you saw, I saw within the emergence of 4E cognitive science that these, these themes that were previously considered. Woo, woo. Mindfulness and mystical experience and wisdom and meaning and transformation and even, you know, the sense of the sacred, these are now coming into. These are legitimate topics again. And it's been a very rapid increase. On the other hand, I also see the ramping up of the machinery of distraction in our culture and the machinery of surrogacy where we're going to replace the real pursuit of meaning and wisdom with surrogates, some rather innocuous and others really, really toxic. So I see both of those happening and that's not a contradiction. I think they're both happening for the same reason."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":415.29,"end":471.19,"speaker":"Jonathan Pageau","text":"So yeah, that makes a lot of sense that there's a zeitgeist that's kind of pulling things, pulling apart the ancient. The ancient. Well, the. Not the ancient, the modern world. He was kind of pulling it apart and now people lost in their, you know, the, like. The phenomena that is bringing us this new understanding of religion is the same phenomena that brings about viral videos on the, on YouTube. Right. All of a sudden we realizing how much attention is part of the way the world manifests itself. But in that version, like the viral video on YouTube is really the broken down version of it where all of a sudden things pop up, take up all the attention and then vanish and then pop up, take up all the attention and then vanish. This super rapid cycle of attention. But like you said, if you take those two phenomena together, it points us to people understanding or becoming more aware of attention. The problem and the opportunities of attention."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":471.35,"end":526.62,"speaker":"John Vervaeke","text":"Yeah, I think it's a case, I think this is consonant with what you're saying. It's A case of one group of people. And I'm not trying to do an us, them thing. I'm just trying. Right. People who are becoming aware of the centrality of attention and what I call relevance, realization and connectedness and the human need for both grounding and self transcendence and both individuation and participation in the community, all of that. And Covid, I think, highlighted all these themes. But then there's people who are not so much aware of it, but embodying it. Almost like in a psychoanalytic sense, they're acting it out, the importance of attention and salience and relevance, but they're acting it out in a way that's generally not fruitful for their own flourishing or the flourishing of the people that they're. That they're living with or living in connection with."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":526.7,"end":570.83,"speaker":"Jonathan Pageau","text":"Exactly. Because it. Also. Because the Internet has afforded a space where the relationship between attention and power has been increased, you know, by thousands of times. And so all of a sudden, people understanding that. That how attention is a. Can be a weapon, right? And attention can be a. A way to dominate and can be a way to seduce and be. All these things are kind of coming up to the. Coming to the fore. But instead of in a little village where you realize that you can do things to. To manipulate others or to kind of you, now you have 100,000 people, you know, 100,000 people under you that can act as your body to. To kind of. To act out in the world. And, yeah, I mean, we see the results of that."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":571.18,"end":651.45,"speaker":"John Vervaeke","text":"Yeah, the Internet's kind of like Tolkien's the One Ring, right? It's just this magnifier, right, in some fashion. And it can magnify, you know, for the hobbits, it magnifies their sort of, you know, diminutive sneakiness, and they can become invisible. But for Sauron, it magnifies his cruelty and his might. And so, yeah, I think the Internet is very much like the One Ring in that fashion. And maybe that's. Maybe that myth coming to mind isn't totally just ephemeral. I mean, part of it is we are not doing what. One of the strongest recommendations of that whole fantasy series is to step back and really reflect and think about what's our relationship to the One Ring, and should we be picking it up and should we be more wary of it and things like that. And I do worry that we are running this grand social experiment with social media and with phones on ourselves and the next generation. There's already some preliminary evidence that's Having an impact. And we don't know what this is going to do. We're doing something that is ten times more powerful than the printing press. And the printing press unleashed forces that then turned to bloody religious war in Europe in an unperceived fashion. And so I do not think we are exercising proper care around this, that's for sure."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":652.49,"end":694.06,"speaker":"Jonathan Pageau","text":"Nova gets too big in. It is like. You know, when we talk about this is when I look at the Internet and I look at social media, it's the closest thing I have to understanding a kind of. How can I say this? A God acting in the world in the sense that like, you know, like a pagan deity that is embodied in ritual and in practice and in, you know, nodes of attention, because it's just. There's no one controlling it, but it still seems to have a will and seems to be going towards atelos. And everybody sees it and nobody can stop it. And everybody says, well, at least I'm going to get what I can get. As I watch this God kind of move towards its sacrifice or whatever's going on, but everybody's like, well, at least I can get something out of it while it's happening."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":694.46,"end":704.98,"speaker":"John Vervaeke","text":"I think that's a very apropos way of thinking of it. I often use Thomas Merton's idea of a hyper object. Not Morton. Morton. Thomas Morton. I misspoke."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":704.98,"end":707.18,"speaker":"Jonathan Pageau","text":"Yeah. I was surprised that he would have a term like that."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":707.18,"end":707.9,"speaker":"John Vervaeke","text":"No, no, no."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":708.46,"end":709.66,"speaker":"Jonathan Pageau","text":"They're like hyperobject."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":710.18,"end":752.17,"speaker":"John Vervaeke","text":"Sorry. And so Morton's idea in hyper objects is that there are things like, you know, the Internet, global warming, evolution. They're realities, but they don't. They're not like bodies. They're not spatially temporarily located. They're distributed. Right. And we can't actually sort of conceive of them. Like, we can have terms referring to them, but we can't sort of, if you allow me, the science fiction reference. We can't grok them. We can't. You can't sort of really get. And so we. But they're not abstract things over there. Right. They're insinuating themselves into the very fiber of our being. Yeah."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":752.17,"end":755.57,"speaker":"Jonathan Pageau","text":"They have more subtle bodies, to use a religious term."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":755.97,"end":852.13,"speaker":"John Vervaeke","text":"Yeah. And I'm fine with that. And you see a similar kind of move in later Neoplatonism, where proclus and the elements of theology. And he's trying to work out all of these principalities and powers and principles, and I think the relationship that a lot of people have to the Internet is properly understood as a religious relationship. I mean, the Internet serves as an oracle. Think about that. I mean, think about the devotion people, they want to live in its world and like you said, they have a sense of it having a life and power of their own that people want to be in service to, but they also want to appropriate that power. It's very much. It's almost like, you know, ball or something from the Old Testament in that fashion. And so I think that's, again, just to circle it back. I think that's again, the reason why these things are coming together. And you talk about this better than I do. Right. Is Right. What we're talking about about the Internet and what we're talking about, about this meaning wisdom movement, about religion, those, again, they, they, they might seem like opposites or in opposition, but. But there's a deep underlying common ground that they're both pointing to again. Right. This phenomena. I don't think it's a coincidence that the Internet and the shared universes of Marvel and all of this are also occurring at the same time as this return to an understanding of the depth and importance of religion. I think those are completely. They belong together in terms of a unified explanation."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":852.49,"end":896.36,"speaker":"Jonathan Pageau","text":"Yeah. There's an interesting thing that I've been realizing recently is that one of the aspects that seems to have happened in Christianity, but probably has happened in Buddhism as well, because it seems similar, is the understanding that ultimately the sacrifice is a sacrifice of, we say a sacrifice of worship. That's how the Christians will present it. Like when we go to Vesper's service, we talk about the evening sacrifice and it's a sacrifice of worship and it's to actually understand that sacrifice is attention. That's what sacrifice is. Right. And so it's this the way that you attend. When you attend, you kind of give your attention to the thing that you are attending to. And at the same time you're also sacrificing the things next to them. Right. You're focusing."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":896.36,"end":897.64,"speaker":"John Vervaeke","text":"Yes, yes, yes."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":898.6,"end":950.81,"speaker":"Jonathan Pageau","text":"And that seems to be something which with the Internet is now accelerating so much that it's almost impossible not to notice that that's what it is, that the Internet is like a monster or is a being that lives through attention that requires our attention to exist. Like Neil Gaiman. I don't know if you know a little bit about Neil Gaiman. He wrote a lot about that. Like in some of his series, even in American Gods, he had this idea that these gods exist through attention. And if you don't give them attention, then they weaken. If you give them attention Then they become stronger. I know for all my criticism of Neil Gaiman, that's a really powerful understanding, and I think one that is actually very Christian like that. We really do have this idea that as we move away from the physical sacrificial system in ancient times, we move towards a world where we understand sacrifice as attention itself."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":952.17,"end":1059.54,"speaker":"John Vervaeke","text":"I think that is so consonant with the model that's emerging by Wal and others. Wu, the Cogsci of attention. We're moving from a rather simple model of attention as a filter to that what's actually happening in attention is prioritization. The function of attention is to prioritize. That means, I think, quite correctly, like you said, that good attention is proper prioritization. If you think of it that way, that you're prioritizing the things that should be given priority. And I don't know if this is adequate, and I'm not claiming that it is, but I can see why notions of worship and sacrifice are bound up together. There's two sides of the same coin of the idea of trying to give proper priority. You know, to quote Aristotle, and people don't understand it. You know, first things first. Right. And people think that just means the first thing on your list is the first thing you should do. That's not what Aristotle means. No, he means that the task is to realize what the first principles are and. And to prioritize them over things that are less central to being and to truth, et cetera. And so. And I think of that as the virtue of reverence. And I think reverence is to properly realize the relevance of something that should be given a priority, even over yourself. And that's where it starts. Yeah, that's where you start to get the notions of sacrifice and worship, which I like, I say if you go away from sacrifices, killing something. Right. Which is. Which is usually focal in people's mind to this idea of prioritization and a recognition and acknowledgement of priority. Then I think I'm in agreement with what you're talking about."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":1059.7,"end":1064.5,"speaker":"Jonathan Pageau","text":"Yeah. And the idea of killing something is always the wrong way of understanding sacrifice."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":1064.5,"end":1064.9,"speaker":"John Vervaeke","text":"At least."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":1066.9,"end":1104.38,"speaker":"Jonathan Pageau","text":"At the first level. It often involves killing something, but not necessarily. There are sacrifices of grain, sacrifices of. Of oil, all these different sacrifices. It has to do with offering up. You take something that's precious and then you give it up towards something which is above you. And that's exactly what attention is, and that's what prioritization is. One of the interesting things I wanted to ask you about, because there's something that I've been thinking about and there's several priests that are thinking about this right now. Is that in the Jewish law, like in the Hebraic law, during Yom Kippur, which was the day of atonement, right? The day of make becoming one. Right. There were two sacrifices."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":1104.38,"end":1104.94,"speaker":"John Vervaeke","text":"And this."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":1104.94,"end":1148.91,"speaker":"Jonathan Pageau","text":"I. I'm wondering what you think about this in terms of attention. There was a sacrifice which was offered up and was used to purify the space. Then there was a sacrifice which was cast away, a scapegoat which was sent out to Azazel, which is a demon out in the wilderness. Right. And so to me, like this is what I've been thinking about in terms of attention, which is attention seems to have two parts to it. One which is a concentration focus, right? Prioritization. But another part which is like a cutting off at a circumcision, a cutting off of. You have to be able to kind of chop off the things that are pushing in or trying to take over, let's say. And then, so it's like a double movement, one of focusing and then one of pushing away. I don't know if that's something that is consonant with."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":1149.07,"end":1243.27,"speaker":"John Vervaeke","text":"Yeah, I think it is. And I'll need a little bit of space. But what I mean by that is it like, I think the prioritization function. So what I mean is give up the old model of there's input and then there's processing and then there's output. The new, the newer model is there's a sensory motor loop. As I'm moving, I'm sensing, as I'm sensing I'm moving and there really isn't anything. There isn't a homunculus willpower out there. Instead there's something more like character. There are sets of constraints on this. And then what we're doing and we remember and attention is self organizing like that because we both direct attention, but attention also directs us. And so, right. What we're trying to do is, what I'm trying to get you to see is a new way of thinking of what decision is like. Instead of thinking of decision as the executor behind it all, like doing this, think of decision as exactly what you're saying. So a way of thinking about this is attention is both ruling in and ruling out. It's what's ruled in and what's ruled out. This is analogous. One of my former students, and now colleague Corey Lewis, talks about this in the Philosophy of Science. He talks about that what laws do is they rule out. They say not no no, no. And that what models do is rule in. This is what you have to bring in and this is what you have to prioritize. Right. In order to do your thing. And so in an analogous fashion, attention is making decisions of ruling in and ruling out. Did that help?"}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":1243.27,"end":1311.94,"speaker":"Jonathan Pageau","text":"No, that makes a lot of sense. And it makes a lot of sense. And also if you think of things like ancient law, like ancient Roman law, the way that it worked, there were two aspects of the system, one which was atoritas and potestas. Right. And so potestas were the actual rules, like the, you know, like the. Or the military or the embodiment of like what you're not allowed to do, the police part of it. And the other one was a tortas, which was the model, like you said, the. The thing you follow the person you model your life on, you know, someone who inspires you to be a certain way. It was like a direct, non explicit model. And then the other one is like an explicit set of rules that is lacking the more direct part of it. So it ends up being like a kind of like a right hand and a left hand of how the system works, let's say. And you can see that with like the idea of the saints and then the canons of the church, for example, where you have models you're supposed to follow and then you have a bunch of things you're allowed to do or not allowed to do, like all these rules that are more kind of, let's say, more precise and more kind of about. Yeah. Which you're not allowed to do, let's say."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":1311.94,"end":1333.43,"speaker":"John Vervaeke","text":"Yeah. I mean, so one. One way of thinking about it is attention has the function of constraining possibility. Right. This is impossible. Right. And so it's structuring that, or at least this is highly improbable. And this is even in predictive processing, models of attention. But you also need. Attention is also aspirational. Right."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":1333.67,"end":1335.03,"speaker":"Jonathan Pageau","text":"That's a nice word. Love that."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":1335.27,"end":1455.83,"speaker":"John Vervaeke","text":"Yeah, yeah. So it's trying to disclose the affordances by which we can more properly come into conformity or transformative relationship to what's real, what's happening, what's relevant, what's pertinent, all this sort of stuff that I tend to obsess about. But yeah, yeah, very much. And then the idea also that's happening with attention that goes into this is to not have a Humean model of attention. So the Hume and model of attention is the static, impersonal observer and toads, in his book on body and mind says that's why Hume can't find causation in the world, because his model of attention is a pure passive spectacle of observation and not moving around, engaging. And so the other thing is to. This goes with Christopher Moll's work, that attention is adverbial. It's a way of modifying other things you're doing. So let me quickly point out what I mean by that. Like, we tend to think of attention as a spotlight, and we shine it. And there's truth to that, because light makes things stand out. And that's what attention does. It makes things more salient. But the thing is, and Mole points this out, but attention isn't like walking. I can say to you, walk. Get up and walk. And you. Okay, now if I say to you, start. Start practicing, you'll say to me, practice what? Or if I say, train, begin training. You'll go train what? The things we do that we do by modifying other things. And if I say to you, you have to do this a little bit more subtly to bring it up. I say, I want you to pay attention, but I don't want you to pay attention by changing how you're looking or how you're listening or how you're remembering or how you're coordinating looking, listening, and remembering. I just want you to pay attention. And you'll say to me, I don't know what that means. Right. Attention is a way in which. This is what I mean. It's more adverbial. It's a way in which we're modifying our connectedness to reality. And it's not like. It's not a beam coming out of our head. It's a shaping of our whole orientation and connectedness to reality. It's a much more comprehensive thing. Does that make sense?"}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":1456.23,"end":1504.81,"speaker":"Jonathan Pageau","text":"It makes a lot of sense. It makes a lot of sense because at least in. At least in kind of the orthodox perspective, theological perspective, there really is this idea of synergistic relationship, like, synergistic relationship with God, where, like you said, there's an. There's a sense in which you're kind of called like you're called for. And then you. You kind of move forward. But that also affects the amount of calling or the direction of calling. So it's. It's something that's. It's very difficult to fully separate and say something like, you know, like, that's God acting. That's you acting. It's like, no, it's this. It's this constant moving between this call towards your. Your own telos and then your capacity to embody it, and then it modifies the direction. So it's, It's. It's. Like you said, it's a more kind of. It's a synergistic model in terms of how we took transformation."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":1505.05,"end":1528.42,"speaker":"John Vervaeke","text":"It's synergistic this way. Exactly. There's the calling, and it's not action or passivity. It's participation. Yeah, but it's also, it's also. It's also synergistic this way. It's. It's not sort of a Cartesian theater or Locke in theater. It's the whole person. Like, if I would put it in a slogan and take it. Take caution around that, because it's a slogan. But you attend with your whole body. You don't just attend with. Sort of through."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":1528.42,"end":1529.34,"speaker":"Jonathan Pageau","text":"Yeah, with your brain."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":1529.58,"end":1635.73,"speaker":"John Vervaeke","text":"Yeah, right. That's what I'm trying to get at. And then another dimension of that is the fact that attention is often shared. Like distributed attention is a significant part of distributed cognition. So weight, like children, if you watch babies, like they. Joint attention in that loop that you're talking about, not like between people, is what makes language learning possible. Like attention is there primordially joint attention. And we take it for granted. Like when I point, you look. You try and trace out my attention of attention. But if you point like to any other animal, they look at your finger because you made it salient. Right. And notice how kids. When kids are at the one word stage, they supplement it with pointing. So they use joint attention to make meaning. To make meaning clear. So again, it's more whole person. It's more dynamic, and it's more shared and joint. I mean, it's funny. You'll like this. There's. There's a line in the Psalms that is. Become sort of resonating with me as I get into this. Was. There's a line where it says deep calling to deep. Right. The deep calling to deep. Right. And so that. That's. That's sort of my. I don't know what to put. I don't mean. I'm not trying to be sacrilegious anyway. I'm trying to be say something that stands out for me. That's kind of a biblical motto, I guess I have for this, for the way of thinking about this. And it is properly, again for me, because it. Again, it brings up this deep connection we're talking about between all of this and religio. Right."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":1636.45,"end":1693.14,"speaker":"Jonathan Pageau","text":"So here's a question in terms of study, because this is something that I've been talking about. And thinking about. But I'd like to know your opinion on it. It seems that we have something also about common joint attention. We seem to search out places and moments where we can all attend to similar things as a group. Right. So you go to a concert, even just in terms of entertainment, why do you go to the movie theater? Like, we all sit together and then we watch. Of course there's the big screen, but there's something more than the big screen, which is why we like watching movies with friends and with family. And so it seems like there's also something in terms of that there's a transformation which occurs through common attention. And that seems for the good and ill. Right. And so I have the image of Hitler with like 100,000 people all standing in front of him and just giving him all their attention and it acting as like a catalyst for something insane. So I don't know if people have studied that or talked about very much."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":1693.62,"end":1873.91,"speaker":"John Vervaeke","text":"Very much. I mean. So first of all, it goes directly to the point I just mentioned. And people like Tomasello and others have made that apparent. How much of our cognitive development depends on is afforded by joint detention, the capacity for joint detention. And you think about why this would matter to hunter gatherers. Like joint detention is absolutely crucial for coordination, social coordination. It goes towards the work that Dan Chiappi and I have published about scientists, the NASA scientists controlling the rovers on Mars and how do they coordinate their attention. But it also goes towards this. Think about how this works both internally and externally and how they reinforce each other. Notice, and we know this even for young children, psychologists have the settings in of giving multiple names to the same problem to the same phenomena, or calling two different phenomena by the same name. It's called the Jingle Jangle problem. It's known by many different names. Intersensory hypothesis and blah blah blah, Intermodal and blah blah. Okay, but they all are talking about the same thing. That a child will prefer to look at a stimulus that it can both see and hear over a stimulus it can just see or that it can see and hear and touch. Right? And then there's good reason for this. If you have just. I'll use some cybernetic language. If you have just a single channel, the chances that what you're seeing are due to subjective bias or distortion are quite high. But if I have two independent channels, the chances that the result is due to bias are reduced precisely because of the increase of that convergence. That's, by the way, and it's not just sort of fascism. The Reason why we like numbers is because numbers allow us to coordinate the senses. You can see three, you can hear three, you can touch three. Three allows us to bind the senses together. And what that does is, in using Rescher's terms, that increases the trustworthiness, not certainty, but it increases the trustworthiness of the information we're getting. Now think about this. And Plato brings this out in the dialogues, when we can do that with each other. So it's not only within my senses, but between how all of us are trying to make sense. Think about how that massively increases the trustworthiness. You know, Aristotle treated it as one of the three marks of realness. If, you know, if you had rational, intersubjective agreement that it must be real, we know that that's not right. Things we can get that agreement, like you said, blur. Right. And it can still be false. So that's why you shouldn't confuse trustworthiness with certainty. But trustworthiness is valuable, right? Yeah, I mean, it's very valuable. And so it's. We want to share with other people what's happening because it makes it more real for us in a deep sense. And therefore. And the way you afford. Right. That what are you converging? You're converging attention. You're converging attention. So that would be my explanation for that."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":1873.91,"end":1926.11,"speaker":"Jonathan Pageau","text":"Yeah, that's a really wonderful. I mean, when you say it that way, it makes so much sense. It's just completely reasonable to understand that if you have a group of people and you're attending to something, it increases the reality of the thing you're attending to because you're constantly aware that, okay, so here's a hundred people. They are all attending to the thing I'm attending to. So maybe I need to attend to it. Like, maybe there's something real about what's happening, or more real than a more idiosyncratic moment, let's say. But this says a lot about our situation right now, because I have young children, and to imagine they spent months and months sitting alone on zoom, watching their teacher, or even in class with masks on where you don't see other people's faces, this has a major effect, I imagine, has a major effect on their capacity to pay attention and to kind of make sense of what's going."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":1926.11,"end":1969.14,"speaker":"John Vervaeke","text":"On, I think it has a. I mean, I think children are going to be especially sensitive to it, especially young children, but I think it has an impact on everybody. So one of the things, because I was, you know, I was talking to people During. During COVID about this. And one of the adjectives that kept coming up was one of these two adjectives. Things seem unreal or they seem surreal. There was a sense of losing touch with reality because the capacities for joint attention were being truncated or they were being transferred to this weird kind of joint attention that we have right here, right now, which is very odd for us. It's a very odd kind of joint attention."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":1969.3,"end":2018.13,"speaker":"Jonathan Pageau","text":"Yeah. And that gives me another layer of understanding of the Floyd protest because. Because for me, that's been something that I've been trying to understand so much, but that all of a sudden puts another layer on it, which is that people for months had been starved of joint attention in many ways. Right. Whether it was sports or religion or whatever clubs that people participated in, whatever concerts people went to. And it wasn't necessarily a conscious thing, but they were just starved for attention. And then all of a sudden, when this point of attention, very salient point of attention, appeared on their horizon and the opportunity to kind of join together and celebrate, or I mean, it wasn't celebrate, but in the general sense of just kind of getting angry about the same thing. And so it just exploded into these moments."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":2018.77,"end":2112.78,"speaker":"John Vervaeke","text":"I think that's true. I mean, you and I have talked about it besides whatever, and I think there were legitimate reasons about social justice and about inequity, and I think those are real. But I think above and beyond that, there was something else that was being poured into this and it still reverberated through. I think you see that there's many instances of this kind of hunger. One of the things we're discovering about attention is not only is it bottom up, it grabs our attention. It goes from features to the gestalt. And top down, we can direct it from sort of larger gestalt to specific details. But there's also what you might call a historical dimension. Attention is not only organizing up, down, it's organizing past, present. Your previous history of what you're paying attention to has an impact on what will jump out for you as salient right now. With Tim Leathercraft and Blake Richards and I, we tried to actually put that into our relevance realization model that there's these opposing tendencies to try and stay with something if it's sort of similar to your past patterns of attention. But there's also good evidence for what's called inhibition on return. We also want to move away from what we've paying a lot of attention to. And so these two things are playing each other out. And I think if you push the attentional pendulum, if you'll allow me that metaphor, too far one way and starve people. There's going to be. There's going to be a rebound. The other way, people are going to hunger for, like you said, something that can be co. Realized through joint attention."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":2112.78,"end":2139.69,"speaker":"Jonathan Pageau","text":"Yeah. And then it can also make you understand the problem of, let's say, ill practice asceticism. Right. Where that if you're not careful, asceticism can actually lead to excesses back. Like the idea of a diet. Right. The idea of people dieting where they're able, they try to just not pay attention to the thing, and then all of a sudden it just cracks and, you know, here comes."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":2139.77,"end":2157.61,"speaker":"John Vervaeke","text":"Yeah, yeah, exactly, exactly. That's a very good analogy. I mean, the thing is to try to get the virtue, the golden mean of askesis, right, of discipline, of spiritual exercises and aschesis in the traditional sense."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":2157.61,"end":2177.98,"speaker":"Jonathan Pageau","text":"Is always a redirecting of attention. Yes. You hear it all the time. People tell you, don't just fast. If you fast and you don't pray, you're in trouble. Like, you're going to be in way more trouble than you were before you started fasting. When you fast, you have to go to church, pray, you have to redirect your attention, or else not only is it not going to work, but it's going to be damaging to your soul."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":2178.38,"end":2231.4,"speaker":"John Vervaeke","text":"That's why I argue that we shouldn't just practice in the mindfulness traditions. And this is Western. It's not, it's not, it's not, you know, it's ethnocentric. Right. We shouldn't just practice meditation. Right. Which is a kind of thought fast. We should also practice contemplation, which is. And now once you've opened up that space through the thought fast, what can you theoria, what can you contemplate that you couldn't see before? That's part of that why Leo and I made that argument about the fact that we, we, we've. We've. We've reduced all this whole ecology to this one practice, and then we've reduced that practice like the definition of mindfulness as, you know, paying attention to the present moment. That's not what sati means. Right. And I understand that's good language of training that Kabat Zinn used, but that's not good language of explaining what's going on when you're trying to meditate, for example."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":2231.48,"end":2235.24,"speaker":"Jonathan Pageau","text":"All right, so here's going to be my. This is going to be my big push on you here. So get Ready?"}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":2236.2,"end":2239.29,"speaker":"John Vervaeke","text":"That's fine. You don't have to push on me to do so."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":2240.01,"end":2348.33,"speaker":"Jonathan Pageau","text":"Human beings have capacity for attention. And it seems like that capacity for attention has a certain priority. And that priority seems to be personal. That is that we pay attention to people first. Faces. Yes, we pay attention to faces, to people. And then we can pay attention to more abstract things. But those abstract things, even those abstract things often end up concentrating in a person, right? So you want to train, but you can't. So you get a coach, and then all of a sudden you can train. Like, why is it that you can train because you have a coach, but you can't train if you don't have a coach? It's because the coach is focusing your desire for attention into something, into a person that's actually communicating and directing and becoming like a node for even the more abstract telos that you have. And so this is. This is. I guess this is my big question in terms of the manner in which reality exists, which is that I've been positing, like, I've been really working towards positing that reality has. Even though I agree with you that you could say that the infinite is transpersonal, but that as this infinite manifests itself in the world, then it tends to take personal. It tends to culminate into personal beings. And so my question is always for you, is always to think like the idea of transpersonal. Not transpersonal in the sense of beyond humans, but I mean transpersonal in the sense of beyond humans, but personal beings that are not human. Let's say the idea of angels and the idea of bodhisattvas, or the idea of gods, little G. Gods as being the manner in which reality presents itself to us, in the manner in which we encounter it, let's say."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":2348.65,"end":2352.53,"speaker":"John Vervaeke","text":"Well, and Paul's made us. Paul Bender. Clee has made a sentimental argument to me. Okay, all right."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":2352.53,"end":2353.37,"speaker":"Jonathan Pageau","text":"I didn't know that."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":2353.61,"end":2370.57,"speaker":"John Vervaeke","text":"And he asked me to critique it. He invoked Pascal's difference between the spirit of geometry and the spirit of finesse. And his argument of the spirit of finesse is most appropriately afforded in personal relationships. And so let me try and first of all strengthen your position for you."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":2371.05,"end":2372.49,"speaker":"Jonathan Pageau","text":"Before I demolish it."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":2372.73,"end":2630.46,"speaker":"John Vervaeke","text":"No, no. So, like, we're talking about joint attention, and I was talking about its development. And you can link this to Vygotsky and to a lot of like. Let me give you another example of prioritizing and paying attention. This is an experiment that's done. I've seen the video of this experiment. So give me A moment and then I'm going to go somewhere with this and you're going to see how it's going to strengthen your point. And then, and then, and then I'll offer my cautions. I'm not trying to demolish, I don't want to do that. So what you have is there's two participants in the experiment. There's a chimp, an adult chimp and a four year old girl. Of course this was replicated with lots of individuals. I'm just using this for the purposes of narrative. You have this box and you have the adult come in and first of all you show the chimp the box has all these buttons and levers and the human does this very complicated pattern of pushing buttons and levers and at the end a candy comes out and eats it. And what's really fascinating is the chimp watches once and then replicates the pattern and, and gets the chocolate or whatever, the candy. And you go, wow, that's impressive. And there's some, there's some evidence that their ability, their working memory, attention is stronger than ours because we sacrifice a lot for language. And then you bring in the four year old girl and you sort of. I picture myself as cheering. I've got a little human flag. Go human, right. And they show the girl this and she just takes one and she replicates it and she gets the candy and you go, wow, that's cool. Now, and this is the experiment. Now you bring in the box, but now the box is plastic and completely transparent. All the same levers and buttons. You bring the chimp in, the human adult goes through all of this and it's clear that the only thing that releases the candy is the last action. All the other actions do nothing. So that does this and then the chimp and the chimp sort of looks at the human being like, and just pushes, pulls the last thing and gets the candy. And you go, oh, that's smart. Now you bring in the four year old girl and she watches and the adult does this and she can see that only the last thing releases the candy. What does she do? She repeats everything the adult did and you go, oh, are four year olds stupider than chance? And then you realize, no, no, no, the human is playing the long game. The girl is thinking. The girl is thinking, obviously she's not shooting. Yeah, yeah, she's thinking. This adult probably sees things I cannot yet see. This adult probably knows things that I do not yet know. I'm going to imitate them because that will allow me to transcend My own perspective. It's very hard to transcend your perspective from within your perspective. But if a child imitates an adult's perspective, they get the capacity to transcend their own bias. And what. And Vygotsky's theory is. And here's the joint attention and the looping. We do this enough until I can do it without you being around. I do it imaginally, I imagine, in the sense that you're there. I don't mean an image, but my metacognition is basic. Well, what do you think about all the imagistic language? What do you do in metacognition? Oh, you rise above your cognition and you look at it. There's no space there. So what we're doing is we're imaginally augmenting our ability. And that's what internalization is. I and you, we got a capacity to become metacognitive, aware of ourselves and transcend ourselves by imitatively internalizing other people. Do you see why that strengthens your argument deeply? Because it means my capacity for self transcendence development, transformation comes for how deeply I can internalize you. And then you pair that with Polani's idea that I can internalize you better. The more I can indwell you, the more I can see things from your perspective, the more I can. Right. So I want to indwell you as deeply as possible, and that allows me to internalize you and vice versa. Hopefully too. Hopefully it's not one way and consummatory. Right. And what that means is that my capacity for self transcendence is deeply dependent on a memetic ability. In a profound way. It's a two way. It's this joint attention, this looping, the sensory motor, this mindsight resonance. And so it's deeply within us that we transcend by internalizing personifications. And I'll use that as a neutral term now, I think that strengthens your case tremendously."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":2630.54,"end":2667.71,"speaker":"Jonathan Pageau","text":"I think so. Definitely. I think so. And I think that you could understand that as if you think about it bottom up as scaling up, right? As scaling up in terms of personalities into kind of personalities that are beyond just the person I meet during a meeting or whatever, but that they would become figures of personal attention that are communal, right? That can be something like a God or like an angel or like a, you know, thing which binds our community together. And so we imitate Athena or we imitate Aries very much."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":2667.87,"end":2727.23,"speaker":"John Vervaeke","text":"And if, right, we have a hyper objects of persons, like people gathered into hyper objects, like Athens being right And Athena is a way of. So George Herbert Mead had this idea of the generalized other. Right. So that thing that the little girl just did with the adult. Imagine trying to do that on a baseball team. This is George Herbert Mead's model. Right. And trying to get that individual personally tailored to each person, that's very, very hard. Right. Because you're constantly shifting who you're. And so Mead argued that we create what he called the generalized other. We create kind of this model that is somehow the intersection of all these individual models. And by relating to that, I can effectively coordinate with all these other people and they with me, the generalized other. So you can think of Athena as. Athena is not just this, but she is a generalized other of Athens that people could internalize to become an Athenian. In a very profound sense. Yeah."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":2727.23,"end":2778.33,"speaker":"Jonathan Pageau","text":"So we're talking about it bottom up, like, because it just. It just. It just. I think in our context is easier to talk about bottom up also to help understand its relationship to, like, say something like cognitive science. And so is there. This is also something that I'm interested in. Is there a way in which that generalized other would find a head in a. In a, you know, an embodied person? So take the baseball team. So the baseball team creates a generalized other through which to act. But then that generalized other will be kind of embodied in the team captain. So it's like the team captain is kind of raised up and named, and then he's not the generalized other, but he becomes something like the. Like the place through which we can attend. And then it'll. It'll kind of stream down into the. To the team so the team can cohere."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":2778.65,"end":2790.37,"speaker":"John Vervaeke","text":"A way of thinking about it is the. The formal cause of the generalized other gets transformed into an efficient cause that we can actually have joint detention upon. Something like that. Is that. Is that fair to what you're saying?"}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":2790.37,"end":2817.63,"speaker":"Jonathan Pageau","text":"No, that. That makes sense. And you could explain all the traditions of the kind of the. The God embodied in the king. Let's say that you find in Egypt and in all these different cultures, you know, the idea of how the, you know, or the emperor, the idea of the divine emperor. All of these ways in which. Because, you know, you know, like I'm a Christian, I obviously, I don't agree with doing this, but when they worship the emperor, they didn't worship the emperor. Right. They worshiped the emperor's genius."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":2818.19,"end":2819.35,"speaker":"John Vervaeke","text":"Yes, exactly. Right."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":2819.35,"end":2840.68,"speaker":"Jonathan Pageau","text":"And so they worshiped like a. Like a transpersonal version of the emperor, which was embodied in the emperor as a focal point for our Attention. But we did. Nobody thought that the physical emperor was, let's say, a guy. He was a guy, right? There was something above him which was calling us into. Into our communion."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":2840.68,"end":2854.73,"speaker":"John Vervaeke","text":"You could say, yeah, there's the empire. And the empire is a hyper object. And everybody's prosperity and peace depended on being in right relationship with that hyper object. But hyper objects require, like we just. They require some. Right."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":2854.81,"end":2858.61,"speaker":"Jonathan Pageau","text":"Something required a face or they require a personal being that we can relate."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":2858.61,"end":2944.03,"speaker":"John Vervaeke","text":"To, that we can relate to so that we can properly do the internalization. So we can do the. We can imaginally not imaginary. We can imaginally enter into right relationship with the empire. We can be devoted to the Empire and internalize the Empire's values and normativity by being devoted to the genius. The capacity of the emperor to lead and be the voice of the Empire. Yes, very much. And for me, I would say that another great. This is how I've tried to understand. And again, I don't mean this disrespectfully, how I've tried to understand prophecy. I don't see prophecy as fortune telling. I don't see it like that. I see prophecy is doing exactly what you're saying, that the prophet somehow takes something and becomes, right, the vehicle of the form. There's a. There's a. There's a tradition in later Neoplatonism of distinguishing between the form and the vehicle by which the form can come into efficient causation. Right. And this is what this was one of the origins of this. The idea that's now become this new age idea of the astral body and all that the acoma was this. That there's a part of us that. Right. The ontology is not important. The point I'm trying to make is that there was this distinction between the form and the vehicle, right? So there's the form of the good, but it needs a particular vehicle by which it instantiates itself in a human being."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":2944.27,"end":2988.81,"speaker":"Jonathan Pageau","text":"Yeah, that makes sense because then that idea of prophecy is far closer to my own understanding, which is that prophecies don't just predict the future, they predict the future to the extent that they manifest a pattern. Like they're actually showing you a pattern of how reality manifests itself to you and in that context. And of course it predicts the future because it kind of is able to pull out of even of how a society lays itself out and is able to understand that here are some inevitable patterns in which. In how something will, like an identity, will go to its end. Let's say so then it imagistically embodies, through these kind of very, very imagistic stories how you know what that means."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":2990.09,"end":3015.13,"speaker":"John Vervaeke","text":"And that's very much like the Platonic notion of a form is not some sort of like. Like the Platonic notion of a triangle isn't like a perfect triangle. It's much better. And this is happening and I'm actually involved in this work to try and think of the form, the Platonic forms phenomenologically like ideas from Arleau Ponty. Like I can show you this, right? And you never see the object. You always see aspects."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":3015.13,"end":3015.81,"speaker":"Jonathan Pageau","text":"Aspects of it."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":3015.81,"end":3060.42,"speaker":"John Vervaeke","text":"Yeah, yeah. There's multi. It's multi aspectual, but there's a through line. They're not fragmented. And that through line also looks up to the through line of yourself, which is also a through line of the multi aspects of you. Right. But the through line of the multi aspectuality is not another aspect. That's the mistake, right? It's not another aspect, the form. But what do we do? What we do is we, you know, we usually draw things from a standard position because that's a vehicle that's supposed to stand in for something that we can't actually capture in a picture. So the form comes into a vehicle by which we can face it, to use some of our language. Is that lining up with what you're."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":3060.5,"end":3089.75,"speaker":"Jonathan Pageau","text":"No, that makes. That makes a lot of sense. And I think the things you're saying are going to be very useful for materialists to understand what it is that we're talking about. I always have that fear that some people watch our videos and have no idea what we're even. What we're even talking about. But I think what you're saying is really appropriate. And so this is like. I think that even until now, like the way you're talking about it and the way that I'm talking about it, being cautious in the sense of, let's say, talk about imaginally interacting with these."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":3089.9,"end":3090.14,"speaker":"John Vervaeke","text":"These."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":3092.7,"end":3114.22,"speaker":"Jonathan Pageau","text":"Let'S say, these beings that are. But the question is like my proposition is something like those beings exist as much as you do, right? The transpersonal, like the beings that bind the community together and become. Take up a face and become principalities for the world to exist. They have as much existence as a person. They just exist at another level, let's say."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":3114.38,"end":3115.98,"speaker":"John Vervaeke","text":"So first of all, that's the big."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":3115.98,"end":3123.31,"speaker":"Jonathan Pageau","text":"That's my big. That maybe is the. Like you could say that that's what makes me an explicitly religious person is something like that."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":3123.31,"end":3271.63,"speaker":"John Vervaeke","text":"You know, yeah. First of all, let me, let me try and give a lot of ground towards that position given what I've already said. So what I should therefore be rationally consistent with. I've already admitted the existence of hyper objects. I've already, you know, the work I do on Dialogos that, right. That there's, you know, a dynamical system takes shape, that something beyond all of the individual consciousnesses and personalities there. When we were talking with Jordan and Bishop, I would use this language, I don't think it's inappropriate, I'm using in a Greek fashion. There was a logos that was present beyond all of us and we started getting caught up in it and following it. And I think that's completely appropriate to say. And I, I've experienced that, I've seen people from religious and non religious experiences encircling and other things they, they encounter that I want to acknowledge. All of that I also want to acknowledge and this comes out of Corbin and even Arabi and a whole bunch of work. You know what a heads up display is like in a cockpit for a pilot. So the pilot can't afford to look down, divert their attention. And so what you do is you project onto the screen a bunch of things so they can actually look through the screen and get the information at the same time or you know, like Pokemon Go, where you have augmented reality. Here's a proposal to you now. I'm doing it in good faith. I'm trying to move towards what you said. So give me, give me a bit of patience. If we properly distinguish between the imaginal and the imaginary, that the imaginal is transjective and not subjective the way the imaginary is in Corbin sense. Right. The imaginal. I think it's very reasonable and I see and Dan and I published on this, we see the scientists doing this for the imaginal augmentation of reality. So for example, let me give me a concrete example. The scientists are getting these flat black and white pictures from the rovers on Mars. What they're looking for in the researchers are people who can get the sense of being on Mars, of being the rover, like seeing as the rover does. Right. And what do they do, by the way? What does the scientists do? They do this loop. First of all, they identify with the rover. They don't say move the rover there, they say we should go there. The rover's we. Right, Right. Or. And then, and then they also, they. So they indwell the rover, but they also internalize it. So you'll get a scientist Saying, so say, oh, this is what we need to do. You put your phone front. And she's on a wheelchair and she's. We need. And she does this. These are the. We need to do this. And she enacts and embodies the rover."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":3271.63,"end":3272.35,"speaker":"Jonathan Pageau","text":"Rover, right."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":3272.35,"end":3306.82,"speaker":"John Vervaeke","text":"Yeah, Right. And then you'll get these literal rocket scientists saying stuff like, this is almost a verbatim quote, Jonathan. You know, I was in my gardening and my right wrist kept getting stuck. And then I came to the lab and Spirit, that's ironically one of the names of the rovers, its right wheel kept getting stuck. And I don't know, I don't believe in magic, but, you know, there's some kind of sympathy. Ha, ha, ha. And they laugh. Right. And that's what I mean. And what do they do with those pictures in order to do that? You know, those wonderful panoramic pictures they send back, they're not for the science, they're for us."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":3306.82,"end":3307.26,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":3307.26,"end":3352.17,"speaker":"John Vervaeke","text":"What they do is they take these pictures and they color them and they scribble on them and they mark them all out. Vertesi calls it drawing as. And all of that imaginal work allows them to draw out so that they can be on Mars and be the rover. This is what we've recently published on. This is not some, you know, airy fairy stuff, I think. Right. I know what that's like when I'm doing Tai Chi, when I'm trying, right. That in Tai Chi, they'll say, like, you know, like, imagine that you're pushing on a ball and you go, why? And then you do that, you go, oh, that's why. And by doing the imaginal thing, you interact with the world in the right way so you see things you wouldn't otherwise see. Does that make sense? The imaginal augmentation?"}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":3352.17,"end":3353.21,"speaker":"Jonathan Pageau","text":"Yeah. No, that makes sense."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":3353.37,"end":3406.51,"speaker":"John Vervaeke","text":"Okay, now let's go with what we talked about before, that we can have distributed cognition and we can have shared attention and we can have shared imaginal augmentation that puts us into reality with hyper objects. I think that is, again, you might find this too reductionist, but for me, I can see a lot of what I call the serious play of religion doing exactly that. Right. You got this shared joint attention and you're getting the distributed cognition and you're allowing for that shared imaginal augmentation of reality perception, ontological depth perception, so that people can see and realize hyper objects that are otherwise invisible to them. Like Mars is, when all I give you is the flat photograph. If you'll allow me analogy. Religion is taking the flat photographs that were given and turning them into me being present on Mars."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":3406.67,"end":3407.03,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":3407.03,"end":3413.76,"speaker":"John Vervaeke","text":"In a way that allows me to do the science. I can't do the science on Mars unless I get that sense of presence."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":3414,"end":3464.74,"speaker":"Jonathan Pageau","text":"Okay, so then maybe that's not everything you want. No, it's not everything I want, but. So would you apply that process to you? That is, Would you. Because you. Because when I think my, my difficulty is that I'm not sure. In your model, like, if you have this idea that we are, let's say, intelligent beings. Yeah, let's say. And then, then, then these other beings that we're talking about. Right. They're kind of projections of our intelligence or whether or not those being, those intelligent beings exist as much as I do as, as in the same process that is like, let's say I also have all these parts and all these thoughts and all these, these, these distractions and attentions and aspects of me that are coordinating and are, are being pulled into the same attentions in order for me to exist as a, as a unified being, let's say."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":3464.74,"end":3523.55,"speaker":"John Vervaeke","text":"That's exactly. By the way, what Mol says attention is. It's cognitive unison. If you were to ask me, do I think, and I think this is a very Platonic model, do I think that distributed cognition has a collective intelligence that is more than the sum of the individual intelligences within it? Yes, I think that's. This goes back to Hitchens, back in Cognition of the Wild. Who navigates a ship? There's no person that navigates a ship. It's a crew and a bunch of equipment. And that system has the intelligence to grasp the hyper object of the ocean and the hyper object of the ship and navigate and coordinate them together. And there's been some pretty gruesome experiments showing that collective intelligence can do things that individual intelligence. There's a person who literally, I don't know how this got through ethics, wired rats together so that their brains were wired and that that group of rats could solve problems that the individual rats couldn't solve."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":3523.71,"end":3524.11,"speaker":"Jonathan Pageau","text":"Really?"}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":3524.51,"end":3574.12,"speaker":"John Vervaeke","text":"Yeah. That doesn't surprise us. Think about the power of the Internet that is given by distributed computation. No computer can do this, but the network can create this hyper object, you called it earlier, a God. Right. That is like, so powerful for us in so many ways. So do I think that. And I think this is one of the great insights of the Platonic idea of dialectic. It's not the Hegelian dialectic. The Platonic dialectic is we can learn an art. And that's how it's thought about coordinating individual cognition into distributed cognition. So we can access collective intelligence and perhaps transform it into participate. Better way of putting it. Participate in its transformation into collective wisdom."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":3574.34,"end":3585.62,"speaker":"Jonathan Pageau","text":"Mm, yeah, that. I mean, I think it's interesting because there, there are these even like in the Thomistic theories about the idea that every time two beings are in relation with each other, they have an angel."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":3585.62,"end":3585.86,"speaker":"John Vervaeke","text":"Right."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":3585.86,"end":3600.41,"speaker":"Jonathan Pageau","text":"So there's a. So like if I'm talking to you and I'm actually in communion with you, then there's an angel which is acting as a principality and becoming the intelligence into which our communion is kind of rising up into that intelligence."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":3600.64,"end":3670.28,"speaker":"John Vervaeke","text":"And I would add one more thing to it which also strengthens your case. Right. And you've heard me talking about this a lot. Right. It's not just emergence up. Right. There's also. There's not only the ruling in of the modeling, there's the ruling out, the emanation that is constraining how these things can take shape. They take certain shapes. That's why there are these reliable persistent patterns for good and for ill. But there are these reliable. Like you mentioned it in prophecy, the prophet can say like there's a reliable ways this can go. This can go this way and it can go this way. Right. And he's often addressing. Right, he's often addressing. Almost always. Right, so sometimes the prophets were she, but mostly they were he. Right. Deborah was a prophet. I know that, but. Right, but. But they are almost always identifying like Israel in the collective. Not just sometimes they address the king, but often the king is just the representative for Israel. Right. And there's a spirit that they're trying to address. Right. And so I would say all of that now where you and I probably disagree and I'll just. Right. So I, I'm trying to do genuine dialogos. I'm trying to."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":3670.36,"end":3670.92,"speaker":"Jonathan Pageau","text":"Thank you."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":3671.32,"end":3774.1,"speaker":"John Vervaeke","text":"Yeah, yeah. You know, whether or not I don't think I have to be really careful, I think there is a proper way of talking about something like God, you know, in Spinoza sense or in the non theistic sense, your notion that there's something like the pattern of relevance realization in reality realization that is analogous to the relevance realization and cognition. I think that. Seriously, I think that's right. But. And this is where I don't think there's a consciousness for that collective intelligence. And I don't. And I don't think there's an agency to it in the same way we understand the agency of living things. There might be something analogous. I'm open, by the way, this is not just me. And you'll find this amusing, given how we came to know each other. Many people talk about the power of the collective intelligence, of distributed cognition as a zombie intelligence. Yeah, that's the term that's used. The idea is that consciousness, one of its properties might be that it only exists within a determinate range. So even within your own, within your own body, embodied brain, like, you're not conscious of many levels, you're not conscious of your neurons, you're not confident. Right. And there's lots of things at a higher level, like these hyper objects, you can't be conscious of them, you can be conscious of reference to them, but I can't. Like, there's no way in which I can be conscious of global warming. Like, I can't just. I can't do it. Right? It doesn't make any sense. I can think about it and I can be conscious of my thinking of it, but it's. I can't be conscious of global warming the way I can be conscious of this object."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":3774.5,"end":3807.96,"speaker":"Jonathan Pageau","text":"So wouldn't. But wouldn't. The fact that for thousands of years, and our, let's say, period, being a complete exception to that, for thousands of years, communities encountered these, these transpersonal beings as being both conscious and having agency and that they represented them as such and talked about them as such and worshiped them as such and et cetera, et cetera. Like, even without talking about God in the supreme kind of infinite way. Like, I don't want to talk about that too much. I want to talk about the intermediary beings. They're easier to keep. They're easier to talk about."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":3807.96,"end":3914.55,"speaker":"John Vervaeke","text":"Fair enough, Fair enough. I just wanted to be clear that I wasn't sort of trying to deny a divine or sacred status to things above us. I wanted to be clear about that. I wanted to be very clear about that. Okay, but we'll put that aside as long as you acknowledge that that's a point I wanted to make. And you won't agree with it, but there's a brilliant anthropologist out there, Lerman, and she wrote a book and she has a whole bunch of paper, How God Becomes Real. And she talks about how what you would call gods or spirits become real for people. And she talks about the fact that we have this two different senses of real. We may have three, given that hyper objects are real for us and maybe they all bleed together in important ways. That's something the phenomenology I'm trying to work out right now with other people. But she talks about that these beings are real, but not in the same way that other things are real for us. Sorry, this might come off as disrespectful, but I'm just quoting. And she's not being disrespectful either. But one of the groups she was studying was a group of evangelical Christians and for whom Jesus is real in the way you're talking about. Now, I know that Jesus is also part of the Trinity, but I'm just trying to get like, call it the spirit of Christ or something like that, whatever. And she said, you know, Jesus is real, but you don't ask him to do your homework. Right. That's what one evangelical Christian said, which was like, whoa, that's a really interesting thing to say. You can ask him to help you do your homework, but you don't say, no, I'm not going to do my homework, I'm going to ask Jesus to do it. Now, there could be for moral or religious reasons, but it was clear in that, that what the person was trying to convey, that they were trying to convey this sense that the way these beings interact with, for lack of a better word, physical reality is not the way physical things interact with physical reality. Right?"}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":3914.55,"end":3939.18,"speaker":"Jonathan Pageau","text":"Yeah, but it's a hierarchy. So it's like you could say something like, your finger doesn't ask you to clot the cut on it. Your finger doesn't ask you to clot the blood in your finger, but you're still doing it through your body. That is, your body is the manner in which you manifest yourself. And so that's why he's saying, jesus doesn't do your homework. You do your homework, but you can do that in a way that's participating in the body of Christ."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":3939.18,"end":3954.26,"speaker":"John Vervaeke","text":"You could say, right, but notice what's happening there. Right. That seems to mean that their realness as presence is always vectored through us as participating in them."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":3954.44,"end":3964.44,"speaker":"Jonathan Pageau","text":"Right. Because we're like parts of the body. Like, just like your fingers are part of you, then we are part of Christ. Like Christ manifests himself. That's why he's like a higher consciousness."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":3964.44,"end":3976.84,"speaker":"John Vervaeke","text":"Right? Totally. So, but what I would then say is, for example, you don't think that because we've networked all of the computers together, that the computer, the Internet has consciousness, do you?"}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":3977.24,"end":3995.09,"speaker":"Jonathan Pageau","text":"I'm pretty sure there's a God behind that. I'm sorry, I'm going to freak people out by saying that. I've been pointing to it very closely, actually. I do think the Internet is acting as a body for a God. I do think so. And I think that the real. The fact that it's moving without anybody being able to stop it or control it or direct it completely."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":3995.17,"end":4026.2,"speaker":"John Vervaeke","text":"I think I agree with you on that. So I agree on that. And that's a tricky thing, because Jung said that's the definition of spirit. If it acts on its own. Right. If it has a life of its own and a mind of its own. Right. That's definitely when we are liable to attribute spirit to it. But I would say just again, people have also perennially done that with forests and with oceans and rivers, and I don't think that rivers have consciousness or forests have consciousness."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":4026.28,"end":4036.94,"speaker":"Jonathan Pageau","text":"Well, it's not the river that has consciousness. It's the angel that has consciousness. Just like your hand doesn't have consciousness. It's the fullness of you in relationship to your hand that has consciousness."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":4037.41,"end":4044.37,"speaker":"John Vervaeke","text":"Yeah, but see, this is. And this is where we differ. I don't think there's a way of separating my consciousness from my embodiment."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":4044.37,"end":4056.81,"speaker":"Jonathan Pageau","text":"No, I agree. No, same even for the river, let's say. But look, you have a heart out now. I don't want to pull you. This is really just getting into the good stuff. So let's just plan for another discussion. We haven't talked."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":4056.81,"end":4085.33,"speaker":"John Vervaeke","text":"No, I like this. I like this. I hope you see that. You know, I'm not some dullard about this. I'm trying to. I'm trying to. Yeah. JP's very sweet about this. Right. He sees me as trying to get as far as I can. By the way, thank you so much for introducing me to him, and Paul did that, too. And your tutelage of him, I mean, it's. And I hope this doesn't sound condescending. It's meant as complimentary. It's really wonderful watching him flourish."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":4085.41,"end":4086.05,"speaker":"Jonathan Pageau","text":"Oh, yeah."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":4086.53,"end":4088.89,"speaker":"John Vervaeke","text":"It's really wonderful watching him flourish and thrive."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":4088.89,"end":4098.31,"speaker":"Jonathan Pageau","text":"And, I mean, JP's young, so. So it's like I see the future as being extremely. There are so many possibilities ahead of him. So I'm excited to watch that, too. So."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":4098.31,"end":4101.87,"speaker":"John Vervaeke","text":"Yeah. Yeah. So let's. Let's make it a part one and a part two, then."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":4101.87,"end":4102.19,"speaker":"Jonathan Pageau","text":"Sure."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":4102.19,"end":4132.58,"speaker":"John Vervaeke","text":"Let's pick it up around this, because we're right on the cusp here. Of. Cause there is. I'll ask you to consider a possible tension between participation and independence, how we get. How we get those together, because that's, for me, the nub of the issue. All right? I participate in my body And I don't think that John can be separable or independent from it. Right. And I get that I'm not reducible to the descriptions of the parts of my body. I concede all of that. And I think I've conceded in all of the examples I've talked about. Right."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":4132.66,"end":4143.3,"speaker":"Jonathan Pageau","text":"Yeah, let's definitely. I'd say I'll just write out, say that's love. But we can talk about that. We'll talk about that and just open up that can and then finish the discussion. So thanks, John. Thank you so much."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":4143.83,"end":4147.03,"speaker":"John Vervaeke","text":"That's a great thing to lay on the table. Thank you so much, too. This has been a great."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":4147.03,"end":4175.31,"speaker":"Jonathan Pageau","text":"Thanks. And everybody, also, don't forget to check out our conversation with Jordan Peterson and Bishop Barron. It's bound to make some waves. And so we're excited about that and also looking forward to a conversation with Bishop Baron that I will have. I don't know exactly when it's going to happen also pretty much very soon. And I hope, John, that you also might have the chance to talk to him as well, because I could see that he was like, oh, who's this? There's something that he's saying that is just. It was kind of popping up in his eyes. So hopefully you, you can have a conversation with him as well."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":4175.31,"end":4182.35,"speaker":"John Vervaeke","text":"He was complimentary to me in the blog that I read. So I'll reach out to him and have a conversation with him. I'd very much like that. So thank you very much."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":4182.43,"end":4186.23,"speaker":"Jonathan Pageau","text":"All right, wish you luck, everybody. Thank you and we'll see you soon. Bye bye."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":4186.23,"end":4187.23,"speaker":"John Vervaeke","text":"Take care. Bye bye."}
{"episode_id":"SW - #204 - 2021-12-01 - John Vervaeke - Collective Intelligence - Angels in Scientific Terms","start":4187.47,"end":4249.49,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon, the Pageot videos as well, and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
