{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":0.56,"end":6.4,"speaker":"Fr Stephen De Young","text":"Because there are these sort of elements of seduction in the conversation between the serpent and Eve."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":6.48,"end":166.22,"speaker":"Jonathan Pageau","text":"Yeah, but the Bible functions like that. Like, the Bible also will not say something like the serpent slept with Eve. But because of the structure of the conversation, you understand that she is submitting herself to him like she would to her husband in a way that suggests a kind of sexual union without necessarily having to, like, go into the idea that they actually united sexually. By the way, this happens all the way through Bible and in positive ways, too, where, for example, Christ, when he meets a Samaritan woman, the entire structure of the conversation is one of Christ taking her as a wife. But we know that he didn't marry her and he didn't have. He didn't sleep with her. But it's to signify the meaning of the relationship. So we have to be careful not to fall into the same kind of materialism that we're criticizing when we read these stories, but rather be attentive mostly to what they're trying to help us understand of what's going on and, let's say, the structure of meaning, rather than just wondering, like, okay, so did Eve really sleep with the snakes? Like, that's not what it says in the scripture, but you can understand that that's what's going on in terms of a relations. This is Jonathan Pedro. Welcome to the Symbolic world. So, hello, everyone. I am here with Father Steven DeYoung, who I know needs no introduction to the people who are watching my channel. Father Stephen is a priest in the Antiochian Church, but he's also the host of the Lord of Spirit podcast, of which we're all huge fans of. He's also written several books. And he is key in helping people re understand the ancient way of thinking, kind of coming back and bringing back an integrated cosmic view. And so we really appreciate Father Stephen coming to talk to us. A few things to say. Father Stephen is going to be speaking at the Symbolic World Summit in February. We are so excited that. That he is coming. It'll be great to everybody. I think there'll be so much, like, buzz in the room with Father Stephen there and then everybody there. It's going to be quite, quite crazy. And he has also. He's also submitted an article for the Symbolic World Journal, which we will be publishing very soon. And that is partly what we're going to talk about today. So, Father Stephen, thanks for coming back."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":167.14,"end":168.74,"speaker":"Fr Stephen De Young","text":"Yeah, it's good to be back again."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":169.86,"end":182.18,"speaker":"Jonathan Pageau","text":"The. Everything is, you know, you have the. The Lord of Spirits conference coming. You publish your recent Book Apocrypha. Things are just steamrolling ahead with your. Your project."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":183.22,"end":208.51,"speaker":"Fr Stephen De Young","text":"Yeah, there's. I mean, I. I don't want to give the impression I'm churning things out, but that's, you know, there's. I'm in a period of my life where I'm. I'm blessed to be able to be very productive. So I'm trying to steward that well because I'm sure there will come times in my life later where I won't be able to be as productive as I am right now."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":208.99,"end":238.12,"speaker":"Jonathan Pageau","text":"And so before we start the actual conversation, I'd like, I want to hear from you what you think, if you've seen. Because now Lord of Spirits has been going on for while was like two years or a year and a half, three years, three years, man, time just flies like crazy. And have you seen a difference, let's say, in people's perceptions? Like, have you kind of seen a marked change in the way that people perceive the world, also perceive scripture, perceive their place in the tradition since you started the podcast?"}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":239.16,"end":313.36,"speaker":"Fr Stephen De Young","text":"I think so. The thing I've always liked most, right. To me, the most flattering thing has always been, like, in. In my ministry as a pastor has always been when I see someone saying something I said and not crediting me for it, and the reason it's important that they don't credit me for it is that they're saying it just from their own heart and mind. Right. Meaning it's. It's sunk in and they've sort of made it their own. And so with Lord of Spirits, the thing, again, that makes me most happy is not when people sort of fawn over Lord of Spirits or, you know, whatever, but when I see people talking about orthodox Christianity, talking about religion, and you could tell that it's been shaped by sort of the topics we've been talking about, you pick up phrases, but they've internalized it in a way, you know, that they don't need to give me a footnote."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":313.84,"end":318.8,"speaker":"Jonathan Pageau","text":"It is really becoming. It's kind of becoming their own worldview. And then that's what you're hoping."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":319.2,"end":380.29,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. That it's not. Well, Lord of Spirits said this. Right. But that, you know, they say this is what's really going on, you know, so that's. That's heartening to me because that's nothing I do. And I'm sure Father Andrew feels this way, too, has ever been about me trying to raise my own profile or get fans for me or impress people with how clever I am. It's always been about trying to recover, you know, in English speaking, Anglophone orthodoxy is so impoverished in terms of how much of the orthodox tradition isn't available to us in our language. And so it's always been about trying to recover those things that aren't really lost. It's just we're still kind of in the mission field stage, Orthodoxy and trying to bring those things out."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":380.37,"end":464.89,"speaker":"Jonathan Pageau","text":"And it's great. You know, a lot of the, you know, a lot of the keys that you've been offering, you know, all these, the kind of cosmological keys that, that you've been offering have been really helpful to people. And I'm seeing it, you know, Richard Rowland and I, we just started this course on Beowulf, you know, and just reading, reading the first lines, like the early line just in the, the inter. When the. They set up Grendel as the, as the monster, like right in the first part, you know, it's like you can just see the world that the, the Anglo Saxons were living in. And it was really. They were lived in a kind of this kind of cosmic vision of the world. And they, you know, obviously Grendel is, is a descendant of Cain. He's a, he's a monster. He's a giant, you know, and, and the whole book, like actually the Beowulf is in a larger book which has, like where the manuscript was, was in a larger book which had all these monst in them. And it was like, you know, the, the letter of Alexander to Aristotle, there was a legend of St Christopher and that was that it's bit. It's in that, that book. And so you could just see that it's, it's making us notice things that people did that people, people didn't notice before and realizing, oh, like this, this vision was. Is the one that the ancient had. Whether you lived in Constantinople or if you lived in England, you know, it was the cosmic world they lived in."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":465.59,"end":518.27,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And this is a place where we are sort of impoverished by modernity, where there's been this, this reduction. Right. Which didn't have to be the case. Scientific understanding could have been additive. Right? It could have been. We have this, that we already understand now. We have this additional deeper level of understanding of this part of. Right. The universe and reality. But instead it was accompanied with this rejection, an idea of replacement, that we can replace this spiritual wisdom accumulated over millennia with scientific insight newly gained. Yeah, you know, yeah, but it's, but."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":518.35,"end":607.38,"speaker":"Jonathan Pageau","text":"That time is, is over. I mean it, it's, it's over. But A lot of people don't realize it. I think it, you know, were still running on the fumes of the 19th century. It seems like very thin fumes, but still we still are, but we're at, you know, we're on people that are talking about the things that you're talking about or I do think that I'm talking about in some ways are on the strange leading edge even in terms of, you know, I don't know if you, if you followed some of the conversations I've had, but I'm in a point now where I can talk to secular, you know, cognitive psychologists or secular scientists and talking about demons and angels and talking about worship and talk about God even. And they just kind of nod along because they realize that these. The question of agency, you know, of transpersonal agency, for example, has become inevitable to deal with. Like we. It's actually even from a materialist point of view the idea that agency exists only at the human level and doesn't if it scales down into animals but doesn't scale up into higher organizations, it's like it doesn't even their own system actually. It's, it's like there's this weird superstitious thing and they're thinking that make prevents them from wanting to see agency kind of coming down from above. And so, so you're, you're, you're in this situation where you know, even, like I said, even people who wouldn't call to say their believer wouldn't even believe in God are like, yeah, well, we kind of have to acknowledge that there are these, these intelligences that are acting on us."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":607.62,"end":666.92,"speaker":"Laura Diaz","text":"Tucson, the weight is over. Medi weight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iHeartRadio. And you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication, but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better. And lose weight the right way. Mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":667,"end":678.44,"speaker":"Fr Stephen De Young","text":"That's mediweightloss.com yeah, I think there's always been a sort of intuitive knowledge of it and then sort of a denial of it. Yeah, right."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":678.6,"end":691.4,"speaker":"Jonathan Pageau","text":"We act as if. But then if you ask me if you believe it, like, no, no, I don't believe that. But it's like, strangely enough, you still act as if that. That was true. And in a lot of these actions, you still act as if these, these things coming from above are real."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":691.64,"end":707.72,"speaker":"Fr Stephen De Young","text":"Yeah, I've never, I've never read. I mean, I've read plenty of history books by outright Marxists who are. Insist they're doing completely material history, but it always reads like a story."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":708.12,"end":708.6,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":710.76,"end":719.32,"speaker":"Fr Stephen De Young","text":"It always, you know, and if you ask them, they'd say, well, yes, to some extent, you know, my book is a false construct. Right. Because they have to like, deny their own."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":721.25,"end":721.89,"speaker":"Jonathan Pageau","text":"Yeah, exactly."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":721.97,"end":731.97,"speaker":"Fr Stephen De Young","text":"Understanding. Right. They see there are things that work here and that there's a pattern and they're bringing it out through their work, but they know based on their views, there shouldn't be."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":732.77,"end":772.17,"speaker":"Jonathan Pageau","text":"Yeah. So they're in this performative contradiction where the very, the very like, decrying of the pattern, like this revolutionary trope is itself a story that's as old as, you know, the cosmogony. And so the idea that, that because they're introducing this revolutionary kind of, let's say, destructuring. Destructuring trope in their thing, that it's not a story, it's like, well, just, it's another myth, you know, it's like, you know, Saturn castrating his father. That's what you're doing. It's not, it's not a big, it's not a big surprise. Like, it's not something, you know. And so you, you, you're stuck. They're stuck in the religious world. Ultimately, you just don't realize it."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":772.56,"end":777.84,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And it's just sort of known and denied rather than unknown."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":778.8,"end":854.48,"speaker":"Jonathan Pageau","text":"All right, so the thing I want to talk about today is something, you know, you, you keep handing me these amazing golden keys. In my own work, I mentioned before that one of the keys that you handed me was. For years I wanted to mention traditions that were kind of Enochian traditions, but I knew that the fathers had put that aside. But I also knew that there were some aspects of it that were really useful. And I knew that the problem was, like, the demon and angel, the demon and women problem. And then when you handed me the ritual part of it where you said, you know, these are just ritual, it is true. It is actually happening, but it's happening through ritual, Proxy. And that is how these things get embedded in the world. I was like, oh, my goodness, you just handed me the best key, even for my own work. And since then, I've been, like, willing to talk about these things more openly. But now you've handed me another, like, key, which is that. Okay, so. So. So I want you. Actually, you. I want you to lay out your theory because it has to do with a very difficult. Not difficult, but a. A weird passage in the book of Genesis when, after the flood, you know, Ham discovers his father's nakedness. And. And I want you to lay it out, and then we can talk about it, because it's. For me, it's like a massive key."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":855.1,"end":925.28,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So there is. And it is weird, right? It's. It's this episode that comes after. After the flood story is basically over. And it seems in certain ways, at odds with the preceding story, because the emphasis, of course, in the. Most of the flood narrative in Genesis 6 through 9 is that Noah is this one righteous person from his generation. And then after the flood, you have this whole story with him becoming drunk and these other things unfolding. Part of the reason it's so weird is that it's kind of bowdlerized in all the English translations, so we aren't getting sort of the direction. And because most English readers aren't as familiar with the rest of the Torah as maybe we should be. So Genesis really is the prologue to the rest of the. The Torah."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":925.28,"end":925.76,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":926.64,"end":1019.52,"speaker":"Fr Stephen De Young","text":"And that's one of the very basic keys to interpreting and understanding Genesis. If you don't keep that in mind when you're reading Genesis, that this is leading up to Exodus, right? This is leading up to the rest of. Of what's in the Torah, then you'll sort of end up misinterpreting it. And so there's. There's a theme here. And this is the place where I go to kind of lay it out, because this place where it's most complete, but it's a pattern that repeats in Genesis and the patriarchal narratives that make up chapters 12 through 50 of Genesis. So what's described if you just read it in English is Noah plants a vineyard. He gets drunk in the vineyard, and his son Ham sees his father's nakedness. His father's nakedness is uncovered and goes and tells his brothers Shem and Japheth. Shem and Japheth go and cover their father's nakedness. And then when Noah sort of recovers from his inebriated state, he curses Canaan, the son of Ham, who is the fourth son of his third son, and disinherits him. So he disinherits the fourth son of his third son."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":1021.28,"end":1035.36,"speaker":"Jonathan Pageau","text":"So definitely already there's a massive narrative problem. And it's a narrative problem that we gloss over, and I've done it myself. We gloss over it by saying that Ham is the cursed one, but that's not what's written in the text."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":1035.36,"end":1042.17,"speaker":"Fr Stephen De Young","text":"Right, right. And there's all kinds of bizarre and even racist theories about the curse of Ham."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":1042.17,"end":1042.61,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":1042.61,"end":1046.25,"speaker":"Fr Stephen De Young","text":"And Ham is not cursed in the narrative."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":1046.25,"end":1046.81,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":1048.41,"end":1123.55,"speaker":"Fr Stephen De Young","text":"So, yeah. So in order to kind of figure out what's going on here, we have to understand sort of what uncovering the father's nakedness means. And if you go to Leviticus chapter 18, Leviticus, chapter 17, through people cut it off in different places, 22 or 23 is what's called the holiness code and has regulations governing holiness. Leviticus 18 is discussing sexual immorality. So that's where the commandments are about. About sexual morality. And that takes the form. Because we're in a patriarchal society that takes the form of telling men primarily who they're not allowed to sleep with, because they, of course, were the ones making the decisions regarding that culturally. And one of those commandments is, you shall not uncover the nakedness of your father's wife, for this is your father's nakedness. And something similar is actually said about your father's daughter. Right. This is. And so this idea of."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":1123.63,"end":1133.35,"speaker":"Jonathan Pageau","text":"It's like all the incest laws are. Are. Are portrayed as uncovering your father's nakedness. I think it's even like. Like your aunt and like."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":1133.35,"end":1315,"speaker":"Fr Stephen De Young","text":"Yeah. You know, your father's sister. Your. Yeah, yeah. And so this phrase of uncovering the nakedness. Right. Is this reference to sexual relations, particularly, that are forbidden. Right. And you can see why that would be. Right. The idea is that the father, the patriarch, Right. Within the family is. Is the one who is charged with safeguarding, in the case of the daughter, in the case of the sister. Right. And even his own wife. Safeguarding, sort of protecting them from sexual exploitation from. Right. And so it belongs to him, and it's his job to cover it. Right. It's his job to. Right. Sort of protect it. So once you have that in mind. Right. And we go back to this story in Genesis, what Ham is doing here sort of makes sense. Right. So we can now understand when it says he, you know, went into his father's tent. Right. This is talking and uncovers the negatives of his father. This is him having relations with his mother. And then when this comes to the attention of Noah, we see him disinheriting Ham's youngest son. And why would he need to do that? Well, Canaan, Ham's youngest son, is the son he bore, who his. His mother bore him. Yeah. So it's the child conceived through those illicit sexual relations and the covering of the nakedness is talking about protecting that again. So the other brothers, once they find out this is going on, move to stop it. Right. Move to protect their mother from. From him, their brother Ham. Right. And so the question then becomes sort of, why would Ham do this? Right. Aside from just maybe perversion. Right. Like, why would he. Why would he do this? This is actually. I don't want to call it an institution or a practice, but because it was not well looked at. Right. In the. In the ancient world. But in the ancient world and in other places in the Scriptures, we see what's called family usurpation. The idea here is that what Ham is trying to do is he's trying to bear a son with his father's."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":1315,"end":1318.16,"speaker":"Jonathan Pageau","text":"Wife to replace his father, basically."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":1318.16,"end":1325.24,"speaker":"Fr Stephen De Young","text":"Right. To replace his father. And then that son would become the heir, and so he would be effectively taking over the family structure."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":1326.44,"end":1330.94,"speaker":"Jonathan Pageau","text":"Yeah. It's a kind of revolutionary. A revolutionary move where he's trying to take."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":1330.94,"end":1331.3,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":1331.7,"end":1346.58,"speaker":"Jonathan Pageau","text":"Take. He's replaced his father in terms of authority. Take his body, like, take his. Take his wife, take his. And then also take the inheritance and take everything away from his father while his father is still. Is still alive."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":1346.82,"end":1370.28,"speaker":"Fr Stephen De Young","text":"Right, right. And this becomes especially clear when you know how inheritance and the right of primogenitor worked. Right. The ancient societies, which was firstborn son inherits everything. Yeah. And then can choose whether or not to share that with the other brothers. Yeah."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":1370.52,"end":1376.6,"speaker":"Jonathan Pageau","text":"The others become dependent on him. Like they become subsidiary to the older brother when his father dies. Right."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":1376.68,"end":1400.14,"speaker":"Fr Stephen De Young","text":"He takes his father's place when his father passes away. And they have a place of the extended family only insofar as they're connected to him and maintain relationships with him. And this is true throughout the ancient period. So even in the Gospels, we find someone comes to Christ and says, teacher, tell my brother to divide the inheritance with me."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":1401.18,"end":1401.58,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":1402.46,"end":1441.04,"speaker":"Fr Stephen De Young","text":"And Christ says, you know what don't worry about the inheritance. Come, follow me. Right. Don't worry about the money. But even there, you see how there could be problems when firstborn son just says n, I'm just going to keep all this and you guys can buzz off. But. So Ham would not have inherited anything unless he, you know, maintained this relationship and remained subsidiary to his older brother. He then enacts this plan to try to displace his father and and take over. And that's why then Noah has to disinherit this child and and reject it."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":1441.04,"end":1502.87,"speaker":"Laura Diaz","text":"Tucson, the weight is over. Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project. Ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication, but with a customized plan, weekly check ins and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, Medi weight loss is is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com hi."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":1503.27,"end":1530.09,"speaker":"Fr Stephen De Young","text":"Sorry, did I startle you? When you're used to hearing a certain type of commercial, something like this can well take you by surprise. That's kind of how it is with the Lexus rx. A vehicle that has continued to defy expectations for over 25 years. From the first luxury vehicle of its kind to the first hybrid luxury vehicle to the only plug in hybrid worthy of the RX name. We understand you want more than the everyday suv. It isn't being understood. An amazing feeling experience."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":1530.33,"end":1549.76,"speaker":"Jonathan Pageau","text":"Amazing at your Lexus dealer. And maybe you can tell people because obviously it's like, okay, Father Stephen just pulling this out of his hat here. You know, in Genesis itself. And then later in in this, in the bible, there are examples of that exactly happening again. And so there are places where this type of behavior Is. Is. Is repeated."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":1550.72,"end":1575.84,"speaker":"Fr Stephen De Young","text":"Right. And. And this is just sort of a clear case of it. But there are other clear cases. I mean, later in Genesis, Reuben is going to sleep with one of his father's concubines to attempt to do this. And that's a sort of an especially shocking case because Reuben actually was the firstborn son."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":1576.07,"end":1576.39,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":1577.51,"end":1594.55,"speaker":"Fr Stephen De Young","text":"So he's sort of trying to usurp Jacob while he's still alive. Yeah. Right. And Reuben was disinherited because of that. He lost that firstborn status because of that. It ends up passing to Judah."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":1596.87,"end":1599.51,"speaker":"Jonathan Pageau","text":"Because there's also. There's also Absalom."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":1599.91,"end":1616.42,"speaker":"Fr Stephen De Young","text":"Yeah. Absalom does this with David's wives and concubines during the period where he's usurped David's power. But Absalom actually did this publicly. He made a public display of it."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":1616.74,"end":1617.1,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":1617.1,"end":1619.58,"speaker":"Fr Stephen De Young","text":"To signal to everyone, I'm the."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":1619.58,"end":1620.42,"speaker":"Jonathan Pageau","text":"I'm the head."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":1621.3,"end":1672.16,"speaker":"Fr Stephen De Young","text":"That he had now taken over. This is something that. Was it attempted. One of the first places where we see the office of Queen Mother in the Old Testament is with Solomon, has his mother, Bathsheba enthroned in his right hand. And the first person to come to her and make a request to the king through her is trying to do this. He requests now that David is gone, that he be given one of David's concubines as a wife. Huh. And Solomon said, I. I know where this is going. Right. So. So this isn't happening."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":1672.16,"end":1672.76,"speaker":"Jonathan Pageau","text":"So this is."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":1674.04,"end":1708.32,"speaker":"Fr Stephen De Young","text":"This directly is a pattern in the sense of other people doing this in the context of family usurpation. You also see that pattern in other places less literally. Yeah. Right. So one of the biggest examples is in Genesis 3. Now, there's this stuff in Protestant circles, it's called the serpent seed doctrine. But there have been Gnostic sects that thought this and stuff too, that thought that Cain was like, literally the son of the son of the devil."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":1708.32,"end":1712.56,"speaker":"Jonathan Pageau","text":"Yeah, that's not what it says. That's not what it says in the Bible, though."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":1712.56,"end":1713.44,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":1713.44,"end":1714.44,"speaker":"Jonathan Pageau","text":"You'd have to be really."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":1715.24,"end":1724.28,"speaker":"Fr Stephen De Young","text":"But that's not based on nothing, because there are these sort of elements of seduction in the conversation between the serpent and Eve."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":1724.44,"end":1796.26,"speaker":"Jonathan Pageau","text":"Yeah, yeah. But the Bible functions like that. Like, the Bible also will not say something like the serpent slept with. With Eve, but because of the structure of the conversation, you understand that she is submitting herself to him like she would to her husband in a way that suggests a kind of sexual union without necessarily having to, like, go into the idea that they Actually united sexually. By the way, this happens all the way through Bible and in positive ways too, where, for example, Christ, when he meets a Samaritan woman, the entire structure of the conversation is one of Christ taking her as a wife, but we know that he didn't marry her and he didn't have. He didn't sleep with her. But it's to signify the meaning of the relationship. So we have to be careful not to fall into the same kind of materialism that we're criticizing when we read these stories, but rather be attentive mostly to what they're trying to help us understand of what's going on and let's say the structure of meaning rather than just wondering, like, okay, so did Eve really sleep with his snakes? Like, that's not what it says in the scripture. But you can understand that that's what's going on in terms of a relationship."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":1796.82,"end":1806.5,"speaker":"Fr Stephen De Young","text":"Right? Right. That there is this sort of seductive element. And that, after all, is what the serpent is trying to do. It's an act of usurpation."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":1806.66,"end":1807.22,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":1807.54,"end":1810.1,"speaker":"Fr Stephen De Young","text":"And in that case, it's because he can't create."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":1812.27,"end":1812.51,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":1812.51,"end":1902.35,"speaker":"Fr Stephen De Young","text":"And so this. This idea of usurpation, whether it's directly in this family context or outside of it. Right. Is over again, sort of the opposite of it. What it's. What it's a sin against is creation. Creating something, putting something in, which is putting something in order and filling it with life, right? So you look at Abraham, right? He builds this family unit, right, which has structures. People have roles, right. Within this extended family unit, which includes not just biological family members, but his servants, his herdsmen, his. Right. This whole unit that he's built. And he's filled it with life in the terms of. I mean, most directly in terms of reproduction. Right. But also in sort of the prospering right of everyone and everything involved. And sort of the shortcut of that is, no, I'm not going to build something of my own. I'm not going to participate in continuing to build this up and fill it with life and keep it in order. I'm going to try and take it over. I'm going to try and make this thing that someone else created mine. Yeah. And that, of course, is what the devil is doing right from the beginning. God is the one who created it."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":1902.83,"end":1976.58,"speaker":"Jonathan Pageau","text":"Your insight is perfect. So you can understand that the image of usurpation itself or the image of the pride of Satan, who wants to. Even whatever version of the fall of the devil you. You take, you know, whether it's A kind of Miltonian or virgin or the, The. The. The. The more ancient one of. Of the fall happening at the creation of Adam. Right. In some ways the idea is that the devil wants to become our God. You know, like the devil wants to be for us what is God, and then take over. Take over creation. And that becomes in some ways make. Trying to make creation his wife. Right. It's like that's what the devil is. Is always trying to do, and that's what every single temptation that you face is trying to do for you. Right. So it's like with every sin that tempts you is trying to make you its wife. You know, it's trying to. Is trying to come up above and master everything underneath and. And use it as its body in order to be able to. To grow and to have more power in the world. So it's like a. It's a fractal thing that happens at every level of reality. This idea of. Of something which wants to come up, usurp, and then take the body for itself."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":1978.18,"end":2039.32,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And. And it's important then to also have the positive side. Right. Of we're called upon to create. Right to build, to put in order. Right. To fill with life. And it's interesting, in sort of the popular zeitgeist, like you look at HBO shows, you have Game of Thrones, and then as soon as it ends, you have succession, which is all about children trying to usurp and sees some kind of power, something that was created by sort of a previous distant father, and all kinds of chaos and mayhem and murder and destruction taking place in that context rather than anyone trying to build anything, create anything, bring life to anything."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":2039.4,"end":2216,"speaker":"Jonathan Pageau","text":"Yeah, yeah. Okay. So I. So then the next step, and this is the one that. I don't know what you think about this yet. I kind of wrote you an email, proposed a little bit, because one of the reasons why this story in particular had my. My fascination was also because I noticed a pattern in Scripture which has to do with the beginning of something. And it seems like when something begins, we always find in some ways a what we could call a pattern of incest that is there at the beginning. It seems like in some ways there's the. It's like the sin of the beginning seems to be incest, and the sin of the end seems to be something like confusion or going to the strange woman or that. So you. We have these two extremes. You could say it's like, you know, Solomon saying, don't go to the strange woman because basically you'll lose everything. Like, everything will kind of give. Be given to the stranger. But then if you look at this, the pattern, you see this weird pattern of incest as the scandal of the beginning. So. And that's why when I was looking at this story, I was like, that seems to be what it's referring to. But I. I always thought that it was. That it was like a. Like a homosexual relationship between Ham and Noah. But I was like, I don't want to talk about that because it's just like I. And the reason why I see it is because I want to give people the examples. It's like in Genesis, after Sodom and Gomorrah, you have Lot who sleeps with his daughters. Then you have. At the. When God reveals himself to Abraham, you find that Abraham also is married to his sister, like his half sister, which would be a sin. Like, which would be something that would be prohibited in the law later. And then when you. So you. So you have Noah, you have Lot, then you have Abraham, right, right there in Genesis, these three iterations of the beginnings of worlds where there seems to be this, this. This trope. And then when you bring it into Genesis, then you have it right at the beginning. And now it's like, obviously it's not. It's not a sin at this point, but you have the idea that, you know, Eve is taken from Adam and is his own. Is his own body basically is like. Is him. That is. That is taken out of him. And so. And so now when you. When you say. When you bring. When you mentioned you said no, it's. It's really based on the law. What you see in the law, which is that there's a relationship with Noah's mother, Noah's wife, and then the descendants of that occurs. I'm like, yeah, then that. It fits it even better with the way that I saw it. It kind of. Kind of makes this a pattern that repeats all over. All over Genesis. So I don't know if you notice that or what you think about my perception. Yeah."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":2216.64,"end":2252.2,"speaker":"Fr Stephen De Young","text":"So part of. There's also another corresponding trope on the other side. And that is. So if incest is too close. Yeah, right. It's sort of joining the same with the same. Right. Yeah. Then you also have the trope with Esau, right. Where they go and, you know, Abraham is very concerned with Isaac that he not marry one of the people of the land. Yeah, right."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":2252.2,"end":2264.84,"speaker":"Jonathan Pageau","text":"Yeah. Because it's completely. Even in. Even in Abraham, you have the same thing where he wants to find the right Distance. So for his sons. He wants his sons to marry like a cousin or like a second cousin or something."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":2264.92,"end":2266.12,"speaker":"Fr Stephen De Young","text":"Yeah, a second cousin."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":2266.28,"end":2266.68,"speaker":"Laura Diaz","text":"Far."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":2267,"end":2278.04,"speaker":"Jonathan Pageau","text":"Then it will. It will basically take all your strength away into the stranger. If it's too close, then it creates this weird internal loop that it will. That will cause absolute chaos."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":2278.2,"end":2315.92,"speaker":"Fr Stephen De Young","text":"Yeah. That brings about this sort of chaos and destruction. And so both of those. Right. You see, set out as these. As these polarities. Yeah. And that really goes back to Adam and Eve. Right. And the whole idea when Eve is created as In Hebrew, the 8th or connecto and connecto, really it means fits together like puzzle pieces. Right. And there's a literal. Very literal material, biological."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":2316.41,"end":2316.81,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":2316.97,"end":2365.14,"speaker":"Fr Stephen De Young","text":"Sense like puzzle pieces, but it goes beyond that. Right. It's not limited to that. And so the idea that, yes, she is not. She is bone of Adam's bone and flesh of his flesh, but at the same time, right. She is full in the places he's empty. Right. And. And so that is the place where there is this sort of. This sort of perfect connection, right. That then is able to sort of produce life and produce good order. Yeah. Right. So the incestuous relationship can produce life, but. But not order."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":2365.3,"end":2398.91,"speaker":"Jonathan Pageau","text":"Yeah. It's a new. Because it actually creates confusion. And this is technically. It's technically true. Like, it. It. Because the world has an order of manifestation, right. It's like a father with a mother and then children. And then, you know, the father has relationship like sisters and brothers at this level, and then the children come down. But if a child has a relationship with someone that is, you know, at the same level as their father, either their father or their mother or so, or like an uncle or whatever, then. Then the. The relationships become actually confused. The identity of the people become confused."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":2398.96,"end":2399.12,"speaker":"Fr Stephen De Young","text":"And."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":2399.27,"end":2419.83,"speaker":"Jonathan Pageau","text":"Because what is the child? The child is the child my brother? Is he my son? Is he my. Is he my uncle? Like, what is this child? It's, It's. It's now creating confusion in the. The order of reality itself. It's like. It's. It's literally doing that when you. When you. When you break the normal order of causality of the world."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":2420.23,"end":2426.07,"speaker":"Fr Stephen De Young","text":"Right. And. And you end up destroying what you're trying to usurp."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":2426.67,"end":2427.15,"speaker":"Jonathan Pageau","text":"Exactly."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":2427.47,"end":2429.07,"speaker":"Fr Stephen De Young","text":"What you're trying to gain control of."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":2429.15,"end":2468.55,"speaker":"Jonathan Pageau","text":"Yeah. Which is the very pattern of revolution itself. You see that, that's what, that's what happens, like in the cosmogony. You have a very powerful image of it, which is that, you know, it's like, you know, Saturn castrates his father, but Then he has to eat his children because he's created now a confusion of order that makes it that he's now afraid of his own children because it's like they are. They are not in the right relationship with. With him. They're going to come to get him and he doesn't know what to do. And so you have this. You have this. This confusion that. That. Yeah. That self basically like that self destroys at some ultimate."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":2468.55,"end":2476.15,"speaker":"Fr Stephen De Young","text":"Yeah. Yeah. And it becomes again, rather than producing life, it becomes parasitic. Yeah. It drains it away."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":2476.87,"end":2540.38,"speaker":"Laura Diaz","text":"Tucson, the weight is over. Medi Weight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iHeartRadio. And you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication, but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost the same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better, and lose weight the right way, mediweightloss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com yeah, so, so."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":2540.62,"end":2639.76,"speaker":"Jonathan Pageau","text":"And, and it's interesting because my. My brother mentioned this in his interview with Jordan Peterson, like how he said all the scripture is about that. Like all the scripture is about finding the right distance. Like the right wife, you could say, like between that which is too close and that which is too far. Right. The, the. The. The stranger that loves you, ultimately you could say, which is not a. Not a stranger that's so far that they'll kind of swallow you up. And if you take that trope now that we mentioned and we see that it's there, this idea of you don't want to go to the strange woman because she'll bring her gods in and then you'll be usurped also in that way. But you also don't want to be too close because you create this confusion of Identity in Christ, you have this weird transcendence of all these things. You have this way in which it all kind of gets expanded and collapsed at the same time. First of all, the Samaritan woman, I think, seems to be a direct reference to this question, because one of the things Christ does is first of all, he talks about the well and the, the fountain, which is the image that Solomon uses. When he talks about the strange woman. He says, keep your fountain to yourself. Don't let it run into the streets. And he uses this images of wells and the fountains to talk about not going towards the strange woman. And then Christ basically is the only one who can marry the strange woman but not be taken over by her. He can go to the ends of the world, he can go all the way to the edge, but he's never subsumed by the strange woman."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":2640.8,"end":2687.61,"speaker":"Fr Stephen De Young","text":"Well, and that's. And I think the reason for that is the incarnation. Part of the theme when you read the prophets and they're describing the relationship between God and Israel and why that doesn't work is that they're too different. They're too far apart. And you look at the analogies there. The way Israel is described, it's always as sort of this foreigner, you know, who God finds in the desert, you know, and, and marries. Right. But it's, it's too far apart. But. And this is why Chalcedon's so important, right? Christ is. Is consubstantial with the Father according to his divinity and consubstantial with us."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":2689.06,"end":2735.52,"speaker":"Jonathan Pageau","text":"Yeah, you can see that in some ways it's. It's because one of the things that I've noticed, we did this whole seminar in Exodus, and in the seminar at Exodus, you can see the problem constantly of mediation. Like, God is constantly conceding mediations. But he, like, it's almost like he knows that this is going to cause problems in the long run. It's like, oh, you know, you know, you want Aaron, but then Aaron makes the golden calf, you know, okay, so now you have all these laws and it's complicated. And then you see, you know, and then later in Samuel, he's like, oh, you don't want a king? Like, why would you want. If you want a king, all this mediation is going to. Is going to turn against you. But in some ways, God's constantly conceding it because he knows that it's inevitable because of this problem of distance. And then ultimately Christ ends up being the key to the whole problem from the beginning of mediation, right?"}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":2735.52,"end":2738.68,"speaker":"Fr Stephen De Young","text":"And so, And So Christ can make that marriage work."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":2740.29,"end":2773.02,"speaker":"Jonathan Pageau","text":"Yeah. And so that's why. So Pentecost is like, so. So when the prophets say, you know, one day the spirit of God will be poured out on all flesh, it's like, you can imagine how weird that sounds, even to people who now have been told to not marry the strange woman, to not go to the stranger, to not. But they. It's like they know that ultimately at some point, you know, this marriage will be a universal marriage, will be a marriage with all of humanity. But then how is that possible, considering this problem of. Of distance? You could say, yeah, yeah."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":2773.02,"end":2778.46,"speaker":"Fr Stephen De Young","text":"And so humanity has to become bone of God's bone and flesh of God's flesh."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":2778.7,"end":2779.26,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":2779.66,"end":2781.1,"speaker":"Fr Stephen De Young","text":"Like Eve was to Adam."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":2782.22,"end":2849.9,"speaker":"Jonathan Pageau","text":"And so then this is. This is. To me. Because this is something that I've seen a few, like, writers try to take on. Because when we look at the symbolism of the mother of God in. In. In Christianity, we have this weird thing going on. Right. Which is exactly the symbolism that I'm a tr. That I'm talking about, which is that she's represented both as Christ's mother and as Christ's bride. So you have this sense in which it's suggesting a weird, like, incestual thing. And. But then when you realize what is actually happening, even if you use the image of the Samaritan woman as the example, you realize that Christ is, in some ways, he's beyond that. Like, he. He doesn't have that problem. He's kind of. He's kind of transforming the whole question, you know, and of course, I'm not suggesting in any way that there was something inappropriate between Jesus and. Right. And Mary. What I'm saying is that the symbolism that's being kind of expanded is that ultimately those two, you know, in. In. In Christ are kind of. That problem is. Is transcended somehow."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":2850.83,"end":2867.07,"speaker":"Fr Stephen De Young","text":"Yeah. And part of. Part of the problem with that, frankly, is the modern American and maybe broader Western sort of obsession with sexual relations proper in the material sense."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":2867.23,"end":2883.37,"speaker":"Jonathan Pageau","text":"Yeah. Well, that's why we can't see the. The pattern. If it's not like. That's why people will struggle to say, well, the serpent is trying to seduce Eve. And it's like, I'm not suggesting the serpent slept with Eve in some weird material way, but I'm just showing you that this. These patterns, they have different iterations, you know."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":2883.37,"end":2952.7,"speaker":"Fr Stephen De Young","text":"Yeah, but this is. And this is. This is the problem with the Augustinian treatment, frankly, of human sexuality is that it fails to see physical sexuality as the material signifier of a spiritual reality that remains regardless of the presence of that material signifier. So what I mean by that is, and I've said this to people in marriage counseling a lot, right. If you have a, a, you know, 23 year old couple who just got married and you have an 83 year old couple that's been married for 60 years. Right. The 23 year old couple is having a lot hotter sex. Right. That's a lot more often, probably. Yes. But the 83 year old couple. Right. Has a relationship at a deeper level that goes far beyond that. Yeah, right. Far, far, far beyond that."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":2952.7,"end":2971.87,"speaker":"Jonathan Pageau","text":"Yeah, in some ways. And also kind of in, in that physical aspect of it, let's say, kind of fading away, they capture the pearl like they're moving into the deeper part of what it is that they were moving towards in the first place."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":2972.03,"end":2992.74,"speaker":"Fr Stephen De Young","text":"And those two are not unrelated exactly, they're directly related. Right. But the one is this sort of material signifier, right. Of the deeper reality. And so, but every time we think about any of these concepts, our contemporary minds move immediately to just the material signifier."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":2992.98,"end":2993.34,"speaker":"Jonathan Pageau","text":"Right?"}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":2993.34,"end":3005.22,"speaker":"Fr Stephen De Young","text":"To just, you know, titillation and you know, oh, you're talking about sex. It's like. No, we're talking about the reality behind that. Right? Yeah."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3005.22,"end":3072.47,"speaker":"Jonathan Pageau","text":"And so in some ways what it requires of us is really a complete reversal of the way we think of what is real, you know, and it's not a. Because we tend to, we tend to. And you see it, most people today even, you know, they tend to like oppose, oppose. Normally the spiritual and the material, they oppose it. And so either they fall into one or the other, either they wanted to, to kind of, you know, poo, poo the material, practice in the material world and want to live just in the spirit. You know, like people who say I'm spiritual but not religious, that kind of, that kind of, that kind of nonsense. And then on the other hand, you know, we have people who think that, you know, this material world is so real, like that's what we need to chase after. But both of those are, are a mistake. You know, ultimately to see it in this scale of hierarchy where the physical materiality is the bottom part and the most, the most, let's say immediate, but ultimately has to move us into what it's hiding or what it's not hiding in the bad sense, but what it, what it holds in its center. Like what, what's holding it together."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3073.43,"end":3088.07,"speaker":"Fr Stephen De Young","text":"What, what lies behind it. Yeah, yeah. And again, what lies behind it is there even if you want to try to deny it. Like, people who live very promiscuously, that does things to your heart and to your soul over time."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3088.23,"end":3088.67,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3088.67,"end":3099.04,"speaker":"Fr Stephen De Young","text":"Because you can't be intimate with people physically and not also have. Develop intimate connections in other ways."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3099.12,"end":3102.16,"speaker":"Jonathan Pageau","text":"Yeah. Like leave some part of your soul, like, with that person."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3102.8,"end":3103.28,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3104.96,"end":3105.28,"speaker":"Laura Diaz","text":"So."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3105.28,"end":3110.72,"speaker":"Fr Stephen De Young","text":"Because they're so intricately bound together. Yeah."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3111.36,"end":3144.37,"speaker":"Jonathan Pageau","text":"And. And you know, and I think that it's not, you know, the, the way that the church represents our union, you know, is not arbitrary. And the way. The reason why we insist on marriage is not just some kind of moral finger wagging. Right. It is, it is. And you can see, like, people who live prom with promise, with a lot of promiscuity in their life, and especially people that, that, you know, obviously don't come to repentance. They don't come to kind of a transformation. You know, they, they, they end with bitterness. Like, it's hard not for that not to. Not to happen."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3144.77,"end":3218.84,"speaker":"Fr Stephen De Young","text":"Yeah. And repentance, again, is not like feeling bad and, and whipping yourself. Repentance is being healed. Yeah. From the damage that's been done, you know, and, and yeah. So there, there, there sort of is, There is hope for that. Yeah. And. And part of the, part of the problem with the way we talk about marriage now is that we've got this very modern idea of the nuclear family behind it. Yeah. And that conception of marriage and family leaves a lot of people out and has caused us a lot of problems. So I'm a big advocate as people who listen to Lord of Spirits. I describe it as arguing for the abolition of the nuclear family just to get everybody freaked out, but that we need to come back to within our church communities and things, a more robust idea of family. Like the kind of families we see in Genesis of extended family. You know, that includes a lot that is able to include a lot of people. It's able to include an adult who, for whatever reason, has not gotten married. Yeah."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3220.2,"end":3232.96,"speaker":"Jonathan Pageau","text":"But it doesn't mean, like. I understand what you're saying, but the nuclear family should. I would see it this way. I'd rather see it as like, the nuclear family should be just expanded into this."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3233.36,"end":3233.76,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3233.84,"end":3260.2,"speaker":"Jonathan Pageau","text":"For an expanded family to exist, you need someone to have been a strong nuclear family and then be able to, like, expand that, like, breathe out and to include the uncle that, like you said, didn't get married or like whatever. Someone who got divorced or some, you know, someone who died and the child gets up, ends up kind of going to their brother or whatever. Like, that has to be something that has to. In order for us to. To be able to live in that more expanded way. Definitely."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3260.44,"end":3293.97,"speaker":"Fr Stephen De Young","text":"Yeah. I think the older. The much older. What. What family meant for most of human history. Yeah. Has just been ground down to the nuclear family, definitely. You know, and. And I think right now, so much effort is put into trying to preserve that little bit that's left that we really need to redirect into rebuilding. Not just trying to preserve what the culture and society has left us, but build out, Build back and build out from there again."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3294.61,"end":3334.05,"speaker":"Jonathan Pageau","text":"So I have another question that. Just to get back to the NOAA story and everything, do you think there's. Do you think. Or do you see a relationship between the way that also you're interpreting, first of all, the story of Noah, then also the. The. The story. The way that we talk about the fall of the. The idea of the Nephilim and all this question that. When St. Paul talks about the covering, you know, that weird. That weird sentence when St. Paul says, you know, that. That. That women should wear coverings for the sake of the angels. Do you think that there's a relationship between this idea of uncovering and. And the. The union, let's say, in that sense."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3334.89,"end":3335.21,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3335.93,"end":3345.77,"speaker":"Jonathan Pageau","text":"Can you help us work that out a little bit more? Yeah, because we all have that intuition, but it's fuzzy. Like, it's a fuzzy. It's a fuzzy thing."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3346.09,"end":3359.53,"speaker":"Fr Stephen De Young","text":"Yeah. We're gonna get into all the really wild stuff here in this one video. So there's a phrase that St. Paul uses in that context that's often translated in English. Symbol of authority."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3359.9,"end":3360.3,"speaker":"Jonathan Pageau","text":"Mm."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3363.1,"end":3369.9,"speaker":"Fr Stephen De Young","text":"So the word there. I'll go ahead and say it. The word there is the Greek word for scrotum."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3372.78,"end":3374.06,"speaker":"Jonathan Pageau","text":"Yeah, I didn't know that."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3375.34,"end":3428.38,"speaker":"Fr Stephen De Young","text":"So. And so part of what's going there is St. Paul seems to be referencing Greco Roman medical texts. So the understanding in Roman medicine. And you see this. If you read how St. John Chrysostom deals with this past, the larger passage, you can see it reflected in what he says too. But if you go and read, like, the Hippocratic corpus, they believe that hair served as sort of a receptacle for male seed, that it was sort of drawn up into the body by. By hair."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3428.62,"end":3429.18,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3429.74,"end":3515.75,"speaker":"Fr Stephen De Young","text":"And therefore. So a woman who wore her hair long, exposed was presenting herself as sexually available. And likewise, a man who wore his hair long culturally was considered to be presenting himself as sexually available to other men. And that's why St. Paul says having long hair is a shame. Right. To a man. And you're Going well, wait a minute, what about Nazarites and stuff? Right. He's not referring to that. He's talking about this thing in this context. Right. And so because of that, essentially a woman's long hair was seen as a genital structure. That's why he can use that word. Right. To, to refer to it. And so to have that exposed in worship. Right. Would be presenting oneself as sort of sexually available within the context of worship. He's writing this to Corinth, where to be super blunt, most of the religious festivals were accompanied by orgies. Right. And saying there is, there is no place for that within."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3517.04,"end":3517.28,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3517.44,"end":3537.12,"speaker":"Fr Stephen De Young","text":"The Christian worship context. And then is referencing in terms of the. Because of the angels. Is referencing back to the idea of the Nephilim. Yeah. Right. Which proceeded, as you mentioned earlier, out of this ritual context. Yeah."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3537.12,"end":3565.23,"speaker":"Jonathan Pageau","text":"Which is happening. Which is a ritual context in the worship. Like they are in the ritual context there. And so there's like a confusion placing yourself as available to receive the influence of higher states, but not being properly covered so that you could become like a, you could become like a receptacle for the wrong. Like for, for the, let's say for the. Yeah. For, for. For the intermediary beings. You could say it that way maybe."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3565.71,"end":3576.2,"speaker":"Fr Stephen De Young","text":"Right. This is, and this is the ability to bring life into the world is a power that women possess. Yeah. That needs to be protected because of how powerful it is."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3577.96,"end":3611.57,"speaker":"Jonathan Pageau","text":"Yeah. And so I mean, it makes, it's. It's complex because it's working, it's working on mo. It's working on all these multiple levels at the same time. Because in some ways we can understand it. Something like if you were going to be very boring about it, we could say something like if the woman is uncovered in, in this, in the, in this, in the context of worship and a religious ritual, she is opening herself to influences that are. That would be kind of these free floating intermediary influences, you know, that aren't."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3611.73,"end":3612.13,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3612.21,"end":3627.66,"speaker":"Jonathan Pageau","text":"God himself that are kind of like this kind of intermediary world that's messy and, and full of mixture of angels and demons or whatever. And that. And that in some ways that would be dangerous for her. Dangerous for the church. Dangerous for."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3629.1,"end":3665.74,"speaker":"Fr Stephen De Young","text":"Yeah. Right. And. And Noah's sin then in the case is not just, oh, he got drunk and embarrassed himself somehow, he got drunk and did something embarrassing, which, you know, you shouldn't do. But in terms of like severe sins. Right. Not probably top of most people's list. His. His sin is being drunk and inebriated. Right. On. On the good things of this world and failing to protect. Right. The. The. His nakedness. Right. Protect."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3667.1,"end":3673.86,"speaker":"Jonathan Pageau","text":"Yeah. Well, the theme is there because Lot gets drunk before he Be. Court before. Right."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3673.86,"end":3675.22,"speaker":"Fr Stephen De Young","text":"He passes out and. Yeah."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3675.22,"end":3750.25,"speaker":"Jonathan Pageau","text":"Or his daughters. And so there's like a. There's definitely a narrative relationship between the two. And I think that it's. Because iconographically we represent it straightforwardly. And so if you have an iconographic representation of this scene, you will see like a vine. You'll see Noah drunk asleep, and then you'll see Ham, like, pointing at his nakedness, usually. And then you'll see like, the two. The two sons walking backwards, you know, with like a. A sheet. And I think that it's. It's completely appropriate to kind of take it at the first level, especially if we're going to represent it visually. But if we want to understand how it relates to the rest of the Bible and how it relates, you know, to all these. These moments of beginnings and all these moments of transgression all the way into Christ. And we have to see that it's more than just this kind of, like, this kind of weird thing. Because if you think about it, like, you know, it. It's like anything, right? You. You. You think, okay, so all of Canaan is cursed. Like the whole. Not just the son, but like the whole descendants of Canaan is cursed because his father saw his own father naked. It's like, man, that's rough. That's a. That's a rough thing."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3750.97,"end":3755.05,"speaker":"Fr Stephen De Young","text":"But that's also. See, that's a. So the, the father son thing."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3755.37,"end":3755.85,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3755.93,"end":3774.34,"speaker":"Fr Stephen De Young","text":"In scripture is always talking about repeating the pattern. Yeah. Right. So the Canaanites had come and laid claim to this land that belonged to God, and that was not their inheritance. It was someone else's inheritance."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3774.5,"end":3778.42,"speaker":"Jonathan Pageau","text":"That's right. Yeah. So it repeats it in the. In the context of the two peoples."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3778.42,"end":3793.61,"speaker":"Fr Stephen De Young","text":"Right. And so that. That, that pattern repeats. Yeah. In the lot case, the. The idea of him failing to protect his daughters is really brought out leading up to that, because if you read closely of the story, he had betrothed both of them to men of Sodom."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3793.69,"end":3799.85,"speaker":"Jonathan Pageau","text":"That's right. Yeah. And he basically. He proposed to basically, like, just throw them out there, man. Right."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3799.93,"end":3808.33,"speaker":"Fr Stephen De Young","text":"To give them to the mob. Right. And so, yeah, that final episode. Right. Is of incessant."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3808.97,"end":3828.78,"speaker":"Jonathan Pageau","text":"It's a reversal of outgrowth for sin. Like, it's like. It's almost like it's a pendulum where he was willing to give his daughters up to these. These destructive men. And that Was like the sin of the too far, you could say. And also this, this. And then finally turns back on him and then he becomes the father of his own grandchildren, you know."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3828.86,"end":3843.05,"speaker":"Fr Stephen De Young","text":"Right, right. Yeah. Abraham is so concerned, he wants to find Isaac away from his own people, whereas Lot is just like a couple of the guys here in town. You guys can marry them. That's why that's fine."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3843.05,"end":3889.5,"speaker":"Jonathan Pageau","text":"Yeah, well, and especially in that sense, because you also see in the. In there already in Genesis, you have this image where was it? Hamor, who wants to marry into Jacob's family and says, if we marry their daughters, then we'll basically take them over. Like, it'll take a while, but, you know, at some point we'll just take whatever they have because we'll just keep taking their daughters and. And then we'll overwhelm them and then they'll. They'll basically disappear and stop sort of assimilate them. Yeah, exactly. You know, and so it's like that's the image that Solomon tries to bring about when he talks about marrying the strange woman or the idea of the strange gods. Like, you. You have to find that balance so that you're not swallowed up by the. By the outside."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3890.14,"end":3892.98,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3892.98,"end":3952.47,"speaker":"Jonathan Pageau","text":"And that's. And you can apply. I mean, I don't want to sound like I'm making this trite, but you can apply this at every level of structure that we're involved with. Like, let's say you, you have any kind of team, you know, it's like. And you're doing something like, if you just constantly circulate within yourself, like, you know, it's like you're just constantly. Everybody's always within side the team in a way that at some point, you know, just becomes circular. You're going to break down. Like, if you do that for a while, it's going to break down. At some point you won't be able to. But if you just like go on the street and just hire anybody, just go out and like, oh, you, you, you, you, you're not doing anything. Why don't you come work on our team? Then you run the risk of becoming. You have to find that balance between, you know, what we're doing and innovation or new or new blood. And. And so you have to kind of find. You're always trying to find that balance between that which will invigorate the team but won't, you know, basically take its identity away in the long term."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3952.63,"end":3965.68,"speaker":"Fr Stephen De Young","text":"Yeah, well, I think it's even. I think it's even true. At the level of the human soul, we're very much now able, with the Internet, for example, to put ourselves into an echo chamber."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3966.32,"end":3966.72,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3966.72,"end":3973.44,"speaker":"Fr Stephen De Young","text":"Where we only ever talk to people who endorse everything we ever say, do and think, you know, who agree with us about everything."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3974.64,"end":3976.56,"speaker":"Jonathan Pageau","text":"Right, right now, that's exactly right."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3976.56,"end":3996.33,"speaker":"Fr Stephen De Young","text":"You know, and the solution to that is not the opposite, is not to just expose yourself to everything and be completely credulous and believe anything anyone tells you and sort of sell everything out. But there's again, the. The middle distance. Yeah, right. Yeah."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":3996.33,"end":4014.06,"speaker":"Jonathan Pageau","text":"And you can see when you don't do that, what happens. Like, there's a. This is a weird example, but it's the one that comes to my mind, which is that there's an interesting debate online, a monk debate, between. It's like Mataibi and I forget his name and like Malcolm Gladwell."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":4014.06,"end":4014.42,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":4014.5,"end":4015.22,"speaker":"Jonathan Pageau","text":"And it's about."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":4015.22,"end":4016.54,"speaker":"Fr Stephen De Young","text":"Yeah, I've actually heard it, see that."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":4016.54,"end":4023.14,"speaker":"Jonathan Pageau","text":"It's about media capture. And you can tell that the Malcolm Gladwell side was so much in their echo chamber."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":4023.46,"end":4023.86,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":4023.86,"end":4071.35,"speaker":"Jonathan Pageau","text":"That they didn't even understand the arguments of the. Of their opponents. And so they kind of. They were just in this illusion of their coherent world. And then their world just got shattered on stage, like smashed into pieces. And. And they lost the debate by the. The biggest margin anybody's ever lost a monk debate. And they don't. They still don't understand why that happened because it's like they're so into their own, like. And so you can actually see it. It's like, it's actually. Even as a Christian, let's say, and if you just have these weird, like, internal things like that, you're just talking to other Orthodox Christians and all you talk about are like divine energies, like, all day, and then. And then you haven't ever. You haven't encountered anybody from the outside. You haven't discussed with. With. With anybody outside. Then at some point when you, when you're challenged, you'll just. You'll shatter."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":4071.99,"end":4075.03,"speaker":"Fr Stephen De Young","text":"Yeah. And there's no, there's no creative power in that."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":4075.11,"end":4075.67,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":4076.15,"end":4081.15,"speaker":"Fr Stephen De Young","text":"That's never going to go anywhere. Produce anything new. Right. Give life to anything."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":4081.15,"end":4089.43,"speaker":"Jonathan Pageau","text":"Yeah, Anything living. Yeah, yeah, exactly. All right. This is. This is wonderful. I mean, we really went right to the edge there. Father Stephen."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":4090.71,"end":4094.79,"speaker":"Fr Stephen De Young","text":"Yeah. I'm pretty sure you weren't going to try and monetize this, so that's probably good."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":4097.88,"end":4133.01,"speaker":"Jonathan Pageau","text":"I didn't expect you to use you to use the word scrotum in our discussion, but there you go. That's how it goes. Thank you for your time. Thank you also for everything you do and everybody. I am also. I'm really excited to have you talk to us at the Symbolic World Summit. It's going to be amazing. And don't forget, people also to look out for the Symbolic World Journal, which will have his Father Stephen's exposition about this very question in printed in the Journal. So, so a lot of great things coming on the horizon. Is there something you're working on that you want to give us a peek on?"}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":4134.45,"end":4149.54,"speaker":"Fr Stephen De Young","text":"Well, Lord, Lord willing, the next book. I've been doing this big project on St. Paul, so sort of from an orthodox perspective. So that's probably the next thing in print you'll see coming."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":4149.54,"end":4150.46,"speaker":"Jonathan Pageau","text":"All right, that sounds."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":4150.46,"end":4151.94,"speaker":"Fr Stephen De Young","text":"So that'll probably be sometime next year."}
{"episode_id":"SW - #308 - 2023-10-09 - Fr. Stephen De Young - Biblical Symbolism - Uncovering Your Father’s Nakedness","start":4152.9,"end":4172.26,"speaker":"Jonathan Pageau","text":"Wonderful. All right. Thank you, Father Stephen. It's great to talk to you. If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase. So go to the symbolicworld.com and thank you for your support."}
