{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":12.08,"end":13.44,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":13.84,"end":15.6,"speaker":"Announcer","text":"Welcome to the symbolic world."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":25.77,"end":120.53,"speaker":"Guest","text":"The two things I wanted to discuss were the idea of the city and the idea or that a city has a kind of intelligence or consciousness. That is the first kind of thing I wanted to discuss. And the second thing I wanted to discuss is the nature of church and how that relates to, I guess, our own spiritual journey. I think those two things are the things that stand out for me personally, listening to a lot of your YouTube material. Those are the two, like, interesting ideas to me, like the idea of a city as a something may be conscious and the idea that we can't kind of go it alone in this life, and the kind of individualistic, like, attempt to do that has a limit. And so I guess the main thing with the city is you've said before that, like, a city is something we can pray to, that we. Or that we can communicate with in a way that's analogous to a person. So I can ask my friend the question, and that friend can choose to respond to that question or not. And. But that's a kind of prayer there. Or entreaty to my friend, like, oh, what do you think of this? And in a similar way, I can do that in a city or something that's not as obviously a person as my friend in the sense that they don't have a physical, fleshy body. A city doesn't necessarily have that. So I guess I'm trying to think of how to formulate the question."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":121.73,"end":191.58,"speaker":"Jonathan Pageau","text":"I understand how it's difficult to think about it that way. So the first thing, maybe to. The first thing to understand is that Obsidian definitely has a body. It does have a fleshy, physical body. Okay. It's just that it's not as. It's not. It's not a body that we can perceive at a glance the way that we perceive a person at a glance. Right. So you kind of person there he is like he's contained in space. I can, you know, I can go around them. You know, the city is also like that, but just bigger. It's just. It's just bigger. And the space between the parts, let's say, are bigger than the space between your parts. But you also have space between your parts too. Right? There's. There's massive amounts of space between your molecules and between your different parts. It's just that at the human level, we don't necessarily interact with them. That's the first thing that's important. Now the second thing that's important to really understand is that all the things you encounter of the city are always parts of the city. And so they don't contain the intelligence of the city, they only manifest it at their level. That's really important because when I."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":191.58,"end":208.5,"speaker":"Guest","text":"Which is all we can ever encounter, so we can. Is that as me in Bristol, for example, I can only encounter the expressions of the identity of Bristol in its particular ways in which that participates in that my story. Is that what you're saying?"}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":208.98,"end":290.07,"speaker":"Jonathan Pageau","text":"Exactly. But not only that, but it's actually similar to even the way you encounter a person. Because when you encounter a person, you're encountering their body and you're encountering the sounds that they make, or you have all these experiences, and then behind that you can perceive the intelligence. But the intelligence is not limited to the fleshy stuff and the stuff I hear. And so that's why sometimes when I say something like, it's a city has being, the city has intelligence. Then people, for some reason, they still. They're in. They have to exist within the material. This weird material world where the intelligence behind it, so. So you could even imagine yourself like even. Not only. Even your physical parts, but let's say even your mental parts. Like your mental parts are multiple for different situations, but they all embody something like your spirit, which is completely invisible and beyond the parts. So if I ask you. If I ask you to show me how to cook, right, or if I ask you to, I don't know, like I ask you a deeply personal questions, it's not the same part of you that will engage me. There'll be different parts of you that will engage me."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":290.15,"end":293.47,"speaker":"Guest","text":"Depending on your prayer. Exactly."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":293.47,"end":376.58,"speaker":"Jonathan Pageau","text":"Depending on your prayer. And so you could imagine that, like, let's say your. Your spirit will send emissaries, and those emissaries will. Will manifest different aspects of you depending on what is needed. So if I come at you with a knife, then you're not gonna answer me with the same emissary as if I. If I come to you with flowers, right? It's gonna be a different. You're gonna send a different part of you. And so you can understand that the city is the same where you write. Like, if you need something, let's say there's a pothole in your street, and so now you want to get rid of the pothole. So you obviously won't write to, like, let's say the people that take care of the parks. Let's say you'll write to the people that take care of this city. So you'll write to the person at the city garage or whatever. However it's structured in your city. And then you'll write them and you'll ask them to come fix your pothole, right? And so those people, they're bound by the rules of the city, but they're not acting just as Joe and Jane, because they're supposed to act according to the budget, according to the general projects, according to the way in which these roads are built. So they're supposed to embody the will of the city."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":378.22,"end":472.67,"speaker":"Guest","text":"So it strikes me as well that, like, there's an interesting connection between human beings as conscious and the city. So when you say the city has a body, one of the ways to think about that is that, like, every member, every human member that makes it up is. Comprises that body. And so I guess what I. Another question that comes to mind is like, I recognize there is a kind of consciousness and intelligence to the city. Is that consciousness or intelligence kind of in our image? If you, if you know what I'm saying, like, in the sense of the words consciousness and intelligence. Personally, I can only really have a sense of what that means in terms of this living life, like the phenomenology, like my experience, I guess, and. And the. And I guess there's theological traditions that talk about the nature of the human soul and the human person. And so. And like, humans kind of have to establish cities. Like a city couldn't be intelligent without human intelligence is kind of what it seems to me. And if that's so, are they. There's a way in which we could think that therefore we're kind of projecting a kind of. I have a kind of consciousness, and therefore I recognize something similar in the city. But I don't want to go that far because I do hear what you're saying. Like, there is a genuine kind of autonomy kind of coming back at me from the city side. Like, that is acting like a city."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":473.15,"end":543.75,"speaker":"Jonathan Pageau","text":"So think about it. Think about it in terms of your parts. It's the best way to understand. If you want to help you understand it, you need to be able to try to find the analogies of your parts. And so you could say that you have processes, let's say, in your. In your mind or in your experience. So you have. You have certain processes that manage different aspects of your. Of your reality. You have processes that manage or express your emotions. You have processes that will calculate. You have different processes. And it's not like you don't even have to be able to fully identify them. Let's say there could be some malleability in that. Those you could Say that your singular existence, your soul, your spirit is, is an image of those smaller processes. You could do it the same the manner in which the processes unify a certain aspect of reality. So let's say you have a certain process which unifies different things together and kind of manifest then in the same way you, the top part, do you do the same to all the, all the processes. So, so to say, for example, that one is the image of the other, it just, it's not a. It's not super use. It could be useful."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":543.99,"end":544.71,"speaker":"Guest","text":"I see."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":545.11,"end":546.59,"speaker":"Jonathan Pageau","text":"It's not as useful as you think."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":546.59,"end":551.35,"speaker":"Guest","text":"Maybe, you know, so it's genuinely fractal, I guess, is so similar."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":551.59,"end":619.93,"speaker":"Jonathan Pageau","text":"Yeah, yeah, it's fractal all the way down. Because those processes will have sub processes and there's an indefinite amount of sub levels where each sub level will have the same structure as the higher level. So we, but then we. That scales up, then that scales up too, from the person into communions of persons. But you can also, if you want to understand, at least, let's say, how the being of a city works, you can understand it. Let's say if you've ever found yourself as the leader of a team, you can experience the higher consciousness of a city. When you're a leader, you can actually experience it because all of a sudden you have a bigger body, but it's not you, because obviously if it was just you, people wouldn't follow you. It's because you're the leader of the team doing something in common. But you can nonetheless participate in that experience where it's like, you know, you're, you're sitting at a table and then people tell you their opinions and then you decide and you say, we're going to do this. And then all of a sudden all the different agents align themselves in front of what you've decided and now they act as an extension of your body."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":620.44,"end":642.6,"speaker":"Guest","text":"Well, I guess. And so then that kind of brings the idea of authority to mind because they do that. They do that if you have authority, right? And maybe that's like doing it in the name of something. So like in the name of. In the name of this end, we're going to do this. So do we all want to foresee this end? And then that's like a just kind of adjust, kind of pattern, right?"}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":642.84,"end":689.8,"speaker":"Jonathan Pageau","text":"That's exactly the way it works. And so you can understand it. So for example, if you want to understand a society, you could understand, let's say a medieval structure of society where they had, they had almost like a caste system. There's those that pray, those that fight, those that work and they're embedded into each other. That is that, let's say you do business, but if you, if, when you do business you're not serving a higher goal, then at some point it's going to become self devouring and it's not going to sustain reality. That's when you get, you get parasitical, parasitic patterns. You get. Idolatry is a good way to understand it. So imagine someone in city services becomes a little tyrant and decides to do things for themselves and so they become corrupt."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":690.28,"end":704.29,"speaker":"Guest","text":"Does that mean to be like to name? It's kind of like there's a self naming in that, right? Like you follow me, right? Like why do we do this? Because me, like it goes in my name instead of like in a higher name."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":704.45,"end":767.18,"speaker":"Jonathan Pageau","text":"Yeah, that's what idolatry is. That's why the idea that the gods required worship, like this whole thing that they're talking about in Lord of Spirits, the idea that the gods took worship for themselves and in doing that they castrate the Father, right? They cut themselves away from the seed of that which is above them. And when they do that, then they open, they open the door for corruption underneath them. It's like they're basically opening the door for revolution and breakdown. So you can see it like, you can see it in a city when a city becomes corrupt and then the people in the city start to act on their own accord and they don't act towards the communion of the city, the higher goal of it. Then you get social breakdown and it manifests itself all the way down. The money doesn't get to the projects, the streets aren't fixed, the buildings start to fall apart, the police doesn't police properly and everything starts to fragment because the different principalities aren't aligned towards the higher identity."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":768.38,"end":858.01,"speaker":"Guest","text":"So I guess this kind of connects to the second thing I wanted to talk about with church. The word like ecclesia kind of brings this connotation of like community. And so there's. So a city breaks down if it's not structured according to the right authority. I guess I'm wondering like what. How do me and you as members of our cities change that? Or like what kind of agency do we have in that process? And I think that's connected to prayer or like even more, or like generally culture, things like music, things like street art, or like just the ways the city kind of manifests. One of the ways I thought about this idea of a city and just an electronic music Producer I really love AS has written music that kind of seems to me to like capture the soul of London. And like there's just when I was meditating on this idea that you mentioned the city as a being. And so, so my point is, is that as members where we seem to be kind of, do I want to say co creating or kind of like are the way in which we use our logos or the way in which we pray and ask different questions of the city kind of is connected to the fate of the city, isn't it? And yeah, what do you make, what do you make of that? And I guess, sorry, it's a bit of a rambling one. Maybe I'll just shut up."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":858.33,"end":1046.41,"speaker":"Jonathan Pageau","text":"Yeah, but so the first thing you need to understand, the first thing also you need to understand is that the city itself is not the top of the hierarchy of being. Right. And so it's like the city will only be alive if it's ultimately aligned towards higher goods besides just the city itself. It has to be, it has to be attached to God ultimately you could say, you know, in order for things to lay themselves out properly. And so of course it's hard because things never tend to, not rarely be completely aligned under God, you could say. But so a way in which you're in a city and you see the city fall apart, it's falling apart. Now. One of the ways to stop the city from doing that is to attach yourself to a higher good. So you can think of it like. So an easy way would be something like an easy way to understand it would be that if you're writing the city, is that you're writing the city because the pothole is falling. So you're sending a letter to the, to the municipal garage or whatever and then they're not doing it. So at some point you're going to write a letter to your counselor, city councilor, right? And then, but then it's not happening. And then at some point you're going to write a letter to write to the mayor or whatever, you're going to escalate the hierarchy in order to see things happen. And so you could understand that that also embodiment is part of that, which is that if you're watching the breakdown of the city around you, you embodying the ideal of the city will help to mend things as they're breaking down. So you could think of it like everybody's a jerk to everybody else. It's a big city, nobody's talking to anybody. I'm going to be the Exception. I'm going to bake cookies for my neighbor. Or whatever it is you decide to do to restructure your immediate surrounding according to a higher good. And the amount of transformation you can create is really surprising, actually. You can be very surprised at how much transformation you can bring about by doing that. We tend to neglect the capacity for people because you're sending out ripples and you're actually creating new models because one of the people model themselves on each other. That's how we work. Right. We. And so if there are no models around us, then we, we tend to degenerate. Now if we, if someone just sets themselves up as a model, people will start to imitate it. Especially if it's a model that is, that is bringing about a greater good. Or they'll hate you. It could be either one. They could either model or they could hate you. And then it'll still transform them even though. Transform them even though they hate you. Right. That's like one of the, what's one of the revelations of the Christian mystery, let's say is that sometimes when you do that they hate you and they kill you or whatever, they eject you, but then it still, it still does it, it still does the trick, even though it's not, it's not fun for you."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":1047.37,"end":1070.27,"speaker":"Guest","text":"Yeah, yeah. So like it does the pattern of, you said, you know, the self eating idea, like that seems almost like logically use the word self defeating. So it's like, is there a way in which that pattern is kind of, I don't know, metaphysically broken and that the true authority kind of idea we were talking about, like come back."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":1070.27,"end":1104.91,"speaker":"Jonathan Pageau","text":"Yeah, you can imagine that. Like there, there are several ways out of the, out of the chaos. One is to restore, to remember. Right. I use those terms a lot in my videos to remember, Remember that which binds us, remember that which connects us. And so in remembering you're reconnecting yourself and your, you know. But the other way is also the way down is works too. But it's just that it's, it's not as fun. Right. It's like if things total, if everything breaks down and total chaos reigns, then you know, whatever seed is there is going to grow in that chaos. But it can be painful."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":1106.6,"end":1230.98,"speaker":"Guest","text":"Yeah, yeah, no, thanks. Thanks for, thanks for exploring that with me. I guess the other kind of thing was. Yeah, it's a bit of a different topic. So it's like, I guess what I learned personally this last year is how my own prayer, it's like how impotent my own Prayer is or something like that, or like at least my own efforts and my own self reliance how I guess in terms of my own spiritual life, like being aimed in the wrong direction, sinning. There's lots of ways in which I'm aware of doing that myself. And like I want to stop doing that and kind of repent and turn and aim in a different direction. And I guess I've made as earnest an effort as I can to do that this year and failed. Yeah, it was like bringing us the meaning of humility, I guess is like very brought low in that kind of thing. And so I guess the reason I'm mentioning it is because one of the things that really struck me in your work is this kind of call to church and church as community or as kind of something higher than just my own self reliance. And it strikes me as intuitively true, you saying that. I'm just personally figuring out, I guess, what the ideal structure of prayer is. Or like, do others need to be praying around me in the same direction? These kind of questions, like, is me trying to ask the right questions alone going to be enough? Because it doesn't seem to be. It seems like we all kind of need to pray together kind of thing. And so I've seen that as a big theme in your work. Do you think it's like necessary to join communities or higher bodies to fully, to live a spiritual life, to like aim properly and to repent of sin? Can we do it on our own? Like, what is the place of community, etc."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":1232.02,"end":1415.76,"speaker":"Jonathan Pageau","text":"Yeah, but I definitely think that it's better. It's definitely better because you're also inserting yourself into a hierarchy, like a functional hierarchy. The difficulty with a lot of spiritual work, let's say, is that we often get deluded. We think we're acting towards our own good, but we're actually just imbibing our own passions. We don't even realize it. And so it's good to have people around you to be able to point that out to you or be able to kind of burst your bubble of illusion. So I think that that's definitely. It's better to be part of an actual community. And for sure it's like a church, for example, like a traditional church. What's great about that is that you're also involved in the hierarchy of authority. And so if your buddy, like let's say your buddy comes up to you and says, you know what, you should lay off a sauce, you drink too much or whatever, you know, I mean, maybe, like, maybe it'll have an effect on you, or maybe not, right? It's difficult because it's not like they have an authority over you. They're not allowed to tell you what to do. And so putting yourself in a situation where you have someone who's actually allowed to tell you what to do, it can be. Sometimes be useful because when someone tells you what to do, like this is like the secret that the entire modern world hates. They don't realize it. But when someone tells you what to do, they are also inviting you, especially if they have authority over you, they're also inviting you to draw your capacity to do it in them. Because it's like you're actually. You're drawing your attention. You're drawing your capacity to do whatever you need to do in them. And they also bear some responsibility on whether or not you succeed, right? So imagine a parent with a child, right? It's like a parent tells the child what to do, the child doesn't do it. The child is naughty, but the fact that the child doesn't do it actually reflects on the parent. And so the parent actually has some responsibility for the fact that the child doesn't do it. And so in a spiritual relationship with the. With a spiritual father, with a priest, that's what's also what happens is that they are. When they tell you what to do, they are also somewhat making themselves responsible for the consequence of that. To a certain extent, not completely it's yours, but it's also theirs as well. And so that's actually like, if you've ever experienced someone, let's say you're in a sports team is a good way to experience it. It's actually pretty simple, right? It's like a coach tells you what to do. And it's like, he could have said many things, but he says this. This is the play. This is what we're gonna do. And he's like, it's gonna work. Or the team captain, it's gonna work. This is gonna be our play. And so you're like, yeah, all right. And so you draw in what that person tells you to do, the energy to do it, and then you do it. And if it fails, it's not just your fault, it's his fault too."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":1416.32,"end":1416.88,"speaker":"Guest","text":"Yeah."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":1417.53,"end":1435.37,"speaker":"Jonathan Pageau","text":"He could call you out, though. He could call you out and say, I saw you didn't put all your juice into the play. Like, I saw you kind of skimped out on us. You didn't totally put yourself into it. There'll be a negotiation between whose responsibility is, but it's not going to just be yours. So there's a. There's an advantage to community, which is that that's a great advantage."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":1435.69,"end":1467.09,"speaker":"Guest","text":"Do you think that's a. Do you think that's necessary and essential? Like, because. Because you mentioned the modern age. And it strikes me that like, that's kind of the whole problem is like our relationship to authority and our like. And maybe it's something to do with adolescence and growing and like trying to become someone independent of our parents. I don't know. But there's a kind of modern resistance to authority and that seems to be connected to a whole host of problems."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":1467.25,"end":1575.96,"speaker":"Jonathan Pageau","text":"Yeah. But the thing is, the secret is that it's. It's actually not. It's both the. The kind of obsession with, let's say removing authority. Like this kind of obsession with like being your own man and acting in authority and everything is in. Isn't it funny that that way of thinking came. Comes about at the same time as the state is acquiring absolute power over your life. That it's actually those extremes will just real traditional authority is more fractal and is more organic and is this kind of negotiation discussion between the levels. Whereas our world is rock and roll rebel. Rock and roll rebel. Taking drugs, doing whatever I want. Dude, I'm totally free. And I can't build like a. I can't put like a porch on my house without getting a permit from the city. And I have to do it with like so many feet and so much thing and everything. And. And it's like that's. That's the modern world. The modern world is those two extremes at the same time. It's like an extreme of. Of like ultimate absolute power that completely permeates your existence. And at the same time, this kind of weird anarchist. Anarchist rebellion. The Internet is a perfect example of that. The Internet exemplifies that. That extreme in such a sublime way that it's almost, you know, the promise of like, doing. Of being anything you want, of saying anything you want. Metaverse, you could be whatever you want. There's no limit. You could become. You could be a lobster centaur if you want. In Metaverse, there's no limit. But really interesting. It's like they'll be controlling every word you say at the same time. So it's like. It's an interesting extreme that the modern world is."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":1577.2,"end":1582.96,"speaker":"Guest","text":"Yeah. Which is I guess just authority creeping back in. Right. Is like the authority is there either way."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":1583.2,"end":1602.41,"speaker":"Jonathan Pageau","text":"But it's like an extreme authority based on an extreme freedom. And it's not a normal. Not a normal negotiated fractal authority. Because it's like in a normal world, like, think of a parent and a child, right? Like a normal parent, right. So the parent says, do this."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":1602.57,"end":1602.97,"speaker":"Guest","text":"Right?"}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":1603.29,"end":1652.24,"speaker":"Jonathan Pageau","text":"And then they have to be attentive to the child, even if they don't know they are. Because I could say, I want you to do this. Like, I want you to clean your room. And it's like the child's like, okay, I'll obey my parents. I'll clean my room. Then the parent could say, I want you to clean your room. I want you to clean the house. I want you to paint the house. I want you. And it's like just. And then all of a sudden it's like the child will just not do it. They won't. And it's the same child that was willing to do the clean the room at the outset. Then they won't. And so it's like relationship, normal relationship between authority and people under authority is a constant, like observing negotiation. And then the child has to perceive that they get something from that relationship too."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":1652.64,"end":1691.51,"speaker":"Guest","text":"There's like a fittedness that's really interesting and that is constraining excess. And is that connected to the encounter of persons? Like. Like there's a. Yeah. Is that because of relationship that I'm fitting myself to my parent or to my authority and trying to come into the proper relationship? And yeah, there is something very like living and organic about that. And so you're saying that, I guess the Internet or maybe technology generally, but let's say the Internet is not living in that same way."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":1691.67,"end":1746.83,"speaker":"Jonathan Pageau","text":"It just tends towards extremes. Just tends towards extremes. And the extreme. It's the extreme. So think about, think about in your person, right? So it's like, man, I want to be free from all these authorities. I want to be free. I want to be free. It's like I want to be free to do whatever I want. And then the guy starts drinking and drinking or whatever and then becomes an alcoholic. And all of a sudden is a slave to that God, like an absolute slave. And their whole, their reality now becomes negotiated for that one thing that has now enslaved them. So that's the irony, the irony of wanting to break down the structures of normal structures of authority, end up creating tyrannical structures of authority that will just completely control you. Like, it's actually in the process itself. It just happens. It's not. Yeah, I don't know if that makes sense."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":1747.07,"end":1779.41,"speaker":"Guest","text":"Yeah, I mean, yeah, it makes some sense, I guess. Yeah. I guess the main Thing I. The way I'm thinking about it is, like, it's this submission thing because, like in the sports thing you mentioned, or like, the military might be another good example. Military particularly, like, there's this emphasis on, like, submission. Like, it's like you can't actually be a part of the body without submission. Right. Like, if you're not submitting to the. Your local authority and you're not in that. Right. Relation as you're saying, you're like out of the body. Like it cannot kind of exist. If that's the case."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":1779.89,"end":1802.45,"speaker":"Jonathan Pageau","text":"Yeah. You have to submit. And in the military especially, like in a normal kind of military world, there'll be a fittedness. Of course there'll be fittedness. Because it's like if the commander can tell you, okay, now run 10k, it's like, that's something. But he's not going to say run 100k. If he says that his troop is going to disband, it's going to cease to exist or they're going to die."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":1802.53,"end":1804.69,"speaker":"Guest","text":"Why do you think that is? He's just asking too much."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":1804.85,"end":1826.63,"speaker":"Jonathan Pageau","text":"Yeah, it's just not fit. It's just not fitting. But you could get them to run 100k, but you would need a concentration camp where the people are prisoners. And now you say, you do that or I kill you and then they will run 100k. Right. That's what I mean. It's like. It's like, let's say that the extremes. Let's say it's those extremes that show. Break down the pattern."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":1827.99,"end":1847.92,"speaker":"Guest","text":"It's like you're saying there's a kind of organic or intrinsic justice to the authority. Like if I'm. If someone is submitted to me, there's almost like an inherent. Justice is probably the word I want to use to the demands I can actually make on those below. I guess for practical reasons as well."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":1848.96,"end":1958.4,"speaker":"Jonathan Pageau","text":"Yeah, it's just inevitable. Like, it's just really reality playing itself out if you're not attentive to the needs of. So you could say. So, for example, like, you could say that the French Revolution is, is a. Was a result of a breakdown in the normal relationship of authority that should exist in a society. And so it's like, I cannot, I can disagree with the peasants killing the king, but I can understand it. I can understand why as the, as let's say the. The aristocracy separated itself from its people and then stopped actually engaging and just wanted to get taxes from their land. But weren't there, like, making sure the kids were going to school you know, making sure his, his serfs were, were receiving medical treatment or whatever it is that a lord should do, then at some point it doesn't hold. That system doesn't hold. And it's like that for all normal authority systems. I mean, it's something that people today have such difficulty understanding. But the idea, for example, that Jordan Peterson jokes about, not jokes, but mention that a lot, the idea that women have been oppressed for 10,000 years by men and that the characteristic of relationship between men and women has been like masculine dominance and oppression is just, it's just absolute bullshit. Like it could never, it could never be sustainable. Like there would always have to be a negotiation between, between the relationship between the man and the woman. And sometimes it might go a little too much on one side, sometimes it might go a little too, too little on the other side. But you can't really, you can't hold it in the extremes for a long time unless you supplement it with technology. If you supplement it with technology, then you can go really far in one direction or the other. So you can create."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":1959.6,"end":1989.83,"speaker":"Guest","text":"That's something, it seems intuitively it feels like that's connected, to use the word organic. It just feels like the computer is not organic and that there's something there. Like there's something like quantitative and logarithmic or algebraical or, you know, about that whole system that isn't like my relationship to my mother or my boss or the different human persons I encounter."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":1990.63,"end":2023.46,"speaker":"Jonathan Pageau","text":"Yeah, but it's, it's extension of power. It's always an extension of human power. And so, so let's say in a normal, like in a normal relationship. Let's say in a normal, in a normal power relationship, right, There's a leader and there's someone following them, and so the leader asks something of the person following them and that person kind of follows. Maybe they use a little bit of coercion. At some point, there's a limit. At some point, like at some point it's just going to break. But if I have a gun, I have way more power over you to make you do whatever the hell I want."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":2024.02,"end":2025.26,"speaker":"Guest","text":"I see, right."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":2025.26,"end":2069.21,"speaker":"Jonathan Pageau","text":"If I have a, if I have a military, then I can make, then I can push that further. If I have a system of spying, if I have a system of controlling, of turning off your bank account, if I have power, if I have material power, then I can go further in the extreme and the same even in terms of the anarchy. Anarchy is only possible in a very controlled system that has a lot of resources because In a normal system without a lot of power, it doesn't hold. It just. You die. You just die really fast. It's like, I want nothing to do with these people. I don't want to participate in their society. You know, I'm a rebel."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":2069.53,"end":2070.17,"speaker":"Guest","text":"Yeah, fair."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":2071.93,"end":2084,"speaker":"Jonathan Pageau","text":"Let's see how long you survive, my friend. You know, it's like, but we only do that. You can only do be that way in a world that is so completely padded with a kind of technocratic society that we don't, we don't see it like it's."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":2084,"end":2084.44,"speaker":"Guest","text":"Yeah."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":2084.52,"end":2087.88,"speaker":"Jonathan Pageau","text":"So all of these things end up being correlated, I see."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":2088.52,"end":2130.61,"speaker":"Guest","text":"I guess. Yeah. The final come towards wrapping up would be like, I'm curious about the relationship between, like, why don't we accept authority? Like, I think there's a kind of. I guess one of my intuitions was around the adolescent kind of rebellion idea. But also like, I think there's a connection between. The more I've learned about Christianity and kind of reflected on my own life, like humility or being brought low and submission. Yeah. I just, I wonder what you think about why we don't accept authority and how we might, how viewers or how we might look to come into a proper relationship to it."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":2130.77,"end":2185.57,"speaker":"Jonathan Pageau","text":"I mean, the best way is to understand. I think the best way for us to understand is that it's inevitable. Right. That authority is inevitable. That we actually, we follow authority all the time. You know, every time you stop at a stop sign, every time you drive on the right side of the road, you're obeying authority. We obey authority all the time. And so I think that at least becoming aware of that can help us understand the inevitability of this. Like, like I said, a lot of people who think that they're being rebels and, and they're deluded. They think they are, and they, they maybe act that way on some vectors, but they are not. Like it's, it's a little bit of an illusion, which is based on this padding that we talked about. So I think that that's probably a good idea is to just realize that it's inevitable and then also understand the negotiation part or understand that authority isn't always just top down. It's just very rarely so, especially in normal authority relationships."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":2185.57,"end":2190.84,"speaker":"Guest","text":"Because I need to follow your command for it to be authority."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":2190.84,"end":2289.11,"speaker":"Jonathan Pageau","text":"Right Then I need to follow it. But I also need to. How can I say this? It's like I need to get something from authority. There's absolutely. If I don't get something from authority, the only way you will be able to, let's say, enforce. Your authority will be through brute force, total brute force now. And brute force is exhausting. It's tiring. It takes your energy, it takes up energy. And so it's a simple. It's like, it's a kind of a simple system. And you can see it like. You can see it like it's in modern classrooms. Like, modern classrooms are great because the teacher doesn't have real authority. Like, doesn't have normal authority. And it's recognized that in a way, the children, the teacher isn't an authority figure. Right. And that's in the culture. So the kids, they'll flip between being screamed at by, like a hysterical person to doing whatever they want and not listening to what the teacher says. And it's like, because they don't understand authority, even the teacher doesn't understand authority. Because the teacher is part of this weird, weird world where they also think that some. They're teachers, but they think authority is bad. It's like, that's not gonna work. So they end up going between extremes. But normally what you would have is that the students know that if they obey authority, things are going to go better for them and for everybody else. And if it doesn't, then at some point it's also might. They might not continue to obey. It's going to break down. People will go somewhere else."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":2289.35,"end":2339.82,"speaker":"Guest","text":"Yeah. It's interesting thinking about my experience at school, because I agree, I think there were. There were on one extreme teachers who abdicated authority entirely, but also just tyrants who were, I don't know, tyrants. But like, teachers who would go around, say, like, you know, tuck your. Like, tuck your shirt in, do your tie up. Like, you know, keep that aesthetic proper. And, you know, that teacher was obviously perceived as a bit of a bad, like just annoyance or tyrant in our school. You know, always kind of known for that. But then I guess it relates to. I don't know, I think I want to say justice, like, whether the authority is justified. Like, do I understand? Why should I tuck my shirt in? And why. And I think that's kind of what you're pointing out there with this. With the way in which schools aren't kind of like, connected to a."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":2340.14,"end":2399.71,"speaker":"Jonathan Pageau","text":"So think of your best teachers. Like, think of your best teachers. Usually most people, like, maybe I'm wrong, but most people, if you ask them who their best teachers were, they usually identify something. Like a teacher who was very strict but very involved, a teacher that was quite strict, the way that they ran their classroom was actually quite demanding in terms of what they asked of the students, but were completely dedicated and would give you the time. Would take the time to help you understand. If you were wanting to understand. They would write comments in your papers. They would. They would, you know, like, they would. They would care. And so it's like, you're strict, but you care. So that's like. That's a really amazing thing, you know, and so it's like, we tend to not be able to realize that that exists. We tend to think if someone's strict, it's because they're tyrants and they don't care. And because. And if someone is. Is just lets things go, then it's because they care. But they're not strict. Like. No, actually those two things together are usually what make a pretty good teacher."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":2400.03,"end":2424.19,"speaker":"Guest","text":"Totally. Oh, thanks for that, Jonathan. I thought. Yeah, that particular note there is like, might be a nice place to end it, I think, as that's a really. Yeah. Like the. The merciful and the just the strict. The love and the discipline as well. Yeah. And I love the stuff about fittedness and relationship in authority because I've never necessarily made that connection before."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":2426.44,"end":2428.44,"speaker":"Jonathan Pageau","text":"I'm happy that it was. It was useful."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":2429.08,"end":2429.44,"speaker":"Guest","text":"Yeah."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":2429.44,"end":2431.24,"speaker":"Jonathan Pageau","text":"Good conversation. I enjoyed it for sure."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":2431.56,"end":2432.6,"speaker":"Guest","text":"Cool. Me too."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":2433.24,"end":2452.52,"speaker":"Announcer","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":2452.81,"end":2453.81,"speaker":"Jonathan Pageau","text":"I will put a link to that."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":2453.81,"end":2461.41,"speaker":"Announcer","text":"In the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":2461.41,"end":2463.29,"speaker":"Jonathan Pageau","text":"Also leave some of my comments as well."}
{"episode_id":"SW - #214 - 2022-01-18 - The Body of a City and How Authority Works","start":2463.45,"end":2495.23,"speaker":"Announcer","text":"You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon, the Pageau videos as well, and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
