{"episode_id":"SW - #156 - 2021-05-01 - Symbolism of the Beasts in The Book of Revelation","start":0.16,"end":2438.39,"speaker":"Jonathan Pageau","text":"With the crazy situation in the world moving apace, as we see systems of technological control and tracking take over in the name of COVID we're hearing strange whispers that there is a relationship between the vaccine and the Mark of the Beast. Sometimes this comes associated with all kinds of wild, crazy ideas and conspiracies, but sometimes we also find the source of this association in the stories from the mainstream media. This identification is very intuitive in many who espouse it, while of course, it appears completely delusional and a form of religious hysteria by others. So I'm hoping to explain the meaning of the Mark of the Beast as much as I can, so that we can understand and evaluate the recent claim that we're being faced with such a system, such a situation, on our horizon right now. So my attempts will be in a few parts. The first video will be an attempt to explain the emergence of these beasts in the story. And then the second will be looking at how and why this is related to a mark, a mark without which it is impossible to buy or sell. This is Jonathan Peugeot. Welcome to the symbolic world. These videos are a continuation of two videos I did on the symbolism of 666, the number of the beast, and how this number relates to us today. There was one on the number itself, and there was another video on a speech by Tim Cook, the CEO of Apple, which can help us understand how these ideas are relevant in the current situation. It would be helpful to watch those videos, though it's not completely necessary to understand this one. But to summarize, I explained how the desire to account for everything within a system, even the fluid margin, even the remainder of a process, is the best way to understand the problem of 666. It is in many ways an excess of perfection, an excess of pride in the possibility of a totalizing system. So we'll see how this pattern is already present in the description of the dragon and the two beasts which we find in Revelations 12:13. So, starting in chapter 12 of Revelation, the text describes three a dragon and two beasts. Then another sign appeared in heaven, an enormous red dragon with seven heads and ten horns, and. And seven crowns on its heads. Its tail swept a third of the stars out of the sky and flung them to the earth. So this dragon is at the outset, in heaven. It is associated with the great serpent, and so the leviathan. It's also associated with Satan the adversary, and it causes a war in heaven, a war in the order of the principalities. Then war broke out in heaven. Michael and his angels fought against the dragon and the dragon and his angels fought back, but he was not strong enough and they lost their place in heaven. The great dragon was hurled down. That ancient serpent called the devil or Satan, who leads the whole world astray. He was hurled to the earth and his angels with him. The dragon knocks one third of the stars from heaven to the earth with its tail. We need to understand that as a way of describing the fall itself. The stars falling to earth is another way of describing a worn heaven and the rebellious angels who fall to earth and to the sea. This is, of course, difficult for many people to understand, but the points of light seen in the heavens were images of gods or angels for ancient people. And this continues on in this passage. As the dragon uses its bottom, its tail, to knock things down. He himself ends up falling to the bottom, to the tail of. Of the world. So the tail here is very important in terms of an image. Humans do not have a tail. Tails are associated with animality, with lack of intelligence. The war of the Dragon is specifically a war on intelligence. We could say it's a war on authority and pattern. See, a tail is a strange flexible protrusion which is attached to. To the bottom, to the back. So this tale is related to the question of a remainder, to something which cannot be contained completely. A tail is the last thing. And as an image of the remainder, it is a tool of Satan, it is a tool of the adversary. Now, this is not just some moral admonition with me wagging my finger at you, but it's just a matter of fact. The mystery of things which are left over is the way principalities are attacked and made to fall. This is true still today. If we shine light on exceptions, on remainders, it questions the truth of any definition or identity. So by wagging a tail, by brandishing the fact of hermaphrodites, for example, well, I can challenge the truth of male, female and female. The process of breaking down patterns and challenging commonalities then repeats itself on earth, where the Satan is said to lead the whole world astray, to lead them to be lost, to be broken down, to not be able to find their purpose and their way. Therefore rejoice, you heavens and you who dwell in them. But woe to the earth and to the sea, because the devil has gone down to you. Falling to earth and to the sea is a disconnect from heaven, from what unites the principalities together, the intelligences together, they're united in their service of God, and their fall brings them into what we could call a Double existence of earth and sea, of constant conflict between lower embodied orders and menacing chaos. So a way to imagine this, this relationship between earth and sea, the best way is to imagine the tides which come up to the seashores and at the same time, those shores that are keeping the seas in their place. And this becomes an image of the cycle of order and chaos in which these principalities now engage. The reality of the fallen principality is. Can only be this way because, of course, they are wrong about the way reality works. The world cannot be disconnected from its higher principles and ultimately cannot be disconnected from the infinite good that is God. The ultimate fate of this type of rebellion is to be thrown into the abyss. But in the meantime, the fall is experienced as a vacillation between chaos and tyranny. A dragon stood on the shore of the sea, and I saw a beast coming out of the sea. It had 10 horns and seven heads with 10 crowns on its horns, and on each head a blasphemous name. There's a connection, of course, between the dragon and the beast. The beast is an extension of the dragon. You could see it as a manifestation of the dragon's power on the earth. And when I say it like that, I think it should be easy to understand. So this power does not come from above anymore, but rather comes from below, from the chaos of the sea. Because the Satan is a fallen principality, a principality which opposes and questions its connection to what is above it. And so it is related to chaos. So the beast comes out of the sea, but is then a beast of the earth, and as it affects, engages, and actually dominates the world of manifestation, becoming tyrannical. So it's also important to understand the beast that's coming from below, out of the sea to rule through a tyranny, because this contrasts with the later image, a proper order, a proper order which comes down from heaven to earth in the form of the. The heavenly Jerusalem. Both the dragon and the beast have seven heads and ten horns. The dragon has seven crowns on its heads, but the beast has ten crowns and its crowns are on its horns. So here, once again, it is pointing to how the beast and the dragon are aspects of the same thing. The dragon is recognized, it is crowned, it is rewarded on its heads or its principles, because the head, the arche, the chief, the principal, are biblical concepts which all come together, you know, in different places. In Scripture, these words are interchangeable. And so its heads are not one, but they are many. We could say that they are the many itself. So later, in Revelation, those heads will be more explicitly described as principalities because they're said to also be seven mountains, while at the same time being seven kings. So these overlapping descriptions are telling us that these heads are the places where authority and rule descend to lower possibilities unto a body in the case of a head, a land in the case of a mountain, and a people in the case of a king. We can understand the seven heads as a multitude of smaller rulers, of principalities, which should culminate into one under God, but they do not. In this way, they are multiplicity itself. And we can understand these heads as akin to creation itself. The seven days of creation, though considered as separate in their domain and in their way, separate from the Creator, separate from the one who unites creation together in himself as the head of everything. So if the dragon is recognized for its heads, the other, the beast, is recognized once again, crowned, rewarded on its horns. It is the extension of the dragon in the world. And not just the extension, but we could say something like a hardening, a condensation, and the way the dragon acts upon the world. For the horn is a weapon and a tool of domination. These extensions, protrusions can be understood in space, which a horn is already, you know, a protrusion into space, but later they will also be described as an extension in time, an extension into the future, as kings who have not yet received a kingdom, but will for one hour share authority with the beast. And here the 10, the 10 horns are like 10 in most places in scripture, a symbol of a completeness of totality. So we can understand this 10 in a way which is very close to 666, that is, as an expression of a totality of power in the horns of the dragon and the beast. The idea of a totality of power is not just there in the horns, you know, but it's actually borne out in the rest of the description that surrounds the beast. The beast I saw resembled a leopard, but he had feet like those of a bear and a mouth like that of a lion. This description refers to the prophecy of Daniel where he saw four beasts, A beast like a lion, one like a bear, another like a leopard, and a beast with ten horns and iron teeth. Now, this prophecy is in the Old Testament, so before Christ. And these beasts are almost always understood as describing four kingdoms that succeed each other over the Babylonians, the Persians, the Hellenistic empire of Alexander, and, and finally the Romans with their iron teeth. It would be too much here to look at the different animals and their characteristics, but nonetheless, we can easily see that the beast in Revelation, which comes out of the sea, because it is a combination of all the former beasts seen in the prophecy of Daniel, is something like earthly power itself, or the culmination of this power into an apex point, which is why it is described as universal, a world order having authority over every tribe, every people and every nation. One of the heads of the beast seemed to have had a fatal wound, but the fatal wound had been healed. The whole world was filled with wonder and followed the beast. Now, many modern commentators have mentioned that this passage might refer to the early tradition, according to which Nero, the degenerate emperor who first persecuted Christians, would, after his death, resurrect and would return like a vengeful angel. And of course, this was experienced, seen as something impending and immediate in the future of the communities in the first century. But that tradition of the resurrection of Nero is actually very interesting if we see it rather on the long term, as a pattern, which could be something like the possibility of an aspect of power returning, of extremes of power, a power which is both extremely tyrannical, persecuting the children of God, the disciples of the Logos, while also being obsessed with pleasure, with orgiastic excess and transgressive sexuality. So you can understand this as containing the image I brought up earlier of this extreme vacillation between chaos and tyranny. And of course, this will make more sense if we were to consider the pairing of the beast and the prostitute, which comes a bit later in the text. Maybe I'll do that in another video. So this question of Nero, of course, warrants my little parentheses, which is that many people see these stories as discussing things which happened long ago, describing ancient prophecies that have already come to pass, some of which happened in the first century itself. Others see them only as predicting some future event. So although those are in many ways opposites, to be honest, I have nothing to argue against either of them. I'd rather prefer to understand reality as a fractal pattern. And then the use of this highly compressed and symbolic language to speak about these things also means that these images are tapping into patterns of being. So the descriptions obviously are not arbitrary. The fact that we're talking about beasts, crowns, water, earth, horns, etc. All of these images are placed together in a way which is coherent and reveals to us how reality unfolds. If they were just descriptions of things that happened long ago, or things that will happen at some point in the future, then they would be almost useless to us. This or that beast refers only to Babylon or Persia or Rome. Then why not just have said it at the outset, especially now in the Book of Revelation. Babylon was a long time before that. So no, the highly codified language of prophecy is important because it is a language revealed and refined over centuries into becoming something like a cosmic map. Therefore, if we see the description as a cosmic pattern which shows itself, then understanding the structure of these types of descriptions can be beneficial to us in every time period, even if we acknowledge that they also refer to events that happened and or will happen in the future. This goes also for the beast with seven heads. When mentioning that detail, I could already hear the objections of people telling me that the seven heads, that the seven hills, means that the text is just referring to Rome. And the answer to that is, of course, it means Rome to a certain extent, but it can't only be Rome. Remember that the seven heads are also seven kings. But to the extent that Rome participates in this symbolism, one must ask ourselves what Rome is, why Rome is important, what it means, what its pattern manifests. Can one think that the fact that Rome was seen as being on seven hills is something completely arbitrary? Wouldn't it be more reasonable to posit that the reason why Rome was importantly understood to be on seven hills was because this was meaningful to mention a meaning which reaches beyond Rome? This meaning is possibly a part of why this 7 is emphasized in revelation over the multitude of other aspects about Rome which could have been mentioned. And it's probably this meaning which also leads to the reason why Constantinople, the Christian city, was finally also built on seven hills, just as Rome was. In this vein, beyond trying to identify the wounded head of the beast as this or that emperor, as this or that aspect of a historical kingdom, which in itself I have nothing against, like I said, but we can also understand the fatal wound of the beast and its healing within the story itself as a manifestation of the beast itself arising as a totalizing power. So, like I said, the seven heads are akin to the seven days of creation, the seven days of the week representing a complete cycle. The Sabbath, or the day of rest, is the remaining day after the work of God. And it's a day that's strangely connected to a little death in that sense. For example, the mystery of the Sabbath is revealed to us in the Christian tradition in which we say that the Sabbath was accomplished in the day Christ spent in the grave after being crucified, cinching the connection between this last day between rest and. And death. So one of the heads, we could say the seventh head was deathly wounded. It was incomplete, and it Manifested the remainder, the mortality, the imperfection, the limit of the beast. If one has read my brother's book, the Language of Creation, one might remember how he reveals the seventh measure of the circle or the cycle by its radius, to be incomplete and a remainder. And one should not underestimate the mystery Mathieu has pierced in this insight about the circle and the cycle. For it can also help us understand the different ways the heads of the beast are described. If one way of describing the heads of the beast is that one is wounded in another chapter, these same heads are described in time as five past kings, one present king, which is the sixth king, which we could call the measure or the measurer of the cycle, as it is the present one and the seventh, who it is said, will remain only a little while. That is an incomplete measure, a remainder, a coda, etc. So the wound of the beast's head was said to have been made by a sword from a supposed enemy. But because the beast now is given dominion over all people, there is no place from which to attack the beast, no possible enemy. The beast makes the wounded head complete in its very act of total dominion, for there is nothing left which can wound it. And this becomes a parody, an imitation of the resurrection, as well as the final pretension of systems of power and control to prevent death and chaos, to prevent death and disease, and by a universal claim to power, also eliminate the possibility of an outside by containing the remainder in the exception. And we see this in the next verse, people worshiped the dragon because he had given authority to the beast. And they also worshiped the beast and asked, who is like the beast? Who can wage war against it? In this case, the question is obviously a bigger deal than just a statement of strength. For who, in fact can wage war against the beast if it totalizes power over all people? Another fascinating aspect of the wounded head is that it says the head appeared as wounded, which possibly not, certainly, but possibly suggesting that the wounded head might in fact be just an appearance or a ploy, a deliberate, explicit show of illness, which in its healing, would make the beast appear stronger and more powerful than it actually is. This would be using the remainder, the deathly aspect of a system, as a trick to make the system even more powerful by showing how this imperfection can be defeated. This is, of course, the whole aesthetic of the false flag, the psyops, the infiltrated demonstration. The tricky serpent here is doing, in a way, the opposite of what it did in heaven, but now for itself in heaven, it used its tail to question and oppose the principalities. But here, by appearing to heal the wound, making the system complete, it is making its tyranny stronger. The beast was given a mouth to utter proud words and blasphemies, and to exercise its authority for 42 months. It opened its mouth to blaspheme God and to slander his name and his dwelling place and those who live in heaven. It was given power to wage war against God's holy people and to conquer them. And it was given authority over every tribe, people, language and nation. Now all of these elements, pride, blasphemy, slander against that which is in heaven, power over all people, and power to wage war against holy people are of course, all aspects of a central pattern in the totalizing system, A system to become independent from the transcendent and have authority on all people. First, it must attack the supremacy of that which is above it, in this case God or heaven. Secondly, it cannot stand those who preserve allegiance to that transcendent good, for to do so undermines the capacity for the system to be total. This might seem a bit abstract, but imagine when the United States declared its independence from its King. It not only had to go to war with the king, but it also had to eliminate and chase away Loyalists, because those Loyalists undermined the integrity and reality of the self declared, independent United States. We the people, though it purports to be universal, secretly means we who are not loyal to the King. And although pretending to be all the people, this self declared we the people. This is a problem. And Loyalists who used to manifest the reality of the King's rule now become bothersome, become strangers, enemies among us, and must be purged one way or the other. Of course, in the case of the United States, these Loyalists could flee to somewhere like Canada. But in a system which purports to be total ruling over all people, then there's nowhere to go legitimately. They must hide, let's say, in the wilderness. And we see that in the story of the Woman and the child, which I won't go into now, or else they must be purged. This is important to understand because it can help us to perceive how secular humanism can never stop at questioning the existence of God or relativizing religion. But it must, in the end, actively try to eliminate everything outside the secular and ultimately attack those who still believe. It also shows how tyranny is first and foremost, an excess in the realm of meaning. For the beast is given a mouth to utter proud words and blasphemies, and to exercise its Authority speaking, of course, is the first expression of meaning, as we see in the creation narrative in Scripture, where the world is created by God speaking it into being. But even at a lower level, speaking, unlike just thinking, is directed towards the world and engages the world by addressing it. And in doing so, especially if the speaking is from a place of authority, it orders reality by naming, by attributing categories, but especially by attributing hierarchies of importance. But when authority is illegitimate, two things will happen in the realm of meaning. The two things described boasting, which we could call something like self, naming, giving attributes to oneself in the view of others. And we will also see waging war against God's people because he did not receive his crown, his name and identity from above. A self declared king must boast, must slander and accuse the king or the religious authority from whom he should have received his authority. And this is of course the nature of blasphemies that we're talking about here in the text. The beast must attribute to itself the names of God. The qualities of God must ultimately declare itself, try to name itself with the name of God. But you see, every time we see our own wills as supreme. This is something which we do ourselves. It is the taking of the fruit of the tree, a fruit that is supposed to make us like God, but it's taking it for ourselves rather than waiting until God gives it to us from above through his grace. And so here this process described in Revelation appears as the cosmic apex of the fall. It is as if the fall of man and its consequences has borne its final fruits and has filled the earth. It's as much the giving in to the serpent in the garden. And it is a cosmic finality of the Tower of Babel and its pretension to both reach the heavens, but also to rule over all people. All inhabitants of the earth will worship the beast, all those whose names have not been written in the Lamb's book of life, the lamb who was slain from the creation of the world. Now this is the image of the solution to the seven headed beast. So we're presented with another beast, a lamb. But this beast does not boast, does not have to impose tyrannical order, but is sacrificed from the creation of the world. It is given up, and that is how it receives its authority. And this, my friends, this is the secret of reality, which is that reality is based on sacrifice. The highest aspect of something is not its rule over its parts, its capacity to hold its parts together, it's not its power not its boasting, but it's its giving itself to that which is above it, that from which it holds its authority and identity, while also giving itself for what is below it. So, for example, in a burnt offering, there is a part of the sacrifice, the spiritual part, which is represented by smoke, which goes up and is an act of worship and submission to that which is above you. And there is a part of the sacrifice which comes down the cooked meat and is eaten by those for whom it is offered. We see this, of course, in Christ himself, who offered up his Spirit to God on the cross while laying down his life for his flock and giving them his body to eat. Once again, it is worth looking at my brother Matir's book for more on this pattern, as his explanation of the pattern of sacrifice is, is the most pristine I have ever encountered. The way reality holds together is ultimately not through total systems of control, but through love. And here, by the way, people who only accept the substitutionary virgin of the Cross and of sacrifice will also have to deal with this verse about the Lamb, because it is said that the Lamb is slain from the creation of the world. And one of the important aspects of this Lamb, as it's described earlier in the text, is that it has seven horns and seven eyes. And these horns are seen as the seven spirits of God. And so it's very interesting here, compared to the seven heads of the dragon, the seven heads of the beast, here the Lamb has one head and it has seven horns. It has seven extensions. And these horns are also these seven horns that will be blown by the angels. And so it is this extension of the will of God into the world, rather than seeing these, the seven principalities or the seven heads. And so here it is the proper relationship of multiplicity to unity, because, as I said, the Lamb has one head, but then is able to see multiplicity and is able to extend its unity into the multiplicity, both in the image of the horns, but also, like I said, in the image of these trumpets which are blown out into the world, that call and that judge, that, let's say, declare what's going to happen in reality. There wouldn't be much to say about that. But at least for now, what suffices for us is how the Book of Life is related to the system of the beast. If the worshippers of the beast are his, through being branded by his external mark. Something we will explore in the next video about the mark of the beast. The servants of the Logos are also accounted for at a higher level in a Higher identity and story by having their name contained within the the Book of Life. You see, this could also have been expressed in the same way that it was for the Beast. In fact, there's another place in Revelation where we get this notion that one receives the seal of God on one's forehead. Similarly, as one receives the mark of the beast. There is a difference, but we won't go into that here. We'll talk about that in the next video. But these two ways of accounting for identity are actually perfect to get a full picture of how identity and hierarchy work. One picture from above, that is how our names are contained in the Book of Life, which is held by the Logos. We are held together in that higher identity, but it can also be seen from below as receiving a name, a seal which joins us together and makes us share something, something in common amid all our differences and particularities. So you can imagine receiving different marks or seals from above, or reversely being contained into different bodies or books. In this way, one is accepting different levels of identity to cover and contain you. You could have a mark. At a political level, an identity is part of a family or a group, a parish, a football team. For example, I bear the name of my ancestors, Pajo, while I am also marked by being Quebecois, by being Canadian. And at the highest level, I am under the name of God by being in his image and participating in his body. These multiple levels of naming and containing containing names can normally coexist, since identities at different levels of reality fit into each other when the world is laid out properly. So you won't be surprised that I'm going to use the example of a chair, as I often do. But it works. So the leg of a chair can be a leg, while also participating, receiving the name of chair from above, as it were, to the extent that it participates in that higher identity by being the leg of a chair and a part of the body of the chair. And of course, the leg itself is also made of parts, the parts that have names. And reversely, the chair can be contained in a higher identity, like a dining set, for example, which contains it from above. In this normal way, different smaller identities don't compete with higher identities. But because the system of the beast is trying to be total, it is a idolatrous in its structure. It must not only mark those who belong to it, give them its name, and better still, its number, but also it has to attack those who are marked or contained at a higher level of life, and possibly at any other level, it must attack those who belong to God once again, and they must be eliminated or made to bow down and worship the beast as the total system. Totalitarian systems see themselves in competition with all other identities. They are similar to material reductionists who see only one type of identity and one type of causality possible in the world. Totalitarian systems must break down families, clubs, religious organizations, and dare I say, they must reduce people as much as possible to a number in order to create fractured individuals that they become pure quantity who only have this totalitarian system as their master and identity. Anna Harrant, who wrote about totalitarian systems, famously said, terror can rule absolutely only over men who are isolated against each other. This, of course, is a false understanding of how reality works and is inevitably vowed to destruction. Then I saw a second beast coming out of the earth. It had two horns like a lamb, but it spoke like a dragon. It exercised all the authority of the first beast on its behalf and made the earth and its inhabitants worship the first beast, whose fatal wound had been healed. And it performed great signs, even causing fire to come down from heaven to the earth and in full view of the people. All of this is why the second beast makes an image of the first and has the power to make it speak. Of course, this order of manifestation could also be seen from the side of light. It's just an order of manifestation. And there are many examples. For example, in the revelation on Sinai, we see at first the invisible word of God, which descends and then moves into the law which is given by God to Moses, and then Moses descending the mountain as the prophet who presents and gives through his authority the law that God has given him. And in the story of Moses, it's very interesting because there's also the making of an image. But this image that they make is a reflection of the passions of the people, and their will is portrayed as being at the bottom of the mountain, rather than being coming from above, just like the law was coming from above. And so the beast, of course, comes out of the sea. And in this way, this image of a beast of the golden calf is already an inkling of the image of the beast in Revelation, because of the signs, it was given power to perform on behalf of the first beast. It deceived the inhabitants of the earth. It ordered them to set up an image in honor of the beast. The second beast was given power to give breath to the image of the first beast, so that the image could speak and cause all who refused to worship the image to be killed. There are a lot of things happening in this sentence, of course, because the rule of the beast is a totalizing system. Because it wants to contain reality within it, because it wants to take for itself the qualities and names of God, then it must create something akin to life. Because it made war against the source of heavenly intelligences, it must create an artificial intelligence in order to make people worship the beast and the dragon as they once worshiped the God against whom the dragon made war, the God who created man by putting his breath into him. Of course this is a deception, as it is mentioned, but it doesn't matter. One of the things I've insisted on in several of my recent videos is that it doesn't matter if general artificial intelligence is possible or if it's actually realized. It only has to be believed in, you know, to believe to be as such for people to worship it. Its intelligence, its breath, comes from the beast, the puppeteer we could call it. And its representative, the second beast, speaks like a dragon, but presents the horns of a lamb. And interestingly enough, this might be the mystery of the Antichrist. Though that's probably good to talk about that at another time. The thing with Revelation is that as soon as you go into there are many things that even now that I've skipped over because every sentence opens up into an infinite, not an infinite, every sentence opens up and every word has to be kind of talked about. And so it's difficult to talk about everything. Hopefully I've this been at least been a good intro to these descriptions of the different beasts in Revelation. Of course, as you can see, I focused on patterns of being rather than getting excited about current events. But I do think that these stories are nonetheless important to understand current events. And we'll look at that a little more in my next video in which we'll be looking at the mark of the beast itself."}
{"episode_id":"SW - #156 - 2021-05-01 - Symbolism of the Beasts in The Book of Revelation","start":2439.67,"end":2504.67,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel two, Jonathan Padreau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to to get the podcast out there, to get it heard and if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pajo videos as well and on SubscribeStar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
