{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":0.64,"end":104.44,"speaker":"Jonathan Pageau","text":"I think a lot of people that struggle with the beauty aspect of the churches are people that look at, let's say, the story of Christ and look at his crucifixion. They look at the poverty of the images in the Gospel. They're like, why then do you have these golden temples? And why do you have all this powerful imagery? And the truth is that orthodox Christianity tends towards fullness, tends to like a yes and right. We don't have a no, but it's like yes and. And one of the images that's important in scripture is the eschatological image. Although Christ, even in his life, the way that he lived very simply and walked, you know, with sandals on the, on the ground, he also presented this vision of the coming of the Son of Man as this glorious finality where all things will come together. This is Jonathan Pedro. Welcome to the symbolic world. So hello everyone. It is my great joy to be here with David Patrick Henry and Father Turbo. This is something that has been preparing itself for quite a while. I've been looking forward to meeting Father Turbo. We've had a lot of conversations, you know, in messaging and email and stuff. So is great to finally meet him in person. And, and so David Patrick from the channel of the Church of the Eternal Logos, you can check that out, is going to lead the conversation. We're going to talk about beauty, about icons. And so. Yeah, take it away, David."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":104.84,"end":199.64,"speaker":"David Patrick Henry","text":"Yeah, I was really excited. Thanks again, Jonathan, for having us on. When we talked a little bit about the beauty of Logos theology, we mentioned that you had been wanting to stream and have a conversation with Father Turbo. And I have the great fortune of him being both a spiritual father to me and also a friend. And we wanted to talk a little bit about aesthetics, orthodox beauty, iconography and all these things. And I thought it was perfect for you guys to come together because both of you have done iconography and both of you, you again, Jonathan, with your work with the symbolic world, has touched on these topics ad nauseam, I guess you could say. But to begin, just for Father Turbo, I thought he could kind of set the foundation of how is beauty and aesthetics understood utilize in the Orthodox Church when Protestants engage, some of the times they would make claims that we're over ornate, that we worship pieces of wood, that we, you know, we, we worship idols and all this different stuff. But they don't understand why aesthetics and beauty is important to our liturgical worship, to the church, to our theology and how we engage and participate with God and I. So I thought to open it up and we can go anywhere is Father Turbo could lay out exactly how aesthetics work. And in the Greek word symbolos, the sim balo throwing together two realities. That a symbol from an orthodox worldview is so much more than just a sort of an empty, meaningless thing, as you've talked about, Jonathan, but it's, it's the brain together of two realities. And so, Father, if you could then lead us into how aesthetics are understood from an Orthodox frontima."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":199.88,"end":491.76,"speaker":"Fr Turbo","text":"Well, I think the first thing to understand is that it's about leading us into reality, which is God. And the incarnational aspect of it is absolutely imperative. But I think sometimes we stop short because we'll look at an icon of, let's say, you know, this is very common. You give a tour in a temple and, you know, every priest has done this, every, you know, lay leader has done this, and you kind of break down the icon of staff. If you're blessed to have a, a dome with a pantograto icon in the dome, you're blessed to be able to, you know, have those. You know, every church has those, unfortunately, on, on a kind of like, majestic scale. But you say like, oh, you know, Christ, the incarnation, and this is all very good, you know, but I think it isn't just about the incarnation, meaning the Logos becoming flesh, but it's also about us being brought into the life of God. And that incarnational aspect, you know, think of it going both ways, I think, is key, because worship is about this bringing in of the finite, the created, the broken, into, you know, infinity, eternity, into the, you know, never actually reaching, but being able to be drawn and approach the uncreated, being broken and being brought to healing. Those are all things that, you know, aesthetics, the aesthetics of the church facilitates. It brings us to a place of not just the abstract of theology, but the, the real tangible, which is what we need to be healed, to experience love. And symbol does all of that in a shorthand. You know, I, I try to instruct people when they think about symbol in the life of the church, you know, it's, it is imbued with something higher than itself. And so when we encounter a cross, we can look at a cross and, you know, a whole unfolding of understanding happens, you know, in a millisecond. So it's a shorthand, but it brings us into increasingly deeper levels of meaning and experience and that. And it's really a bringing in. And I think that's really key because when we view the icon or when we view architecture in the church, when we Also, you know, it isn't just visually when we experience chant. You know, there's something that happens to you when you're in a service and then you hear the E song. You know, the song is the kind of like low droning note for those who don't know what that is. Enchant. And then just all of these, you know, this. This wave of melody that's melismatic, and it's just. It's undulating and it's just. It's living and. And it brings you into this heavenly space. That's all a part of it, and it's all a part of being brought to, being drawn, you know, invited into. Into God. And so that's. That's its purpose. And it. And it's done in such a way to communicate the ineffable to us, that which is, you know, beyond our normal way of being able to articulate, understand. And that's what I mean by layers of. Of meaning and really love and experience. This is what symbol does. It's this, you know, however you want to call it bridge. You know, comic book fans will call it a boom to them, and however you want to look at it, it just brings you to this place. And that's. That's what it's always been. And especially for us now in this modern time, it's. It's even more so a rich experience because we are inundated with a plethora of images. We're inundated with a plethora of sounds. And there's something so clean, it's cleansing, it's cathartic. It's. It's. It brings us to this. This place that I think, although we suffer in many ways from lots of things that, you know, the ancient people didn't have, and the ancient people where this esthetic was, was formed through, we have a unique blessing in the sense that we can in some ways appreciate it on a different level, because we're coming from a place of. Of absence. We're coming from a place of being, you know, like I said, inundated. And it helps us to see this one thing, which is beauty is the revelation of Christ. And I think that's, you know, the kind of period I would put on it. It's. It is the revelation of Christ and everything from, you know, harmony, symmetry, you know, and even, you know, areas where there isn't symmetry, even those reveal Christ. So that's how I would explain it, you know."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":491.76,"end":534.11,"speaker":"David Patrick Henry","text":"Well, and I love that you talked about the symbol. Is it bringing it into ourselves because it connected with a stream that we did on the devil's iconography, which is a famous quote of Father Cyril from Rose, talking about pornography. But then through these black mirrors, our phones, that we're seeing that, especially those who aren't of careful discernment spiritually, that they're. They're bringing in demonic iconography within themselves. And it's. It's impure, as you talked about, a sort of purifying effect of true beauty. I think we're also seeing an attack on esthetics within our society at multiple levels. And this is affecting the interior reality, the spiritual reality of people themselves. I know this is something that Jonathan has spoke about a little bit, Father Turbo."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":534.11,"end":788.02,"speaker":"Jonathan Pageau","text":"I think he really brought it all together, maybe a thing in terms of helping, especially Christians that don't understand why it looks the way it does or why it is the way it is in our church. I think a lot of people that struggle with the beauty aspect of the churches are people that look at, let's say, the story of Christ and look at his crucifixion. They look at the poverty of the images in the Gospel and how Christ lived a simple life, you know, with fishermen. And so they're like, why then do you have these golden temples? And why do you have all this powerful imagery? And the truth is that orthodox Christianity is. Tends towards fullness, tends to like a yes and right. We don't have a no, but it's like, yes, and. And one of the images that's important in scripture is the eschatological image. That is the way that although Christ, even in his life, the way that he lived very simply and walked, you know, with sandals on the. On the ground, he also presented this vision of the coming of the Son of Man as this glorious finality where all things will come together and the glory of the throne will be. Will be shown. And, you know, and the authority and the glory of God will fill the world. Right? You see that already in the prophetic text, even before the coming of Christ. Right. That the glory of God will fill the entire earth. And that is what we are participating in in our church service. We are participating in eschatological reality, which is piercing in, you know, piercing in from the future, piercing in from the final revelation and giving us a glimpse of. Of how we can participate in that glory. And so many people, they're like, why are you doing this Old Testament stuff? Like, you know, why are you. Why are you still doing, like, the Old Testament? Now that Jesus come? That's changed. But the image of the church is not based on the Old Testament as much as based on the Book of Revelation. And that's true even from the early churches. If you go to Rome and you see the very early churches that were built in the 4th century, they have eschatological motif, you know, they're representing the 24 elders and you see Christ on the throne. And there's a sense in which that's what the liturgy has always been calling us to participate in. And so in some ways it's the proper ordering of reality. When you read the heavenly Jerusalem, you have this beautiful vision of how civilization, how all the activities of humans, you know, architecture, music, the relationship of the natural and the artificial, all of this is properly ordered in glory to God. And that is what we're participating in when we go to church. And I think that that's really important to understand because the thing, even in terms of the idea of beauty and of ornament and of proper ordering and all this stuff, these are all things that exist also. You have to understand. It's like one of the things that happens is that, you know, if you look at the early modern period, for example, when people started criticizing the Christian church and the excesses of the Christian church, all of a sudden all that ornament and all that excess got put into state built things, right? And so that, that desire to celebrate and to kind of lift up and to make beauty and to make even like, even to, to a certain excess is something that's part of our, of our nature. And if we don't dedicate it to God, we're going to end up dedicating it to something else. And you're going to start, you're going to start with this is how bad it is. Like you're going to start with making government buildings ornate and huge and beautiful and you're going to end with some pop star looking like decked out, like queen with gold and, and jewels and everything, right? That's how you end. And so you start, you start with, you want to remove that glory given to God and you end up with like an image of a kind of. That is completely know, decked out and makeup put excessively ornamented, right? And so we have to be able to direct our desire for, for that kind of exuberant beauty in the right, in the right place."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":788.26,"end":889.53,"speaker":"David Patrick Henry","text":"Yeah, I think you make a great point in regards you, you don't get away from the ornimation in society one way or another, but it's actually of A selflessness when we give it back to the church, when we give it back to God, and we give the. As as much as we can do in a temporal setting. The beauty, the transcendent beauty. And I wrote down timeless objectivity because as you pointed to the sort of eschatological dimension, the piercing of beauty inside of a parish or personal relationships, wherever people encounter it insinuates the objectivity of beauty, the objectivity of morality and the objectivity of the truth, which is a who, not a what. It's Jesus Christ. He is truth incarnate. And so the automation isn't something that is paganistic or idolatry. It's actually something that we want to give the best back to God and we want to live in sort of that transcendent beauty, that beautiful reality. And you look at Protestant societies and as you said, they don't have saints. So then Beyonce, Johnny Depp, the Hollywood celebrities, the stars elevate themselves as now the, the role models, the leaders for those in those societies to look towards, to orient themselves in society. And like you said, the ornamentation now is due to, you know, these, these modernist, asymmetrical art museums or these new understandings of, of beauty. This is a displacement of the lack of true aesthetics within, I would say, Protestant worship. Not that there aren't great people, of course there are. But you look at the, the. The mundaneness of many of the. Inside of their churches. I think that, that, that, that instinct in that pursuit for beauty then gets transposed to the world and not back to God, which is the ultimate offering."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":889.53,"end":1002.61,"speaker":"Fr Turbo","text":"And I think that's really key because the instinct is in everyone. And that's part of the problem. It has its points depending on, you know, what we're talking about, especially like in a polemical sense in regards to something being pagan or Christian. But I think especially in this sense, it's important to realize that, you know, why did. Why do pagans, you know, what quote, unquote, pagans, right? People, you know, citizens, you know, why. Why would they have beauty? Because it's, it's innate in us, because God created us. And the awareness, this is one of the things in regards of having a disposition very much like what John was saying about, you know. Yes, you know, and both. And in the sense that, you know, recognizing God as creator and, you know, God is. And being able to see God and the other person, but also in their expressions and even if they are devoid of, you know, truth and to a greater degree, you know, obviously the truth and Awareness of who Christ is. You can still see the imprint of God in that. And I think that's really important because this idea that when, you know, it's funny, Jonathan said that because I had this. I got transported back in time. I had a friend. I remember during my time of conversion. I think we were just made catechumens at the time. And I had a good, good friend, and I invited her to a service, and there was already contention. It's like, what is this? You know, I heard you're becoming orthodox. Like, what does all this mean? And I remember just her, you know, kind of being in shock and awe. And I remember especially, you know, the great entrance happens. And then she, like, got up and left. You know, she just."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":1002.77,"end":1003.13,"speaker":"David Patrick Henry","text":"She."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":1003.13,"end":1242.06,"speaker":"Fr Turbo","text":"She got up and left in the middle of service. I was like, wow, that's. That's. I don't know what happened, you know, So I didn't, you know, what's wrong? You know, and after the entrance, I, you know, wanted to go talk with her, and she said, you know, Christ wouldn't. Christ wouldn't do all this. And I remember her saying that to me. And I remember feeling so sad, not just because my friend got up and walked out of the service, but. But because this reality that Christ is ruling and reigning now, that. That's what made me sad, because I knew she loved God, you know, as in. As best as she could is what she understood. And that. That is a very powerful thing to be able to recognize the potential for people to experience the God that already is. You know, kind of imbued them with the desire and the ability to pursue truth and beauty. And I think this goes all the way, even back to what we're talking about with like, well, why are you doing all this Old Testament stuff? Well, even that had the eschatological reach, even that was the echo from heaven, even there. And I think this is really key because when people set up this kind of dialectic of like, well, you do it this way, do it that way. It's. They lose this reality that this is about revelation. That although, yes, you know, certain aesthetic from a period of time, you know, that we call, quote, unquote, Byzantine, right. But the reality is, is that those are just the means by which God is revealing himself to us. And one of the things that the Church does through her aesthetic is trains her. Trains her people, you know, trains the people of God to have an increasingly astute, accurate, pure, but expansive view, because we will never be able to contain, you know, we'll forever be approaching the fullness of God. And so if we find our vision becoming, you know, more and more limited and circumscribed, we have to be careful that it isn't really about becoming more accurate. But maybe we are losing. We're going in the wrong way, if that makes sense. You know, because one of the things that you learn when you enter into orthodox worship, if you're not orthodox, is it's incredibly familiar and incredibly foreign at the same time. How is that possible? And that paradox, that tension, that's a very spiritual thing, being able to keep that tension. And I think that's one of the things about our being quote, unquote, orthodox in this modern time, is that we can see. It's like another example. I remember taking one of my kids to the bank for whatever reason. Greatest, Greatest, you know, kind of anecdotal story. But, you know, my. My daughter, she's like. I think she was like, 11th dime. She's like, this looks like a church, right? Like, the way. The way it was decorated, you know, it had this. You know, it had a very Art deco feel to it, but Art deco has this kind of very Byzantine aesthetic baked into it, right? And so she could just discern that naturally, you know. And I said, well, yeah, I told her. Well, I told her this is a temple, but it's a temple to mammon, you know. And so he kind of had a little Bible story there while we're waiting for the teller. But my point with these stories is that it's. It's already in people. And I think for a lot of people outside of the tradition, you know, a lot of it's this. This dialectic, like, well, you guys just kind of invented this, and you just take this. Took this from the pagans, and it's like, okay, even. Even that. Even that. Even if that is the case, what you, I think are missing, my friend, is that God, who created all things, this is. This is the revelation of how he's getting back to I sing earlier. Drawing us closer, you know?"}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":1242.3,"end":1242.74,"speaker":"David Patrick Henry","text":"Yeah."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":1242.74,"end":1243.02,"speaker":"Fr Turbo","text":"And."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":1243.02,"end":1318.39,"speaker":"Jonathan Pageau","text":"But it's important to. To understand, like you. You said about this woman who said Christ wouldn't do this, you know, And. And when you talk about the paradox in the Orthodox tradition, we do have that paradox very strongly represented, which is we both have the ascetic living in a cave, you know, eating like, carrots every day or whatever for the. For his entire life. And we also have, you know, Constantinople and Hagia Sophia and the absolute glory of this eschatological vision and the truth is that those two not only can coexist, but in some ways they reinforce each other, right? It's like we, if we only had the great celebration and the kind of royal aspect of the tradition, we would, we could, you could say that we would have something missing, but that's not how it is. We have. And you see it sometimes, like, you know, you, you see it. We pay attention to this. If people who are careful, you'll see some priests, like, come to the parish, you know, and you can see like, his ratty. His ratty thing. And, and it's like. And he's got his hat and it's all fraying."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":1318.39,"end":1321.15,"speaker":"Fr Turbo","text":"And it's like one of them is."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":1321.15,"end":1466.57,"speaker":"Jonathan Pageau","text":"Like, is like, you know, it's like, you can see. And he's got, he's got his prayer rope that it's like, it's kind of slick from the oil of his fingers or whatever, right? And it's like you, you know, you see the, the, the, the, the priest come in and then, and then he puts on, right, the vestment, and then he enters into the worship and participates in this glorious thing. But it's like that's the contrast. And it's a very important contrast to have. It's as strong as the contrast between the cross and the throne of Christ, which are both true and both manifest the fullness of what Christ brought to us. And so it's important to understand that even in terms of what you said in terms of the city, for example, like this idea of bringing in the pagan elements into the, you know, the image that we see in Revelation is the image of the city being converted, right? It's like the holy city now becoming a vehicle. And it says in scripture, in Revelation, it talks about the heavenly Jerusalem. It says the kings of all nations brought their glory into the heavenly Jerusalem, right? And so the glory of all the nations is brought into the heavenly Jerusalem. And so it means that it's not. It doesn't oppose that which is good in all the cultures in all. In all the world. It's rather that the best of Rome, the best of different cultures, can be brought in as an offering to become a vehicle for a participation in the heavenly liturgy. So you both have this image that the, the image of the liturgy is a representation of the description in revelation of the angels that are surrounding the throne and are sensing and doing all these things that we do in church, but then also of the heavenly Jerusalem, that which is happening on earth as this image of. Because a lot of the forms that we have in church. It's true, they're Roman, right? They come from Rome. A lot of the architecture, a lot of the. Even some of the vestments, there are certain things that have brought in from Rome. But that is the image in the book of Revelation, right? There's both. There's two realms, you could say in Revelation. There's the. Which is the evil aspect of the city, the evil aspect of. Of civilization, that beast and that whore together. But then there's also this other image of all of human activities bringing up their glory in service of God."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":1467.13,"end":1585.48,"speaker":"Fr Turbo","text":"I just want to say I think it's important too, to kind of like dive, you know, kind of drop down a couple thousand feet. And even just looking at the fact that the quote, unquote, again, Byzantine, right, Roman. The aesthetic, even that is a synthesis, you know, when we, when we experience it, it isn't just this kind of pure aesthetic just that popped out of anywhere. It doesn't have, you know, influences from different nations. I mean, what Jonathan just brought up about the escological aspect, I mean, works. I think, when I'm. What I'm failing and trying to get across too, is that. That you ex. We're experienc at. Now to a veiled degree or whatever you. However you would put it. Because even in regards of the aesthetic of the church, there are these somatic influences, Asian influences, Persian influences. And you know, this is one. This is one of the things that when you see that already, you're already seeing it. If you see what I did right there, like you're getting. You're already seeing it happen. And I think this is really key because one of the big problems when we veered too far one way with something is that we, We. We miss some of the details that are very important. Like, for instance, one of the things that I, you know, I don't do them as much, but I used to do lectures on iconography, like a lot. And one of the things that I would do that would just, you know, kind of scandalize people. I would talk to them about Fayum portraits playing portraiture. And I mean it without fail, especially at that time. This isn't like the, like mid, like 2005, 2006, 2007. And I would, you know, do these slideshows and I'd show them and I talk, well, you know, the. About the origins of the quote, unquote, Byzantine style, you know, quote unquote. And you know, some people would start getting kind of uncomfortable. You could see it in their eyes because they have this idea that it."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":1585.48,"end":1588.98,"speaker":"Jonathan Pageau","text":"Just kind of like drops out of nowhere. Yeah."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":1588.98,"end":1713.75,"speaker":"Fr Turbo","text":"You know what I mean? And it doesn't. And is this which God always does? Right. God takes the synthesis of. Of human. Failed. Yes. And fallen. Yes. But. But human effort, human experience. And he wields it together. He baptizes it, he purifies it, he illumines it, he imbues it with his love, with his presence. That's what the love of God is. It's his presence. If God shines His presence on you, it's because he loves you. How you, how you respond to that, that's a different thing. But it's. It's always out of his love. And we see that revelation is a very unitive. One of the effects of the revelation of God is it's unitive. It brings. It brings synthesis, it brings things together because that is the repentance, that's the undoing of the fall. That, this. That disunification on a lot of levels, it's taking seemingly disparate parts and bringing them into harmony. And I think that's one of the things that maybe should be emphasized a little bit more, because as the world, you know, and I mean it like the world, like passions, you know, in the flesh and the fallen world and all that, and, and the fallen powers are. Are continually seeking to imitate to an even greater and greater degree the life of the church and, and the. The glory of God for the sake of deception and all these things. It's important that we discern that, you know, ultimately, you know, the love of God is. Is what could never be triumphed over. And that love, it conquers, you know, love covers a multitude of sins. But in this sense, the, the problematic multiplicity which Jonathan has talked about at, you know, at death and ad nauseam, but that problematic multiplicity of culture and aesthetic and all those things, it. It really does get reconciled in the church. I mean, St. John the Baptist, the Holy Mother of God, always on the iconostats. I mean, male, female, the ascetic, the heavenly queen, like right there. It's always there for us to see."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":1714.23,"end":1809.48,"speaker":"Jonathan Pageau","text":"So Andrew Gould, the architect, has pointed out to what extent Hagia Sophia is Persian like that, that even in, like the 6th century, they have a Roman building. It's still a Roman building. Clearly, it. And. But that a lot of the ornamentation was brought in from Persia and there seems to have been this. This desire, like you said, to. To bring in things and to join them in synthesis. It's like. It's the opposite of mixture. It's the opposite of confusion. Right. Confusion is when disparate things don't play together towards a common goal. That's when you have confusion. So you have a bunch of different things and they're doing their own thing and they're not coming together towards, towards purpose. Whereas synthesis is when you do have several things, but they're all, let's say, kind of dancing together. And you can feel that they're joining towards a common, a common purpose. And so Christians are not against or for diversity and, and against, against the idea of different things. It's rather, how is it that they come together in love, in participation in the life of Christ? That's all really that matters, you know, and, and the liturgy ultimately plays that, that, that great role. Like you said, like, if you look at the iconostasis and even the way in which we, we are, like, we are the people, you know, saying the amen. There's the choir, there's the, there's the, there are the priests and the clergy and there's all these elements and they're all, they're all in a great dance, you know, they're all coming together in the worship of God."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":1810.12,"end":1934.89,"speaker":"David Patrick Henry","text":"Well, and I wanted to pick up on a comment that you said a few ago in regards to the tension between beauty and asceticism. Jonathan and I think that we look at the contemporary culture and I totally agree with you. That's what the church does. It holds the both and together. And I, when you're talking, what popped in my mind is that the growth in hedonism and pleasure seeking actually erodes the beautiful tension and distinction between beauty and asceticism. And as we become more hedonistic, one, we can look at the informalness of our society. I mean, it's stark contrast to look at the beginning of the 20th century on how the average person dressed verse in the beginning of the 21st century. And again, the, the informalness of the way we dress, the informalness of the way we talk to each other. But maintaining boundaries, something that I kind of reap on a lot and harp on a lot on my channel, is that this is the point of the Logos, is that it maintains the order, it maintains the boundaries between things. And that I would argue, moving forward, at least what we're seeing in culture, is this continual dissolution of boundaries and distinctions between things. And so as formalism breaks down, as boundaries break down, you're talking about how discipline is tied to the coming of a forward purpose. Well, we're living in a culture where discipline is under the. Under attack, essentially, meritocracy is under attack. That we have new understandings of the way that we. We move through our societies, and that beauty and asceticism are necessary because if you just have beauty, you're going to end up in hedonism, you're going to end up in an overindulgence, which we could look at the Roman Empire, we can look at the American Empire, we can look at our own context and culture. And so I think, again, the Church, what it does is it holds these things in the proper context and that beauty is true and beauty is morally right, and morality is true and beautiful, and that all the good true and the beautiful, they play on each. Each other. And I think pleasure in the pr, in the lack of the crucifying of our own will is actually leading to the eroding of all these things in our society to one degree or another."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":1935.21,"end":1993.98,"speaker":"Jonathan Pageau","text":"And you. You'll see. It's interesting because, you know, that image that I proposed at the. At. At some point when I talked about the priest that comes in, you know, kind of, you know, a little ratty and a little kind of disheveled or whatever, and then. And then moves into the glory, there's a sense in which the contemporary culture is the very opposite of that, right? It's like, in some ways, the church asks you to come to church broken, right? It's like, come broken, my friend. Like, you know, come in confession, come in, come contrite, come not. Not like this. You know, it's like, come broken. And if you come broken, then you get this glory. You get to participate in this beauty and this glory. And the contemporary world says, go out and, like, enjoy, right? To do, you know, do it all, like, enjoy and participate in excess. And the result is that you are accidentally broken, right? You're not broken in the Christian sense of recognizing your lowliness and entering into that, but you're made low and then you suffer for it, right?"}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":1993.98,"end":1994.38,"speaker":"Fr Turbo","text":"You're."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":1994.46,"end":2000.94,"speaker":"Jonathan Pageau","text":"You're broken and your relationships are broken and everything gets broken. So it's like a weird inversion and a caricature of each other."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":2001.1,"end":2127.14,"speaker":"Fr Turbo","text":"Like, if I could. If I could just throw something out there, though. I mean, I think that. So with hedonism, there's something that happens in the sense that, you know, hedonism and it pulls. It not only pulls someone out of the potential for that experience, right, but it perverts intentionally in. In many ways, I would. I would submit because, like, for instance, the inability to see the beauty in the Ascetic then the inability to see the beauty that is in. And the poor, right. The inability to see the beauty that is in those things that are not pleasurable. Right. And I think that's the thing is our society conflates beauty with, you know, something that is dazzling or pretty or right. It's not. When the church speaks of beauty, and I think this is one of the things the church speaks of beauty, people can mistake it for simply just, you know, that which is grand and you know, that which elegant is a, is a good way, in a better way, I think in many ways to begin to explain to people what the. How, what beauty is. Because elegance can oftentimes be very subtle. The sublime is another way. Because you know the sublime and, and there is a at times this catching of the breath at the sublime, you know, this, this landscape which is terrifying, you know, in its beauty. This. I think this is important because our culture seeks to pull all of that away and just give people, you know, the sugar, you know, the, the hot pink, you know what I mean? And the ice and, and, and you know, and the bling. But that's not beauty anyways. Like there's nothing beautiful really about that."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":2127.22,"end":2128.5,"speaker":"David Patrick Henry","text":"It lacks transcendence."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":2128.66,"end":2252.3,"speaker":"Fr Turbo","text":"It lacks transcendence because, because of its, but it's its absence. And what makes it transcendent is that transcendent isn't, isn't a disdaining of the whole, but it. Something that's truly transcendent not only encapsulates but its ability to encapsulate. It moves above it. It's above it, not doesn't, it doesn't disdain it per se. It's above it, it's beyond it. Right? Is another way to, I think to see it. And so I think this is really key because what could happen is that someone could begin to see the beauty of the church. And if they don't allow the beauty of the church to do its work, they could very begin, they could very easily begin to lose the ability to see the beauty of the Church. Do you understand what I'm saying? Because if you are coming in and if you see beauty and you see only the aspects of the beauty of the church which are self serving, right? Order is self serving, right? We see it right. All these things are self serving because we want to be safe, we want to be secure, all those things. But you, you'll begin to miss it because then you're, you are extracting because of your own desire for comfort, to have those things which are only titillating and appeasing to you, right? But the reality is, is Christ calls us into especially he gives us eyes to see where the beauty is found in the ascetic, in the beggar. I mean, if you think about Christ the Logos incarnate, walking among men, walking in the height of civilization, the Roman Empire, that's, that's the highest civilization, civilization on the planet, right? Quote, unquote. And he's pulling together like. And how does he do it? Like he's talking to the Samaritan woman and he's talking, you know, to these, you know, and he's, he's doing all these things alluding to the coming of the Gentiles and his, his apostles, they bring in the Gentiles. I mean, all of this is just, it's mind boggling. But that's absolutely. What Christ did in his ministry was to show where there isn't anywhere where he didn't touch."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":2252.78,"end":2253.18,"speaker":"David Patrick Henry","text":"Right."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":2253.26,"end":2389.46,"speaker":"Fr Turbo","text":"I think that's really important for us because if we lose that sense and people can lose it, especially as people see the beauty of the church as a beacon of, of and it is a beacon of safety. But if it's always just that, then there are these places where Christ is calling you and you will not be able to see them because they're not things that he's forcing upon you, they're things that he's inviting us into. And I think this is why the ascetic tradition in the church isn't just about, you know, the prostration and the bile experience, but the icon for us in a modern time imposes a fast on us in ways that I don't think people understand. You know, the icon imposes a fast on our senses and calls us to really reject the sugar and the pop and the, you know, the, the kind of, you know, visual kinetic energy that's given to us. Like all those things, it, it calls us to, to actually discern that the, the pop and the twinkle and the hot pink isn't really beautiful. And you need to have the bitter herb, you need to have the salt. You need to have those things to really help you to apprehend greater scope of beauty. Right. I think that's really key because if we don't have that, then what can happen is people no longer are entering into the heavenly realm and they do just make it, you know, a place which is like a museum with gold, you know, ornamentation. And they, and they begin to lose what the icon of St. John the Baptist is communicating. They begin to lose the sense of what the church is, is ushering us into. And then it really does become flat and two dimensional in the wrong ways and we lose the ability to enter into that ecological experience because now we're just, you know, spectating on some sort of very interesting and exotic kind of amalgam, you know, and that's, that's not what's happening, right?"}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":2389.86,"end":2429.19,"speaker":"David Patrick Henry","text":"Yeah. I would, I would argue that the lack of beauty in our society, coinciding with what you're saying, it's bringing us down to more of a base level of reality and just the pursuit of our pleasures. Because what, what does in 2023, walking through America, what gives somebody the sense of awe? I mean, is it the Empire State Building? Like, what exactly brings somebody to a transcendent awareness of asking deeper questions about themselves, about the world, about each other? And that's again part of the, as Jonathan highlight the eschatological purpose of beauty in itself, of esthetics and how God is working through the beautiful to reach us directly."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":2429.75,"end":2551.05,"speaker":"Jonathan Pageau","text":"Think about, you're saying Father Turbo. And my question, because there is that like in the church, there is definitely what modern people now would call the bling, right? That is, if you look at the mosaics, you know, that are, that we still see in Ravenna or, you know, in Hagia Sophia, it's like it's something, I mean, it is over the top, you know, and then even the vestments, right, the vestments are over the top, like hand embroidered, you know, with gold thread and, and all that. And so how do you see that? Like, how do you see. Because I kind of saw you pulling back and saying, we have to be careful not to be also deceived by, by that, that, those moving pictures or that kind of, kind of excess of luxury. And I mean, I see that in the tradition, right? I see it, you know, the, you see it in St. John Chrysostom, who in some ways is kind of criticizing, you know, the, the overly overly ornamented altar and then ends and says, but if there is gold, you know, you should, you should use the gold, but it's like you should be careful. And it reminds you also of the, the patriarch of Constantinople when Justinian built Hagia Sophia. There's a legend, the story, I don't know if it's true, but there's a legend that he wanted to make the, the templon or the door, I think it was the door of the church out of gold or the temple out of gold or something like that. Like there was something, some massive thing in the church, he wanted to make out of gold. And the patriarch said. He said, okay, you can do it, but if there's one beggar left in. In Constantinople after that, it's like, that's on you, right? That's on. That's on you. And so he kind of had to pull back, you know, and make it out of silver or something to kind of find that balance. And so how do you see that? Because, I mean, I'm not a pastor, so I don't have to deal with that as much. But how do you see that even in. In managing a parish, for example, how to balance the charitable aspect with the beautification, with the, you know, the, The."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":2551.05,"end":2551.29,"speaker":"David Patrick Henry","text":"The."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":2551.29,"end":2558.81,"speaker":"Jonathan Pageau","text":"The two. Kind of. The tension that you seem to be wanting to. To bring out, to be careful not to be also seduced by just this kind of external beauty."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":2559.13,"end":2951.26,"speaker":"Fr Turbo","text":"Yeah, I mean, I think the first thing is, it's. I'll just give this. This insight. I hope this is helpful. You know, our parish is in Kansas City, and it's, you know, in the middle of the hood. You know, like the hood. And when we were, you know, it's an old Baptist church which we brought down to the studs and then, you know, renovated. And when we were doing it, you know, I was being very particular about things, and there was, you know, murmurs, and some people that were upset. They're no longer in the community, God bless them, but they were upset because they said, you know, why. Why would you be spending all this, you know, why are you going to put a baptismal font here? Why are you going to have a marble inlay here? Why are you doing that? And then I sat down and I told one of them the story of, you know, the baptism of Rus, you know, and the whole story of, like, sending out the emissaries, St. Vladimir sending the emissaries out to, you know, all these places. And, you know, we all know the story, right? The emissaries went here, there, and they finally went to Agios. And they're like, we didn't know if we were in heaven and on earth. And that revelation of beauty wasn't just about, you know, the, The. The incredible mosaics in August Sophia. At the time, it was. It was the chanting, it was the music, it was. It was the spirit that. That was imbibed in the people. And we know that it's. We know that it's valid because when you look at the life of St. Vladimir, I mean, he. He ceases being a polygamist. He ceases being cruel. All These things begin to affect him and begin to affect the Russian people who were illiterate and pagan and barbarous and all that stuff, right? And then they became people of God. Now, I say all that to say this. The reality is that, you know, beauty will save the word, but you have to know what beauty is first. And that's part of. I think what the church does is the Church always, you know, it's. It's the. The. Yes. And, you know, it's the fullness. It's. We're maximalist, but we also understand that there is a place where you must ascend from. Or, excuse me, you know, you must. You must ascend from this place. And the way that I. I think you really begin to do this for someone is you begin to understand what's your intent. Because the intent, if it's of the worship of God, and the worship of God necessitates the bringing of the lost sheep, then what happens is there's a real sense of invitation that's in there. And I want to make this not so abstract. I think that there are moments in people's lives when they can. If you've been Orthodox or not Orthodox, you've traveled around, like, why is it that you can get a sense of something, a warmth of a community, and it may not have all the quote, unquote, accoutrement that like a huge perfect parish has, but you feel like you're being ushered into the Orthodox Church. You feel like you're being ushered into something that's just as valid. Why is that? Well, it's because of the. The beauty. The. The actual material of. That's used to express the beauty is precisely that. It's just the material to express the beauty. DPH has behind him an icon of Saint Maximus. It's right there. I was just looking at it, right? And it's like. Well, the problem is that people have these passions and they become attached to things in a disordered, improper, idolatrous way, right? It's like Saint Maximus is famous as saying. It's like, you know, gold is an object, woman is an object, right? But gold, connected to a thought of luxury, which is fundamentally about self, right, then becomes a passion. You know, it becomes this thing that becomes idolatrous. And so I think the way I would say this is, number one, I recognize that it is possible for someone to become unduly enamored and therefore, you know, begin to fall into an idolatrous relation to the expression of beauty in the church. And we see that when they begin to. And this is what St. John Chrysostom's talking about when they begin to disdain the beauty of Christ in the beggar or whatever. Whatever context that you want to. You want to look at. But ultimately, that horizontal, you know, the vertical of the cross, right? You do the cross. You have the vertical of me seeing God, me seeing the transcendent, you know, me seeing all these things, right? And ultimately it's still about me, right. Seeing that thing and being connected. But then if we begin to lose the horizontal of that reality, which is the humbling aspect of seeing the other and seeing the beauty in the other, I think that's where people begin to lose it. And that's where you see people feeling like it's an. I'm in so much that this person's, you know, disturbing you. But if they come in, it's like, ooh, do they look uncapped? You know, like that. That happens in parishes. And I. I think that's important because a parish, which, you know, someone. I'm not talking again, about someone who's, you know, maybe having some. Some mental health issues, whatever. I'm talking about just if a. If a human being wanders in, doesn't know what they're doing, but maybe. I know this is crazy to someone. Maybe God is leading them to. To that church to see something so that they could have a place of conversion and people could flip out and be like, hey, you know, kind of get that guy out of here, right? And St. Peter talks about this, about, hey, be careful about having, you know, the wealthy person brought to the front and the poor person brought to the back. And I. I think that is really key because if we don't acknowledge and we. If we don't have the humility to admit that we. We could become beguiled. It's not the fault. And that's. That's where I think a lot of the Protestants, Evangelicals, miss it, is that they think a person. They realize that that can happen, but they think it's the fault of the icon or the fault of the mosaic. It's not the fault of the mosaic or the icon. It's. It's the person who has not kept that tension of, you know, the transcendent beauty. Yes. But also the beauty that's. That's humble, you know, the beauty of the beggar. St. John Chrisostom."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":2951.26,"end":2951.54,"speaker":"David Patrick Henry","text":"Yeah."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":2951.54,"end":2955.38,"speaker":"Jonathan Pageau","text":"I mean, and Father Turbo, you can treat the Bible as an idol, too."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":2955.94,"end":2956.62,"speaker":"Fr Turbo","text":"Absolutely."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":2956.62,"end":2976.21,"speaker":"Jonathan Pageau","text":"It's not hard at all. Like, I've seen people do it all the time when you talk to someone and they're thinking about the word of God. The word of God. The word of God. And you're like, what are you talking about? And it's like. It's like. It's like, it's not Christ, the incarnate Logos. It's the Bible. That's the only word of God. And you're like, really? I don't know. It's a little weird, man."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":2976.21,"end":2979.81,"speaker":"Fr Turbo","text":"The spell book they have, and they treat it like it's a spell book, you know?"}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":2979.81,"end":3017.35,"speaker":"Jonathan Pageau","text":"Right. And so. So, yeah, I mean, it is. Let's say any. This is the. This is the. You know, I've been looking at Exodus a lot because we did this Exodus seminar, you know, a while ago, and I've been thinking a lot about some of the images in the book. And the. The. The. The character of Aaron is a really interesting figure because in some ways, Aaron is a tool that God gives to Moses to communicate to the people. Because Moses, like, I can't communicate. I need something. So God gives him an external. He's like, here's this other layer that you can. That. That will now speak for you and will be like your representative in front of the people."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":3017.51,"end":3017.77,"speaker":"David Patrick Henry","text":"And."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":3017.84,"end":3069.53,"speaker":"Jonathan Pageau","text":"And so he's like. He is in some ways, that tool that God uses to manifest himself, but then he's the one who makes the golden calf. It's like that's the duality of externalization, that in some ways it's necessary and inevitable. That is, all things that come down to us from God, you know, are externals in the sense that they're, you know, the glories of God appearing in the myriads of things that we. That we see. And that's real, and that's true, but they are all. Everything in the world is in danger of becoming an idol if we are not looking through them towards. Towards that which is transcendent. So it's just the reality of external. So the idea that in some ways our particular form of worship is more in danger of becoming an idol, I think is nonsense. It's just the reality of the externals."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":3070.29,"end":3120.02,"speaker":"David Patrick Henry","text":"Yeah. I was wondering if maybe we can tie a few of the different topics we've discussed with. We're talking about symbols, bringing them into ourselves, this. This timeless beauty, the eschatological importance of these things with us being living icons. Because it seems that in a sense, that's what Father Turbo was getting at in regards to me and my relationship to the transcendent. But then the horizontal is me enacting out the beauty as a living icon of Christ, and that this is the goal of all of us. And this is the beautiful transformation of all of us through theosis, through the engaging with these uncreated energies of God. I was thinking maybe, Father, you could speak a little bit to what. What. For those who may not be familiar with windows of veneration, how we understand icons, how does that relate then to the individual person having that relationship with Christ and becoming a living icon?"}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":3120.34,"end":3136.42,"speaker":"Fr Turbo","text":"Well, I think this is one of the things that's really important is because, um. Man, you know, I don't know if I can talk without throwing something out there that might be, you know, kind of hard to swallow. But I. I just. There is no Christianity without an ascetic aspect. It's just."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":3136.5,"end":3136.94,"speaker":"Jonathan Pageau","text":"It's just."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":3136.94,"end":3148.98,"speaker":"Fr Turbo","text":"You can't have it. It's a. It's a caricature. It's a distortion. And the reason why I'm saying that is because the ascetical aspect of the life of the church, it's there to do. It's there to."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":3148.98,"end":3149.38,"speaker":"Jonathan Pageau","text":"It's."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":3149.38,"end":3366.37,"speaker":"Fr Turbo","text":"It's there to help keep this tension that we're talking about, right? And it's also there because that tension's necessary in the sense of development. Like if we're going to look at the powers of the soul and the need for the powers of the soul to be, you know, honed and strengthened and disciplined, and the powers of the soul being primarily the means by which we actually experience, you know, the unseen God. Right? Because God is the maker, you know, the Father's Maker of all things visible and invisible. And so that reality, which is a reality, just because people are unaware of it, doesn't mean that that reality isn't there. And what the church does, especially for us, is. Awakens us up to this reality. And it does it through the ascetic tradition, but it does it also, first and foremost, I think, through the iconography, through the beauty of the church, the architecture of the church, through the beauty of our hypnography and our chants. And the reason why I say that is because what happens is when you. Even if you are not aware of, you know, the kind of the historical, you know, accidents of what different cultural aspects brought together, this thing, when you encounter it even. Actually, let me flip that. Actually, forgive me, let me flip that, because oftentimes the. The. The movie producer, the director, is the guy who can't watch a movie anymore because he's. He's so aware of what went in there that he's no longer Able to kind of like, suspend his knowledge to actually enter into watching a movie. You know what I mean? It's like the artist who can no longer appreciate something in. In the way that he used to back in the day, because, you know, he's. He's become, to some degree, like, so jaded by his knowledge. Right. I think what I'm trying to get at here is that this reality, when you experience something and it's sometimes often just a flash, and it pulls you to. I don't have a better word except for potential. You maybe might be able to say hope, but you. You get this flash of something out. It's otherworldly. And I. And I don't. It's nothing that I. That you give an image to. I'm not talking about seeing flying, you know, horses or anything like that. I'm talking about a hope. It's. Forgive me, digress a little bit. If you've ever experienced something very tragic, like the death of a loved one or. You know, I see this all the time being a priest, mentioning someone where I'm with someone who's dying, or they know that their parent is dying, or, you know, something really difficult is happening. And my. My job, my. My work is not so much to bring them to this place where they can, like, kind of make it through. That's really up to God in many ways, and up to them. But my work is to be present with them. Just being present because my presence is only possible. My presence is valuable insofar as I'm trying to just be present, to bear witness of what they're going through and God willing to bring to be some sort of conduit for hope. Right. And that flash of hope in the face of the imminent. This. I'm trying to describe when this. These flashes of eternity, these flashes of something transcendent in the real way."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":3366.69,"end":3367.01,"speaker":"Jonathan Pageau","text":"Mm."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":3368.21,"end":3524.71,"speaker":"Fr Turbo","text":"That's. What. If you. If you're being guided. Well, and you're actually not just looking at the icon and the church and all these things, is trying to, you know, find a solid ground in a temporal sense. Meaning, like, yes, our society's crumbling. Yes. Our political system's crumbling. Yes, our morality is crumbling, all that, but, like, it's always crumbled. Byzantium crumbled, you know, quote unquote. Holy Russia crumbled. Like, what has kept the people of God grounded? It's these things. And it's actually in the face of these very terrible moments that, like, we get to see that hope being purified and to some degree, not Purified, but freed from these things that were at once. They're given to us as aids. But we. We want to hold on to the crutches to some degree. And I know this gets into dicey territory because people are like, whoa, whoa, whoa, Father, then that. Isn't that the. Is that the mindset of, like, you know, the Puritans and all these people? And I'm like, yes, to some degree. But it was. Again, not for the reasons that I'm talking about, because we can talk about all of the. I can give the legend to how to read icons, right? This means this, and this means that. And someone can become really adept at being able to break down, like, oh, this symbol means this. This equals this. But see, what. What. What they. What you don't understand. And this only comes from, like, really kind of experience and striving for it is if the more adept you get at being able to kind of like, read the code, the easier it is for you to begin to miss it. Because what happens is, is you're now leaning into your ability to wield understanding and information for the sake of wielding it, right? And that's magic. That's not. That's not what this is about. This is about being brought to this place that only God can bring us to. That's what the icon's there for. The icon is there to. Sure. On a real basic level, even though this isn't the case, but there's truth to it, right? That the icon is there initially to, you know, pedagogically instruct those who couldn't read. But that's not really. You hear this. But that's not really the case because it's like we're. We are retrofitting our understanding of how people learn in pedagogy and experience on the ancients, right? It isn't just about reading, right? It's. The gospel is meant to be heard. See, people. That's not satisfying to people when they hear."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":3524.71,"end":3525.15,"speaker":"Jonathan Pageau","text":"Well, they."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":3525.15,"end":3533.94,"speaker":"Fr Turbo","text":"The gospel. Gospel being mean to heard. No, no, because if I can read, it's meant to be read because. Yes, it is meant to be read, but not. Not just exclusively, right?"}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":3533.94,"end":3535.74,"speaker":"David Patrick Henry","text":"Because communal activity."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":3535.74,"end":3540.06,"speaker":"Fr Turbo","text":"It's a communal activity. And not just communal in regards of, like, the horizontal."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":3540.3,"end":3540.66,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":3540.66,"end":3622.86,"speaker":"Fr Turbo","text":"But think about. I think about the children who hear the gospel, you know, weekend and week out, week in and week out, and some of them are not gonna. Many. Most of them are not gonna go on to be priests. They're not going to go on to be, you know, quote, unquote church workers, but they're going to be plumbers, they're going to be moms and dads, and they may not even be picking up the Bible daily, although I hope they do. But something, there's a seed that was planted deeply in them. Hearing those, the hearing the gospel. There's some. There's something that's very powerful that's opened up to them when it may not even be a well executed icon, quote unquote. But what is it? They'll remember that icon that was in their church when they were growing up. Why? Because the icon facilitated something called communion, called connection. And, and that's the thing is if, if we don't kind of really keep that, I think in the front of these conversations, it becomes very easy for someone from outside of our tradition or anywhere else to like, oh, that's cool, and learn this. And that's where, that's where you get people who are like, yeah, yeah, I know about icons and it's cool and blah, blah, blah, blah, blah. And I have one here, right? And they, they're treating it like, like it's a Cezanne print that they got at big lots or something. You know what I mean?"}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":3623.02,"end":3624.14,"speaker":"David Patrick Henry","text":"It's a commodity."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":3624.14,"end":3744.96,"speaker":"Fr Turbo","text":"It's a commodity. And, and the reality of it is is that, yes, there is a whole thing about, you know, inverse perspective. And we can talk about all these things and we should. I'm not saying we shouldn't, but I think what's, I think what's appealing and what's captivating for people is that, for instance, why do people keep listening to Jonathan? Because Jonathan's a wealth of knowledge. But I think the thing about Jonathan is you still get the sense that he's in awe and wonder still. You don't get the sense, forgive me for talking like you're not there, Jonathan. Like, he hasn't, you know, he doesn't, it isn't just kind of like he's just throwing like, yeah, da da da, da, da, da, da, da da. And this is this. And this is that, right? That you can tell to some degree that he's still searching, that he's still been pulled into, that he's still. He's in communion with someone. That's what we're, that's what we want to. That's the end goal. We don't want to just know like the why of something. But it's like what you were saying DPH about like the whole. And I think, I really think that's important to bring forward because one of the hardest things for someone who's coming out of, let's say, a reformed tradition, an evangelical tradition, is that they see the icon, they see the liturgy, they see all the mystery of the church, and they want to pierce that mystery. But the thing is, they have to understand you can't pierce that mystery in the same way. Forgive me for being lewd. But you can't approach it the same way. A guy kind of wants to, you know, go for the hunt. You know what I mean? Like, some guys like the chase, and they, you want to, you don't want to approach it like you're, you're going to conquer something. And I think that's what happens when we view these things in just a almost exclusively, like, kind of pedagogical, like, approach. We have to remember, like what, like what is being revealed here about who."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":3745.44,"end":3870.83,"speaker":"Jonathan Pageau","text":"Yeah, I think, I think, Father Turbo, what you're saying, what you're getting to is important in terms, even in terms of the question that you asked there, David, that, you know, the, the, one of the main purposes of the icons is to bring into, remind us of the communion of the saints in which we're participating when we are in prayer and in liturgy. And so that's why we have these standing saints that are just there kind of standing in the church, like, as if they're standing with us and they're worshiping God. And, you know, we, you know, you talked also, you asked a bit about how, how we treat each other in terms of the, in terms of becoming icons. And that is something that I, I, I. This is a speculation on my part, but I think part of the reason why we kiss icons is, has to do with St. Paul's asking us to greet each other with the holy kiss. I think that there's at least part of it which comes from that, which is in the same way that I bow to the priest and kiss his hand, the same way that the priest comes out of the altar, bows to us and asks for forgiveness in that way in which we receive Christ in each other in the church, and we signify that through different ways, in the same way that we encounter the icons and the saints as a continuation of the same process that we encounter each other with. And so I think you're right that there is a connection, definite connection, in the manner in which we're meant to encounter each other as icons. It's more, I think it's more best formulated, not that we're to become icons. That's difficult. It's like, it's More that we should encounter others as icons, like we should when we meet others. We should see in them Christ. That should be our focus. And if we do that, then we will be becoming like Christ if we do that. But to have to be in that disposition where we see like this person in front of me, you know, is, is, is a, is a little Christ to me. And I should, I should, I should treat him that way. That's hard. That's a tough one. But that's what we're asked to do."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":3871.48,"end":4028.26,"speaker":"Fr Turbo","text":"I. Very early on, when even, you know, just coming to the church and people are like, okay, well, what's this? What's that? Blah, blah. And I would explain to them about my time when I was in the Balkans or even in Iraq, and I'd say, look, you know, like, I was missing my wife and at the time, two kids. And I'd pick up the pitch and I'd kiss it. I, I would do that. I'd be on the FOB and I'd be, you know, missing my, Missing my wife and my kids, and I kiss the picture. And people would go like, yeah, they get it, they would get it because they've had something, some kind of experience, somewhat like that. And they go, like, there you go. We can move past that if you want. And you know, I can talk to you about Photius, cont, all that stuff, but like, that's not going to get you anywhere right now. Like, what you want to know is like, okay, like, well, how's this helping out? How's this helping out the person actually in the church, not just the priest, you know, not just the educator, but what about that kid? What about that old grandma? What about working class gym with his family? I mean, I'm really into this because I, I think one of the things is that for, for, for the people, the Leos, for the people, it's all there to bring them into it because they're, they're the people of God. It isn't just about the educated. And the illumination that the church brings comes from love. It comes from love. And, and when we begin to have, like, that's the thing, people have relationships with these saints. They really do. Like, if someone, you know, it's like, I'm in the Serbian church and it's the tradition of the Slava and you know, you have this patron of a family and oftentimes, you know, generationally, like, they turn to St. John when there's actual problems. St. John isn't just like, we have St. John up here. Because he is a figurehead of resistance to government power. Like, that is such an interpretation we would. He would give, which it's valid. I mean, I'll go there all day. I'll go there all day. But I think what's really important is that not everyone should strive to be a Jonathan Pageau, a David Patrick Henry. Like, I think people need to strive to be good, faithful men who work their H Vac job, who go to church and love their neighbor. And when they do that, they'll be able to experience the glory and the profundity of God. Like, that's. That's reality. And. And I. I'm all for that, because that's what transfigures the world."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":4029.28,"end":4065.61,"speaker":"Jonathan Pageau","text":"Like you said, at some point, you realize that the saints are there. They're there. And, you know, if you're. If you're attentive to it, you'll see them kind of, you know, act in your. In your life and act in the life of others. And, you know, that's a. That's a great joy because it reminds us that they're alive in Christ, you know, and that they. They're. They're. They are still in the church and they still pray for us and that just like we're meant to pray for each other, we can kind of experience it when we see the saints move among us and. And move things, you know, among us. So it's a. It's a testimony to what the church is."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":4066.09,"end":4158.69,"speaker":"Fr Turbo","text":"I tell people about. And I know it's. I'm taking liberty with it, but when I give my explanations, you know, I tell people that. Think of the halo in the icon as the wedding ring and the unification of God and. And that person, right? There's your theosis, right? The unification of God and that person and that wedding ring, which is a symbol, right? I mean, and then you can even have someone touch the wedding ring, and it's like, you know, put your hand on that wedding ring, Jim. You know, put your hand on that wedding ring, you know, Joanie, and recognize, like, what is that? Yeah, that's metal. Yeah, that's gold. Yeah, that's an ore. But, like, the effort that you put in, Jim, to work those extra hours, you know, to get Joni that really nice ring, right, that. That's an actual manifestation of your love for Joni and your love of, you know, Mark and Lucy, who are your parents, right, because you're holding to this tradition and you're. You're loving this tradition and you're giving of yourself in the Real world. Right. Blood, sweat and tears to bring forth that love, which is immaterial in the sense of, you know, it's invisible, but we're. You're. You're manifesting it, and that's a real thing. And that's what icons are. Icons are a window to heaven. Okay, well, what's heaven? Well, look at an icon. And what's in an icon? Every icon, generally speaking, there's going to be a human person."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":4159.98,"end":4160.22,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":4160.46,"end":4259.61,"speaker":"Fr Turbo","text":"And the halo. There you go. God and man. That's what heaven. Heaven is the union of God and man. Right. Anything else? We begin to kind of like get into other stuff, but we know that's what heaven is. Persons with God and God in persons. That's what it is. That's what the kingdom of heaven is. And so when we be. When we're able to bring it down to that level and show, you know, Joni and Jim that the symbols that are even on their body, on their ring finger, can actually lead them into that understanding, then you start to approximate the purpose and the function of the icon isn't just there to give you, you know, a high level theological understanding of, you know, blah, blah, blah, but it's actually like, to ground you, which is incarnational. Yeah. That's the thing is being incarnational is about being grounded. And. And I think this is really key because one of the big things that you want to do, that I wanted to do, to want to pass on the tradition. Yes. But the life of the church to my kids, Right. I wanted them to become citizens because this is the meta. The church is the meta culture. Right. Everything gets subs, you know, everything is subsumed into that meta culture. And if there's something valuable and good, it gets baptized, it gets illuminated, it gets, you know, impregnated with God's wisdom and glory, and then it becomes something blessed. Right. And that's. That's why we have to keep this reality in front of people. And that's what the icon does. It keeps that reality of what God is calling and has already ushered you into, you know."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":4259.61,"end":4366.47,"speaker":"David Patrick Henry","text":"Yeah. You remind me of the conversation I had with Bishop Max Maximus on participatory versus propositional understandings of God and how we relate and that this is what we're hinting at through the entire conversation was this participation in God, participation in the experience of beauty, the creation of beauty, participation in the uncreated energies of God, which is related to all this different stuff. So we're talking about saints, we're talking about men that with Their free will chose to choose God, chose to love, chose to participate. This. The icons, then, are windows of energetic realities of heaven in which. That you participate in, as you said, you don't just decipher it like a code. It's a living reality, even though it's just a piece of wood with paint on it. And so this participation is this mystery of orthodoxy that I think is what's so beautiful. It's not this overly scholastic, propositional understanding. It's not just a sort of bland lack of aesthetic due to the fear of idolatry. It's. It's, again, it's bringing all these tensions together and allowing you to participate in these realities. And that is then becoming a living icon, is the fullness of day after day after day choosing to participate in this and hopefully, God willing, in yourself. You then can be a. As. As Abbott Triffon says, and angels unaware. You can be somebody in somebody's life. Say it's the. The man who's disheveled and smells and comes into the church that you are now in a position to actually be another window for somebody into the kingdom. And that's the goal of all of us. And that. I think that that's. It's subtle, but it's a different emphasis than maybe you get in other flavors of Christianity because it's not so participatory."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":4367.27,"end":4473.28,"speaker":"Jonathan Pageau","text":"I think. I think your point is right. And Father Trimble, your point about the wedding ring, I think is a great way to help people understand sacramental reality when they're not used to it, right? And you can. You can reduce it to very simple things like a good. I try to define this the most. The simple examples, like a handshake, right? A handshake is a ritual, right? A handshake is a means. A handshake is all these things. But, you know, you still tell your child, like, here's how you shake your hand, right? This is. Have a firm handshake. Don't just plop. You know, hold the hand not too long like you. The. The child has to learn to shake the hand properly. And. But the purpose is not the handshake, obviously, just like the purpose is not the wedding ring. And also the purpose is not this piece of wood with paint in it. The purpose is that which we see through. And so. And we're used to it, because now once you internalize it and you shake someone's hand, you're not thinking about the handshake at all, right? You're seeing through the handshake to the person that you're encountering and seeing it as a method to greet and to enter into communion with them. It's the same with the kiss, it's the same with all these gestures. And the icon is the same. It's like, you know, when you, when we encounter the icons, we are see them as means of encountering the saints, of remembering them, of bringing them to mind, bringing them into prayer and asking them to pray for us. And that becomes as natural as a handshake once you have kind of entered into that life. But like you said, Father Turbo, if you just kind of sit at home online and you like, interpret icons, like I'm, I've interpreted icons more than anybody, right. Like, I spend a lot of time interpreting icons, but obviously the point is ultimately for them to become vehicles for, for our participation in the life of the. Of Christ."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":4473.6,"end":4527.25,"speaker":"Fr Turbo","text":"That's right. I mean, I think one of the best ways to understand it, and especially I really hope that this helps a lot of people kind of get some. Over some of those hurdles of barriers of entry and that they don't worry about what people think or whatever, and they just want to approach God. Right. And this is what I mean by this. All this is necessary insofar as it becomes tacit, because that's the, that's the space in which you begin to really get it and you get into it. For instance, your example about the driving, about the handshakes. Perfect, let's do another one. Driving a car, right? You know, my, I. I had first day of school today, my 16 year old, he said, can I drive, dad? Sure. Right. And you know, he's taking turns too wide, you know, all the stuff, all stuff."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":4527.25,"end":4527.53,"speaker":"Jonathan Pageau","text":"And."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":4529.69,"end":4531.05,"speaker":"Fr Turbo","text":"It'S not tacit yet."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":4531.13,"end":4533.85,"speaker":"Jonathan Pageau","text":"He's still think about totally like entered."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":4533.85,"end":4564.33,"speaker":"Fr Turbo","text":"In like, okay, break distance, right. And then there's going to come a point when it becomes tacit. And what's interesting is the more all of those parts are tacit, the better of a driver he'll be. Right? It's like more he forgets what he has to do, the better of a driver he'll be. It's the same thing as you come into the church, the more that you internalize these things, the more that the remembrance is constant. You're present, it's there. You don't have to take the energy to recall, Right?"}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":4564.33,"end":4564.81,"speaker":"David Patrick Henry","text":"Yes."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":4564.81,"end":4638.06,"speaker":"Fr Turbo","text":"Because here's the thing, there's people who are living in the liturgy all the time. The animesis is happening from all the time. It's not that they transcended it, but they. They internalize it so much, there's no need for the recall, right? They are. They are in it. And then when they're actually in those very explicit moments, it just shoots them up another level, if I could use that language. But it's. It's tacit. And so that's the thing is you get to this place where the remembrance of the saints prayers. I mean, that's. That's one of the purposes of the quote unquote practice of the Jesus prayer is that it becomes this tacit thing that is so, you know, you've imbibed it to such a degree, right? This is. This is the key thing to understand, but you have to go through that process of understanding. So I'm not disdaining or denigrating that process of learning at all. I'm just saying that because of our culture, the emphasis is so much on it, because of our tendency for control and for we. Our want of power, our want of security. And that's what keeps us wanting to stay in this very kind of scholastic mode. Because it's like, if I'm approaching everything through this kind of zoological framework, I'm the master, right?"}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":4639.42,"end":4645.86,"speaker":"Jonathan Pageau","text":"Zoological. It's like I got to be able to name everything, exactly everything that's going on before I ever engage, you know?"}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":4645.86,"end":4855.89,"speaker":"Fr Turbo","text":"Yeah, yeah. And ultimately, here's the thing. You hit these. You, you know, if you come to the church, it's maybe two years, maybe 12 years, whatever, but you hit a hump, you hit this kind of flat point in this plateau. And then you can often say to yourself, okay, I'm just kind of like going through the motions. So is it tacit now? Okay, sure. But, like, here's the thing. That's where. Getting back to what we're talking about earlier, some of the dark parts of the mosaic become important. The dark parts of the mosaic are death, horror, you know, seeing the reality of the fallen world for what it is, and the light of Christ, right? Not. Not needing to, you know, put a. A false lens on, but seeing it for what it is. If you imbibe all these things, then what happens is it's not so much that you become a window to the disheveled guy who's smelly, but actually he becomes the window for you, right? And that's the thing. He becomes the window for you. Because one of the problems for us is that we get a sense of, I got it. And things are tacit, let's say. And then you do begin to plateau, but you're plateauing not because God isn't giving you anything. But because you have hit this place of your own glass ceiling of experience and understanding, it becomes self sufficient, supposedly. And what happens is God then has to really kind of put. He has to turn everything upside down to wake you up. He has to use, you know, the car accident, the, the disheveled beggar, whatever thing to like, bring you out of this place where you thought, okay, I'm good, I'm clean. I got all the boxes checked. Everyone looks to me as whatever. And it's like, no, like, that's nice, but here's another level. And that level then becomes. And that's where the cross now becomes a whole nother thing for you, right? Because it takes on a different understanding and you begin to now move in what you've already been doing in a different way. Because I think this is the thing, my son, he'll become more and more, you know, it becomes tacit. He'll become a better driver, blah, blah, blah. And he'll enjoy that for a long time. But there will come a point, God willing, where the driving now takes on another meaning for him. And that meaning is going to be about transporting his siblings, right, Transporting his own kids one day. And it's going to change everything and things that he was maybe able to do. Maybe at some point he's able to do some donuts in the parking lot and got some good control. That's great. But something's going to want him to move beyond that and to not flex and to not show off. And I think this is key because God again, hasn't forgotten him. And God says, okay, son, there's still more. There's, there's, there's still more to enter into, right? And that's why you need to learn this stuff and allow it to become everyday life. That's why prayer rules and the mundane are, are, are, are valuable. Because you don't become adept at something quote unquote, by entering into it in this, in this. It only happens when it becomes a part of your life intentionally. And, and that takes work. You know what I mean?"}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":4856.61,"end":4970.44,"speaker":"David Patrick Henry","text":"So, yeah, to sum up the conversation, I think this aesthetic dimension of orthodoxy is one of the most important that speaks to the contemporary world. Because I would say most people are feeling the world's getting less and less beautiful in many, many regards in the church, allows us to see what beautiful behavior is. How in a new context for beauty, as Father was speaking, you know, somebody may think that the beautiful picture is everybody dressed nice, that liturgy, sitting in, standing in the right place. But it could be the homeless man. It can be the unbeautiful in conjunction the both. And that, from an Orthodox perspective, is more beautiful that. That the bringing together of all these things together in the worship of God that is more beautiful than everybody wearing the right palette colors and standing in. That's almost too contrived, and that's not reality. But keeping the tensions between things and beauty doesn't necessitate large rational understandings of our theology. It doesn't demand complicated explanations for correct behavior. Utilitarianism, deontological ethics, virtue ethics. Anybody can engage with beauty. And for me, coming out of the New Age and the psychedelic and the occult, it was the beauty that felt so comfortable because it's one of the things I liked about the visionary art and all the colors and all the, all the pictures and all the aesthetics. Well, orthodoxy has that, but it's so much deeper. And so it offers a, I think, a really great entry point for people that you don't have to know the intricacies of the energy, essence, distinction or iconography to see. Oh, wow, this is really beautiful. There's something here, and I want to engage more in that and our worldview so mystical and it's so participatory that, as Jonathan and you said, it calls people in. And I think. I think this aesthetic dimension is one of the most important things that the Orthodox Church can offer to especially the contemporary Western world."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":4971,"end":5009.62,"speaker":"Jonathan Pageau","text":"Oh, I think it's a great place to end. I think we, we had. It was great to meet you, Father Turbo, finally, you know, after all this time. I'm really happy. First conversation. We're trying to actually plan for people watching. It's not set yet. We're trying to plan some event in, In California where, where we'll be speaking together. I hope we can get that at least. Maybe you don't even know about this, but there's people scheming. People are scheming. And so, so we'll try to. Hopefully that will come about. And, and David, thanks for, for hosting us and, and, and kind of prompting the conversation. It was, it was great to talk to both of you and hopefully we'll be able to do that again."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":5010.02,"end":5014.42,"speaker":"David Patrick Henry","text":"Well, thank you, Jonathan, for having us. We really appreciate it and God bless you and all the work you're doing."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":5014.98,"end":5017.46,"speaker":"Fr Turbo","text":"Thank you so much. Thank you so much. This is great."}
{"episode_id":"SW - #315 - 2023-11-24 - Fr. Turbo Qualls and David Patrick Harry - Beauty and the Ascetic","start":5018.15,"end":5073,"speaker":"Jonathan Pageau","text":"I want to invite you all to the very first Symbolic World Summit. Over three days, we will finally meet in real time, in real space. And everyone from this little corner of the Internet will be there to explore the theme of reclaiming the cosmic image. Of course, I will be speaking, but there will also be Martin Shaw, who is an amazing mythographer, Father Stephen DeYoung of Lord of Spirit fame. There will be Richard Roland from the Universal History series, Vesper Stamper, Nicholas Kotar, and Neil Degrade that you've all seen on my channel here and there. For entertainment, we have everyone's favorite apocalyptic band, the one and only Dirt, Poe Robbins. This event will be the chance of a lifetime to capture and embrace our current moment. So join us from February 29 to March 2, 2024, in Tarpon Springs, Florida. Visit the symbolicworld.com/summit for more information. I will see you there."}
