{"episode_id":"SW - #046 - 2019-07-27 - The Symbolism of the Christmas Tree","start":0.56,"end":6.96,"speaker":"Jonathan Pageau","text":"On this episode of the Symbolic World podcast, I am playing for you a discussion ahead around the symbolism of the Christmas tree."}
{"episode_id":"SW - #046 - 2019-07-27 - The Symbolism of the Christmas Tree","start":7.2,"end":11.4,"speaker":"Jonathan Pageau","text":"Now, once again, as I said in the last episode, it might seem strange."}
{"episode_id":"SW - #046 - 2019-07-27 - The Symbolism of the Christmas Tree","start":11.4,"end":12.88,"speaker":"Jonathan Pageau","text":"That this is appearing in the middle."}
{"episode_id":"SW - #046 - 2019-07-27 - The Symbolism of the Christmas Tree","start":12.88,"end":14.64,"speaker":"Jonathan Pageau","text":"Of the year, but hopefully within a."}
{"episode_id":"SW - #046 - 2019-07-27 - The Symbolism of the Christmas Tree","start":14.64,"end":19.76,"speaker":"Jonathan Pageau","text":"Few months we'll have all caught up our podcast and videos so that they're coming out at the same time."}
{"episode_id":"SW - #046 - 2019-07-27 - The Symbolism of the Christmas Tree","start":19.92,"end":21.28,"speaker":"Jonathan Pageau","text":"But I think you will find that."}
{"episode_id":"SW - #046 - 2019-07-27 - The Symbolism of the Christmas Tree","start":21.36,"end":23.32,"speaker":"Jonathan Pageau","text":"This discussion on the symbolism of the."}
{"episode_id":"SW - #046 - 2019-07-27 - The Symbolism of the Christmas Tree","start":23.32,"end":25.8,"speaker":"Jonathan Pageau","text":"Tree and the particular form of the."}
{"episode_id":"SW - #046 - 2019-07-27 - The Symbolism of the Christmas Tree","start":25.8,"end":29.56,"speaker":"Jonathan Pageau","text":"Christmas tree, how it manifests an image of reality, to."}
{"episode_id":"SW - #046 - 2019-07-27 - The Symbolism of the Christmas Tree","start":29.71,"end":35.23,"speaker":"Jonathan Pageau","text":"To be enlightening, to say the least. And so just to remind you, as usual, that all this stuff that I'm."}
{"episode_id":"SW - #046 - 2019-07-27 - The Symbolism of the Christmas Tree","start":35.23,"end":49.87,"speaker":"Jonathan Pageau","text":"Doing online, these videos, these podcasts are done thanks to your support of my efforts. You can find ways to support this podcast on the symbolicworld.com of course. Please share this to your friends and subscribe to my YouTube channel and to the podcast."}
{"episode_id":"SW - #046 - 2019-07-27 - The Symbolism of the Christmas Tree","start":50.03,"end":51.51,"speaker":"Jonathan Pageau","text":"If you go ahead and leave a."}
{"episode_id":"SW - #046 - 2019-07-27 - The Symbolism of the Christmas Tree","start":51.51,"end":75.69,"speaker":"Jonathan Pageau","text":"Review of my podcast wherever you are listening to it, that is also extremely helpful as well. So thanks a lot. This is Jonathan Peugeot. Welcome to the Symbolic World."}
{"episode_id":"SW - #046 - 2019-07-27 - The Symbolism of the Christmas Tree","start":86.01,"end":1424.79,"speaker":"Jonathan Pageau","text":"So, like me, you've probably heard several times this notion that so many of our Christian traditions, including the Christmas tree, has a pagan origin. Either that or they'll say that it's recent, that it's not very ancient, it doesn't really matter. All of these are strategies to somehow, you know, get some attention for discrediting the Christian tradition. But what's important to understand, if you look at it in the right way, is that the mechanical reasons why a tradition becomes important, sometimes it matters, sometimes there's a reason why we. It's important to track, let's say, the historical or let's say mechanical way in which something comes into our lives. But sometimes it. It isn't. What's important is rather, you can, you know what, you can almost see it in a Darwinian sense. So imagine it this way. Imagine that the world. Imagine that people have all these different variations on how to do things. You know, even in terms of the Christmas tree, you know, there are all these different types of Christmas trees there. You know, every Christmas tree is different. And it's the same for all these different traditions we use to celebrate Christmas or to celebrate anything, that there are all these different variations and possibilities of what can happen. Now, what's important is not so much that variation. Yes, that's important, but what's most important is understanding what is it that selects, that is, there are all these different traditions that pagans had before Christians. Why is it that Christianity selected some of these traditions rather than others. And that's a template for all of how things work in general. That is the reason why we do certain things. What's important is not so much, let's say, for example, someone will say, you know, it's silly that we clink glasses together. Because what that come from is in the Middle Ages, they used to do that so that, you know, the alcohol would mix together. And if you were trying to poison someone, you know, we'd all poison each other. So it was a way to make sure we're not poisoning each other. And you think, you know, and then they'll say, well, it's silly that we would do that today because, you know, look at how dumb you know, this. The origin of it is. But the reality is, is that they're all. There were plenty of other traditions like that in that time, but for some reason, that tradition survived until now. It was selected to continue on. And what. And the reason is because it fits. Fits in with a pattern. And so it fits in with the pattern of coming together. It's not very hard to understand. We all are drinking different things, and we bring them all together, we put them together, we touch them together to show that we're in relationship, that we're in communion. Then we bring them back to drink. You know, it's like, let's say it's a very elaborate version of a hug or a kiss where you bring. You come together with the person in front of you to show your solidarity, and then you go back on your own. And so what's important is rather to understand the reason why things are selected. And in that reason, that's where we can see the pattern. And in the Christmas tree, what we can see is that the pattern of the Christmas tree, like so many of the things that I'm trying to tell you about, is basically a representation. It's a manifestation of the pattern of reality itself. So let's look at the Christmas tree, and hopefully you'll be able to see what I mean when I say that. Now, like I said, there are plenty of different versions of Christmas tree. If you go online, all you have to do is write Christmas tree into Google, get thousands and thousands of images of Christmas trees. And they're all different, but they all have something which makes us recognize that they are a Christmas tree. Not one thing. There are several things which come together into a pattern which help us recognize that it's a Christmas tree and not something else. Okay, now what are those elements? First of all, they're the fact that the tree itself has to be a pine tree or a fir or a spruce or something that is. That is conical. That is a triangle. Okay. Other trees won't do so much. So most Christmas trees, most of the time, they are. Obviously there are always exceptions, but a pattern has exceptions in its peripheries. It will be a kind of triangle. So it's like a pyramid. Okay. And so already you can start to understand what it is that this Christmas tree is about. So what's at the top of the. The Christmas tree? We put either a star or an angel. Okay. Now a star and an angel actually are pretty much the same thing. Even in the Old Testament, for example, the word for star, the word for angel, and the word for king, for example, all are either the same word or are in the same family of words because they are principalities. They are the. The. The chiefs, the heads, the. The. The summits of a hierarchy of manifestation. Okay. For people who are interested in that, you can look at my. My video on. On principalities. I've done a few to help you understand how that works. And so it can be an actual physical person. A king can act as a principality, but. But a principality either above the king or there at the top, can also be something which is invisible, a hidden. And even in the king. The fact that we recognize the king as the principality of a country is hidden in the king because he's just another regular person. There's something hidden which makes him the point of that hierarchy. And the tree itself as a pyramid becomes the hierarchy itself. And the reason why it's a pyramid is obviously makes sense. You have one at the top, and then it goes all the way down to many. Okay. That's a basic idea of a pyramid in. And it can be. It could be a tree or it could be a mountain. I've told you it could be other things as well. But I showed you in my video on the symbolism of trees how the. The mountain of paradise with the tree at the top could be seen as either just a tree or, for example, in the story of Moses, could just be seen as just a mountain going up the mountain and encountering the head of this whole thing, encountering the principle which holds it all together. And so that's what the angel or the star are at the top of the tree. Now, around the tree, there are these ribbons that go around the tree. And what are these ribbons? They're the same thing as they're the. They're the periphery of the wheel. You could say they're the turning wheel that goes. That goes around the hierarchy. You could see it as the snake which goes up the tree. You could see it in other relationships as, for example, these. The ribbons that go around the maypole. It could just be circumambulation in general, you know, religious circumambulation, like a procession which goes around the city, a procession which goes around the. The town. And so this is this coil, this snake that goes up the tree, all around it. Now, in the tree itself, we have lights, not just lights, but also ornaments. And these ornaments are precious things. They're meant to represent this. These precious balls or these precious objects, these golden objects, shiny things that are all into the tree. And so glorified version of reality. We're looking at, you know, all the mysteries of reality shown to us in this Christmas tree. Because as I've tried to explain to you before, for something to exist, for something to. To. To be able to appear on the, you know, phenomenological horizon, that is that you. So for some, for you to be able to see that something is real, that something exists, and it has to have that hidden spark. It has to have that hidden purpose, that hidden identity which brings it together into one. And so these lights in the tree are basically an image of how reality lays itself out and how hidden in the hierarchy are all these different little lights, these logi, these smaller principalities, smaller essences, which are hidden in manifestation, hidden in the world. And so you see the hierarchy itself as being full of light. The light that comes from above is now filling up the entire tree and showing us the gems in the world. And so then at the bottom of the tree, what do we usually have? We put the gifts. Now, what's important with the gifts is to understand that the gifts are wrapped, the gifts are hidden. And that's really the most important part, because even in a little bit, not that long ago, just one generation ago, my father, for example, at Christmas, they could get either a gift or they could get just a chunk of coal. And so the idea is, you know, depending on if you're good or bad, the gift could either be something positive or negative. But now we've only kept the positive. But we can still understand this idea that you don't know what's there. It's potentiality. It's Schrodinger's box. If the cat could be alive or could be dead, we're looking at the potentiality of reality. It's not revealed yet. And then hidden in this potentiality are the gifts and so the gifts are just like the lights in the tree, for example. They are these hidden, precious things which are in potentiality, you know, the treasure that's hidden in the unknown. You can see that you know, the treasure that's guarded by a dragon. Or the idea of. In the Bible, for example, we have St. Peter who goes to the shore and finds a golden piece in the mouth of a fish, but also the fish itself, which is the symbol of Christianity, early Christians represents exactly that. So imagine there's this water of death, this chaotic water, and then in the water you find these sparkling things, these sparkling living things, these things that are useful inside the chaos. And so you can fish and you can bring out of this death and out of this chaos things which are useful, things which are precious. And so that is really this idea of the. Of the gifts at the. At the bottom of the world, if you will. And so I know some of you might doubt that this is what it's referring to, but a good way to understand that that's exact, that that is indeed what. What we're. What we're dealing with is to remember other traditions of Christmas. Once again, where usually do we hide the gifts? We put them under the tree, but there's another place where we put them, right? We put them in the socks, put them in the stockings. And so at the bottom of a sock, we will hide a precious thing. In the old times, they would usually hide an orange. You know, we have this story of St. Nicholas who hides a golden ball at the bottom of a sock. And so this golden ball, which is hidden at the bottom of phenomenological reality. I don't. I really struggle to imagine a better way to represent the bottom of phenomenological reality than the bottom of a sock, because that's where your feet touch the ground, the earth. And so. And once again, this idea of putting a orange or a gift in a sock, it used to be that we would all. We could maybe put a piece of coal there as well to kind of remind you that you've been naughty. And so that is basically the kind of structure now in order to kind of understand the whole thing and how the gifts are also at the bottom of the tree, or the golden ball is hidden at the bottom of the sock. You also have to remember that Christmas is the solstice. And so it is when the sun is going down. So every day the days get shorter and shorter until the solstice. And then at the solstice, the days start to get longer. And so you can imagine that the day is going down, down, down. We're going down into darkness. We're descending into death. We're descending into the lowest place. And the question is, what's going to happen? Is it just going to keep going? Is we're just going to be overwhelmed by darkness? But no, in that lowest place, place, you have this hidden thing. You have this golden ball at the bottom of the. The pond, you know, the. In the story of the Princess and the frog, you have this golden ball at the bottom of the pond, the golden ball at the bottom of a sock, you know, or the gifts hidden under the tree, hidden in the. In being hidden in their wrappings. And so the sun goes all the way down, and then it starts to come back up. And so you can see that at this time, other traditions have similar feasts as well. The Jews in December celebrate Hanukkah. And so in Hanukkah, it's the same story. You have the Seleucids who are attacking Israel, and, you know, it's dire and everything, you know, they have nothing left. And then they have this one last little jar of oil, and they, you know, they pour the oil into the. Into a lamp, and miraculously, this lamp continues on, doesn't. Never goes out. And so this idea of this lamp that doesn't go out in the darkest time or in the place where the sun is going down is to help you understand the way that reality works. In order for you to perceive anything, like I said, there has to be a hidden light. The world is never completely empty of meaning. This notion, for example, that we find of total depravity, that the world is completely lost and that, you know, that human beings are completely fallen and there's nothing left in them is impossible. Because if that were true, they wouldn't exist. In order for something to exist, there has to be hidden, even if it's completely, you know, sullied, even it's completely hidden in darkness. There has to be a spark just for things to exist, a spark of meaning. Okay, now, all right, so we've done all of this going down. And there are other stories that Christ talks about this. This kind of hidden thing in the. You know, that the pearl in the field, there are many images of that as well. There's also the story of Elisha and the widow. It's a very similar story than the one that you find, for example, for the Maccabean revolt. You have this notion of a time where there's no food, you know, and there's a Drought, and everybody's dying of hunger. And there's this widow who has one last jar of oil, and she's like, this is it. I'm gonna die. And Elisha tells her to go to the jar of oil, and when she goes, the jar of oil never runs out. And so this idea that the jar of oil and oil is similar even to fire because it's a glistening liquid, it reflects. You know, it's like that's what they use to anoint kings. And so it's like this kind of light that comes down, solid light that comes down. And so the oil just doesn't. Never completely runs out. And you can see that Elisha also resurrects the son of a widow. And. And so this resurrection of the son of the widow and also the oil that. That doesn't run out is the same as this little light, this little flicker at Hanukkah that doesn't. Doesn't go out. And it's the same as the sun which goes down at the solstice and then, you know, starts to come back out again out of this kind of secret, dark place. Okay, now, a lot of you will. A lot of you will. Will wonder, you know, what does this have to do with Christmas? Because I haven't gotten to Christmas yet. Well, there are a few things. The first thing to remember about the Christmas story is that the Christmas story is exactly that descent. You have to understand the aspect of the killing of the innocents is a very important part of Christmas. King Herod, in looking for Christ, trying to find this Messiah, started to kill the newborns in Bethlehem. The. Started to kill the newborns. And so in this time of death and this time of ravage, where all the seeds, you know, all the lights are going out, there is this one light that survives, this one child which survives and will then grow to become the new principality of a new hierarchy of a new world that will lay itself out, a new sun that will rise up to its zenith, and then. And then rule the. Rule the phenomenological world. All right? And so that's part of the. And it's the same with the story of Moses as well. You know, the Pharaoh decides to kill all the Hebrew children, and so he's killing all these Hebrew children, but there's one child who survives. And then he's, you know, he's not represented as like, let's say, a shining light at the bottom of water, but he's represented as the seed which floats on the. On the. On the waters, which is hidden in the seed and floats on the water. So it's the same, It's. It's the same symbolism as the others. Now, in order to kind of cinch all of this for you, last week I put out a video to show you the symbolism of the Nativity icon. And so let's look at that. Let's look at that icon again. Now look at the icon of the Nativity. What is its major form? What's its major shape? It's a mountain. And so this mountain is this pyramid. It's this hierarchy. You can see it go up, you know, small at the top, large at the base. What's at the top of the mountain? A star and angels. Okay. Like I said, those two things are very close to each other in terms of. Of their meaning. Now this ray of light goes down. It's coming down from the principality, coming down from the top and moving down into what's not the bottom of the tree or the bottom of the mountain, but rather is this dark place of death inside the mountain. Notice that inside the cave, it's completely black. And so it is this place of total darkness, this place also of animals and this low place of death. And the manger is an animal food trough, and it's also represented as a sarcophagus. So it really is this place of death. But in this place of death, that's where we find the seed. That's where we find this spark, this divine spark which is hidden and will then grow to become the new principality. And so you see it, of course, in the story of Christ. It is a cosmic. It is the cosmic version of this. It is the version which shows us, let's say, the hidden seed of the entire world. That is, he is the logos of all creation, the source of all creation. But at smaller levels, we can see how this manifests itself, can manifest itself on smaller scales for all of reality. And that's just how reality works. And so, like I said, like I've told you other times before, you know, you. It's. It's. It's something that we encounter all the time. So imagine once again, a fruit that drops from the tree starts to decompose, starts to become death itself and to become just dirt. But hidden in that process, there's that seed that's there. And you can't see it at first because it's a. It's a. It's a baby. It's a. A seed without body. It's this spark. And then slowly the process inverts itself. And the seed begins to feed on the potentiality, feed on the earth and grow. So that you see this new plant come up. Just like the switch of the sun at the end of the solstice is invisible. You can't see it. You don't realize at first that the days are getting longer and then they start to grow, grow, grow. And like I've told you, told you before, that's why we have theophany, you know, at the end of the Christmas cycle to kind of. It's like this realization that, yes, the, you know, this, this hidden Emmanuel, this God in us, God with us, is now showing itself, is starting to appear in, in the world, just like the days are getting longer in the year as well. So I hope that brings it kind of all together for you. It helps you understand, especially like I said, the. That often it doesn't matter what the mechanical cause, the, you know, the historical or pseudo historical origins of something is. What's important is the fact that it has been selected, it has been retained, and it comes together and participates in the message or the, let's say, the reality that we inhabit. It doesn't mean that some of these things don't get pruned off or come back, conjoin themselves and get pruned off again. That's fine, especially in these less important things. Like a Christmas tree obviously is not like the creed or like, you know, the crucifix. It's a peripheral tradition, but you can still show us just how it continues to participate in this symbolic process."}
{"episode_id":"SW - #046 - 2019-07-27 - The Symbolism of the Christmas Tree","start":1426.31,"end":1482.22,"speaker":"Jonathan Pageau","text":"Thank you for listening to the Symbolic World podcast. As you know, this podcast is for now based mostly on my YouTube videos, which I am transferring into audio format. Please go ahead and visit my YouTube channel. There are more videos there on different subjects that I'm not going to put into audio. And please share this to your friends. I know a lot of people know about the YouTube content, but not so many people know that this is also a podcast. So share it to your friends, share it on social media. And if you can, feel free to support this financially as well by going to my Patreon page, which is Peugeot Videos. Strangely, you can go there and you can support it at any amount that you want a month for all the patrons. I do a monthly Q and A, live Q and A in which people can ask questions in the chat. And I try to have a more personal connection with people. The YouTube comments have become difficult to follow and to answer. I'll see you soon."}
