{"episode_id":"SW - #413 - 2025-10-10 - Heidi White - The Divided Soul - Duty and Desire in Literature and Life","start":0.16,"end":11.6,"speaker":"Laura Diaz","text":"Tucson, the weight is over Mediweight loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and."}
{"episode_id":"SW - #413 - 2025-10-10 - Heidi White - The Divided Soul - Duty and Desire in Literature and Life","start":11.6,"end":12.28,"speaker":"Heidi White","text":"You can trust me."}
{"episode_id":"SW - #413 - 2025-10-10 - Heidi White - The Divided Soul - Duty and Desire in Literature and Life","start":12.28,"end":59.17,"speaker":"Laura Diaz","text":"This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks at mediweight loss. I got the same medication, but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today."}
{"episode_id":"SW - #413 - 2025-10-10 - Heidi White - The Divided Soul - Duty and Desire in Literature and Life","start":59.25,"end":161.27,"speaker":"Heidi White","text":"That's mediweightloss.com Imagine a world, Jonathan, and I've you and I probably can't even imagine this. Imagine a world in which everything we want to do, we should do. And everything we should do is something completely desirable and fulfilling to us. I can't even live an hour like that here in this fallen world and. But that's what we were made for. But as the story tells us, when the monster, the serpent invades the garden, he convinces the woman. He convinces Eve to break a commandment to violate her duty. And how does he do it? By insinuations and manipulations that communicate to her that fulfilling her duty to stay away from the one forbidden tree is not going to fulfill her desires. And the scripture even tells us when she's looked after the serpent tensor, when she looks at the tree and sees that it is desirable to eat and to make one wise, it is then and only then that she decides to eat. So that fracture, that fundamental wound of the human soul, I argue in the book, is the division between duty and desire. That's when for the first time in. In their lives, what they wanted to do is different from what they ought to do. And that rupture is so traumatic, so fundamentally disintegrating to us as humans, that we keep replaying that over and over again in our own lives, psychologically and morally. And then we keep telling that story over and over again. Which is why I think every story is divided along that fracture of duty and desire."}
{"episode_id":"SW - #413 - 2025-10-10 - Heidi White - The Divided Soul - Duty and Desire in Literature and Life","start":173.03,"end":220.38,"speaker":"Jonathan Pageau","text":"This is Jonathan Pedro. Welcome to the symbolic world. So, hello, everyone. I'm here with Heidi White. Heidi is an author. She's involved in education. She's also a podcaster. She recently published a book called the Divided Soul. And I know I. She sent me the book, and I looked over, looked over it, and I thought just how in tune it was with the kind of things we talk about on this channel. Vision of the. Of the human and a powerful image of microcosm and macrocosm. And she gives these really interesting examples which I think will be helpful for people to see what she's talking about. And so, Heidi, thanks for talking to me."}
{"episode_id":"SW - #413 - 2025-10-10 - Heidi White - The Divided Soul - Duty and Desire in Literature and Life","start":220.38,"end":223.54,"speaker":"Heidi White","text":"Oh, gosh, are you kidding? This is such an honor. I'm so glad to be here."}
{"episode_id":"SW - #413 - 2025-10-10 - Heidi White - The Divided Soul - Duty and Desire in Literature and Life","start":226.03,"end":232.15,"speaker":"Jonathan Pageau","text":"So maybe tell us a bit about the basic concept of the. Of the book. What do you mean by the divided soul?"}
{"episode_id":"SW - #413 - 2025-10-10 - Heidi White - The Divided Soul - Duty and Desire in Literature and Life","start":232.15,"end":389.43,"speaker":"Heidi White","text":"Yeah, so the book came from a conversation I had with my godfather years ago. I don't actually even remember the main subject of the conversation, but somewhere along the way, he made a comment that everything in life comes down to the story of the prodigal son. And immediately I honed in on that. It felt really true. I had this sense of recognition in what he said, but I didn't know why. So I started meditating on that, contemplating that. And you're very familiar, of course, I'm sure your listeners are, with the story of the prodigal son, the loving father with two sons. And the first son asks for his inheritance and squanders it on wild living. Meanwhile, the dutiful older brother is at home doing the right thing and working in the fields. And the younger brother finds himself destitute, having squandered everything. And so he returns home repentant, and the father welcomes. Welcomes him home. But that's not the end of the story. His older brother is angry and refuses to welcome him. But the father. What's so fascinating to me, Jonathan? The father, I notice, wants only one thing for both of his sons, and that's to come to a feast. And the feast is this healing communion that reconciles these two brothers. And I loved that. And I started looking for that pattern, and I found it first in myself, right? I have both an older brother and a prodigal in me. I have a part of me that wants to seize everything I can and squander it and waste it on my appetites. And then I have this other part of me that wants always to do the right thing and be rewarded for it and have the freedom to judge everybody else for not rising to my standards. And both of these impulses are alive and active in me at all times. So I just started noticing this pattern, not only in me, but in everywhere. As you said, I'm a teacher, teacher, a literary podcaster. So I read a lot of books, a lot of stories. I think about them and talk about them. And I started seeing this everywhere, both in literature and life. And from that came my research, and from that came the book the Divided Soul. And the Divided Soul, I say in the book, is this war within us between these two competing impulses, what we ought to do, represented by the older brother, and what we want to do, represented by. By our prodigal. And then that healing communion that comes from the Father that brings these two boys together."}
{"episode_id":"SW - #413 - 2025-10-10 - Heidi White - The Divided Soul - Duty and Desire in Literature and Life","start":391.67,"end":412.47,"speaker":"Jonathan Pageau","text":"And so in the book, you kind of. You kind of talk about these two. These two opposites, and you give examples, of course, in literature, you know, maybe you can give us. To start on, maybe you can give us the sense that why we would choose one or the other in the sense that, you know, what is the appeal of following duty and what is the appeal of following desire in the first place?"}
{"episode_id":"SW - #413 - 2025-10-10 - Heidi White - The Divided Soul - Duty and Desire in Literature and Life","start":412.55,"end":495.51,"speaker":"Heidi White","text":"I love that question. I think that, and I argue in the book that true desire and true duty, as they really are and are intended to be, as they are created to be, are absolute. Like our true desire is for paradise, it's for eternal joy, it's for heaven, and our true duty is to keep Christ's commandments. But more often than not, we attach these. This question of what we ought to do and what we want to do to distortions rather than that reality. And I think we see that in the story of the prodigal son and then in many other stories. And I don't think we do it on purpose, Right? Like that older brother in the story, he really believes he's doing the right thing. And this younger brother, he may know what he's doing is wrong, but does he really know it's not going to make him happy? Right. So I think what we really want is happiness. That's what we want. We want joy. And we attach these kind of impulse towards duty and impulse towards desire to a distortion rather than to the eternal reality of it. And that's what creates chaos and suffering in our lives."}
{"episode_id":"SW - #413 - 2025-10-10 - Heidi White - The Divided Soul - Duty and Desire in Literature and Life","start":499.64,"end":573.79,"speaker":"Jonathan Pageau","text":"And I mean, because there are some. How can I say this? So in your book, you talk about, for example, Virgil's Aeneas, you talk about Aeneas in Some ways as the one that chooses duty over at least his desire. And in the poem he's presented as this is in fact the greatest, the greater good that the fact that he, that he chooses the duty to be the founder of Rome rather than to settle, you know, in a possibly a loving relationship or to settle before reaching that, that goal. You know, this is something seen as positive in the poem. And so how do you see this? How do you see. And then right now, our society right now focuses on the opposite. That is that we have this sense that you have to always that you're following your desire, following your bliss, expressing your desires in sometimes in the most idiosyncratic way is the path towards authenticity and the path towards, towards happiness. And so maybe you can paint a little bit, for example, like I said, why, why, why do we see that and why is it not a path towards happiness? Like why is neither of those the way to happiness?"}
{"episode_id":"SW - #413 - 2025-10-10 - Heidi White - The Divided Soul - Duty and Desire in Literature and Life","start":573.79,"end":840.63,"speaker":"Heidi White","text":"Right? Yeah, I, I used to think that. I used to kind of, you know, at the beginning of my writing and research on this topic, I kind of thought that I used it almost like a personality test, which sounds kind of dumb, but in my mind I was thinking, you know, some of us are duty driven people and some of us are desire driven people and we make most of our mistakes in life because of this or that or whatever. And I still think that it's true that most of us, because of some combination of nature, nurture, kind of favor one over the other and maybe some of its time of life, right? Like I'm a middle aged woman, all I do is duty all the time. When I was young, I tend to made more like prodigal desire driven mistakes. Right now I'm a little bit more prone, especially as a mother and a teacher. Like I want people to keep in line, right? And I've seen enough consequences that I'm afraid of them now. And so I still think that, that there's kind of a privilege so to speak, within us to kind of gravitate towards one distortion over the other. But duty and desire are intended to be unified like they are brothers, they belong together and actually they both want the same thing. So I think that the division between them is absolutely fundamental. This isn't just some kind of psychological, you know, theory or literary interpretation theory that putting forward to look smart or try to make a point. But I think that this is fundamental to the human psyche. And one of the stories that we have, the fundamental, the first story that we have in history lays this bare, I think. And that's the story of Adam and Eve in the Garden of Eden. We're told in the scriptures that God put Adam and Eve in a garden of delights to meet their every desire, right? He gives them. He gives the food to eat, tree. Eat of any tree that you desire that looks good to you and that you long for and hunger for. Also be fruitful and multiply and fill the earth and then take dominion over the entire created order. Like these aren't just permissions. These are commands that God gave Adam and Eve as we're told in the story. So what we see there is that there's this unity of duty and desire. Their duty is to keep these commandments. And the commandments are given to them as wholly desirable to their. To their humanity. So we were made. Paradise is the unity of the two. Imagine a world, Jonathan. And you and I probably can't even imagine this. Imagine a world in which everything we want to do, we should do. And everything we should do is something completely desirable and fulfilling to us. I can't even live an hour like that here in this fallen world. But that's what we were made for. But as the story tells us, when the monster, the serpent, invades the garden, he convinces the woman, he convinces Eve to break a commandment to violate her duty. And how does he do it? By insinuations and manipulations that communicate to her that fulfilling her duty to stay away from the one forbidden tree is not going to fulfill her desires. And the scripture even tells us when she's looked after the serpent tensor, when she looks at the tree and sees that it is desirable to eat and to make one wise, it is then and only then that she decides to eat. So that fracture, that fundamental wound of the human soul, I argue in the book, is the division between duty and desire. That's when, for the first time in their lives, what they wanted to do is different from what they ought to do. And that rupture is so traumatic, so fundamentally disintegrating to us as humans, that we keep replaying that over and over again in our own lives, psychologically and morally. And then we keep telling that story over and over again, which is why I think every story is divided along that fracture of duty and desire."}
{"episode_id":"SW - #413 - 2025-10-10 - Heidi White - The Divided Soul - Duty and Desire in Literature and Life","start":843.59,"end":911.96,"speaker":"Jonathan Pageau","text":"So in your. Let's say, in your own experience or when you read the literature, the stories, you know, why. Why do we perceive, for example, duty as a opponent to desire? Why is it that we. We see the competition right in our everyday experience? Because I agree with you, obviously. I think that when you when I kind of looked through the book, I agreed with the basic concept right away, which is if you think of duty as an organizing principle, you know, just think about it that way, or a purpose, you know, and then desire as a motor, as in some ways the thing that makes you move, then you obviously are always moving towards a purpose, right? Even when you follow your morals, your whims, you're always kind of moving towards a kind of purpose. It's just that some of these purposes are better ordered than others, are better organized than others, you know. And so I mean, is it the time scale, is it like the incapacity to see the whole, the forest for the trees? What do you think is the, is the obstacle to join those together?"}
{"episode_id":"SW - #413 - 2025-10-10 - Heidi White - The Divided Soul - Duty and Desire in Literature and Life","start":912.04,"end":1116.51,"speaker":"Heidi White","text":"I mean, I think it has to be a spiritual blindness within us, right? That this chasm between this sense of if I restrain my appetites, then I will not be happy if I fulfill the duty. Say, you know, let's pick some low hanging fruit here. If I were to. Let's talk about marriage. Like marriage is the ultimate union of duty and desire, or it should be, right? When I marry my husband, I forsook all others. I say to him, like, my desire is for you and my duty is to you. And five minutes before the sacrament of marriage, there are things we cannot, that are our duty to abstain from that five minutes upon the sacrament, it is now my duty to yield up to him, right? And that's a mystery that, that's a beautiful part of our human experience. And let's say, you know, five, ten years into marriage, I decide I don't want care about that duty anymore. And this happens all the time. Adultery is a profound violation of duty because we have this sense that if I were to keep it, I can no longer have what I want, right? I want to feel something. I want, I want, I'm tired of this duty and I want to just jettison it in order to fulfill my desires. So whenever we have this a perception, a flawed perception, I think it's spiritual blindness every time. Whatever we perceive that to do our duty will keep us from our desire or to pursue desire is a better thing than to fulfill duty. Whenever there's that chasm between them and we choose one or the other, we wound our souls and we create that same primal division that that Adam and Eve created for themselves in the Garden of Eden. And I think it's just as true on either side. There's a, there's a verse in, I think it's first Timothy that says the sins of some go before them, and the sins of others trail behind them. And it seems to me that those prodigal sins tend to be the ones that go before us, right? Alcoholism, adultery, some of those things that are just about, like, appetites, the. Either the lust of the flesh or the lust of the eyes, that those are the prodigal sins, the sins of desire. But the sins of duty can be equally destructive, sometimes even more so. Pride and envy and that sense of being better. I mean, you know that within our tradition, we are like, we're always talking about repentance, right? It's only the prideful that won't see heaven. And that pride tends to be the sin of the older brother, the sin of duty. Like, I am better than others, and I will live like that, and I will cast judgment. And those are sins that are violations of duty. And so we reap equal destruction in our life from each side. And I do think to your question, it comes down to that flawed perception, the clouding of the inner heart, the inner eye of the mind that cannot see that true duty and true desire will bring us the only thing we truly long for, which is joy."}
{"episode_id":"SW - #413 - 2025-10-10 - Heidi White - The Divided Soul - Duty and Desire in Literature and Life","start":1119.37,"end":1309.33,"speaker":"Jonathan Pageau","text":"Yeah, A lot of things came in my mind when you were talking. I was thinking about my favorite quote from Saint Maximus. People have heard me quote it over and over, which he talks about sins of the right hand and the sins of the left hand. You know, he has this idea that, in fact, we. We actually the first. Often as Christians, especially as spiritual people, our first temptation is to give in to the sins of the right hand, which are exactly the ones you said, like presumption and arrogance and pride. All of these kind of sins of solid and a feeling of being proper and of being right and rightly ordered. But he says that when we give in to those sins, it actually opens up the door to the other sins, right, to the sins of desire. Because we in some ways have a false confidence about who we are and where we stand. And then suddenly we get sideswiped. And you get those stories, like the stories of the fallen pastors and the stories of the adulterous pastors and the kind of the priests that do all kinds of crazy stuff. Like, you can see that that's the exact pattern is that just at the moment when they think that they're gurus, that they're fathers and that they're in charge, then all of a sudden, you know, they're not attentive to how or it's. Or they feel. They. Suddenly people feel like their desires are kind of aligned with their duty or that their desires are given, you know, the fact that they're so dutiful that they're allowed in some ways these kinds of. These kinds of transgressions or something. I don't know how. How to phrase it, but. But there definitely is something, Something true about that. Yeah. And the one thing I wanted to say too is the way that I see it and when I think. When I think about what you. What you're talking about is there's a sense in which the. When we, when we give in to our desires, you know, we. We are in some ways moving towards a. Towards a direction because all our desires are meant to be directed towards a good. Right. That's the reason that they exist. And when we give in to them in their own. Let's say in their own world, then they're. They're directed in all kinds of ways. And so we can see that they just don't lead towards that. That. That good. Right. And sexuality, obviously you mentioned it, is the. Is the easiest one to. To see in a marriage. If you commit adultery, you'. Not just your marriage at risk, but your entire family, your. Your children, your relationship with your parents, your relationship with, like everything is kind of put into chaos if you. If you don't order that desire towards. Towards a higher purpose. And so, and so there is a sense in which, you know, when you say that duty and desire are meant to be united, I think this is. It's not just something that happens. You could say at some point, let's say in Christ, because I think that's definitely what you mentioned in the book, but that it really was at the outset the way. It's actually the shape of the world. It's the way that desire. It's what desire is for, is in some ways to move towards duty. You could think about it that way."}
{"episode_id":"SW - #413 - 2025-10-10 - Heidi White - The Divided Soul - Duty and Desire in Literature and Life","start":1309.33,"end":1439.16,"speaker":"Heidi White","text":"Yeah. And to move us towards heaven, right? Like what? And to grant us happiness here on earth. Like desire in itself, the experience of desire is not pleasurable but painful. Right. It is. When we want something, it means that there's kind of this endless distance between the fulfillment of it and the want of it. And so desire itself pricks us. It won't leave us alone until it is fulfilled. And I think for that reason it's dangerous and people are afraid of it or can be afraid of it or attach it to fallen distortions rather than eternal realities. And C.S. lewis, one of my favorite authors, I dedicate the book to him because he is like this prophet of Desire, Right. And he talks about this so compellingly in so much of his fiction and nonfiction that desire is given to us in order to motivate us to seek for the good of our own soul. And I love what you just said about the shape of the world. And it makes me think of the church fathers who spoke of the love of God with erotic language like that. They use the language of Eros, right? That's this, the divine longing to be united with God, the ultimate lover of our soul. And they saw the Song of Songs in the Old Testament as being this profound allegory, a spiritual allegory. Just as a man longs for his wife or a bride longs for her husband, so the soul longs to be united to God. And if we do not have that, how much we miss as humans. But it does need to be directed to its proper object. And the only way it can be directed to its proper object is through principles, commandments, laws, duties. And so duty forms this kind of. This orienting of the longing of the soul towards the proper object, which is why they belong together."}
{"episode_id":"SW - #413 - 2025-10-10 - Heidi White - The Divided Soul - Duty and Desire in Literature and Life","start":1440.68,"end":1563.18,"speaker":"Jonathan Pageau","text":"Yeah. And we can see, I mean, this isn't abstract. It's really something that you can experience easily at smart small scales. Right. It's hard to experience them with the soul and God. But, you know, anything, any discipline that you get into, let's say you want to learn to paint or you want to learn to make art. You know, you have these. You know, you have this capacity, this potential, you have these drives to make it. But in order to reach, you have to order, right? Your desires and your capacities, or else you're not going to be able to make something beautiful. The same goes for a sport or any kind of. Or like, let's say someone wants to learn to become a ballet dancer. A young girl wants to be a ballet dancer. She has this desire to dance, you know, this strong desire to dance. But to get there is actually very frustrating and annoying. And practice, you know, and all of these steps that you have to do that are very frustrating and look like, in fact, you're actually stifling the very reason why you were engaged in the first place. But then once you push through, once you kind of get through, then you become a master, and you have a kind of freedom in that desire that. That you. That you realize you didn't have at the outset. And that the way that we talk about freedom of desire in the, you know, in the kind of post World War II sexual revolution type of thinking is a. Is a deep mistake, because by not disciplining our desires. We end up inverting the relationship, and then we become slaves of. Of our desires. We become. We become tyrannized by, you know, these idiosyncratic moment. We actually move from moment to moment of des. You know, uniting it together towards something that gives you true and proper joy in that desire. So, you know, I think. Think, you know, thinking about this and talking about this is very important, especially for, you know, our young people that are. That are so drowning in the narrative of, you know, do whatever you feel like. And, you know, your desires are you are your desires, that kind of thinking."}
{"episode_id":"SW - #413 - 2025-10-10 - Heidi White - The Divided Soul - Duty and Desire in Literature and Life","start":1563.18,"end":1709.96,"speaker":"Heidi White","text":"I completely agree with this. And, you know, I've got teenagers at home, and I teach teenagers every day of my life, and I love them, but it's such a. It's. It's such season of desire. And it feels. I mean, I remember being young. Not anymore, but I remember it. And I remember that sense of like, it felt as though duty would stifle that in me. And I remember a priest saying many years ago, when my children were very small, saying, in a parenting group at church, saying something like, if you want your children to be chaste, put them in piano lessons. Which is a lot like what you just said, right? And I loved that so much like that it is. Piano lessons train the habits to the fulfillment of duty in the mundane and ordinary things in order to create something beautiful, something bigger. Right? To be able to play a sonata by Mozart. Right. Is something to be able to train yourself to do that, to create that kind of beauty, that kind of transcendent connection with cosmic harmony. Right? Is it begins with doing your scales when you're seven years old and sticking to it and sitting at the piano. And so there's just this intrinsic connection between the dutiful life and transcendent beauty and fulfillment that is, as you said, not abstract. It's embodied. It's our daily life. You mentioned Saint Maximos, and right now I'm reading Saint Gregory of Palmas, who says pretty much exactly what you just said, which is, if you want to conquer the passions, then you must conquer your stomach, right? You have to learn to eat a little bit less, because it is when we fill ourselves so full of fill our flesh, then it becomes easier to give in to the bigger passions and become enslaved by them. Which is why the church has always prescribed feasting and fasting as part of our spiritual discipline, because it matters. The little choices that we make in fulfilling fulfilling the duties of our lives, that is what creates this kind of framework or Scaffolding to the bigger temptations and the bigger joys."}
{"episode_id":"SW - #413 - 2025-10-10 - Heidi White - The Divided Soul - Duty and Desire in Literature and Life","start":1712.84,"end":1750.74,"speaker":"Jonathan Pageau","text":"So one of the things you do in the book is you kind of take us through these different aspects, you know, the aspect of duty, the aspect of desire, and then the kind of reconciliation of these two senses and, and maybe tell a little bit people. Because you, you don't just do it abstractly, you kind of do it through literature and through fiction and then obvious bible stories. And so maybe give us a few images of the characters you see as representing the, the duty side, the desire side, and few hints. If you have some images of people that you know, obviously we know Christ does it, but there are other people that you can see that, that can exemplify that reconciliation."}
{"episode_id":"SW - #413 - 2025-10-10 - Heidi White - The Divided Soul - Duty and Desire in Literature and Life","start":1750.74,"end":2038.69,"speaker":"Heidi White","text":"Right, so let me start with something from pop culture that's just not in the book. But yeah, which I'm happy to talk about, about examples that I give in the book. But if I'm talking about this kind of with, with people that I think don't, don't read as much as I do. Right. Because this is my entire life. Read books, write books, talk about books. But an example from pop culture might come from the Marvel universe, right? We've got your two main. The two main heroes in the Marvel franchise are Iron man and Captain America. So Iron man is your very desire driven hero, right? He has everything. You meet him, he's got, well, you know, he's got money, he's got swagger, he's handsome, he's got women and cars and he's super smart. So he's successful. He's like everything that, you know the world, he's this worldly icon of success, right? But there's something wrong about him. And we intrinsically audiences, we intrinsically know there's something wrong here. There's some essential quality of heroism that is missing from Tony Stark and that is that he can never restrain himself. Right? And the trajectory of heroic development for Tony Stark and for others like him, the trajectory of development for the hero's journey, of the desire driven protagonist is to learn to do his duty. He has to do the right thing. And in order to do that, he has to learn to repress himself, to restrain himself. So, you know, in the first Iron movie goes, he gets captured and then he has to go through this like training and, and he has to learn to respond to a mentor, right? It's just this classic hero's journey that we intrinsically recognize, we find it satisfying, but we don't recognize him as a hero until he's tested and he has to put that training into practice. And then, only then by the end of the movie, we're like, oh, yeah, now he's a hero. And we don't do this consciously. It's just, just. We just recognize it, right? It's so fundamental, it's so innate. We just know that. And it's predictable, but it's predictable in a very satisfying way. Now let's talk then about Captain America, who's your very typical duty driven hero. We're not worried. From the very beginning, we know that Captain America is going to do the right thing. Like he just always does the right thing. He doesn't even want to lie about his age when he's going into war. He just wants to. We know that. But for him, what we need to see, this is the sad part, right? Because this is what happens to a duty driven protagonist is they always lose something that they want, right? And it's usually the girl. And that's exactly what happens to Captain America. We know he's gonna do the right thing. That's like not even interesting to us. We just recognize that. But the thing that happens to him is that he loses the thing he wants. And a million movies later, vi, you know, I don't even know how many, by the time we get to the end, the only satisfying ending for him is that he has to have her back. And when they're finally reconciled, then and only then do we recognize, do we have that sense of this satisfying character arc and plot arc. Then we can rest because we know that this dutiful man is reconciled with his desire, whereas with Tony Stark, he has to be reconciled with his duty. So if we look for that pattern, I started looking for that pattern. And it's everywhere. It's not just, just in the Marvel movies. It's not just in Star Wars. It's not just Harry Potter, right? It's everywhere. So you see that in Hamlet, right? In Shakespeare's Hamlet, we have a very duty driven hero. In fact, the whole conflict of that entire play is he doesn't know the right thing to do. Should he kill Claudius or should he not, right? And there's no transcendent voice of good to tell him what to do. And because he doesn't know that, he freezes and then the play ends in tragedy. On the other hand, we have Macbeth, who I write about in the book. He's a very desire driven protagonist. And the tragedy of his life is that he never does the right thing, even though he's given the opportunity to over and over and over again. And so in both cases, we have a stage littered with dead bodies, but we have it because of those kind of different impulses within these two characters. One desire driven, one duty driven. So that, that if you look for that character arc, you're gonna see it in every story, including our own."}
{"episode_id":"SW - #413 - 2025-10-10 - Heidi White - The Divided Soul - Duty and Desire in Literature and Life","start":2038.69,"end":2092.68,"speaker":"Jonathan Pageau","text":"I mean, I think the examples you give are very, are very convincing, especially for, I think, for most people that aren't well read. I think the Marvel example is perfect because you actually, like you said, you actually see the crossover, the two characters starting in one place and then basically flipping. And then at the end, Tony Stark gives this life and sacrifices his happy life. And then the opposite happens with Captain America. It is infinite fact. Exactly what you're saying. And so are there characters that you see. I mean, in some ways you see that in that, that full arc, you kind of see the balance coming out where in some ways you, you, you are satisfied because you see the, the character that has more of one side ultimately be reconciled with the other side. So you already have given us examples of, of characters in some ways that, that reconcile. But then how is it that you see the Christ does this?"}
{"episode_id":"SW - #413 - 2025-10-10 - Heidi White - The Divided Soul - Duty and Desire in Literature and Life","start":2093.24,"end":2339.42,"speaker":"Heidi White","text":"Yeah, through the cross, right. Which is the dividing line of every single story. There is always, every satisfying story always has a moment of self emptying, of sacrifice, of death and resurrection. It is, as you said, the shape of the world. It's the pattern of the cosmos. This is why stories are satisfying to us, is because we're waiting, we're looking. A story begins with a created world, a created order. And then once as a reader or a beholder of the story, we understand what that created order is, then there's some kind of disruption to that order. Right? And it could be like Sauron is looking for the ring. There's a disruption for you. Or it could be something a little bit more mundane. Like Mr. Bingley moved into the. Moved into Netherfield, right? There's a little disruption of the order of the story. And something has to happen because of it. Because everybody knows that a man of considerable fortune is always in want of a wife, right? So once there's kind of this disruption to the story, then because we, our souls seek for harmony, our perceptive faculties are always desire harmony. And so we need, then we're invested in the story at that point. We need that to be resolved. And so then some kind of conflict happens in the main characters that has to be resolved through a moment of repentance or sacrifice. And that repentance and sacrifice, you know, it's Lizzie Bennet walking in the garden with Lady Catherine de Bourgh and finally defending Darcy. Right? There's her moment of repentance, or reading the letter that Darcy writes when realizing she was wrong. This duty driven soul who always thinks she's right, right? But she has to come face to face with that, her perception. She is blind and she doesn't know what she really wants and she's not yet worthy of it. Right? The same thing happens for Darcy and this is why Pride and Prejudice is such an enduring story. We read it and it's like it's so simple. Why does this work? But it's because it's the shape of the world. And so you asked how Christ, you wanted to talk about how Christ does it, right? He does it through love, through sacrificial love and the laying down of his life. And then he invites us to participate in that. That is how we are known to be Christians, says St. John the Theologian. They will know we are Christians by our love, which means our willingness to die. That's the, that's how we know what love is. And sometimes that happens literally in stories. Harry Potter literally goes into the forest and dies for the life of the world. And then after that, none of the curses of the Death Eaters can stick on any of the people they're attacking because they're protected by that charm of love, of sacrificial love. It's such a Christlike story. And, and that happens, of course, through Lizzie Bennet and Mr. Darcy getting married at the end. Right. And her getting 10,000 a year, which is not mercenary, but simply a vision of heaven. Like the more we get, more than we deserve. And Christ models that for us first. And then we participate in that through our own conversions and our own humility and repentance. And then we recreate it in every satisfying story that's ever been written or told in the history of the world. And that's all the more compelling because so many people don't know that that's the story they're telling. So many authors don't know, like, they don't know that they're telling this cosmic redemption story over and over and over again. Because it's the only satisfying story."}
{"episode_id":"SW - #413 - 2025-10-10 - Heidi White - The Divided Soul - Duty and Desire in Literature and Life","start":2342.86,"end":2437.15,"speaker":"Jonathan Pageau","text":"Yeah, it's, it's interesting because one of my problems, my problems, one of my problems with the story of Christ is that it always slips between my fingers, right? And, and so, you know, when you describe the characters in the book, like when you describe the duty characters and the desiring characters and you know, and Even now, when you described the Marvel Universe, it's like, it's. So it's simple, actually. And Jesus's story is just. Because if I take your pattern, I see it crashing. But maybe that's what Jesus does all the time, right? Jesus is always doing that. Because when he's in the garden, he expresses that he does not want this. He expresses that he does not want the cup. And therefore he in some ways seems to completely accept duty. He says, not my will, basically, but your will. But there are other versions, like other ways that we describe the crucifixion in which we talk about it in the. Passionate. I mean, we use the word passion, right? We use the word passion in the sense. We use the word of a. Of a. Of a fully giving yourself, you know, in a. In a kind of ecstatic giving, you know. But it's a. Painful. It's not. It's not a. But then desire is."}
{"episode_id":"SW - #413 - 2025-10-10 - Heidi White - The Divided Soul - Duty and Desire in Literature and Life","start":2437.23,"end":2437.83,"speaker":"Heidi White","text":"How I say."}
{"episode_id":"SW - #413 - 2025-10-10 - Heidi White - The Divided Soul - Duty and Desire in Literature and Life","start":2437.83,"end":2506.7,"speaker":"Jonathan Pageau","text":"Desire is painful too. Desire is not. Desire is pretty much the equivalent of pain. And so. And so. So when I. When I tried to keep. When I tried to capture the whole story in my mind, it doesn't hold. Like, it doesn't. It just keeps slipping because I'm like. Well, you know, because we, for example, like, you know, even in the Orthodox tradition, we have this insane moment during the. During the. During Holy Week, you know, where we put up the icon of Christ being tortured and we say. And we put it up for bridegroom matins where we describe the relationship between the bride and the bridegroom, and we sing of this. This kind of call and response between the lover, between the lovers. But we're basically at the moment where Christ is being tortured, you know, and heading towards the cross. And it's like, it just. It hurts. Like, it hurts to try to. To try to capture it. So I don't know, maybe you can help me elucidate it because. Because I can see it, but I don't see it completely because when I. When I grab a thread, then another thread unravels and I try to hold them all, and I can't seem to hold them all together."}
{"episode_id":"SW - #413 - 2025-10-10 - Heidi White - The Divided Soul - Duty and Desire in Literature and Life","start":2506.78,"end":2722.81,"speaker":"Heidi White","text":"Yeah, I don't know that I can hold them together either, because it's a mystery. Like Christ, I got thinking right now of this Sermon on the Mount when he says, not one jot, not one iata of the law will be lost. He's not come to abolish it, but to fulfill it. But in order to fulfill it, he completely subverts it, right? And. And there's that paradox that is not an intellectual. It is an intellectual paradox, but to your point, it's so existential as well. And one of the things that I had to do to make this book come alive is talk about my own life in it. And it's funny, I wrote about half the book, and it was like drudgery. It was so hard. I was just pushing through, putting it, doing my duty thing right. Writing my, you know, thinking about Hemingway, typing on the, you know, typewriter and bleeding and just like, killing my darlings and all the things right that you do when you're writing as. You know, And. And. But there was no life in it. I just felt like I was writing a really long essay and I was like, why would Amy read this book? It's so boring. And. And I. I came to this realization that it really didn't have life in it because I wasn't in it. My own tormented story. Those two hands that can't. My right hand and my left hand that are divided from each other, that I'm trying to understand something that is so mysterious. I'm trying to make this case for something that is a mystery and in my life. And, you know, I'm thinking of Flannery o' Connor saying, the fiction writer, which I'm not writing fiction, I hope, but that God have mercy, maybe someday I'll be good enough to write fiction. But this book, I hope, isn't fiction. I was. But Flannery o' Connor says, like, if you have a proposition, don't write faith fiction. If you fully understand something, it can't be a story because otherwise we wouldn't have any. Like, we. We should just tell one story and be done right. Like, there's, like. Stories are supposed to be mysterious, and that's why they exist. It's because they're so elusive. There's something that we're trying to say. There's something that we're trying to contemplate or look at that eludes our comprehension. Shakespeare says there's such a difference between Midsummer Night's Dream, between apprehension and comprehension. And in this book, I think I'm trying to apprehend something, not comprehend it. Because, as you're saying, the life of Christ both fulfills and subverts every proposition and every law that's ever been. And that feels true to me, which is why I had to tell some of my own story. Because. Because it's messy, and there's a lot that I still don't know what to make of. And I'm Just one person that's insignificant except to myself and to God. Right. And that is part of the human condition. And that's why books are worth writing, but that's why they can't say everything."}
{"episode_id":"SW - #413 - 2025-10-10 - Heidi White - The Divided Soul - Duty and Desire in Literature and Life","start":2726.01,"end":2738.34,"speaker":"Jonathan Pageau","text":"And so if there is. Is something, like if you could. If you could bring it together, you know, what is that you're hoping the book will do? Like, what is it you're hoping the people will get from it?"}
{"episode_id":"SW - #413 - 2025-10-10 - Heidi White - The Divided Soul - Duty and Desire in Literature and Life","start":2738.34,"end":2792.61,"speaker":"Heidi White","text":"Yeah, I feel like for me, it's pretty easy. I just try to say something. I'm seeing my vocation as a teacher, podcaster, writer. All of it really is because I'm so overwhelmed by mystery all the time. And. But I also believe that there's something true. So I feel kind of stuck. Right. Or strained in between. Like my grasping towards the transcendent truth. I want to be transfigured into it. Right. I long for heaven, like the eschatological hope. This world is a comedy, not a tragedy. It's moving towards a desirable end. And the only question is, which side am I going to be on at that point? Right. And."}
{"episode_id":"SW - #413 - 2025-10-10 - Heidi White - The Divided Soul - Duty and Desire in Literature and Life","start":2794.37,"end":2794.77,"speaker":"Jonathan Pageau","text":"That."}
{"episode_id":"SW - #413 - 2025-10-10 - Heidi White - The Divided Soul - Duty and Desire in Literature and Life","start":2796.21,"end":2829.9,"speaker":"Heidi White","text":"So I'm constantly reaching towards that. But at the same time, I don't live in transcendence yet. I live in the imminent. And I'm confused all the time. So the book and all of my vocation is just an attempt be like, look at this. Like, hold out my hands, my two hands with something in it that I think is worth looking at and just say, like, look at this with me. So the thing that I want is immense. It's just for people to look at it with me and say what they think, like, join a conversation, open a conversation."}
{"episode_id":"SW - #413 - 2025-10-10 - Heidi White - The Divided Soul - Duty and Desire in Literature and Life","start":2832.06,"end":2840.14,"speaker":"Jonathan Pageau","text":"So where can people find what you're doing? I mean, obviously the book, but also your podcast, tell us where to go find your. Your, your. Your discussions."}
{"episode_id":"SW - #413 - 2025-10-10 - Heidi White - The Divided Soul - Duty and Desire in Literature and Life","start":2840.14,"end":2898.1,"speaker":"Heidi White","text":"Yeah, so we're, we're. We're not on. My book's not on Amazon. You can get it through the publisher@goldberrypress.com we're trying not to. We're trying to stay out of the machine as best as we can. And the. But you can listen to my podcast, Close Reads, you can go. That's wherever you get podcast pod files, you know, itunes, whatever. Wherever you get podcasts, you can find Close Reads. And it's me and two other people and we. Two other guys and we just sit and talk about books over. It's like a book club and we have a really active social media presence and we do retreats and things like that and just basically do what you and I are doing right now and then you can follow me at heidiwhitereads at Instagram and I'm always posting and talking about these things cause I just, I. I just want. Like I just said, I just want to talk about it with people."}
{"episode_id":"SW - #413 - 2025-10-10 - Heidi White - The Divided Soul - Duty and Desire in Literature and Life","start":2898.82,"end":2911.38,"speaker":"Jonathan Pageau","text":"Well that's great because I think that I'm set to be on the Close Reads podcast as well and so we will be discussing again very soon. And so thanks for your time. It was great to meet you and I'm definitely looking forward to our next conversation."}
{"episode_id":"SW - #413 - 2025-10-10 - Heidi White - The Divided Soul - Duty and Desire in Literature and Life","start":2911.38,"end":2913.62,"speaker":"Heidi White","text":"Yeah, thanks Jonathan. Me too. Thanks for having me."}
{"episode_id":"SW - #413 - 2025-10-10 - Heidi White - The Divided Soul - Duty and Desire in Literature and Life","start":2914.02,"end":2929.02,"speaker":"Jonathan Pageau","text":"If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support with what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase. So go to the symbolicworld.com and thank you for your support."}
{"episode_id":"SW - #413 - 2025-10-10 - Heidi White - The Divided Soul - Duty and Desire in Literature and Life","start":2930.06,"end":2989.4,"speaker":"Laura Diaz","text":"Tucson the Weight is Over Mediweight Loss. They're officially open on North Oracle Road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project. Ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost the same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better, and lose weight the right way, mediweightloss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today."}
{"episode_id":"SW - #413 - 2025-10-10 - Heidi White - The Divided Soul - Duty and Desire in Literature and Life","start":2989.4,"end":2996.19,"speaker":"Heidi White","text":"That's mediweightloss.com we're chatting with our guest. Always safety first 811 megaphone man call."}
{"episode_id":"SW - #413 - 2025-10-10 - Heidi White - The Divided Soul - Duty and Desire in Literature and Life","start":2996.31,"end":2997.88,"speaker":"Jonathan Pageau","text":"811 before you dig."}
{"episode_id":"SW - #413 - 2025-10-10 - Heidi White - The Divided Soul - Duty and Desire in Literature and Life","start":2998.76,"end":3016.42,"speaker":"Heidi White","text":"You never stray from your mission of letting homeowners, landscapers and excavators know you should always call 811 before before you dig. Call 81 1. Call for both small and big jobs and two working days in advance. 811 any parting words? And I'm guessing they will be call."}
{"episode_id":"SW - #413 - 2025-10-10 - Heidi White - The Divided Soul - Duty and Desire in Literature and Life","start":3016.42,"end":3017.9,"speaker":"Jonathan Pageau","text":"811 before you dig."}
{"episode_id":"SW - #413 - 2025-10-10 - Heidi White - The Divided Soul - Duty and Desire in Literature and Life","start":3018.46,"end":3021.26,"speaker":"Heidi White","text":"Brought to you by Southwest Gas 81 1."}
