{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":0.16,"end":41.98,"speaker":"Jonathan Pageau","text":"The reason why I think it's important is because I also want to recapture, like, the little old lady, like, very simple person who says, God will take care of me. Because that's in that mode. It's like, I actually don't know what's going to happen. I don't know what's going to happen, but I have an orientation, something like, I know that God wants the best of me. And the thing is that that might mean that you're going to get dragged in the street and you're gonna get killed and, like, all these horrible things are gonna happen to you. But that mode of anticipation is the best mode to stand in in order to face whatever horrible thing the future has in front of you."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":41.98,"end":42.26,"speaker":"John Vervaeke","text":"Right."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":42.26,"end":43.82,"speaker":"Jonathan Pageau","text":"And it's right. And it's not predictive."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":43.82,"end":44.26,"speaker":"John Vervaeke","text":"That's right."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":44.26,"end":66.8,"speaker":"Jonathan Pageau","text":"It's not at all predictive. It's just a stance which is like, all that is given will be taken as the grace. This is Jonathan Peugeot. Welcome to the symbolic world."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":77.36,"end":119.75,"speaker":"Moderator","text":"Hello, everybody. I'm glad you made it. From the night Nobody got left on the wayside. This is wonderful. So we're gonna kick off the morning with Jonathan Pigeau, John Vervaeke, having a dialogue, hopefully leading to Dialogos. And I hope that we can just take a minute and sort of put the other things that have been on our minds off to the side and focus on the conversation and try to engage in a way where the questions that you can put in will move the conversation forward and we can all participate in the dialog as much as possible. So I hope you enjoy and welcome to the stage."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":124.95,"end":133.11,"speaker":"Jonathan Pageau","text":"How do we do this? Is there a structure? Probably not. Usually in the YouTube situation, there's one person in charge because it's their channel."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":133.11,"end":133.55,"speaker":"John Vervaeke","text":"Yeah."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":133.55,"end":136.07,"speaker":"Jonathan Pageau","text":"So it's like you kind of know who's in charge of what."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":137.67,"end":137.99,"speaker":"John Vervaeke","text":"Yeah."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":137.99,"end":139.83,"speaker":"Jonathan Pageau","text":"There's always this at least implicit."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":147.68,"end":149.04,"speaker":"John Vervaeke","text":"You see, we're from Canada."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":149.36,"end":156.48,"speaker":"Jonathan Pageau","text":"That's right, yeah."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":158.48,"end":270.05,"speaker":"John Vervaeke","text":"So there was a question I mentioned to you and Paul, and perhaps we can start there. But you don't have to stay there. We won't stay there. So I picked up on your theme of sacrifice, letting go, a kind of death, as being very, very central to coming into right relationship with reality. Is that a fair thesis? At least one part, yeah. Good. And then I took it and I took it into a particular state of orientation. If you maintain the orientation you have towards all the beings or all the creatures, if you want to use more biblical language. Right. That's not the right. Or that's not the Right stance to be in relationship with being or the ground of being, ultimate reality, whatever. God. That's fair enough, I think. And you can't use a thing to think to come into right relationship with no thingness. And I thought that thesis was reasonably derivable from your thesis. And I think you find. I'm not claiming their equivalents because I don't want to step on doctrinal toes, but there's significant similarities between theosis and other states like that and other traditions, and you've acknowledged that in the past. So I don't think that's a point where we get stuck or anything. But then it came to me that that point is in tension. And I hope it's tonos and not just tension with something we were also apparently all agreeing on, which is the need for a significant revival reinventio of ritual and symbol. And yet ritual and symbol seem to bind us to creatures, to things, to particulars. And then there seems to be a tremendous tension, at least initially. Is that fair?"}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":270.21,"end":292.08,"speaker":"Jonathan Pageau","text":"Oh, no, I think it's fair. I think that. Let me toss something in so we can kind of have a few things going on. One of the things that I was thinking about yesterday, when we were thinking about the question of the origin, the past and the future, and the notion of how we exist between the two."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":292.24,"end":292.72,"speaker":"John Vervaeke","text":"Yes."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":292.88,"end":315.16,"speaker":"Jonathan Pageau","text":"And I started realizing. Because St. Maximus talks about the logos as both the origin and the telos, the alpha and the omega, the beginning and the end. And I started to realize that, let's say if you think about that image you have of the campfire and they go out when they leave the campfire, they're both remembering the past and the future."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":315.4,"end":315.84,"speaker":"John Vervaeke","text":"Yes."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":315.84,"end":389.16,"speaker":"Jonathan Pageau","text":"Right. So the idea that you can remember the future is very. It's very important because you do that every time you're doing any task. Right. If you're. If you're building something, you're remembering the future, you're always remembering what the telos is. But that telos is the reason why you're doing the thing in the first place. And so the reason why I bring that up is, of course, it reflects on the choices that I made in trying to reawaken the kind of, let's say, a more integrated vision of the world is that I don't think we can do it. Reinvent. Like, I really don't think we can reinvent. In some ways, our origin is given to us. It comes, like I mentioned that yesterday, it comes down from heaven. That sounds like a weird thing to say, but it. We're given an origin, there are moments that people participate in origin moments. But you can't. It's a kairos. Right? You can't make that up. You know, things just happen. To be in this right place at the right time with the right people, and then it's almost as you're doing it, you realize that now there's an origin of something happening."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":390.92,"end":391.12,"speaker":"John Vervaeke","text":"Yeah."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":391.12,"end":482.74,"speaker":"Jonathan Pageau","text":"And so because of that, I tend to go back to. This is something that my brother developed, by the way, if everybody probably knows about him. But I want to acknowledge that this idea came from him. He uses the trope of promised land and exile as a structure to understand the bigger meaning crisis that there seems to be in the Bible a structure which is the place where you find your home, your identity and communion, and then a place where that breaks and all of a sudden things don't make sense. You're in the land of the foreigner, it's foreign gods, you know, you can't have cohesion. And what he does is he applies that to the whole problem. So the scientific development, the scientific revolution, the Enlightenment, scientism. And that thinking is in some ways a. It's a moment of exile. But that. So it's part of the bigger patterns. Like in some ways, I don't think. It's not something that hasn't happened before, although our version is accelerated. But I see in history moments when this breakdown and exile happens. And it seems like there are certain things that you can do when you're in that moment. Repent, remember, like Jonah, right at the bottom of the waters, like, remember the holy place. Turn, turn, reorient yourself towards that."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":482.74,"end":483.06,"speaker":"John Vervaeke","text":"The."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":483.06,"end":515.26,"speaker":"Jonathan Pageau","text":"The origin, which also becomes the. The telos. And so I think that explains a little bit why. And when I look at how Christians did it when Christianity, when the world changed from the Roman Empire, let's say, to the Christian world, it wasn't as much a break as some people want to represent it. Because in. You can see in Dante the greatest example of that. In the way that Dante formulated his cosmic image, he integrated all the Roman myths with the Christian story into a kind of synthesis."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":517.02,"end":568.52,"speaker":"John Vervaeke","text":"That was good. Okay, so first of all, on the initial point, I don't use the word inventory or reinvent. I use inventio, which is a Latin word which means simultaneously to make, end and to discover. Okay, so it's a verb of active participation, not of making. Yeah, yeah, it's reinventio is to turn back to the inventio place. And that's what I meant earlier when I was Talking about dialectic into dialogos. There's practices you can do, but you can't make dialogos. It's not an artifact. Right. You can do things. You can. Just like a fire, you can make all the conditions that increase the chances it will catch, but it has to catch of its own accord. So I'm in complete agreement. I think at the first point, that's why I'm very careful to use that word rather than the English word invent. Because invent, especially in America, invent means this."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":568.92,"end":570.92,"speaker":"Jonathan Pageau","text":"Wait, we have this idea of innovation."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":571.16,"end":571.64,"speaker":"John Vervaeke","text":"Yes."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":572.36,"end":574.52,"speaker":"Jonathan Pageau","text":"It's like our God, this idea of innovation."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":574.76,"end":642.07,"speaker":"John Vervaeke","text":"No. So for me, and that's why I use more often the metaphor of befriending, you can't make somebody your friend, but it's not like you're passive, though. You have to set yourself, you have to orient yourself, you have to make yourself available. And then there's a possibility that friendship will spark. So first of all, that's the kind of thing I'm talking about there. Second, I think very much the understanding. This is a Kairos is right. And this is the next point is something I independently worked on. But D.C. schindler also talks a lot about in the Critique of Pure Reason is the idea of synoptic integration. The idea is. And this is also countercurrent in a big way, believe me. I know this because we've had these two channels in the west and they're superimposed on each other, which is bureaucratization and specialization. And like I mentioned last time, it's a significant problem in psychology. Like you think the people who did work on meaning in life and belonging."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":642.23,"end":643.11,"speaker":"Jonathan Pageau","text":"Would talk to each other."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":643.11,"end":712.25,"speaker":"John Vervaeke","text":"Would talk to each other. And they don't. Right. And so I think a way in which we're gathering the log so that the fire can spark is. And this is what I do in cognitive science and what I'm trying to do even more broadly, trying to integrate with your work and very respectful in Philia. Right. And with David. David Schindler's work and Paul and is to achieve that state of the broadest possible synoptic integration that can make available. I think what you're talking about. So, yes, the Christians didn't just. Right. And that's what I also try and get with the word steal the culture as opposed to like make a revolution. Right. Like what you're doing is you're. Yeah. You're taking the logos ability to gather things together so they belong together so that you can give an account to which you are accountable, all that stuff. And I see that as a project of like, it's simultaneously the logos is spinning, trying to get it to spin out more and more and also try more and more coalesce together in an integration. That's very much the project."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":713.16,"end":731.24,"speaker":"Jonathan Pageau","text":"So there's a way in which. In the moment of exile. The moment of exile actually has an advantage. It's hard to understand it, but if you look at the stories in scripture, exile is the place where you get riches. Exile is the place where your body grows. Yeah."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":731.24,"end":732.76,"speaker":"John Vervaeke","text":"I thought you said witches. No, it was weird."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":732.76,"end":767.97,"speaker":"Jonathan Pageau","text":"No, you don't. Maybe you can. Maybe you gather a few of those too. But it's mostly the place where you get riches. And so that's the place where you increase. Your body is the place to think about it. And you can think about it very simply. When your very coherent worldview starts to shatter, things start to grow too much and then they disconnect from the origin. But that also adds possibility. If you're ever capable of reconnecting them, then all of a sudden your capacity is. Is so much more, because more is now connected to the top."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":768.21,"end":827.26,"speaker":"John Vervaeke","text":"Yeah. I think of Kairos as the member how at the level of attention and then at the level of the distributed cognition, you have the dispersal and variation, and then you have the selective return to the coalescing center. Your brain is doing that, culture is doing that. And I think in Kairos, what you're just describing is exactly that. You go into the wilderness, you break the frame. So variation is now possible. And then that new variation gets drawn back in to something. And it's the T.S. eliot poem. We return to the center after all of our journeying, and we know it again for the first time. Like, there's a sense of satie. You remember it and you refit, but you also. It's like when people say it's the anamnesis, when people are in the. When dialogos catches. And people say, I've always been looking for this, but I didn't know what I was looking for. It's the memory that's also a discovery. That's why for me, that's what I'm trying to get with that word inventio. Like, oh, I was always looking for this, but I didn't know kind of thing."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":827.82,"end":881.82,"speaker":"Jonathan Pageau","text":"So I think what's important, at least for me, because I always complain about the modern world. Everybody knows. But there's a way in which. Because one of the problems we have is always that there's a line of Thinking there's a line, a philosophical line which tends to see all manifestation or variation as a kind of decomposition. Yeah, the idea that it's immediately evil because as soon as it moves into variety, that whole kind of gnostic strain. But if you understand that the moving out into exile actually has a function to then recapture or bring in more into the pattern, then all of a sudden the pattern of exile and the idea of kind of breaking home or losing of domicide even can, if reoriented, capture more of the world."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":881.9,"end":1005.63,"speaker":"John Vervaeke","text":"Yeah, that's exactly it. Right, right. And so that's the sort of maximal possible frame breaking for the maximal frame making. Like in a systemic insight, sometimes you have an insight into a problem and then you have an insight into a set of problems. Like your relationship hasn't been going right. And it's not like, well, how do I do the nine dot problem? It's like, oh, wait, wait, wait, all of these problems have this nexus and if I address this nexus, they all a systemic insight, you know what I mean? And so there's that breaking and making. But the point I want to get at, to bring it back to the original point is what is the most appropriate stance to maximal frame breaking that will allow for the metanoia return to the center? And that's what I was proposing, this stance of the most original orientation we have, which is this stance towards. Because this is the stance that keeps all the possibilities available, but not in a. Not in. They're not disoriented. Right. And that's what I was trying to get to this place, what I was talking about, that I see at least shared in theosis and nirvana and Dao, this place where you've let go of trying to hold on to. Because as long as you're thinking in a thingy fashion, you're holding onto the framing that bounds and makes them those kinds of things. And if you really are prepared, you really want to let go of the framing, you have to let go of that way of thinking. You have to get to this original orientation state in order to be at the appropriate place on the horizon, right. So that you can be open to what you're talking about, the new possibilities, without giving up being oriented. Because if you give up being oriented, then you're screwed because then you're just tumbling through the nothingness. Right. Does that make sense?"}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":1005.63,"end":1116.55,"speaker":"Jonathan Pageau","text":"No, I think that's exactly what I. That's exactly what I think that the image that I have in Exodus, that seems to be what's happening when Israel leaves Egypt, right? Breaking every frame, frame breaking. And they also leave with a bunch of other people. Like everybody thinks like Israel left Egypt. No, it says it was a mixed multitude. It was just a bunch of people, Israelites, all kinds of other people. Riffraff, who knows? It was like just this massive unformed thing that goes out into the desert, that goes through the waters, that dies, that loses its previous identity. And then there's a process of covenant and of receiving law from above and a reestablishing of hierarchy which binds everything together. Some of it has. Some of it has a communion aspect to it. Some of it has also a kind of cutting off the. The dead wood aspect of it, which is. Which is a harsher part. But you can kind of understand that. I mean, the reason why I'm talking about this so much is that I do have hope ultimately, because I sometimes express a lot of hopelessness, but I really do have hope that this story of even the meaning crisis and the breakdown and everything is necessarily leading to a higher participation and to a bigger frame. It's just that while it's happening, things are falling apart and a lot of crazy idols appear and all these little gods start to poke through and want to get the att attention and want to take. Take it for themselves. But it seems like that in some ways, like even Christianity. I've said this before, that the death of Christianity seems to be part of how it's going to happen and how it's going to."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":1117.91,"end":1123.19,"speaker":"John Vervaeke","text":"Sorry. I really admire you saying that because it takes guts to say that, especially when I presume there's a lot of Christians here."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":1123.51,"end":1126.35,"speaker":"Jonathan Pageau","text":"Yeah, but I don't mean to stop being a Christian. I just mean to die."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":1126.35,"end":1127.51,"speaker":"John Vervaeke","text":"And I'm not saying you are."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":1129.43,"end":1131.27,"speaker":"Jonathan Pageau","text":"I don't like saying that. But you."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":1132.37,"end":1160.65,"speaker":"John Vervaeke","text":"No, no. But first of all, I'm trying to afford you a possibility to frame that a little bit more complete so people can see the positive intent behind the statement. But because there's an analog to what you're saying in the Exodus story, an entire generation has to die. An entire generation has to die. And Moses can't go in to the promised land like the leader. And the entire generation, when it was just what, Caleb and Joshua, they get."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":1160.65,"end":1177.71,"speaker":"Jonathan Pageau","text":"To go in the Savior and the dog, because Caleb means. One of the readings of Caleb is dog. He's actually not an Israelite. He's a Kenizite. So it's like the inside of the outside, like the inner pillar and the outer pillar are the ones that create the new world. It's a Beautiful image, actually."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":1177.71,"end":1228.19,"speaker":"John Vervaeke","text":"It's kind of painful to think about, but there is. And that reminds me. This might straight you as an odd analogy, but it reminds me of Thomas Kuhn in the Structure of Scientific Revolutions, and he talks about when there's a paradigm shift and. And one of the primary mechanisms of paradigm shift is the leaders of the previous paradigm die. Human mortality actually is one of the facilitators of a paradigm shift in science. They have to die because you don't derive the new paradigm. It's like your idea of faith is leaping from one level to another. When you shift a paradigm, you can make sense of the previous paradigm retrospectively, but you can't generate it prospectively. And so there's a real death that makes possible a new generation that creates the paradigm shift. Does that."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":1228.19,"end":1295.17,"speaker":"Jonathan Pageau","text":"No, I totally agree. And I think that's the image. I think that when we talk about eschatological imagery, it seems to be the way to formulate it. It's formulated as a crazy image of a guy sitting on a throne with a sword coming out of his mouth, and he's judging between what is inside and outside, and he's reestablishing the law. And it appears almost mythologically. But we know that it's going to happen because that's how the world works. We know because we experience it at little levels where things die and then they kind of come back up, higher participations. We also notice, even not just in time, but in the ontological hierarchy itself, how that works, how for things to participate in higher beings, they have to give up some of their idiosyncrasy, like. Like a family meal. Like you have to give up your idiosyncrasy to be able to commune with everybody else or a sports team or whatever. And so the mythological image in some ways is. It's like you're formulating the pattern itself, saying, this is how the world works. Here's a limit version of it."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":1295.33,"end":1295.69,"speaker":"John Vervaeke","text":"Right."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":1295.69,"end":1298.05,"speaker":"Jonathan Pageau","text":"And it has this imagery to it."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":1300.29,"end":1326.24,"speaker":"John Vervaeke","text":"I want to make sure I'm getting. Because I think this is a crucial point. Sorry. So what I'm hearing you saying is. So this imagery is obviously imaginal. It's helping you to become aware of things you're not typically every day aware of. And that awareness is sort of like. Of the fundamental grammar of reality, which is what you need to drop back to when you're in this space of the wilderness, because that's all that remains. Is that sort of fun? Is that."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":1326.56,"end":1336.97,"speaker":"Jonathan Pageau","text":"Well, no, that's exactly. Exactly right. But it gives you a way. Because this is the problem, right? It's like, how do you, how do you live in the future? How do you orient yourself towards the future? The future's not there."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":1336.97,"end":1337.37,"speaker":"John Vervaeke","text":"Yes."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":1337.37,"end":1360.06,"speaker":"Jonathan Pageau","text":"It's just not there yet. You don't know what it's going to look like. But what you have is this image, this eschatological image and the kind of mythological image of what the future is. And that makes it possible for you to move towards re. Enchantment or re appropriation without knowing exactly what that's going to look like in the nitty gritty details."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":1360.06,"end":1491.76,"speaker":"John Vervaeke","text":"Right? Right. So this to me sounds like the way the imaginal is at work in orientation. So I don't know if I've. I can't remember where I've given this. So this is based on a lot of work by Hirschfeld and others. You go into a university where at least the people believe that they're the best in rational thinking and the use of education, and you present them with absolutely clear argument and evidence that they should start saving for their retirement. Right now. You take all their challenges, you respond to it, they all agree, yes, I should start saving. You come back in six months and none of them are saving for the retirement. None of them. And then you do something else. You say, okay, what I want you to do is. Well, first of all, let me say what the problem is. The problem is people don't want to connect to their future self because their future self is. I mean, I'm facing retirement, so this sort of looms. Your future self is older, uglier, weaker and unimportant. Right. And so instead what they did is they said, notice the language here. I want you to imagine, but this isn't imagined. I want you to imagine your future self as a beloved family member that you've always cared for and that you have. And you. And you have tremendous compassion and concern for when they come back in six months, the people are saving. If they did the. So the variables are, do they do the practice? If they do the practice, they save, and how vividly they do. The practice predicts how much they save. Right. This is what I mean about how the imaginal is necessary for the rational, where the rational doesn't mean the inferential, because all the inferences were there in the first experiment. What it means is the ratio, the orienting you and proportioning you properly towards the future. Now, that doesn't mean they're getting an accurate. The point isn't an accurate prediction of their Future self. The point is this ratio religio, this properly proportioned orientation, is that how these apocalypses."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":1491.76,"end":1506.8,"speaker":"Jonathan Pageau","text":"This is what I'm hoping, and some people might not understand why I'm harping up on this, because I do. Because I want. And I think, to me, this is crucially important at this moment, is to. Is to be able to formulate a form of eschatology which is not fortune telling."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":1506.8,"end":1507.28,"speaker":"John Vervaeke","text":"Yes."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":1507.36,"end":1558.85,"speaker":"Jonathan Pageau","text":"Right. Which is not like, in so many years, this sign is going to happen and this and that and this and that. I'm not saying there aren't signs and there aren't things that happen, but I think that approaching the eschatology this way can give us a solution. Because people hear me and I know I freak people out, right? I freak people out because I talk about AI and I compare it to the beast in the Revelation. And then people think, oh, Jonathan is saying it's the end of the world. It's like, I'm telling you, this is the imaginal pattern that was projected into an indefinite future, an eschatological future that distills what civilization and technology is. And now I can look. Use that as a model, and I can look into the world and I can see instantiations approaching or moving away from that model."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":1559.57,"end":1566.01,"speaker":"John Vervaeke","text":"So isn't it like a lens that allows you to see better to the horizon rather than a model that you're looking at even? No, it's like."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":1566.01,"end":1646.35,"speaker":"Jonathan Pageau","text":"Yeah, it's like a frame of vision that now permits you then to look at the details of the world and to be able to make sense of what's going on. So to me. So when I say that, I really do believe that, let's say, AI is moving towards the image of the beast in Revelation. And I can. And it's not just like a. How can I say this? It's not just like an arbitrary description of something that I read in the text that I can see. Oh, it's this. Like, oh, you put a number right. When you were young, you probably had this thing like, they're going to put a number on your hand. And then as soon as someone talks about tattoos, you're like, oh, that's going to be it. Like, they're going to put a number on your hand. But it's like. It's rather to understand the imagery as something which is manifesting the extreme limit of certain aspects of reality. And then they can kind of come back and they can help us understand. The reason also why I'm talking about this is because that's what we, at least in the Orthodox Church, that's the way it's set up. So when you look at an image of Jesus in an icon, you're looking at the eschatological Jesus, even an icon, a normal icon of Christ, when you see him with the book and his hand, that's. That's Christ returning. That's the actual typology that you have. So you're looking at the future when you're looking at an icon of Christ. Like you're looking at the future, the eschatological future, piercing in."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":1646.35,"end":1647.31,"speaker":"John Vervaeke","text":"But not predictably."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":1647.47,"end":1659.63,"speaker":"Jonathan Pageau","text":"No, not exactly. Not predictively. It's typological. It's an image. It's man. It's the divine man. It's all that. And in some ways, that's what's drawing us further, like drawing us into itself."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":1660.03,"end":1683.23,"speaker":"John Vervaeke","text":"So the thing about predictive is it gives you cognitive closure. That's why we seek it in science. And what you're talking about, this imaginal orientation, this eschatological is. It's orienting to you the future, but it's leaving space for real emergence, for real uncertainty. Right? Yeah. Because no one knows the hour when."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":1684.58,"end":1739.44,"speaker":"Jonathan Pageau","text":"And there's the example is right. Everybody who's a Christian knows the prophecy. Elijah will come before the Messiah. That's a beautiful typological understanding. You understand what Elijah did? He kind of, you know, what his function was, how he kind of mocked the foreign gods, he cleared the room, Jezebel died. Like, that's okay. All that's going on. And then Christ says, Elijah is John the Baptist. All right, Is anybody willing for that kind of interpretation today? Like, is. There are a lot of people capable of doing that now where saying the same thing now looking at the imagery that is presented, for example, in Revelation, and just say, oh, here's an instantiation of that. This is the Elijah, right? This is the thing. It's not like I said, it's not a map. A map in the gross sense. It's a map in the sense of a frame of seeing."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":1739.44,"end":1751.98,"speaker":"John Vervaeke","text":"Yes. So here I want to do two things. I'll try to do both as quickly as possible. One is I want to give back to you how radical your proposal is, which I sometimes do with you, because."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":1752.14,"end":1753.74,"speaker":"Jonathan Pageau","text":"Does it sound radical to you guys?"}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":1753.98,"end":1755.5,"speaker":"John Vervaeke","text":"I'm going to try and make it more radical."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":1755.58,"end":1757.7,"speaker":"Jonathan Pageau","text":"I don't think so. You're going to make it more radical."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":1757.7,"end":1759.9,"speaker":"John Vervaeke","text":"No, no, no, no. It's not radical in speech."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":1759.9,"end":1760.62,"speaker":"Jonathan Pageau","text":"Yeah, okay."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":1761.34,"end":1838.77,"speaker":"John Vervaeke","text":"That's not what I'm. And remember, radical Also means to return to the origin point, radical return to the origin point, so you can reorient. Right? That's the original meaning. Just published a paper last year integrating relevance realization, recursive relevance realization with predictive processing theory. These are two huge frameworks. There's two meta problems that you have to solve to solve any problem. One is the relevance realization problem. The other is you want to, as much as possible, you want to anticipate rather than react. In fact, you can sort of measure the intelligence of a being by the scope of its abilities to anticipate. And what your brain is, is it's a massive predicting machine at many levels of abstraction, predicting the next second predict. Like it's doing all of this in this really complex recursive fashion. I won't get into the. Well, I like surprises. No. Well, you like surprises that are momentary failures of prediction that increase your long term prediction capability. You don't like absolutely irreversible surprises. Those are horrible. That's terror, right? Yeah. You like surprise birthday parties. But if at the surprise birthday parties they pull out knives, then you're like, no, I didn't want that surprise."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":1838.77,"end":1839.57,"speaker":"Jonathan Pageau","text":"Not that surprise."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":1841.73,"end":1906.26,"speaker":"John Vervaeke","text":"Okay? So I want people to really sink into that, to savor that. I think this is an incredibly plausible understanding such that, for example. And this is, this comes into the heart of a lot of therapy. Even the brain prefers predictable unhappiness over surprising happiness. And that's one of the ways in which people get. Some of your language perhaps. I think that's one of the ways in which people can get bound into like sin, that they can get locked in a kind of unhappiness that they can't let go of because of how it plugs into that. I'm not saying that's the theological meaning. So what I'm trying to get at is to move into a mode in which, because I struggle against this with scientists, to move into a mode of orientation where you are trying to properly orient to the future but not be in the predictive frame. It's radical. It goes to the fundamental guts of how the brain is working. Does that."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":1906.26,"end":1959.15,"speaker":"Jonathan Pageau","text":"Yeah, but no, but I think the reason why I think it's important is because I also want to recapture like the little old lady, you know, like very simple person who says, you know, God, God will take care of me. Right? That little statement. Okay, because, because that's, that's in that mode. It's like I actually don't know what's going to happen. I don't know what's going to happen. But I have an orientation which is to say, or something like, I know that God wants the best of me. And the thing is that that might mean that you're going to get dragged in the street and you're going to get killed and like, all these horrible things are going to happen to you. But that mode of anticipation is the best mode to stand in in order to face whatever horrible thing the future has in front of you."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":1959.15,"end":1959.39,"speaker":"John Vervaeke","text":"Right."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":1959.39,"end":1960.99,"speaker":"Jonathan Pageau","text":"And it's Right. And it's not predictive."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":1960.99,"end":1961.43,"speaker":"John Vervaeke","text":"That's right."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":1961.43,"end":1968.31,"speaker":"Jonathan Pageau","text":"It's not at all predictive. It's just a stance which is like, all that is given will be taken as the grace of God."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":1968.39,"end":1973.95,"speaker":"John Vervaeke","text":"But do you understand why? I mean, it's psychologically radical to take that stance? Because like I just said."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":1973.95,"end":1979.11,"speaker":"Jonathan Pageau","text":"Yeah, I don't do it. I don't know what to tell you. I wish I did. I wish I did."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":1979.27,"end":1979.67,"speaker":"John Vervaeke","text":"Okay."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":1979.67,"end":1981.43,"speaker":"Jonathan Pageau","text":"I know people that do more than I do."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":1982.4,"end":2081.73,"speaker":"John Vervaeke","text":"But. So there's one thing about the stance from the outward orientation and one about the taking up of the stance. One is to not confuse uncertainty with risk. So one of the things we've convinced ourselves is that we can capture all uncertainty. Risk is calculable, unwanted things. Uncertainty is things that can't be calculated. And we have tried since the Enlightenment to convince ourselves that we can capture uncertainty with risk calculation. And what's coming out, what's been coming out in the history of physics and science and all kinds of things is you can't translate uncertainty. You can translate some uncertainty into risk. Of course you can. Right. But there's a lot of uncertainty. If there's real emergence, then there's real uncertainty. So first of all, that. Because one way we try and sneak in is people are placing their bets. That's not this. You're not before the roulette wheel. That's not what's happening. What we're talking about here. I'm really trying to make this as radical as possible and then taking it up. I heard three things in you. I heard these three. Humility, trust, and hope. I want to start with the one that I have the most difficulty with. And I don't just mean philosophically, I mean personally, which is hope. And first of all, because there's two interpretations of Pandora's box, the standard interpretation is you let all the demons out, but there's this thing in the bottom. Hope. Right. And that. Oh, yes, hope. Right. That's sort of the standard. And then there's the Heideggerian interpretation is hope is the heaviest and worst thing in the box. Yeah, right. And when you take a box, it."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2081.73,"end":2083.25,"speaker":"Jonathan Pageau","text":"Makes all the others even more painful."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2083.25,"end":2109.27,"speaker":"John Vervaeke","text":"Yes, exactly. Exactly. It's a burden. And we all know that there's obviously toxic hope, like the people who stay in abusive relationships too long, right? The people who misplace their hopes in the Fuhrer. Right. All kinds of toxic versions. So perhaps we could. So I want to talk about all of them. Hope, humility and trust. But what like. And I know hope is one of the."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2109.67,"end":2209.57,"speaker":"Jonathan Pageau","text":"But I would say that again, it's the idea of the proper stance, again, that is, what do you place your hope in? Right? Because if you place your hope in your spouse completely, then you're going to lose, right? If you place your hope in the government, in your school and whatever, in your friends, if you put all of it there, then you're going to. Then it's not going to work. And I think that that's why the idea of hoping in God, which sounds like a trite statement, is actually very profound in the proper stance, which is that my hope is turned towards the infinite. It's turned towards that no thing, which is beyond the things. But if I put my hope in this or that leader or this or that, it's going to experience a disappointment, which is important. The disappointment actually might be what leads you towards hoping, putting your hope in the highest. But if you look at. In the Christian story, you know, people. Sorry if there are any, like, prosperity gospel people here. But it's like in the early saints, they had their hope in Christ and they were expressing their hope in Christ as people were chopping their head off. Like as people were cutting their limbs off and ripping their skins off. Their skin off. It's like, okay, that's a little. That's crazy. But in a sense, if you're in that situation, that seems to be the best thing. It's like a limit version of it, right? It's like if you were in a situation where someone's ripping your skin off, what would be the best stance to have? And the saints represent it as this. Just look as high as possible, you know, and that. That. It doesn't make what's happening okay, but it's the best stance, even in the worst situation."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2211.01,"end":2214.05,"speaker":"John Vervaeke","text":"This is good. I'm going to present something to you as a foil."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2214.13,"end":2216.89,"speaker":"Jonathan Pageau","text":"Am I making it as extreme as possible by talking to people?"}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2216.89,"end":2217.29,"speaker":"John Vervaeke","text":"You should."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2217.29,"end":2218.45,"speaker":"Jonathan Pageau","text":"Their skin ripped off."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2218.53,"end":2233.36,"speaker":"John Vervaeke","text":"You should. No, if we're preparing for an open horizon, moving to extremity is the proper stance, the proper way to comport ourselves to what we're talking about."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2233.52,"end":2243.52,"speaker":"Jonathan Pageau","text":"So do you think that idea of hope solves the problem of hope in terms of disillusioned hope, or do you think it could at least."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2244.72,"end":2353.6,"speaker":"John Vervaeke","text":"Well, what I want to do is I want to try and get it clearer by the contrast of foil. And this is appropriate because this actually happened historically, because there's another response to disappointment. And of course, Kierkegaard plays these two responses off against each other. The night of faith and the night of infinite resignation. Right. So there's the stoic response. The stoic response is, look, I totally get your disappointment thing, like, 100% agree. Right. And so don't place your heart in anything that is ultimately disappointing. And then they say, well, how do we determine, like in a rational manner, what's disappointing or not? Because sometimes what you think is disappointing may not. You can be confused if you just go off subjective feeling. Right. So. And then they say, well, what you do is you try and put your heart. You try identify with what is good, because if you are truly in relationship to what is good, you. You can't ultimately be disappointed. And then they say, well, what is it that's always good? Friendship? No. Friendship can turn bad. And can we? Wealth? No. You know, fame. And they rule. And then they say, what's the one thing that's always good? And their answer is wisdom. The cultivation of wisdom is always good. There's no situation in which the endeavor to become wiser can turn like, turns bad. Wisdom is the good. And then that also allows them, because they did. They also famously faced torture and execution with that. Now, that's a different. Now, I think part of your response is that's grounded in the notion that the Logos of wisdom is ultimately oriented towards the Logos of Being, which gives them. So Seneca says, even when you're painted into a corner, you can jump into the sky. Right. That kind of thing. So."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2353.68,"end":2367.33,"speaker":"Jonathan Pageau","text":"Well, there's a reason why, at least in the Christian tradition, Christ is called Wisdom of God. The imagery of wisdom in the Old Testament, there's a duality to it a little bit, but most of the church fathers interpreted that as being the Logos."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2367.33,"end":2370.77,"speaker":"John Vervaeke","text":"Yes. So what's. And I'm."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2370.77,"end":2389.37,"speaker":"Jonathan Pageau","text":"So the difference, I would say, between the Stoic and the Christian would be that in the Stoic, it's like, it's a virtue in the sense that it's a principle, maybe. Whereas in Christianity, it's a person that you follow. It's someone that you follow."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2390.09,"end":2414.96,"speaker":"John Vervaeke","text":"So let me see if I can strengthen your Argument. And so part of what I hear you saying, given what we said earlier, and I'm using, you know that I'm using the term in the sense of icon, right. By saying it's personable, is that there is something that the. That can give you afford the imaginal engagement, that can reach your grandmother."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2415.84,"end":2416.48,"speaker":"Jonathan Pageau","text":"Something like that."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2416.64,"end":2417.36,"speaker":"John Vervaeke","text":"Is that fair?"}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2417.52,"end":2419.88,"speaker":"Jonathan Pageau","text":"It's something like that. But it's real. It's not. I don't."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2419.88,"end":2456.2,"speaker":"John Vervaeke","text":"No, no, I never. It's not a. I would say it's not a metaphor between the imaginal and the imaginary. The imaginary is not real. Look, if predictive processing is right, most of your perception of this floor is imaginal. Yeah, right. You're imagining it, but it's not illusory because the imaginations are true. Right? Because. Right, because look, if I want to walk across this floor, the sensory motor loop is too slow. So my top down processing is actually predicting. I'm imagining most of the floor that gives me the capacity to walk quickly across. So that's when I. The imaginal is in the very guts of your contact with reality. That's how I'm using the word. Is that okay?"}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2456.2,"end":2457.12,"speaker":"Jonathan Pageau","text":"No, I think that's fine."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2457.12,"end":2517.54,"speaker":"John Vervaeke","text":"I think that's fine. So the claim then is that. And I'm getting. I'm understanding this claim better because I've heard you and Paul make it to me several times and each time it goes round. And I don't mean I'm just playing with this. I hope you don't think that I'm getting clear about what the claim here is. You know, Christianity has what Stoicism has about the logos to the logos to the logos, and that's what's always good. And you can align your logos to the logos. Maximus, even he says exactly that. So that's not something for. But what you're saying is in the form of a person, and not just person, but also hypostasis. Person. Right. Hypostasis also means substance. In principle, we've reduced it to our Lockean notion of what a person is. So it's person in this pattern sense. Is that fair too? Okay. And then that gives you imaginal access to binding your logos to the logos in an even more profound way, or."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2517.62,"end":2533.26,"speaker":"Jonathan Pageau","text":"Even relational in the sense that the way that we experience. And this is why in some ways, when we talk about principalities or agency or transpersonal agency, is that the best way to engage is with. As if you're engaging with an agency."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2533.26,"end":2533.62,"speaker":"John Vervaeke","text":"Yeah."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2533.62,"end":2596.63,"speaker":"Jonathan Pageau","text":"Not as if you are imaginable as much as you're an agency. Right. As much as that. In some ways, the mode of human engagement is through agency and through personhood. That's actually how we engage. And so the claim is important because the reason why there's been so much kind of arrogance about how silly the image of God, the personal God, is and kind of how just trite and ridiculous it is. But I really. I want to propose that when we engage with virtues, even, or with. If we engage with them as models and even incarnate models to follow, that's the realest. It's realer than just engaging with it as an abstract principle. So it's like, if I. So that's. It's like. It's an incarnational way of thinking. So I follow examples of wisdom."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2596.79,"end":2597.19,"speaker":"John Vervaeke","text":"Yes."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2597.19,"end":2635.82,"speaker":"Jonathan Pageau","text":"And wisdom itself appears as. As a type of agency that I can submit my will to. And so it changes the world back into a world of. Yeah, I mean. Sorry. It changes the world back into the. More like the ancient world where you have these agencies which come down on us from heaven and that we can follow. And we don't see them as abstract principles or as. As forms in the way that Plato saw them, but more, I think, at least myself, more like the way that the pagans saw the gods rather than the way that Plato sees the forms."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2635.9,"end":2637.66,"speaker":"John Vervaeke","text":"Well, the Neoplatonism those two get."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2637.66,"end":2638.94,"speaker":"Jonathan Pageau","text":"That's right. No, I totally agree."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2639.02,"end":2640.14,"speaker":"John Vervaeke","text":"Yeah. So."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2642.46,"end":2652.62,"speaker":"Jonathan Pageau","text":"First I'm gonna get you in trouble again by saying things like that. The people that are like Jonathan, the superstitious guy, trying to get John to believe in demons or whatever."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2652.62,"end":2654.18,"speaker":"John Vervaeke","text":"I defended you. I defended you."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2654.18,"end":2667.7,"speaker":"Jonathan Pageau","text":"You did an amazing job. You know, like. Like someone started attacking me. And John has been amazing at defending my position, but I know it's a radical thing, and it's hard for people to get into that space because it's unsettling."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2667.7,"end":2673.62,"speaker":"John Vervaeke","text":"Yeah. But if they don't leave the paradigm they're in to get to their space, they're screwed. That's part of the AI thing."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2673.7,"end":2676.58,"speaker":"Jonathan Pageau","text":"Yeah, I think it is part of the AI thing, definitely."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2676.58,"end":2699.33,"speaker":"John Vervaeke","text":"But I want to stick on this point because there's two things. So first of all, I think I'm hearing you, and there's a way in which I deeply agree that in order to properly orient logos to logos, it can't just be the cognitive grasp of a principle. It has to be internalizing the stage, because you have to be internalizing perspectival taking and identity formation."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2699.89,"end":2701.37,"speaker":"Jonathan Pageau","text":"That's exactly. That's exactly right."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2701.37,"end":2749.59,"speaker":"John Vervaeke","text":"And so I think. And I get that, please take this as how I'm understanding it. And I'm not drawing equivalencies here, but that's what I'm trying to do after Socrates is I'm trying to give people Socrates as a sage that can give them how to internalize perspectives. Identity formation basically embodies and enacts, because that's what Plato's. That's the point of the dialogues. The point of the dialogues is to say, look, there's no definition of wisdom, but here's a person who embodies it. And what the dialogues do is they break you out of trying to come up with a definition in order to. If. If. When they work, in order to orient towards, oh, wait, here's an embodiment. And I can do exactly what you're talking about with that now. And I'm not. I don't want to do."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2750.47,"end":2751.19,"speaker":"Jonathan Pageau","text":"No, no, no."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2751.91,"end":2775.84,"speaker":"John Vervaeke","text":"But so I get that. Right. And I make it clear in the series repeatedly, I'm not trying to draw equivalencies between Jesus and Socrates, although I think, like in Kierkegaard, putting them into deep dialogue. That's Kierkegaard. That is. I think it's a very valuable thing to do. I think now, so big. Yes to that part. And so how can you."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2776,"end":2789.92,"speaker":"Jonathan Pageau","text":"So this comes back to what I said yesterday. How can you do that in a way that is more than just a mental exercise? So the reason why yesterday, one of the reasons why I brought up celebration is because that's part of it."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2790,"end":2790.4,"speaker":"John Vervaeke","text":"Yes."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2790.4,"end":2803.61,"speaker":"Jonathan Pageau","text":"Right. So worship and celebration in general is a way to participate and make these things. You know, it's like by just attending to them and celebrating them, Lifting them up."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2803.61,"end":2804.01,"speaker":"John Vervaeke","text":"Yes."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2804.01,"end":2817.09,"speaker":"Jonathan Pageau","text":"You know, I'm making them models for me to follow. And with philosophers, it seems difficult. It's difficult to do. Like, unless you would organize, like, a cult of Socrates, which I don't suggest. I'm not suggesting that."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2817.09,"end":2818.93,"speaker":"John Vervaeke","text":"No, no, I'm not suggesting that either."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2819.74,"end":2851.65,"speaker":"Jonathan Pageau","text":"But it seems like that that's. In some ways that. That's the. To me, the true mode of participation engages that. So it's like I, you know, I celebrate my father. Right. It's like we celebrate the 50th wedding anniversary. We're all there together and we're there and we're recognizing that as something to put up on the pedestal and therefore to follow and to engage with. And it's more. It's not the same as saying, this is a good. These are the principles of a good Marriage, you know, you should follow them."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2851.65,"end":2852.13,"speaker":"John Vervaeke","text":"Yes."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2852.53,"end":2877.95,"speaker":"Jonathan Pageau","text":"The first one is way more real because it has that. You know, it has exactly all that it needs. It has a kind of liturgical aspect to it where I'm lifting it up and I'm putting it up and I'm saying to everybody, look at this. This is what's valuable. Everybody looks at my parents, that they've been married for 50 years, and they're like, wow, look at how that's crazy that they did that. You know, maybe I could do that. You know, I mean, we don't have those mental. It's not as explicit, but that's how it works."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2878.03,"end":2878.47,"speaker":"John Vervaeke","text":"Yes."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2878.47,"end":2878.99,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2879.47,"end":2969.62,"speaker":"John Vervaeke","text":"Okay. So there's first of all an answer. But before I answer, can I put my finger on the problem I wanted to pose? Because the answer will be engaged with that. So the problem you face with everything, all the good points you just made, this is why I wanted to push on. Person is our sort of established sense of person is a creature, is a thing. And therefore. So I'll put aside all the silly, oh, God's a sky wizard. Those people, I agree, they're by and large sort of idiots because they're comparing the worst form of religion to the best form of science, which is like, I can do that with science, too. Like, you know, here's Edison, and he's an example of science, and look at how crazy and stupid his method is. And look at religion. And let's look at Aquinas and how systematic he is. See, religion is so much better than science, it's ridiculous. So I agree with putting all of that aside, but I do think there is a point and. Right. And I think the, you know, int. Makes this clear. You know, the concern with idolatry is ultimately the concern with. Right. Not relating to the ground of being as a being. Right. So that's the problem with the imaginal is it focuses you in on a being."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2969.94,"end":2970.46,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2970.46,"end":2985.93,"speaker":"John Vervaeke","text":"Right. And yet, and I know Eastern Orthodox, you really, really wrestled with this, the icon versus the idol, and John Luke, Marion is right. But you see, there's a tension. There's. There's a tension also with focusing on. Do you see that?"}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":2985.93,"end":3006.77,"speaker":"Jonathan Pageau","text":"No. If. Unless. I mean, this is now, I'm going to be very, very explicitly Christian. But if the being. If the being appears as someone who dies, and then that being appears as someone who says something like, you know, not me, but the Father."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3006.77,"end":3007.37,"speaker":"John Vervaeke","text":"Right, sure."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3007.77,"end":3049.04,"speaker":"Jonathan Pageau","text":"And so the point. Because you don't have a choice, that's the problem. You do have to see or you do have to imagine. You do have to. But if you do that, and then that's what you have. You have an image of a man on a cross who's dying, and he's doing it to fulfill the will of the Father. And so what he's doing is showing how it is a no thing when it appears as a thing. It appears as an emptying. When it appears as a kind of emptying of itself into the world and so gives you that place of focus. You've got it. But you know that it's not. How can I say that? That it is that emptying and that it only exists in the vertical relationship."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3049.2,"end":3075.97,"speaker":"John Vervaeke","text":"Okay, now I can answer your question to me then, right? Because for me, I'm not proposing a cult of Socrates, because Socrates empties himself completely knowing that he does not know. And then what he does is he is a way of imaginally orienting to the good or the one. And that's the Neoplatonic interpretation of Socrates. And that's how I internalize Socrates as a sage. I'm not trying to build a cult around Socrates."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3077.17,"end":3081.61,"speaker":"Jonathan Pageau","text":"And so then let's say the practices around Socrates, like the lectio divina, I imagine."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3081.61,"end":3097.26,"speaker":"John Vervaeke","text":"Yeah, yeah, lectio divina, yeah. Very much philosophical contemplation. But it's Socrates, broadly construed. It's. Socrates is the exemplar of philosophia as the cultivation, the love, the philia, the shared love of wisdom, which is always good."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3098.7,"end":3156.82,"speaker":"Jonathan Pageau","text":"Yeah, well, I mean, it definitely shows the diff. Like that's the difference. I guess that's the big divide, is that in some ways I think that we do need a cult. Yes, we actually need it. Without it, like without the cult, we just. It's not enough to hold all the levels together, because what occult does. Sorry, you're asking me to be radical. Okay, so what the cult does is that because it frames it with imaginal language, it makes it accessible to everybody. Right? So it's like the most uneducated person can look at a crucifix and the genius in the university can look at the same image, and they're both engaging with it at their appropriate level of understanding and of participation, but it offers that possibility to all come together. And so the little lady can have a cross in their house. Totally fine."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3157.06,"end":3165.38,"speaker":"John Vervaeke","text":"And you and Paul make this argument, and you know that I take your arguments seriously and take them to heart. I guess there's a little bit of pushback."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3165.54,"end":3174.21,"speaker":"Jonathan Pageau","text":"Yeah, you should, because I just had a bunch of crazy stuff. Just imagine all the comment John Jonathan says it has to be a cult."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3175.97,"end":3261.8,"speaker":"John Vervaeke","text":"So first of all, like I said yesterday, I think the accusation of a cult is just empty. I think if you recenter cult in cultivation and the cultivating of a sense of the sacred, then I agree. But these practices that I'm talking about do that. But I want to be the accessibility scaling problem. I mean I've been responding to this since the very first you made it. And again, I'm asking for a little bit of charity to not do the apple and oranges. Christianity didn't land that scaling. No, it took centuries. It took centuries, right. And so it's like I'm not in the place to make the comparison with. It's a little. I'm saying it's a little bit unfair to what I'm talking about in some ways. Right. It's like, I don't know and I'm certainly not trying to found a religion and I keep saying that, but I think we're making progress in scaling this more and more. I think there's reason to believe that's the case and it's certainly not centered on me because I have deliberately made that the case because it's."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3261.96,"end":3282.08,"speaker":"Jonathan Pageau","text":"No, I don't think I see any of that. I hope you're not thinking that I suggesting that I don't see any of that. It's mostly I'm looking, I'm trying to. I'm trying to. Let's say I want you to because I feel like the way that I'm presenting it, I think that's the way I think and so I want you to."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3282.08,"end":3283.04,"speaker":"John Vervaeke","text":"There's lots of resonance."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3283.04,"end":3293.88,"speaker":"Jonathan Pageau","text":"Like I want you to. I want you to break what I'm saying. So I'm even like. If you. I'm trying to. I'm hoping you can even like poke holes in this idea that in some ways worship is necessary for this."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3293.88,"end":3355.46,"speaker":"John Vervaeke","text":"Yeah, that's the primary proposition. And it's. So what I'm trying to get at is because I mean you've got the practices till like you've got ultimate concern for what's ultimate. And they're very much about communing, not just communicating. They're very much about the sensing of the leap to the higher level. They're very much about a sense of like, you know, of radical religio. Connecting grammar to grammar. I've been making that argument and some of the. So there's definitely awe and sacredness and there's definitely celebration people are sharing about how. So there's I feel like. And then there's the scalability issue. I get that and I've tried to respond to that. I feel like there's something else you're trying to put your finger on in worship that I'm not getting. And that's where you want. That's where you're making. And I mean this as a friend, that's where you're making your stand. And I want to get clear on that."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3355.46,"end":3392.44,"speaker":"Jonathan Pageau","text":"No, no, that's definitely. I think in some ways that's where in the sense that I do see, like I do see the worship part as being crucial to how things hold together. Right. And I see that not just worship, like true worship, let's say to God, but I see celebration. I use the word celebration that you know, when you do something, when you're moving towards a goal, you're necessarily to some extent celebrating the thing that you're moving towards. You're elevating it above other possible things you're doing."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3392.44,"end":3393.08,"speaker":"John Vervaeke","text":"Aspirational."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3393.08,"end":3418.32,"speaker":"Jonathan Pageau","text":"Yeah, there you go. That's an interesting way of thinking about it. And so at a micro scale, let's say you're just. How can I say this? You're just walking towards the door. Well, that is a little ritual that is recognizing something as good as. And is lifting it up above all the other other things you could do and is moving towards it. Right. So it's like it's a little form of celebration."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3418.64,"end":3419.32,"speaker":"John Vervaeke","text":"So. But this."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3419.32,"end":3426.44,"speaker":"Jonathan Pageau","text":"But, but then the idea is that in order for that to bind more, it has to go higher. Go higher. Obviously."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3426.44,"end":3454.28,"speaker":"John Vervaeke","text":"Right, But I was trying to. So going through the doors. Relevance realization. Yeah, right, right. And then I was trying to say, but you get to a place where relevance realization realizes that it's irrelevant in order to give you the proper stance towards ultimate and it has to give itself up. Now that sounds to me like a radical prioritization, a radical lifting up of the no thickness of ultimate reality, of the inexhaustible. Like, isn't that. Wouldn't that."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3454.36,"end":3472.83,"speaker":"Jonathan Pageau","text":"No, I totally agree. But I think that that's the stance that is something like that stance to stand in front of the no thingness. To stand in front of the infinite and to just. That's all you do, really. There's nothing else you can do except not see it or just make a gesture towards it."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3472.99,"end":3482.91,"speaker":"John Vervaeke","text":"Yeah. Nicholas, Yakuza is like as soon as you try and grab it, you fall into paradoxes. And the paradoxes then just frees your mind kind of thing. Yeah, I totally get that."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3488.03,"end":3582.89,"speaker":"Jonathan Pageau","text":"We might be just turning around in circles at this point. It's possible because, I mean, I think that definitely, like we, every time we talk about this, we push each other further and then I think we reach the point where we might have to think about it more on our own and keep going. Okay, so let me just bring it back to the idea of the problem of the meaning crisis and the problem of the home. Let's say the idea of the spiritual home is that, okay, we come back to this idea of that the thing that we celebrate in some ways has to be our origin and in some ways has to be our telos. And that. We don't totally pick that. No, we don't get to decide what that is completely. It's revealed to us. And even for people that have conversion experiences, they usually don't. It's not like they decided to believe something. Right. It's something that revealed itself. It's this thing that revealed itself to us. And I think that is, again, that is my worry of any project now that tries to build something to create this new thing. And it's fine to do that as long as it's all the intermediary things. For example, I think Estuary is great and I think that's wonderful. But if I heard Estuary trying to replace, let's say, the church."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3583.05,"end":3583.77,"speaker":"John Vervaeke","text":"I don't want to replace."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3583.77,"end":3585.29,"speaker":"Jonathan Pageau","text":"No, not you, but I'm using."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3585.53,"end":3586.21,"speaker":"John Vervaeke","text":"Then he's."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3586.21,"end":3607.89,"speaker":"Jonathan Pageau","text":"I'm looking at you. Then I would become. I would be like, I don't think you have. You don't have what it. You don't have what it takes to do that. And so that's John Fandonka Zapoti. And so I'm worried about all of that. Like we talked about certain people that. Because there's a lot of that going on."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3608.29,"end":3715.42,"speaker":"John Vervaeke","text":"There is, yeah. And I'm deeply opposed to that too. And I don't want to replace the church, I don't want to replace the mosque, I don't want to replace the synagogue. So there's a couple things here. One is, I think you might be right about the death and resurrection of Christianity. And I think I'm still very open to what that might be, and I try to keep open to. That's why I keep. And discussion with you. So I want to give you that. But a lot of people see the dying and that's all they see in profound ways. And then that's mixed up with some very bad history and they. Christianity is not available to them for that reason. And could we nevertheless help Those people. And there's two possible responses. One is a nasty response is no, damn them to hell. Or the other is, well, no, they still should be helped. And however that turns out, hopefully what is true and good and beautiful will be at work in that St. Paul talks about capturing every good thought. Right. So the second thing is, part of what I think is going on, and I hear this more explicated by Paul is, well, Christianity has this huge history and that means it's been put through lots of trials and therefore it's more trustworthy in a lot of ways. I think that's a very legitimate argument. The problem is that argument would undermine you adopting Christianity at its origin point. So there's a problem with that argument. It gets you very close to performative contradiction because Christianity was premised on the fact. No, no, we can break from the tradition."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3716.44,"end":3720.2,"speaker":"Jonathan Pageau","text":"I don't, I really, I mean, because I'm orthodox, I don't seem to, I don't think that."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3720.36,"end":3735.24,"speaker":"John Vervaeke","text":"But that's problematic. But that, that's the other problem for me and you don't have this problem and that's fine. But I see the claim that the Christian reads the Jewish scriptures better than the Jewish people. Very problematic, as most Jews do. So. Yeah."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3735.24,"end":3738.48,"speaker":"Jonathan Pageau","text":"And as most Christians find the Islamic claim on."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3738.48,"end":3740.68,"speaker":"John Vervaeke","text":"Yeah, yes, exactly, exactly, exactly."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3740.68,"end":3741.76,"speaker":"Jonathan Pageau","text":"That's a legitimate concern."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3741.76,"end":3790.71,"speaker":"John Vervaeke","text":"Yes, yeah. So that's how I would respond to that point. So I think we've pushed hope very deeply and I think we've touched on trust quite well, because trust is an interesting one for me. But I think you've given me a lot to think about. But I think one thing that which still sort of has been left implicit is like this virtue of humility. And so for us, I mean the culture, humility is very hard to inventio or reinventio because. Well, think about the process. Humiliation. That's not a positive word."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3790.71,"end":3791.19,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3791.99,"end":3806.72,"speaker":"John Vervaeke","text":"That's a word of devastation and destruction and loss. Right. So what is it we need to do to inhabit. Rehabilitate humility?"}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3806.8,"end":3821.78,"speaker":"Jonathan Pageau","text":"Well, I think, I really, I think that we have an opportunity. It's a little, it's annoying because it's a very pressing opportunity. Is that we have a tendency today to self name for people who want to auto originate."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3821.78,"end":3822.58,"speaker":"John Vervaeke","text":"Yes, yes."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3822.66,"end":3854.98,"speaker":"Jonathan Pageau","text":"And when we see that, we notice what it does. It creates a very strange. It creates a very strange instability when people try to self name. And you could imagine that the image of self naming in the Bible, the idea of taking the apple for ourselves or especially Babel, the idea where we will build, make for ourselves a name. We'll reach heaven to make for ourselves a name. That doesn't work because of that, because of just the levels, how reality works. Like you said, for you to be able to quantify anything, the name already has to be given."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3855.14,"end":3855.5,"speaker":"John Vervaeke","text":"Yes."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3855.5,"end":3861.02,"speaker":"Jonathan Pageau","text":"For you to be able to be able to calculate anything, the identity has already to be. It has to be already there."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3861.02,"end":3861.7,"speaker":"John Vervaeke","text":"Yes. Right."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3861.7,"end":3894.12,"speaker":"Jonathan Pageau","text":"And so, and so that's the. That's the scale like that, this relationship. And so if you understand that, then humility is just the proper stance in front of before life, which is that I cannot will myself into existence. I have to receive from heaven or receive from above, receive from the past, receive from tradition, receive from that which was. That is not me who I am. And without that I can't. I'll just fragment and collapse and start to break apart."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3894.6,"end":3918.4,"speaker":"John Vervaeke","text":"That's really good. So first of all, part of what I'm hearing is humility is an appropriately apprehensive appreciation of the vertical. Right. Something like that. An appropriate apprehension of the vertical. So you understand that much is being given. And it could also be this way too. Right. What is like how the earth gives? Right?"}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3918.56,"end":3923.52,"speaker":"Jonathan Pageau","text":"Yeah. Well, I mean, the idea that body also comes from outside."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3923.76,"end":3965.06,"speaker":"John Vervaeke","text":"So I think that that's very powerful. Two things, humility seems to also have within it a recognition of one's faults, failures, infinitude. That's the opposite of hubris. So how that gets in. And then thirdly, how do we not crush the fact that there is an aspect, and the existentialists made a big deal of this, and some of them are Christians, that there's a big aspect of us that is self defining, self interpreting. A part of being you, being Jonathan, is the way in which you have defined yourself. That's one of the ways in which we're reliably different from other organisms on the planet."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3965.14,"end":3965.54,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3965.7,"end":3980.89,"speaker":"John Vervaeke","text":"So how do. First of all, how does the recognition. I'll just use finitude for. How does that fit into that? And then how do we not crush that part of us that is appropriately understood as our capacity for self definition."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":3981.44,"end":4061.57,"speaker":"Jonathan Pageau","text":"So I would say the first one in terms of being humble and recognizing your fault and all that. One of the problems, the reason why that has been so diseased in the past few centuries is I think, precisely because we don't think that someone who really thinks they're wretched usually doesn't have a problem. The problem is usually people who think they're wretched but really think they're not. And so they have this perception of their wretchedness, but they think they should be something else. So because of that, they experience it as a kind of oppression and a kind of bitterness. But if you read the great fathers, like this sense of being empty and of seeing your faults, if you don't think you have much, then all your faults just become opportunities for you to get better. Like that's all they are. They're just opportunities. All your sins become opportunities, all your faults become opportunities. And again, I'm not doing that just so you know, sometimes, but not most of the time, but I can kind of see that. And I think that even the whole idea of self esteem that the modern."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":4061.57,"end":4092.31,"speaker":"John Vervaeke","text":"West has developed, self esteem has been a failure. Yeah, I mean. No, no, no, seriously, the empirical data is self esteem has been a failure. Okay. Like either we say it's a rational scientific project and we make predictions and then we get the disconfirming evidence, or we're playing some game. And of course, the culture to a large degree is playing some game. Right. And I agree. Put that aside. If you look at the data, self esteem has been a mistake."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":4092.71,"end":4130.04,"speaker":"Jonathan Pageau","text":"But then the idea of the self naming or the actualization, I think that that can be experienced as a self transcendence. Yes, Right. But it's not self transcendence in the sense of just picking yourself up by your bootstraps and lifting yourself up. It's very much like the idea of following a leader. So something appears to you as bright and as beautiful and powerful and it pulls you. Right. It kind of, kind of gives you that, that oomph to move, to move into it. So you, you obviously participate in that, but you don't have it in you. Yeah, right."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":4130.04,"end":4130.48,"speaker":"John Vervaeke","text":"Yeah."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":4130.48,"end":4144.99,"speaker":"Jonathan Pageau","text":"It's like there are things that are, that are guiding you and pulling you, whether it's, you know, whether it's. You're, you're playing sport and there are sports players before you that are superstars, and those examples are kind of moving you forward and are aspirational. Yeah."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":4145.38,"end":4167.26,"speaker":"John Vervaeke","text":"So what I'm hearing is, and I'm going to bring in the Platonic thing about the aspirational, the appropriate aspirational appreciation of the vertical that is properly binding together the finitude and the transcendent. How's that for humility? Yeah. Do you like that?"}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":4167.26,"end":4168.02,"speaker":"Jonathan Pageau","text":"I think that's fine."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":4168.18,"end":4168.82,"speaker":"John Vervaeke","text":"That's good."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":4169.14,"end":4211.71,"speaker":"Jonathan Pageau","text":"Yeah, I think humility. But it's good that you bring up humility because it's true that it's something that most people think is horrible. We have a sense that humble people are weak. But there are interesting stories of humility that show the strength of humility. Saint Francis of Assisi is a great example. There are many examples where he humbles himself in a way that actually secretly raising himself above everybody else, he's not doing it, but it's happening by the fact that he's lowering himself and he's shaming everyone around him to a point where everybody recognizes that he's the master."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":4212.67,"end":4277.37,"speaker":"John Vervaeke","text":"So I'm not claiming to do this either. I do. I mean, this is sort of meta. I aspire to being more humble because for me I want to more that what we just talked about. That, that, that it's not the poles, it's the polarity. Right. That, that, that aspiration, appropriately aspirational appreciation. And appreciation means understanding as well as valuing. Right of the. The binding of the finite and the. I want to. I aspire not just want. Who cares about my wants? I aspire to be in the stance, the orientation, so that the love of what is true and good and beautiful could grow in me. And for me, that is how I try to practice the aspiration towards humility. Does that land for you?"}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":4277.37,"end":4289.85,"speaker":"Jonathan Pageau","text":"Yeah, no, I think that's great. And I think that that's. And I agree. I think that you do sometimes appear. That's why some people think you're kind of Christian. Like because you."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":4293.05,"end":4299.69,"speaker":"John Vervaeke","text":"Because you can have Christianity or I can have Christian light. You can choose."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":4299.69,"end":4320.06,"speaker":"Jonathan Pageau","text":"But no, but that, the fact that you. That you seem to have taken up humility and agape and the virtues that Christian recognize as being that which leads towards the good. And because you often embody them, you know, people see you and are so, I mean, are taken by your stance in life."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":4320.86,"end":4321.26,"speaker":"John Vervaeke","text":"So."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":4321.58,"end":4323.3,"speaker":"Jonathan Pageau","text":"Yeah. Don't you agree, Some of you."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":4323.3,"end":4469.84,"speaker":"John Vervaeke","text":"Yeah, Socrates is not my only sage. I have, like I said, I have a symphony of sages. And I. Given what you just did, I hope you'll hear this in the right way. Jesus is also one of my sages and he will, he will always be that. And I've wrestled with that and I've come to leave me, at least now a place of peace around that. So if you're seeing that, I hope this isn't disrespectful. Some of the credit goes to Jesus for me. Some of the credit also goes to Siddhartha and to Socrates. But yes, I want to give. I always like to give credit where credit is due. And so, yeah, I value that. I mean, I've had a tortured relationship at least early on. And you did, too, to some degree with Christianity. And I have criticisms of it and I've voiced some of them, but I always, at least imaginally, for me, like Jesus is alive in me in that way. I don't consider myself a Christian because I think there's other. Because I don't want to water down what I have respect for Christianity. I don't want to water it down. Right. I don't want to. You have specific claims about history, and I. Right. But I just want to give credit. I was brought up and then, you know, and I've returned in some ways to, I hope, a right relationship within myself with Christianity through Tillich and, you know, interacting with a whole bunch of thinkers. David Schindler, who I've now met, you and Paul. And I hope. I feel that there's been a lot of movement within me so that I can, hopefully. I'm invoking, hope I can invoke, hopefully at times, let that part of me shine through in a way that is valuable to other people. That's great."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":4469.84,"end":4470.28,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":4471.32,"end":4473.08,"speaker":"John Vervaeke","text":"So how much time do we have?"}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":4473.4,"end":4474.52,"speaker":"Jonathan Pageau","text":"I think we should end there."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":4474.52,"end":4475.56,"speaker":"John Vervaeke","text":"Yeah. I think we're done."}
{"episode_id":"SW - #290 - 2023-06-06 - John Vervaeke - How to See the End of the World","start":4475.64,"end":4476.12,"speaker":"Jonathan Pageau","text":"Thanks."}
