{"episode_id":"SW - #159 - 2021-05-22 - Montero and WandaVision - How Satanism Functions","start":0.24,"end":1509.49,"speaker":"Jonathan Pageau","text":"The black and red blood injected upside down pentagram sporting Satan shoes by Lil Nas X as well as his serpent alien Satan lap dancing Montero video could only be released a week before Easter. This is business as usual. It has almost become a part of Christian celebrations to expect a few of these smears in the mainstream media before important Christian holidays. There's something boring and tedious about the whole affair. A nicely organized propaganda supply chain with just in time delivery. Nonetheless, beyond my first reaction of dismissal, I found that maybe there's something people might want to understand in these satanic tropes and these satanic moves. None of it is arbitrary, but like any system of meaning, it rather has a strange coherence. And this coherence can give us a few clues as to why this imagery would be used to attract the type of attention someone like Lil Nas X desperately needs in order to stay relevant in a post Christian blase porn infused hungover culture. And I guess I should tip my fedora to Lil Nas X as he does a bang up job at weaving all this imagery succinctly together. But the Lil Nas X situation probably wouldn't have been enough for me to put any energy into this. In fact, there's a second angle entering this article. This video. So many people have been telling me to watch W Division, which at first I didn't want to do, but I end up doing it. And the ending of this series lays out imagery that is very similar to Lil Nas X. And it ends up being like a feminine witchcraft, which contrasts to the more masculine satanic imagery in the Lil Nas X video, while nonetheless playing in similar tones as Montero's hellish carnival. This is Jonathan Peugeot. Welcome to the symbolic world. So before I get on with this. Yes, yes, I remember the so called satanic panic in the 1980s. I remember these pastors telling us about backtracking and how rock songs had secret satanic messages when played backwards. But even as a young teenager, I often wondered why they needed to look for secret messages when the overt messages were pretty clear. You know, you didn't need the backward ones. People are really bad at hiding what they're doing. If you pay attention, they'll tell you what they're up to, especially if you know what to watch for. So the Montero video is a rather disturbing sight to behold in a world inhabited only by virgins of himself. Lil Nas X sings about his intimate encounter. Let's call him, and his obsession with a man who. Who has the same name as him, Montero. And call Me by youy Name is the unofficial title of the song. The video ultimately is about one thing, it's about pride. This self love is represented as an exploration of the strangeness and idiosyncrasies of oneself, self seduction, self victimizing, self abasement, self gratification and ultimately self crowning. In speaking to his self named lover, Montero tells us that I'm not fazed only here to sin. If Eve ain't in your garden, you know that you can. And so pride as self love appears ultimately as a sterile revolution against the natural patterns of the world. A desire for the world to be solipsistic, to be contained by myself, for the world to be in my image, and a desire to be free from the usual constraints of natural patterns and cycles of being. He tells his self named lover that he wants to, let's say, I won't quote it exactly, but let's say to put a child in his mouth. And this is of course the ultimate image of sterility, of solipsistic dreaming, of this imagination, which is taken up in fantastical places, but does not produce body, community or cohesion, but only causes revolution, fragmentation and ultimately loneliness. Montero tells us that what he wants to do, he wants to do to the ones he envies. And we have entered the pattern of revolution, of attempting to come up, then come in from behind. So we find Montero under the Tree of Knowledge in the primordial garden, where he's first frightened but then seduced by a serpent figure. The serpent figure is a hybrid. In the tradition of Renaissance depictions of the serpent, which have often been linked to Lilith by historians, the hybrid also takes on the imagery of the alien. So of course, this hybrid alien demon serpent figure is one that has become the narrative monster of conspiracy theorists from David Icke to Qanon. So it could be easy for many to dismiss all of this as a kind of trolling. And this is indeed the game being played, I think. But there's something else going on. Because even if it is just trolling, the question remains, why does Montero invoke this very precise imagery in this video to gain attention, to provoke, to subvert? Well, yes, yes and yes. But the error that we might make is to believe that it stops there, that such an answer somehow explains what is actually happening. But in search of a more subtle understanding, one needs to ask, first of all, why these elements, these narrative elements, crystallized the fears and worry of so many people at the time they did. And then especially we need to ask why someone Like Montero is allowed to embody these fears so perfectly at this moment in order to increase his fame. Of course, it's about attention. But the reason why certain things will bring you attention rather than condemnation or just lack of interest at certain moments in a cycle of attention is not arbitrary at all. And understanding this can help us understand where we are going in our social narrative. So whether or not Lil Nas X is an actual literal Satanist, this is something that I don't have access to. But even the patterns of the stories that we live and that we tell ourselves, they're not arbitrary. And observing them can help us understand what is going on. So in the video after his seduction by the serpent, it follows Montero to a kind of coliseum where he's chained and judged by cross dressed versions of himself. He's then stoned by these dusty zombie figures that are replicas of him. And then he's finally killed with some disturbing sex toy. So, yeah, he ascends into the sky to meet a shadowy angel, but this pole, this pole lance shoots up from below, and as Montero grabs it, he begins to slide down in the guise of a pole dancer into the belly of hell. And let's be honest, if there was ever was a perfect representation of the, let's call it, ontological reality of pole dancing, I pretty sure this is it. The pole coming up from below is of course, an inversion of the sphere of St. Michael, which is portrayed in medieval imagery as pinning down the great serpent that is Satan coming from above. But now this spear pole is coming to claim Montero from behind, with all the undertones that that also includes. So even though it's coming from below, it's nonetheless the, this axis mundi, the axis of the world, it nonetheless is this hierarchy which connects heaven and earth together. Though now it's not a hierarchy seen from the side of the traditional, let's say, ladder that you see in icons of the ladder of divine ascent, which is going up in humility and worship and self transformation, but rather it's this coming up from behind of revolution. And this type of coming up from behind doesn't end up being going up in the end, it just happens, actually ends up being a coming down, being chased from heaven, which is what you see in the story of the Red Dragon in Revelation that uses its tail to knock down the stars from the sky, and then he ends up falling down onto the earth into the sea. And so it's not the axis from the point of view of the latter, but it's something like this hierarchy from the point of view of the chute or of the serpent sliding down, just like in a. A Chutes and Ladders game. So we see the movement from the periphery, we see it from the wheel that's wrapped around the axis, which turns and slithers and seduces onlookers by its changeability and by leading them into their passions. So Montero is actually replaying the first part of the video here, this part where he was seduced by the serpent which was sliding down the tree, but now he is the serpent who will slide down in order to seduce Satan himself. So ending up in a caricature of hell with the thorn covered door, which is nice touch in terms of symbolism, Montero lap dances Satan into this simulated sexual act to then himself come up behind the evil one to break his neck, to steal his horns and his crown, replacing the devil in what we could call a final revolution, a revolution which is the supremacy of the self. So for a Satanic story, I would say it actually scores pretty well. So you can imagine that the media coverage about this little Nas X scandal has been mostly about how Christians are reacting to it, how they are offended, how they're falling into a new Satanic panic, how they're too stupid to see the provocative humor in the social message. And in all of this, to me, the potential message to the youth in this video is that you can find strength in being exactly who you are, whoever that is. So let's be honest, this is what the whole circus is about. It's about getting attention. Like I said at the outset, it's not arbitrary that this image was put out there just before Easter. You see, Satanism has systematically been about Christianity from its very beginning, and especially modern pop. Satanism, with all the contemporary popular imagery out there, from Anton lavey's celebrity status and his movie acting, to bands like Black Sabbath and other forms of heavy metal Satanism, all these upside down crosses, the black masses, the celebration of sin and of our passions, are all about embodying in a narrative, in a mythological setting, the end of Christianity. And by embodying it's the end of its hold on the mythic narrative or the social narrative. But secretly and unknowingly, it is restating it. But that's for another time that we could talk about that. Once one understands this, many things will appear to us more clearly. Even the ironic aspect of Satanism and cultural provocations like the satanic shoes or this Montero video. You see, Satanism is irony itself, you could say, from its ritual version of the black masses to its more philosophical social manifestation. It is the Christian story restated from its upside down from its narrative margin. Satanism is something like the gargoyle as priest, the rebel as king and the theatrics. The joke of Satanism is one of the most important considerations of its meaning and its purpose, and ultimately of its satanic qualities. So if you ask a Lavey style Satanist about their religion, they'll tell you that they actually don't believe in Satan. This is of course difficult for Christians who order their lives on truth and faith to understand. People ask themselves why would they go to such efforts for something they don't even believe in. And of course such a reaction comes from decent, normal, healthy people who can't see how there's nothing more satanic than believing both God and Satan actually don't exist though, all the while acting in this self righteous pride and resentment in order to offend Christians and destroy their hierarchy of meanings by ritually and mythologically embodying everything that Christians oppose. Always remember that the Montero video ends with the putting of the Satanic crown on oneself. All of this is what happened recently in the whole Baphomet statue hubbub that surrounded the satanic temple in the United States. In embracing the very ambiguous and egalitarian American notion of religious freedom, these satanic prancers are able to show how Americans are potentially Satanist because they must equally an emphasis on equally include the parody and opposite of what most of them believe in. In a traditional world, there's a hierarchy. The monsters, the demons, the gargoyles and especially the Satan or the opponent are on the outside, or they're underground, they're below us, and it's best to actually not even pronounce their names. But now, in the context of liberty and equality driving social forms, the figure of Satan begins to appear as a dark prophet of the modern world. A noble Promethean who tragically stood against authority and declared himself equal to that which was above him. In the Montero video, Lil Nas X gets it right. Satanic imagery has never ultimately been about worshiping the devil, but rather about embodying the revolutionary pattern through the type of pride exemplified by Satan in his war against heaven and which ends with self worship, self crowning. And obviously it can't really end that way. For Montero's only claim to the crown of horns is violence and revolution. Which means that there is always another pole riding, lap dancing, you know, person in line waiting to kill Montero and to take the crown from him. But let's just say that that's another story as well. One of the tropes of the anti Christian religious scholar of the past decades has been to point to how idiosyncratic the devil of pop Satanism actually is. The brooding red demon, the horns, the trident, the goat like appearance. All of this, they tell us, is just an early modern development which grew with layers of additions in time from this horned monster that we see present in late medieval images of the Last Judgment through these frenzied descriptions of witches and devils in the Malleus Maleficorum. This Malleus is the hammer of witches, which was the famous text used in early modern witch trials. We move then to Milton's Lucifer and Faust's Mephistopheles. So these pompous religious scholars remind us that this figure has little to do with what early Christians believed. And as usual, these scholars, for all their factual accuracies, are simply missing the point. The transformation of the evil one from a shadowy and ambiguous character into in early Christian and even Jewish imagination to the tragic romantic figure he has become is one of the narrative threads we could follow to trace the development of Western society all the way into our present state of crisis. This narrative development does not end in Milton, but actually continues to grow in post Milton representations, such as the one we see in Neil Gaiman's the Season of Myst graphic novel. This characterization has actually become the basis for the Lucifer Netflix show. So historically, this transformation actually follows the return to pagan references. And this return has been a tool of revolution from the beginning. It becomes an image of secularism which informs much of the Renaissance and Enlightenment and accelerates into the modern age. In fact, the culminating figure of Satan in popular imagination. This figure that attracted Mick Jagger's sympathy has its precedent in Aeschylus. Prometheus bound, this ancient Greek tragedy, the Titan, punished for bringing humans knowledge, is presented as a noble resistance to the tyrannical father. And seeing all this, one will come to realize that there's absolutely nothing arbitrary about the golden Prometheus statue in Rockefeller Plaza. All of this follows a narrative thread which is the very story of modernity. So the reason why the Satanic temple wanted to put up this stupid image of Baphomet in the United States is, believe it or not, the culmination of the same process which made Napoleon Bonaparte feel his Arche de Triomphe with Roman gods. And I wonder if Napoleon could perceive that this gesture of declaring himself emperor while putting a crown on his own head would culminate in the solipsistic video by a pole dancing rapper who seduces the devil to then only kill him and put the crown on himself. One of the historical moments where we can trace the origin of modern occultism and Satanism is when the Knights Templar were disbanded in the 14th century. The legitimacy of the accusations made against them is still being discussed interminably by historians, but in terms of social narrative, it doesn't matter so much if you believe the accusations against the Templars or not. It is quite possible that they did not practice sodomy, they didn't blaspheme against the cross or worship a strange God named Baphomet. In the same vein, in terms of what we're seeing today, it doesn't matter if you believe the accusations against witches in the early modern period, either of these descriptions of their Sabbat masses and their fornicating with demons. Of course, one could argue about this in historical terms, and people can do this interminably until they forget the original point of why such an accusation matters. What matters most is how these new possibilities which appeared at the end of the Middle Ages, became something like a narrative space where the opposite of Christianity, which was more implicit before, began to explicitly take form in the form of explicit sacrilege and certain types of parody, of inversion and ultimately embracing the opposite of everything that crashed Christians to valued. So we mostly need to see these accusations as an opening up and recognizing of certain possibilities. We could call it something like a narrative space which showed us the edge and the end of Christianity. And this Antichrist was slowly filled as Christianity itself began to falter and to break apart in the modern age. And it was through these very tools and this very imagery, whether consciously or unconsciously, that Christianity would be attacked by its own dissidents. It's by these very means that it would be inverted and subverted until even these new pseudo religions like Satanism and Wicca would explicitly take on, identify and expand the very tropes which were manifested in those early modern fears. And so even if the accusations against the Templars were fabricated, we arrive nonetheless through a strange process of development. Through the enlightenment to the 19th century, to the occultists there, like Elifas Levy and Aleister Crowley, through Bulgakov and, you know, the band Slayer. We come to a point where we have this massively popular and honestly, not at all edgy video which won attention for its sacrilege and allusion to being sodomized by a devil. Ultimately, the figure of this devil is itself a culmination of this late Medieval Baphomet who haunted the templars in the 14th century. You see, stories have patterns. Stories play themselves out naturally. And once the narrative elements have been cast, there will always be people, events and organizations to embody them in a very factual and incarnate way. But the material causes by which this will happen are actually quite secondary to the more spiritual reasons. You see, when Christ said, judge not lest you be judged, this was not just this finger wagging, moralizing. He was telling people how reality works, how the projection of our sins unto our enemies, this focused attention on the sin of others, opens up the space of our own end. It gives us a glimpse of what is possible in the story. It gives us a riddle of our own sphinx. And it is by this very sphinx that we run the danger of being devoured. Besides the strange movement from Baphomet to Montero, a good example to help people understand what I'm trying to describe and what is happening is that according to the Malleus Maleficarum, this book about witchcraft that I mentioned earlier and that was published in the late, early modern period, according to this book, the purpose of witches was to prevent normal reproductive relationships between men and women doing this out of resentment. And they accomplished this by several by, for example, seducing men away from their wives, by using disincarnate female demonic phantasm or succubi, so that men would lose their seed, by making it so women have children from incubi, these demonic males, but actually also through, let's say, through the material causes of having children by other men besides their husbands, and also by killing and harming children, aborting babies, and ultimately, yes, by removing the male member altogether. So 200 years ago, I might have been mocked, maybe not even that long ago, by the will to do, for suggesting that a group of people would want such a thing for the world. And to be honest, I can understand why the Catholic Inquisition actually rejected the contents of this book and also rejected those that wrote it and were the proponents of its content. But if we see rather these dark descriptions as something like a narrative arc, which is moving towards the end or the dissolution of Christianity, we only have to ponder a moment to realize that whether it is pornography, artificial insemination, whether it's the proliferation and acceptance of abortion, or even young boys that have been put on hormone blockers, I can find prominent contemporary examples of all the ancient witchcraft I just mentioned. So that the early modern witches might have been projections or collective dreams. It's possible, and people will argue either way, is Actually not that important to us, and we shouldn't waste our energy on that. What matters now is that these witches are healthy, unabashed, and they're winning the culture war today. So in the show WandaVision, which by the way, I will definitely spoil for you now, so be warned, the Scarlet Witch, a Marvel hero with magic powers, creates a Matrix style simulation in a small town, a safe place, in order to preserve and simulate the artificial existence of her robot husband. Vision. Vision. An AI with a robot body is the perfect man, the wisest, the most moral, the most well intentioned man you could ever imagine. Such a perfect AI character, a living soul which is actually worth torturing to preserve. That this is presented to us so straightforwardly at this moment in history and with everything that's happening with social media and around us, should already send icy shivers down all our spines. This simulated world that Wanda has created goes so far as to generate simulated children. Her virtual reality takes on the form of sitcoms across the decades. But for the inhabitants of the town, this manifests itself as mind control. The entire town is controlled and tortured by Wanda into doing her will and playing the characters in her her sitcom. But when they're off screen, the other people in town actually almost cease to exist. Occasionally in the story, the spell that Wanda has on them breaks loose for a moment and we see these tortured souls peek out."}
{"episode_id":"SW - #159 - 2021-05-22 - Montero and WandaVision - How Satanism Functions","start":1510.05,"end":1511.33,"speaker":"WandaVision Character","text":"You have to stop her."}
{"episode_id":"SW - #159 - 2021-05-22 - Montero and WandaVision - How Satanism Functions","start":1511.33,"end":1511.97,"speaker":"Jonathan Pageau","text":"Stop who?"}
{"episode_id":"SW - #159 - 2021-05-22 - Montero and WandaVision - How Satanism Functions","start":1512.21,"end":1515.33,"speaker":"WandaVision Character","text":"She's in my head. None of it is my own."}
{"episode_id":"SW - #159 - 2021-05-22 - Montero and WandaVision - How Satanism Functions","start":1515.57,"end":1591.38,"speaker":"Jonathan Pageau","text":"We see them pleading to be let go, pleading for the incessant pain to to stop, pleading at least for their children to be set free as the young ones are being controlled by Wanda as well. And all of this for a simulated media reality. Now such a chilling premise can be imagined in a story where the resentful supervis, supervillain, the totalitarian AI or the 1984 style government is imposing a false reality and controlling people's every action and thought. So what is presented in WandaVision is a version of the Matrix. But strangely enough, from the point of view of the Matrix itself, the torturer, the controller, the dictator is the main character. And although what Wanda's doing is presented to us as being immoral, we're nonetheless called to have far more compassion for her and her suffering for having lost this artificial husband. More compassionate for her imaginary children than we are supposed to feel for the children and townspeople she's torturing. All of the supporting characters are trying to save Wanda. And when the zealous leader of the government team that's there to deal with the situation tries to kill her to stop this. He's the one who's presented as the villain."}
{"episode_id":"SW - #159 - 2021-05-22 - Montero and WandaVision - How Satanism Functions","start":1596.26,"end":1597.3,"speaker":"WandaVision Character","text":"Have fun in prison."}
{"episode_id":"SW - #159 - 2021-05-22 - Montero and WandaVision - How Satanism Functions","start":1599.39,"end":1621.79,"speaker":"Jonathan Pageau","text":"So yes, yes, the fact that the witch is using media to control the narrative, to torture us all by imprisoning us and preventing us from communing with each other, that's a bad thing. But one must understand that the witch has her reasons. And her reasons, what are they? They're to preserve, foster this unholy union with technology and artificial intelligence."}
{"episode_id":"SW - #159 - 2021-05-22 - Montero and WandaVision - How Satanism Functions","start":1622.59,"end":1627.95,"speaker":"WandaVision Character","text":"They'll never know what you sacrificed for them. It wouldn't change how they see me."}
{"episode_id":"SW - #159 - 2021-05-22 - Montero and WandaVision - How Satanism Functions","start":1628.77,"end":1642.37,"speaker":"Jonathan Pageau","text":"Seriously, folks, this is the actual premise of the show. There's an insane moment where a mother pleads with Wanda to at least let her child come out of her room so that she can take it in her arms."}
{"episode_id":"SW - #159 - 2021-05-22 - Montero and WandaVision - How Satanism Functions","start":1642.77,"end":1647.65,"speaker":"WandaVision Character","text":"Really anything. If you could just let her out of her room. If I could just hold her, please."}
{"episode_id":"SW - #159 - 2021-05-22 - Montero and WandaVision - How Satanism Functions","start":1647.89,"end":1708.85,"speaker":"Jonathan Pageau","text":"I mean, I swear I could almost see the mother in a medical mask when I heard this. When I was watching this. At some point I started to ask myself if this strange premise was not secretly some very strange and ingenious argument for witch burning. I'm sure in the Malleus Maleficorum there's definitely a section about witches forcing all reality to follow their whim in order to avoid real masculine feminine union, real relationships, and ultimately to preserve artificial men and solipsistic fantasy children. I'm sure it's there somewhere. I. I need to go back there and check. But joking aside, one can easily see how this is all related to Lil Nas X's Montero and his satanic shoes. Through a strange mixture of victimhood and pride coming together. Just as Montero populates his own world with himself, obsessed with his self named lover, so too Wanda has bent all minds to her own whims and made them expressions of herself."}
{"episode_id":"SW - #159 - 2021-05-22 - Montero and WandaVision - How Satanism Functions","start":1709.44,"end":1714.4,"speaker":"WandaVision Character","text":"We feel your pain. Your grief is poisoning us. No, stop. Please let us go."}
{"episode_id":"SW - #159 - 2021-05-22 - Montero and WandaVision - How Satanism Functions","start":1715.44,"end":2036.6,"speaker":"Jonathan Pageau","text":"So this is truly the place where western individualism shows its satanic colors. If in American movies we're used to that scene at the end, you. Everybody has seen these where all the characters in a crowd, you know, all the other. All the other characters in the movie, usually with a huge crowd, will applaud the protagonist. And the protagonist is a stand in for the individual, but mostly for the underdog. But here in this version, we see the individual with its idiosyncrasies, with all her his. Their fluid desires and whims, imposing themselves as something to which all of society must bend and transform. In Montero's hell We see this engraving in flaming letters. We see the famous Latin phrase abnant quod non intelligent, which means they condemn that they do not understand. And what is wanted through these narrative tropes is ultimately the opposite of that. Something like the misunderstood will condemn them. Something like the exception will invalidate the rule. So if in the Christian vision, the shepherd is willing to leave the flock, to even leave it unprotected, to go out and find one lost sheep, here, we rather have this lost sheep demanding that the shepherd not bring the sheep back to the flock, but rather bring the entire flock out into the wilderness. So if in traditional societies we see this scapegoat mechanism of sacrificing the exception in order to preserve coherence, here it is the opposite of that. It is a desire to sacrifice the entire world for the exception. On a social level, this is what appears as upside down hierarchies, where the strange, the impure, the exceptional, the fluid, the rejected, the sick and the unknown become not those we need to help, but they become a new measure by which all of society is evaluated. And so it's only in that sense that the backtracking fears of my 80s youth pastor regarding rock music, just like upside down crosses and upside down pentagram, can make sense as a basic narrative intuition. The intuition that the satanic, like a massive carnival on the edge and the end of the Christian world, is acting like an evil Christian jester who wants to be king, who's turning, mocking, embodying the upside down of Christianity, both morally and ritually. What makes him different from a regular carnival is that this jester is also trying to put the crown on his own head because of a consideration for the victim. Many of our contemporary social manifestations can dupe Christians into thinking that what is happening is is aligned with their values. But stories like WandaVision can help us realize how the very opposite is the case. Whether it be the willingness to destroy our social fabric for the sick, whether it be the advent of woke victimhood, culture and its desire to make inclusion the purpose for any group, any sports team, any church or corporation, what we're witnessing is the reverse of Christianity. In his book Live not by Lies, Rodrier points us to Rene Girard's piercing of this upside down scapegoat mechanism as being the driving force of our entire post Christian society. Inciting Girard Dreyer reminds us how the current process of spiritual demagoguery and rhetorical overkill has transformed the concern for victims into a totalitarian command and a permanent inquisition. We are living through a caricatural ultra Christianity that tries to escape from the Judeo Christian orbit by radicalizing the concern for victims in an anti Christian manner. It's important to be aware of what is happening so as to not be duped by Antichrist, as Christ warned us. But underneath all the scandal, all the sacrilege and reversals, there's actually a secret story happening through all of this. And, and I've hinted at it in my video already, watching someone like Lil Nas x Mox deride and invert our stories to the cheers of the media and the cultural gatekeepers, we must remember that Christ chose Judas, who would betray him from within his inner circle. In the same manner, our current situation is part of the story, and the satanic imagery, for all its arrogance and pride, exposes in plain view the underbelly of modern secularism. And though this imagery appears as a manifestation of where Christians have failed, it is nonetheless a restating of the Christian story through attention to its opposite. An upside down world, a solipsistic, sterile and artificial world, must inevitably flip back. The glorification, even in spiteful jest, of Satanic tropes of rebellion reminds us that it is only the Crucified One and the story of self sacrifice which breaks those unending revolutions."}
{"episode_id":"SW - #159 - 2021-05-22 - Montero and WandaVision - How Satanism Functions","start":2038.76,"end":2061.23,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion."}
{"episode_id":"SW - #159 - 2021-05-22 - Montero and WandaVision - How Satanism Functions","start":2061.23,"end":2062.59,"speaker":"Jonathan Pageau","text":"I will put a link to that."}
{"episode_id":"SW - #159 - 2021-05-22 - Montero and WandaVision - How Satanism Functions","start":2062.67,"end":2103.76,"speaker":"Jonathan Pageau","text":"In the show description and so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially going to www.thesymbolicworld.com support or else on Patreon Pajot Videos as well and on SubscribeStar all those links you can find on my website or in the show description. So thank you and I will see you soon."}
