{"episode_id":"SW - #271 - 2023-01-27 - The Plagues Of Egypt","start":0.24,"end":3224.41,"speaker":"Jonathan Pageau","text":"That it's interesting to notice that when the magicians are doing the plagues, it's funny that they just reproduce the plagues which is causing them harm instead of healing the plagues. Right? They're not stopping the plague. They're just showing that they can do the same. And so they're actually increasing the plague through their magic rather than stopping it. Because you'll see, right, in the story of Exodus, you'll see places where the Israelites have issues and. And God solves their issues, like he helps them. It's not like the, you know, I don't know, the snakes in the desert biting the Israelites, and it's like, oh, this is a sign from God. So Moses shows he can make snakes also bite the Israelites. No, it's like God is healing them, but here the magicians just repeat the same magic and ultimately harming their own land at the same time. So it's very interesting to see that. This is Jonathan Pedro. Welcome to the symbolic world. Hello, everyone. As you can see, I am not in my usual place. I am actually right now with Jordan Peterson and the Daily Wire recording the second part of the Exodus series. As you know, the Exodus series has been. Daily Wire has been putting it out for the past few months, I guess, coming out episode by episode. And they told me, to my surprise, that it is their most popular special and it has been watched by at least 2/3, maybe more of their. I think. I think that's about two thirds, maybe even three fourths of their subscribers, which is pretty astounding. And so I'm pretty excited to be doing the second part of this. And in the meantime, we are going to do our own look at the Exodus. We are at chapter five. I'm going to start with the return of Moses and Aaron to the pharaoh, meeting with him, the pharaoh's resistance, ultimately leading to the 10 plagues. I know the 10 plagues are very mysterious for people, and so hopefully this will be helpful for people to realize, to see what's going on. So before we start, a few things people need to know that it might be hard for you to know if you're not following me very carefully. The. The Q and A that I used to do every month was difficult to manage and kind of chaotic, and we didn't know how to do it. And so at least for now, we've decided to do it for Patreon only, just to make it more intimate and so that people can engage more. I really would like to be able to engage with the people but when it was public, it would just get crazy with all the comments and everything. So for now, we're doing it for subscriber only. As you might have noticed, I have a new website, we're working on a new brand, but the website is broken and we're working like mad, like crazy to fix it for you guys. And by the end of January, we hope by the end of January we will have everything together. Subscribers will be able to subscribe and get all their material. Everything will be back to normal. But for now, if you want to access Patreon subscriber only video, sadly, the only way to do it properly is to support me on Patreon rather than through the website. On Patreon, everything is there, all the videos, everything is available. And hopefully by the end of the month this will be true as well on on the website. Another great thing that's happening is that God's dog is out for people to buy. Sadly, those in Europe that supported me on indiegogo still have not gotten their books. Don't worry, we are working like mad again to get this to happen. We had serious legal problems. For some reason, the UK refused our VAT application and so we were scrambling to find new solutions. But don't worry, you'll get your books. And for all the others, if you haven't gotten it, it's now time to go to godsdog.com and order it. All right, so now let's dive into Exodus. So chapter five. After Moses and Aaron went to Pharaoh and said, this is what the Lord, the God of Israel, let my people go so they may hold a festival to be in the wilderness. Now, this is really important, and I might have mentioned this before, is that it's not just that the Israelites are supposed to go, you know, and this is something which will be seen all through the books of Exodus. It's not just about freedom, which some people sometimes want to weaponize Exodus, to talk about freedom. It is about freedom, but it's not just freedom. Its freedom from the tyrant in order to serve a higher purpose. And so it's, you know, leaving the pharaoh, going to the wilderness to worship God. That is what they're asking the pharaoh. And in some ways that is why it is so dangerous for the pharaoh. Because the pharaoh wants the Israelites to just be, you know, a tool of his power. He wants the Israelites to be reduced to potential for his means. And if they now go out and worship the God of the Hebrews, and at least the way it's presented in this case, it is dangerous for him because it will consolidate them as a people and it will become something like a challenge to his authority over them. And the Pharaoh said, who is the Lord that I should obey him and let Israel go? I do not know the Lord and I will not let Israel go. Then they said, the God of the Hebrews has met with us. Now let us take a three day journey into the wilderness to offer sacrifice to the Lord our God, or he may strike us with plagues or with the sword. But the king of Egypt said, moses and Aaron, why are you taking the people away from their labor? Get back to your work. Then Pharaoh said, look, the people of the land are now numerous and you are stopping them from working. The same day, Pharaoh gave his order, this order to the slave drivers and overseers in charge of the people. You are no longer to supply the people with straw for making bricks. Let them go and gather their own straw. But. But require them to make the same number of bricks as before. Don't reduce the quota. They are lazy. That is why they are crying out, let us go and sacrifice to our God. Make the work harder for the people so that they keep working and pay no attention to lies. And so here we can see again what the Pharaoh is trying to do. He's just trying to crush them and to make them cogs in his machine. Make them work for him and not have them pay attention to what he says or lies, but not pay attention to, to what Moses is calling them to do. Not pay attention to worshiping God and, you know, changing, let's say, transforming their allegiance in that way. And it's interesting because he says, I do not know God, right? It's like, I do not know the Lord. I'm not connected to your God. I don't care about that. I just want, I will be your God. He doesn't say that. But, you know, it's like, I am your God. You do what I say. I don't want you to worship something else beside me. And so what's interesting. And so then he basically says that he will remove the straw from the bricks. And now they will have to get their own straw to make the bricks. Interestingly enough, St. Gregory of Nysa has a very surprise, a very powerful image of what it is that's going on in this. And I think that he captures half of the symbolism, what is happening. So St. Gregor of Nysa says that the Israelites, you know, kind of bending over and gathering clay in order to make bricks has something to do with Death or, you know, we are made out of clay, out of earth and water. That is like the. The stuff that makes us up. And so the idea that the Israelites kind of go down and gather the clay is, for him, an image of, you know, going back down into the lower things, into the desires, into the passions, and into the things that, you know, he imagines the mold of the bricks where you take the clay, you put it into the bricks, and then it empties and you do it again. And it's like this cyclical thing where you're constantly making bricks, but you're never finished. And so this idea of being a slave of desire, and the desire is kind of turning around and around is the image that he finds in that. And even more fascinatingly enough, at the end of his interpretation, he says that the straw is the chaff, the chaff that will be burned, and at the end in the fire. And so he sees these two. The two things that are brought together to make the bricks as clay in the sense of this kind of wet, unformed things that are inside us, like our. Like our desires, but then also these works that are useless that will be burned away by the fire. And so very fascinating. And it captures, I think, half of the symbolism, because the other half has to do with the Tower of Babel. You know, the idea of making. Taking clay and straw and making bricks is something which. The other place in scripture where this is referenced is in the Tower of Babel. And I think that this is to link these bricks and the making of these bricks to the tyranny of the Tower of Babel, into the excess of unity that the Tower of Babel represented. And the Pharaoh now becomes an image of Nimrod and an image of a tyrant that imposes his order on the people. So you kind of have these two extremes, which is the extreme of licentiousness and breakdown and chaos, and also the extreme of tyranny of the Tower of Babel at the same time. If you follow my work, you'll notice that I often try to show how often these two opposites appear together, these two extremes of civilization and of chaos, with ultimately the image of that, of course, being the whore riding the beast in the Revelation. But the idea that these two things are related to is important if you want to understand these stories. Then the slave drivers and the overseers went out and said to the people, this is what the Pharaoh says. I will not give you any more straw. Go and get your own straw wherever you can find it. But your work will not be reduced at all. So the people scattered all over Egypt to gather stubble for use for straw. The slave drivers kept pressing them, saying, complete the work required for you for each day, just as when you had straw. And. And Pharaoh's slave drivers beat the Israelite overseers they had appointed, demanding, why haven't you met your quota for bricks yesterday or today as before? And so this idea of them gathering stubble, I think is important in understanding also the gathering of clay. In some ways, they really are at the bottom of the world gathering all this residue, gathering all this stuff that's unformed. That's their job. And they're trying to bring it together in order to become, in some ways, the support for Pharaoh's authority in Pharaoh's kingdom. Then the Israelites went and appealed to Pharaoh. Why have you treated your servants this way? Your servants are given no straw yet we're told, make bricks. Your servants are being beaten, but the fault is with your own people. Pharaoh said, lazy. That you are lazy. That is why you keep saying, let us go sacrifice to the Lord. Now get to work. You will not be given any straw yet. You must produce your full quota of bricks. The Israelite overseers realized they were in trouble when they were told you are not to reduce the number of bricks required for you for each day. When they left Pharaoh, they found Moses and Aaron waiting to meet them. And they said, may the Lord look on you and judge you. You have made us obnoxious to Pharaoh, and his officials have put a sword in their hand to kill us. Now, another important thing to understand in this text is that it is in some ways also secretly, you could say, or in a hidden way referring to the Sabbath, pretty sure, because there is in some sense an excess of work. And so the Israelites are asking the Pharaoh to let them set aside a time to worship their God and to stop their work. And the Pharaoh is saying, no, you must work and you cannot rest. You cannot rest from your work. And if you want to rest, I actually going to increase your work and I'm going to subsume you under work. And so you, you have to understand that in relationship to the six days of creation, you know, and the number six in general, if you followed a little bit my, my interpretation of the symbolism of 666 and this idea of creation, of perfection of creation or excess of perfection in the, in the world of work and of creation and, and a refusal to have the Sabbath and the day of rest which is set aside, which is both rest, but also at the same Time set aside for God as a holy thing. So this is also what's going on. And so this will. It's also pointing to the commandments which are coming, which will highly emphasize the idea of the Sabbath as being important to the normal cycle of things. Moses returned to the Lord and said, why, Lord, have you brought trouble to this on this people? Is this why you have sent me? Ever since I went to Pharaoh to speak in your name, he has brought trouble on this people, and you have not rescued your people at all. Then the Lord said to Moses, now you will see what I will do to Pharaoh. Because of my mighty hand, he will let them go. Because of my mighty hand, he will drive them out of his country. God also said to Moses, I am the Lord. I appeared to Abraham, to Isaac and Jacob, and as God Almighty, but by my name, the Lord, I did not make myself fully known to them. I also established my covenant with them, to give them the land of Canaan, where they resided as foreigners. Moreover, I have heard the groaning of the Israelites whom the Egyptians are enslaving, and I have remembered my covenant. So it's interesting because what you're seeing in some ways is that you know God in some ways, hardening of the Pharaoh's heart and the fact that the Pharaoh is persecuting you is going to play a role in me revealing myself more fully. And so he says, by my mighty hand, right, he will let them go. And then he switches and says, you know, I didn't reveal my name to the patriarchs, and I am revealing my name which is being itself, right? Which is I am to you at this moment. And so there's an interesting sense in which through the slavery, although, you know, the slavery wasn't good, through the tyranny, through all of this is forged something which will ultimately, as let's say, the arc of the story manifest itself, will reveal the name of the Lord and the people of God. Ultimately, therefore, say to the Israelites, I am the Lord, and I will bring you out from under the yoke of the Egyptians. I will free you from being slaves to them. And I will redeem you with an outstretched arm and. And with mighty acts of judgment, I will take you as my own people, and I will be your God. Then you will know that I am the Lord, your God, who brought you out from under the yoke of the Egyptians. And I will bring you to the land I swear, with uplifted hand to give to Abraham, to Isaac and Jacob, I will give it to you as a possession I am the Lord. So here we see again the same extension of what I just said, which is, before they entered into Egypt, they were not a people. They were a family. They were, you know, 12 sons of Jacob. But now they have become a people in the foreign land. They have multiplied and have become not yet a people. They've kind of become the. At least they've multiplied. And now God has to pull them out of the tyranny in order to form them as a people and reveal his name in that people. So it's a gathering of a body, right? This body now it tends up to God, so becomes a people, but it also reveals the higher part in. In them as well. And so all of that goes together and functions together. Moses reported this to the Israelites, but they did not listen to him because of their discouragement and harsh labor. Then the Lord said to Moses, go tell Pharaoh, king of Egypt, to let the Israelites go out of his country. But Moses said to the Lord, the Israelites will not listen to me. Why would Pharaoh listen to me, since I speak with faltering lips? So the rest of the chapter is actually a genealogy. And so I will not read the entire genealogy, but what I will mention to you is just one little part of the genealogy, which is a surprising part. Starting at verse 20. It says, Amram married his father's sister Jochebed, who bore him Aaron and Moses. Amram lived 137 years. Years. This is important because in the story of Aaron and Moses, there is what in the law would be considered incest. And so, you know, it's very important to see that, you know, if you listen to what Matthieu said, interestingly, you know, with Jordan Peterson, he really nailed it in terms of explaining this, is that there's a. The question. One of the questions in Scripture is about who is the stranger that loves you? That's the way I think that Metir phrased it. That is, how far can you engage with otherness or with something else without losing yourself and finding the right. The right binding, you could say. And so here you see something like a relationship which is too close, but is also at the origin of a new world, you could say. And so this is something that you see. If you look at the pattern, you'll see that this relationship is there in many places where there's, like, a new beginning. And people ask that question about Adam and Eve, right? They say, how does that work? Like, how is it that, you know, the children of Adam and Eve, who were they marrying? And the answer is that they're marrying their sisters, you know, but you'll see that at every place where there's like a major transition of world. You know, Abraham is married to his sister, Lot had children with his daughters. And there you see it very clearly because it's like at the end of the world, you know, Sodom and Gomorrah is destroyed. It feels like everything is done. And then the restarting is a relationship that is too close. And there are many versions of that. And now again, in the version of Moses and Aaron, they are the result of someone marrying their father's sister. And so it is a kind of confused beginning. It's like a little circular thing which restarts, kind of re jumps the symbolism. And so this is something which for Christians will actually be brought all the way into Christian symbolism in ways that sometimes notice. And it's, in some ways it will be rectified because it won't be scandalous the way that it's scandalous in the Bible stories. But in the imagery of the mother of God, you will find that the mother of God represents in her own symbolism, both the mother of Christ, but also the bride of Christ. Now, it does not imply in any way an improper relationship between Christ and his mother, as they were both virgins. And. But what it does is it takes the symbolism of the relationship of a kind of very close relationship where she's at the same time his mother and his bride. And it elevates it in a way that avoids the scandal, but helps you understand the symbolism of a new beginning or something that is both the end and the beginning at the same time. So this symbolism is very important. And we'll see later in Exodus how, you know, the question of the wife and the wife that's too close or the wife that's too far will appear in different places. And of course, in the rest of the Bible, you know, you know many stories about that, whether it's, you know, Solomon, who had too many strange wives. You know, there are all kinds of versions of this, this story of how it is, you know, the idea of finding the proper, the proper potential, the proper body with which to engage. All right, so then the Lord said to Moses, see, I've made you like God to Pharaoh. And your brother Aaron will be your prophet. You are to say everything I command to you and your brother Aaron is to tell Pharaoh to tell the Israelites, go out of this country. But I will harden Pharaoh's heart. And though I multiply my signs and wonders in Egypt, he will not listen to you, then I will lay my hand on Egypt, and with mighty acts of judgments, I will bring out my divisions, my people, the Israelites and the Egyptians will know that I am the Lord when I stretch out my hand against Egypt and bring the Israelites out of it. Moses and Aaron did just as the Lord commanded him. Moses was 80 years old and Aaron 83 when they spoke to Pharaoh. That's crazy that they were so old. We often can't. Don't imagine it that old, but, yeah, pretty wild. And so again, we see this subsidiarity. We see how in some ways God is already setting up this interesting hierarchy. You know, that it's like you are be like God to Pharaoh and Aaron will be your prophet. It's similar to when God said to Moses, I will be your God. And, you know, you will be Aaron's God. It's very similar to this. You know, it's like setting up a fractal version of the normal hierarchy of being. So it's like a little version of the way in which it works at a higher level. So it's just interesting to see that happening and being repeated over and over. And so then I will. I will skip this last little part. Of course, it's the same story at the beginning. Now we see it played out. The snakes become rods, the rods become snakes, and the rods of Moses eat the rods of the Egyptians. And so it's interesting because people often think that it's the snakes, that the snakes ate the snakes of the others, but it's the rod that eats the staffs eat the snakes of the others. And it's like the structure that, you know, the vertical that Moses and Aaron is proposing, the hierarchy that they're proposing is shown to be superior than the Egyptian one. And that is why it devours their staff. It's like the other one gets subsumed into it. And it's funny because you could say, you know, that's ridiculous, right? It's like the idea that Egypt will be subsumed into Israel, you know, how silly is that? And, you know, God plays the long game, my friends. And, you know, when the Egyptians converted to Christianity at the beginning of the Christian era, you can imagine what kind of celebration there was in terms of understanding that the prophecy something. The prophecy of something like the rod of Moses completely devouring the rod of the Pharaoh is. It happened, just took a while, but it did completely happen in every single way. And so it's important to keep that in mind. You know, sometimes we biblical scholars will kind of mock these stories and say, oh, it's just a bunch. It's a bunch of slaves in Egypt. You know, these little tribes in Egypt trying to play themselves off as if they're better than the Egyptians, and they're just kind of bragging and it's ridiculous. The Egyptians have no record of this. Blah, blah, blah, blah, blah. But then ultimately, that's what happens. Ultimately, the Egyptians convert. So. So there you go. All right. And so we will move on to the plagues. Then the Lord said to Moses, pharaoh's heart is unyielding. He refuses to let the people go. Go to Pharaoh in the morning as he goes out to the river. Confront him on the bank of the Nile and take in your hand the staff that was changed into a snake. Then say to him, the Lord, the God of the Hebrews has sent me to say to you, let my people go so that they may worship me in the wilderness. But until now, you have not listened. This is what the Lord says. By this you will know that I am the Lord. With the staff that is in my hand, I will strike the water of the Nile and it will be changed into blood. The fish in the Nile will die and the river will stink. The Egyptians will not be able to drink its water. The Lord said to Moses, tell Aaron, take your staff and stretch out your hand over the waters of Egypt, over the streams and canals, over the ponds and all the reservoirs, and they will turn to blood. Blood will be everywhere in Egypt, even in vessels of wood and stone. Moses and Aaron did just as God had commanded. He raised his staff in the presence of Pharaoh and his officials and struck the water of the Nile, and all the water was changed into blood. The fish in the Nile died, and the river smelled so bad that the Egyptians could not drink its water. Blood was everywhere in Egypt. The Egyptian magicians did the same thing by the secret arts. Pharaoh's heart became hard. He would not listen to Moses and Aaron, just as the Lord had said. Instead, he turned and went into his palace and did not take even this to heart. And all the Egyptians dug along the Nile to get drinking water because they could not drink the water from the river. And so you can say in some ways, the symbolism of the first plague seems to be related to the symbolism of all the plagues together. There are some interesting. St. Ephrem the Syrian, in his commentary on Exodus, make some interesting statements about that. And there's a thing about how the Egyptians killed the Hebrew babies and threw the Hebrew babies into the Nile, and then the fish ate the Hebrew babies. And he sees this as the beginning of almost like a redress of the situation where by changing the water to blood, then all the fish in the. The rivers died. All those fish that ate the babies, the Hebrew babies. So it's an interesting image that he brings about, but ultimately it has to do with kind of saturation, you know, moving from water, which is something like no identity, right? Or something like. It's something like lack of identity. And then the other one, blood, which is something like saturation of identity, which is something like, you know, the fully human liquid, you could say maybe that's the best way to understand it. And so, you know, we drink water, we don't drink blood. Of course not. That's the. That's the thing you, you wouldn't do. And so you move from one to the other, right, from the primordial liquid to, let's say the created, the final. The most human liquid, you could say. And it also has to do with death. Of course it has to. I mean, because obviously if blood is outside your body, it is related in many ways to death. But ultimately, I think I mentioned this in the last video for Christians at least. We have to understand that this is pointing us straight to the wedding of Kana, straight to Christ changing water into wine. And it can actually help us understand the wedding of Kana, because at the wedding of Cana, Christ immediately knows when his mother asks him to change to provide wine. He understands that by changing water into wine, he will lead to the death of the firstborn. And that's why it's so weird. That's why he says, my time is not yet come. And so here in the plagues of Egypt, that is what is now starting, is that, you know, by changing the river of the Nile to blood, the place where the Hebrew babies were throne, we are already hinting at the death of the. Of the firstborn, which is coming. The interesting way to understand the. The plagues is to really see them structurally. So we're going to go through the plagues and, and we're going to start to see that there's an actual structure in the way that the plagues are set up. And it has something to do with an undoing of the world, all right? And so seven days passed after the Lord struck the Nile. Then the Lord said to Moses, go to Pharaoh and say to him, this is what the Lord says, Let my people go so that they may worship me. If you refuse to let them go, I will send a plague of frogs on your whole country, the Nile will teem with frogs. They will come up into your palace and your bedroom and unto your bed, into your houses, on your officials, on your people, and into your ovens of kneading throws. The frogs will come up on you and your people and all your officials. And the Lord said to Moses, tell Aaron, stretch out your hand with your strap over the streams and canals and ponds and make frogs come up on the land of Egypt. So Aaron stretched out his hand over the waters of Egypt. The frogs came up and covered the land. But the magicians did the same. By their secret arts, they also made frogs come up on the land of Egypt. Someone pointed out to me recently, I think I saw it in a video, that it's interesting to notice that when the magicians are doing the plagues, it's funny that they just reproduce the plagues which is causing them harm. And, and that instead of healing the plague, right, they're not stopping the plague, they're just showing that they can do the same. And so they're actually increasing the plague through their magic rather than stopping it. Because you'll see, right, in the story of Exodus, you'll see places where the Israelites have issues and God solves their issues, like he helps them. It's not like the, you know, I don't know, the snakes in the desert are biting the Israelites and it's like, oh, this is a sign from God. So Moses shows how he can make snakes also bite the Israelites. No, it's like God is healing them. But here the magicians just repeat the same magic and ultimately harming their own land at the same time. So it's very interesting to see that. And so, but what's interesting, you can start to see the structure. And I'm going to tell you what it is, you're going to start to see it is that it's an undoing of the world from below, moving above. And so, you know, creation manifests itself from heaven down to earth. And now what we're seeing is things, you know, the, the water turning into blood and then out of this water coming frogs. Now the frogs are hybrids, they're amphibians, they are monsters ultimately, because they live both on earth and in water. And this is how Saint Gregor of Nyssa sees it. He sees the frogs as these, this like half formed creature, this monster that, that is in between water and earth. And so because of that represents also all these things from below, all our passions, all these desires that we have that are kind of rising up and taking over all the aspects of Egyptian life. And so it's important because it says the frogs infect every aspect of the world, from the private to the public, you know, from food making to the official to the very hierarchy. So you can imagine with the water turning into blood, it's kind of bubbling, and then out come the frogs. And the frogs start to infect parasitically, everything that the entire structure of the Egyptians. Pharaoh summoned Moses and Aaron and said, pray to the Lord to take the frogs away from me and my people, and I will let your people go to offer sacrifices to the Lord. Moses said to Pharaoh, I leave you the honor of setting the time for me to pray for you and your officials and your people, that you and your house may be rid of the frogs, except for those that remain in the Nile tomorrow, said Pharaoh. Moses replied, it will be as you say, so that you may know that there is no one like the Lord your God. The frogs will leave you and your houses, your officials and your people. They will remain only in the Nile. They will return to the waters. And now they will be contained in the waters. It's important that the way it's present is that they're coming out of the waters, right? They're kind of coming out of the chaos, coming out of this lower reality and now moving up. And so, you know, Moses says, I'm going to now re put them back in the lower waters. They'll be contained by the Nile. After Moses and Aaron left Pharaoh, Moses cried out to the Lord and the frogs he had brought on Pharaoh. And the Lord did, when Moses asked. The frogs died in the houses, in the courtyards and in the fields. They were piled into heaps and the land reeked of them. But when Pharaoh saw that there was relief, he hardened his heart and would not listen to Moses and Aaron, just as the Lord has said. And the piling of frogs into heaps is important as well. There's a difference in the Bible between a mountain or a hierarchy and a heap. A heap is like a fake. It's like a mound of something, but it's like a chaotic mound. It doesn't have order, right? It's not a properly ordered thing. So it's like a mass of chaos which is heaped together. So this idea of heaping things, dead things, heaping dead things, is an image which contrasts to the notion of a normal, you know, a normal hierarchy of procession from. From a structure. Of course, the Pharaoh does not listen. You know, the story. He will reiterate that at every single plague where he at first says he will do it, and then he hardens his heart, or his heart is hardened, all right. And so the Lord said to Moses, tell Aaron, stretch out your staff and strike the dust of the ground. And. And throughout the land of Egypt, the dust will become gnats. They did this. And when Aaron stretched out his hand with the staff and struck the dust to the ground, gnats came on people and animals. All the dust through the land of Egypt became gnats. But when the magicians tried to produce gnats, the secret arts, they could not, since the gnats were on people and animals everywhere, the magician said to Pharaoh, this is the finger of God. But Pharaoh's heart was hard, and he would not listen, just as the Lord had said. And so here, interestingly, in terms of structure, right out of the water came the frogs. In the creation narrative, what comes out of the water, dry land is pulled out of the water. And so now we're like, a little higher. And now we have another type of chaos which is different from the water, but which is dust. You know, like fragmented, broken little pieces. You know, that's the dust that is gathered to make Adam, but now the dust. Out of the dust comes these parasites, these insects, which now start to infect everything in the land. I'll be honest with you. I don't totally understand why it is that the Pharaoh's magicians can't reproduce this miracle. I mean, if you have some insights, put them in the comments. I will definitely be looking to read to get a sense, if you can understand why you think that this particular miracle, the Pharaoh's magicians, cannot reproduce and why it is said that this particular one is the finger of God. Then the Lord said to Moses, get up early in the morning and confront the Pharaoh as he goes to the river and say to him, this is what the Lord says. Let my people go so that they may worship me. If you do not let my people go, I will send swarms of flies on you and your officials, on your people, and on your houses. The houses of the Egyptians will be full of flies. Even the ground will be covered with them. But on that day, I will deal differently with the land of Goshen, where my people live. No swarms of flies will be there so that you will know that I, the Lord, am in this land. I will make a distinction between my people and your people. This sign will occur tomorrow. The Lord did this. Dense swarms of flies poured into Pharaoh's palace and. And into the houses of his officials throughout Egypt. The land was ruined by the flies. Then Pharaoh summoned Egypt and Aaron and said, go sacrifice your God here in the land. And Moses said, that would not be right. Sacrifices we offer the Lord our God would be detestable to the Egyptians. And if we offer sacrifices that are detestable in their eyes, will they not stone us? We must make a three day journey into the wilderness to offer sacrifices to the Lord our God as he commanded us. So what's important to understand again now, as you can see it, right, it's like frogs, these gnats out of the dust. So now these flies, they're, they don't seem to come out of the ground, but they, you know, they are kind of mid, mid section. They land on things. They land on all the, the objects and they ruin everything. And so it's just like one step higher, you'll see, like the whole thing is kind of like moving up towards the heavens, kind of consuming the entirety of creation. And of course, this is the, the first place where it says that the land where the, where the Israelites were gon is set aside, is protected, right? It's, it's different from the Egyptians. And so it becomes like a, a preserved little ark through the, through the plagues. All right? And so as Pharaoh agrees to let the. Agrees again to let them go. And Moses said he'll pray for them and the flies will go away. So we can kind of skip over that a little, a little faster we get to chapter nine. Then the Lord said to Moses, go to Pharaoh and say to him, this is what the Lord, the God of the Hebrews says. Let my people go so that they may worship me. If you refuse to let them go and continue to hold them back, the hand of the Lord will bring a terrible plague on your livestock in the field, on your horses, donkeys and camels, on your cattle, sheep and goats. The Lord will make a distinction between the livestock of Israel and that of Egypt. So now you have again, now you have a plague on the animals, right? So think about it really as kind of moving up from the water to these ambiguous monsters, to the gnats, little gnats, to the flies. And now the animals, you know, that are always a little higher up, start to die in the land. And then of course, the next plague is maybe I'm not going to read them, I'm just going to go through the plagues. And then the next plague is the plague of boils. And so now finally what we have is something which affects the humans. But the way it's done. The way in which we get to the moment when it affects the humans is, well, I will read it, verse 8. Then the Lord said to Moses and Aaron, take handfuls of soot from a furnace and have Moses toss into the air in the presence of Pharaoh. It will become fine dust over the land of Egypt, and. And festering boils will break out on people and animals throughout the land. And so what is Moses doing? He is taking residue, right? Taking something like dust, but is really like the residue from a fire, this black ash. And he is now making the transition up into the sky. So until now, we kind of have stuff coming out from below, these parasites, these insects, then the death of these animals. And now Moses takes that which is below, throws it up into the sky. And now we have something which affects the humans and we have a disease. And from then on, we'll see that it's going to kind of move up. Because now, after the plague of boils, which is this transition up into the heavens, now we have the hail. And so now it's a plague that's coming down from above and the hail comes down. And it's not just hail. It's like hail and fire. And so it is in some ways, the two pillars, we haven't seen them yet, but you'll see later in Exodus, when God brings the Israelites out of Egypt, he protects them and he guides them with two pillars. A pillar of water, pillar of cloud, and a pillar of fire. And those two kind of separate are like the two columns, right? Mercy and rigor, the two columns that we find all through scripture, these two opposites that hold, like the two. The two columns of the temple. And so these are the two pillars. But now what happens is, because the world is being undone, these two pillars are mixed together. And so fire and hail are mixed together. The water and fire is mixed together. And. And this is what is bringing about the destruction. Imagine something like Samson that takes the two columns and then crushes them together. And that's how he destroys his enemy. Well, here it's very similar to that. These two columns of water and fire are being brought together and mixed. And that becomes an image of the undoing, the undoing of the world. So then the Pharaoh, you know, says, this time, verse 27 says, this time I have sinned. He said to them, the Lord is right, and I and my people are in the wrong. Pray to the Lord for we have enough thunder and hail. I will let you go. You don't have to stay any longer. So Moses says, that he will again stop the hail and the fire. So there are some details. I don't want to get into all the details. Some of them are also a little bit difficult to understand. Even on myself, I struggle to understand. It clearly has meaning, still need to think about. So, of course, when Pharaoh sees this, he hardens his heart, he sins again. You know, this is inevitable. And so now we have the plague of locusts and the way it's represented. Listen carefully that the Lord said to Moses, go to Pharaoh, for I've hardened his heart and the heart of his officials so that I may perform these signs of mine. Along among them, you may tell your children and grandchildren how I dealt with harshly with the Egyptians and I perform my signs among them, and that you may know that I am the Lord. So Moses and Aaron went to Pharaoh and said, this is what the Lord, the God of the Hebrews says. How long will you refuse to humble yourself before me, let my people go so that they may worship me? If you refuse to let them go, I will bring locusts into your country tomorrow. They will cover the face of the ground so that it cannot be seen. They will devour what little you have left after the hail, including every tree that is growing in your fields. It will fill your houses and all of your. Of all your officials and the Egyptians, something neither your parents nor your ancestors have ever seen. From the day they settled in this land until now, Pharaoh's officials said to him, how long will this man be a snare to us? Let the people go so that they may worship the Lord their God. Do you not realize that Egypt is ruined? So then Moses and Aaron were brought back to Pharaoh. Go worship your God. And he said, but tell me, who will be going? So Moses says, we will go with our young and our old and our sons and our daughters and with our flocks and our herds. Everybody is going. Now, of course, Pharaoh, you know, Pharaoh's not completely stupid. He also knows that what's going on, you know, it's not. You have to be able to read the story both ways. It's like the Pharaoh knows that if ye go, everybody, their livestock, all the people, they're not coming back, right? And so he's not completely insensible. And, you know, I think that he should let the people go. But, you know, you can kind of put yourself in the place the Pharaoh, and think like, oh, you want to bring everybody all your things and all everything that you own? Like, no, if you do that, obviously you're not coming back. And that ultimately in some ways, interestingly enough, is God's plan for this. He does not want Israelite to come back. So it's interesting to think about it that way as well. So he doesn't want. So he says, no, you know, have only the men go and worship the Lord, since that is what you've been asking for. So Moses and Aaron were driven out of the Pharaoh's presence. And so he, the Lord said to Moses, stretch out your hand over Egypt so that locusts swarm over the land and devour everything growing in the fields, everything left by the hail. Now then you wonder, like, why, why locusts? Now it's like, okay, so now it's another insect that is coming. We already had the flies, we already had the gnats. Like, what's the difference between the locusts? But the way it's described, you'll understand if you see the pattern of how it's basically moving from the bottom of the world all the way up. This is where you'll see it because the way it's described. Listen carefully. So Moses stretched out his staff over Egypt, and the Lord made an east wind blow across the land that day and all that night. And by morning the wind had brought locusts. And so this is. You have to remember that the. The wind is the spirit there in the ancient Hebrew thinking, these are the same. And so the Lord made a spirit blow across the land, and that spirit, that wind brought locust. And so now we're really in the air. Now we really are, as if it's the wind itself, itself which is coming, bringing these locusts with it from the east even. And now will. That is what will destroy the land of Egypt. So it is a heavenly phenomena that is being represented. It's different from the gnats that rose up out of the dust of the world to. To do something similar. But now it is really coming from above, this wind that blows and is undoing creation. Verse 14. They invaded all Egypt and settled down in every area of the country in great numbers. Never before had there been such a plague of locusts, nor will there ever be again. They covered the ground until it was black. They devoured all that was left after the hail, everything growing in the fields and the fruit of the trees. Nothing green remained on tree or plant in the land of Egypt. And this is, I think, is also representing the manner in which heaven also can devour the world. There are different versions of that. When, when things get unloosen, when things stop to hold together, there are images of heaven devouring the earth, usually a predatory bird is represented. The idea of, like a rapture that comes and takes, but then also now as these locusts that can come in the spirit and land on the. On the earth and just devour everything. And so the way that it goes away is also to suggest the notion that this is a heavenly phenomena. Because finally, of course, Pharaoh says, I've sinned, you know, and he says, take the plague away from me. And Moses prays to the Lord, verse 19. And the Lord changed the wind to a very strong west wind which caught up the locusts and carried them into the Red Sea. Not a locust was left in Egypt, but the Lord hardened Pharaoh's heart and he would not let the Israelites go. And so now you have like, basically the wind carrying them and then dropping them into the lower waters. So then the Lord said to Moses, stretch out your hand, verse 21, toward the sky, so that darkness spreads over Egypt. And so now we have a really an undoing of the world, right? We are moving back before the light. But now it is a plague of darkness. It's as if you know, the. The very first day of creation is being undone. So stretch your hands over the sky so that darkness spread over Egypt's darkness that can be felt. So Moses stretched out his hand towards the sky, and total darkness covered all Egypt for three days. Three days. It's important to understand all of these things will culminate in the death of Christ. You know, a lot of these images are culminating into the story of Christ. No one could see anyone else or move about for three days. Yet all the Israelites had light in the places where they lived. So Pharaoh turned to Moses. Go worship the Lord. Even your women and children may go with you, but only leave your flocks and herds behind. And Moses, like no man, he says, you must allow us to have sacrifices and burnt offerings to present the Lord our God. Our livestock must go with us. Not a hoof is to be left behind. We have to use some of them in worship of the Lord our God. Until we get there, we will not know what we are to use to worship the Lord. But the Lord hardened Pharaoh's heart, and he was not willing to let them go. Pharaoh said to Moses, get out of my sight. Make sure do not appear before me again. The day you will see my face, you will die just as you say. Moses replied, I will never appear before you again. So now we get to the final plague. Now the Lord said to Moses, I will bring one more plague on Pharaoh and on Egypt. After that, he will let you go from here. And when he does, he will drive you out completely. Tell the people that men and women alike are to ask their neighbors for articles of silver and gold. The Lord made the Egyptians favorably disposed towards the people. And Moses himself was highly regarded in Egypt by Pharaoh's officials and by the people. So Moses said, this is what the Lord says. And this is this idea of plundering the Egyptians, which is important in the theological tradition. In the theological tradition, there's this idea in St. Gregory of Nyssa that Egypt represents, you know, everything that is exterior. So on the one hand, it represents, let's say, our passions. It represents outer authority. It represents, but also represents something like science and knowledge and education and civilization itself, you could say. And so this is all the things that Egypt represents, what I kind of bound up into the symbolism of the garments of skin. And so there's a sense in which the church fathers say that we should plunder the Egyptians. That means that we should take from the sciences, from wisdom, from philosophy, even from all the things pagan, that which we can use in service of God, so that we should. Can leave behind in the waters of the Red Sea all of that of the pagan world and of the secular world and of civilization, which is dangerous to us, but we can also gather into us and carry with us that which is good. And so this is, of course, represented as the Egyptian mother, the Ethiopian wife, the. The Midianite wife, all of these images of joining with the stranger. And now the notion of plundering the Egyptians has to do with this as well. Take what is good from the secular. So we'll get to it later. But a little side note here to understand this is that the gold that they take from the Egyptians and the stuff they take from the Egyptians, you have to understand that this gold and stuff is what will be used to make the tabernacle. So it will be set, you know, in service of God, but it's also that which will be used to make the golden calf. So you can see the two images of that which is taken from the stranger, from civilization, from this outer shell can be useful in the service of God, but then also can become the. An idol if it is not dealt with properly. And of course, this is the same with Aaron himself. You know, I presented in the last lecture about how Aaron is something like the helper, and he's like an extension of Moses. You know, Moses is God to him, and then he's like the prophet to the people. And then that extension has both Sides, you know, Aaron ends up being the priest in the tabernacle. He is like a ritualized and embodied expression of that which is invisible. And so it's necessary and good that he does that. But then Aaron is also the one who makes the golden calf. And so the extension itself can be dangerous if it is not directed in the right. If it's not pointed in the right direction. Okay? And so this is what plundering the Egyptian is related to, at least in many of the church fathers. So Moses says, this is what the Lord says. About midnight, I will go throughout Egypt. Every firstborn in Egypt will die. From the firstborn of Pharaoh, who sits on the throne, to the firstborn son of the female slave who is at her handmill, and all the firstborn of the cattle as well. There will be loud wailing throughout Egypt worse than there has ever been or will ever be again. But. But among the Israelites, not a dog will bark at any person or animal. Then you will know that the Lord makes a distinction between Egypt and Israel. All these officials of yours will come to me, bowing down before me, saying, go you, and all the people who follow you after me, that I will leave. After that I will leave. Then Moses, hot with anger, left Pharaoh. So what I think is. I think we're going to stop here because we've already been going for a while. And. And the plague of the firstborn, I think, is crucial. I think the plague of the firstborn and understanding the death of the firstborn and how it is embedded into the structure of the Passover sacrifice itself and how it is embedded into the structure of sacrifice just straight. It's going to be important to analyze and to understand, and it will help us also understand, you know, the death of Christ and what it is that. Why. Why is this whole idea of the sacrifice of the firstborn, why is this so important? What does it mean? And how can it help us understand the way that reality lays itself out? And so I hope that this has been useful, everybody. I hope that you are enjoying this series on Exodus. I know I am. It's. It is definitely one of my favorite books. You know, not the least because of St. Gregor, Benistus, life of Moses being one of my favorite books. And so I looking forward to continuing it. And I. And I hope that you have a chance to also check out the Exodus series on Daily Wire. So everybody talk to you very soon. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon, the Pageot videos as well, and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
