{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":0.72,"end":66.51,"speaker":"Jonathan Pageau","text":"So hello everybody. I would like to introduce you to Christian Roy. Christian is an independent scholar. He has written a book on traditional festivals, which you can probably see just behind us here. He is on the international Jacques Elle Society board. So he's an expert on Jacques Ellul. He's also an expert on technicity, the media. And he also happens to be a member of my Paris and a friend of mine. And so we've been talking for a while about symbolism. He also has a very deep interest in orthodoxy and symbolism and how all of this comes together. And so we're going to have a discussion which is going to center around technicity. The author Jacques Lul, who he's an expert on, but it'll probably spill over into all kinds of interesting things. And so I'm really looking forward to talking with him. This is Jonathan Peugeot."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":66.91,"end":68.59,"speaker":"Christian Roy","text":"Welcome to the symbolic world."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":78.05,"end":85.09,"speaker":"Jonathan Pageau","text":"Maybe you can tell us a little bit more about yourself and maybe a little bit about. You were just at a conference just now in Toronto."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":85.09,"end":285.71,"speaker":"Christian Roy","text":"Maybe you can tell us a bit about that. Yes, it was the 20th annual conference of the Media Ecology Association. It was in Toronto, which happens to be one of the seats in a sense of reflection on media as an issue, in a sense philosophically, but also practically. There's such a thing as the Toronto School of Communication, including such luminaries as Marshall McLuhan and Notrep Freid, the great biblical scholar, even Glenn Gould, the pianist that had some interesting thought and practice around the new uses of media. The list could go on, but one can point out here that for many of these people, I won't particularly also of the Jesuit Father Walter J. Ong, who worked on the contrast between oral and written alphabetical cultures. Many of these cultures, many of these thinkers have in common that they have a very deep personal faith that informs all their thinking. And it's certainly no coincidence because being rooted in tradition is possibly the best vantage point to have enough distance from our modern environment, which most of us take for granted, to see what's actually happening, see the patterns from a certain distance. And by, for instance, historicizing it or being rooted in an actual religious practice, when you enter into an experiential world that is not the same as the modernity around you, and of course have the mental patterns to just. To have imbibed intellectually this whole tradition, to have categories to point out these differences with the current times and the evolutions that happened over time, the transformations because, well, one of the. An interesting way of characterizing this media ecological Approach, as it's been termed, is that in it, media are not mean, are not seen as means of transportation of data, but of transformation of human beings, of ways of being. Because they all involve certain different foci of attention with different senses, different relations to time and space that are entailed long refashioned by different, by new ways of communication. And communication is not a neutral conveyance of one bit of data to another from point A to point B. That everything is in the way of the common way of being and of moving between these two artificially separated points. It means being in media res, like in the Latin expression, being in the middle of things. To understand that that gap, which isn't a gap, that's where the life actually is."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":286.27,"end":350.69,"speaker":"Jonathan Pageau","text":"And I think that it's so important to talk about this now, because I would say that for several decades we were presented media as almost a transparent thing. People were trying to convince us that media was transparent. It was only this means of transparent communication. But now, as political discourse starts to fragment, as conflicts start to arise in society, we're noticing more and more to what extent selection, even just the selection of information that attention is being pointed to is already such a frame that to imagine then even the actual structures of media themselves, their matter of distribution, the way they frame space or they frame sonority, all of this attention, yes, the way that they frame attention ends up manipulating, not necessarily manipulating, but participating in the way that information is received. And because of the breakdown, we see it more and more because we can see our enemy do it. We don't see that we probably do it too, but we can see our enemy do it because we have that distance from what's going on."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":350.85,"end":407.58,"speaker":"Christian Roy","text":"And we have actually, because we frame our discourse and communication the same way, we have much more in common with our current so called adversary or enemy that we did with the people we claim, say, to return too, you know, that we're part of the same world. And that's what's important to understand, because that's the constant trap. Of course, there's been plenty of movements that have been critical of modernity. Okay, okay, we'll just mobilize against that. But counter revolution assumes revolution. It takes the same forms. It's all based on project mobilization. So you end up at. You may invoke some values from the past, but in practice that you're actually a modern movement, and one probably even more efficient as a modern movement, because you have the reassuring references to the past."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":408.62,"end":420.7,"speaker":"Jonathan Pageau","text":"You see, I mean, some of the fascist groups did Try to, let's say, use some traditional ideas or some imagery. Traditional imagery. But it was only a way to give a fuel to their modern project."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":421.37,"end":441.21,"speaker":"Christian Roy","text":"Or they might not. We can even give them the benefit of the doubt. Maybe they were even sincere about it. But they were fooled by saying, okay, we just have to take sides firmly against that and mobilize our energies against. But mobilization is already modernity and the more you're fully mobilized, the more modern you are. Yeah, yeah."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":441.53,"end":474.27,"speaker":"Jonathan Pageau","text":"So maybe let's go with Elul, because Jacques Ellul is a thinker that I do not know much about, but many people who watch my videos, many people who I'm in contact with, they keep telling me that I need to spend some time with Elul and to understand him a little more. And so I knew that I had my expert here with me. And so this is my chance as well to discover a little bit about him. Maybe you can tell us a bit about his own. Because he converted to Christianity and then his own intellectual progress, you could say, what are the things that were important to him?"}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":474.59,"end":579.24,"speaker":"Christian Roy","text":"Well, I'm tempted to approach this as a historian in terms of events. What is Elule known for? Well, he burst onto the scene in a treaty international scene and the English speaking scene in particular in 1964 with a translation of his already 10 year old book on technique, as he called it. It was translated as technological society. Yeah. So he came to global awareness in 1964, but that was just 35 years after he'd been sort of involved in that scene. But there's just some, there's, I think, significant anecdotes about how that came about. Because it's Aldous Huxley who came across the original French edition from 1954, and he was so impressed by this description of technique as it was. And he thought, well, that's matches what I described in Brave New World. And it's important to bring this out at this moment where we're being refashioned by technology in all ways. So you convinced, by different channels, the publisher not to publish the translation. It had quite an impact on 60s cultures. But the irony is that actually when Aldous Huxley's book came out in 1930, Brave New World, it came out in the same year in French translation. It was picked up by Ellul and his friend Bernard Charbonneau, actually, who said, well, wait a minute, that confirms what I've been thinking on my own."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":584.04,"end":589.8,"speaker":"Jonathan Pageau","text":"So there was an influence of Huxley on Elul. And then Elul came back to Huxley."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":593.89,"end":984.03,"speaker":"Christian Roy","text":"The point is, they were thinking the same way, but they hadn't. It took them 30 more years to become aware. But it was only one way, because Huxley couldn't have suspected that someone was thinking. Almost kids were thinking the same way in southwestern France and Bordeaux in 1930. And they had already devised a kind of critical and even revolutionary approach to counter these phenomenon which they saw in their daily life. And when I say day, it has to be said that it was this friend that Dante Jacques came to know a couple of years before, called Bernard Charbonneau, who he acknowledged that he wouldn't have, you know, have said anything original in terms of social ideas without meeting him. It would just have been. See, you have to understand, Jacques had a kind of twin conversion around 1930. Well, he had a conversion experience to Christianity, which he understood in terms of Kierkegaard and Karl Barthe on the one hand. And on the other hand, because his father was ruined by the economic crisis, he had a kind of conversion to Karl Marx. So Karl Marx and Karl Barth, both forms of dialectic. So in terms very much of dialectics of mutually exclusive opposites. So that was his framework at the time that he came across. Bernard Shabbonneau sort of took the place in his social thinking of Karl Marx, but he remained a Marx expert all his life. But basically he would have been some sort of Christian Marxist if he hadn't come across this almost a class clown at the school they were going with, who one day came over to Jacques Elle, who was kind of a nerd, really a bookish kind of guy, and invited him to. To camping exhibition outside and then in the countryside. And then they had these unending discussions. And Jacques Lud was sort of overwhelmed by Charbonneau's sort of effortless grasp of culture, but most importantly his way of seeing the patterns embodied daily life. And he had already come to certain realizations about the nature of technological modern society that few people would come around to. You know, Heidegger and Frankfurt School were still some few years off, but on his own just. There's two experiences that are foundational for this. Charbonneau's intuition of technique is one that realizing that the Bordeaux streets in which you'd grown up from almost overnight, the cats and the children had disappeared. They were replaced by cars. Overnight, the city had turned from a human environment to a network of pathways for the circulation of these mechanical motorized engines. And that was true of the whole of society, but no one talked about it. And it was a time of the great wars, etc. And of course, it was also a motorized war. But what he understood also, because he was too young to go to war, but he saw his big brother come back and be kind of shell shocked, incapable of talking about his experience. And what struck him is the way a society can be mobilized in the people's minds, as well as all the resources of the territory it control and controls. There's something similar and comparable about the impact of something like the car and modern war as a demonstration of what industrial society really is. The mobilization of. Of everything in human reality as resource to be concentrated by the means to deploy this apparatus for whatever end. The end doesn't matter. The point is the mobilization in itself. And he understood that, well, things like world wars or totalitarianism, they were just out of the ordinary expressions of something that was just the fabric of daily life as it had mutated. We call this the great molting of mankind. Once a man has triumphed over nature, it's no longer something that pressures him so much. But for that, a man had to rely on total social organization. So now he has to defend. Man, has to defend against society as his new environment, his second nature. So he understood that the struggle, both personal freedom and nature, are in peril my modern society for the same reasons, and therefore they are a common cause. I've shown that he was the inventor of political ecology in France and possibly worldwide in the 1930s. People think it's something that started in America or Germany in 1960s, but the movement that he started locally with Elude, can be seen clearly as a kind of ecological revolutionary movement. Conceived that not in terms of fighting this and that ideology, but the common structures of the modern world, the state, the media, propaganda, modes of transportation, and the true changes would affect how people eat, how they read their paper."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":985.79,"end":1015.66,"speaker":"Jonathan Pageau","text":"So how do you see? This is taking a little bit of a tangent, but it's interesting to me because what seems to have happened now in the. Let's say, in the way that things have set themselves up, is that the modern state and the modern media apparatus, all of this has now taken over the ecological discussion and is using it for its own means. It seems to be. To be using it to also to, let's say, to manipulate people into certain directions. It doesn't seem to have anything revolutionary about it anymore."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":1015.66,"end":1140.82,"speaker":"Christian Roy","text":"Well, exactly. And no one was better placed than Mernac Charbonneau to point this out in the first decade of the actually existing French ecological movement, which sort of started seemingly out of after 1968 in 1980, he came out with a book which he called, well, the Green Light, the Self Critique of the Ecological Movement, which I translated for Bloomsbury last year. It's the only Charbonneau book out there, so. And that has good introductions to his talk. Not by me, but. So if people want to know more about Charbonneau, that's it. But he could. With this experience going back 50 years, he could see that the Green movement. I got admired in the quest for media attention and for presence in the political system, which of course is paid by media attention. So this critique of media as a kind of categorical imperative of our presence in this world is central to his, his critique of what the Green movement had become. And now it was in turn, he calls it the green light because 1970 was decreed as the year of the Environment by the Council of Europe. So it's. No one would touch this topic in Europe until then. But it was a red light. I knew it personally because he'd written tons of books about it and no publisher would touch it. And all of a sudden, 1970, it comes from the Council of Europe. Everyone broaches these issues. It was the green. The greenwashing pump started rolling because it started from bureaucratic center. So it was already a kind of discourse that sort of papered over the same kind of society. And the people who were trying to challenge this kind of society, they sort."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":1140.82,"end":1141.06,"speaker":"Jonathan Pageau","text":"Of."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":1142.82,"end":1154.72,"speaker":"Christian Roy","text":"By taking on the same means through which this, this society propagated itself. Well, they were sort of co opted by it. So that's why you have a kind of green version of the same kind of technological society."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":1154.8,"end":1237.63,"speaker":"Jonathan Pageau","text":"It's interesting because what I've seen, because I look at my kids, you know, we, we do homeschool, but they use sometimes books from the school system and everything. And I can see that it seems to be, it seems to be replacing a kind of the kind of guilt system that was in the Catholic Church, 1950s and 60s, where you had to really feel guilty about being alive, basically being a human, you was being a sinner and you had to live in this guilt. And now we've replaced that kind of original sin guilt with this guilt of living in consumer culture where you have to consume and you have to buy things wrapped in plastic. You can't avoid it. But then you have this guilt, you have to atone, you have to recycle all these gestures, these kind of social things you have to do in order to atone for your, your sins of just existing in the world. And you can see in the books, like, my son has a math book. And in his math book, all the problems are all. If you cut so many trees in this area, you know, how long will it take for the trees, if they grow in such years, how long will it take for them to grow back? So it's like all the mathematical problems have become ecological problems. And it really struck me because I heard that in Quebec in the 40s and 50s, the math problems were all Catholic. They were all, like, calculating how many chalices are used and everything. And so I thought, wow, it's a great way to indoctrinate children is to."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":1237.71,"end":1240.67,"speaker":"Christian Roy","text":"How many Chinese you can. Chinese kids, can you convert?"}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":1242.59,"end":1264.77,"speaker":"Jonathan Pageau","text":"And so. And so it seems like it has become this, you know, even though I can understand the need for ecology, I find myself resisting not at the idea that we have to take care of the world around us, but I find myself resisting because I see it now as part of this apparatus, this kind of strange techno, powerful apparatus of control."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":1265.25,"end":1540.46,"speaker":"Christian Roy","text":"Well, yeah, and one of the points that Shabano made early on is that probably the needful ecological, environmental measures, they would not come about as the effect of some grassroots environment activism by marginal groups. It's when the very people who had managed the exploitation and ruin of the earth, well, they couldn't do that anymore. They would manage trying to rescue something of it, but it would be the same people, the same system. But even called it. Well, for him, it raised the specter of eco fascism because it was one illustration of the way the chaos that is spread by this constant encroachment of organization needs to be managed by still more organization, which in turn generates more chaos. So this builds up the drive towards social totalization. So he saw a danger of the industrial system reverting, well, reversing to kind of management of growth, to a management of endless consumption, to a management of scarcity, where everything would be precisely accounted for, but at the cost of personal freedom. And the point, the big difference between him and, say, of deep ecologists who want to make you guilty for being a human having roamed the earth, is that for him, even the sense of nature as something to be appreciated and preserved, this can only occur to a human. So he was just as concerned for the preservation of freedom as for nature, which was for him, in practice, indistinguishable. For him, freedom was a very physical thing. It was, you know, that in his childhood, he used to go almost down the street and be in the forest. And as years went by, the suburbs would eat up more and more and nature as a complete experience was inaccessible. And you are in a complete box, store or environment and you can't get anywhere except by car. For him, freedom and nature are none one in that experience, experience of deprival that industrial society creates. It curtails both concrete freedom as the ability to move around in a differentiated space, and the elements of air and water and earth. And also free of having to follow standard procedures for every daily life. I mean, our so called instruments and devices are not neutral. In order for them to work well, we have to adjust our behavior to them. We have to speak their language, or even when they pretend to imitate ours. But it's so that we can integrate more their way of thinking, of operating. See, we have to become interoperable with our machines, which have to become interoperable with each other. That's one of the things that Elude is famous for underlining these different laws of technique as the search for the one best way in every possible procedure and area of life. And as a totalizing process. Because you can't just have it in one area and leave the other areas inefficient. Because it just won't work. In order for something to work efficiently, it has to work efficiently with everything else, has to be connected by the same rules to everything. So if you introduce one improvement in one area, everything has to fall in line with it. And of course, since the improvement continues, everything has to constantly adapt to these new changes and even more efficiently and quickly. See, so there's a. There's ever increasing conformity and standardization, even as the process that drives it is the quest for convenience, personal freedom of choice, whatever."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":1540.62,"end":1598.57,"speaker":"Jonathan Pageau","text":"And then because of that, because that interdependence and because things end up speeding up by the fact that everything has to adapt to themselves and the efficiency has to grow in every aspect, then we realized that we've become slaves to our, that we, that we've actually, like you said that we were cyborgs already and we are completely dependent on these machines. And if we didn't see it, let's say, or very few people saw it with the automobile, although now we can see it from a certain distance. We can see exactly what you said, that now the entire layout of society has been made for cars. We have, we have planned our cities in terms of cars, but with the cell phone that has now, I mean, I think almost everyone who has any form of self consciousness is aware of that problem, of the problem of how we end up living. We end up adapting our life to this Object."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":1598.81,"end":1652.28,"speaker":"Christian Roy","text":"Well, our life, which means concretely our sensorium, our management and awareness of space and time. I mean, people have been articles, you know, by people whose job it is not just their job, but their pleasure in life was to read books and comment upon them. And they've observed that their attention span has drastically diminished. They can't read a couple of paragraphs with. Without fidgeting to check the. Because they've been literally rewired. I mean, it's our, you know, our synapses are sort of. Our neural networks are sort of. They become restructured by the stimuli that we become used to and addicted to. So we've already been changed."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":1652.28,"end":1655.52,"speaker":"Jonathan Pageau","text":"We are cyborgs. We don't have to have them attached to our bodies."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":1656.16,"end":1668.82,"speaker":"Christian Roy","text":"Well, that may come, you know, I ask. Of course, the phones will soon be inside our skulls, but that won't make that much of a difference because we already are inside them. We wear them or they may be wearing us."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":1670.98,"end":1709.71,"speaker":"Jonathan Pageau","text":"Yeah, that's very fascinating. And I think that maybe I would like to hear you talk about something you mentioned just before you were kind of going through, and you mentioned the relationship between the system, the increasing of the system, let's say, and the increasing of chaos at the same time, and then the reaction of the system to those, to that process, let's say. That's something that really interests me. As you know, you've followed some of my videos. I tend to talk about how the modern world seems to actually be a rising of extreme system and extreme chaos at the same time."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":1709.71,"end":1710.15,"speaker":"Christian Roy","text":"Exactly."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":1710.15,"end":1714.26,"speaker":"Jonathan Pageau","text":"And that those two things are coming up together. Together. Because one feeds the other."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":1714.34,"end":1717.98,"speaker":"Christian Roy","text":"Exactly. That's exactly what Shabanov was saying. He wrote a whole book on that. Yeah."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":1717.98,"end":1726.1,"speaker":"Jonathan Pageau","text":"So maybe tell us a little bit about how Shabanu frames that. It's hard to resume entire books in small bits."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":1726.42,"end":1818.06,"speaker":"Christian Roy","text":"I know. Where do you take it from? Because it's also. It's at the level that we're so embedded in that kind of reality that we, we don't see it. So where can you sort of pull it to certain distances? Like. Oh yeah, so. So he would. Well, let's assume somewhat pre modern conditions. You know, there are local customs, regular ways of doing things over a certain area, and they tend to vary from locality to locality etc. So you introduce, you bring in. Okay, you. We'll bring in a road or we'll electrify. What happens? Well, pretty soon the whole activity, rather economic or social, gets sucked up by interaction with this road or with the TV that just came in. Well, you know, and millennia or hundreds of years of customs just disappear overnight with the appearance of a TV screen. I remember my first experience of strolling through a French village deep in the burgundian countryside in 1980. I was struck, walking at night, that there would be no one out there and you would see these screens flicker in every house. And probably that wouldn't have been the experience 30 years before. All these people who had these."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":1820.52,"end":1820.72,"speaker":"Jonathan Pageau","text":"Very."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":1820.72,"end":1886.2,"speaker":"Christian Roy","text":"Particularized local experience ways of spending time together, maybe around the fire after supper, etc. All of a sudden they had this one common awareness coming through the TV screen, this one common folklore which overcame and erased generations and centuries of ways of interacting or meeting meaning, making sense of the world. It would mean, for instance, well, you know, even the local languages. It's well known that. Well, France wasn't a French speaking country until 120 years ago because most people would speak their own language. Same thing in Italy. There's only. There's two things that made most Italians speak Italian. And. Well, I guess. Well, there was the forced sort of standardization policies of the fascist regime. But even that was. Even that was an outro of the first World War, which, you know, took, you know, peasants from everywhere and just."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":1887.16,"end":1888.68,"speaker":"Jonathan Pageau","text":"Put them in a push play to fight."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":1888.76,"end":2059.6,"speaker":"Christian Roy","text":"Yeah. Threw them in the Alps. You know, people who've grown up in Sicily and never been to the next village, all of a sudden they were shooting Austrians high in the Alps and they were treated. And the Italians were the worst at treating their own soldiers. I mean, it would be a temptation to go over to the other side because it wouldn't be. So it's no wonder that fascism came out of that. But that's where everyone learned Italian in the front lines and in the barracks. The same thing for every modern nation state, which means the elimination of all these particular cultures everywhere. And that was one of the big issues that Chabalo had, I guess he had in mind some kind of an international of local homesteads or local areas. Because you can start the nation state as a stage to a kind of global uniform consciousness. Because nation states are not. They're modern creations. You know, they premised upon the centralization and uniformization within whatever fell within certain boundaries. Well, the central language and outlooks of the central government within be imposed throughout the whole society. So the effects would be linguistic, but also. Yeah, you had to school them, of course, to take them out. Yeah. There's a famous book by historian Eugene Weber describing this process called From Peasants to Frenchmen. So that's about what the Third Republic did in the late 19th century by basically taking all these peasants out of the Middle Ages and putting them in rows in the secular schools of the Republic and just extending their uniform consciousness and punishing them if they spoke their own language, like Breton. So in a sense, globalization continues this process, but then with softer means, but more like through seduction, I guess. TV had done that on the national scale before. But there's a kind of soft totalitarianism inherent just to the technical system that probably works better when it's. In many ways when it's not under a hard totalitarian political regime. The way, I guess American pop culture is the kind of universal language of that. And wherever there's any kind of electric media, well, that imposes itself as a kind of universal norm, you know."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":2059.92,"end":2099.33,"speaker":"Jonathan Pageau","text":"And so what's interesting about the American pop culture is that especially the music was that it was positing itself as a reaction. Yeah, yeah, right. It's positing itself as a kind of rebellious declaration of. Of the individual, of, you know, giving in to your desires, of not participating in the system. But then it just got sucked into. To the same process. Right. It became, like you said, a kind of uniform language of rebellion that could be managed because we all knew what it was like. You can recognize a punk from every country because they all look the same."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":2099.57,"end":2199.08,"speaker":"Christian Roy","text":"Yeah, all these alternative rebel cultures became just. Well, there was this term that arose in the early 80s when I grew up in record store. There would be the rock bin and then the alternative, but there were still records being marketed and made exactly the same way. You just have the mainstream consumer niche and then you have the various alternative consumer niche, but they're still consumer niches. They all function, they're all the same. So that's one of the ways in which the medium, the format is much more important than the content. You have different contents of the same structure of individual mass consumption. So which is not being very refined. By finding these ever finer niches of aesthetic or ideological association, which by being identified by the proper algorithms, then you can tailor, make things so that they will meet their expectations and therefore standardize them even more. Because they're made to fit what they receive and they develop a taste for it and forget what, whatever can trouble this form of sensibility that becomes self referential and fortified in its own assumptions and ever more intolerant of anything that disturbs it. In the same way, there's less and less distance between desire and gratification. Or actually we expect being gratified, actually gratification comes first. And then this desire goes to beat it. Wow. Yeah, that's intense."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":2199.08,"end":2220.08,"speaker":"Jonathan Pageau","text":"But I've seen that myself in my own experience, you know, now putting out YouTube videos, I start to perceive the algorithm and the content that I'm doing is strange. It doesn't, you know, because I'm talking about symbolism, religious symbolism, but then also movies and everything. And so I can see that the algorithm is struggling to."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":2220.82,"end":2222.26,"speaker":"Christian Roy","text":"To fit me. To please place you."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":2222.26,"end":2230.06,"speaker":"Jonathan Pageau","text":"Yeah. Then once in a while I make a video and I know when I'm making the video that I'm going right into the algorithm."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":2230.06,"end":2230.5,"speaker":"Christian Roy","text":"Like I would."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":2230.5,"end":2237.62,"speaker":"Jonathan Pageau","text":"I made a video to call Alex Jones the symbolism of conspiracy theory. Symbolism. Alex Jones."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":2237.62,"end":2238.02,"speaker":"Christian Roy","text":"Right."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":2238.1,"end":2243.62,"speaker":"Jonathan Pageau","text":"And that I knew when I put that out, that video and I put it. I did another video called symbolism of propaganda."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":2243.62,"end":2244.06,"speaker":"Christian Roy","text":"Yeah."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":2244.06,"end":2287.83,"speaker":"Jonathan Pageau","text":"And. And I knew when I put out the video that I was moving, I was going right into kind of anti social justice, whatever part of the algorithm. And exactly what I expected happened. You know, within a few weeks I had 100,000 views. And, and, but then I was like, then that's dangerous. Because it says, okay, if I make more videos like that, then I can keep the attention. So you have to whip yourself to. To not just to not fall into. Not to be. Just not to be something that feeds the machine. And I've seen YouTubers do exactly that where for a while I was interested in their content. Then all of a sudden they found this, this wheel that they can feed and then they just put out all their content. Ends up being the same kind of stuff."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":2287.83,"end":2289.95,"speaker":"Christian Roy","text":"It become formatted by the algorithm and."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":2289.95,"end":2385.37,"speaker":"Jonathan Pageau","text":"They don't realize it, you know, because it's really like you get a pellet because you get views, you get likes, you get even money from advertising. Oh yeah, yeah. So it's very, it's very funny. But what do you think about. Because there seems to be right now on the Internet, there seems to be a war of information. You know, you have the big tech companies trying to censor. You have alternative tech companies coming out and then not being, you know, like Gab, for example, doesn't even appear on Google and was branded right away as an extreme right wing group. But I mean it wasn't more. The people on Gab weren't more right wing than the people on Twitter. It was just a kind of like the guy, one of the mass shooters recently, I remember the articles that came out right away when they came out, they said a Gab user so and so went in and shot a school. But that person Was also on Twitter and used Twitter and Gab equally. But then they said the Gab user, because Gab was pariah. In this information control that seems to be going on. We see and Patreon, we saw censorship, we're seeing it on YouTube, seeing demonetization and like little ways to push the attention of people in some directions. Seems to be coming more transparent because also because of 2020, because the election is coming. And you can see that they're trying to direct people's information. But what interesting is that you're actually seeing a war, because when television was there, you didn't see the war."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":2385.45,"end":2386.97,"speaker":"Christian Roy","text":"There was no war. Right."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":2386.97,"end":2402.33,"speaker":"Jonathan Pageau","text":"There was three networks in the United States and Canada. We had cdc and that was it. They were feeding you with a spoon. This is reality. Just take it. Whereas now it feels like there's a war for reality."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":2404.41,"end":2431.77,"speaker":"Christian Roy","text":"Which reality do you want? And then you'll get the whole worldview that comes with it, the whole package of that take on reality, which doesn't need to fit anything out there, particularly because it's the whole. Well, it's the virtual reality experience of having this complete experiential worldview as complete unto itself. It doesn't matter if your guys in power or not. It's the same mental universe."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":2431.77,"end":2461.97,"speaker":"Jonathan Pageau","text":"Okay, so this is what's interesting in what you're saying is that to a certain extent what you're saying is that, say there's several parties that are fighting this war, information war, that in a certain manner it doesn't matter because the two sides have accepted the same reality, the same frame. And so because of that, in a way, it doesn't matter who wins because what matters is the medium itself or the manner in which information and technology. It's the power that that has, which is the most pernicious, we could say."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":2462.14,"end":2524.02,"speaker":"Christian Roy","text":"Yeah. And the way whichever brand of reality you're into, well, you'll be. You'll be. Your brain will be sucked onto your screen or your handheld device and you won't pay attention to your immediate surroundings. And that's the upshot. You will be more and more a kind of organ of resource of that invisible wireless organism out there, which is. Is now the real subject of, I guess, post human history. And you know, it comes back to, you know, one of McLuhan's famous aphorisms. Humans are just the sex organs of the machines. They still need us, you know, to. To as, you know, a kind of a third party to, to, to make a little detour through, you know, but, but of course we're promised a singularity where we'll deal with self reproduce. They won't need us anymore."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":2524.02,"end":2560.92,"speaker":"Jonathan Pageau","text":"Yeah, but the singularity question is very interesting because what we're seeing is this. We can, we can feel that we, we're slaves to this process because you have people warning, you have all these people afraid of this, this, of the AI and what the AI will be. And we have a whole mythological storytelling, Terminator, the Matrix. We have this whole mythological storytelling which is warning us of that problem. But we know that it's inevitable because there's so much money and there's so much power that the fight is going to happen."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":2562.2,"end":2628.25,"speaker":"Christian Roy","text":"It's already. The fight is just one mode of entertainment within the same media. You know, whether you relish the prospect or dread it, you're still fascinated by it and you still pay bucks to see entertainment on that theme. And it's still going. Seeing these dystopian movies doesn't inspire people to get off the grid. No, they want to see more of that genre to feed the obsessions which are not different in kind from those of porn watchers, which probably are. And when they're not watching that. Because also it's the same logic getting kicks of intensity, you know, having I guess, some of your, some of your, some of the levers of your psyche pulled in efficient ways, you know, so it's entertainment as whatever its content has the same underlying, the same, as the same logic. So we're, we're hooked on the spectacle of our own demise. You know, it's the most entertaining way of approaching it."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":2628.41,"end":2669.28,"speaker":"Jonathan Pageau","text":"That's, that is, I mean it is fascinating because it, we had a slew, it's a bit less now, but we had a, a whole slew of, you know, end of the world movies in the 2000s was non stop. Every year there was two or three comets, you know, everything, earthquakes, it doesn't matter, you know, like. And we, recently there was a whole slew of. They remade the Planet of the Apes in which the apes are the heroes and the human beings are the bad guys. And so we are actually watching, we're watching our own demise. We're rooting for the other like we're rooting for the enemy. And this strange fascination with the demise of humanity."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":2670.08,"end":2721.07,"speaker":"Christian Roy","text":"Also the constant suggestions, you know, that machines might be, well, you know, well, Terminator 2 was still optimistic. If you machines can become more human, maybe we can too. And then you have also all these robots who strive to become human even because the humans like say, let's say an Alien force, this ruthless military that indulges in horrible experiments. Well if that represents humanity, then Winona Rider Android who reads the Bible then has more humanity. So we sort of do these transfers. We hope that there will be among whatever succeeds us, whether it's animal or machine, there will be something that's less mindlessly mechanical than we are."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":2721.87,"end":2769.77,"speaker":"Jonathan Pageau","text":"Yeah, that's really fascinating. That Definitely, definitely. So maybe we can kind of can finish off about talking a little bit more about. One of the things that has been interesting to me has been discovering the notion of technicity as a supplement. Something that I, you know, in terms of the garments of skin and in terms of this idea of adding layers to something which is untouched or something which is pure. It doesn't really matter how you characterize it but, but this constant adding of layers and the dual effect that it has on us and obviously we're in an extreme version of this and it's my understanding that that group like Elude McLuhan, they've also thought about that problem. So maybe we could talk about that a little bit and see. Well."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":2771.61,"end":2990.51,"speaker":"Christian Roy","text":"Yes, because they're just. It struck me with your whole theory of garments of skin. There's something kind of like that in Elune. I'm not sure that he focuses that much on the garments of skin stage, which someone at the Media Ecology conference rightly pointed out. Well, that was the first technology, clothing. Well, McLuhan said houses are also an extension of skin. But Elul in particular as a biblical angle to this, of course he's not just a sociologist. There's two streams to his thought and they were sort of conceived and outlined together around the time of the war. There's the sociological description of the way modern society is and then there's the theological assessment and sometimes of the same topic. One kind of non judgmental relatively because he's always kind of moralistic really and, and then this, the, the openly theological side and of course being the Protestant that he is, is a very, very thorough biblical scholar so that he really analyzes the, the, the, the, the, the the issues in terms of, well, the first chapters of Genesis and he wrote a whole book called the Meaning of the City as a critique of, well, these extensions of man that are city walls and gathering together as a kind of. He sees it purely in terms of Babel as a conscious rejection of God to be in the self enclosed human world. To me that's kind of, kind of over the top. I think you have more subtlety than that. And then Charbonneau does too. And he sort of. There's a subtle hint in the. In the Nature and Christianity chapter of Charbonneau's book the Green Light, where there seems to be a subtle allusion to, well, sure, we have to find some shelter, etc. But, well, we were expelled in nature, what do you expect? You know? Sure, it's like Elul sort of. He sees these protections that man finds in his actual conditions as inherently a kind of disobedience to God. And that's it. And then at the later stage, God in his mercy sort of integrates that after the fact in his plan of salvation. For him, the city is just a kind of, well, okay, man decided to live in cities, so I'll make a heavenly Jerusalem. So he kind of gets used to. So I think there's more. I mean, there's deeper symbolism. I mean, there are more serious, more deeper reasons for that urban symbolism of the lasting than Elul allows. And I think it's has to do also with the fact that he doesn't have any notion of the icon. For him, it's just the idol. When you represent something visually, that's all there is. You put the screen between you and God and that's it. The idea of a mediation, of a healthy mediation with the outside and even with God to concrete objects is sort of anathema to his. The kind of old Calvinist reflex. Right."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":2991.63,"end":2999.87,"speaker":"Jonathan Pageau","text":"So that's interesting that he would see, at least he would understand that, you know, he would have the wisdom to understand that the city is. Is that."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":2999.87,"end":3000.43,"speaker":"Christian Roy","text":"Absolutely that."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":3000.43,"end":3026.55,"speaker":"Jonathan Pageau","text":"That he would understand that there's a relationship between the problem of the image itself or the idol or any form of exterior manifestation and the city, you know, and, and. And to see also the temple, it's. I mean, I don't know if we probably wouldn't go that far, but to understand that the temple is also. That. That the temple is already a hint of how the city, the enclosure, is transformed into something else."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":3026.63,"end":3069.17,"speaker":"Christian Roy","text":"Well, for that. To have that discussion seriously, we need to read some of his writings on this topic. If we want to get into the theological aspects, which are very much there always in the background, as in McLuhan actually. So perhaps that could be a focus of some other discussion, because right now I don't think either of us is truly prepared to get into that. We should do a little bit more homework. Well, I'll leave you Shabano's book, which is chapter on nature and Christianity. And then you get really a grip of that, what I call the Bordeaux Schools approach to these issues."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":3069.25,"end":3112.09,"speaker":"Jonathan Pageau","text":"All right, well, thank you so much. This has been a great discussion. And I hope that we can go more into Elul on this question, particularly because it interests me very much later. But then also talk about. I think it would be interesting for people to talk a bit more about McLuhan as well, of course, because he was such. I remember even when I studied in college and was studying in art and in the kind of postmodern world, McLuhan was a staple where people would quote him. And it's only later that I discovered that he was a traditionalist Catholic and that most of his analyses of what was happening was a critique and wasn't a celebration of which most people took it as Exactly. And so I think that that's something that would be very interesting to look into."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":3112.09,"end":3243.5,"speaker":"Christian Roy","text":"Well, also elude's notion of symbolism because he has a very rigorous thinking about that around the different status of. Of the word and the image. Well, you can see how this relates to. The iconoclastic strand is opposing, a bit like Meg McLuhan, the oral world of the experience of the word and the visual experience, of course, of the image, which the visual world being that of what he calls the real, as opposed to the oral world of the true real, which comes from thing, because in Latin res. Because you can focus on one thing at a time, sort of pin it down and you see one aspect at a time which is non contradictory. Whereas what makes the oral experience of things and of the word, of course, more symbolic is that it sort of implies that it's never. Whatever you get is not the whole picture. There's different aspects that you could get in time and you could theoretically circle it. It's not a visual thing, not like the bullet time of the Matrix, when you get it from all angles and add it up and you'd have no oral experience. Is fundamentally different from that. There's always seemingly contradictory aspect that coexist or even with what is given and is not given. And that's. It becomes a revelation of something not given that can come to an overall experience of the word or even of any perception. Because it's not so much an issue of using that organ as opposed to that. But what is the ratio in the use of this organization which organ structures the whole economy of your senses? You can hear things visually and you can see things orally. See, that's McLuhan territory. These kind of things."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":3243.5,"end":3271.15,"speaker":"Jonathan Pageau","text":"Okay, well, I look very much forward to going in that direction. So, guys, thank you for your attention and if you're interested, Kisa is part of the Symbolic World Facebook group and he, he, he is known to get involved in discussions. So, so it might be a place where some of the discussion about this video we can have and see and see what kind of, what kind of soil, what can grow out of this soil. So thanks again for your attention, guys and I'll see you soon."}
{"episode_id":"SW - #073 - 2019-11-16 - Christian Roy - Technical Society and Media","start":3271.87,"end":3336.81,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well and on SubscribeStar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
