{"episode_id":"SW - #198 - 2021-11-09 - Finding the Giant Dog-Headed St. Christopher in the Bible","start":0.32,"end":2409.56,"speaker":"Jonathan Pageau","text":"So in light of my brother and I's new graphic novel, God's Dog, which is crowdfunding right now in Indiegogo, I want to look a little bit at some of the symbolism of St. Christopher, especially the aspect of his later legend which has him crossing a river, you know, carrying the young Christ child. But we'll see that this pattern of crossing rivers and the relationship with monsters and also even the notion of a trick being played and say, being both playing tricks and being the subject of tricks, will be an interesting way to understand what happens at the end of a world. What happens, you know, in a similar way as when we talk about how the fool turns things upside down and turns things right side up that Mathieu has hinted at in his book, we're going to look at how that relates to St. Christopher the dog, the dog faced giant monster that carries Christ across the river. This is Jonathan Peugeot. Welcome to the symbolic world. Now. Now, the relationship between monsters and crossing rivers is one which might not appear super obvious to everybody right at the outset, but it's because we have to see it first of all in the right categories. We have to understand the monster as representing the edge. But that edge has many forms. It can be straightforwardly a monster, but it could just be the idea of animality itself. I've often talked about these garments of skin with which are given to Adam and Eve as this cover which covers their outside, this periphery, on their edges. Well, we have to understand that on the edge of our humanity is animality. We have something in common with animals, which is our body. And so as we explore the body and as we look at the aspect of us which dies, then we will encounter animality, things in common with them in terms of our desires, in terms of our fleshiness. There are many things which are related to animality. So once you understand that there's a relationship between animality and monstrosity, monstrosity being something like the ultimate version of that, or the ultimate version of this, of showing that in a human, having a hybrid human or something like that, or some human that's too big, or that has. That has also has some kind of excess in one aspect of themselves or another human, you'll understand way more. You'll be able to understand so many more stories in scripture as well. So the first story we need to look at in order to be able to perceive that is of course, the story of the flood. And so we often understand the story of the flood as this pure thing, right? Noah is fleeing a world of giants. So he's fleeing a world of monsters. And to flee the world of monsters, he makes a boat. And. And he crosses over in that boat. But the boat is also full of animals. And this is a very important part of the symbolism. So what you want to do now is you want to keep those images in your mind and not necessarily right away, look at what side those images fall on. That is a river crossing or a water crossing. Then the notion of animality, then also the notion of giants or monsters, different types of them. So in this version, you'll see that. And also the notion of the strange. Like, I've really. I tried to explain to you how there's a relationship between monsters, animality, and the strange and the stranger, like and the stranger. Not in a specific way that is that every identity has a stranger. It's not about specific groups or specific nations or specific races. And it is, in that case. Now, it's mostly about the idea that all identities have on their edges something which they see as strange. And this is relative to the identities, but it's objective in the sense of the pattern, that is that every single nation, every identity, every family, anything you can identify, will have something on their edge which is a stranger and which can be recognized as such. And so in the story of the ark, you have this stranger as the strange spirits that come and mix with the daughters of Cain. And so you can see it one way or the other. You can see it as the angels, you know, having relationships with something which is strange to them, which is the daughters of Cain. But you can also see it from the side of the humans, having encounters with these strange and kind of wild spirits, fallen spirits that are creating these hybrid giants. And now these giants are there, become this phenomena at the end of the world. They create hybrids, they create technology. They create all these things. And in order to escape that, Noah has to flee in a boat which is full of animals. And so you can already see that he's using something of death in order to, of course, cross over the waters. You see that, of course, in the boat itself, which is a technology. So the technology which came from Cain is now used in order to cross over. Now, this is made clear in several legends that you can find. There are some crazy legends, for example, some traditions which say that Noah's wife is named Naamah, and she would also be a descendant of Cain. And so Noah's wife would be something of that fallen world that is related. That is related to this flip or this trick or taking something and turning it against Itself. There are also weird Jewish traditions about, you know, the giant og, you know, pulling the ark through the flood. That's how he got to the other side. And so there are plenty of ways of trying to kind of understand this, but usually to just see the elements and how they're related to each other. Now once you see that, you'll notice that now this pattern will repeat itself all over the place in scripture, but also even in other traditions. And so when the Israelites, for example, leave Egypt and so they're prisoners in a land of strangers, they are slaves in a land of strangers. And now in order to flee, what they'll do is they'll also gather a bunch of strangers with them. A bunch of mixed multitudes. Now it's not even, it's not even just the, not just the Egyptian, but a mixed multitude of different groups and different identities. Think of it a little bit in the way that, for example, Richard Rowland in our discussion has talked about the nest, the thing that protects you as a gathering of random twigs, which potentiality, which is brought together to create this ark, this boat, this protection of. Around you. And so that's what happens when the Israelites flee Egypt and then they cross the waters, just like in the, in, in the flood. Now in the flood, the, the giants get lost in the flood in. Now the crossing of the Red Sea, the Egyptians with their chariots, that's important, the technology as it was there in the. Before the flood. Now the Egyptians are described as having these war chariots. And so all of that is lost in the flood, the crossing of the Red Sea. And on the other side now you have the Israelites with this mixed multitude which have to now find a way to recohere and to come together under one common identity. This will of course happen when Moses receives the law and has to prune some elements of the tribe, but ultimately brings them together in order to create, create Israel. But if you want to see a version of this, which is even crazier, it is that when the Israelites reached the Promised land because of a lot of. Because of their doubts, because of their own refusal to accept that this was the plan for them when they reach the Promised Land, There are only 2 adults left of the original group that left Egypt. And those two, those two people are Joshua and Caleb. Now Joshua and Caleb, they were the, in tradition, they were the spies that went into Jericho and had this relationship with the prostitute that was in Jericho. There's a relationship with that as well. This kind of relationship with those that are on the edge of the other world as well. So you can imagine a world with water in between. And on the edge of this world, like where we are, there are spies, giants, monsters, guards, all of these types of things that exist on the edge. And then the other edge, there are those aspects of the society which are on the edge of that one as well. And so the poor, the prostitutes, those that don't have a stake, let's say as much in the city, but are on the edge of that. And there can be a relationship between the two. You can use this aspect of this society as a potential to create your transformation, right? So you can seduce the disaffected in order to bring about change. Because the disaffected is like a potential that is not. That doesn't have a stake in the current system. Okay, so this is what's happening in this, in the story of, of Joshua, of the two spies which go to Jericho. But now when we come to the. The actual transition later, when they. They finally do cross over the. The river, the only two from the original group that are left are Joshua and Jericho. Now it's super interesting is to realize that Joshua means Jesus. It's basically the same name. And Caleb, there is one reading of the name Caleb, which is that it means dog. And not only that, but there's one of the descriptions of Caleb, which is that he is a dog stranger, he's a Kenizite. And he's told that he receives the edge of the camp. So his people, his group, he, He. He receives the edge of the. The land which they take in Israel. Now it's very fascinating because modern scholars will hate this, but there is definitely, you think of this, the sound of the relationship between Cain and, and Kenizzite. There's definitely something going on in that relationship. Not necessarily a historical connection, but people in the ancient world would have seen this connection in terms of sonority. So you have Caleb, the dog, who is a Kenesite and who lives on the edge of the camp. Now think about it. You basically in. Now in the Old Testament, right, in the book of Exodus, you find the very image of, of St. Christopher, which will appear in the European Middle Ages, of Christ, of Jesus riding in, crossing the waters with a dog in order to reach a new world, in order to reach the other world. And that dog is an image of the edge, an image of the descendants of Cain as well. And for example, St Christopher is said to be a Canaanite. A Canaanite in the sense of a son of Canaan. And now we have the Kenizzites, and we have the descendants of Cain, all these sounds. I know people will think that this is arbitrary, but even though there might not be actual linguistic connection between the two, this, for ancient people, would not have been arbitrary, would have been a way to put these things together in the text in order to help you see the connection that is being made, to help you in intuit that there's a relationship between these different things. So this is, of course, one example, but there are many other examples of this in Scripture as well. And so, for example, once again, when Elijah crosses the river, what does he use in order to cross the river? He uses his garments of skin. And so he actually uses the animal part of him. He uses this garment, this outer garment that he has, which in Scripture is said that was a woolly garment. So he has this animal skin around him. Think of these images. We have a prophet, you know, of St. John the Baptist, who wears this animal skin. And so now with this animal skin, he is able to cross the Jordan river and go to the other side. And in that stories, interestingly enough, there is an ascension. And so this is something you'll see in a lot of the stories, which is that in the crossing of the river, the. There's something which happens, which is that the higher principle ascends up into heaven and leaves the body down at the bottom in order to kind of continue in this new world. We see this, of course, in the crossing of the river into the promised land, where before Joshua and Caleb cross over, Moses goes up the mountain and disappears and dies. But it says in later traditions that his body was taken up by St. Michael into heaven. And there was even a competition between the devil and St. Michael for his body. But this is to show this kind of ascent before the transition into the next world. You see that, of course, now, again, after Elijah crosses the Jordan river, he comes to the other side with his garments of skin, and then he ascends up into heaven and he leaves behind the body. He leave behind this garment of skin which has his power in it. And now you. Now it goes on into the next world with his disciple Elijah. So you can really kind of understand this at the manner in which you change worlds, because this is actually how you change worlds. You have to. The. The Spirit of the first world has to go up, has to kind of disappear and then leave behind a new potential for the Spirit to come back down or a different spirit to come back down in order to bring about the next world. And so you see that, of course, in the story, like I said, of Elijah and Elisha. But there, again, are many others. And, you know, you will find different versions of this in different moments. And they have different shapes. And I'm going to give you a few more, but there's plenty more if you want to look for them. So there is a story, for example, of Samuel, the prophet Samuel, who is put down into a cistern. Now, there are several versions of this story. Where someone is put down into a cistern. And then is brought back out of the cistern through a stranger. Now, in the story of Samuel, it's the most explicit. Because Samuel goes down into the cistern. And then an Ethiopian man comes and. And remember what Ethiopians mean for the ancient world. It really is people on the edge of the world. People that are in the extremes. And there is a relationship between the Ethiopians for the Greeks, for the people of the Mediterranean. Between the Ethiopians and these monstrous races. Which are kind of exceptional, which are strange, which are on the edges of the world. So this Ethiopian comes and he pulls Samuel out. And it's pretty. It's so funny because it's so explicit in the story. He pulls Samuel out with a rotten garment. So now it's not a garment of skin per se, a garment of animal skins, but it's a garment of death in another way. So it's a rotten garment. And he pulls Samuel out of the cistern using this rotten garment. There are little hints of that in other stories. For example, if you think of the story of Joseph. Who is also put in a cistern. And then is taken out in order to be sold to the stranger to go into Egypt. It's not exactly the same, but you can see those elements come together. And he's sold into slavery to a eunuch. And you'll see that image of the eunuch come back later. So Joseph is taken out of this cistern to go into the strange land. And he becomes a slave to a eunuch. Now, so that you'll see it later when we talk about the Ethiopian eunuch. You'll see that there's a relationship between all these things. So fast forward now directly to the story of the Ethiopian eunuch. Now, in the story of the Ethiopian eunuch in the Book of Acts. You have a lot of these elements now coming together once again. And so the Ethiopian eunuch is there, you know, on the side of the road. And he's puzzled. He doesn't understand the Scripture, you know. And the idea that the stranger presents itself as A puzzle to be solved is something that we've talked about many times. We've talked about this in terms of the Queen of Sheba who comes to Solomon to present her puzzle. We've talked about it in many different ways that the Sphinx, this monstrous creature which comes and poses its riddles and this puzzle is like. It acts like a guardian, right? It acts like something which prevents you from entering into. Into a world, is like a buffer of question or chaos between two different realities. Of course, the cherub on the, on the. The veil of the altar, that. Or the. The cherub which prevents you from entering into paradise as well. So that the cherub acts as a guardian to paradise in its strange kind of mixed form. Remember that one as well, because we'll see it a little bit later too. And so the Ethiopian eunuch is both Ethiopian, that is, he comes from the edge of the world. And a eunuch, just like the eunuch in the story of Joseph, that's a representation of, for us, let's say, for an identity of the sterility of the strange. To us, that is, the strange doesn't perpetuate our identity. And so it has an image of sterility to it. And this is of course, an extreme image of sterility. Now what's interesting is of course, how Christianity is going to transform. That is going to, let's say, just like Christ, heals the sick. And also just like Christ, when you hear the story of the Canaanite woman who Christ actually refers to as a dog, that she receives the crumbs from the edge of the table, she asks for the crumbs from the edge of the table. And Christ says, you know, that she has faith. And so she will receive, even if she's very far away from Christ as this Jewish Messiah, she will nonetheless receive those crumbs which will reach all the way to her. Now think of that as a version of Pentecost. And now in the story of the Ethiopian eunuch, we have a great version of that which is. The Ethiopian is represented in a certain manner in this story as something of a monster, something of a sterile, strange character, but who also is a guardian of riches, you know, he's the guardian of the treasure of the queen of Ethiopia, just like the Sphinx. And all these creatures are also kind of guardians of treasures because they're potentiality. And if you can encounter it properly, then it yields all this potentiality. And this is what we see in this story again. So now Philip the Apostle Philip comes to the Ethiopian eunuch and explains to him the scripture, and then ultimately he baptizes the eunuch. Now, this baptism is related to Elijah crossing the waters with the garments of skin. That is, Philip goes into the water with this, this man who represents the sterile, the strange, the edge, all of these things goes into the water. Because in also, you have to remember that in Israelite culture in the Old Testament, someone who is castrated, someone who is a eunuch, could not enter into the temple, he was considered impure, and so could not enter into the sacred space. But now what Philip is doing is really transforming this. So he brings the Ethiopian eunuch into the waters, baptizes him, and then Philip vanishes, goes up into heaven. And you think, why is that necessary? Like, why does this have to happen? Well, it's referring again to the story of Elijah and Elisha. Even the words that are used, it says, and Philip was seen no more. Or something like that is a direct quotation of the Greek version of the story of Elijah and Elisha. When Elijah goes up into heaven, it says that Elijah was seen no more. And so Philip goes up and leaves behind. Now this transformed, this new world, this new possibility for Christianity. And Christianity will constantly be this image of the capacity for the divine Logos, for meaning, for encounter, to reach further and further out into the land of what before was considered the, let's say, infertile strange. And you can see this in many, many aspects of Christianity, which isn't just like a giving in to the strange, but always tries to find a balance between its kind of inner relationship of love and then its encounter with the strange. This is, of course, the two pillars of the church. St. Peter as the pillar of the circumcised church, the. That is the pillar of the church of those that have removed the garments of skin around their member. And then St. Paul as the apostle to the pagans, the apostle to the Gentiles, the apostle to the Ethiopians, and all the peoples that are further and further out from them on the edge of the world. So it's there in so much of Christian tradition. One of the traditions in Christianity, for example, is that you are not allowed to marry within your family. And. And there are some. Some of those are really wild. Like, there are some traditions which bring it to the seventh degree. That is, you're not allowed to marry seven degrees of family, that is, the cousin of your cousin of your cousin. Obviously, these were always. I don't think they were really able to follow this properly. But the principle is there, which is that you need to marry out. And you need to marry out so that the kingdom of God increases and kind of becomes bigger and bigger. And as the kingdom progresses, even in terms of marriage and in terms of relationships. Now of course, this whole story, this movement, this idea of the transformation of that which is on the edge, the transformation of that which is monstrous, or the healing of that which is sterile, all of this is of course summed up not so much in the story of the Ethiopian union, but summed up in the story of Christ himself. All the things that he does, all the movements that he does towards the margins, but then ultimately in the story of the death and resurrection of Christ. Especially as it takes its fuller image in the different legend, the different representations where Christ goes down into death and gathers all of death together to bring it up with him. The idea of using death against death, this whole notion of the trick which is also played on death is super important. This whole imagery we see in the Gospel of Nicodemus, of Christ going down into Hades and death and Hades and the devil kind of, you know, talking about how they've won, they've done this, you know, they killed the son of God and so now they basically won the battle, but then being surprised by Christ coming in as a conqueror and basically taking on death. And so there's a trick which, which is happening on death where death thought that it was winning. And ultimately it's the light which won, it's the resurrection which took over. And so this of course now brings us to the story of St. Christopher himself. And so in the legend of St. Christopher, the one that is the most known about him, which is probably a later tradition, according at least to the scholars who, we don't, we don't trust them that much. But you know, whatever. That doesn't bother me to think that this is a later tradition. Now this is the story of the legend of St. Christopher, this part of it, which is that St. Christopher is a monstrous giant, sometimes dog faced Canaanite. And so he's a Canaanite in many ways. He's a descendant of Canaan, that is the giants that were there in the Old Testament in the land of Canaan. But ultimately he's also something like a, a descendant of Cain in a more metaphorical way, that is through the sonority of the relationship between Cain and Cainite and canine. You know, all of these things come together so much that the scholars will tell us that it's just all errors of transcriptions where they made a mistake between Cain in terms of the son of Adam and Eve. Then canine in terms of dog, and Canaan in terms of the land where the Israelites came into. But as we know, the manner which symbolism happens doesn't necessarily have to account for mechanical causation through attention. That is that the fact that people would be able, even in terms of transcription, the fact that they would be able to confuse those, and that those errors in transcriptions would make sense to those that read them later makes means that the connection is there and can help us understand what it is that's going on. So the story has him as this dog face warrior in the land of Canaan. And what he has is he has this insight. He wants to serve the strongest king, the strongest man in the world, the strongest being. And so he kind of leaves his edge of the world, this land of, this strange land of dog face monsters, giants, and he encounters a king, a great king. Now he goes to the king and sees in him like, wow, this king is super powerful. I want to serve this king. So he enters into the service of the great king and of course is very appreciated by the king because he's a very fierce and powerful warrior. But one day, St. Christopher, at this moment, he's called Reprobus. Actually, he's not called St Christopher. Reprobus is a good name for a monster, isn't it? And so Reprobus sees that this Canaanite king, this powerful king, is afraid of the devil. You know, he avoids saying the word the devil are different ways of showing that he's actually afraid of the devil. And so, you know, Reprobus is curious and asks the king, he says, like, who is this? So who's this devil figure? Now the king doesn't want to tell him and he says, well, look, if I tell you who the devil is, then you'll leave me and you'll go serve the devil, right? And this is where now St Christopher appears as a trickster. Reprobus is a trickster because he tells the king, if you don't tell me who the devil is, then I will leave you. And of course the king is forced to tell Reprobus who the devil is. And no surprise here, Reprobus leaves the king to find the devil. And so the king has been tricked. He finally comes to serve the actual devil and enters into the army of the devil. Now think about this like he becomes a saint later. So he serves the devil and you know, he's the devil's super powerful, obviously the most powerful being there is. And he realizes that the devil is afraid of the cross and so he's like, okay, well what is this thing? Like if the devil is afraid of it, it's got to be very powerful. So he asked the devil, what's this whole thing about the cross? Like, you know, what is this about? And the devil says, well, I'm not going to tell you who this Christ figure is. If I tell you, then you'll leave me, right? Same thing as in the first story. And Reprobate plays the same trick. He says, if you don't tell me, then I will leave you. The devil is forced to tell, tell Reprobus. And of course Reprobus leaves. And so now the devil has been tricked. So Reprobus goes out and he wants to find this Christ. He's like, I want to find the most powerful being in the world. I want to find this Christ. And he doesn't find Christ right away, but he encounters monks and he's asking about, he's like, I need, I'm looking for Christ, you know, I'm looking for Christ. And the monk says, well you know, I can show you how to find Christ if you want, but Rebbe is like, all right, you know, you know he's the most powerful being, so I need to, so tell me how to find Christ. And so the monk says, all right, so if you want to find Christ, if you want to serve Christ, then you have to pray. And so Reprobis is like, okay, he's a monster. He's a giant dog faced, you know, you know, maybe possibly used to be a cannibal monster. And he says, he's like, no, I can't, I can't do that, I can't, I can't pray. So all right, the monk says, okay, so if you can't pray, then maybe you should fast. And again, Republic is like fasting, that's not going to happen, you know, he is a monster after all. And so the monk says, you know what, you could stand next to the river, right? And when people come to you, you can cross them over the river because there's no bridge and it's dangerous. And so Reprobate is like, you know what, I can do that, I can do that. So he goes next to the river. So think about now, what's happened. And so the monk has asked Christopher to do two things. He's asked him to pay attention and pray. And he's asked him to remove these garments of skin fast. So cut off the excess and focus on the highest thing. Those are the two aspects, right, of how we cohere. We have to remove. And we have to eliminate the periphery and the things that aren't part of the identity. And then we have to cohere towards, to the single identity that constitutes things. And he couldn't do either, right, because he's a monster. That's what he is. He's an idiosyncrasy. He's all those things on the edge. But this is where we see the mystery of what can happen. And so he is potential. And so as potential as a body, right, he is the one who can cross over the river. He's the one who can bring you across like a boat, like, you know, like the garments of skin. And so he's crossing people over the river. And then one day a young child, baby, you know, very small child, comes to him and asks Reprobus to cross him over the river. So Reprobus, you know, takes the child, puts him on his shoulder, starts to cross the river. And so as he's crossing, he becomes heavier and heavier and heavier to a point where Reprobus feels like he's going to go under, like Reprobus feel like he's going to die. He's not going to be able to make it across the river. And so there are different versions. Sometimes he asks them in the middle of the river. Sometimes he asked him when he finally was able to cross over. It doesn't matter which one. And so let's say he crosses over, puts the child down, and then asks the child, like, why were you so heavy? And the child answers, because I was carrying the sins of the world. And then you know what happens, right? I've already told you what happens. Then Christ vanishes, goes up into heaven, you know, because that's how it works. Like, that's how this crossing pattern works. And St. Christopher is, has crossed the river. Now there are different versions of what happens after he's crossed the river. In some versions, he realizes now he's transformed back into a human person. In other versions of the story, he, he has a staff that has, that burgeons. He has a, a dead piece of wood that now starts to grow leaves and branches, okay, so you can understand what it is. It is this new world. He has moved across the waters and he is the one who will act as the potential and the, the capacity for the world to start again. But the most interesting thing, the most interesting thing in this story is that all this time Reprobus. And of course he's renamed Christopher right after he crosses the river. That's where he's renamed Christ Carrier. But all this time, Reprobus tricked the king of Canaan, tricked the devil, but now he's been tricked. He's been tricked to his salvation. That is, he wanted to serve the strongest man in the world. And what he ends up doing is serving the weakest possible thing, a baby. And so he actually thinks, how can I say this? He thinks that he's serving the weakest thing and is being tricked into actually serving the strongest. And he would not have even been capable of seeing that. That's also, let's say, the insight you need to get here. He would not be able to see the strongest thing or the highest thing, because the highest thing is often hidden, is often hidden like a seed. It's actually not that visible. It's actually not the thing that is the shining thing in armor. The highest thing is the hidden spiritual transformation which occurs inside people. The highest thing is the monk hidden in a cave somewhere in a mountain, who prays all day and all night and you don't see and you don't hear about, but who is actually holding the world together. And so here we can see this double trick, this double inversion that Matthieu and I talk about, you know, of how death is used to transform. There's a trick played on death, and the trick that Christ played on death when he went down into Hades and surprised Hades by taking it over, is similar to the trick that Christ is playing on Reprobus as he crosses the water, coming to the other side and finding that he has now been saved and that he is now participating in furthering the kingdom of God out into. Further out into the world. And so these are the things you need to meditate on if you want to understand what is possible at the edge. And if you are interested in the graphic novels that my brother and I are starting, this is what we're going to be exploring, not just in the story of the graphic novels, but in the very existence of them. That is as the comic books as being one of the lowest forms of art in the 20th century, recognized as one of the lowest forms of art, or the most popular, the most trashy. All of this also because we play in this ambiguous sphere of fiction and storytelling, we create anachronisms in the story. We do all these things which actually for some people will seem suspicious at the outset, but knowing, and especially for people who will have the insight, knowing and perceiving that there's actually a trick being played, a trick hopefully to. Towards in the direction of salvation. And so I hope you found this Interesting. As you've probably seen, I love St. Christopher. I love the story of St. Christopher. And we'll probably do another video going to talk more about dog headed men in general and possibly of course talk about giants. And so thank you for your attention everybody and I will talk to you very soon. I want to present you a new series of graphic novels called God's Dog. God's Dog is a very loose and epic exploration of the legend of the dog headed warrior St. Christopher, one of the most surprising and peculiar traditions of the ancient medieval world. It was written as a screenplay by myself and my brother Mathieu over 10 years ago and the story was taken up and even recommended by script scouting agency. It was requested by several Hollywood studios. But this story was of course too big, too strange, too surprising for Hollywood. And so now with all the control of its potential, we bring you this groundbreaking story in full color as a series of graphic novels. The story is set in a Tolkien style mythical version of the biblical world. Filled with hidden codes, ancient relics, angels, giants, dragons and populated with fictional versions of mysterious monks, warrior saints and more symbolism than you can imagine. God's Dog contains all the intensity and subtlety of our symbolic thinking. The world class layout and artwork of Cord Nielsen. All of this bound in a mysterious and powerful story arc which is available to all from wide eyed 10 year olds to the most seasoned of readers. The entire story with all its action and complexity is already completely worked out and the first book is near completion. Now all we need to do is deliver it to you. We're crowdfunding this because it is only the first step. We've already been contacted by even international publishers for this. But we want to knock this out of the park so that our artists can do this full time and deliver the oncoming books at a regular and steady pace under our control. I myself will personally not be taking any profit from this first book, but rather I want to use this to build what we need to test tell this full epic with all its cosmic proportions. So along with the graphic novel, we are also producing a crowdfunding only Add on the Secrets of God's Dog sourcebook. A beautiful volume in which you will find my original drawings from more than 10 years ago, an exploration of the symbolism of St. Christopher and an exclusive text by Matthieu Pageau on the symbolism of the biblical Samson. This is the first thing that Metio has published since his groundbreaking book the Language of Creation. So jump into the margins with us, be part of this shift in storytelling where the end becomes the beginning and where the monster carries the king into a new world. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is based on a series of videos that you can find on my YouTube channel, Jonathan Pageau's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description and so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by of course leaving a review on itunes. Everybody knows that's the best way to to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially going to www.thesymbolicworld.com support or else on Patreon, the Pageau videos as well and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
