{"episode_id":"SW - #409 - 2025-09-20 - The Strange Symbolism of K-Pop Demon Hunters - Shame, Attention, LGBT, Jung","start":0.16,"end":59.17,"speaker":"Laura Diaz","text":"Tucson, the weight is over Mediweight loss. They're officially open on North Oracle road. That's right. No more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight and serious risks. At mediweight loss. I got the same medication but with a customized plan, weekly check ins and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better and lose weight the right way, mediweight loss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today."}
{"episode_id":"SW - #409 - 2025-09-20 - The Strange Symbolism of K-Pop Demon Hunters - Shame, Attention, LGBT, Jung","start":59.25,"end":298.23,"speaker":"Jonathan Pageau","text":"That's mediweightloss.com Yes, I watched K Pop Demon Hunters and now we're going to talk about it. It's very odd because for several weeks now people were sending weird messages on the symbolic world Facebook group and then on Twitter and different places. People were trying to get my attention on this K pop Demon Hunter. You know, I often get weird requests for weird anime series and stuff like that and I usually kind of, you know, don't really pay attention. But then these requests started to get more and more and I was like, what is this movie? And then someone on my team who to be fair, has a very young daughter said, you know, Jonathan, you really should watch this K Pop Demon Hunter. Everybody's talking about it and you, you need to talk about it. So anyways, I was traveling, I was, I had a bit of time and so I decided to watch it. And I have to say that I was. First of all, I was surprised. It was well put together. It was a good animated movie in some ways. It seems like Sony with the Spider Man, Spider Verse series and now with this movie is definitely outshining Disney in terms of quality. The movie was well written, the characters were interesting. You know, just that, just that is almost enough now because everything is such drivel everywhere. So. But I guess people were mostly interested in what does this have to do. Why are there these demons? You know, is there something interesting? Some Interesting symbolism to look at. And the answer is, of course, yes, with some caveats. There are some interesting things in the movie and there are some problematic things I would say in the movie, of course, from a. From a basic symbolic perspective, but I would say obviously, of course, from a Christian perspective as well. This is Jonathan Peugeot. Welcome to the symbolic world. And so you probably know the concept, the idea is that there are these K pop stars that are secretly demon hunters. And this is a long lineage of demon hunters that are always women. And the way that they entrap these demons is through song. Of course, they kill the demons, they fight them specifically. But the basic thing they want to do is sing in a manner which will create a kind of web they call the honmoon, a kind of web that will cover the demons and will prevent the demons from poking into our world. And these K pop stars are the latest iteration, and they're right on the verge of reaching the golden honed moon, which is the moment when the demons will no longer be able to come through. And so this evil devil demon character, what's its name, Guima, that is like a kind of living fire that controls the demons, is convinced to create a demon boy band. And the demon boy band comes and tries to compete with the Huntrix, which is the band in the K pop band. And of course, you know, they're all. This ensues. They're secret demons and so ultimately they get defeated. But there's also a. A story of love. Anyways, I don't want to. The purpose isn't to give you a big synopsis if you haven't watched it. You probably don't care to. To know what I think. Anyways. And so the basic concept is interesting. The idea that music in some ways is a way to defeat demons is of course, something that's very fascinating. The way that the demons are represented and the way that the people affected by demons are represented is that they have patterns."}
{"episode_id":"SW - #409 - 2025-09-20 - The Strange Symbolism of K-Pop Demon Hunters - Shame, Attention, LGBT, Jung","start":298.55,"end":299.99,"speaker":"Announcer","text":"Oh, look, patterns."}
{"episode_id":"SW - #409 - 2025-09-20 - The Strange Symbolism of K-Pop Demon Hunters - Shame, Attention, LGBT, Jung","start":299.99,"end":300.63,"speaker":"Laura Diaz","text":"Oh, these."}
{"episode_id":"SW - #409 - 2025-09-20 - The Strange Symbolism of K-Pop Demon Hunters - Shame, Attention, LGBT, Jung","start":300.71,"end":301.59,"speaker":"Announcer","text":"These are just."}
{"episode_id":"SW - #409 - 2025-09-20 - The Strange Symbolism of K-Pop Demon Hunters - Shame, Attention, LGBT, Jung","start":303.03,"end":1632.71,"speaker":"Jonathan Pageau","text":"Now these patterns are kind of these irregular, jagged patterns. It's interesting to think that the word pattern would be used negatively. We can get how that word is used negatively when we talk about, you know, bad patterns in your life, you know, relationship patterns that you have. And in some ways, these demonic influences are represented in two specific ways. Mostly they're things you should be ashamed of. On the one hand, there are the things you've done in the case of the Ginu character who has. Who basically traded his family in order to be comfortable. But in the Case of the. The main female character, her name is Rumi. She has a kind of shame that isn't based on something she's done, but it's based on something she is, which is that she is the mix of a demon and a human. And so, interestingly enough, that this weird kind of nephilim. Nephilim imagery in the story, though I wouldn't interpret it so much in that way. Of course, it's a. It's based in kind of Korean lore, a lot of it. And so I wouldn't go too far in that direction. But it's mostly the idea of having something. Something from your past which is shameful. Something that you're not responsible for, but that you carry the weight for. It could be being an illegitimate child. It could be being born from a poor family or being born from, you know, certain. Having certain things in your past that you didn't decide, but that would bring shame upon you. There's also something else that it suggests. We'll get to that a little later. And then there's also the things that you've done with the roomy character, which you see. And so the idea is that this is what the demons do, is that they invoke shame in you on the one hand, and therefore they get you under their control. And in the other way is that they get your attention. The whole thing is, of course, based on attention, which makes it very interesting, the notion that in some ways, the way that these hunt tricks are able to defeat the demons is not just the way that they sing, but the way in which they harness people's attention. So there is a kind of, of course, confusion between religious attention and celebrity. You see, of course, in a normal religious world, this is true. We come together. We would sing songs to worship God. We would. We would participate in sacred events and in sacred prayers. And, you know, as we do it together, right, not only on our own, but as we come together and do this, in some ways it binds a relationship of love between people focused on God. And that is, of course, a way to fight demons. If you think of demons, of course, as the thing that fragments us, the thing that separates us from each other, which is, of course, very much the case in this movie. The demons pull the hunt tricks apart, but by making them feel ashamed and making them feel guilty about certain aspects of their life. So there's an interesting relationship with the way that the world actually works. But you can see how it's. It's very much a parody, because now what we have are the Huntricks who are celebrities and they have their fans and so they gather the attention of their fans into their song and they sing these songs that are about being confident in yourself. You know, what is the song golden? That is they're kind of leading to, which is about moving up and being confident and knowing what you are and, and knowing who you are and being. And all of that kind of self esteem language which you can see how it makes sense. People tend to oppose self esteem language against the idea of being ashamed of who you are and of what you've done and so giving you trust. And so there's like a parody, right? In this case, the fans celebrate them because makes them feel good about themselves about what they're doing. And then their song, the pattern that this brings is now a pattern that will hold the demons back, which is a parody of course of, of how sacred reality works. And there are some really interesting things going on. You know, of course the, the Saja boys who are the, the, the demon boy group. There's this whole wordplay in Korean supposedly about how saja is means lion, but it also seems to reference, you know, this, these spirits. And they, they also are related to the grim reapers. The way they dress, especially in the last song, the way they're dressed, are dressed kind of as, as these grim, grim reapers figure. And so their first song that they come to sing, you know, to get the Huntrix fan, is the song called Soda Pop, which is about basically saying, I'm going to consume you. And it's a kind of smart way of doing it. This notion that, you know, in some ways, in theory the hunt tricks, what they do is that they take your attention and they, they, they put it towards something positive which is defeating the demons, giving you confidence in yourself, all of that stuff. Whereas the Saga boys, what they're doing is just like the demons, they're stealing your soul by stealing your attention and they treat you as something to be eaten, like a vampire to be consumed. And so there's all this whole thread through the movie where the Saja boys, what they do is, you know, as they gather the fans away from the hunt tricks, their attention is drawn into the Saja boys, but that also is the demons coming and stealing their soul. So you see people like looking at their phones, listening to the Saja boy song, and then you see a demon coming behind them and like taking their souls. And so they, people take, you know, these demons, they come and they take the souls and they bring them down to this satanic character that is in hell and is ruling over the demons and is ruling over everybody with, by, let's say, wielding their shame against them. And so then, strangely enough, what happens is, you know, as the competition kind of grows, we discover that one of these characters, the. The main Huntrix lady, is half demon. And so now she faces the shame. And because she's kind of facing this shame, she doesn't know what to do and is tearing the group apart and is bringing her closer to this demon boy, and she tries to save him. Anyways, there's all this stuff that happens, but what's really important to notice is they participate in a competition, which is the idol competition, right? And supposedly in Korean, and it's true in many languages, in French, too. It's a word for a celebrity. Is idol in English too? With American Idol, all of that stuff, this idea that it's the idol. But then the Sajo boys sing their final song as they're dressed as the grim Reaper. And now they really say, I'm going to be your idol, right? And they really use a story, an image of false worship and an image of saying, you know, I'll be your God, but I will, you know, I'll take everything from you. But it's fascinating because in some ways, it's hard to distinguish what they're doing, to be honest, in my. What I think it's hard to distinguish what they're doing from what the hunt tricks are doing. They're participating in this idol competition, they lose, and then the Saja boys sing this idol song. So what's the difference between the Saja boys taking the people's attention and sucking it dry and basically being like vampires who are taking their attention for their own power and feeding on people's insecurities and shame. What's the difference between that and the Huntrix? I think what they're trying to suggest and that in this case, in the Hunt Tricks case is because the Hunt tricks, you know, they. They're a group that love each other, and they're kind of modeling a positive relationship and they're modeling success and, and, and kind of, you know, self confidence and all that. But of course, the roomie character, she is half demon. And so this is when things get very, very weird because she has to deal with that. And the fact that she's has deemed half demon is something that she can't stop. In some ways, this idea, in some ways that there's some secret that she has that she's trying to repress. And there's this shameful thing in her life that she's trying to hide and to repress. So she keeps hiding. That's why she tries to over over perform. And then ultimately she can't hold it anymore and she becomes this kind of weird hybrid demon with two different colored eyes. And. And then it looks like it's all gonna break apart. You know, the characters are replaced by demons, the other band members, and it looks like everything is going to. To fall apart. And that's when they finally sing the last song. And in the last song you really get a sense, you could say of what the problem is. You could say, or how can I say this? Of why this is a caricature of true spiritual battle or truth of the true spiritual life. The last song is called what It Sounds like. And, and in this song you realize that the character Rumi has to come to terms with what she is. And there's a weird moment, you know, kind of in that song where the. The male character sacrifices himself and he sacrifices himself. Of course he's in more trouble than she is because he's done these horrible things. And all through the movie he's basically like stealing people's souls. It would be very hard for him to have a positive arc except to do exactly what he did, which is sacrifice himself. But then he says this weird thing and he says, I give my soul to you. Which is very odd thing to do as he's kind of dying. And then as they sing this last song, the hunt tricks start to wield people's souls and they gather all these souls together and you see these, this, this light coming out of people's bodies and they wield their, these people's souls in order to finally defeat the satanic character. But you know, at the beginning there was a sense that they were trying to create the golden Honmoon, right? This, this golden feel, this golden pattern that would hold back the evil patterns of the demonic patterns. But now they of course create. What do you expect? They create a rainbow hon moon. And you can see all of these colors coming out of people. And then they create the rainbow hon moon. And then in the song Rumi sings about how, you know, she was shattered into all these pieces and you know, she was ashamed and she was hiding. But now no more lies. Now we tell the truth. And now I see the beauty in the broken glass and now I see the light refracted in the jagged edges. And you realize that basically this is a coming out scene where she is basically saying, I am no longer going to be ashamed of what I am, I am no longer going to hide what I am. But all this brokenness and these things that are fragmented in me, they're part of me and therefore I will put them out there. Now this is of course a huge difference and this is where a lot of Christians, they become confused because I've seen people, you know, say that this is a Christian story. And like I said, there are some elements of it that are similar to kind of Christian thinking. But the basic trope of it, right? The basic idea of thinking that the way, in order, the way to deal with the shame of our sins or the shame of the things that we. That are holding us back or that are, that are, you know, in the shame of our parents or the shame is in some ways to say, this is me and I'm going to put it out there and I'm going to not be ashamed of it. I'm going to show it to the world, right? And then we'll have this refracted rainbow honmoon which will be the real, the real pattern that will hold back the demons. That is a deep mistake. It's a deep mistake in many ways. The best way to understand why it is a mistake is this. It's very simple structure, right? It is that when we are together, it doesn't matter in what situation. If we are together in a team that builds robots, then while we're in that team, what we will do is we will emphasize the things that join us together. We will emphasize the aspects of us that are part of the way that we come together. That is how society functions. When we go outside, when we encounter our friends, when we go to school, what we're doing is we are putting in front the aspects of us, of our behaviors, of our thought, of our actions, right? And even of our identity that can participate in the common good. And so if I'm at school, I don't do the things that I do at home when I'm lazing around, right? If I, if I go to school, I don't wear my pajamas, you know, I don't sit there and snack or I don't stream whatever movies or I don't play video games or whatever people do at home. That is more. And other things, you don't do that when you are in a space where that's not appropriate. And if you did, it would be shameful. And that is what shame is for. Shame has a function. Shame. The function of shame is to help you understand what it is that can participate in the unity of A group and what can't, right? And so there are certain things that are shameful. For example, the behaviors of the main male character are shameful because they break apart his family, because they break apart society. Most of our sins are shameful because they, they do that. There are other things that are shameful to us that are shameful because they're only shameful if they're not in their appropriate place. Going to the bathroom and doing the things you do there is totally normal when you do them there. But if you did them in the living room, then that would be shameful. And so we really have to understand what shame is for and what shame functions. And the solution to shame is not to say, I'm gonna take a dump in the living room. That is not the solution. Coming out and showing all of your insides and all of idiosyncrasies is not the solution to shame. The, the. The solution to shame is to understand what things are in what place and what part. If we deny the, the. The darker aspects of ourselves, that is, of course, it will create the, the. The voice of demons in your ears. Because the demons, they accuse. That's what the Satan is, right? The Satan is the accuser, is the one that comes and says, oh, you're guilty of this. You, you're not good enough. You're not, you know, you shouldn't be here, all of that. But the answer isn't to say, well, yes, I should be here, and here are all my faults and I'm not going to be ashamed of them anymore. That is not the way to do it. The way to go through this is humility, is to understand that, no, you're right, that you are not completely worthy to be wherever it is that you are, that you are not. You don't have everything you need to be in the place that you are, but that it's not through this, like pride of all your idiosyncrasies, right? In some ways it is. To take the position that you are seriously and to do the best you can with all the brokenness that you have doesn't mean putting that brokenness out there and trauma, dumping on everybody. What it means is to understand that you're right, you shouldn't be there. You know, none of us are worthy. None of us are worthy of the positions that we have ultimately, because we all are broken. And it's true that we are these broken, these broken figures. But the answer, like I said, is to say, therefore, I will take very seriously the fact that despite my brokenness, I'm here. Despite my brokenness, there are people that love me. Despite my brokenness, there are people that care for me, that are willing to be my friends, that are willing to hire me, that are willing to do that. And I will therefore be the best version of myself that I can be. As I was watching K Pop Demon Hunters and I was seeing, of course, Christians, some of them being extremely angry at it and some of it being strangely seduced by the movie, I was thinking, isn't it time that we take back our stories? Isn't it time that, as you know, people who care about the most important things stop only complaining about culture or commenting on culture, but start making culture ourselves? And that is why I've spent the last few years trying to retell the fairy tales in the most beautiful way possible. And right now we have put out our third book, which is Rapunzel, beautifully illustrated by Heather Pollington. It is in some ways the story itself. But in that story, you're going to start to see how this series of fairy tales we're putting out called Tales for Once and Ever is going to bring the fairy tales together in ways that you never could have imagined. And so go to rapunzelbook.com and you can get your book today. It will ship in a few days and you will have it very soon. And so I think that that's why this, this movie is def. Is playing into this weird, this weird kind of self esteem aesthetic that we've seen. And this, this self esteem aesthetic. And what's good is that you can see how the self esteem aesthetic, this idea that my sins, I should be proud of my sins, that my shame is, is I should in some ways stop pretending and show the things that are shameful in a way that is in public. And that, that is almost like as if I'm proud of my, my shameful situation. But that is a serious mistake. And it leads to a lot of the chaos that we've seen, you know, and it leads to, it leads to pride stuff and it leads to all of that. And so. And so. Yeah. And so I hope that you, that this was helpful. I hope that it can help you kind of see what the, the story is about. Like I said, you know, it's interesting because I, I still like the movie. I mean, this is so pervasive in our culture. In some ways it was interesting because things have become so bad in our culture that simply having a movie where there are there girls and boys attracted to each other is so rare now that it's like, wow, okay, this is, this actually seems better than a lot of the slop that we've been, that we've been watching. And in some ways a movie that makes us understand the reality of, of the demonic and the reality of the relationship between our sins, our shame and you know, these intelligences and these voices that, that whisper in our ear and that kind of take our, our, our, our energy from us. Also the understanding of the relationship between spirits and attention and how, you know, the manifestation of spirits are related to worship, right? To what it is that we pay attention to and that is how those things manifest themselves in our life. All of that is actually quite interesting and something that I thought was quite, was pretty coherent. Of course, the only thing you could say in some ways there's only one mistake in the movie. It's a pretty central one, but there's only one mistake is that the, the, the idea of fans that give attention to celebrities is a parody of how we pay attention or how we give attention and how we follow or how we model ourselves on people that are above us in the true sense, right? Of course, saints, heroes, people that have done so much to, to build our world. And then ultimately, of course, God, who is above us and who is the source of all of us. In some ways, the error that we see in the movie of the manner in which the main character deals with her shame and her demons is one of the, one of the reasons why I struggle with Jung, with the psychologist Jung, because it is this notion of integrating the shadow, right? This notion of in some ways seeing that the shadow is part of you and embracing it to some extent and integrating it properly. And this is of course a serious mistake. It's a mistake. It's a very basic mistake because it's close to the real world. It's close to the idea, the Christian idea of being truly honest about the thoughts and sins and things that devour you, but then being humble about it, right? Then letting that humble you and letting that prevent you in some ways from being prideful and arrogant and thinking that you are completely in control and leading you to confession, leading you to transformation. But this is not at all the same as the idea of embracing your dark side and integrating it in the best possible way. That particular aesthetic is one of the reasons why we have this kind of self esteem problem that we've been led to in the 20th and 21st century. And so, so, yeah, so I hope this was helpful to help you understand the movie and why it's so, why it's making the rounds and why so many people are attracted and interested in it. And I'll talk to you very soon. Bye bye. If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase, so go to thesymbolicworld.com and thank you for your support."}
{"episode_id":"SW - #409 - 2025-09-20 - The Strange Symbolism of K-Pop Demon Hunters - Shame, Attention, LGBT, Jung","start":1633.27,"end":1696.65,"speaker":"Laura Diaz","text":"Tucson the Weight is Over mediweightloss. They're officially open on North Oracle Road. That's right, no more counting down the days. You can walk in right now and start your journey to a healthier you. Hey, it's Laura Diaz from iheartradio and you can trust me. This isn't just another weight loss clinic. I know that because it's where I lost weight safely with real medical support. GLP1 medications. You can see them everywhere online right now. But the truth is, your health shouldn't be a DIY project ordering these meds without the professional guidance. It can lead to dangerous mistakes, wrong doses, no oversight, and serious risks. At mediweightloss, I got the same medication, but with a customized plan, weekly check ins, and a licensed physician guiding me every step of the way. And the cost? The same as those risky online options. Tucson, your moment is here. If you're ready to take control, feel better, and lose weight the right way, mediweightloss is ready for you. Walk in, get started and see real results. Call or visit mediweightloss.com to learn more and book your free consultation today. That's mediweightloss.com if you're a custodial supervisor."}
{"episode_id":"SW - #409 - 2025-09-20 - The Strange Symbolism of K-Pop Demon Hunters - Shame, Attention, LGBT, Jung","start":1696.65,"end":1722.59,"speaker":"Announcer","text":"At a local high school, you know that cleanliness is key and that the best place to get cleaning supplies is from Grainger. Grainger helps you stay fully stocked on the products you trust, from paper towels and disinfectants to floor scrubbers. Plus, you can rely on Granger for easy reordering so you never run out of what you need. Call 1-800-granger. Click granger.com or just stop by Granger for the ones who get it done."}
