{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":12.56,"end":26.65,"speaker":"Jonathan Pageau","text":"This is Jonathan Peugeot. Welcome to the symbolic world. Doing good."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":26.65,"end":40.73,"speaker":"Paul Vander Klay","text":"Good to see you. It's great to see you. I'm nervous and anticipating disappointment that we won't get to meet in Thunder Bay in September. No words yet, but."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":40.89,"end":60.74,"speaker":"Jonathan Pageau","text":"No, I also don't think that it's going to be. Because the problem with Thunder Bay, too, is that it's far away from everybody. And so it means that in order for them to even make it happen, they probably will need people to travel. And so I don't. Yeah, I don't see it. I don't see it. It's frustrating, but."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":60.74,"end":75.46,"speaker":"Paul Vander Klay","text":"Yeah. Yeah. And what a year you've had. I saw your comments of, you know, Easter 20, 20, 19 flood, 2020 pandemic. Yeah."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":75.78,"end":77.54,"speaker":"Jonathan Pageau","text":"Local flood and global flood."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":82.67,"end":124.39,"speaker":"Paul Vander Klay","text":"And I just watched this morning, I just watched your Donkey Kong video and I thought it was. It was tremendous. It was tremendous. Jonathan, I don't. When people first told me about you and I watched some of your first videos, I'm like, what is this guy talking about? But you've seriously colonized parts of me that I can't talk to people. And some of your. Some of your ideas just haven't gotten so deep in my head that. So I owe you a tremendous debt of gratitude for everything that I've learned from you. And so I just want to say that."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":124.39,"end":173.21,"speaker":"Jonathan Pageau","text":"Well, thank you. That really. The Donkey Kong thing, it was really just because things have gotten so grim, you know, in the past few months, and. And understandably so. But I just felt like I just needed to do something that was extremely light and extremely. That was showing the pattern, but it was. Didn't have that many ramifications. And so people have been asking me to make a video game. Video game symbolism for years, and I've always refused because there is something about video games that I. Or video game culture, which I find not super productive. But I don't have anything against video games. Like, I play video games once in a while too. But anyway, so I finally gave in and I'm like, okay, I'm gonna make something that's just fun and light and, you know. Anyways."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":173.21,"end":180.89,"speaker":"Paul Vander Klay","text":"Well, I thought. I really enjoyed it because I'm old enough to remember when you had to go to an arcade or."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":180.97,"end":182.09,"speaker":"Jonathan Pageau","text":"Yeah. With the quarters."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":182.33,"end":205.82,"speaker":"Paul Vander Klay","text":"Yeah, yeah, yeah. I pumped a lot of quarters of machines at certain points in my life. What is your life looking like now for you? Spending a lot of time working on your stuff, making videos. I mean, because your life. I mean, what do. I wanted to talk to you today Is kind of a, you know, go back over the last few years. I mean, your life got turned upside down."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":206.3,"end":325.45,"speaker":"Jonathan Pageau","text":"Definitely. No, definitely. And, you know, last year was probably one of the most intense years, I guess, in my life. You know, I've had pretty intense years, but last year was really intense also, because I had all planned to do a lot of traveling, and I did, but I was also dealing with the flood and all of this. And actually, right now I feel like the lack of traveling is. Actually feels kind of nice. I'm realizing that it actually feels kind of nice to know, just like everybody, there's something about this pandemic, which there are a lot of negative aspects to it, for sure, but there's a positive aspect in the sense that it's forcing everybody to stop. And I think that it's acting almost like a little Sabbath or like a little jubilee. And so it's forcing people to stop. And so it can be positive because you have to kind of take some distance and see what's going on. You also end up spending. You know, I spend way more time with my kids, way more time with my family. And I'm loving that part of it. I just love it. So I hope we can take some of that into. Into the net, like, if. When it starts, when it starts again, I hope we can take some of that into the next iteration of our society. You know, they shut down the stores here on Sundays. All the stores. So all the. All the grocery stores are. All the grocery stores are closed on Sundays. And it's like. And they did it for purely secular reasons. But I've talked to a few people, just regular people that aren't even necessarily Christians. They said, oh, we love that the stores are closed on Sunday because we don't have the self discipline not to go to the store on Sundays. But if it's closed, then you don't go, and then you end up spending more time with your family. And it just happens. And so I was like, interesting."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":325.93,"end":467.88,"speaker":"Paul Vander Klay","text":"Well, I grew up in Patterson, New Jersey, and these Jersey blue laws, as they were called, you know, they lasted into the 60s and 70s when shopping malls were closed on Sundays. And this is the New York metropolitan area where, you know, one of the more secular places in the country, these laws endured on the East Coast. And then, of course, I grew up in the Christian Reformed Church, which was very Sabbatarian. So even if things were open, you didn't go, because that was your community didn't do these things on Sunday. And unfortunately, you know, in the 70s and 80s, the Christian Reformed Church sort of began to dismiss these things. And the theological justification for that was this is liberalism or this is, you know, this is legalism, that we're not swimming on Sunday or playing ball on Sunday or, you know, in our. In our house. We couldn't turn the TV on until after the second service on Sunday. That was kind of the break. And I wonder if this was some latent thing from my Jewish ancestors on my father's side. It was sundown on Sunday. After that, you could. It's kind of a weird mix, but I. You know, I think so. I've been. So. My wife is a schoolteacher, and before she was a public school teacher, we were homeschoolers. And so she kind of got cast into creating what essentially is homeschool material for her public school students because she had all this homeschool experience and wanted very much wanted her students in her classroom to be able. And the families to do some of that, most of whom don't really necessarily have a lot of interest in that because it's very demanding of the parents. But watching the disruption happen in people's lives, people are. I think we've had enough months of this lockdown where people. And the emerging is going to be slow, where people are going to have learned something and at least aspirationally are going to say, I want to take some of these new learnings and blessings into my future, but we'll see how long that lasts."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":467.88,"end":480.32,"speaker":"Jonathan Pageau","text":"We'll see how long that lasts. But how about you? How. I mean, what's life like for a pastor in a world where there's no church? I guess, like, where there's no physical meeting. How's it been?"}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":480.64,"end":530.6,"speaker":"Paul Vander Klay","text":"It's. It's. You know, it is important that this thing happened during Lent. And I Emotionally, this hit me a lot harder than I thought it would. Just losing the rhythm of being with the people. And so then, you know, I do these little videos now for church, for the members. The members of my church that can actually figure out how to get on YouTube. And I had to. One of my elders said, you're gonna have to cheer things up a little bit. I was like, I'm a little depressed myself. But especially when we then turned the page into Easter and the Easter and. Cause Easter is, of course, a season. It's not just a day."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":530.68,"end":532.6,"speaker":"Jonathan Pageau","text":"Yeah. Not just the day. Yeah. Until Ben."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":532.84,"end":572.4,"speaker":"Paul Vander Klay","text":"And so then I sort of had to lean into, even though we couldn't meet. And Jubilee is what I think about all the time. Cause I walk here to Church and I do this stuff in the building, the empty building where we have not had service since mid March. And I think it's a little non Protestant of me, but you know, the sanctuary is getting a Sabbath rest and it's getting a jubilee in a sense where it'll be put to work again soon. But it's fallow right now and there's. That's not altogether a bad thing."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":572.9,"end":622.63,"speaker":"Jonathan Pageau","text":"Yeah. And you can see what, like you can see kind of what the purpose of these little deaths are because you realize that, well, we actually have to restart because things have broken down now. We have to restart. And so for people who are keen, it's actually an opportunity to fix a bunch of stuff. Yeah, right. It's an opportunity to start on the right foot, as we say, to start on the, in on the right path. But you can't. It's hard to do that unless there's a breakdown. You know, when things are. When the gears are turning and the wheel, the machine is running, it's really difficult to change things because there's almost a logic, there's a pattern that's running its course and you know, it's very difficult to stop it. But when these kind of things happen, then, you know, if you're attentive, it's an opportunity to make some changes, you know."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":622.63,"end":705.54,"speaker":"Paul Vander Klay","text":"And Jonathan, one of the things that I think I have to again continue to credit you with is it was probably a gap in my Protestantism and I think, you know, Charles Taylor brings this out in his work. A secular age Protestantism tends definitely towards the instrumental, towards the agentic, towards the driving. You know, part of what happens in going from, let's say two speed, where you have the holy persons and then the laity, to the one speed, when John Calvin wants to make all of Geneva, in a sense, the city of God. One of the things that you, I think, have really helped me with is showing again, you have the center and you have the periphery. And in God's creation they both have their place. And I was, I watched also this morning, I watched, you know, the little clip that your people. I think it's absolutely perfect that it's your people who are selecting the clips, because people sometimes, oh, Paul, your videos are so terribly long. Why don't you just do clips? I don't know what clips are actually the good ones."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":705.54,"end":718.64,"speaker":"Jonathan Pageau","text":"Yeah, exactly. I do feel very fortunate because I can see what people pick out of The Q&As and what people pick out of the videos that they find interesting. And so I'm like, okay, yeah, interesting, interesting."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":718.72,"end":724.96,"speaker":"Paul Vander Klay","text":"Well, and I saw your. The little clip on Lilith and I'm a Protestant. You know, we don't read those old."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":724.96,"end":727.52,"speaker":"Jonathan Pageau","text":"Let's talk about that stuff, especially not Lilith."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":727.68,"end":749.05,"speaker":"Paul Vander Klay","text":"Yeah, but you've, I think, shown very well kind of the place in the created order of. For these different elements that sort of get pushed out of the way in the agentic Protestant mind. And, you know, you've really helped me with that."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":749.61,"end":761.25,"speaker":"Jonathan Pageau","text":"Well, yeah, thanks, I appreciate it. And how have you been? Have you been still doing videos every day? Is that. Because I see once in a while. But are you still have the same rhythm?"}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":761.25,"end":766.21,"speaker":"Paul Vander Klay","text":"Yeah, I do videos six days a week. On the seventh, you have to go to the church channel for the video."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":767.33,"end":767.97,"speaker":"Jonathan Pageau","text":"Amazing."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":769.89,"end":785.09,"speaker":"Paul Vander Klay","text":"It's, you know, it's become part of my rhythm. And I, you know, I often feel. I often feel like a bad YouTuber because when I watch your videos, I think, boy, Jonathan knows what he's doing and Jonathan's doing it the right way."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":785.89,"end":786.45,"speaker":"Jonathan Pageau","text":"And I."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":787.17,"end":806.76,"speaker":"Paul Vander Klay","text":"But I just kind of use it for what I use it for, which is I found that it's a good way to engage in conversations and to try out ideas with a really far broader audience than little living stones, most of whom I'll say things, and they look at me like, what are you talking about?"}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":806.76,"end":944.58,"speaker":"Jonathan Pageau","text":"What are you even talking about? But I think you're doing. I think it's just you style. I think you. You're doing more like a Joe Rogan type discussion, you know, this constant discussion. And it has a great advantage. Like I sometimes now I feel like I'm kind of out of the discussion. Like I've kind of moved out of the discussion just because I've been busy. I've been doing all these different things and so I'm not following the flow. Whereas you're right in there. I'm seeing you're doing videos about, you know, about the Portal and like John Verveck and all the stuff that's going on. And it's actually been seeing that you're doing videos, that you're doing videos about that kind of stuff now. Like, I've contacted a few people. Like, I'm gonna do. I wanna do a discussion go on that. You know that group, the Stoa, that Jordan Peters. Yeah. So I'm gonna try to participate in that. So, like, no, I need to get back into a conversation. I can't just be the guy talking or else I'm gonna start talking in circles. So I really appreciate this ongoing conversation. I need to actually need to be more part of it. But I have kind of pulled away a little bit, especially from the whole dark web, like intellectual dark web thing. I never completely identified with that name from the beginning. And, and so I've also, since Jordan has kind of moved out of it, I've also moved. I think I feel like I pulled out more just because the things they're talking about, I don't, I don't think they, I don't think a lot of the people like the Weinstein's, I don't think they really understand the stakes of what interests me. So because of that I just, it feels like there's no conversation to be had with John though. John Vervaeke, I think he totally gets it. I think like I wish that, I wish John could talk to someone like the Weinstein's because I think that, that he could have a really good discussion with them. But for me, I just feel like the stakes, I just don't, I'm not communicating the stakes of what I'm talking about in a way that for a certain type of atheist is not, it's not clicking. Like they don't know what I'm talking about. Like, for example, like rationality rule, you kind of engage him. I'm like, I'm not engaging that person. I mean, I don't think he even knows what I'm talking about. Like, I think that he would listen to my videos and think it's just gibberish, non stop gibberish."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":946.66,"end":968.73,"speaker":"Paul Vander Klay","text":"That's probably true. But I'll tell you, I mean we're all sort of, and I see this as just part of the economy of the kingdom of God, that here in his body he has many members. And the hand and the ear and the eye and the nose, they're not all the same. And in fact it's God's good purpose that they're not."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":968.89,"end":969.29,"speaker":"Jonathan Pageau","text":"But."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":971.05,"end":1010.24,"speaker":"Paul Vander Klay","text":"I see the tremendous impact of your work on, on people that I'm talking to. And what you have done is, I think in a deep way really. And I think this, you know, I think this is part of your mission and the mission that you've intentionally embraced too. You have really helped to rewire people to see and understand and engage at levels that very little in modernity would afford them to."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":1011.52,"end":1012.88,"speaker":"Jonathan Pageau","text":"Well, thanks, I appreciate it."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":1013.44,"end":1041.71,"speaker":"Paul Vander Klay","text":"I think that's vitally important, especially as we are in a period where, I mean these things take a long time to work through chronologically in history. But we are the intensification of the breaking down of modernity this is. I mean, it's happening quicker than we think. And something like a pandemic, well, it kind of works on both ends of it, but it speeds up the process."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":1042.27,"end":1102.49,"speaker":"Jonathan Pageau","text":"Oh, for sure. And it's opening up spaces that we thought were impossible. You know, I was talking to a friend of mine today who's not at all a Christian, just regular liberal, you know, North American. And he sees, and he's not even conservative, like he's left leaning, but he says, I never thought that I would see the government reach so much in my life. He said, I didn't think it was possible. I didn't think it was possible for the government to reach so deep in our private lives. And he said, all of a sudden, within a few weeks, we have people denouncing their neighbors, calling the police. And you thought, wow, this is crazy. How can things change so fast? Yeah, it's accelerating. And this 2020 election for you guys is going to be another major marker. It's not gonna get any easier."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":1103.37,"end":1129.46,"speaker":"Paul Vander Klay","text":"But look at the pause that, again, the pandemic has given us. Trump can't go out and, you know, fill a, fill a stadium with cheering fans. Biden can't go out and press the flesh. In a sense, we have two people that are probably going to be running. Can't believe you said that. That's the flesh."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":1129.46,"end":1130.34,"speaker":"Jonathan Pageau","text":"Yeah, exactly."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":1130.5,"end":1164.59,"speaker":"Paul Vander Klay","text":"Anyways, anyway, so I frankly look at, I look at what a feeding frenzy 2016 was. And I just, I mean, 2020 would have been another layer up, but this pandemic is in that aspect, perhaps part of the grace of God to say, we're gonna put a blanket on this sucker because, you know, the world doesn't need. The world doesn't need. And Canada doesn't need the United States flying apart anytime soon."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":1166.03,"end":1265.44,"speaker":"Jonathan Pageau","text":"Yeah, well, we'll see. Because it's not. It's gonna ramp up near the election because people are gonna, because they're gonna get desperate, the candidates are gonna get desperate to try to get the attention. Because now that, like you said, the attention is not on the election at all, but it's kind of there, seething in the background, and it's motivating, actually, a lot of moves in terms of media. The way the media is framing things is framed. It's a lot of it is based on the upcoming election, but it's, it's gonna ramp up. We'll see. I hope it doesn't like here. There's no discussion like here. It's all Justin Trudeau globalism. It's wild like how much everybody just agrees with what's going on here in Quebec. I think it's gonna be in Quebec. I think French Canadians have a weird. They're kind of sheep. We're kind of like sheep. We kind of follow. We all kind of all just follow in one direction. But there's also, there's also like a low level resistance. And I think I'm starting to see it right now. You know, like everybody's like, yeah, yeah, shut down, shut down. But then everybody's outside and you know, and now even this weekend, I saw a few restaurants that were kind of, we had the door open and they had, they had tables outside. And I was like, okay, everybody's kind of pushing. Everybody's pushing. And I think it's. People are just gonna start just doing their own thing. At some point it's gonna happen. That's mostly. It's probably gonna happen more like that than coming from a top down decree. People are just gonna say, okay, you know what? This is not. We're just tired and we're just gonna, we just need to see people."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":1265.76,"end":1491.54,"speaker":"Paul Vander Klay","text":"Yeah. And that's what's happening in California right now. The governor had laid down, well, these are the things. And then some of the counties sort of broke. And then the governor very quickly realized he didn't really have the power and didn't want to. So he kind of readjusted the criteria so more counties could be in. And it sits. You know, there's a Spanish saying, la carga se heregla en el camino, which is that the load adjusts itself on the road. And that's exactly what's happening right now. But, you know, I really wanted to talk to you because I wanted to talk to you about what you and I have been doing over the last two and a half years. And because your channel started a little ahead of mine and I think it fits into. I mean, it's interesting now that we have this pandemic that that's happening now, but before I got my undergrad degree in history, and so I've always sort of got a historical mindset to me. And so before too much history goes by, I at least wanted to do some talking and documenting about what I call the Jordan, at least wave, one of Jordan's wave. In terms of. In Canada it was C16. In the United States, it was the Trump election. C16 was sort of October 2016. Of course, Donald Trump was elected in November 2016. And then of course, Jordan, you know, there's no way to separate it from Jordan. And now you're a personal friend of his, so you have to be more careful than I do. But what happened? Jordan had been talking about this stuff for a very long time, and that evidence is out on YouTube. And of course, you caught wind of him early, before he took his status rocket ride, and you could just send him an email and he could respond to you and, oh, wow, here's this artist who's doing stuff, and you develop a relationship with him. But that moment that just like you said things, what caught my attention in this was that Jordan, in the Jordan Peterson wave, things happened I didn't anticipate seeing. Yeah. Conversations could be had that I couldn't have before. Yep. And I, you know, I was. I was fortunate enough, if a Protestant, if a cat. If a Calvinist can use that word, to have sort of been at the right time and gathered around me, additional conversation partners. And for me, that's been the real takeaway from this thing. But I wanted to talk to you about this before this history gets too old behind us and start with some of. Because, of course, you had already started building a relationship with Jordan, and then, whoosh. And then, of course, you start a YouTube channel, and, well, you're an artist, and you, you know, we've talked about your life before this. Now suddenly you're an artist who also makes videos. And of course, there's been a flood and a pandemic and all of that. So what now, thinking back two, three, four years on this, what comes to the top of your mental salience hierarchy?"}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":1496.1,"end":1755.1,"speaker":"Jonathan Pageau","text":"I think that one of the things we're seeing is, as we watch, kind of the breakdown of the west, let's say, could say it that way, the breakdown of what has held the west together. And we see the breakdown of Christianity. The surprising thing about a breakdown is that it also affords opportunities. And I think that that's something that the people who had wanted, let's say, religion to go away didn't realize. You know, as narratives break down, there's also spaces that open. And those open spaces are the reason why all of a sudden, conversations that we didn't think were possible are happening. You know, because there's more connect. There's more connectivity. There's more like lateral connectivity. You could say it that way. And I think that. So I think that it's actually a very exciting time because there's a possibility for. There's really a possibility for a flip. And I think that that's really what Jordan did, is he flipped the discourse. He turned it and what he did, I mean, it was already kind of preparing. There were people who were kind of talking about it. And it's not like he came out completely out of the blue with his idea, but there's something about him, about his personality, about the way that he was also kind of like a father figure. There's all these things that kind of came together and the fact also that he resisted. He talks about. Jordan talked about this quite a few times where he said he took it out of the abstract and chose a place, right? Said this thing here is where I'm not going to move. And that's what the bill. The C16 thing was. And he's often said that it was near arbitrary in the sense that there are other things happened before that were in the same vein and other things have happened since. But it's like he said, this one is the one. I guess I'm gonna stay. No, like I'm stopping here. And so there's something about that where he kind of flipped the discourse in terms of religion, let's say, because he did it in a lot of things. But in terms of religion, he. He brought the. He brings the inner, the. The evolutionary thinking to its inevitable conclusion. And the inevitable conclusion is, you know, that thing that this is. You know, that thing that you marginalized all this time, this religion thing, you marginalized it. Well, if you. If you're in the. If you're in the evolution mindset, it has to participate in the pattern. And this is the same thing with consciousness. It's the whole problem of consciousness, too. It's like people just stood in consciousness and were describing the world, and then you come to the end where it's like the last thing to analyze is the thing you've been not talking about. And then when it turns back on itself, then it creates this weird flip. And that's what I think Jordan did. A lot of the things that. I think the most powerful things that he talked about were the things that lead into the notion of attention and the relevance realization that now John has been kind of taking up. I think that that's the most powerful thing that Jordan brought to the floor in terms of shattering the categories that people have been using and forcing the scientific mind to think, to see differently. And I think no one has gotten over that yet. People are still processing that. But in a way, it's the moment he's gone, in a way, because now, at least for now, because Jordan has kind of. He's vanished. And the effect of Jordan vanishing has been Huge. It's been huge in the sense that I know that it's part of why my views have gone down. I know that it's part of why the discussions have slowed down, why there's less of this interconnectivity. You know, it's as if without him there is no intellectual dark web, really."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":1755.1,"end":1756.1,"speaker":"Paul Vander Klay","text":"Yeah, yeah, right."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":1756.1,"end":1771.23,"speaker":"Jonathan Pageau","text":"There's just Ben Shapiro and the Weinsteins and they can kind of talk to each other, but they don't. There isn't this problem that's there. This kind of weird thing that we have to solve that Jordan was kind of bringing to the table somehow."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":1771.63,"end":1801.51,"speaker":"Paul Vander Klay","text":"Well, I like how the way you put it because he sort of brought. They connected via him. And without him right there, the Weinstein sort of go back to the things they talk about and Ben Shapiro does his stuff on politics and you know, and of course, why would Ben Shapiro and the Weinstein's over. Why would these two talk if Jordan doesn't sort of connect them? Why did you."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":1801.51,"end":1803.87,"speaker":"Jonathan Pageau","text":"Very few, little few reasons. Yeah."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":1803.87,"end":1805.95,"speaker":"Paul Vander Klay","text":"Why. Why did you start doing YouTubes?"}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":1807.71,"end":1862.51,"speaker":"Jonathan Pageau","text":"I started because of Jordan. I mean, I. We did that video. We did a video. We did the two videos. One was called Tradition and Things that Don't Fit and then the Metaphysics of Pepe. And then what happened is I got invited to do an event with him in Toronto. And so I, I did that event and he put that up and he put up those other videos. And so it was like I had a few. I appeared on his channel a few times and people started writing me and I started getting flooded with emails of people saying, could you interpret this like this, this symbolism of this and symbolism that. And I realized, okay, well, I can't. I'm not gonna answer all these emails. So I have to. I kind of have to. I guess I have to do something. And since it was, it was happening on YouTube, I figured then I'll make YouTube videos. It was really as silly as that."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":1864.35,"end":1906.33,"speaker":"Paul Vander Klay","text":"It's. It's interesting to me how you and your brother, you know. Cause your brother's, you're, you know, with his book. I mean, he's very much a part of this story even though he's not on your channel. And I also, you know, when earlier we talked about the fact that you've sort of taken a step back because, you know, I wrestle with this as a pastor, you know. Yeah, I put out a lot of videos and I do a lot of conversation, but in some ways, and I think this is true of John Vervaeke too. In some ways, sort of the space that a pastor holds is different from the space that an icon carver holds."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":1906.41,"end":1906.89,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":1906.97,"end":1929.77,"speaker":"Paul Vander Klay","text":"Because an icon carver, in a sense. In a sense, I would imagine. And please correct me if I'm wrong. In a sense, I would imagine you're sort of an artistic monk. That's sort of your vocation. Yeah. And a YouTube, you know, a YouTube celebrity. I remember you talking about your kid describing you. My father makes YouTube videos."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":1929.77,"end":1931.69,"speaker":"Jonathan Pageau","text":"YouTuber. My dad's a YouTuber."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":1931.77,"end":1933.13,"speaker":"Paul Vander Klay","text":"I've been reduced to that."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":1933.75,"end":1935.59,"speaker":"Jonathan Pageau","text":"That's a nice joke in my family."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":1935.67,"end":1949.27,"speaker":"Paul Vander Klay","text":"Yeah. And again, I think here, too, in this way, Jordan's absence sort of means the circuit isn't running like it was."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":1950.55,"end":2075.44,"speaker":"Jonathan Pageau","text":"It's not necessarily bad. There are some positive aspects to that. You know, it's like different waves. And so right now, what I've been doing, I would say in the past, since. I guess it actually is since Jordan kind of vanished, I've been consolidating the things that I've been given to me. You could say it that way. And so I've been focusing a lot more on getting the conversation to run within the people that have been following my videos. And now we just started a blog where people that have been watching my videos for a few years that are on this Facebook group that discusses the symbolism and have read my brother's book now I've kind of. J.P. you met J.P. marceau, who. So he's editing the blog, and people can submit articles that are doing symbolic interpretation or they talk about symbolism for the blog. And so that has been. I put a lot of emphasis on that in the past few months, kind of getting that started. I don't think there's going to be a massive public for it, but I think that it's going to be a good training ground for a lot of people, and it'll be a resource for those who want to go further into symbolism. And so that's kind of been my. That's been my focus in the past few months, has been to try to make this into a team effort so that it's not just me talking about symbolism, but that there's. There's a few dozen people that really understand what I'm talking about and can understand some facets of it that I don't and can use the lens of symbolism to look at things that I don't have the energy or the interest to look at. And so that's been exciting to put together, and I'm looking forward to already the article that had been Going up. We've been live for about two weeks or three weeks maybe. And the articles that have been going up have been great. Just wonderful. Really, really good stuff."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":2075.76,"end":2106.33,"speaker":"Paul Vander Klay","text":"So, you know, it's. I, this, this last weekend I used, you probably know the YouTube channel, like stories of old. Yeah, it's. It's a movie interpretation channel. A Dutchman, Another Dutchman. And you know, when I was working on, when I was working on, done a couple of videos, is going to do a third one in this series about story versus reality. And of course, that immediately caught my attention and you know, they did a."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":2106.33,"end":2108.05,"speaker":"Jonathan Pageau","text":"Video on story versus reality."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":2108.05,"end":2263.21,"speaker":"Paul Vander Klay","text":"He's got a series, he's got two out and the third one is coming. Very, very interesting. And as a preacher, I just kind of jumped on it right away. And because it sort of fit in, I've been working through First Peter in during the Easter season and what was. What. What. You know, one of the things that. And I think about this a lot actually, with your work, where there's a. There's a. There's an interesting tension involved in both being the artist and the explainer. Yeah. Because in a sense, you, your videos are about bringing up to consciousness that which is already forming and shaping and molding beneath. Now there's a prophetic mode in that of, you know, oh, my people, you are absorbing the worship of BAAL and you don't even know it. And so allow me to bring up to your conscious, you know, that the part of you that is conscious, the formation that is happening beneath the surface. And of course, for all of us, we have a certain. We have the pleasure of insight, the emotional, psychological pleasure of insight in that process, which I think is part of the joy I have in watching you take an arcade game. And once you say it, it's, oh, gosh, this is the most. This is the most obvious thing in the world. I never, you know, I never recognized how this ties into the rest of creation. But just in the first few minutes, it's like, you know, why was I too dumb to see? But then there's this other moment of realizing that, oh my, I have been deeply formed. And the, the little conscious self of me that managing manages these things is in very many ways weak, helpless, has been subject to programming far beyond. And now Jonathan Pageau comes up and makes me think differently about masculine and feminine, right hand, left hand, center and periphery. But yet, as an artist, in a sense, you're both the, the former as the artist, in some ways, you're like the magician who goes on YouTube and."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":2263.21,"end":2264.61,"speaker":"Jonathan Pageau","text":"Shows how the tricks work."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":2264.69,"end":2265.49,"speaker":"Paul Vander Klay","text":"Exactly."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":2267.57,"end":2464.65,"speaker":"Jonathan Pageau","text":"The only reason why you have to do that is because there's been a lot of really evil magicians in the past few generic generations who had a few really bad wizards that have been distorting reality and using. One of the problems that we've had in the past few centuries is that a lot of Christians took the science pill. Like, they just took it completely, and they went down the critical, historical, scientific path. And those that took up the storytelling mode and who intuitively understood the patterns were those that really just wanted to destroy Christianity. And so you have. And so all the people who are really good at storytelling were those that were using these symbolic patterns to undermine the Christian narrative. And Christians were too busy answering with this or that, like, statue that or bowl that they found in the sand in Palestine, you know, and they. They lost the story. And. And you can see. Because who are the Christians right now? Like, it's all. It's all. It's CS Lewis and Tolkien, right? It's like, that's our only. Is that it? Like, that's our only two storytellers. It's. It's those two. In the whole 20th century, we've got those two. Whereas the, you know, people, those that want to. Have been. Wanting to undermine, have every other story. And so maybe not every other story, but a huge amount of the storytelling. And so it feels like one of the things that I want to do is I want to give back the power of storytelling to the people who could do it. Cause the thing is that the Tolkien story is more powerful. It's one of the most powerful stories that has been told in the 20th century, bar none. Like, not even Christian or not, it's one of the most influential stories that has surfaced in the past few hundred years. And it's because it has totally infiltrated culture in a way that people don't even realize it. All your video games have Tolkien behind them. So much of your science fiction, all the world building that you see in science fiction, that you see in fantasy stories, it's all token. He's the one who. Who gave you that. And so that's how powerful. If you tell the right story, that's how powerful it is, right? The right story. Taking a story, let's say, like a Disney story that's somewhat twisted, like a Moana or whatever, there's enough of it for it to be true, but there's enough of it for it to be twisted. But if you were able to take it and just give it back, in its pristine form, then it's gonna win because it's truer. And so that's what I would say. Like, one of my main goals has been to give. To give back to Christians or to people who don't want to undermine everything, to give them back the pattern so that they can use them. Because it's not enough to interpret these movies. I mean, this is really, hopefully, it's just groundwork for people then to be able to tell better stories."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":2466.05,"end":2486.69,"speaker":"Paul Vander Klay","text":"You know, it strikes me again as I was watching, like, stories of old, as I was watching him basically deconstruct, as I was watching him deconstruct, I just had the sense that effort will always fail."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":2487.97,"end":2494.06,"speaker":"Jonathan Pageau","text":"And so that's what he was doing. He was saying, reality is what, like, meaningless and just random?"}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":2494.14,"end":2537.87,"speaker":"Paul Vander Klay","text":"Well, he's saying, well, here. So story. Well, he was, in a sense, saying, well, here's the trick of story. You know, the end. And therefore, you selectively construct the bits. And that's how psychologically you create story. That's unlike reality. Of course, I thought, okay, tell me what reality is. Well, he doesn't say it out loud, but the assumption is, well, reality is just one random, chaotic, purposeless event after another. That's what reality is. And so now we have these stories. And so I'm waiting on his third episode where I suspect he will make the move that the freedom from religion people make every time they put up a bullboard in Sacramento, which is say, I can bring the meaning myself. And I think, oh, yeah, yeah, yeah, yeah."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":2537.87,"end":2583.61,"speaker":"Jonathan Pageau","text":"Oh, I definitely have to watch the video because that's. That's hilarious. It's so funny because let's think of a very short story. In terms of human interaction, all your actions are based on an end. There's no action that you make any. Every action in the world is based on an end. Now, whether or not the end resolves itself one way or the other, that's a different story. Because there are stories that don't end well, even in a movie, but the purpose is there. So we always act for ends. There's no action without an end. So it's just funny to think that it's like, you know the end. Well, when I'm pouring a glass of juice from the fridge, I also know the end. Like, that's why I'm doing it, or else I wouldn't do it if I didn't know what the end was."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":2585.29,"end":2641.91,"speaker":"Paul Vander Klay","text":"Well, and I think I just finished a very interesting conversation with Brett Sokold. Brett is the author. He's a Roman Catholic from Regina, Saskatchewan, who's the theologian for the diocese and Regina. And he wrote this, what to me was a tremendous book on transubstantiation and where basically I think in many ways he began helping Protestants, Lutherans, Calvinists and Catholics understand each other by showing some of the ways that Lutheran and Calvin were trying to recapture Aquinas and didn't understand what they were doing. It's a fascinating book. And how did I get at him? Well, these ends because we were talking about conspiracy theories. Oh, yeah."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":2641.91,"end":2642.39,"speaker":"Jonathan Pageau","text":"Okay."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":2643.35,"end":2706.21,"speaker":"Paul Vander Klay","text":"And again, I think some of your work on this has been really tremendous and has deeply influenced me. And you know, Mary Cohen has been really helpful for me too. She's Roman Catholic, she listens to all of us and she does her own little commentaries. But you know, how you lay these things out. And so here, like stories of old, I think it's basically going to say he's going to make the move. Well, this is such telling language. We don't really have purpose because this is of course, what Sam Harris says about us. When you're pouring the glass of orange juice, there's no such thing as purpose. It only looks like purpose, you know, and you experience that as purpose. So what the Freedom from Religion foundation says is that, well, we can enjoy the experience of purpose and we can live as if there's purpose, but there really isn't any. And it's like, what are you talking about?"}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":2706.21,"end":2707.17,"speaker":"Jonathan Pageau","text":"I don't know what you're talking about."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":2707.17,"end":2709.65,"speaker":"Paul Vander Klay","text":"Why are you working so hard on this?"}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":2711.37,"end":2711.61,"speaker":"Jonathan Pageau","text":"Why?"}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":2712.65,"end":2741.44,"speaker":"Paul Vander Klay","text":"And in fact, because you can't tell the story that there is no purpose unless you use all of the tools of purpose to tell the story. And in that sense, the tools themselves betray the purpose for which they were given. And no matter how much you use that hammer to deconstruct, the hammer is more real than the pile of rubble you leave on the floor."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":2741.44,"end":2764,"speaker":"Jonathan Pageau","text":"That's right, yeah. That every, every move you use to tell me that there's no purpose is based on is you're using all your purpose driven mechanisms to tell me that there's no purpose. Like what exactly is your purpose in telling me there's no purpose? Because you've got to have one. You definitely have one. It's a very dark, cynical purpose that you've got in trying to do that."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":2766.25,"end":2850.23,"speaker":"Paul Vander Klay","text":"And so, you know, when I was, you know, so I first started, you know, I made just a Pastor looks at Jordan Peterson. And then of course, people started coming to me, which was an unusual experience for me in Ministry because they usually have people avoiding me. And so people start coming to me and they start telling me. And of course we never, we seldom quite know what's really going on. We just experience things and make up reasons that sort of seem to fit and maybe our 20%. Right. And then I'm talking to all of these people and realizing a good percentage of the people I'm talking to were depressed. And then they tell me, I watched hours of Jordan's video and I'm not depressed anymore. And what's more, I kind of think I want to go to church. I don't know why. And then the crazy thing, especially as a Protestant, not necessarily making Protestants terribly happy, I'll talk to you because you're easier to find and talk to than Jordan. But what I really want to do is be orthodox. And as a Protestant, I sit here and I think you'd better count the cost of this endeavor, my friend. Because the orthodox don't just let anybody saunter in on one Sunday and say, I believe, Walk down, get baptized, and now you're it."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":2851.2,"end":2854.32,"speaker":"Jonathan Pageau","text":"Yeah, usually it takes a year before they baptize you, that's for sure."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":2855.6,"end":2897.89,"speaker":"Paul Vander Klay","text":"So again, I mean, my entire video project, at least the part that connects with Jordan has been to try to figure out what he's doing. And I'm not always so sure. None of us ever know all that we're doing. But sometimes I watch Jordan and I think, I wonder if he knows all the levels he's working on because we can see them by the effects. And that's exactly why I don't want to do little clips of me, because we who are even doing the work only know the effects by watching what comes back to us."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":2900.53,"end":2998.48,"speaker":"Jonathan Pageau","text":"Yeah, I mean, I agree. I think he's probably, he might be more aware than what you think, though. He's actually, I think he's quite aware. He's also aware. He's even aware at the level in which he speaks. Because I even one time I had a conversation with him and I won't say who I was criticizing, but I was kind of commenting on someone, a YouTube, someone on YouTube. And I said, you know, I don't think he's very. That he's that smart, that person. And Jordan said, yeah, but he's a stand in for like the common person. And he was like, I want. That's where, that's who I want to talk to. Like, I don't want to talk. Because a lot of people have criticized Jordan because his stuff isn't formulated in Complicated technical words and all of this, and it sounds very everyday. And it's because that's what he wanted to do. He really did want to connect right to the people and be able to speak at different levels. But if he's Talking to Ian McGilchrist, he's able to read, go up and talk about. About that stuff too. But he doesn't feel. He doesn't feel like he has to prove to people that he's smart, you know, and use complicated words all the time to kind of. To kind of show people that he's smart. And so I think that he. I think he's more aware than we think sometimes of what he's trying to accomplish and, like, trying to gather the levels together to have this, like, weird effect. Now, he probably also knows that he was playing a kind of father, a dad figure as well. Like, he's sure he understood that, but it's hard because we, again, he doesn't. It's hard to have access to him."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":2998.48,"end":3003.2,"speaker":"Paul Vander Klay","text":"And now, you know, oh, I mean, people, you should be left alone."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":3003.52,"end":3004.16,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":3004.56,"end":3093.92,"speaker":"Paul Vander Klay","text":"You know, when I, it was so funny because I, you know, I saw he was coming through California and I thought, okay, you're in Oregon and then you're gonna be in Sacramento, then you're gonna be in the Bay Area, then you're gonna be in Southern California. Oh, and he's on Rogan when he's doing that. I'm just kind of looking between the lines and I'm thinking, yo, dude, a schedule like this, as a pastor, if you were in my church, I wouldn't recommend it. There's a lot that goes into that in terms of the churn and the people and all of that, you know. And as you know, I shouldn't say I didn't ask for it, but I guess when I made a video, I asked for it. So part of what, so part of what I've done, people sometimes ask me what I do and I say, well, I'm a pastor. I'm just sort of pastoring in a different way right now. And so I, you know, with the Discord server and with the conversations, a lot of it is. And that the meetups, which we can't do right now, a lot of it is, to me, the focus is on the community that I leave behind me and the power of that community. And so obviously I just pastor a tiny little segment of this community."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":3096.96,"end":3143.46,"speaker":"Jonathan Pageau","text":"I think that's great. I think in a way, with kind of these Discord discussions and everything, I think that's probably the best thing to do right now. Like, I talked about the idea of consolidating what's happened in a way and trying to now gather up the pieces of things that have been transformed and try to make them more solid, just more coherent. So I think that's great if you've got this discord discussion and you've got people talking to each other and everything kind of an extension of the meetups, because it's hard. You can't do meetups with everybody. But to have a discord. Discord discussion is. Can create something of that, you know, continual discussion."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":3143.54,"end":3214.9,"speaker":"Paul Vander Klay","text":"Well, and to me, the, you know, I look for people's motivation not just to, let's say, have a little conversation, whether it's by text or voice chat or even Zoom, but their desire to begin to build something. And so it was members of my local meetup who built the Bridges of Meaning Discord server. And they kind of coalesced around a bunch of people that I had zoom conversations with and posted on the channel. And it's sort of built since there and sort of, that sort of becomes an estuary for me if people want to talk to me. Well, even, it's even hard to get a rando slot right now because I only have certain number each week. But I want to keep them open because this is some of what you've taught me too. And Jordan, there's a real value in leaving a space for that which I won't filter into my life. And it can't be everything, but you can't have none. There needs to be a space because in through that space comes, you know."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":3214.9,"end":3220.1,"speaker":"Jonathan Pageau","text":"Yeah. Surprise comes all kinds of things that you hadn't thought about, things you hadn't considered. For sure."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":3220.1,"end":3254.13,"speaker":"Paul Vander Klay","text":"Yeah. So. So. Well, I guess two thoughts come to mind. Number one, you know, is there will. Gosh, is there going to be a second wave? And if so, what. I mean, Jordan Scott, we, you know, he had a couple tweets yesterday and I thought, yeah, he's, he's, you know, this is, this is some of this pattern is Jordan and you can kind of see what's publicity and what, you know, they're just putting out to keep the social media machines running. And then what comes out now there's some Jordan behind this and so possible."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":3254.21,"end":3256.21,"speaker":"Jonathan Pageau","text":"He'S working, mostly working on his book."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":3256.45,"end":3385.88,"speaker":"Paul Vander Klay","text":"Well, exactly. And so it's going to be very interesting to me because he. Okay, so we had C16, we had the election of Trump's at Trump and we had, you know, everything that we've had in clown world, we've had Joker. Now we had a pandemic. Now we're having a pandemic. And so, you know, a big part of that wave, Jordan's wave, was also, I mean, the man and the moment found each other. And I, you know, you're right. C16. The more I think about it was in so many ways exactly the right inflection point to hit something if you're going to create a wave. But the world that the sequel, and it'll be interesting to see to what degree it is a sequel. The world that the sequel comes into is a different, it's a different world for me. You know, as a pastor, you know, people come to me and okay, so you listen to Jordan and you got red pilled or bread pilled or any other pill. You want to conceive it as and you want to remake your life and you want to do things differently. And you're going to listen to Jonathan Peugeot, you're going to need to, there's going to need to be be patterns, habits, disciplines, institutions, community. If that shining moment of revelation that you experienced is going to bear any fruit at all, it's going to have to. And I really do. I put that comment on Twitter. But your video of the seeds, I thought if I had to show people someone who at least knew something, one video to say what Jonathan Pigeot, what I think his message is, boy, that video was, I thought, well, there's the seed of the Jonathan Pigeot plant."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":3385.88,"end":3388,"speaker":"Jonathan Pageau","text":"Well, I don't even know what video is this? I don't even know."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":3388.48,"end":3390.08,"speaker":"Paul Vander Klay","text":"The soils. The parable of the soils."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":3390.08,"end":3394.8,"speaker":"Jonathan Pageau","text":"Oh, the soil. Yeah. The parable of Christ as the sower. Yeah, that's right."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":3394.8,"end":3395.84,"speaker":"Paul Vander Klay","text":"That's right. Yeah."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":3395.84,"end":3443.34,"speaker":"Jonathan Pageau","text":"Oh, yeah, I think so. I think you're right that, that also because it has the meta pattern inside of it. It has like, it, it has a pattern as the meta pattern and it's Christian. Yeah, I, I, I don't, I'm curious to see like how I feel like this. Maybe I'm wrong, but I feel like there isn't gonna be like a second wave. I think there's gonna be something else. I mean, I think Jordan will have his place in discourse, like he'll have his place in the world. But I don't see his second book having as big an effect. And I don't see, unless there's another controversy, unless there's some controversy. I don't see, I don't see. I see."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":3443.34,"end":3449.34,"speaker":"Paul Vander Klay","text":"I think he'll Say something in that book, you know, it. That'll touch people, maybe."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":3449.34,"end":3527.8,"speaker":"Jonathan Pageau","text":"But I. It seems like there might be something else, like there might be another. I don't know what it's going to be because you never know what it is until it happens. I think we just have to be ready to take advantage of whatever flashpoint is there, which can create another level where can bring people to the next level or to create insight, the right type of insight that needs to happen. And that's why I talked about consolidating, because if you consolidate the people that you've been talking to, then, you know, for example, like, let's say you and myself, the reason why it sparked us, let's say, is because we. The soil was already prepared. It was stuff that we were already thinking about or that we already had something in our lives prepared to kind of. To take that and to move on, to move with it, you know, and so I think that maybe that's how I see it now. I think now is the time to plow the soil or to. To get people ready. People who have already were already in the discussion, already thinking you were already, you know, who have had some insights to. For the next. For the next moment where it's gonna jump again. But I don't know what that's gonna be. I have no idea."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":3527.88,"end":3528.84,"speaker":"Paul Vander Klay","text":"Yeah. Yeah."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":3528.84,"end":3580.41,"speaker":"Jonathan Pageau","text":"I mean, it could be, because anything can happen right now. I mean, people don't. When things start to accelerate in these weird, chaotic moments, it's. There is no telling what's going to happen. Because if you had known, if you could have known that, let's say, I don't know, maybe, what, six years ago I would have told you. Trump, Brexit, pandemic, and then Jordan Peterson and people who were hardcore atheists all of a sudden have stopped being so aggressive when they. They still hate religion, but they feel like they can't be as aggressive as they were. You know, even people like Sam Harris isn't as cocky as he was anymore."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":3580.49,"end":3581.01,"speaker":"Paul Vander Klay","text":"Yeah."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":3581.01,"end":3585.21,"speaker":"Jonathan Pageau","text":"And I don't think maybe he wouldn't even acknowledge it, but it's. That's what it seems like."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":3585.37,"end":3764.53,"speaker":"Paul Vander Klay","text":"Yeah. You know, this, this. So I've been reading Robert Putnam wrote Bowling Alone, and so Eric had Ross. No, he had J.D. vance on his podcast. And J.D. vance. Have you read Hillbilly Elegy? Okay. You know who J.D. vance is? Okay. And J.D. vance mentioned. I mean, it was just something very interesting to me. So J.D. vance writes about his grandmother. He grew up out in Appalachia, and his grandmother Was, you know, she believed in God, didn't go to church because the pastors were all, you know, hucksters and grifters. But she, you know, she believed in God and she trusted that God would make things right and so on and so forth. And so of course for Vance, that caught his interest. Now he eventually, I don't know if he's. I think he's in a Roman Catholic church now. I'm not sure. I mean every, you know, in terms of the big line. And I think you get this writer than most, you know, we're back to sacraments and we're back to icons and we're back to the imagination. That imagination. That's an interesting. Why did I say that word? We're back. We're. You know, I saw this, I saw this coming with Protestants. That seeker movement was sort of, you know, back to stripped out churches, smoke machines using, using proverbs to gain wisdom, to get a little bit of credibility, to sneak in the four spiritual laws and the sinner's prayer. And then I watched in the response to that everybody suddenly wanting, well, I want one of these old church buildings with architectural features and I want chanting. And we're gonna get a cantor. And these are Dutch Reformed churches doing this. And I'm watching this thinking, what's going on there? And so you're getting again. And you talked about this before I saw anybody else talking about it, kind of this inversion, this return. And then I drummed up Chesterton's the last chapter before the conclusion of the Everlasting Man. He talks about the seven deaths of Christianity. And you talk about, basically Chesterton says Christianity has many times died. And then it keeps coming around again. And I've heard you talk about this a number of times."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":3766.13,"end":3899.97,"speaker":"Jonathan Pageau","text":"It's a process. I kind of call it the double inversion. It's the. So a good example is that example that you said where the church decides that in order to reach out to the world, it has to be more like the world, right? It has to be more like the people you're reaching towards. And so it keeps. But in order to do that, it has to dilute itself. It has to dilute itself in order to reach out, you know, and it's a, it's a form of kenosis. You could see it that way if you want to. It's like an emptying of yourself to move out. But at some point there's a point where you reach a limit where it's like, if I go one step further, I'm not myself. Like, I'm. It's over. Like, there's nothing. And so the church, the evangelical church is like, oh, we could use advertising techniques. We could use. We can use movie making techniques, we could have dance, we can have this. We can have smoke machines, we can have rock bands. And then you get to the end where it's like, okay, you're still not as good as a rock band, you're still not as good as a dance troupe, you're still not as good as an advertising firm. But you've come all this way and so now you're at the edge and the only place to go is now. It's like, well, I actually forget where. I've forgotten where I've come from. And so the move to remember is a normal move. It's like just kind of happens on its own. I have to now remember what. Where I came from. It's almost. It's even. There's even something in that, in the idea of transgression itself, where you can only be a rebel if there's authority. And so rebellion ultimately ends up reinstating authority, necessarily because the rebellion makes no sense if authority breaks down. Right. And that's the whole idea of the clown too, where at the end, it's like the clown flips it back because it's like when you've made fun of everything and the whole world is a joke, then the only thing left to make fun of is the joke itself. You make fun of the joke and then it turns back and you come back to the king, you know, and."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":3899.97,"end":3920.13,"speaker":"Paul Vander Klay","text":"People play that out in their lives. I've often noted that in conservative Christian Reformed, when conservative Christian reformity still existed and still does in some rural places, it was the rebellious youth who became the authoritarians when they were."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":3921.01,"end":3921.97,"speaker":"Jonathan Pageau","text":"When they were older."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":3922.13,"end":3923.09,"speaker":"Paul Vander Klay","text":"When they were older."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":3923.09,"end":3923.57,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":3923.57,"end":3924.61,"speaker":"Paul Vander Klay","text":"And you just watch."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":3924.69,"end":3948.32,"speaker":"Jonathan Pageau","text":"I've seen that too. I've seen that happen too. Teenagers who are so rebellious and then they become pastors and they're like, that's how they are. They're like, they're most hardcore and that even you see that. People who convert to Islam, too, you see that too. A lot of people convert to Islam are people who are like completely out there. And then. And then I need something solid. Like, I want something solid now."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":3948.32,"end":3969.48,"speaker":"Paul Vander Klay","text":"Yeah, yeah. And they become hardcore because Islam gives them those. Those bright lines and the traditions and it's all there. Well, I've peppered you enough, Jonathan, and you've been, You've been gracious. Anything you wanted to bring into this conversation or Anything."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":3969.48,"end":3975.06,"speaker":"Jonathan Pageau","text":"So where, like, where do you feel you're at in terms. Because I've. Because you used to comment mostly what Jordan was doing."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":3975.22,"end":3975.66,"speaker":"Paul Vander Klay","text":"Yeah."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":3975.66,"end":3987.38,"speaker":"Jonathan Pageau","text":"And so now he's been gone for like, you know, for six, eight months, even more. And so what has been your driving force? Like, what has been. What has been the thing that keeps you discussing right now?"}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":3989.7,"end":4102.24,"speaker":"Paul Vander Klay","text":"Well, I've been. Jordan sort of. Well, when he, when he went on his book tour. So I've been. I read Ross Douthat's book on decadence, and I found that really helpful to try and get a sense of what's really happened in the culture since the 70s. You know, I watched the Joker movie and I felt like I was watching my growing up. And then I realized, yeah, he filmed that in Newark, New Jersey. I thought I was watching my growing up years. And so trying to get a. So Ross Douthit, Peter Thiel has had some interesting ideas about lack of progress. And so I've been trying to get a handle on. And again, increasingly lately, everything I think I'm looking for, I start finding in Chesterton. And as a Protestant who is very dismissive of Calvinists, that can be unnerving in some places because Chesterton made the point. Point in. I think it was the second chapter in his book entitled Heretics, that this world can't find the good, can only sort of find the good in terms of opposite of the negative, because they can only see the negative and they can't see the thing that the negative is moving against. They're only seeing things in its shadow. And so I've been doing a lot of thinking about the last, the last 60 years of history, the 60s to the 70s to the 80s to the 90s, and then now and how, okay, everybody wants to be progressive. What exactly are you progressing towards?"}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":4102.32,"end":4103.6,"speaker":"Jonathan Pageau","text":"Oh, yeah, my goodness."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":4104.16,"end":4288.83,"speaker":"Paul Vander Klay","text":"Because then I, you know, I'll hear, I'll watch the. And I think the pandemic has taken some of the wind out of the progressivist sales right now. Hard to know where that will actually go. But. Okay, so what exactly is your telos? What beyond the heat death of the universe, do you actually want? Yeah, and so that's. And so I've been, you know, I've been thinking a lot about that. And on one, and also continuing on my, my God number one and God number two, because thinking this is where, you know, I wind up with a bunch of Roman Catholics, which again, what do I do with that? With my Dutch Calvinism? No, I'm not converting all you people that have been cheering for that in the comment section. But what do we mean when we use this word, God? And again, your work has been tremendously helpful for me to understand that in some weird way, God is everywhere and nowhere and the whole earth is full of his glory, but the, you know, all of creation does not exhaust him by any means. And noting in, you know, it's been very interesting watching television shows like the Good Place and Upload, watching humanity's crisis of confidence that even if we had everything our way, we are finally a shallow cup that is too shallow to actually contain the desires that the universe that we desire. And that sort of backs me into CS Lewis's argument from desire that deep in our hearts we know we were made for more than even what our imaginations now cast on screens with zeros and ones that we think we can make anything in the virtual space. And then we discover, no, we're bumping into our own limitations again. And so that, to me, then leads back to the nihilistic despair of humanity that if we are finally the only. There's finally no agent above us or beyond us, then we are. Then we are locked in a prison of our own despair. And this to me just opens up, you know, Christianity and what the whole story is about."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":4289.31,"end":4397.76,"speaker":"Jonathan Pageau","text":"Yeah, yeah, that makes sense. That makes a lot of sense. And so are you seeing in the discussion that's remaining, let's say, glimmers of that? Because I saw you were kind of. You were kind of listening to the portal and you were breaking down some of the things they were talking about, trying to find some. Some moments that express more, let's say, a desire for more, like you said. Do you see? Because I'm curious, like, what is this the solution? Like, what is the solution that is, for example, like the, The. On the, on the portal. Like, what is the. I was listening to one of the videos you did where he was taught. I forget who he was talking to. And he was talking about telling people that they should have kids or something. Like, if you have kids, then that'll give you meaning and everything. And, And I kept. There was something so fragmentary about that type of thing where it's like, it's like, yeah, okay, but, you know, I don't think that that's enough. I mean, I don't think that people will feel like that that's enough. And also, why, like, is it just to follow some biological drive to reproduce? And if so, then what's all this other stuff? Like, what's all this whole other thing that's going on, this whole civilization thing, this whole art thing, this whole. What is that like, what is going on? If we find meaning in the being in, you know, reproducing the species, because we're programmed to do that. I don't. I don't. There's more. I know you obviously agree with me, but."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":4397.84,"end":4422.03,"speaker":"Paul Vander Klay","text":"Yeah, that's. So he was talking to Ryan Holiday, who. Ryan holiday is doing YouTube videos on stoicism. And again, if. When I was in. When I was first learning what stoics were, if you had told me that in 2020 there would be a stoicism movement on YouTube and you're going to talk to the sto. I mean, so you're going to talk to somebody."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":4422.03,"end":4422.71,"speaker":"Jonathan Pageau","text":"You're going to talk to them."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":4422.71,"end":4570.71,"speaker":"Paul Vander Klay","text":"Yeah. And the funny thing about stoicism is they have. So here's all this wisdom about. And I listen to their wisdom, and I think, yeah, that's wisdom. This is stuff that you can hear Jordan Peterson tell you that you can get from Marcus Aurelius, that you can get from all of these people. But where stoicism finally sort of bottoms out is that, yeah, if you have a kid and if you love that kid, don't forget that proviso. Because I think part of the hangover in post Christendom is that Christianity shamed us into a certain level of love. That society continues to maintain that. Yeah, to abandon your kids, you're still a schmuck. And we all know that. So suddenly the having of that child and parenting of that child begins to have a sacramental effect because. And one of the first people I talked to after I made my first video was someone who lives near her. And I had lunch with him, and he said, you know, this was a guy who was studying for the ministry, and then he got to a point in reading all of the Protestant theology and he said, I don't believe any of it. And then he listened to Sam Harris and he went through the whole thing, and then he met a woman, had a kid, and began to realize in himself, I'm. And I've talked to a lot of people like this, what if something happens to my kid? I love my kid. That kid isn't just a bunch of atoms. And something in the relationship with my child suggests that it's not merely a psychological trick or an evolutionary product that I am bounded to this child, but there's something in this moment that connects heaven and earth and am deeply disturbed by that realization. And it's not going to leave me alone until I get an answer that is satisfying. And so here's. So I listened to Eric talk to Ryan Holiday about what these people need to do is have kids. And I think, yeah, I've got five of them there. You know, it's sort of like the, like stories of old. You keep using those tools."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":4570.87,"end":4571.31,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":4571.31,"end":4577.35,"speaker":"Paul Vander Klay","text":"At some point, you know, the tool that. At some point the stones start talking to you."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":4577.51,"end":4606.07,"speaker":"Jonathan Pageau","text":"Yeah. Oh, yeah, that's a. That's a great. That's a great way to put it. And there's a reason why Stoicism failed. Like, it failed in the sense that it failed to make civilization. It. It's a. It's a. It has use. Used to it. But Stoicism only really succeeded when it was bound within Christianity. Because a lot of people will tell you that Christianity is a. Is actually a large. Largely akin to Stoicism."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":4606.15,"end":4606.95,"speaker":"Paul Vander Klay","text":"That's the best way."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":4608.23,"end":4674.75,"speaker":"Jonathan Pageau","text":"Yeah, it's akin to Stoicism. There are aspects of Stoicism within Christianity, but Stoicism doesn't offer you. Doesn't offer you a story to live in. It doesn't offer you a story to exist in. And the same thing with the Neoplatonists. Like, the Neoplatonists just couldn't. They just couldn't break through. Because. Because it was a theory and it was a bunch of, you know, this. It was a theory about the. About reality, but it wasn't an enacted story. It wasn't an enacted something that you entered into. And it didn't create the type of communion that would bind people together. And so you have Marcus Aurelius being a Stoic, you know, on his own, and whining that everybody is, you know, and complaining that everybody is a degenerate. But, like, we wouldn't say it that way, but, you know, like just being this, like, you know, taking the world on his shoulders and doing his thing, you know, taking it all on himself, but it doesn't come together."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":4675.55,"end":4885.92,"speaker":"Paul Vander Klay","text":"Which is exactly. I've watched enough Christians deconstruct, which is what I find exactly what happens to people who deconstruct from Christianity. So they sort of become Stoics and they take the world on their shoulders and they're really frustrated with everyone who's not pulling their share and not doing, you know, not. Not carrying the load with them. And it's like. And so then I get to Augustine and so, yeah, Manicheanism. And when you people always use Manichean as a. As kind of an exact, kind of an illustration of dualism, go and look what the Manicheans believe it's wild stuff. And, and then, and then, of course, Neoplatonism. And I think you said it's rare. So, wow, here's this incredibly brilliant thought through Neoplatonist image of the world. But if you read Confessions, talk about a book dripping with pathos and relation. And, you know, so John Vervaeke and I just had a conversation last week, and I think the conversation went very well. And so where John and I sort of come up against each other is exactly this, this question of personhood. And in your conversation with John, which was quite esoteric, but I thought, I really enjoyed it and I thought you nailed it right on the head when you said, you know, it's person, person, person. You get past a certain point, it's going to be person up and person down. You know, if you want to say it's impersonal beyond this point, well, you can say that, but you can't know it anyway because you're just a human being. And, you know, in, you know, in my conversation, I just finished with Brett Sokol. I have to figure out if I'm gonna post yours tomorrow or Brett's tomorrow. But, you know, we, I think, I think the thing that we finally come down to, we never see, really get past Genesis 3. That in a sense, the Genesis 3 story is about a conspiracy theory. And all that the snake does is say, you know, just makes a few suggestions and frame it in a certain way. And can we finally trust our maker? Can we finally trust. Can we, as tiny little scared creatures, finally surrender our hearts and say, this is what I am. This is. And I. No matter how much money and power and technology and all the stuff that this world has to offer, of course Jesus said all this. This is what I am. And what my heart desires is to love and be loved. And Neoplatonism, Augustine didn't end there for a reason. And I. So I watch the Stoics and I think I'd rather have my neighbor be a stoic than a hedonist. I'd still rather they be a good Christian who gives lay downs, lays down their life for their neighbor, all the way up to it, including their enemy."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":4886.08,"end":5086.35,"speaker":"Jonathan Pageau","text":"Yeah, no, I, I agree. And I think that, like, I think that it just. That's one of the reasons why it happened the way it did. One of the reasons why Neoplatonism and Stoicism were taken into Christianity because it offered the. It offered the story, it offered the pathos, and it offered the personalism. Like, if you want to Say it that way. It offered the fact that the world actually manifests itself through personal categories. You could say it that way, which is that. And it really is the idea, you could say, of intelligences. You know, that's how we talk about, when we talk about principalities and angels, that the world actually manifests itself through intelligences. It's not concepts like the way that the kind of, that say the kind of basic Platonic way of understanding it, that there are these like forms that are something like concepts that are kind of like these. But no, they're intelligences. The world manifests itself by, through intelligences. And once you kind of get that, then all of a sudden you realize, well, there's a reason why. Because a Stoic, a Stoic doesn't have to worship and they don't worship. But it also means if you don't celebrate, then you don't come together. It's just not, it's just very simple. The world is. Celebration is the beginning of reality. It's the way that reality, it's the relevance realization. Worship is relevance realization. That's what worship is. It is celebrating the disclosure of the source, of how things come together and are one and exist in love. Like you could say it that way. And so I think that that's why worship even that. And that's one of the things in my conversation with John that I was trying to kind of pull out of him, which you know, maybe is a bit, is a bit tricky on my part, but I was trying to pull out of him that even non theistic religions like certain strands of Buddhism or Daoism, that if they posit the highest in terms of non being, it still manifests itself as beings all the way down. And so it's like, okay, so you say that ultimate reality in terms of Buddhism is a form of annihilation. Okay. But then there are all these bodhisattvas like that start right at the door of annihilation, all the way down to hell. You have this like hierarchy of beings that come down. And it's the same in Taoism and it's the same in Hinduism and it's the same in every religion understands the world as a hierarchy of beings and a hierarchy of intelligences and not. And that means that it has to do with celebration and love and devotion also. It's not just that. It's not only that, but it's also part of it, right? It's not just story, but you can't."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":5086.35,"end":5087.19,"speaker":"Paul Vander Klay","text":"Get rid of story."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":5087.83,"end":5090.71,"speaker":"Jonathan Pageau","text":"It's not just devotion, but you can't get rid of devotion."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":5091.83,"end":5140.68,"speaker":"Paul Vander Klay","text":"And I think, you know, I think folk religion, you know, one of the things that always interested me about when I first started watching friends and neighbors, you know, start getting all excited about American style Buddhism, was I thought, now, wait a minute, you know, you go, you go, you go over there and you take a look at those Buddhists. And I remember when there was a jetliner that was broken down on a Runway, and the Buddhist monks came out and sacrificed a goat to get that, you know, sucker moving again. And I thought, oh, wait a minute, wait a minute. All my Western secular friends are going to these places and meditating and do all that, because this religiosity, that's, you know, that's all the problematic stuff. But those are Buddhists sacrificing a goat on an airstrip."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":5140.68,"end":5141.24,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":5141.72,"end":5143.8,"speaker":"Paul Vander Klay","text":"Why is that happening?"}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":5144.12,"end":5151.96,"speaker":"Jonathan Pageau","text":"Well, I always say that my Catholic grandmother was more a Buddhist than all these California Buddhists. For sure. For sure."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":5152.12,"end":5200.05,"speaker":"Paul Vander Klay","text":"Well, and that gets into the idea of folk religion where, you know, so J.D. vance's Meemaw was, you know, a Protestant folk religionist in many ways. But there's a. Even though she didn't go to church, there was at least still a haunting of an inclination of what you just described that she was not going to. In some ways, the entire artifice of what we've seen as new atheism is so fragile because it can sort of only be maintained as a grudge. I'm serious about that."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":5200.13,"end":5201.89,"speaker":"Jonathan Pageau","text":"No, you're right. You're totally right."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":5201.97,"end":5206.69,"speaker":"Paul Vander Klay","text":"It can only be maintained as I'm not going to worship."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":5207.01,"end":5209.49,"speaker":"Jonathan Pageau","text":"Yeah. And all your videos are debunking."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":5209.73,"end":5225.68,"speaker":"Paul Vander Klay","text":"Yeah, yeah. Okay, let's see. It's kind of like dealing with a two year old that says, you know, I'm not gonna eat anymore. All right, go for it. I'll talk to you tomorrow. I'll take your dinner away."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":5225.84,"end":5257.52,"speaker":"Jonathan Pageau","text":"Yeah, you'll be fine. But you see that? Yeah, you see that in the end, you end up having the atheists today. They have to end up saying things like, was it Dawkins who said, I'm a culturally Christian atheist? And then Zizek who says, he's a Christian atheist, and you're gonna end up having that. Or, who's the other guy? The crowds guy. I'm horrible with names. The problem with the one who wrote the Strange Death of Europe. What's his name?"}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":5257.52,"end":5258.4,"speaker":"Paul Vander Klay","text":"Oh, Douglas."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":5258.64,"end":5334.82,"speaker":"Jonathan Pageau","text":"Yeah. So Douglas Murray. He's the same. He's like, I'm a Christian atheist. You're gonna get a Lot more of that. But then it also. But then it. And hopefully it plays itself outright because there's. At some point when you say. At some point when you say it's like there's this real reality. A great meme that has appeared online. I think it was like Mike Cernovich, who posted it that I saw at least. And it was, you know, that exploding mind meme where it's. It's like the mind keeps getting bigger and more bright, and then it's like you keep getting more and more intelligent or whatever. And it. And it was basically about God. And the first one was, I believe in God. It's like a little brain. And then it says, I don't believe in God. And it was like a bigger brain. Then it says, I believe that God is a useful construct for keeping societies together and is a bigger brain. And then the other one is that without God, society breaks down and everything falls to hell. And then the last one's like, well, I believe in God because. What do you mean? So that's not real. That's not real. That if you don't have God or you don't have some religion, then everything falls apart. That's not a real thing. That's a real thing. That's a real thing in the world. And it actually happens."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":5338.1,"end":5339.38,"speaker":"Paul Vander Klay","text":"Just like symbolism."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":5340.9,"end":5342.9,"speaker":"Jonathan Pageau","text":"Yes. There you go."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":5345.86,"end":5369.43,"speaker":"Paul Vander Klay","text":"So that's what I've been. I just. I just keep. I just keep. I just keep itching at some of this stuff because I can't get enough of it. And people like you and others indulge my itch by making me no longer be able to watch Donkey Kong with any kind of the innocence I had before."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":5370.23,"end":5467.6,"speaker":"Jonathan Pageau","text":"Yeah, well, I have a. People. I have a lot. Like just today I was talking with some people, my kind of top patrons, and. And one of the guys, Kyle, I think he was on your channel and so I think he watches you and he was talking about. And he was actually giving me a frame that I might want to bring up with you right now because he was. Because one of the problems that I've been trying to understand in terms of symbolism, it's just hard because we're in it right now, is to understand the flip that happened during the pandemic. Because it's very odd, right? It's very odd. You had a moment in March where all the left leaning, all the liberal types were saying it's evil to shut the border. It's racist, it's xenophobic, it's all this blah, blah, blah, blah, blah. And the people who are conservative were saying, no, this is a serious pandemic. We got to shut it down. And then it flipped completely upside down. Like, the whole thing, the whole discourse completely changed. And then all of a sudden, it was the people who were on the left who are saying, we need to shut down forever. Two years, like, it's gonna get. This is never gonna come back. It's never gonna change. And then the others are saying, just free. I need to be free. Like, like, you can't shut us down. This is government tyranny, blah, blah, blah. And I thought, wow, it's. It's crazy how. How it totally flipped. And then he said that you were talking about the strength and compassion, right? Yeah, go ahead."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":5467.68,"end":5616.04,"speaker":"Paul Vander Klay","text":"So the Republicans watch the 2016, don't actually watch it. You just look at a picture because you know exactly what's gonna happen. Watch the 2016 Republican candidates debate each other about who should be at the head of the party. And then look at the 2020 Democrats, that big field debate each other. The Republicans always sort of manifest strength. We are about strength. And so Donald Trump wants to manifest strength. And the Democrats, kindness, compassion. And so, you know, Republicans, we're going to fund. We can't put enough money towards national security. We can't spend enough money on keeping ourselves safe. Even though the United States spends more than the next six countries combined. The Democrats, we can't spend enough money throwing it at suffering people, because if they're suffering, you know, we're sure that some amount of money will fix it. And I think part of what happens in a pandemic is that both get exposed. And so the shutdown. Well, for a while, when Trump was running for office, one of the things he was going to end is the national deficit, because there's going to be so much money coming in and. Yeah, yeah, yeah. And so now, of course, then the Dems are all worried about the deficit. And now, you know, well, we just, you know, $4 trillion in one fell swoop. And now the Dems are back and wanting to do another 3 trillion. And so everything's all inverted. You're exactly right. Because, well, what. What are you afraid of? And, you know, in a sense, at least, the Republicans are afraid of their loss of liberty and the Dems are afraid of losing their life because, you know, it's been very interesting. Again, this gets into. So in 1960, John Fitzgerald Kennedy, the Democratic senator from Massachusetts, ran for President of the United States. And the dominant concern was, can we elect a Roman Catholic?"}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":5616.12,"end":5616.52,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":5618.12,"end":5660.13,"speaker":"Paul Vander Klay","text":"In 2000, four, another JFK, John Kerry, the Democratic senator from Massachusetts, who was also a celebrated war veteran, ran for president on the Democratic ticket and most Catholics didn't vote for him. In 2020, we're going to have a Friesian. So that's my mother's side Friesians, you know, they're Germans and Dutch. We're going to have a Friesian who his most abiding church connection was the Reformed Church in America. So Donald Trump religiously is my cousin."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":5660.61,"end":5662.93,"speaker":"Jonathan Pageau","text":"Okay. Yeah, very decent cousin."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":5662.93,"end":5679.6,"speaker":"Paul Vander Klay","text":"Friesian, Dutch Reformed, via Norman Vincent Peale, prosperity Gospel, running against Joe Biden, who of course is a Roman Catholic. And Joe Biden goes to church more than Donald Trump, I would bet."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":5679.84,"end":5680.24,"speaker":"Jonathan Pageau","text":"Really."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":5682.88,"end":5688.24,"speaker":"Paul Vander Klay","text":"Now, all of these church labels, what on earth do they mean?"}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":5688.4,"end":5689.88,"speaker":"Jonathan Pageau","text":"They don't mean anything anymore."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":5689.88,"end":5736.04,"speaker":"Paul Vander Klay","text":"Yeah. And. Well, here's the question. And so then Tom Holland's work comes through his book Dominion, which is a very interesting book, he basically comes through and says, which really annoys the secularists. Do you know how deeply Christian our entire society is? You know, we can't. Christianity runs through everything that we're doing. All of our fights are, in a sense, within Christianity. That's an equal opportunity offender. Because the secularists, you know, say, no, it's the Enlightenment. And somehow our culture is a clean room, artifact of the Greeks. And Tom Holland says, hey, I've spent my life writing stuff about the Greeks. We're nothing like the Greeks."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":5736.04,"end":5737.72,"speaker":"Jonathan Pageau","text":"Oh, yeah, my goodness, no."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":5737.96,"end":5763.97,"speaker":"Paul Vander Klay","text":"And on the other side, the Christians are saying, no, we've, you know, Christian people are. This is how you define Christian people by their religiosity. And it's like, well, you know, there's a lot of stuff about religiosity that it isn't merely religiosity either. And so we have inversions all over the place right now."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":5765.01,"end":5797.96,"speaker":"Jonathan Pageau","text":"No, you're right. And it's. But that's a topsy turvy like that. I guess that's the problem with the topsy turvy world is things just keep flipping and you don't know. You know, it's like juggling. You don't know what's going on. Some things are up, things are down. And so it'll be interesting to see how it's going to play out. But there was still like, it was interesting the way that he had framed it based on your categories. I thought it was a good idea. He said, when at the beginning the Republicans were acting out of strength by saying, we're going to shut our borders."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":5798.2,"end":5798.6,"speaker":"Paul Vander Klay","text":"Right."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":5798.76,"end":5803.48,"speaker":"Jonathan Pageau","text":"And the Democrats were Acting out of compassion by saying, no, no, we need to let people in."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":5803.9,"end":5804.14,"speaker":"Paul Vander Klay","text":"Yeah."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":5804.14,"end":5829.18,"speaker":"Jonathan Pageau","text":"And then when it flipped, they're still using the same. The same. The same reason. Like, so the person, the Republican, is saying, you know, oh, no, I'm going to be strength. I can't let someone control me. I need to go outside and not wear a mask and do that. And the other is saying, no, you need to protect others and save lives and isolate yourself to save lives. And so it ends up being the same motivation which is creating the opposite. The opposite reaction."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":5829.46,"end":5829.86,"speaker":"Paul Vander Klay","text":"Yep."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":5829.86,"end":5833.3,"speaker":"Jonathan Pageau","text":"And so it's fascinating to watch it. It's really fascinating to watch it."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":5833.86,"end":5839.38,"speaker":"Paul Vander Klay","text":"And. And it'll. You know, it's crazy when you said it'll."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":5839.38,"end":5843.62,"speaker":"Jonathan Pageau","text":"I'm like, it'll. What? What do you think's gonna happen? You know, what's gonna happen?"}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":5844.02,"end":5908.56,"speaker":"Paul Vander Klay","text":"But, you know, and I think in some ways, you know, because I think. I think a fair amount about. I mean, the. The. The rising of the Orthodox Church within the. Within the church landscape in America is fascinating to me. And, you know, especially in the light of this, because I think about Rod Drear, how, you know, Rod Dreher goes to his priest and says, you know, we want to practice, you know, Roman Catholic family planning. And his priest rolls his eyes and says, oh, you're one of those. And, you know, within not too long, Rod Drear will be Orthodox. So, you know, so in a sense, what we've seen is that we used to have these labels like Roman Catholic. John Kennedy is Roman Catholic. And that label stood for something. There was a witness there that by the time of John Kerry, the witnesses. Completely diluted."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":5908.89,"end":5992.82,"speaker":"Jonathan Pageau","text":"Yeah. And now I think Rodrigo's analysis of this situation is the best. I think that. I mean, his vision is that to a certain extent there right now, what's really happening is that there are Christians who take it seriously and there are Christians who don't, who base their motivation on their faith. And there are Christians who base their motivation on other factors that they base it on other factors. And those Christians that base their motivation on their faith, they end up seeing each other across denominations. And so it's like, I feel more akin. And a lot of Orthodox might be annoyed that I'll say that, but I feel way more akin, even with evangelical, who wants to get rid of the sins in his life and wants to be faithful to his wife and wants to worship God the way he thinks it's. He's capable of doing, who wants his culture to be coherent. I feel more akin to that person than I do. To some Greek Orthodox, nominal Orthodox who goes to church three times a year. And, you know, it's like, I. Yeah, so I can see you across the. Across the lane. And I'm like, why? You know, we disagree on things, but I can see you. And the other person is just like, but we're getting."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":5992.82,"end":5997.22,"speaker":"Paul Vander Klay","text":"So now work in relevance realization because we're trying to figure out what it is."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":5997.62,"end":6002.66,"speaker":"Jonathan Pageau","text":"What's the pattern? Like, what. What is the thing that's making this, this. This appear as a pattern?"}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6002.82,"end":6003.18,"speaker":"Paul Vander Klay","text":"Right."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6003.18,"end":6033.17,"speaker":"Jonathan Pageau","text":"Because these first things, people. Who are these. Who are these. Yeah, who are these American conservative Rodrier types? Like, where. How is it that they're in the weird communion, but they don't go to church together? They wouldn't take the chalice together, but they still feel a sense of weird. And a lot of. A lot of these types of people are non ecumenalist, actually. Like, we don't believe in ecumenism, but we actually see each other across the lines and say, one of the reasons why I feel akin to you is because you take your difference with me seriously."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6033.33,"end":6033.73,"speaker":"Paul Vander Klay","text":"Right."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6033.73,"end":6047.12,"speaker":"Jonathan Pageau","text":"And you're willing to. We'd actually have to, like, talk it out and take it seriously instead of saying, it doesn't matter, it's all good. Like, whatever, let's all have a big. A big party and just forget about our differences. As if that. That does anything."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6047.52,"end":6056.08,"speaker":"Paul Vander Klay","text":"And I think some of that. So Chuck. You know who Chuck Colson is? He was one of Richard Nixon's hatchet men. He wrote this book, Born Again."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6056.16,"end":6057.6,"speaker":"Jonathan Pageau","text":"Yeah, I remember that book. Yeah."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6057.76,"end":6118.46,"speaker":"Paul Vander Klay","text":"So. So in Born Again, you know, Chuck Colson comes to his wife and says, I'm a Christian. And his wife looks at him and is like, you're Episcopalian. No, no. Now really. And I think in a lot of ways, what we've been working on for the last 60 years now in an ecumenical frame is what is it? What is that thing? What is that thing that binds an Eastern Orthodox icon carver with a Dutch Reformed from an iconoclastic background? Because, of course, they smashed half the monasteries and why am I laughing? And my denomination is conservative enough that there are some quarters where Vanderklee is talking to an icon carver? Doesn't Jonathan Pigeot make idols?"}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6118.86,"end":6119.22,"speaker":"Jonathan Pageau","text":"And."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6119.22,"end":6143.91,"speaker":"Paul Vander Klay","text":"Oh, no, after this conversation. But that's part of exactly what we're in right now. And it's manifest in the strange. The strange ecumenism that is happening at this level. Because a lot of what's been passed off as ecumenical conversations, we look at and Say, I'm not really interested in that."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6144.47,"end":6212.67,"speaker":"Jonathan Pageau","text":"Yeah. Because it's just. It's like a weird, fluffy pretend. It's like you're pretending. I think there's an honesty about. Maybe at this level that we're trying to identify. There's an honesty. Right. There's an honesty about actual differences and actual resemblances instead of just trying to cast it all aside. I remember having a discussion when I was. It was really. I was young, I wasn't orthodox. Like, I was evangelical. And I remember meeting a Catholic guy and he was like, oh, Christians, we just all need to come together and. We just all need to be together and. To be together and. And I was like, well, I said, I know some Christians who think that when you pray to Mary, you're praying to the devil. And so what do you do with that? And he said, oh, well, they just have to put that aside. Well, I'm like, well, I don't know what to tell you because that doesn't work that way. Like, you can't just throw everything out. Let's deal with it. Let's talk about it. We might disagree, but if you just say, let's pretend like it's not there, you know, it's like, it'll end up. It'll. It'll look really nice for a little while, and then it'll be all passive aggressive from then on, you know?"}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6216.03,"end":6254.11,"speaker":"Paul Vander Klay","text":"That's true. So true. Well, and to me, this gets back to one of the earlier things that I saw in Jordan where he says, you know, first you act it out, and I think that gets into worship, what we talked about, and sacramentality, because, okay, let's all be together, so let's go worship at your house today. And you come in and, oh, there's the statue, and Jesus is up on the cross, and all, you know, start to get a little bit of nervous, and, you know, people are dipping in the holy water. And at what point will something inside of me say, okay, there's the line."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6254.27,"end":6256.19,"speaker":"Jonathan Pageau","text":"I can't cross that line. Yeah, exactly."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6257.15,"end":6288.96,"speaker":"Paul Vander Klay","text":"But at least there is a line. That's right. Yeah. Because in a sense, what we sort of began wandering into, you know, because this inversion seems very much to have something kicked off in the 60s that got us going in here, there. So where exactly is the line? And what is the line? And what is that? What is that line really connected to? And how far up and down does that line really go? And will you actually live by that line?"}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6289.84,"end":6362.42,"speaker":"Jonathan Pageau","text":"But it's not arbitrary. It has to do with, I think A lot of it has to do with honesty. I think that. I think a lot of it has to do with honesty. And that's what makes. Like I said, that's what makes us able to see each other across the line, is that you're not pretending, you know, that this is like, for example, like, if I brought you to an Orthodox church, you wouldn't pretend that it's all fine. You'd be like, okay, this is my line. And so we can actually talk about it. You know, Like, I went to. I went to this year. I went to, like, a Christmas service, one of the Christmas services in a major, kind of Pentecostal type evangelical church. And it was. And it was more like a big play, but it was still in the church. And it was like, the whole time I was like, I'm gonna. You know, and then it was like, it kept happening. And then when the acrobats came out, I was like, that's it. That I've. This is my line. Like, this is the line where I'm like, nope, nope. When I've got the girls, like, dropping from, like, the cloth and leotards in the church, I'm like, that's it. Like, I just. That I just can't. I just can't. I'm not here anymore. I'm just not here anymore. So I can imagine, like you said. But then if I. If I saw the pastor of that church, who's a very."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6362.82,"end":6363.14,"speaker":"Paul Vander Klay","text":"Who."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6363.14,"end":6377.9,"speaker":"Jonathan Pageau","text":"Someone who has extreme integrity and is extremely impressive in terms of his life and terms of his devotion, you know, I can still see him across the line, but I'm not going to pretend like it's fine that I think it's fine he has acrobats in his church. I'm not."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6387.9,"end":6424.07,"speaker":"Paul Vander Klay","text":"Well. And to me, as you know. So when I listen to people talk about me in other things, they'll say, well, he's this. He's this pastor who's high in openness. And it's like, I'm not sure that's always a good thing, but I've always. I've always, as a Protestant, wondered, so why is it okay to bring the donkey into the building and have the Christmas pageant, but it's idolatry to have a picture of a donkey and stained glass, you know, and so. Oh, you're so right. You're so right."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6424.79,"end":6451.76,"speaker":"Jonathan Pageau","text":"But I really, like. Yeah, I really do think that one of the reasons. If you are honest about what you believe and you're honest about what your limits are, and you don't Pretend. And you know what it is, then I think that that permits a lot of openness. It permits indefinite openness because you're open to a certain level, you know, like, I can have a discussion. I think, like, I could have a discussion with anybody."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6451.84,"end":6452.4,"speaker":"Paul Vander Klay","text":"Yeah."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6452.48,"end":6468.72,"speaker":"Jonathan Pageau","text":"But it doesn't mean that I have to concede the things that are important to me just because I'm having the discussion, you know? And so I think that that's it. Like, if you're honest and you know what you believe and you know what you are, then you actually have a lot of room to talk to other people."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6468.88,"end":6507.25,"speaker":"Paul Vander Klay","text":"Yeah, yeah. No, I. And again, people sometimes ask me because they're surprised that I'm a pastor, and I'm like this. And I think that shouldn't be surprising. But, you know, I learned so much of this from my father because I learned from him exactly what you just said. If you know who you are and you know what you believe, then the other person's. Whatever it is they are and are saying and doing, it doesn't really threaten you because that's them and you're you, and you actually know the difference between them and you. A lot of people don't."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6508.29,"end":6533.32,"speaker":"Jonathan Pageau","text":"Well, you know, but it ends up manifesting itself in all kinds of ways. Where, for example, you know, let's say people who just want to accept tradition from other cultures. It's like you're deluding yourself. It'd be way better for you to say, well, you know what? Like that. Like the sacrificing of the goats. No, I don't want that. Like, I don't. I don't want that. I don't think that's okay."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6533.32,"end":6538.6,"speaker":"Paul Vander Klay","text":"I want a mechanic, not a. Not a goat sacrifice that's on my plane."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6538.92,"end":6587.02,"speaker":"Jonathan Pageau","text":"Once you at least say, nope, that I think is. Then you can have an actual discussion. But if you pretend like it's all okay, like, you have no idea how weird other people's. Other people's way of doing things is. Right. You have no idea. Like, there are cultures where people still beat their wives. And so you have to at some point say, well, they don't know that. No, I don't. That's. That's not acceptable. Right. And so it's better to just know and then. Then. But then I could talk to a guy who beats his wife. Like, I could have a discussion with him, you know, And I would. I wouldn't agree with his behavior, but I can talk with the murderer. I could talk with. With. With. With people who live in a way that I disagree with, you know, I don't feel like I need to, to pure to keep myself pure from anything that's not like me."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6587.48,"end":6596.2,"speaker":"Paul Vander Klay","text":"Yeah, yeah. Well, yeah, yeah, no, I agree. I agree. Well, we've done, we've done almost two hours."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6596.52,"end":6613.56,"speaker":"Jonathan Pageau","text":"Two hours. You, you really pull me like because I usually, I never have like two hour conversations. It means like after an hour I start being like, okay, you know, we've gone through everything, but you got me going for two hours. That's awesome. And laughing the whole time."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6613.88,"end":6616.25,"speaker":"Paul Vander Klay","text":"Joe Rogan, Watch yourself, baby."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6616.25,"end":6619.01,"speaker":"Jonathan Pageau","text":"I'm coming for you, Joe. We're coming for you, Joe."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6620.53,"end":6636.97,"speaker":"Paul Vander Klay","text":"Well, Jonathan, so we should give you a. Not that, not that my. You can of course post this on your blog too. I'll send. On your channel too. I'll send you the file. But you know, you've got your blog going and is that, is that on your regular domain? You can get there from your regular domain."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6636.97,"end":6655.65,"speaker":"Jonathan Pageau","text":"Yeah. So the symbolic on the now it's going to be. My things are going to start to focus on my website. So the symbolicworld.com I'm going to start to have more things there, you know, articles and also if I appear on other channels and so I'm going to start to consolidate that in that, on that website. So it's going to become the place."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6655.89,"end":6660.37,"speaker":"Paul Vander Klay","text":"You still think they're going to, they're going to clamp down and take YouTube away from us."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6662.21,"end":6759.61,"speaker":"Jonathan Pageau","text":"I think they're good. I think they're going to do it very slowly and I think it's already happened. I think it's already happening. I've seen it happen. I saw, I did. You know, it's like obviously they can probably, their algorithm can probably identify, identifying with Jordan Peterson. They identify me with more conservatives. And I saw like I did a video, it was called is Christianity a Cuckold religion? Right. And the video was really trying to explain a pattern. But I think the fact that I use that word and I'm already kind of associated probably with more right leaning stuff and everything. I saw it happen in real time. The video took off in like I had like 20,000 views in one day and then it stopped and then it just went flat and I thought, oh, okay, what's going on? And then from then on I've seen my views like kind of hold at a certain amount of views and I. Part of it is the fact that Jordan Peterson's gone, that's for sure. But part of it is also I think, you know, I don't think it's A human decision. I think it's just their algorithm just starts. Just marginalizes people who. Who are not in line with what they want. So I think it's already happening and it's better for them if. If I was. If they're strategic, it's better for them to keep you on their platform but make you as marginal as possible because that way you're not putting the effort into finding other platforms, you know? Yeah, that's what I think is going on."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6759.69,"end":6764.57,"speaker":"Paul Vander Klay","text":"There really isn't a. Because there really isn't a platform competitor."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6764.81,"end":6765.37,"speaker":"Jonathan Pageau","text":"Nope."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6765.61,"end":6767.29,"speaker":"Paul Vander Klay","text":"Like YouTube. There really isn't."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6767.93,"end":6787.36,"speaker":"Jonathan Pageau","text":"Like, I upload all my stuff on Bitchute, but Bitchute is crap. It's just not well done. It's not well programmed. The search is not good. You know, there's no recommendation the way that YouTube recommends videos, so it's hard to get more reach outside of your reach. And so there is no competitor. So I don't. I don't really know."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6788.32,"end":6788.72,"speaker":"Paul Vander Klay","text":"Yeah."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6788.72,"end":6806.99,"speaker":"Jonathan Pageau","text":"And think spot is just not. It's just not panning out. It's just. I know. I respect what they're doing and I. And I respect the fact that they're putting in all this effort, but if you go on there, you know, even the most famous person has very few reactions to their post. And so."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6806.99,"end":6815.55,"speaker":"Paul Vander Klay","text":"Yeah, yeah. Oh, well. Well, we'll just trot along. That's what we'll do."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6816.67,"end":6818.19,"speaker":"Jonathan Pageau","text":"Well, again, grace of God."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6818.19,"end":6860.46,"speaker":"Paul Vander Klay","text":"That's right. Being a Christian helps me not worry too much about these things because here we are right now. But thank you, Jonathan. Thank you for your time and most of all, again, thank you for the work that you do, because I think it's really important and I think it's excellent work and you really do help me see the world in a different way. You inform my Bible reading, you inform my culture watching. And you've just opened up whole new vistas for me that apart from you, I don't know that I'd see. So thank you."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6860.62,"end":6873.58,"speaker":"Jonathan Pageau","text":"Well, thanks. And thanks for all the insane work you put into these discussions. And I hope that we will meet in person. We were supposed to, and now it might not happen, but let's hope that we get to meet."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6874.3,"end":6880.46,"speaker":"Paul Vander Klay","text":"Lord willing, one way or another, I believe it will happen. And I look forward to that day."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6880.78,"end":6881.34,"speaker":"Jonathan Pageau","text":"All right."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6881.34,"end":6881.7,"speaker":"Paul Vander Klay","text":"All right."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6881.7,"end":6882.26,"speaker":"Jonathan Pageau","text":"Bye, Paul."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6882.26,"end":6883.58,"speaker":"Paul Vander Klay","text":"Thank you, Jonathan. Bye. Bye."}
{"episode_id":"SW - #103 - 2020-06-09 - Paul VanderKlay - What to Do After the First Jordan Peterson Wave -","start":6884.79,"end":6949.62,"speaker":"Jonathan Pageau","text":"I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel. Jonathan Pageau's YouTube channel, you can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageot videos as well, and on subscribestar. All those links you can find on my website or in the show description. So thank you and I will see you soon."}
