{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":12.16,"end":123.93,"speaker":"Jonathan Pageau","text":"This is Jonathan Pedro. Welcome to the symbolic world. So, hello everyone. We are back with another episode of Universal History. Today we are going to talk about the Tower of Babel, something that I find very interesting, that I've been thinking about for years. I can't wait to get Richard's take on it. But before we start, I want to make a big announcement, which is that, as you know, symbolic word press has had some problems in the past month or so, and myself just with a couple, just myself discovering that things were not what they seemed in my. In the way it was represented to me and that things were a lot worse than what we thought. And I went to Dallas and Richard saved my life, like, literally. But he helped me. He was. We drove around town for days trying to figure things out, connect with lawyers and accountants and, you know, get stuck. His house was full of books for weeks, you know, trying to get organized so that we could send your books to you. But it's weird. In that moment and even a little bit before that, I discovered I had an insight which I can't believe I hadn't had before, with just how close Richard and I's thinking is in terms of storytelling, in terms of the way we see universal history and the way we see the cosmos. But also Richard has a lot of skills that I do not have. He is a he, you know, he has a computer thinking, like, he's a, he's a manager, he, he's able to deliver projects. And so we've decided to partner up in the symbolical press. And so we will be working together very closely in the next few months. So. So, Richard, welcome to the symbolic world."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":124.49,"end":234.89,"speaker":"Richard Rohlin","text":"Thank you. It's, you know, I, when we were talking about all of this, I said, you know, it feels like everything that I'd done in my life up to this point was, was maybe for this, like, you know, the weird mixture of. I'm into all these ancient stories, but also like project software, project management and, you know, I don't know. Anyway, it's, it's, it's been a whirlwind so far though, Jonathan, I have to say, like, you know, it's already been, you know, one of the more interesting things that I've under. Ever undertaken. It's only been, you know, basically a month, but yeah, there was so much crazy stuff that happened and it all happened right on Candlemas, you know, and we spent all of Candlemas, like, you know, driving around in the pouring rain trying to, you know. Yeah, it was just, I don't know, it was just, it was a whirlwind time. And I, I said this on, on Derek's channel recently, but like, I remember we were having this, this conversation, you and I, we were talking about some various things and you were like, yeah, mystical things don't really happen to me. I mean, I believe that they happen and whatnot. And then like there's just all of these insane things happening the entire week that you're down here. And I was like, oh yeah, mystical things don't happen to you? Sure, uh huh. Yeah. But no, it was, it's, it's been a crazy time. My house has essentially been a warehouse for the last two weeks now. And so I know a lot of people have been posting on Twitter saying they're getting their Snow White stuff. I know that a lot other, a lot of other people still haven't gotten it, but we're on it now, we're on the case. So we're gonna, we're gonna make sure it gets done. So I have, I think I've only got like six big boxes left in my office here. And then, and you know, then the rest will be coming out from the warehouse relatively soon. But yeah, so I'm excited about this. I'm excited about the potential of getting to tell some stories that have been living rent free in my head for a long time. And, and now maybe we'll get to share them with the world."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":234.89,"end":294.98,"speaker":"Jonathan Pageau","text":"So, yeah, and so, and also before we start, don't forget next week, I mean, Richard and I are going to be together in Florida and Tarpon Springs, the Symbolic World Summit. Jordan Peterson is going to be there, Father Steven DeYoung, Neil Degrade, Deacon Nicholas Vesper Stamper and a bunch of people that are not on the roster. Like Andrew Gould's going to be there, Father Silo and Giustiano just. It's going to be absolutely crazy. Jordan hall is coming. I don't even remember all the people that are going to come. And so there are still a few tickets left for the actual event, so you can get those on the Symbolic World. But if you cannot come, which I understand, then we've decided to offer virtual tickets that are deeply discounted until the very day of the conference because we're going to release the videos during the days that the conference is on. And so go to the Symbolic World. Calm and. Because this might be a once in a lifetime opportunity, to be honest, because it's crazy, but I'm not sure sure we're ever going to do this again. All right."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":294.98,"end":295.26,"speaker":"Richard Rohlin","text":"Yeah."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":295.26,"end":299.3,"speaker":"Jonathan Pageau","text":"And so Richard, Take us. Take us. Take us to the Tower of Babel."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":299.75,"end":729.5,"speaker":"Richard Rohlin","text":"Okay. So I thought that it would be fun. We were talking about what video we should do for Universal History this month. Obviously, the dragons one came out. What people don't know is that we recorded that back in, like, November or something. And because life has been crazy, we haven't recorded one of these in a little while. And I thought it would be fun to do something that would kind of tease the stuff I'm going to be talking about at the conference. So the. The. The title of my talk is, or one of the talks I'm giving is called the Shadow of that Hideous Strength, which sounds like it's a C.S. lewis reference. But the C. The title of the C.S. lewis book, which is one of my favorite books, is actually a reference to the Tower of Babel. And so we're going to talk about the Tower of Babel today. I'll talk a little more about the connection to that hideous strength and the poem and that that's a reference to and all this stuff. I'm going to talk about that at the conference. Not going to talk about that today, but basically what I'm going to do with the conference is really focus on Genesis and really focus on all of the things about Genesis which in the ancient world and in the Middle Ages, people took for granted when they were reading Genesis. And it's not to say that. That some of these things are completely universal, but there's definitely, like, you could say a constellation of. Of ways to read and ways to understand Genesis. What pretty much everybody in the ancient world agreed on is that Genesis is the most important book of the Old Testament when it comes to just understanding why everything is the way that it is. And this is one of the beautiful insights that your brother Matthew brings out in his book. And this is one of the. Actually, to me, one of the really cool things about God's dog, God's Dog too, by the way, is. Is on Kickstarter now. I know we have a lot, a lot of things going on, people, but. But there's going to be. I've already gotten to see some of the stuff from God's Dog too. It's going to be actually some of the stuff we're talking about today and right in there, which, which I'm not going to like and, and then other things which you might hear explained if you come to the conference. So anyway. But there used to be this way of reading Genesis, and that way of reading Genesis was lost, particularly in the west, because A lot of the books which contained it were rejected, ultimately rejected as apocryphal. And at some point in the west, we don't need to go into why right now, but the apocrypha became associated with. This is bad and evil and wrong and potentially dangerous to read. Right. And this is not the, that's not what that word actually means in the church. Right. Historically, that's not always how we, how, how we've used it. So these ways of reading Genesis got lost. And then the 20th century comes along, especially the, say, the last 20 cents, 30 years of the 20th century comes along, and with the emergence of, of you have an emergence of materialist, materialist readings of Genesis in response to, let's say, you know, atheists basically trying to pick it apart, right? And so then Christians come back, but they come back on the same terms the atheists are using and try to defend Genesis in a materialist way. And so one of the things that ends up happening is when somebody like you or your brother tries to talk about Genesis in a, let's say, like a more of a mythical register, people are like, are you saying you don't believe God created the world in six days or something like this? So what I want to kind of do, what I, what I, what I want to do is to kind of introduce people to a selection of these readings and, or these traditions is really the, the right. The correct word about Genesis and explain how this actually still affects the way that you live today. For instance, if you're an Orthodox Christian, there are certain things that you believe, for instance, about the liturgy. I'm not going to explain this today. You have to come to the conference. But there are certain things that you believe about the liturgy and about the feast of the church that are true because of the way that we've inherited, because of this tradition about Genesis that we've inherited. So, so if you find yourself in the Orthodox Church or in a more traditional branch of Christianity, there's a lot of the stuff that you'll still assume to be true. Actually, even if you don't, there's still a lot of the stuff that you assume to be true. Most evangelicals, for instance, take it as more or less fact that evil spirits are fallen angels. There's actually nothing in the Bible to say that directly. There are things that you can infer, but you can only infer them kind of in the light of these older traditions about how to read those scriptural passages. So that's kind of one example. But so today I thought we would talk about the Tower of Babel, obviously. This is one that's very interesting to me as a linguist, and it is to me, like most of the stories in Genesis. It is one that is impossible to say everything about. Like, it's impossible to exhaust. So we're going to say some things about the Tower of Babel today. But if you're out there watching and you're one of the people who knows all these traditions are like, ah, he didn't mention xyz. You're right, I did not. But maybe we will in a future video. Maybe there's actually more stuff about the Tower of Babel I'm going to talk about at the conference, so come to that. But, but. So I thought we would talk about, first of all, just what a tower is. If you look at traditional images of the Tower of Babel, the one that's most well known is one. It was. I think it's like a 16th century image. Yeah, that's right. It's from the. It's from the Renaissance. And it basically shows kind of a spiraling tower going upwards. And that's essentially correct. Now you can say, you know, it was a ziggurat, which is kind of like a stepped pyramid or something. It's the same thing, though. Like, it's the. It's the same thing. It's doing the same kind of. The same kind of thing. So a tower is. I mean, and you can probably explain this better, but a tower is. You could say it's a fixed point in space. Right. And. And it's a way of literally nailing something down. Right. Whereas the spiral is this. And I love that you just did that video on the Leviathan and the Oroboros and all that stuff, because it's. Because that idea of the spiral as kind of like time and change. Right. And then. But then also kind of this cyclical or, or say, like undulation in time. So when you have the, the combination of those two things and there's this wonderful. The opening sequence of the first volume of God's Dog, maybe we can put that up here for people to see. But the opening sequence of God's Dog is actually the Tower of Babel, but in a. In a good context. Yeah, right. And this is the thing to say about symbolism. And you mentioned this in your Leviathan video that just dropped that. Symbolism is. It's. I don't wanna say neutral, but it's not like it. It can be positive or negative, right? It can have positive or negative aspects depending on the Consequence, depending on the context. Right, yeah. And so there's this moment in those. I was trying to find my copy of God's Dog, so I could just show it here to the screen, but we'll put it up where. Where you see the overlap of that image of the tower with a spiral going up, which is like the stylized pillar, and then. Oh, you got it right there. Yeah."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":729.5,"end":733.54,"speaker":"Jonathan Pageau","text":"I always have a copy of God's Dogs nearby. So. Yeah, it's this image right here."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":733.78,"end":808.71,"speaker":"Richard Rohlin","text":"Yes, sorry. Yeah. So there's the. There's the tower with a spiral going up and then the stylized pillar at the top. But then if you flip a couple more pages, you see the overlap of that with the candle. Right. And it's. It's funny because one of the. The. Yep, there it is right there. Yeah, yeah. So it's funny because one of the questions that I get asked the most often in my capacity as a catechist is why do you light a candle when you pray? What's. What's going on there? And that is the easiest thing to intuit and the hardest question to answer. Like. Like there is something that's just very intuitively right. About obviously you would light a candle when you prayed, but it's really hard to explain to somebody why. Right. But it's actually connected with the. The symbolism of the tower, including the Tower of Babel. So the idea of the ziggurat or the tower is that it's a. It's an artificial mountain. Right. Is another way to think about it. It's an artificial mountain. And, you know, there's. There's overlap between, like, a mountain and a pillar. So it's an artificial mountain because God lives at the top of a mountain. As everybody in the ancient world knows, it's a hierarchy."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":808.71,"end":813.79,"speaker":"Jonathan Pageau","text":"I mean, if you people. Because people think it wise appear like a mountain, it's a. It's a connection between heaven and Earth."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":813.79,"end":814.59,"speaker":"Richard Rohlin","text":"It's a. Right."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":814.59,"end":825.23,"speaker":"Jonathan Pageau","text":"The vertical. It's a hierarchy. And you could see it, like, you're right. You could see it this way as Earth coming closer to heaven, but you can also have it as a ladder, as a pillar, as a rod, et cetera, et cetera."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":825.23,"end":1009.09,"speaker":"Richard Rohlin","text":"It's something that you can ascend. And it's got its base on the Earth, but it's top in the heavens. Right? Yeah. And there's this. And then at the very top, there's an altar or a flame. Right. And one of the things we were talking about before the video started, the Latin word focus. Right. When we Say the focus of something means like a. An. A hearth or an altar. Now, you can commit the etymological fallacy and say every time that the word focus is ever used, then it actually means this other thing. But also, that's not an arbitrary connection between those two things. Like, if you can think about. I mean, especially if you've. If you worshiped in any kind of a traditional space where the focus is the altar, right? And those two things become the same thing. And it's why even in like a. Like an Orthodox home, you have a hearth or, you know, and usually people put their icons over the top of a hearth, right? It's just. It's a natural thing to do because the. The layout of the house is centered around the fireplace. Actually, the layout of modern houses is now centered around where the TV is supposed to go. Right? This is why I tell, whenever catechumens ask, you know, where should I put my icons? Do they have to go on an east wall or anything like that? What I usually tell people is figure out where in your house the TV was intended to go and put the icons there. And put your icons there and put the TV somewhere else. Like, if you like, I'm serious. It'll change the way that you pray and like, the way that you live your family life. So anyway, so the. The altar is a point of focus. It's a point of intention. It is a place where you could say the meaning of time and space is brought together, right? So if you've got space is this fixed point uniting earth and heaven. And then time is this movement and change. The altar is the. Is the. Is the focal point that brings those two things together and kind of reconciles the meaning. And again, you can. We could talk about how the liturgy does this. The way that liturgy transforms, you know, Kronos into kairos, and the way that it. It. It transforms space into place. And all those different things, those things actually happen in the liturgy. And even in the, like the Eastern liturgy, there's even the circular movement that's constantly happening. We go around the altar in a process of ascent as we move upwards towards the. The kind of. The culmination of the sacrifice that's on the altar. So anyway, all of this to say, this is what the Tower of Babel is. I mean, if you want to get some more on the religious connotations of what the Tower of Babel is, you can go and listen to the episode the Lord of Spirits guys did on it. It's. Which is really great. What I want to kind of point out is before we talk about why the Tower of Babel was wrong, you need to understand that. That the essential idea, the essential shape of it is not wrong. That's just an unavoidable shape. This is what, essentially what worship, what meaning looks like. If you want to have meaning, if you. If you want to not be scattered."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":1009.25,"end":1009.81,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":1009.81,"end":1011.41,"speaker":"Richard Rohlin","text":"Then this is what you have to do. Yeah."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":1011.41,"end":1040.11,"speaker":"Jonathan Pageau","text":"And it's important to know that, because what happens is people have readings in scripture and they'll see, for example, God telling the Israelites to take down the high places, to remove the sacred poles. And, like, so there's this. That language that's really there in scripture. But then they take it as a general rule that high places are wrong in themselves and that, you know, these. These pillars are wrong in themselves. And then you have the cross, and then you realize that the temple itself is actually on a mountain and that, you know, it's like. And then Moses goes up the mountain."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":1040.11,"end":1040.59,"speaker":"Richard Rohlin","text":"So you."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":1040.91,"end":1045.55,"speaker":"Jonathan Pageau","text":"You have to be able to understand the fullness of the symbolism to see when it's. When it's off and when it's wrong."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":1045.55,"end":1415.91,"speaker":"Richard Rohlin","text":"That's right. That's right. So I want to. So with that kind of said and with kind of putting in people's mind the polyvalence between the Tower of Babel and the idea of, like, a mountain, the mountain of God, the ziggurat, the stylite pillar, the. The candle offered in prayer. These are all kind of overlapping images. We. We can talk about the Tower of Babel in. In specific. And I've got here the. A copy. This is from Charles Worth's Old Testament Pseudepigrapha, a copy of the Book of Jubilees. And the traditions that I want to talk about today in reference to the Tower of Babel specifically come from the Book of Jubilees. So Jubilees is a. A text which is not in your Bible unless you're Ethiopian. And then it is. But this is not a problem. Yeah, lucky Ethiopians, they get all the good stuff. But. But I mean, this is not a problem for us because, of course, the. And actually, Father Stephen Young has a book called Apocrypha, which you can just go and read if you want to know about the reception of Jubilees in the Eastern Church. So go and read that. I'm not going to repeat all the things that he says there. But. But the thing to note is that it is quoted in the New Testament multiple times. There's one really cool example, which I'm gonna save for the conference people have to come because it's really awesome. But, but for instance, Jesus, you know, famously, Jesus quotes himself in Jubilees, right? So in Jubilees, the angel of the Lord, right, He's giving the law to Moses, but Jesus quotes that and says, basically, that was me, right? And so, yeah, so Jesus quotes himself in Jubilees. St. Peter quotes Jubilees, St. Stephen when he is giving his kind of summary of the Old Testament. In his sermon before he's stoned to death, he refers to traditions that are. If. If they didn't come from Jubilees, they came from the same place that the guy who wrote Jubilees got them. So anyway, all that to say. All that to say, um, it is. It is. It does have a place in our tradition and the account that's given in Jubilees of the building of the Tower of Babel. I'm not going to read the whole thing here, but I'll just kind of summarize it. So first of all, we get. We get the clarification, and that's how to think about Jubilees is. It's a sort of. It has a frame narrative, but it's. It's almost like a commentary on Genesis or it expands the parts of Genesis that you might, like, I wondered about, like, okay, Moses, you did not give me enough information here. What, what's going. So one of my favorite examples of this is, like, Judah's repentance after the Judah and Tamar incident, which is like this crazy thing that happens in Genesis. And then you're like, so how were family dynamics? What was that like after this? You know, exactly. Awkward, awkward, awkward Christmases and stuff together. So, so. But if, you know. So there's some details like that and some more details about how did Joseph resist temptation in Potiphar's house? And so on and so forth. So that's kind of what Jubilees is doing. And so we get a. An expansion here or just like kind of an explanation of what's going on with the Tower of Babel, which is that it's not just a tower, it's a city surrounding a tower. Right? So it's a tower in the center, and there's a city around it, and then there's a wall around the city. And this is something that you have to think about when you start to think about the descent of the city in the Apocalypse. Right. In the book of Revelation. Right, that, that. And I know that this is one of the key ideas that you've talked about in your videos over the years and probably worth revisiting because it might have been a while since people have really heard it or thought about it. But the idea of the city, right, and all these people in Genesis who go and build cities and what's going on there, but they take. They build it with the. The. The bitumen, right? The mortar that they use, they take it from the nearby sea. So this is another kind of important element of the symbolism here, because it's really the rising up of the dry land out of the sea. Right. And so in that way, it is a. It's an attempt to recreate the world. And of course, this is in the context of. It's just after the flood, humanity's been scattered. They don't want to be scattered again. If the floodwaters come, they need a, you know, like, a safe place to go. And so they build the city. And, you know, we get. The dimensions of the Tower of Babel here are given in Jubilees. The numbers are interesting. I don't know if they're significant. Um, I've never. I've never been able to. I. What I really want to find is a really old tradition that, like, attributes significance to the. The numbers, like the. So many cubits and so many stadia and so on and so forth, But I've never found it, so we'll pass over that for now. But it's surrounded by this wall, So a city with a tower in the center, or like a ziggurat in the center surrounded by a wall. And in the account that's given in Jubilees, Right. Obviously, the way that it's translated in most modern accounts of Genesis is weird. And it's. Because the Hebrew is super old and very difficult. Right. And so the way it's usually translated in English is something like, and now nothing will be impossible for them. Yeah, Right. And so the story gets turned into this kind of, like this retelling of. Of a narrative in which God is, like, trying to keep us from achieving our potential, essentially. Right. He's threatened by us. Right. The way that it's framed in Jubilees, I think is maybe a little more helpful, because what it says is the Lord looks down on what mankind is doing, actually looks on us as we finish, like, as. As the tower is finished, and says, now nothing will escape them. Right. And I think that's probably a much more helpful way of understanding what's going on with the Tower of Babel, because it's about this. This. The creation of a totalizing system. Right. The creation of something. Again, you think about the idea of like the pillar or the mountain fixing space in place. Right. And this is one that's so big, it's going to dominate over any other system."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":1416.15,"end":1430.23,"speaker":"Jonathan Pageau","text":"Yeah. And that's why the idea that they only have one language is part of this question. Like, it's. It's a. It is a. It's a tyranny in the. In the way that we ultimately get, you know, the final image of the totalizing system in Revelation."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":1430.23,"end":1430.47,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":1430.47,"end":1434.87,"speaker":"Jonathan Pageau","text":"It's like it tries to be one thing, and that's what God told them not to do."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":1435.19,"end":1470.85,"speaker":"Richard Rohlin","text":"Yes. So one of the things that we then get in the account in Jubilees is that after the confusion of the tongues. And we'll come back to the confusion of the tongues thing, because this relates in an important way to something that happens with Abraham later on in Jubilees. But after the confusion of the tongues, the Lord sends a wind, and the wind knocks over the tower and destroys it, which is not something you'll find in the Genesis account, but is very, very important for understanding the story in the way that the apostles understood it, which is the argument I'm gonna make in a second. Yeah."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":1470.85,"end":1478.49,"speaker":"Jonathan Pageau","text":"But it's interesting because if you ask most people, like, if the Tower of Babel fell, they'll probably say yes, but it doesn't say that in Scripture."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":1478.49,"end":1611.84,"speaker":"Richard Rohlin","text":"Right. I think that I always, you know, say the way that I absorbed the story and people talking about the story growing up, I always sort of thought, well, they were like, halfway building it and then just abandoned it and it fell apart. Right. Yeah. But this is the tradition in Jubilees is that the tower is actually completed, and then a wind comes and blows it over. I would love someday just to talk about the symbolism of wind, because it's a weird thing. Like, wind is. Is obviously, it's, like, related to the idea of chaos. Right. And storms and all so, so on and so forth. But it's. It's unique because it comes from above. And one of the interesting things about. In the Old Testament, especially when you're going through Leviticus and so on, and you're getting like, don't do this awful thing. Don't do this awful thing. All of these things, which we're essentially now in our society and. But. But certain kinds of sins, it says if you do this, the land will spit you out. And then other sins, importantly, idolatry says if you do this, then God will scatter you. And so it's like some sins are gonna cause the potential that's beneath you to actually reject you. Right. Because It. Because the. And there are always things that have to do with, let's say, like, the fertility of the land. Right. Like, there are always sins that render what's below us infertile. And then there are other sins that are, let's say, like, this is like a. This is, this is something I was thinking about literally just last night, and I'm so. I haven't tried to express it before, but it's something like there are other sins and, and again, in particular, idolatry, that's. That's about looking upwards and, and, and the way that you should be, you know, the way your focus should be. Right. That focus, that altar, that flame at the top of the structure, when that's directed wrongly, then. Then. Then you get the wind, right? So there's like the floodwaters or the land spitting you out or something like that. And then there's the, the wind, the scattering that comes from above."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":1611.84,"end":1651.57,"speaker":"Jonathan Pageau","text":"Yeah. So it's, it's really the same thing that you see in Genesis in the. The fall, because it's pride, really. Idolatry is a form of pride because it's. It's trying to capture everything in. In a, in an object or an idea. It's. It's like trying to capture everything into one and not understanding that all things have to be transparent and have to be vehicles for something that is higher. And so when humans take the root for themselves, they try. They kind of. They. They think about it like something that tries to crystallize too much, and it becomes. It becomes brittle because it, it tries to hold it all together. And, and so then you. You blow on it and it shatters because it's too. It's brittle."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":1652.13,"end":1829.85,"speaker":"Richard Rohlin","text":"And so in the Book of Jubilees, the Tower of Babel is specifically associated with idolatry. And this is really easy to see, for instance, if you look at the passage immediately before it and the passage immediately after it, which are both about idolatry and the evil spirits. Right? And so in Jubilees, I mean, Jubilees follows the same tradition that Enoch does concerning the sons of God and the daughters of men and so forth. So after the flood, you've got all these evil spirits running around, and essentially they're tormenting Noah's children and grandchildren. And so Noah prays to God, and God binds nine, ten of them and puts them in Tartarus, and then he allows one tenth of the evil spirits to continue to roam the world and basically test mankind. Right? And so. And so Mastema is the, you know, or sometimes also the word Satan is also used in Jubilees, but is kind of like the leader of the evil spirits. And. And the writer of Jubilees makes it very clear that he's the one that's kind of instigating all of this with mankind. And so there's a lot of stuff in Jubilees, in the passage immediately following this about Abraham and about how Abraham is the first person since the. The fall of the Tower of Babel to really worship God. And one of the. One of the great acts which he does is he goes, he destroys his father's idols, and in a way that's kind of reminiscent of what Gideon does in the Book of Judges. And this is a tradition that actually gets expanded upon later in Judaism. But it's very clear that for the writer of Jubilees, idolatry is. Is at the heart. It's at the center of what's going on with the Tower of Babel. And so that's why there's this wind that comes, overthrows the tower and scatters it. And essentially what happens in Jubilees is that after the fall of the Tower of Babel, of course, you get the confusion of the tongues, and the world descends into chaos and idolatry. And what it says is everybody leaves and start building their own cities and towers. This is what Jubilee says. So it's like with the collapse of the one sort of mega structure, everybody goes and starts trying to build their own. And then they, they, they. They go to war with each other, right? Because it becomes this because everyone's trying to do Babel again themselves. But now, because there's no unity of tongues, because there's no unity of, like, opinion or approach or whatever, that you get all of these competing towers, all these competing attempts at idolatry and worship. And one of the things that Jubilee says is that at this time, people, that the. The building of these multiple competing cities and towers are accompanied with the. In the increase of what you could call, like, bespoke religions, right? So everybody starts making their own idol, they start making their own altar, they start making their own ziggurat, they start making their own city. Like, all that stuff goes together. And that's basically, you know, that. That causes the. The. The loss of the knowledge, the true knowledge of God. And then also for the writer of Jubilees, the loss of the Hebrew language. Hmm."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":1829.85,"end":1833.61,"speaker":"Jonathan Pageau","text":"And so the loss of the he. So the Hebrew language was the one language."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":1833.93,"end":1876.03,"speaker":"Richard Rohlin","text":"This is. This is. This is what Jubilees has. And it's a little tricky depending on how you word it, or basically how you translate a couple of words that either Hebrew was lost immediately after Adam fell or it was lost after the tower of Babel. But I think it's the. I think it's the latter. Basically. Sometimes people will say there's a reference to the fall, and it says nobody has spoken Hebrew since the Fall. Right. And the question is the fall of what? Right. Well, there's a modern approach that says that the only. That basically Adam's sin is the only fall. Right. But that's not how people saw things in the time of Jubilees. And I think that basically, if they're."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":1876.03,"end":1877.35,"speaker":"Jonathan Pageau","text":"Talking about the tower falling."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":1877.43,"end":2034.9,"speaker":"Richard Rohlin","text":"Right. That the tower falling, but also that the tower of Babel was seen as one of the falls of man. Right. And that. And that it is the ling. It is the specifically linguistic fall. And there are a couple of other things in the text that I would argue, really, really argue for. It's talking about Babel. And by the. This is a common belief in the ancient world, though, in, obviously in Judaism and in Christianity, this. This idea that that Hebrew is. Was sort of like the Adamic tongue. Unless you ask Albanians, they'll say it's Albanian. But anyway, actually, this. This was an argument that some Albanian philologists tried to make in the eight. The. The. The 19th century, really, that Albanian was the origin. Albanian is the original language. And anyway, that's some bold stuff. Well, if you know anything about Albanian national pride, it's not even a little bit surprising. My joke is that even the King James Bible was originally written in Albania. Anyway, no, no, hate, by the way, for any Albanians listening to this. I love you guys, but anyway, it's just. Just a joke. But anyway, actually, if there are Albanians watching this prepper, like, yeah, gosh darn it, it was originally written in Albanian. But anyway, um, so you have the. The loss of the true knowledge of God. And for the writer of Jubilees, that's the same as the loss of the Hebrew language. Yeah, Right. So he really equates those two things together. And one of the other things that happens at this time is, of course, that Ham's son Canaan seizes the land that was originally fell to the sons of Shem by lot. So there's this earlier, a little early on in the story, after the Flood, there's this. This place where basically they're. They're drawing lots for. For which son of Noah goes where, right? And the land of, basically the Holy Land, the Levant, falls to the descendants of Shem, and then Canaan seizes it for himself. Yeah. And he. When he seizes it for himself, this, this. Basically everybody says, don't do that. You're gonna be punished by God. Right. And so this is setting up like the conquest, right, In. In. In the book of Joshua and also the curse of Ham in Genesis. In Genesis. In Jubilees, it's associated with. With this. So. So then the kind of, like, to close out the Jubilees kind of Babel narrative, I mentioned Abraham. So Abraham in Jubilees comes just a little bit after the Tower of Babel. There are actually other traditions that are a little bit later. And when I say a little bit later, I still mean, you know, first, second century, that will. Will. Will have Abraham actually present at the time of the building of the Tower of Babel."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":2034.9,"end":2035.54,"speaker":"Jonathan Pageau","text":"Oh, really?"}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":2036.26,"end":2046.58,"speaker":"Richard Rohlin","text":"Yeah, yeah. And. And, like, have him interacting with Nimrod. And so, like, when he destroys his father's idols, he gets hauled before Nimrod and he's going to be executed. But then God delivers him and all this other stuff."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":2046.58,"end":2047.62,"speaker":"Jonathan Pageau","text":"This is in Jubilee?"}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":2048.18,"end":2136.01,"speaker":"Richard Rohlin","text":"No, that's in. That's in Jasher, though. Yeah. We were talking about earlier. But anyway, yeah, so that's. So there are other. There are other traditions that will place him, like, basically present at the fall of the Tower of B. Of Babel. But that's not in Jubilees. Jubilees has him coming on, like, just maybe a little bit after, but certainly as a. As a kind of like a contemporary of Nimrod and of all these other people. Yeah, yeah. So because of his piety, we are told that Abraham. That God sends an angel to open Abraham's mouth and ears so that he can understand Hebrew, which is the language of the heavenly law. So one of the main ideas of Jubilees is that when the law is given to Moses, God's not just like, making it up like that. That the law, like when the Torah is given to Moses and all the. The worship and all these things that. That he's giving. He's giving. Christ is giving to Moses what's already in heaven. Right? That's a. Like, it's a. It's. So the law is written on heavenly tablets first, and then he gives those to Moses. The law that. That even the. This is a little bit of a spoiler for my talk. But even the feasts, even the feasts of the. Of the old tabernacle and we would actually say of the church were already things being celebrated in heaven for the writer of Jubilees that are then given to humans because it's a way to participate in the heavenly order. And this is why Jubilees is like, really obsessed with the idea of the calendar and all this other stuff."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":2136.01,"end":2142.31,"speaker":"Jonathan Pageau","text":"So, so, so basically there's already this idea that in the feast are heavenly feasts."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":2142.55,"end":2145.51,"speaker":"Richard Rohlin","text":"Yes. But you or. This is my talk."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":2145.59,"end":2146.31,"speaker":"Jonathan Pageau","text":"Oh, sorry."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":2146.47,"end":2147.19,"speaker":"Richard Rohlin","text":"No, it's okay."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":2147.19,"end":2147.47,"speaker":"Jonathan Pageau","text":"Sorry."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":2147.47,"end":2148.39,"speaker":"Richard Rohlin","text":"It's okay. It's okay."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":2148.39,"end":2149.43,"speaker":"Jonathan Pageau","text":"Well, it's a really great."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":2149.51,"end":2161.91,"speaker":"Richard Rohlin","text":"It's amazing. Really cool. It's really cool stuff. Please come to the Symbolic World Conference or buy the virtual ticket or something, because I'm going to tell you some things that are going to be really, really, really cool. So, yeah, people got to come."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":2161.91,"end":2235.92,"speaker":"Jonathan Pageau","text":"But I want to say one thing about, about the idea just, just before we continue, because the idea of the wind blowing down the tower and the wind scattering, I think it's important to understand it. It's related to the idea of symbolism, the way we talked about it, which is the position of things that ontologically there's a. There's a place where they are in a kind of map. Think about it that way. And sometimes the. The effect or the relationship can even be opposite. They can even be the contrary to one to the other. But if you understand their place and you can see what's happening. So, right, the idea that the spirit is blown into the. In gathering of the dust in order to create Adam, right? That's the origin of the. Of. Of man. And then you can imagine that you could think about it like either God takes the breath out, right? And then the dust goes back to dust. But it still works if you think God also blows on it and then scatters the. The dust. And so, but it's. It really is about the idea that God's breath and God's spirit is, Is what is holding or scattering the, The. The phenomena and anything that has identity. It's like basically it's. It's. It's in God's will that all things are held together."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":2235.92,"end":2467.39,"speaker":"Richard Rohlin","text":"You know, So I have to go off script here because you're talking about this, and I feel like. I feel like we should talk about the crows. Okay, so in the book of Jubilees, in between, actually in the, the transition, transitory passage, like coming, the transition from talking about the Tower of Babel to talking about Abraham, we get crows. And let's see here. So when. When. When Tara or Terah, Abraham's father, when he's born, it is marked by a devastation of crows. It says, and Prince Mastema, this is the devil, essentially, right? Sent crows and birds so that they might eat the seed which was being sown in the earth in order to spoil the earth so that they might rob mankind of their labors. Before they plowed the seed, the crows picked it off the surface of the earth. And therefore he called them, called him Tera, because the, the crows and birds were impoverishing them and they ate their seed. And the years began being barren because of the birds. And they ate all of the fruit of the trees from the groves. If they were ever able to save a little from all the fruit of the earth in their days, it was with great effort. So then Abraham is born. And Abraham is born. And he is born with. He's pious to the point that even when he was two weeks old, you know, that he refuses to worship the idols, right? And it says that he began to pray to the Creator of also that he might save him from the straying of the sons of men, and so that his portion might not fall into straying after pollution and scorn. And then the next part is Abraham versus the crows, which I think is maybe, you know, not something most of us woke up this morning thinking about. I mean, I did because I was getting ready for this video and I was like, we're probably not going to talk about the crows because it's a little off topic. But then you started talking about the scattering. And, and this is clearly what's going on here, right? And so, so basically what happens is that Abram, when he goes out, he. When he's 14 years old, he is trying to plant and the crows are coming after him and they're trying to get the seed and he's. He's scaring them away. And eventually what he does is he comes up with a way to plant the seed and he does this through a use of technique. Right? And so, I mean, this is the other kind of thing that's going on is the. In Jubilees, as an Enoch, right? The, the technology comes from like the demons, but then there are these uses of technology that are like, counter to the activity of the demons. I'll give you another example is that earlier on, when Noah is like dealing with all the demons that are plaguing his family, he's basically given the knowledge of how to use herbs from the earth to counteract the, basically the diseases that the demons are. So he's given like medicine, Pharmakea, right? You know, which is like medicine, but also sorcery. Right? And, and, and so this is one of the things that Noah is given this knowledge to essentially counteract what the demons are doing. I assume it was essential oils. But anyway, anyway, Homeopathy. Yeah, homeopathy. So now, Abraham, what it. The way that Abraham solves this is that in the first year of the fifth week, Abram taught those who were making the implements for oxen, the skilled carpenters, and they made implements above the ground facing the handle of the plow so that they might place seed upon it, and the seed would go down from within it onto the point of the plow, and it would be hidden in the earth. And therefore, they were not afraid of the crows, and they did likewise upon all the plow handles above the ground, and they sowed and tilled all of the earth just as Abram commanded them, and therefore they were not afraid of the birds. And so this basically solves the crow problem."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":2469.23,"end":2474.67,"speaker":"Jonathan Pageau","text":"That's a really. I mean, it's a really interesting image because again, we can see how this structure."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":2474.67,"end":2474.99,"speaker":"Richard Rohlin","text":"Right."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":2474.99,"end":2479.07,"speaker":"Jonathan Pageau","text":"And I've mentioned this before, but the idea that heaven is only good, right?"}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":2479.31,"end":2479.79,"speaker":"Richard Rohlin","text":"Yes."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":2479.79,"end":2483.95,"speaker":"Jonathan Pageau","text":"Sometimes heaven is dangerous because it takes meaning away."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":2484.19,"end":2484.51,"speaker":"Richard Rohlin","text":"Right?"}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":2484.51,"end":2513.84,"speaker":"Jonathan Pageau","text":"It takes the seed. It takes the seed away from the. From the earth. That's a good example. But sometimes that's a good thing that God does that to destroy a world. For example, when he takes Elijah and he takes Enoch. When he takes Enoch away from the earth, he's basically saying, all right, I'm going to take the best away from you guys. Sorry. I'm taking the seed out, and now the thing is going to crumble. It's like I'm taking the breath out of a person. I'm taking the saint out of the world so that now the world will crumble. That's what happened with Elijah, too."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":2514.16,"end":2542.57,"speaker":"Richard Rohlin","text":"There's. There's a. People forget that one of the names for the enemy is the prince and power of the air. Yeah. Right. And. And that's clearly. I mean, that's what's going on with. With mastomy here, which is the. The name of the enemy in this passage, Right. Is that he's. He sends the crows. Right. Which are. Which are of the air. Right. And so they're. They're heavenly in that way. But then also crows are. You know, they. They eat dead things, you know."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":2543.85,"end":2544.25,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":2544.25,"end":2547.21,"speaker":"Richard Rohlin","text":"Which also has an interesting connection to the story of Elijah. But anyway, it's."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":2547.21,"end":2547.53,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":2547.53,"end":2548.41,"speaker":"Richard Rohlin","text":"But it's."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":2548.49,"end":2549.53,"speaker":"Jonathan Pageau","text":"It's like we could go."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":2549.85,"end":2551.05,"speaker":"Richard Rohlin","text":"I know, I know."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":2551.21,"end":2552.33,"speaker":"Jonathan Pageau","text":"Let's go back to Babel."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":2552.41,"end":2763.39,"speaker":"Richard Rohlin","text":"All right, so we'll go back to Babel. All right. So the last thing that I want to mention here is basically right after this incident, because of Abraham's piety. So he's fighting against the work of the works of the evil one, right? And he's refusing to worship the idols and so on and so forth that God opens his ears and his mouth so that he could understand Hebrew. And when he does this, he's able to read the books of his father. So his father Terah has the books which are basically the law of God, and they're in Hebrew. And of course, these have been basically been passed down from Enoch, but Terah can't read them because he can't read Hebrew and he's worshiping idols, right? And so basically this gives Abram the secret knowledge, which is actually the knowledge of the calendar. It's the knowledge of the feasts which he's supposed to celebrate. It's the knowledge of circumcision and all these other things that this, this is going to give him that knowledge so that he can essentially rightly order the world. And one of the things that I want to mention here when we talk about Abraham's mouth and ears being opened so that he can understand Hebrew, right? That. And again, the Lord of Spirits guys have done a whole bunch of stuff on this. But the sort of. The last thing you do in the ancient world when you build a temple is to. There's a. Basically perform a ritual to open the nostrils of the. Of the idol and basically so that the spirit of the God that you're worshiping can inhabit it. And there are examples. We have a, like, basically a liturgy for this from ancient Egypt, for instance. But. And of course, you can draw a lot of parallels to like the creation of the world in Genesis with man being the final thing that happens and God breathes into him and opens his nostrils, right? So here's Abraham's mouth and ears being opened so that he can essentially become the focal point for the worship of the one true God, right? And then. And then when he does this, when, when this happens, he is able to. And it's the same. It's exactly the same thing as him being able to save the seed, right? Because what he ends up doing is, is now there's this, this. This hidden seed, which is the law of God, which has been hidden and lost and forgotten, but he's able to actually use that to begin to rightly order the world. And then that basically is the introduction to Abram. And from there it goes into the story of Abram as you basically know it from Genesis, although with a lot more sort of calendar stuff thrown in. So with all of this Said with everybody kind of thinking about along these terms, what I want to do is talk really briefly about Pentecost. Now, Pentecost is Shavuot. It's one of the, it's the feast of the First Fruits. It's one of the Old Testament feasts that we continue to celebrate in the church today. And again, a little bit of a spoiler, but if you read in Jubilees, you'll see that they were celebrating this in heaven first, which is, which is going to be. There's a lot of interesting things there that we'll talk about. But the Feast of the First Fruits, right, is one of the most important feasts in Jubilees. It's commanded and celebrated first in heaven, and essentially it celebrates the renewal of a covenant. So the first time that it's commanded for humans is after Noah offers the sacrifice following the following the flood. Right. So he gets, gets out of the ark and offers a bunch of animals to sacrifice, and God smells the sacrifice and is pleasing to him, and he institutes the feast of the first fruits for those on earth. But it's. The idea is the angels are already celebrating it in heaven. Right."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":2764.27,"end":2772.99,"speaker":"Jonathan Pageau","text":"And there's no hint of that in scripture, though. This is really from Jubilee, the idea that, that, that Pentecost is when Noah offered the sacrifice."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":2773.23,"end":2789.43,"speaker":"Richard Rohlin","text":"Well, Pentecost, you could say historically used in the worst sense possible, but you could say, like, historically, it celebrates the giving of a lot. Because this is what I mean, this is what Pentecost celebrates is the giving of the law to the people of Israel. But, but remember that the."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":2789.43,"end":2790.67,"speaker":"Jonathan Pageau","text":"There's a no Addict law."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":2790.67,"end":3152.04,"speaker":"Richard Rohlin","text":"There's a. Yeah, yeah, there's, there's. There's already a covenant. Right. There's already a law and a covenant that's given to Noah. And basically the whole premise of Jubilees is that when Moses is given the law, it's not like some new thing. Yeah. But that it is actually a revelation of who God has always been. And, and by the way, this is still, as Christians, this is how we understand the law, not as something that is prescriptive, but it's something that is descriptive. Right. Something that describes this is what God is like. And if you sort of align yourself on this pattern, then your world will cohere. Right. And if you don't, then you'll be scattered or the land will vomit you out, et cetera, et cetera. Right. And so, and so it's celebrated again in Jubilees with the giving of law, which, which you have to remember that is, is the frame Narrative for all of Jubilees is the word giving the law, which includes Genesis. Genesis is part of the law. It's one of the five books of the law, right? The word giving the law to Moses on Sinai. And so everything is told in the first person or. But it's the angel speaking, right? The angel of the Lord. He's. He's telling. And then I did this, and then I told Noah this, and then I told Enoch this, and then I told Moses, you know, so on. And so. So, so that's the frame of Jubilees is. Is the actual giving of the law. So the thing that Pentecost celebrates is the giving of the law, which is what Jubilees is. Is all about. And so it's this really significant feast all throughout the book of Jubilees. And it's a. At some. It's sometimes referred to as like a. The twofold celebration or the celebration that has two aspects. And it's. This is as far as I've been able to find. This is never explained in Jubilees, but I think it's something like that. The giving of the covenant is given twice. The law is given twice. First to Noah and then to Moses, something like that. But all this to say it's the most important feast in Jubilees and we get some. Anyway, there are some really fun connections that again, I'm going to save for my talk. But essentially what I think everybody knows, or maybe not everybody knows, but everybody could know, you know, if you go to church on the night, you know, Saturday night before Pentecost, right? Is that Pentecost is an inversion of Babel. So Pentecost is the first of feast of first fruits. But the church sees it and has really always treated it and seen it. I'm going to argue all the way back to the Book of Acts has seen it as a reverse of the curse of Babel. So the apostles are all gathered together. Where are they gathered? They're gathered in a city on a mountain, in an upper room, right? And at the top of that room, they are creating an altar, a focus point, right? And that is that they are gathered together, I'm gonna say, to serve the liturgy. There's a very ancient tradition that is still. You can still find in like the Malankara churches, like the Syrian churches, the Coptic church, and so on and so forth. There's a very ancient tradition that when the churches gather together in the upper room, you know, it's. And it's an upper room, it's not a basement. They're gathered together in the Upper room to serve the liturgy, that when they're gathered together, that they are serving the Divine Liturgy for the first time. Now, somebody out there wants to say, well, we don't know. We don't have a single liturgy written down from the first century, blah, blah, blah. I'm. This is the tradition, though. This is the tradition. And certainly, you know, the liturgy of St. James, who was the first bishop of Jerusalem, is, most people agree, is the oldest Christian liturgy that we have. And so the. The tradition is that they're serving the liturgy together for the very first time since the resurrection, and that the Lord appeared after his resurrection to James and some of the other apostles and essentially gave them the liturgy. So St. James is serving the liturgy there as the first bishop in Jerusalem in the upper room, and during the anaphora, which is the moment in the liturgy, when we call the Holy Spirit down upon the gifts on the altar, that. That's when the Holy Spirit comes down at Pentecost. And this is still. Still in our liturgy, by the way. Like the. Right before the anaphora, the priest prays, and you can't hear it if you're out in the nave because it's said quietly, but the priest prays, you know, oh, Lord, as you sent down your Holy Spirit on the apostles, right? Take him not away from us, and so on and so forth, right? And so there's this. So there's this calling down of the Holy Spirit, um, with a reference to Pentecost that happens right before that part of the liturgy. So anyway, if. Even if you're, you know, you want to argue, it's impossible to prove any of this, like, textually or whatever. I'm just saying this is the tradition, and it's a tradition that is still implicit in the. The liturgy of all of the Eastern churches. Okay? And. And so as he calls down the Holy Spirit, the Holy Spirit descends. And it descends not just on the gifts, but but upon the whole church, which is, by the way, it's what we always ask for. Send down your Holy Spirit upon us, and upon these gifts set forth. Right? And so the Holy Spirit comes down. And how does he come down? He comes down as a wind, right? Which is this really important aspect of the Babel story as it's told in Jubilees. The Holy Spirit comes down as a wind and tongues of fire, right. The. Which is. Which is. I mean, they become candles. I don't know how. It's the. Say it, right? The. The tongues of fire come, and they hover over the heads of each of the apostles and over the head of the Mother of God, who is also present there in. In the book of Acts. And they make each of the apostles into a tower or a candle or a pillar, like, however you want to think about it. Right. That's exactly what is. Is happening there. And then what happens is that the tongues. The confusion of tongues is resolved. And it's very tricky in the text, actually, how it is resolved because it sounds at one point like the apostles are just speaking in, you know, probably Aramaic, but then everybody's hearing it in their own tongue. But then some people can't understand what's going on. And those people who can't understand what's going on, they just hear what? They hear Babel."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":3152.12,"end":3152.76,"speaker":"Jonathan Pageau","text":"That's right."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":3153.24,"end":3221.71,"speaker":"Richard Rohlin","text":"They hear Babel and they accuse the apostles of being drunk. And I will just say this is another video, but there is some weird stuff going on with Pentecost and the symbolism of, like, Pentecost and its relation to drunkenness. I mean, I'll just give an example. So the Pentecost is a celebration of the giving of the law and the giving of the covenant. Right. So the first time in Jubilees that this happens is after the flood. So Noah. Noah plants a vine and gets drunk. And he gets drunk. And then the second time that this happens is on Sinai, Moses receives the law and he comes down the mountain, and everybody's drunk. Yeah, right. And then the third time is when the Holy Spirit comes and he gives us the law of flesh in our own hearts. And the apostles begin to prophesy and the people who can't understand them. And this is a weird thing about the miracle. Like, it's not just that some. That it's not that everybody can understand them. The people whose hearts are ready, they understand in their own tongue. But for everybody else, it sounds like Babel. And those people, again, accuse them of drunkenness. There's something about this descent. Yeah, yeah. Like drunkenness at the bottom. I don't know. This is. This is."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":3221.71,"end":3254.1,"speaker":"Jonathan Pageau","text":"Yeah. No, but the way to understand it is to understand what Pentecost is doing is something similar to what the crucifixion is doing, is that it is collapsing all the symbolism into one place, and it's basically gathering it. It together in a way that it both resolves the whole question, but also does it in a way that if you try to capture it in your mind, you really struggle to hold all the pieces together. Because like you said, it's like. Is the Holy Spirit scattering them? The answer is yes."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":3254.1,"end":3257.66,"speaker":"Richard Rohlin","text":"Yeah. Because he's going to scatter them to the four corners of the world. Yeah."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":3257.66,"end":3308.34,"speaker":"Jonathan Pageau","text":"And is the Holy Spirit gathering them? The answer is yes, of course they are, because they're all speaking in one mind and in one. In one voice, but everybody's hearing them in their particular voice. And so what it's doing. And also there's confusion on the edges. And so it's actually a cosmic image of the whole thing simultaneously, both the uniting of Babel and the splintering of Babel and the confusion of it, but all done in a manner that transforms it into a proper hierarchy, like an actual true hierarchy of unity in the togetherness of multiplicity, in the way in which it can contact it, relate to the particular, but then even room for a kind of chaos and fluidity on the edge. So it's like it's recasting the entire world in that moment."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":3308.82,"end":3528.27,"speaker":"Richard Rohlin","text":"And in this way we see the way that the saints become the pillars that are now upholding the world and uniting heaven to earth together. And like, each one of them becomes that little image of the candle or the tower or the mountain or. Or whatever it is, right? And even like in our. Our hypnography in the Orthodox Church, we often refer to the Mother of God as being like the. The. The. The, you know, the uncut mountain, right? Like, like, like as being the mountain of God, you know, and then, you know, the. Basically the place where God makes himself known, the place where he's manifest and. But every single member of the church is supposed to be that, right? And so you have that happening at Pentecost. I'll just kind of close this out by saying two things. One is that thinking back to Abraham's mouth and ears being opened so that he can understand the law of God, right? That this is really. This is what's going on. But now it's not just Hebrew, right? It's the idea that there's. There's a. It's not about the language, right? It's. But it's about the content, right? But our mouths and ears are open so that we then become the sons of Abraham, right? That's the. That's the kind of the key image there. And then the other thing that I want to do is, is just to. To show that the. I mean, at this. I don't see how you could like, see, see the, the connection, the very careful order of the story in the Book of Acts and say that this is. That the connection to Babel is arbitrary. But in case anybody was wondering, did the ancient Church make these connections as well. I have. This is. This is my big, big pentacost pentecostarion, which is like all of our. Our hymns, the ancient hymns and the stuff around Pascha and Pentecost is our, essentially our most ancient hymnography in the Orthodox Church. We're talking about most of this stuff going back to third and fourth century. Okay, I'll just read a couple of hymns. This. These are from. These are from vespers. I'll read one from vespers and one. One from matins for the feast of Pentecost. Says of old, the tongues were confounded because of the audacity in the building of the tower. But now the tongues are made wise for the sake of the glory of divine knowledge. So there's this connection there with. With the divine knowledge. And that goes back to this. I'm going to argue that goes back to this tradition with Abraham. There God condemned the impious because of their offense. And here Christ hath enlightened the fishermen by the Spirit. At the time, the confusion. At that time, the confusion of tongues was wrought for punishment. But now the concord of tongues hath been inaugurated for the salvation of souls. And then also the hymns, even in Greek, they do make a lot of puns between the confusion of tongues and in the tongues of fire. Yeah, right. That's like. People really like that pun in the ancient world. It says, once when he descended and confounded the tongues, the Most High divided the nations. And when he divided the tongues of fire, he called all men into unity. So, like, there was like one tongue and then division, and now there's a division of tongues because it's the tongues of fire. But that actually brings us into unity. He called all men into unity. With one accord we glorify the all Holy Spirit. So there's actually a lot more in the hypnography of Pentecost, but I thought I would just read a couple of examples to show that how. It's really. What I'm arguing for is how we have always, like in our tradition, this is how we've. We've always read the Scriptures, right? And this is going to be basically what we're going to be talking about at the conference, at least in my track, is we're going to be looking at some other ways that the church has always read and understood Genesis and the way that it actually affects the way that we still think about God, who He is, how we worship him, what it means to serve him today. So anyway, that's my. That's my pitch for come to the summit, or at least get the ticket."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":3528.27,"end":3530.79,"speaker":"Jonathan Pageau","text":"And get the virtual ticket. So thanks, Richard."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":3530.79,"end":3531.31,"speaker":"Richard Rohlin","text":"This is awesome."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":3531.86,"end":3564.99,"speaker":"Jonathan Pageau","text":"I mean, I see a lot of amazing things in the future, everybody. You know, Richard and I already, as we try to get through this logistical chaos, we're all already planning out all these wonderful stories of how to connect the ancient stories with modern storytelling tropes with, you know, we won't. We won't spoil what we're going to do, but it's going to be. It's going to be wonderful. So, everybody, thanks for your attention. Thanks for supporting everything we do. Hopefully we'll see some of you at the summit, and if not, there will also be online places to discuss the summit if you get the virtual ticket, like, we'll have spaces where people can."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":3564.99,"end":3568.35,"speaker":"Richard Rohlin","text":"And I think that we're going to do like some kind of, like a big live."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":3568.35,"end":3570.43,"speaker":"Jonathan Pageau","text":"Yeah, we'll do a live thing after at the end."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":3570.43,"end":3571.07,"speaker":"Richard Rohlin","text":"Yeah. So."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":3571.39,"end":3572.99,"speaker":"Jonathan Pageau","text":"All right, everybody, thanks for your attention."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":3573.15,"end":3574.43,"speaker":"Richard Rohlin","text":"Thanks, everyone. Bye."}
{"episode_id":"SW - #331 - 2024-03-09 - Richard Rohlin - Universal History - The Tower of Babel","start":3574.43,"end":3590.58,"speaker":"Jonathan Pageau","text":"Bye. If you enjoy these videos and podcasts, please go to the symbolicworld.com website and see how you can support what we're doing. There are multiple subscriber tiers with perks. There are apparel and books to purchase, so go to thesymbolicworld.com and thank you for your support."}
