{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":0.4,"end":95.92,"speaker":"Jonathan Pageau","text":"I'd like to welcome you to the Symbolic World podcast. On this episode, I'll be playing for you an interview that I gave for a movie that is slowly being put together called Better Left Unsaid. This movie is about when the political left wing goes too far in the video. We don't talk that much about politics anyways, but I found that this discussion was one of the most far reaching discussions that I've had in that the interviewer was. Was extremely good at bringing about some ideas and helping me put them together in a way. So I really did enjoy this interview and so I hope that you enjoy it as well as you know, everything I'm doing here on the podcast. The videos is all thanks to your support. So if you like what I'm doing, please consider going to the symbolicworld.com support where you'll find ways to help out the podcast for all the people who are supporting. I offer, you know, early access to videos at some tiers. You can ask questions in advance for the Q and A. You can have discussions with me, enter into these small private groups that I am leading every month. But ultimately I am also making a video only for patrons once a month that is an interpretation of a traditional story. And so I've been having a lot of fun doing that and I hope you will enjoy those videos as well. This is Jonathan Peugeot. Welcome to the Symbolic World."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":106.2,"end":158.21,"speaker":"Curt Jaimungal","text":"A few weeks ago I had a conversation with Jonathan Pageau and you'll see that we're in his basement having a conversation of which so much of it will end up going in the documentary. This interview, by the way, is for. This conversation is for a documentary called Better Left Unsaid, which is all about answering the question, when does the left go too far? Jonathan's basement got flooded because if you follow the news in Ottawa, there is a huge flood just a few weeks ago. So none of what you see is around anymore. It's completely rotted and underwater. And there's a GoFundMe page in the description for you to donate to him so that he can get some semblance of a life back. The conversation that we had has so many nuggets of gold that I want to just put the. I want to make my whole documentary just this conversation, but I'm putting it online here for you instead. And I'll select the best parts and put it in the documentary."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":158.58,"end":158.98,"speaker":"Jonathan Pageau","text":"Enjoy."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":159.06,"end":165.9,"speaker":"Curt Jaimungal","text":"So I'm here with the preeminent, the exigent, the pivotal Paramount."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":165.9,"end":166.66,"speaker":"Jonathan Pageau","text":"Paramount."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":166.74,"end":173.7,"speaker":"Curt Jaimungal","text":"Jonathan Pageau, artist, carver, public speaker, symbolic translator."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":173.7,"end":175.22,"speaker":"Jonathan Pageau","text":"I guess yeah, you could say that."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":175.22,"end":181.46,"speaker":"Curt Jaimungal","text":"Something like that. Why don't you just tell me about what you do? Tell everybody about what you do, but tell me."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":181.62,"end":257.77,"speaker":"Jonathan Pageau","text":"All right. Well, I. I'm mostly an artist. I make religious art, liturgical art, you could call it, in the Orthodox tradition, but in general, in, let's say, the kind of Christian medieval tradition. And that has led me to look into symbolism in the Christian tradition, but also in general looking at other religions, other traditions, but through other types of storytelling as well, fairy tales, mythology, and now modern storytelling, such as movies and novels and everything. And so looking into symbolic structures relating to my art has led me to becoming interested in symbolism in general. And so in my daily practice in making icons, I engage in that world, let's say, that symbolic world through my art making. And then the way that. That art integrates into the life of a church and in the life of a community is also part of that. But then now, for the past, I guess, two years now, I've been doing a lot more of public speaking to talking about symbolism in general, how it relates to our life, how its structures inform our perception of reality and our interaction with reality. So that's what I've been doing through YouTube, but also doing a lot of public speaking all over North America for the past two years now."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":257.77,"end":268.05,"speaker":"Curt Jaimungal","text":"So you said that you got started because you were an artist, and so you started studying the symbolic representations and what they mean. But give me a timeline of your life. So you were four years old and you started this, and then you were."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":268.05,"end":295.51,"speaker":"Jonathan Pageau","text":"Well, I know I. When I was young, I always kind of knew I was going to be an artist from when I was pretty young. But then I was also. My parents were a Christian. I was a Christian. I was part of an evangelical church. And then when I studied in college, when I studied at Concordia University, painting and drawing, I really hit a wall. It was just contemporary art is an art which is very removed from what it's doing. You know, it's like a comment upon a comment upon a comment."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":296.07,"end":298.15,"speaker":"Curt Jaimungal","text":"Is that another word for modern art or is that different?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":298.37,"end":330.01,"speaker":"Jonathan Pageau","text":"Well, contemporary art, you would say you could use modern for the whole period, but usually we use the word modern for the early 20th century up to about World War II. And then after World War II, we start to talk about moving towards what we could call postmodern art or contemporary art, which is even more, let's say, removed from more. Like I said, a comment upon a comment, it becomes about art itself. It becomes a kind of circular playing with elements."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":330.73,"end":332.81,"speaker":"Curt Jaimungal","text":"So the art Piece of art that was just a urinal."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":333.53,"end":410.17,"speaker":"Jonathan Pageau","text":"Yes, well, that was modern. That was modern. But Duchamp, who made that urinal, is seen as one of the seminal figures in bringing about what would be today installation art and contemporary art. So there are certain figures in modernism which lead into what we now consider people like Jeff Koons or Andy Warhol. You know, they take their drive from people like Marcel Duchamp at the beginning of the century. So it was already, already there at the beginning of the century. Let's say everything was kind of packaged up and then it unfurled itself into. Now the kind of, on one hand anything goes, but on the other hand, everything has to be packaged in a kind of post cynical, you know, ironic double irony, triple irony. So that's really what it is. So it was very difficult for me coming in as someone who wanted to connect with reality, you know, who, as a person of faith. I wanted to make things which weren't just this flighty irony, you know, of references, but wanted to connect with something real. And so I was just hitting a wall. I just couldn't make it happen. I got interested in some contemporary artists. For example, there's a German artist, his name is Anselm Kiefer, and he was the closest to what I was hoping to do. He was."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":410.17,"end":410.35,"speaker":"Curt Jaimungal","text":"He."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":410.42,"end":439.59,"speaker":"Jonathan Pageau","text":"He was trying to bring back mythological thinking within the artwork, but his work was still. It's still problematic because it's still in galleries, it's still prestige objects, objects which have no function in the world. Right. We're actually so used to thinking that art doesn't have a function in the world that we forget that traditional arts in all cultures actually have functions within a community. They integrate themselves within a worldview, within a. A community living."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":440.87,"end":453.59,"speaker":"Curt Jaimungal","text":"And so is that conscious? Do they consciously construct the art so that they're integrating one another? Or does that happen because they're communally putting together a piece of art and then they all respect it and revere it, and it has their values embedded in it somehow?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":453.91,"end":505.61,"speaker":"Jonathan Pageau","text":"Well, the traditional way of seeing art is very different from the contemporary way of seeing art. The way that traditional vision, pretty much, I would say, worldwide, you see art as a skill. And so the notion of art is. We still use that word today when we say the art of cheese making, or the art of this, the art of that. And so that's really the traditional way of understanding the word art. The word art actually means, in Latin, comes from the notion of fitting things together. So the capacity to fit things together properly. That's what art is. And so in a traditional vision of art, we say things like, the art remains with the artist. The art is the skill of making things. And so the object that is made has to serve a purpose. There's no such thing in a traditional vision as making art. You don't make art. You use art to make things."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":506.49,"end":507.45,"speaker":"Curt Jaimungal","text":"So art is the tool."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":507.61,"end":627.55,"speaker":"Jonathan Pageau","text":"Art is the tool. Art is the skill. Art is the capacity that you have mastered to make an object. And so then that object needs to have a function in the world. It needs to be integrated within a purpose. And that's probably one of the hardest things for people to understand, is that art is not a value in itself. And once you understand that, at least when I understood that, it actually liberated me from a lot of problems. Because one of the problems we're always asking is, is this art? Is this art? You know, they come up with some crazy Jeff Koons, you know, blown up Snoopy. And then the question is, is that art? And the answer to me now has become, I don't care. That doesn't matter. That's not the point. Whether it's art or not, that's not a question. The question is, does it matter? Does it have meaning? Does it have a function? Is it integratable into society? Does it have a capacity to integrate into the world? And so when all of this was kind of playing around in my head while I was studying fine art, and it was so funny because it was so taking that that became the subject of my art. And so the subject of my art in college was, how can I make art in this postmodern world, which is not just ironic, which is actually connected to a community, to, let's say, a coherent worldview. But then it was still being very removed. It was like, I'm not doing it. I'm asking myself whether I can do it. And it was so funny because my last day in school, when my supervisor was giving me my final grade, she said it was so funny because I actually finished first in my program. Like, I was really diligent. I was working hard. But she knew that it just wasn't working. And she just looked at me and said, don't worry, you're getting all as. It's okay."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":627.55,"end":628.99,"speaker":"Curt Jaimungal","text":"What did she know was not working."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":629.24,"end":666.79,"speaker":"Jonathan Pageau","text":"Well, she understood that if what I was trying to do, which is, for example, to be a Christian person who is making art in a manner which was authentic but was still somehow part of the contemporary art world, which is full of irony and full of double, let's Say, double removal and constant, you know, a kind of flighty, removed version of reality. She just knew that it was. It wasn't happening. And so she just. She just told me on the very last day of my. Of my degree, she said, what are you doing here? Like, you don't. You don't belong here. You should go to seminary or something."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":666.95,"end":669.11,"speaker":"Curt Jaimungal","text":"You know, because you're too traditional."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":669.27,"end":678.71,"speaker":"Jonathan Pageau","text":"No, because she could see that the questions I was asking were not. They just. It just wasn't fitting with the. With the contemporary art world. It just didn't have its place."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":678.79,"end":683.43,"speaker":"Curt Jaimungal","text":"The questions such as. Such as the utility of asking whether or not a piece of art is a piece of art."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":683.79,"end":727.93,"speaker":"Jonathan Pageau","text":"No, no, not that. That is something that everybody is always constantly asking. The problem was mostly to say, how can I. Let's say, as part of a community. Let's say a part of a Christian community, how can I make objects which fit into my life and into my world and into my community in an integrated way? You know, like, I mean, it really is a difference between. I didn't know yet because I hadn't discovered traditional art. It really is the difference between, let's say I make. You are a musician, and you come to me and you say, here's what I'm trying to play. This is what I'm doing. Then I design a guitar for your particular needs. That's traditional art."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":728.01,"end":730.89,"speaker":"Curt Jaimungal","text":"Right. And the postmodern version of that would be."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":730.89,"end":779.66,"speaker":"Jonathan Pageau","text":"The postmodern version of that would be. I will make a guitar that will question what a guitar is. I will make a guitar that cannot be played, but. But will ironically question the whole tradition of what guitars have been and what music. And then now, today, it's even worse because now it's going to show how the guitar itself, as an object created by hierarchies of historical hierarchies, how is it an object which manifests or subverts that hierarchy? That's the difficulty of postmodernism. So that's not what I was wanting to do, you know, that's not what I was trying to do. I was trying to create a visual language which would integrate with my own experience, with my own faith, with my own participation in a community, in a church and all that."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":779.74,"end":787.86,"speaker":"Curt Jaimungal","text":"Okay, let's get back. We're gonna get back to this, but let's get back to art as a tool. So you're saying art as a tool. So this Snoopy example. I don't know the reference."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":787.86,"end":788.9,"speaker":"Jonathan Pageau","text":"I don't get this. Jeff Koons."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":788.9,"end":790.5,"speaker":"Curt Jaimungal","text":"Jeff Koons is Big Snoopy."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":790.5,"end":812.62,"speaker":"Jonathan Pageau","text":"Yeah, Well, I don't think he made a big Snoopy. He makes like, for example, he did. He did a big sculpture which is a pile of play doh. So imagine a small child has taken bits of play doh. And you just kind of jump, bundle up in a thing. He made a giant bronze sculpture of a pile of play doh. For example. That's Jeff Koons. He makes things like that."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":812.62,"end":825.41,"speaker":"Curt Jaimungal","text":"So this amalgamation of Plato, is it art? Your answer is it doesn't matter. What matters more is, does it matter? And does it provide meaning to a certain set of people and does it integrate that people with the community? I don't know if I'm."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":825.41,"end":833.57,"speaker":"Jonathan Pageau","text":"Yeah, it's recapitulating something like that. How does it integrate into the world? How does it participate in the world? How does it build instead of. And that."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":833.57,"end":836.29,"speaker":"Curt Jaimungal","text":"I think that if it does, then it's art or."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":836.29,"end":836.89,"speaker":"Jonathan Pageau","text":"No, it's not."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":837.05,"end":839.49,"speaker":"Curt Jaimungal","text":"Forget about the question of whether the."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":839.49,"end":846.57,"speaker":"Jonathan Pageau","text":"Art itself is the skill. Right. It's the capacity to do that. That's what. That's. That's the traditional worldview. So art."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":846.57,"end":850.09,"speaker":"Curt Jaimungal","text":"So let's take another example. Let's say someone's making. Someone's a great pizza maker."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":850.09,"end":850.29,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":850.29,"end":859.35,"speaker":"Curt Jaimungal","text":"And. And then they make something. Let's say they made it out of pizza, but they're a good pizza maker. So then the question is, is that pizza? And you would say, well, did they use the skill of pizza making on that object?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":859.43,"end":863.11,"speaker":"Jonathan Pageau","text":"The question would be, is it good? Because that's what a pizza's supposed to do."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":863.11,"end":864.03,"speaker":"Curt Jaimungal","text":"So can you eat it?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":864.03,"end":956.22,"speaker":"Jonathan Pageau","text":"Yes. And does it taste good? If you want to know if. Whether or not that pizza maker is a good artist is whether or not the pizza does what the pizza is supposed to do, which is tastes good, whatever it is that it could be to be healthy too. It depends on what the pizza maker wants to accomplish by making his pizza. It's the same thing with someone, like I said, someone who would make a musical instrument. The question, if you ask whether or not the musical instrument maker is a good artist, is whether or not that instrument does what it's supposed to do. And that's very difficult for people to think that way now, because even in the past, music was composed for reasons we don't. People didn't just compose music just to compose music. They would compose music for a requiem, music for a mass, music for a feast, music to celebrate someone's birthday, to celebrate the king. The music was written to integrate into society. You wouldn't just write Unless you were making studies, or maybe you were studying to practice or you were doing things like that. But your ultimate purpose was to write a piece of music which would function. Even storytelling, that's been a while since we've had that. But even storytelling in a traditional sense, like if you think of the great epics, if you think of the Iliad or the Odyssey, those were community building stories. Those stories were meant to create, to even create what the Greeks were."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":956.3,"end":961.56,"speaker":"Curt Jaimungal","text":"So, so how do you judge a piece of art where the artist themselves doesn't know what the purpose of the piece of art was?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":962.44,"end":963.64,"speaker":"Jonathan Pageau","text":"What do you mean? How do you judge?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":964.2,"end":972.6,"speaker":"Curt Jaimungal","text":"Because you're saying you can posit a goal and then whether or not you achieve that goal through the art, that's a measure of the art's which."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":972.68,"end":985.09,"speaker":"Jonathan Pageau","text":"It's not necessarily what worth. You could go further than think that it's just based on the individual's purpose. It's a broader thing than that. It's like if you. Let's say a pizza maker decided he wanted to make a pizza that tastes bad."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":985.09,"end":991.85,"speaker":"Curt Jaimungal","text":"By the way, all pizza makers, I'm sure there's a technical term for you, and I apologize and I know you're just in your gritting your teeth right now."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":993.29,"end":1006.29,"speaker":"Jonathan Pageau","text":"So let's say a pizza maker decided he wanted to make a pizza that tastes bad. You know, he could do that, but it would probably not be considered great pizza. And that guy would probably not be considered a good pizza artist."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1006.29,"end":1031.91,"speaker":"Curt Jaimungal","text":"Okay, but in that example, it's obvious what the intention of the pizza is. It's to be eaten. But say someone like Picasso and he just goes in a room, he doesn't know what he's doing. He organizes his room. So now he's like, maybe I'm an interior decorator. Oh, I just discovered Cubism somehow in his room. But he doesn't know what it's for because he doesn't know what it's for. We also don't know what it's for because the artist was just exploring and they created something. So can we judge it then because we don't know its purpose?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1031.99,"end":1116.45,"speaker":"Jonathan Pageau","text":"Well, I think that Picasso and modern art in general has a destabilizing effect on society. And I think they meant for it to be that. So in a way, maybe they did. What they did was right. I think that most modern art and contemporary art believes in a revolutionary vision of reality, that the purpose that our purpose is to. Is to bring about revolutions, to destroy the status quo, to destroy the existing order. And I think that Picasso was a communist. I mean, he was a communist pretty much his whole life. Even. Even when it became embarrassing maybe to be so. And a lot of the modern artists were either communist or fascists. You know, the futurists were straight on fascists. You know, they wanted to burn the old system down and set up a totalitarian, you know, system of art, too. A totalitarian system of art. We have artists who were totalitarian in their artistic vision. We don't tend to want to see them that way now for some reason. But a lot of the abstract artists were, especially the Russian abstract artists, had a totalitarian vision of reality. And a lot of modern designers were very totalitarian. Some modern architects would say things like, I wish I could design the people in my house, or I wish I could nail the chairs to the floor so that I could control."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1116.61,"end":1117.73,"speaker":"Curt Jaimungal","text":"Sounds like excess order."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1117.81,"end":1131.94,"speaker":"Jonathan Pageau","text":"Exactly. Everything the way it is. Okay, so you have these, these. You have, like this. You have this. These two tendencies. Let's say in modern art you have both. You have a kind of destructive tendency and a totalitarian tendency, which is part of the modern world."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1131.94,"end":1142.14,"speaker":"Curt Jaimungal","text":"So you see it as off balance because in Peterson, the Petersonian point of view, which is also the Taoist point of view, there's order, chaos, and you see it as being on the extremes and that they're not mediating between the two properly."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1142.14,"end":1195.4,"speaker":"Jonathan Pageau","text":"Yeah, no, I agree. I think the whole modern world, that's what it is. It's just a swing. It's just this. This pendulum swing between two excesses. And you can see it in modern art, you can see it as well, and they become confused and they kind of fight and then they break each other apart. But it is a fascinating thing to see now, we kind of just gloss over a lot of it, but if you look at the way, for example, that even post abstract expressionist art, let's say, manifested itself. It started with this freeing up, you know, Jackson Pollock, throwing paint on the ground and kind of this chaotic energy and everything. And then it ended with color field painting, where it was like just strips of one color and you couldn't do anything else. Like it was. It was completely. Everything was controlled in these extremely tight, tight boxes of what you could do."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1195.64,"end":1202.53,"speaker":"Curt Jaimungal","text":"I saw this painting that was just white with one speck of red. You know that painting, I forgot. It's a large. It's a very famous painting."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1202.85,"end":1204.61,"speaker":"Jonathan Pageau","text":"I don't know which. I don't know which painting you refer."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1205.01,"end":1207.17,"speaker":"Curt Jaimungal","text":"Okay, just imagine a blank canvas."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1207.33,"end":1208.21,"speaker":"Jonathan Pageau","text":"I can imagine that."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1208.21,"end":1212.97,"speaker":"Curt Jaimungal","text":"And then just some splotch of red in the corner, and then it sold for millions of dollars. Is that contemporary?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1212.97,"end":1265.75,"speaker":"Jonathan Pageau","text":"Yeah, well, that's. It depends. It could be. It would probably be a modern. We probably considered modern or late modern, you could say. Contemporary arts tends to be more cynical. And we'll take modern conventions and be more playful about them and will create a kind of parody. For example, German artists like Richter, who is an abstract artist, but his abstract art is considered to be a kind of parody of abstract art, where it's almost like a comment on abstract art. It's not directly abstract art. It looks like abstract art with a kind of photo, kind of weird photo, lack of focus in it. And there's a lot of neo abstract artists who are actually. There's a kind of weird cynicism to what they're doing, but it gets very confusing. Contemporary art right now is just a giant ball of anything. Like, it's very difficult to know there."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1265.75,"end":1268.59,"speaker":"Curt Jaimungal","text":"Is a postmodern or is it postmodern?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1268.59,"end":1306.67,"speaker":"Jonathan Pageau","text":"I think no, I think that we have. I think that what I'm doing could be considered postmodern. And I'm part of a group, let's say, of people who have grown up in contemporary art, who learned contemporary art, several who are. Who had a promising contemporary art career ahead of them. You know, they were in galleries, they had different scholarships and everything to big schools. But then they kind of came to the end of the. Kind of say, like they came to the end of the carnival. At some point. The carnival has to end at some point. You've eaten enough pie and you know you've had enough. You had enough."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1306.67,"end":1307.47,"speaker":"Curt Jaimungal","text":"Had enough pizza."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1307.47,"end":1340.15,"speaker":"Jonathan Pageau","text":"Had enough pizza. Exactly. You had enough sugar and blinking lights. And so what ends up happening is a rediscovery of what I would call traditional art. And I see that. You see that. So I know several iconographers who make icons for churches who had that exact turn where they came to the end of contemporary art and they realized this is just nihilism. It's just nihilism on steroids. And so they re. Embrace, let's say, the traditional language of the church. Some people."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1340.15,"end":1354.87,"speaker":"Curt Jaimungal","text":"How does that happen within a field of modern. Okay, so there's modernism, there's postmodernism, then there's traditionalism. Now, does this cycle happen even within a section? So there's the section of traditionalism section of modernism and postmodernism, or does it happen within."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1355.35,"end":1355.99,"speaker":"Jonathan Pageau","text":"I think that."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1356.15,"end":1358.63,"speaker":"Curt Jaimungal","text":"Does it happen with the sections as a whole?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1358.63,"end":1377.58,"speaker":"Jonathan Pageau","text":"Well, the problem with the contemporary art world is, is that the very setup of the contemporary art world is not conducive within that world for, let's say, a return to order to happen, or let's say a post modernism to happen, because you have a return to the."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1377.66,"end":1386.54,"speaker":"Curt Jaimungal","text":"Proper balance between order and chaos. Because, as you were saying, can't just be returned to order because the fascists had extreme order. So for them it would be returned to the middle."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1386.7,"end":1429.65,"speaker":"Jonathan Pageau","text":"Exactly. The problem is that's true in the modern. One of the things we forget about modernism is there is another wing of modernism which we don't tend to think of, which is social realism. And social realism has been used very much as just pure propaganda, like just a pure propaganda tool, because its whole style, its whole affectations are basically a kind of sentimentality, you know, a kind of going in to get your sense of nationalism or your sense of courage or whatever. And so they tend to push you towards propaganda."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1429.65,"end":1432.57,"speaker":"Curt Jaimungal","text":"So what people traditionally think of as propaganda is social realism."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1433.37,"end":1435.57,"speaker":"Jonathan Pageau","text":"I mean, usually those are the take."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1435.57,"end":1437.29,"speaker":"Curt Jaimungal","text":"Like these Nazi propagandistic forms."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1437.29,"end":1457.72,"speaker":"Jonathan Pageau","text":"Yes, they are. And the same with the Russians. Like, the Russians had a whole tradition of social realism. I mean, Jordan Peterson has collected them. His house is full of Russian social realism, where the purpose of these paintings is to make you a good citizen. Right? To make you participate in the state."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1457.72,"end":1465.52,"speaker":"Curt Jaimungal","text":"Do you see elements of social realism in the modern films that we have now? Like Mona, I think it's called Mona, the one that you analyze. Mona."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1465.52,"end":1465.92,"speaker":"Jonathan Pageau","text":"Moana."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1465.92,"end":1470.24,"speaker":"Curt Jaimungal","text":"Moana. And then Frozen and then Wonder Woman."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1470.24,"end":1512.4,"speaker":"Jonathan Pageau","text":"Yeah. Well, right now we don't. I would say that we're not. We're not using social realism for our propaganda anymore because it's a different. It's a weird different. It's a weird different world than, for example, early century early. One of the things that has happened is, let's say, the revolutionary elements of our society, they've actually understood symbolism. They've been the ones who, for the past, let's say, 50 years, have understood symbolism the most. And so they've actually been using, let's say, mythological structures to affect their propaganda. It's very different."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1512.48,"end":1514.8,"speaker":"Curt Jaimungal","text":"Much like the Nazi symbol being what."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1514.8,"end":1522.48,"speaker":"Jonathan Pageau","text":"Was swastika was what swastika was. I mean, the swastika is one of the most ancient images, one of the most ancient symbols that exist."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1523.44,"end":1523.63,"speaker":"Curt Jaimungal","text":"It."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1523.78,"end":1580.13,"speaker":"Jonathan Pageau","text":"It's an image that is universal. You can find it in all cultures. You can find it in. You can go to a church, medieval church, and see swastikas. You can go to a Hindu temple and see swastikas. It is. It's probably one of the oldest images we have. And so they were able to take it, to change it a little bit. They made it, instead of making it straight, they slanted it. I think that the Nazis are a really good example in a way, in the sense that the Nazis, they wanted to co opt mythological thinking more than others. They had a weird, they also, they had a weird religious feel to them. Right. They, they had a kind of strange esoteric and, you know, desire to renew, to revive northern gods. They also had weird contacts with, with Indian, the aristocracy in India, with the. What are the names of the caste? I can't remember the name of the cast."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1580.93,"end":1594.61,"speaker":"Curt Jaimungal","text":"So do you think that's one of the reasons why these totalitarian regimes, when they come in, particularly on the left, so particularly communist regimes, that they want to obliterate traditional art and obliterate religion and ban it? Oh, for sure, because they understand it."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1594.85,"end":1632.99,"speaker":"Jonathan Pageau","text":"Well, because they understand how potent it is. And also because especially the communists, the communist groups, they really wanted to. Because they believe that the human person is malleable. Right. That we're a blank slate type. And so they wanted to destroy all the cultural tenets which were there in order to bring about their utopia. You know, the Chinese, the Russians did it too. Russians liquidated, they destroyed. The Russians destroyed over 30,000 churches just during the early times of Stalin. And you know, we all know that the Maoist Cultural Revolution was insane. You know, they just went around destroying everything."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1632.99,"end":1636.71,"speaker":"Curt Jaimungal","text":"Not only destroying, but execute, executing anybody that had to do with the priesthood."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1636.71,"end":1725.67,"speaker":"Jonathan Pageau","text":"Yeah. And the same thing, I mean, or Buddhists, early, early Communists, Russia, Russians would go around, you know, and just, just shoot priests in the head. You know, it was an insane time. So it was like liquidating the, the, the imagery in order to bring about their, their utopia. But today we, today it's weird, it's different. Our, our version of that, let's say our version of propaganda is, is a little different from that. It's more, it's more insipid and it's more, it tends to understand, like I said, it tends to be more subversive rather than directly offensive in the sense that it's better to, instead of, it's better to show, like to show inversions and to have stories with the notion that the inverted becomes the norm in a way. And that seems to be the way that a lot of propaganda is happening now. And so it's a bit different. And so sometimes it's tricky because sometimes the stories actually end up looking very much like ancient traditional stories. It's often just that they're upside down or that there's a. Like, Shrek is a great example. Shrek is like the most. The easiest example to see where it looks like a fairy tale, but it's actually an upside down. It's a totally upside down fairy tale where you have an ogre and a princess. You know, the ogre is this monster, and they present him as a monster."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1725.75,"end":1727.71,"speaker":"Curt Jaimungal","text":"So that would be an example of a postmodern film."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1727.71,"end":1790.29,"speaker":"Jonathan Pageau","text":"Yeah. Of an upside down fairy tale, of a subversive use of traditional tropes, where all the tropes are there, but they're just totally upside down. You know, the ogre is represented as a monster. It suggests that he's a cannibal. It suggests all these things that the normal ogre is. And then he meets a princess, and in the end, the princess becomes an ogre. And it's like, okay, the Shape of Water is a great example, too. Recent, more recent version, where all the normative characters, you know, the Christian, the white male, all that, they're all absolutely evil. Okay. And then all the kind of exceptional characters like the monster and then all these other exceptional categories are somehow pure and innocent and all of that. And then in the end, the woman becomes a monster. Like, that's how it ends. She goes into the water, she becomes a sea monster. And it's like, we're so used to it. We think that somehow that that's a normal way for a story to go, but it's very disturbing, you know, a normal."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1790.29,"end":1792.17,"speaker":"Curt Jaimungal","text":"I've seen that so much in the past 15 years."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1792.17,"end":1807.69,"speaker":"Jonathan Pageau","text":"Yeah. A normal story, like the story of the frog and the princess, for example, is that the exceptional character, the frog, this talking frog who's a monster, is, by some proof of their virtue integrated into the world. Right."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1807.69,"end":1809.13,"speaker":"Curt Jaimungal","text":"Little Mermaid becomes a human."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1809.53,"end":1810.81,"speaker":"Jonathan Pageau","text":"Yeah, that's a difficult."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1811.13,"end":1812.25,"speaker":"Curt Jaimungal","text":"Ponyo becomes a human."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1812.33,"end":1816.05,"speaker":"Jonathan Pageau","text":"Yeah, Ponyo is a. Yeah, that's a good. That's a good example of, you know, Miyazaki."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1816.05,"end":1838.91,"speaker":"Curt Jaimungal","text":"I've been watching Miyazaki films because you commented on Spirited Away, and I wanted to watch it again, so I started watching a few. And I was trying to put my finger on why is it so. It's damn good. His films are very good. And I realized not only are they magical and whimsical, like a child and imaginative, but there's a complete lack of cynicism, a complete lack of sarcasm. Sarcasm or sardonic commentary."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1838.91,"end":1890.31,"speaker":"Jonathan Pageau","text":"Yeah, No, I think you really put your finger on it. And I think that because we're in a situation because of our. Because of technology and because of our extremely ordered societies where we have a. You know, everything is controlled by the state. Basically, not everything, but so much of our world is controlled by the state and by these giant corporations and everything. We have a need for feminine symbolism. We have a need for the private sphere. We have a need for the refreshing aspect of our personal relationships. All this feminine symbolism. We have a desire and a need for it. And the thing about Miyazaki is that almost all his films take on this feminine symbolism. But he does it in such a beautiful way where he doesn't feel the need to be subversive or to kind of show how, you know, the male character is an idiot or useless."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1890.39,"end":1893.79,"speaker":"Curt Jaimungal","text":"There's a complete absence or lack of a political message."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1893.79,"end":1894.71,"speaker":"Jonathan Pageau","text":"Oh, yeah. No, I think so."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1894.71,"end":1901.01,"speaker":"Curt Jaimungal","text":"The closest may be Ponyo, where he says the humans are ruining the Earth with their ships. That's the closest that I found so far."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1901.17,"end":1918.57,"speaker":"Jonathan Pageau","text":"But I agree. I agree that that's what makes him so strong and that's why. And they make him so strong also because he's able to create strong female characters, but in a manner which is not. Doesn't have that kind of anger and bitterness and cynicism in it, or it's more like a celebration of these beautiful feminine characters."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1918.57,"end":1920.33,"speaker":"Curt Jaimungal","text":"And it doesn't make the feminine. The masculine."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1920.33,"end":1920.69,"speaker":"Jonathan Pageau","text":"Exactly."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1920.69,"end":1927.3,"speaker":"Curt Jaimungal","text":"It doesn't make a girl have traditionally masculine qualities and then say we're subverting notions of gender."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1927.3,"end":1960.15,"speaker":"Jonathan Pageau","text":"Yeah, because that's what I mean. That's what so many of the suit. The. Like the superhero movies that we've seen recently, and a lot of that, like the Star wars movies and everything is. And I think that's why people are kind of annoyed with them, is because they're. It's not only the desire to make, let's say, a feminine. A female character into the same action hero that we've had, you know, since the 1980s, that everybody's criticized. Like it's, you know, it's. They're feminists or, you know, the. The postmodern criticized that figure of the. Of the hero, of the male hero. And so. But now you want to make a woman into it."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1960.31,"end":1962.91,"speaker":"Curt Jaimungal","text":"Masculinity is toxic as long as it's a male."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1962.91,"end":1969.83,"speaker":"Jonathan Pageau","text":"Exactly. It's like masculinity becomes good if it's a female who embodies it. It's just completely. It's completely upside down."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1969.83,"end":1977.15,"speaker":"Curt Jaimungal","text":"And then here's what else. What else I find funny about that then. Feminine femininity. Is just unattractive when it's attached to a male. So as a male, you can't win."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1977.15,"end":1980.46,"speaker":"Jonathan Pageau","text":"No, it's very difficult if you're a masculine."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":1980.46,"end":2000.62,"speaker":"Curt Jaimungal","text":"So. But if you're attractive and you're toxic and you have toxic masculinity, you can get away with almost anything. We had this conversation with Janice Fiamango that the people who are getting. Who are getting sent letters saying, stop. What you're doing is. Are. They tend to be people who are unattractive males. If you were an attractive male, then the woman wouldn't find it. Cat calling. She would find it."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":2000.62,"end":2011.9,"speaker":"Jonathan Pageau","text":"No, I totally agree. Who's that? Who's that British comedian there that Jordan did an interview with for. I forget his name. The. This one British comedian. He's Milo. No, no, no, he's."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":2011.9,"end":2012.18,"speaker":"Curt Jaimungal","text":"He."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":2012.34,"end":2030.86,"speaker":"Jonathan Pageau","text":"Jordan. Jordan did a thing. He was like. He was like a huge deal and he came to press and everything. He did an interview with Sam Harris and he did an interview with Jordan. He's kind of on board with intellectual dark world. Anyways, he was like a. He was this super good looking guy and he was extremely promiscuous, you know, and just had loads and loads of sex. All kinds of women. And I saw him."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":2030.86,"end":2031.54,"speaker":"Curt Jaimungal","text":"Oh, Russell Brand?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":2031.54,"end":2071.77,"speaker":"Jonathan Pageau","text":"Yeah, Russell Brand. I saw him meet with a woman, talking to her, and he reached back behind her back and he undid her bra like that. And everybody was laughing and she was laughing and she's like, oh, what did you do? It's so funny. Ha ha ha. I'm like, really interesting. You know, imagine if anybody else had done that, you know, what it would have been. And I'm just. I mean, I'm figuring like, maybe Russell Ren at some point they're going to turn on him. When he kind of. When he loses his. His attractive edge. They might turn on him at some point. But yeah, no, I agree that it's mostly that certain behaviors, let's say trying to be flirty with a woman, if you're good looking and you're desirable, then that's not a problem. But if you're ugly, let's get to."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":2071.77,"end":2072.45,"speaker":"Curt Jaimungal","text":"Lord of the rings."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":2072.45,"end":2073.33,"speaker":"Jonathan Pageau","text":"All right, Lord of the rings."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":2073.33,"end":2080.21,"speaker":"Curt Jaimungal","text":"I want you to tell me the story of. Don't tell me the story. It can take hours and hours. Tell me the symbolism behind the ring."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":2081.49,"end":2172.82,"speaker":"Jonathan Pageau","text":"Well, the ring is really power. I mean, it's called the ring of power. But I think that the ring is the power in the sense that we understand it today in the sense of technological power, that is the capacity to affect the world. So it could be political as well. But a good way to understand it is technological power in the sense that it's the capacity to control, to affect things around you. And so the ring itself, this symbol of metallurgy, is a very ancient symbol of exactly that. Right. In the Bible, you have this notion that as the fall of man kind of increases, moving towards the flood, one of the steps is the creation of metallurgy with Tubal Cain and the forging of weapons. But then it's there in other traditions as well. Somebody was telling me a Nordic tradition about almost the same idea that the. In Greek thinking, you, you know, Hephaestus, the God of metallurgy, is a. He's a. He's kind of like a monstrous, deformed God who was kicked out of Olympus and lives in a kind of dark, fiery place. And that's where he makes his. And so it's like this. It's kind of like an image of the capacity on the margin to control the outside. You could say something like that. Does that make sense?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":2172.82,"end":2179.98,"speaker":"Curt Jaimungal","text":"Yeah, yeah, yeah. And then you're saying how the ring becoming something that makes you invisible makes sense because."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":2181.1,"end":2353.68,"speaker":"Jonathan Pageau","text":"Right. Well, the idea is that you have to understand it. You have to understand technology, or if you have to understand power or capacity to move out into the margin, you have to understand it as adding layers to yourself. Right? That's a good way to understand technology. You could add the supplement. So you supplement your existence with something. So you wear clothes. You add a layer of clothes, and then you can live further out, right? You used to be only to live on the equator. Now you can live further out from the equator because you have clothes and you can keep warm. Then you develop houses, you develop different technologies to bolster your capacity to live further out. So imagine now the same thing in terms of political power. You are one person. What can you do? You can't do much. So in becoming, in adding power to yourself, let's say you hire an army, you get weapons, you put on an armor, you do all these things. You learn to ride a horse. You have all these things that you add to yourself in order to make yourself more powerful, right? And the ultimate example of that is the ornament. So we often don't think metaphysically what an ornament is, but an ornament is something that you add to another thing to make it just to make it different, just to make it special. Right? Because it has no purpose. If I paint a flower on a chair, it doesn't participate in the chair, nature of the chair, it doesn't help me sit on it. That's what, you know, all it does is it makes it different from others, and it's the same for people. So a woman will wear jewelry, a man will wear jewelry as well. A woman will wear makeup in order to supplement her beauty, you could say. So a woman wears supplement her beauty. But what happens is, as the supplement gets stronger and stronger, the question is, are you supplementing to show, to call attention to, or are you supplementing in order to hide the true nature of what it is that you're supplementing? It's hard to know when that happens. It's hard to know when I take a hammer in order to be able to hit nails and hit them in. But then at some point, the technology becomes so big that. That I could never do it. Like, it's actually there to mask my incapacity to do that actual action. The same with makeup. You know, everybody has seen a woman who, at some point in her life, as she enters her 50s or 60s, she doesn't realize what's going on. And then she starts to wear too much makeup. And then you realize that it's actually there to hide her. Her age. It's not there to."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":2353.92,"end":2356.76,"speaker":"Curt Jaimungal","text":"To enhance, to accentuate."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":2356.76,"end":2372.48,"speaker":"Jonathan Pageau","text":"Exactly. Okay. And so that's how the ornament makes you invisible, is you. You disappear behind the supplement at some point. So if you. If you keep adding those layers, at some point, those layers are all that is. It's like a. I see."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":2372.48,"end":2396.44,"speaker":"Curt Jaimungal","text":"I see. So, okay, so an empty shell. So there's technology. I'm just gonna see if. I understand. So there's technology. And use that technology to expand what you can do, to expand your dominion over the world and over others. Then you can also think of it in terms of makeup is a technology. Buying a big car to signal your attractiveness is a technology in the sense, because it's a tool. So tool is another word for technology."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":2396.84,"end":2433.96,"speaker":"Jonathan Pageau","text":"Right. And the big car is the great example, right? I mean, for a man, it's a joke that we have, right? The guy with the sports car, you know, is it there to. Is it there to actually hide something about him, something that he's missing, some aspect of him which is deficient? And then he's hiding himself behind his big car. He's actually hiding the fact that he's. I mean, this is like the joke, right? He's hiding himself, the fact that he's somehow deficient in some spheres of his love life with this big car. So he's overcompensating in that manner. And so that's a way for him to hide. He's hiding himself behind his. This, this ring. This ring."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":2433.96,"end":2442.92,"speaker":"Curt Jaimungal","text":"How does it work when it comes to armies? Like, let's say you're the President of the United States and you just keep, you keep pumping money into the military, so you're expanding your range of dominion."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":2442.92,"end":2443.4,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":2443.72,"end":2445.32,"speaker":"Curt Jaimungal","text":"How does that relate to hiding?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":2446.92,"end":2451.68,"speaker":"Jonathan Pageau","text":"Let's try to understand it in terms of, in terms of an army, because."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":2451.68,"end":2465.04,"speaker":"Curt Jaimungal","text":"I understand it in terms of masking when it comes to something like makeup or the man with the car or someone with extremely. Well, someone who's extremely well dressed but to the point of not being well, being overly dressed."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":2465.12,"end":2552.17,"speaker":"Jonathan Pageau","text":"Well, I would say, I would say we could see some examples, I think, in terms of when is it that, let's say civilizations become expansive? I mean, I think a lot of you could argue with me on this for sure. Okay. But I think that if you look at the, the, the expansion of the Roman Empire, for example, the question is why did it expand? Like, why, why would it expand? And one of the answers could be exactly what I said could be exactly that it is lacking within itself what it needs to exist. And so it has to, it has to eat, has to speed up what it's eating on the outside. It has to kind of devour the outside and add, add, add, add, add, add, add to a point where it always feels like it's, it's pushing away that moment where it's going to break apart by doing that because it's, there's something in the center which is lacking. There's some inner thing which is lacking. And you see that. I mean, I think that we see that. You could think about in terms of materialism, how people will start to buy, buy, buy things because there's something lacking within themselves. And so they do that in a way to make them feel like they're, like they're still growing."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":2552.17,"end":2559.81,"speaker":"Curt Jaimungal","text":"Okay. So they lack something crucial that will help them survive. And so they stave off the inevitable by increasing their imperialistic powers. That's something that the communists did."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":2559.81,"end":2566.07,"speaker":"Jonathan Pageau","text":"Yeah, I think so. I think that that's a good way to understand it in terms of, of empires that tend to."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":2566.07,"end":2569.75,"speaker":"Curt Jaimungal","text":"Oh, I mean, that's one example. Because others could just simply be greed."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":2570.15,"end":2575.79,"speaker":"Jonathan Pageau","text":"Yeah, but I think that greed is that too. I think that this, that's true."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":2575.79,"end":2578.67,"speaker":"Curt Jaimungal","text":"Because greed could also be tied to an insecurity, which means you don't have something."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":2578.67,"end":2710.31,"speaker":"Jonathan Pageau","text":"That's right. And so that's why the ring is related to our desires. This periphery, this idea of supplement is also related to what the Christians would call the passions. So you have these things that pull you from the outside. Desires, you know, gluttony, pride, sexual desire, all these things. And so if you move in that direction, usually that's what it is. You're devour, you're eating, you're taking in things, you're acting in certain ways in order to compensate for something that you're lacking interior, you know, and everybody knows someone who does that. I mean, you can take extreme cases of someone, let's say, who drinks, you know, and you know, and you know, someone who becomes an alcoholic. He doesn't just become an alcoholic because of alcohol, right? Usually you become an alcoholic. You drink to fill up some malaise that you have, some kind of. And everybody has that malaise. You know, we just, we have different ways of dealing with it. But you can. You engage in certain supplementary behaviors in order to. And the supplement, because the supplement is also medicine. That's also important in understanding this idea of supplement is it also has to do with the notion of taking in something or intoxicants or medicine. All of that is part of this notion of the supplement. Because when you're sick, you have to take something from the outside in order to heal you. And it works like it can work. And the supplement is not. There's nothing wrong about the supplement. There's nothing wrong about this process. It's just that it can become out of control, you know, because you need to eat. And there's nothing wrong with sexual activity. All those things are fine. It's just that if you fall, you can fall into a. You can fall into a pattern where that behavior or that desire or, you know, the alcohol or drugs or whatever it is or power or all the things that we do or buying cars or whatever it is that we do to supplement our existence takes you away from yourself and then you lose yourself in that. You, you know, you lose yourself in your, in your desires. And you, you, you cease to. You've lost the heart. Like you've lost the memory of the heart, you could call it."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":2710.47,"end":2712.47,"speaker":"Curt Jaimungal","text":"How does this relate to the ring becoming heavier?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":2713.19,"end":2822.4,"speaker":"Jonathan Pageau","text":"Well, I think that the ring becomes heavier as if you understand it as, let's say, Frodo is moving out into that chaotic world. And so it has to become heavier in a certain way. Just like you need to add more and more layers the further away you get from yourself. So it's going to be, you know, it's like you have need a bigger, bigger gun, a bigger sword, a bigger, you know, a bigger army, a bigger house of, you know, more technology. Going out into space is the ultimate example. You know, like you go out into space, you need a massive shell around you. A massive, massive shell to protect you from the outside because the outside will kill you. And I think that that's what, that's what's happening in the Lord of the Rings is that as Frodo is moving away from his home, as he's moving away from his family, his identity and all of that, and he's moving out towards this dark place, then the ring gets heavier and it takes a toll on him. You know, at first he has enough innocence to bear the ring without being completely taken over, but as he moves out and further and further and further out, then it starts to eat away at him, you know. And the only character in Lord of the Rings who can handle the ring without a problem is Tom Bombadil. And that's because he is a representation of that natural kind of innocence, that kind of boisterous self fullness of being. You know, he doesn't. He doesn't. He has a kind of joyful innocence that means that he's not tempted by the periphery or tempted by that. A good example is in the movie Spirited Away. It's a great example where the central character. What is her name again? Forget her name. Anyways, Sen."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":2822.48,"end":2823.68,"speaker":"Curt Jaimungal","text":"But that was what she was given."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":2823.76,"end":2869.56,"speaker":"Jonathan Pageau","text":"Yeah, well, Sen. She herself has that innocence. And so when she's. She's not in danger the same way that others are in that world of gold and of pleasures and of, you know, this house of kind of sensuality, she's not in danger. So when the monster, when no Face presents her with the gold, she's like, but she'll take it if she needs it, right? And it's fine. She's like, oh, she needs the. She. She needs something from no Face. She'll take it. She's fine. But then he's like, no, I want to give you more. I want you to give you more. And she's like, why would I want more? I'm fine. I needed this tool to do this and I did it and then I'm done."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":2869.56,"end":2871,"speaker":"Curt Jaimungal","text":"And that was because she was innocent."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":2871,"end":2887.57,"speaker":"Jonathan Pageau","text":"I think it's because she had a kind of innocence in the right way to see innocence. A kind of purity, you could say a kind of lack of self, a joyful purity. I don't know how else to say it."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":2888.21,"end":2901.25,"speaker":"Curt Jaimungal","text":"We were talking about the Little Mermaid before we started filming. And I don't know if you had much time to think about it before we started filming, but can you comment on how the Little Mermaid has a connection to today?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":2901.65,"end":2943.05,"speaker":"Jonathan Pageau","text":"Right. Well, especially if you're talking about the movie, the Little Mermaid, like the Disney movie. I think it's interesting because the Little Mermaid, she. It's funny because maybe I need to make a caveat about the Little Mermaid. The first Little Mermaid, like the one that was written by Hans Christian Andersen, was really about the incapacity to cross over. It was really about the be happy with what you are because she dies, right? She can't. She can't cross over into the human world because that's not her place."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":2943.13,"end":2943.53,"speaker":"Curt Jaimungal","text":"Right."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":2943.61,"end":2974.28,"speaker":"Jonathan Pageau","text":"And so the Disney version is the actual total opposite. The Disney version is the very opposite. It is the modern, like, you can be whatever you want version of that. So it's very. It's kind of interesting, first of all, to think about the difference between the two worlds, the worlds of Hans Christian Andersen and our world today, where we have this idea that you can pretty much just do whatever you want. But what's interesting in the scene with the witch. What's her name again?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":2974.44,"end":2975.08,"speaker":"Curt Jaimungal","text":"Ursula."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":2975.08,"end":3045.36,"speaker":"Jonathan Pageau","text":"Ursula, yeah. What is interesting in that scene is that Ursula is making her feel like she cares about her, right? Making her feel like she's this poor thing, this poor victim of her circumstance. This poor. And she's like, I'm going to. I can offer you what you want, I can offer you your desire, but what you have to give me is your voice is your self, basically. And so, in a way, your logos. Yeah, exactly, your logos. And so, in a way, it is an image of this problem of desire in that sense. And the problem with that movie is that in the end, she gets her thing. That's the problem. It's like. That's a bit. That's more complicated. But she's like, you need to sacrifice yourself, your logos, in order to get what you desire. And that is part of this notion of the supplement in the sense is that if you desire this new car, that's what you really desire. If you desire to have all these sexual experiences, if you desire to have a certain lifestyle. And that's like. That's when you think that that's what you are. That's when you lose your logo."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":3045.52,"end":3059.44,"speaker":"Curt Jaimungal","text":"That's interesting because you can look at it from two points of view. One is Ursula, which you can think of as the radical left, enticing people with wish fulfillment. I just want your voice. But then on the other side, there's the people who are willing to give up their voice."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":3059.44,"end":3255.23,"speaker":"Jonathan Pageau","text":"Yeah. Who are willing to give up their logos or their core, their heart or whatever in order to. To get something that they desire in order to get something that they want. And I think that that's, you know, and there's something about that in the ring, too. There's something about that in the notion of the ring in general, where, you know, the person who is going to bear the ring, especially someone who already has a purpose, that they're going to be able to accomplish what they want. Like, if they have that power, they'll be able to do that, but they kind of have to give up. Have to kind of give up their soul to get it. And it's a magical. All the magical transactions in stories are always kind of like that. It's like, you know, you get what you want, but you have to give up something more profound in order to get that. And I think that you see it. You see people who go through that all the time. People go through that all the time, right? The guy who. All he wants is to get his million dollars, and then he sacrifices his family, sacrifices his relationship with his wife. He sacrifices the things that are actually very precious, that are really precious because they constitute your being in terms of a communal being. And they do that to get what they want. And I think that in terms of the radical left, one of the problems that we're seeing is that the radical left has been able to convince people that they're only this one aspect of what they want. And so someone is like, I am. You know, I feel like I'm, you know, that I either I'm just one thing. Like, I'm this one thing. And if I embrace this one aspect of myself, I will get power. Like, I'll get some political power. And I think that that's dangerous in terms of just normal people. Like, as a. We're not. Like, I am not just a. You know, I'm not just a man. I'm not just a carver. I'm not just a. Or if I was gay, I'm not just gay. I'm not just trans. I'm not just whatever. And I'm not just European. I'm not. So it's like, if you embrace this one aspect of yourself, then all of a sudden it's like, but there's something. That's how you make a weapon, right? That's what a weapon is. A weapon is a point. It's like, I'm Gonna push something into a point. Then I'm gonna use it as a weapon. And that's how you make a weapon. But that's not the way you make a person, right? You don't make a person by turning a person into a weapon or weaponizing something about yourself, because you'll lose yourself in that weapon. You could say. And you can do it with all kinds of things. You can turn your bitterness into that. You can become your bitterness. Can become your bitterness at your parents. You hate your parents because of what they did, and your whole life falls into that bitterness. And. And you make this nice, jagged, pointy thing where all you exist in is this one thing about you, which is the way your parents treated you. And you dive into that. It becomes your spear, and you start slashing at the world with it. And it makes you feel powerful because it works. It actually does give you power. But you lose something in the balance. You lose the capacity to become a full person, a total being."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":3256.43,"end":3281.55,"speaker":"Curt Jaimungal","text":"I just had a thought about. About giving up what you have in order to get what you want, which is Ariel. But nihilists in today's world give up what they want in order to keep what they have. So they don't want. They'll give up their aspirations, like, forget about marriage, even though they actually want it. Forget about. Forget about traditional values, even though they actually want friends. And they would like maybe a nuclear family or whatever it may be in order to retain their worldview what they have."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":3281.92,"end":3335.77,"speaker":"Jonathan Pageau","text":"But I think it has to do also with a kind of shortening of what nihilism tends to do is it tends to shorten the horizon, you could say. And so the most immediate things we have are these desires, right? Those are the most immediate. The idea of wanting a family, you have to swim over that first wave, which is, I just want to have a beer. You have to swim over that in order to. To get to something which is more purposeful. And so I think that what nihilism does is it opens up the possibility of just living in more immediate desires, Playing video games all day or whatever it is that you want to do in the immediate and not feel like you have to direct yourself towards something which is higher. And so in that sense, I think that that's what. That's what nihilism tends to do to people."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":3336.25,"end":3345.69,"speaker":"Curt Jaimungal","text":"So what do the hostile brothers, Cain and Abel. There are others, which I can't think of right now. But what do they have to tell us about our current situation with regards to the radical left or even the alt Right."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":3345.77,"end":3394.6,"speaker":"Jonathan Pageau","text":"Yeah. Well, I think in terms of Cain and Abel, I really do. I do think that Jordan Peterson has hit the nail in the right place in terms of that story and how it relates to today in the sense of. Of resentment. And I think that in the story of Cain and Abel, especially, you see Cain, who feels like he should have more than what he has. And it's not just. And so it becomes the basic. You could say that it's pride, right? Pride is the. Is the first sin. It's the first sin in pretty much all the whole biblical story. You know, the devil sin is pride. Cain's sin is pride. Adam and Eve sin is pride as well. It's the feeling that I deserve more than what I should have, and it's."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":3394.6,"end":3402.44,"speaker":"Curt Jaimungal","text":"Always relative to someone else because it's almost equivalent to I should have more. But also, you shouldn't have that. If I don't have that, you shouldn't have that."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":3402.44,"end":3574.43,"speaker":"Jonathan Pageau","text":"Oh, yeah, for sure. No, I totally agree. And I think that that's. It seems to be. I think that that's for sure. If you talk to people who are far on the left. Far on the left, you could say it doesn't take a long time to scratch at the fact that what frustrates them is not so much that they're poor, because most of the time, at least here they're not. You know, there's very few people starving in Canada. I mean, I'm sure there are, but there are very few. It's usually that they're annoyed to think of Jeff Bezos in his, you know, his huge house, and that's what annoys them. And I think that. I mean, I'm not saying that there isn't something to say for the problem of disparity and the problem of people, of one person having too much power. I think that that's something which is important to think about and to talk about where certain individuals have so much power that they actually can become a danger to social cohesion. But I think that if you look at it out of resentment in the sense, like, why would he get that and why not me? It's not fair, that kind of thinking. I think that doesn't lead the person in a good situation. And we see it in the story of Cain, of course, is where he ends up killing his brother because. Because he. And in the story of Cain, what's interesting in that story is that it doesn't tell you. Doesn't tell you why. It's really fascinating because later traditions have always tried to like to try to guess why. Why is it that Cain's sacrifice was not acceptable to God, but in the story itself, it doesn't say. It just says Cain's sacrifice was not acceptable. Abel's sacrifice was acceptable. It's like, okay, you don't even know why. And so. But it doesn't matter. It's like, that's reality. Right. Another way to see it is these are the cards that have been dealt you. This is it. You can't argue with reality. And so are you going to argue with reality? Are you going to say, I should have more and I'm going to want more so much, and I'm willing to blow the whole thing up just because I don't have what I want? You know? And I think that what you're seeing in the. Especially in the radical left is you definitely see that type of. That type of thing. And you see it too, like you said, you do see it. Now in the extreme right, you're seeing similar things as well, where there is a nihilism, which is propping up in the more extreme right, which is basically our culture, Western culture is over. So let's just participate in blowing it up. Let's just run it into the ground so no one can have it. So there's a little bit of that going on, and it's very disturbing to watch."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":3574.51,"end":3657.73,"speaker":"Curt Jaimungal","text":"So, yeah, something that I always struggle with is the radical left end side. There is a. There is a. There is a grain of truth, more than a grain of truth, which is that we don't all have what we want, which we'll never all have what we want, but there's some basic needs. So in Canada, we all have health care, so let's just forget. But let's say in the States, so they don't all have health care. They don't all have. They all are. Many people are living paycheck to paycheck, and then they look at someone like Jeff Bezos and they say, it's not fair that someone should be living so insouciantly and free while I am just struggling. Yeah, okay, so there is something to be said about not having to struggle this much for basic necessities. Then at the same time, there is something to be said of, well, are you trying to be a champion for the cause of people who are struggling, or are you just trying to tear down those who have much more than you? Now? There is something. There is also something to be said for, again, tearing down those who have disproportionately too much simply because we don't want power to accumulate in the hands of the few. And in crony capitalism, obviously, money translates into politics and we don't want that. So it's. There's. I see both sides, and I'm always struggling because I see the benevolent side of the radical left, which is riches. Which is the benevolent side of the left in general."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":3657.73,"end":3658.29,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":3658.53,"end":3665.33,"speaker":"Curt Jaimungal","text":"And then obviously the benevolent side of the right comes out as well, which is. Well, we need hierarchies. You can't just dispense with all hierarchies."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":3666.61,"end":3671.45,"speaker":"Jonathan Pageau","text":"What is it that you struggle with? You struggle with? So I think that the left. The left."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":3671.45,"end":3685.78,"speaker":"Curt Jaimungal","text":"Because any attempt to criticize the radical left, they can just say, no, it's not this claim of resentment. It's that all that nice Bonhommie, gracious, altruistic, philanthropic aspect, all those elements that you just listed, that's actually our true motivation."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":3685.78,"end":3686.18,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":3686.18,"end":3718.7,"speaker":"Curt Jaimungal","text":"And it's difficult. Well, you can. Look, you can take the psychoanalytical approach, which is something I'm going to try to do in the documentary, which is, well, what do your behaviors show? Forget about what you say. Let's see how you act. So are you killing tens of millions of people in the 1900s? Well, obviously they didn't, but I'm saying the same philosophy has. And are you clapping when Jordan Peterson is debating Slavojek Zezek and Jordan Peterson references bloody, violent revolution and then the rest. And then the radical left says, yeah, which happened. I don't know if you saw this."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":3718.94,"end":3738.47,"speaker":"Jonathan Pageau","text":"I saw the one scene where he says. He says hierarchies are not. He says hierarchies are not all posited on. On violence and dispossessing and everything. And then someone laughs. And I thought his. His answer was so perfect. And he said. He said, well, maybe those. That laugh, that's the way they would do it. And I thought, wow, there's another gold moment."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":3738.47,"end":3743.39,"speaker":"Curt Jaimungal","text":"There was another time where he just mentioned what would happen is bloody, violent revolution."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":3743.71,"end":3747.27,"speaker":"Jonathan Pageau","text":"And then the people kind of taken aback. Yeah."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":3747.27,"end":3748.11,"speaker":"Curt Jaimungal","text":"He didn't know what to say."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":3748.11,"end":3751.35,"speaker":"Jonathan Pageau","text":"Well, yeah. How would you know what to say to that? Because, I mean, I think."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":3751.35,"end":3797.33,"speaker":"Curt Jaimungal","text":"And those people have never experienced anything close to bloody, violent revolution like I was. So for this documentary, I started looking at clips of just, just, just the worst, some of the worst of what humans can do to other humans on a large scale. And, and it just. It just tears you apart, man. Like, some of them are not that visceral because there's black and white footage with no sound yeah, there's still. And then some are like, the. What the Tamil Tigers. What the Sinhalese government did to the Tamil Tigers. And then you see mothers holding their children and their children are just screaming because there's bombs being dropped on them ahead and they don't know if they're gonna. And they die. And. And it's just fear. And fear. And fear breaks your heart. And that's what a violent revolution is like."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":3797.33,"end":3840,"speaker":"Jonathan Pageau","text":"Yeah, no, I think that. I think especially now, you know, it's. It's so I think that's what's difficult, is that, you know, you can imagine that someone in the 19th century just coming out of very difficult, like, let's say very difficult times in Russia, where you're peasants, you're barely eating, you don't get to eat any meat. All the aristocrats eat meat, you know, like that kind of life where it's very. It's very difficult. And then that you would feel so desperate that you would be willing to risk everything, you know, just to topple the whole thing compared to now, which is like, I mean, who are these people, like, who want bloody revolution in our. In our country?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":3840,"end":3842.64,"speaker":"Curt Jaimungal","text":"I mean, I.1% of anybody who's ever lived."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":3842.64,"end":3847.4,"speaker":"Jonathan Pageau","text":"Right. And I. So I don't understand, like, I don't. I don't totally understand how that."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":3848.44,"end":3856.64,"speaker":"Curt Jaimungal","text":"And I also don't understand how they define what rich is, because rich to me always seems to be defined by them as whoever is richer than me."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":3856.64,"end":3861.57,"speaker":"Jonathan Pageau","text":"Right, exactly. No, no, I agree, I agree. Yeah, yeah."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":3862.45,"end":3870.61,"speaker":"Curt Jaimungal","text":"So what other ancient stories have you read that apply to this modern time, this radical left, alt, right, crazy world that we live in?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":3874.61,"end":3927.56,"speaker":"Jonathan Pageau","text":"I was thinking about that, and I don't totally see in terms of. We seem to be in a very unique moment because one of the things that's happening right now, which is extremely unique, is that we have these two excesses that are growing up at the same time. And I think that that's the one thing that people find very difficult to see because they tend to just see the other excess. For example, we live in a world where there's more control and more calculation of what you're doing than any other time in the history of the world. Google has everything about you, right? You exist virtually in Google's, some Google Drive there. You know everything about you, everything you've said, everything you've thought. Pretty much."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":3927.56,"end":3928.8,"speaker":"Curt Jaimungal","text":"They can clone you from your emails."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":3928.8,"end":4032.98,"speaker":"Jonathan Pageau","text":"They could basically clone you from your email and your behavior. It's not just your email, it's your behavior. Online, which you click here, they have these gigantic algorithms which calculate and they know like where you are, what you're interested in. There are crazy stories of people who, who, you know, like a girl who is looking online for certain things not related to pregnancy. But they've calculated that if you look online for certain things, even if it's not directly related to pregnancy, probably means you're pregnant. And so they'll show you ads for pregnancy stuff, right? So there's this massive data control over what we are. And just in terms of laws like the modern state. No, I can't, I can't build something in my yard. I need to get permission from my town to build anything I want. Like I can't right now. We're in the process in Quebec where the government wants to, we're homeschooling our kids and the government wants to, to force us to take standardized tests. And I think that's normal. Like I think it's normal that the government decides what your kids are going to learn. We think that's normal. We think that the government has that possibility. So we have the most, but we also have this weird carnival esque, crazy world of passions where, you know, pornography is rampant, where people are, people are dying from opioids. And so there's also this other weird world that's completely chaotic and upside down. So we have these two things that are kind of growing up at the same time. And so it's almost like this is a very unique moment in history where the capacity for absolute control and the capacity for absolute breakdown seem to be looking at each other and somehow feeding into each other. So it's very weird. I don't know if there's a story."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4033.22,"end":4034.5,"speaker":"Curt Jaimungal","text":"Are there any biblical stories?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4037.14,"end":4092.54,"speaker":"Jonathan Pageau","text":"My brother would probably be better at finding a story that shows as much the two extremes at the same time. I mean, it's possible that maybe the closest thing we have would be the collapse of the Roman Empire. Maybe like the collapse of the first collapse, let's say third century collapse, where it's as if there was this huge gigantic bureaucratic state crazy. But then these decadent elites that were all they cared about were their orgies and then it's like it just couldn't hold. And so it's like it collapsed into civil war. So it seems like maybe that's the closest thing that we have to understanding kind of where like the symptoms of our society seems to be, seem to be close to, let's say that first fall there in the second, third."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4092.54,"end":4104.1,"speaker":"Curt Jaimungal","text":"One reason I'm Asking is because there's so much wisdom in these old stories, and if we want to. If we want to engineer a solution to our current times, it's always good to look back and see, well, what did they do then?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4104.18,"end":4139.26,"speaker":"Jonathan Pageau","text":"Yeah, you know, I don't think there's a solution to our current time. I wish. I wish. And a lot of people, you know, and I think that that's one of the reasons why I kind of took on Jordan's way of seeing things in terms of the solution. A lot of people have criticized me just for kind of coming too close to Jordan as a Christian. And a lot of people have criticized Jordan for his individualism, you could say. And I've been thinking about it a lot recently, and I think that Jordan's solution is the only one right now. Not individualism in the sense of."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4139.34,"end":4140.3,"speaker":"Curt Jaimungal","text":"Not the Ayn Rand."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4140.3,"end":4259.47,"speaker":"Jonathan Pageau","text":"Right, exactly. Not the Ayn Rand kind of selfish individual, but the notion that in a world that is so extreme right now and the systems are so big, you know, the only thing you can do is become a saint as much as possible, is to become. Adjust in the world, to be an anchor for people around you. And so. And that means changing yourself. That means. And I think it is in line with the deepest Christian teaching, which is, you know, take the beam out of your own eye before removing the straw out of your brother's eye. And there's also several citations of saints, for example, Saint Seraphim of Sarov, who said, acquire the spirit of peace, and thousands around you will be saved. And so this notion of becoming something rather than trying to immediately want to find these gigantic solutions to the problem, because I don't. I think. I think. I think we're headed for trouble. And I think that the only. The only hope is that there will be enough bastions of civility and justice and truth to carry us through. Right? To carry us through the chaos. Because, to be honest, I don't see. I don't see us fixing this. These massive problems. They're too big. They're so big. It's like the AI thing, you know, you have all these people saying, be careful about AI, Be careful about AI, but no one's gonna stop. It's just this. This machine is turning and turning and speeding up, and we're heading towards it. Everybody knows we're heading towards it. Everybody's afraid. Everybody knows how dangerous it could be, but no one can stop it. You know, Elon Musk can't stop it. No one can stop it going to happen. And so I don't know, you know, I don't. I. Sorry to be a pessimist."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4260.91,"end":4270.67,"speaker":"Curt Jaimungal","text":"So where do you see it going? You just see it remaining and then we strengthen ourselves as individuals, becoming a, a person that someone can rely on, an anchor."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4270.83,"end":4291.24,"speaker":"Jonathan Pageau","text":"I think that. No, I think that it has to, I do think that it has to build, ground up. That for sure. And I think that we need to rediscover our center, our heart. We need to rediscover that and then we also need to participate in actual communities. And that's one of the reasons why I tell people that."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4291.24,"end":4302.32,"speaker":"Curt Jaimungal","text":"Oh, you mean to say that you don't see it going away, the problem of the extreme right and extreme left with some large scale solution. You see it as a problem that will be solved from a bottom up approaches."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4302.32,"end":4348.4,"speaker":"Jonathan Pageau","text":"You that can only be. I think it can only be solved by a bottom up approach. It's the same problem with the ecological problem. The ecological problem is too big because it's based in people's desires. The ecological problem is based on our desire to accumulate and to have to supplement our existence to that extent. So the problem is so profound that no matter what recycling you set up, it's not going to go away. It's not going to go away. The only thing that can make it go away is for transformed people and transformed communities. But we don't like communities. They don't exist anymore. We don't have. At least some do. But it's very difficult."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4348.72,"end":4364.45,"speaker":"Curt Jaimungal","text":"This is why John Vervacki dates the current meaning crisis. He says, well, he might say, because he's a complicated man, he might say that the extreme radical left, extreme extreme alt right are symptoms of a deeper meaning crisis. And this meaning crisis dates back to the year 1200."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4364.45,"end":4441.62,"speaker":"Jonathan Pageau","text":"Yeah, for sure. I totally agree. When he said 12th century, I was like, John, you've got it. That's where it started. That's where all the west started to vacillate, let's say, between extremes. And so it's a cyclical thing. It's a story that's too big for us. It's too big for individuals to think that they're going to change it. But there are ways to exist in those times of breakdown. Like there are ways to exist which alleviate, let's say, or make you not be an actor in the breakdown and henceforth not be an actor in your own breakdown, not fall and live a life, a dissolute life of the passions and be completely taken up by your desires and then wake up on your deathbed. And it's like, okay, okay, I have a big house and a big car, but I'm divorced and my kids hate me. And it's like, that's great, congratulations. You know, what did you accomplish? And so one of the reasons why I've insisted, and a lot of people, sometimes they wonder why I insist on it so much, is one of the reasons why I keep saying that at least in the west, we need to remember the Christian story. Like, we need to remember the fact, what it is that made us something. Yeah."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4441.62,"end":4443.06,"speaker":"Curt Jaimungal","text":"Remember also means understanding."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4443.06,"end":4446.86,"speaker":"Jonathan Pageau","text":"Yeah. And I think it means, to a certain extent, participate in too."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4446.94,"end":4449.18,"speaker":"Curt Jaimungal","text":"And so that's why I think Idea."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4449.34,"end":4476.24,"speaker":"Jonathan Pageau","text":"Yeah. But I think we don't fall in the same place because. So John's way of participation is very individualistic. And so he says, I'm a practitioner. I practice this, I practice that, I practice these different mystical practices. And it's like, for him, it's a way out of the meaning crisis. But it has to come together too. We have to remember that even in Buddhist, in Buddhist teaching that, you know."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4476.24,"end":4478.44,"speaker":"Curt Jaimungal","text":"Say there's a lack of community in John's approach."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4478.52,"end":4511.22,"speaker":"Jonathan Pageau","text":"I think so. I think so. And I think the lack of community is we don't. We don't totally decide what story we're part of. I keep telling people that it's difficult for people to fully understand it. The way that I view how things are going on is I think what we're seeing is a playing out of in the west, you know, we're seeing a playing out of the Christian story, the massive Christian story. Part of that story is a breakdown. It's there in the story. You know, that's why you're the only."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4511.22,"end":4519.27,"speaker":"Curt Jaimungal","text":"Person that I've seen articulate our current crisis in this manner. That Christianity itself might have to die in order for it to come back and be reborn."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4519.43,"end":4522.23,"speaker":"Jonathan Pageau","text":"But I think it's. It's there in the story. Like, it's there. It's there."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4522.23,"end":4525.71,"speaker":"Curt Jaimungal","text":"That's interesting because you're applying the narrative to the narrative."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4525.71,"end":4534.39,"speaker":"Jonathan Pageau","text":"Yeah, that's how symbolism works. So symbolism is a. Is a. You know, it's embedded structures within themselves. Right. It's a."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4535.27,"end":4538.95,"speaker":"Curt Jaimungal","text":"That the archetype is so true that it applies to the archetype."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4539.27,"end":4561.57,"speaker":"Jonathan Pageau","text":"Well, that it's a. It's like a. Yes, exactly. That's what religious stories do in general. Like, they understand how they understand a form of self consciousness. They have a form of self consciousness where they try to look at themselves as well. There's a weird circularity that's part of the symbolic structure."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4561.81,"end":4590.49,"speaker":"Curt Jaimungal","text":"I find that fascinating. I need to think about that some more because it's an interesting idea. I haven't heard someone else express it, at least not articulate it in the direct manner that you have. So how did you start to come to view stories in this symbolic fashion? So you're saying you're 22 or you just graduated from college and your teacher was telling you you don't belong here, you're a traditionalist. The questions you're asking are not ones that you'll find the answer to. Not in college."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4590.49,"end":4599.87,"speaker":"Jonathan Pageau","text":"Yeah, well, so what basically happened is I. I tried to make contemporary art for a little while. I had a studio with some friends and, you know, I was kind of working towards something."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4599.87,"end":4601.75,"speaker":"Curt Jaimungal","text":"And then just for freelance, just for some money."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4601.75,"end":4613.71,"speaker":"Jonathan Pageau","text":"Well, I hope like a real artist, like going to a gallery and do it, do the, do the real artist thing, you know, I made these giant, you know, kind of really ego driven giant, giant works of art."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4613.71,"end":4616.55,"speaker":"Curt Jaimungal","text":"You know, my whole life is just one big, giant, ego driven work of art."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4617.43,"end":4634.67,"speaker":"Jonathan Pageau","text":"So anyway, so that's what I had. And then I. I got married and married really kind of slammed me against myself. I saw all my own flaws. Flaws, insecurities and passions and unreasonableness and all that just kind of came flying back."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4634.67,"end":4638.47,"speaker":"Curt Jaimungal","text":"Can you explain how that happens? Because I recently got married. So I want to know."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4638.47,"end":4673.21,"speaker":"Jonathan Pageau","text":"I want to know what's in store for me. It depends on people. Some people get married and then it's wonderful for a little while and then the mirror starts to. To show. For me it was the opposite. Like we got married. Like a week after we got married, all of a sudden it was like, could you see? Both of us could just see. So our first year of marriage was hell. Like it was, it was the opposite of most people. Oh yeah, it was absolute hell. Like we, once we got through the first year of marriage, we were like, can never get worse than that. So it's pretty good. Let's keep going. And so, so, I mean, it depends on people. That's how it was for us."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4673.21,"end":4674.65,"speaker":"Curt Jaimungal","text":"Did you live together beforehand?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4674.8,"end":4699.76,"speaker":"Jonathan Pageau","text":"No, no. And so it was like just seeing this mirror. And so it led me to a lot of questioning and also just kind of spiritual crisis in general. I was also becoming very disillusioned with the world, the kind of evangelical world that I was in in college. I'd read a lot of authors, a lot of philosophers, and I just felt like the church where I was going wasn't answering the questions."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4699.76,"end":4700.72,"speaker":"Curt Jaimungal","text":"What kind of church, was it?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4701.2,"end":4711.52,"speaker":"Jonathan Pageau","text":"This is kind of a Baptist. Baptist, Evangelical Baptist church, kind of American style church there. Not liturgical, you know, just very kind of looks like a business meeting."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4711.52,"end":4714.72,"speaker":"Curt Jaimungal","text":"Can you explain what you mean when you say liturgical? Do you mean to say what?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4716,"end":4740.29,"speaker":"Jonathan Pageau","text":"No, liturgical means that it's. That it has a service which is. Which is a pattern. Right. It's. It's based on. It's not just a. So like, let's say a evangelical church today. They'll get together, they'll sing songs and they'll have a sermon, but they'll say things like, we could do it. We could do whatever. Like we. You know, there's no. It doesn't matter what you do."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4740.29,"end":4743.37,"speaker":"Curt Jaimungal","text":"There's no structure. Oh, you mean no structure for your life and no structure for the meetings."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4743.37,"end":4751.45,"speaker":"Jonathan Pageau","text":"No structure for the meetings. Right. No structure for the church. And so liturgical means that there's an order of service, and so there's. We do things in a certain order."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4751.45,"end":4753.77,"speaker":"Curt Jaimungal","text":"So like the Jehovah's Witnesses. I don't know if you're familiar with them."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4754.24,"end":4758.48,"speaker":"Jonathan Pageau","text":"Yeah, well, they're not liturgical. They're more like."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4758.64,"end":4760.8,"speaker":"Curt Jaimungal","text":"More like the Evangelical Baptist."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4762.16,"end":4842.67,"speaker":"Jonathan Pageau","text":"So liturgical is like Anglican Catholics, Orthodox. They're liturgical. So they sing. They. They have a. The building, the architecture of the building is meaningful. The order of the service is meaningful. The way that the priest is dressed is meaningful. Everything is done in a manner which is meaningful and which is. Which. Which manifests what you're trying to do. Right. So it's not just. It's not just arbitrary. So. So anyway, so I wasn't. So I was going to a kind of evangelical church, and I felt like it was just lacking in. In profundity, lacking in meaning. And. And also, you know, I was reading philosophers, and then I started reading authors from other traditions, Buddhist authors, Sufi authors. And I discovered mystical. The mystical way, you could say, the mystical thinking and transformational thinking you could call it. And I was really impressed by it. And then I thought, whoa, why is it that Christians don't have that, like, why is it that Christians don't have mystical transformations and mystical vision of how the world works and all of that? And it was only because it did. It's just I didn't know about it. And then that's when I discovered the early church fathers and traditional Christianity. And then iconography."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4843.47,"end":4845.07,"speaker":"Curt Jaimungal","text":"Can you define what iconography is?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4845.15,"end":4883.68,"speaker":"Jonathan Pageau","text":"So iconography would be, let's say, a way of practicing art which is traditional in the sense that it has certain types, certain typology. It has a Set of rules. Kind of like if you write a sonata, you have certain rules and then you write within those rules. So iconography is the visual practice of the ancient church, which was developed, let's say, if you went into a church in the year 1000 or 1100, anywhere in the world, you would have seen pretty much the same thing. And that was done without a top down imposition of what was going to be there. But it was just this kind of bubbling up."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4883.68,"end":4885.72,"speaker":"Curt Jaimungal","text":"It's like the brand style guide for the church."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4886.2,"end":4886.6,"speaker":"Jonathan Pageau","text":"The what?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4886.6,"end":4888.04,"speaker":"Curt Jaimungal","text":"You know, brand styles?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4888.04,"end":4888.44,"speaker":"Jonathan Pageau","text":"No."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4888.76,"end":4898.2,"speaker":"Curt Jaimungal","text":"Okay, so when you design a website or you have a company, like, use these fonts, use these colors, make sure that when you place the logo, you place it this much of a distance between the borders."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":4898.28,"end":5001.93,"speaker":"Jonathan Pageau","text":"Well, I don't think. No, I don't think that's the way to see it. The way to see it is to see it more like a view of the world as full of meaning and full of pattern. And so the story of the world and the story of our lives is a pattern. It's not arbitrary, it's not random. And so that pattern then can be found, let's say, in Scripture, can be found, and then it transposes itself into the way that we worship, let's say. So the structure of how we worship in a church, in a traditional church, is patterned based on the same patterns as that you find in the Bible. So there's a center, right there's the altar, and then that's the most holy place. And then you can imagine a series of layers as you move out from that holy place. Remember when I told you a little bit about this idea of adding layers? Well, you can see that also in the terms of sacred space, where you have profane space which is outside the church, and as you move in to the church, then you move towards this sacred center, which is that which defines the space itself and which defines the community, which defines everything. So that structure, let's say the architecture of a church, then in iconography you have those same types of structures. So you have to know the types. It's like you have to understand that the reason why Christ is represented in a certain way, not arbitrary, it's there to show you what, who Christ is. And so there's certain manner in which you represent a figure to show you who, what they are and what their place is in this bigger pattern."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5001.93,"end":5024.58,"speaker":"Curt Jaimungal","text":"And did they do this consciously? Like they knew that they were not copying or imitating, but that this specific representation of Christ was being repeated in other parts of the world. Did they know that consciously that here's the proper representation of Christ or here's what it's saying. We're at the center because this is what's most holy. And then here's what's profane in the way that you're articulating it."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5024.58,"end":5056.15,"speaker":"Jonathan Pageau","text":"Yeah, but I think it's a mix of intuition and participation in the life of a community where we agree on certain things and we participate in the story. And so, for example, like, if you would ask me, would it be conscious to put Christ in a central space? And you would say, well, yeah, but at the same time, what else are you going to put there? Because that's the center. That's the incarnation. That's the point where heaven and earth meet. That's the focus of the origin of Christianity, the focus of Christianity. So it's like, where else would you put it?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5056.15,"end":5075.94,"speaker":"Curt Jaimungal","text":"There's another reason for the cross, something I've been thinking about. Another reason for the cross to be symbolized like this is because this represents the spiritual and this represents the profane, the mundane, earthly, and the proper places to be at both. But then the other reason why the earthly is a little bit higher is because it's more important to be slightly more spiritual than you are earthly."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5076.66,"end":5090.94,"speaker":"Jonathan Pageau","text":"I mean. Yeah, I've never thought about the second part that you said for sure. The cross is meant to represent the union of heaven and earth, that's for sure. And I think that a lot of people resist that because they say, no, that's the shape of an actual cross. Right. That's how crosses were made."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5090.94,"end":5091.82,"speaker":"Curt Jaimungal","text":"They have multiple meanings."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5091.82,"end":5107.26,"speaker":"Jonathan Pageau","text":"But it's like that's the thing is that symbolism is not. Symbolism is the coalescence of things. It's not a. It's not a. Just because it's a. It's. That's how crosses were made. Doesn't mean that. It doesn't also mean that. Especially in this context, that doesn't come to mean that."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5107.26,"end":5120.34,"speaker":"Curt Jaimungal","text":"And there's also a preponderance of things that are associated with Christ. And why would we choose the cross? Well, there's obviously obvious reasons why we would choose the cross. But the cross as a symbol means multi, has multiple meanings."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5120.92,"end":5190.42,"speaker":"Jonathan Pageau","text":"And it definitely is a center, that's for sure. And if you look at the early church fathers, they'll say things like, the cross is everywhere. Look at mast of a boat with a sail. That's a cross. And they'll point to crosses which exist almost naturally in the world and say the image of the cross has Been shown forever. People need to just recognize what it's talking about. What is the center? What's at the center, actually? Like, what does unite heaven and earth? You know, that's the question. And that's. That's. And of course, Christians answer with the incarnation. That's the. That's the answer. But iconography is basically understanding the rules and the language of Christian art. Why it's. Why it resembles what it does. And then it's almost like an algebra. And so you know the terms. Then you can. If you need to improvise an image, you can. But improvising that image needs to be done within the general frames and tenets that iconography offers you. So it's a truly traditional art in that sense."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5190.66,"end":5198.66,"speaker":"Curt Jaimungal","text":"Okay, so you started studying iconography because your eyes were opened, because you started studying Buddhism, and you realized they have an interesting way of seeing the world."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5198.94,"end":5210.14,"speaker":"Jonathan Pageau","text":"Yeah, well, it was a lot. It wasn't Buddhism. It was a little bit of Buddhism. A lot of Sufi authors. I read some early modern kind of Sufi converts."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5210.94,"end":5211.66,"speaker":"Curt Jaimungal","text":"What's Sufi?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5211.74,"end":5233.82,"speaker":"Jonathan Pageau","text":"Sufi. Oh, Sufi is a mystical Islam. Yeah, It's a branch of Islam, which is far more mystical, analogical. And it's closer. Some people will argue with me if I say this, but it's closer to Christianity in some respects because of its emphasis on love and because of its emphasis on the transformation of the person."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5233.82,"end":5239.86,"speaker":"Curt Jaimungal","text":"All of that, to get you into more hot water than you already are. Do you fundamentally see Islam as a religion of peace?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5244.02,"end":5396.63,"speaker":"Jonathan Pageau","text":"I think that we need to see. Okay, we need to see Islam for what Islam actually says. And so religion. Islam is a religion. There are two spheres in Islam. There's the. There's the sphere of peace, and there's the sphere of war. And Islam is the religion of peace in the sense that within Islam is peace. And that's how. That's how it's viewed in the Muslim world. In the Muslim world, that's how it's been presented. And so you have the outside world, which is the space of war, and you have the inside of Islam, which is the space of peace. And one of the goals of Islam is to bring peace, to bring the space of peace to the world. But that's why by becoming Muslim or by submitting to Islam somehow, by becoming a dhimmi or by paying the tribute, and that's. I mean, a lot of Muslims don't think that today. A lot of. I mean, I would say that most Muslims in the west don't have that approach to Islam anymore. But traditionally, that's what Islam. That's why Islam is an expansive. Was from the beginning an expansive religion. You know, Judaism is not expansive. Judaism wants to recover the Holy Land. Like, they just want their. They want to get their place. That does cause trouble. Obviously, we see that it's caused trouble since they're back there. It's a difficult situation. And Christianity, it's kind of not clear because the Roman Empire converted to Christianity. So then the Roman Empire became Christian. And so it's complicated to think. It's not so much that then Christians went out and at least in the first thousand years, went out and invaded other places, although it probably happened. You know, you get stories in the west, you get stories of, you know, Charlemagne converting by the sword, and you get those stories as well, but they're always kind of iffy. But Islam was like. Islam exploded, became huge. If you look at an image of the map at the year 1000, you know, it's immense. And so, yeah, so, I mean, I don't know. I think that most Muslims today are not especially people who come here. It depends from where they come from and what intentions they have. You know, in Quebec here, a lot of the Muslims who come here come from Northern Africa and they, you know, they just. They want to work, they want to have a good life, they want to have a good family, they want to be left alone and do their thing. And."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5397.03,"end":5452.17,"speaker":"Curt Jaimungal","text":"Yeah, so, okay, so let's get back to. You were studying iconography, and that allowed you to see the world and see stories through a particular lens. Yeah, I was watching you give an interview. I mean, I was watching you have a conversation about the spider verse with someone. That person then made a comment about some other. Some other aspect of the spider verse. Then you said, oh, and what that could mean is this, this, this, and this. And then the guy said, oh, I didn't see that before. And then you said, oh, I didn't see it before until you mentioned it. And that made me realize you that's not something you thought about. Because for a regular person, a regular person who's even watching this, they would have to sit and think, okay, what could the spider verse mean? Here's what I know. Okay, okay, okay. This fits in here. This fits in here. This doesn't work. Okay, okay. And then it would take them maybe 20 minutes to come up with something that you came up with in a. In the span of a sentence or two, which means you actually see the world or you've thought about it for so long that it's just Second nature to you?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5452.17,"end":5452.53,"speaker":"Jonathan Pageau","text":"Yeah."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5452.61,"end":5486.3,"speaker":"Curt Jaimungal","text":"And I want to know, how did that develop? And how do you see the world? So do you see people walking down the street differently than you used to? No, I mean that seriously. Because even people who study physiology, they. They can tell people's ailments just by watching them walk, even if they look like they're normal. Oh, you slightly tilt in this direction. It's almost like Sherlock Holmes. And so you see people moving towards a subway, and then you think, okay, that's a place of communion where people don't interact. That's almost like what we had in the 12th century when this happened and this happened. So I want to know, do you see the world like that?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5486.62,"end":5487.34,"speaker":"Jonathan Pageau","text":"No, I see."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5488.06,"end":5489.14,"speaker":"Curt Jaimungal","text":"And how did you start to see."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5489.14,"end":5496.1,"speaker":"Jonathan Pageau","text":"The world the way you see the world? I mean, I think I see the world through patterns, that's for sure."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5496.98,"end":5513.02,"speaker":"Curt Jaimungal","text":"Okay, now, when you say patterns, I'm gonna get specific here. So when you say patterns, you mean repetitions, parts of life that repeat or parts of life that are abstract. So, for example, there's a pattern of talking or I talk, you talk, I talk, you talk. Now that's a pattern."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5513.02,"end":5514.02,"speaker":"Jonathan Pageau","text":"Okay, Repeating."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5514.02,"end":5519.74,"speaker":"Curt Jaimungal","text":"Or another pattern is. You abstract a pattern out from a certain set. So there's a pattern of what it means to be human."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5519.9,"end":5540.94,"speaker":"Jonathan Pageau","text":"Right. So it's. I would say. Okay, so the pattern. You could say the pattern starts with how things exist. Right. And when I say how things exist, what I mean is how they exist phenomenologically, not in terms of science, because that's what confuses me."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5540.94,"end":5541.66,"speaker":"Curt Jaimungal","text":"In terms of experience."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5541.66,"end":5562.6,"speaker":"Jonathan Pageau","text":"In terms of experience, how we experience things existing. And that's really the basis of how things exist. No matter what we say, we try to push beyond the phenomenological, but we always see it through the lens. So the scientist, even though he has all the scientific categories, he's still in a consciousness and looking at the world through that consciousness."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5563.16,"end":5564.24,"speaker":"Curt Jaimungal","text":"Or she. He or she."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5564.24,"end":5565.08,"speaker":"Jonathan Pageau","text":"He or she. Yeah."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5565.32,"end":5567.16,"speaker":"Curt Jaimungal","text":"Just don't send any letters."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5569.4,"end":5592.76,"speaker":"Jonathan Pageau","text":"And so the way that something. For example. I'll give you a perfect example. So the way that something exists, you need for something to exist, to have it. Have an identity. Right? And then have a. You could say a variety. Say it that way. Need to have an identity and a variety, or a oneness and a multipleness to it."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5593.16,"end":5594.12,"speaker":"Curt Jaimungal","text":"Can you give me an example?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5594.83,"end":5614.31,"speaker":"Jonathan Pageau","text":"Well, so if I have a. So I have a cup. So this has an identity. And it's. It's. Let's say its identity is. Is the cup. That's part of it. It has other identities, but let's use that one for start. So it has an identity, it's a cup. But then it also, it also is not just there is no such thing."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5614.31,"end":5618.67,"speaker":"Curt Jaimungal","text":"As a cup, it's actually non binary. And it's offended that you defined it in terms of a cup."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5618.67,"end":5647.47,"speaker":"Jonathan Pageau","text":"A cup. Well, there's no such thing as. There's no pure cup. Right. Not in the world. Right. So a cup has to have, and has to have a particular particularity to it. Okay, Right. And the particularity to it is its variety, it's a multiplicity. And then in order for it to have particularity, then it has to embody other identities. So it has a color. It has, you know, it has to have a color. Right. But there's no color in the cup, doesn't have color, but it has to have color for it."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5647.47,"end":5658.52,"speaker":"Curt Jaimungal","text":"So there's, there's the concept of cupness which doesn't actually exist in the world in space and time, but it's a concept nonetheless. Cup ness, something that makes something a cup essence."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5658.52,"end":5683.32,"speaker":"Jonathan Pageau","text":"It's a concept I try not to get too tied up in because people will say, okay, you're being Platonic, just trying to see how things come to exist. And so there's an aspect of it which is one, there's an aspect of it which is multiple. And everything always has to. To have that for anything to exist has to be one and multiple at the same time because it also has to be constituted by parts."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5683.8,"end":5686.28,"speaker":"Curt Jaimungal","text":"Okay, so you're saying the elements of this that are not a cup are."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5686.52,"end":5745.67,"speaker":"Jonathan Pageau","text":"But also even for it to be a cup, it also needs to be constituted with parts. So it has one oneness, then also has parts which are multiple. And the cup ness of the cup holds the cup together. So let's just say that you have one and one and many. So if you have one and many, just that, yeah, you already have a basic pattern. And then you could look at the world through one and many. And, and you can notice when things move towards one or when they move towards many, or how they move towards one, how they move towards many. Okay, so then let's do that in space you a good way to represent it in space. Best way to represent in space. Center, periphery. So you have a wheel, let's say you have a center. The center is that which around everything else turns. And then as you move out from the center, you get more quantity. You could say as you move towards the center, you get more quality. And so that's a basic pattern. So you can look at a person like that."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5746.23,"end":5754.71,"speaker":"Curt Jaimungal","text":"That's extremely interesting. You could also look at the political sphere like that. Would you say the radical left is on the periphery and then the alt right is in the extreme center?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5758.56,"end":5762.16,"speaker":"Jonathan Pageau","text":"I struggle with this alt right thing, but let's talk about the right, because I forget about."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5762.32,"end":5764.56,"speaker":"Curt Jaimungal","text":"Let's talk about the radical. The radical left."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5764.56,"end":5892.75,"speaker":"Jonathan Pageau","text":"Okay, so the, let's say the left. So you. Let's say right hand, left hand. We could use that. Okay, so right. The right hand, traditionally, really, this is. I'm not making this up. The right hand traditionally is the tendency to move towards the center, and the left hand is the tendency to move away from the center. And so, for example, Christ says when he's judging the world, he says to the sheep, he says, come into my kingdom. And to the goats, he says, depart from me. I never knew you. Okay, so moving towards the center, moving away from the center. There's a rabbinical teaching that says exactly that, which says, bring things closer to you with your right hand, move them away from you with your left hand. So now you can think of it as a person traditionally, in any traditional culture, almost every single traditional culture, you eat with what hand, you're right. You wash with what hand, you're right. You watch with your left hand. Oh, because you're moving because you don't want to eat with what you wash with. You go to the bathroom, use your left hand, you eat with your right hand. Right? So you bring towards you with your right hand, you move away from you with your left hand. Right? So you understand that that's just a basic pattern of being like a person has a tendency towards unity and a tendency towards outside, towards inside, towards outside. That's the, that's a pattern. That's the basic pattern of reality. Then you can, you can apply that to a society. A society has a basic identity and it has ways in which you move towards that identity. And then it has a way in which you move away from that identity. But you could. Moving away or closer is not moral, right? Because some things you need to move, you need to move away from you. And there's some things also that you. It move away for you for, from you for a good reason, right? In the sense that you could be extending yourself out into the world as well. Right? And so, and so it's not, it's not. The patterns are not moral. There's not in, in the patterns, there's nothing good or bad. They can become good or bad depending on how they're used, from what reason they're used. But the pattern itself, is it just. Then you can look at the world and you can. What? What I see when I look at the world is. That's what I see. I see how the pattern is manifested in different instances."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5893.39,"end":5934.1,"speaker":"Curt Jaimungal","text":"Now, this detaching of moral judgments from how close you are to the center or how far you are from the center, is that a Buddhist concept or does that fall in line with Christianity? Because I know Christianity has an emphasis, an emphasis on putting moral judgments on almost every aspect, and Buddhism is the opposite. As far as I know, I could be wrong. So does that, does that. Okay, so you said, look, there's the center, there's the moving away from the center. And you can move toward, you can move towards center, you can move away from the center. It's not in and of itself a. I mean, it's not in and of itself moralistic to do one of. No one of the others."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5934.18,"end":5969.24,"speaker":"Jonathan Pageau","text":"They both have danger and they both have opportunity. The Buddhist won't necessarily frame it in the same terms, but he. They will. They'll say the passions. They'll say, you have these passions on the edges, say in yourself. And those passions are pulling you, are fragmenting you, they're pulling you apart. And in the Christian, the Christian way of describing the passions is the same way, especially in the Orthodox tradition, you have these passions, these desires, and these desires pull you away from your heart, let's say, and you need to go back to your heart. You need to. To, let's say."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5969.4,"end":5970.68,"speaker":"Curt Jaimungal","text":"So that's a return to the center."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5970.92,"end":5972.28,"speaker":"Jonathan Pageau","text":"Then you return to the center."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5972.28,"end":5976.28,"speaker":"Curt Jaimungal","text":"Okay, and do they have in Christianity a pushing away from the center?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":5976.44,"end":6083.9,"speaker":"Jonathan Pageau","text":"Well, it depends. Like I said, for example, I'll give you an example of a pushing away from the center, which is, which is positive. Pentecost. Pentecost is when the disciples are in the high place, and then all of a sudden the, the fire of the Holy Spirit comes down upon them. And then they start to speak, and then everybody can hear them speak in their own language. And so as they're speaking, then everybody else is hearing them speak in the language that they understand. So that's a fire, right? That's fire. That's the left hand that's moving away from the center. And so the message is being dispersed out into the periphery because those who are outside hear the language, hear the message in their own language. And so that's a left hand movement. It's a moving out. And so like I said, it's not necessarily good or bad. And then there's also, there's a bad left hand, right? This idea of giving into your fire, giving in to your desires, giving in to your passions, is this being pulled away from yourself? And that would be represented as a kind of left hand movement, you could say. But there are also right hand sins. So Saint Maximus the Confessor, for example, talks about left hand and right hand sins. And he says the left hand sins are, you know, gluttony, prostitution, all the sins of the passions. Like you let yourself go to those types of desires. And the sins of the right hand are pride, self sufficiency. Right. So now you can see where the moving into the center can become negative in the sense of, of pride, the sense of thinking that you're, that you don't need anything. The sense of thinking that you're self sufficient. And so like I said, those patterns are not, they're not, they're not negative or positive."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6084.94,"end":6086.22,"speaker":"Curt Jaimungal","text":"It's just in their balance."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6086.62,"end":6088.38,"speaker":"Jonathan Pageau","text":"Well, it just, it just depends on."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6088.46,"end":6090.18,"speaker":"Curt Jaimungal","text":"On, in the situation."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6090.18,"end":6101.43,"speaker":"Jonathan Pageau","text":"In the situation. It just depends on what is trying to be accomplished. So entering into the center in the sense of removing yourself from your passions and going into the center in order to look up and see what's above you."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6101.43,"end":6103.79,"speaker":"Curt Jaimungal","text":"Okay, so it's simply just a matter of appropriateness to the situation."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6103.79,"end":6104.11,"speaker":"Jonathan Pageau","text":"Right."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6104.11,"end":6106.31,"speaker":"Curt Jaimungal","text":"Sometimes you need to be far, sometimes you need to be close."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6106.39,"end":6110.55,"speaker":"Jonathan Pageau","text":"Yes, it just depends. Also you could say a good way, not necessary."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6110.55,"end":6122.15,"speaker":"Curt Jaimungal","text":"I was wrong when I said balance because that would imply that there's a proper place to occupy in almost every situation, whereas it's actually different. Sometimes you just need to be completely right handed. Sometimes you need to be left handed. Sometimes you need to be a mixture of both."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6122.15,"end":6159.5,"speaker":"Jonathan Pageau","text":"So, so a good way to. So in terms of center and periphery, for example, the good way to understand it is like, it's called memory. So if you're moving away from the center, if you remember the center, then it doesn't matter how far you go, right? So it's like you, if you remember yourself, if you remember God, no matter how you say it, you can go very far and you won't fall. You could say you won't be taken in by whatever is pulling you out. You know? Does that make sense?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6159.5,"end":6167.02,"speaker":"Curt Jaimungal","text":"Yep, yep, yep, yep. Okay, so now you see the world like this. You see the world. You said you started to see the world primarily through the center. Periphery dichotomy."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6167.02,"end":6170.06,"speaker":"Jonathan Pageau","text":"And that's one that's, that's an easy way to understand it."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6170.06,"end":6170.46,"speaker":"Curt Jaimungal","text":"Okay."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6170.46,"end":6182.67,"speaker":"Jonathan Pageau","text":"At some Point. It transcends those. Those categories. But that's the. The best way to explain it, I think, is using hierarchy, like a mountain or pyramid or center and periphery. Those are the best way to explain it."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6182.67,"end":6192.47,"speaker":"Curt Jaimungal","text":"So now when you watch something like a movie, how do you see the movie? What are you looking for? Are you looking for anything? Does it just unconsciously hit you and."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6192.47,"end":6202.6,"speaker":"Jonathan Pageau","text":"You realize it just hits me. I usually just watch a movie, and then I'll take a little bit of time, and then I have insights."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6202.6,"end":6217.6,"speaker":"Curt Jaimungal","text":"Can you give me an example of your thought process from a recent movie so that it's fresh in your mind? So some movie that you saw recently that you went in thinking, okay, I'm just gonna watch this movie. And then what thoughts occurred to you? And then what thoughts occurred to you afterwards?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6218,"end":6391.76,"speaker":"Jonathan Pageau","text":"Okay, so, okay, what did I. I just went to see Shazam with my kids. I went to see that movie. And so the movie Shazam is about a young man, a young boy who becomes a superhero, an adult superhero, right? And the movie is, for example, one of the images that keeps appearing in the movie is an image of the carnival. And the carnival keeps coming back. And so, for example, if an image like that keeps coming back, especially the carnival, then you say, okay, I need to pay attention to this because there's something going on here. And so the. So a carnival, for example, is this edge. The carnival is the edge of the world. The best way to understand it. Everything's upside down, right? Everything's spinning. Everything in a carnival spinning all the time. You know, the Ferris wheel, all the rides, everything's spinning and everything is garish, all the colors are garish, and everything is there to titillate you in that way. So it's all bad food, it's all spinning, it's all laughing and pleasure in the very basest sense of having fun. And clowns and impossible precision games where you try to hit the center, but you're not going to hit the center. No one hits the center, right? No one. All those precision games where you win these big things, like, they're very difficult. So it's like, okay, so this is what's going on. And so then you think, okay, so the story is about. In the Shazam. I don't want to give all these spoilers, but the story in Shazam Is about dealing with the seven deadly sins. And so it's like, okay, so here's all of this going on at the same time. So these seven deadly sins kind of come out and possess this one man. You know, and they. Then they start to kind of attack the world and do all this stuff. So, okay, so the seven deadly sins at a carnival, it all kind of makes sense. It's like it all kind of fits together. It's not trying to say anything, right? It's not like there's a message, but the pattern is right. And so when the pattern is right, where the seven deadly sins appear at a carnival, it's like it fits. And then when you look at. When you're watching it, you. You. You have a kind of satisfaction, which is a satisfaction of the world being right. Even if it's talking about the upside down world, right? It's talking about these monstrous seven deadly passions that are coming to. To suck. To suck up the world. But it's having it in a carnival, which is an upside down world already. And so all of this is going on. And so it's like. Even though it's showing you the extremes, it fits because it's. Everything's in the right place. And so when. When sometimes what can happen is if you could have it, you could have a place where it just is wrong, where it just doesn't. Doesn't work, where it's."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6392.32,"end":6396.72,"speaker":"Curt Jaimungal","text":"And that. And that's because you're interpreting it incorrectly or you feel like it's being forced on the part of the film."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6396.72,"end":6441.6,"speaker":"Jonathan Pageau","text":"It's forced. Exactly. It's just being forced. So there's a desire to give a message. And so they'll push something in which will. Which will force it. But the best way to force it is to. Because it's difficult to get away from these patterns because they're the patterns of reality. All you can do is you can make them upside down, you can twist them so you can't totally get rid of them. And so I think that a lot of the modern kind of propaganda, that's what they do, is they twist them in a way. They kind of just toss them to it, make them in, like the idea of. Yes, we need. We can't avoid the masculine feminine archetypes. So what we'll do is we'll put a woman in the place of the masculine figure and we'll put a man in the place of the feminine figure."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6441.6,"end":6442.6,"speaker":"Curt Jaimungal","text":"And demean the man."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6442.84,"end":6443.24,"speaker":"Jonathan Pageau","text":"Sorry."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6443.24,"end":6444.96,"speaker":"Curt Jaimungal","text":"And demean the man. Denigrate him."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6444.96,"end":6459.56,"speaker":"Jonathan Pageau","text":"So it's like. So we're still using the same pattern, but we're just doing it in a way that's kind of flipping it upside down or playing with it in a way that is confusing or is meant to create disjunction you could say, how."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6459.56,"end":6477.68,"speaker":"Curt Jaimungal","text":"Does one know when they're reading, reading too much into a piece of art, something that Peterson's been criticized with for on a minor basis, like when he's looking at Pinocchio, how do you know you're not reading too much into it? So how does one prevent themselves from reading too much in. Is there such a thing as reading too much into art?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6477.76,"end":6522.17,"speaker":"Jonathan Pageau","text":"Of course. Yeah, for sure. And I think that the way that, for example, what I do is I just point at the pattern. So it's not, I'm not, I'm not actually interpreting the movie. Usually when I interpret a movie, I'm not interpreting in the sense of saying this aspect of the movie represents, you know, I don't know, represents Hitler. And this aspect, this, this, this character in the movie represents Stalin. And here, this is what it's like. I never, I would never make an interpretation of a movie like that. You know, I'll say, look at the pattern, right? Here are the, here are the, here are the, the terms of the pattern, right? You have someone on the inside, you have someone on the outside. How are they interacting?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6524.09,"end":6537.37,"speaker":"Curt Jaimungal","text":"So we're talking about how does one know when they're reading too much into art? And you were saying, well, I'm not going to substitute different elements of the film and say, this represents the struggle of man and this represents the church and this represents Hitler."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6537.37,"end":6579.07,"speaker":"Jonathan Pageau","text":"Yeah. Usually a movie will give you its pattern. It'll, it'll, it'll lay it because it has to. Right? The movie has a pattern in order for you to even recognize it as a story. Especially movies that, especially movies that are trying to make money. Movies that, movies like little art type movies where the person doesn't care whether or not anybody watches it. Usually those. You're hopeless. Like you're hopeless in terms of pattern. But movies that are actually trying to attract a lot of people, they have to, they have. No matter that even if the person isn't conscious about it, in order to attract a mass amount of attention, they have to embody certain satisfying patterns that human beings have within them. It's necessary because. Or else people won't go see them."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6579.15,"end":6580.87,"speaker":"Curt Jaimungal","text":"Or the cynic would say it's just marketed."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6580.87,"end":6707.27,"speaker":"Jonathan Pageau","text":"Well, that's not true because we know movies that have been massively marketed which have failed, right? And so, you know, maybe they'll have that first bump, but then it'll all go away. Whereas if you really want to attract a lot of attention, you need to, to have that pattern. And so the idea is the movie will usually tell you, like, what's going on. And so you just need to let the movie tell you what's. What's happening. And trying. I always try not to go outside of the movie. Like, at least. The least that I can. Like, try not to reference anything outside the actual story that's going on and to just say, well, this character says this. This is what he does. This is. This is how. This is his struggle. He's telling you what's his struggle. He's going to tell you. This is. This is. This is his problem. He's going to tell you what the solution is. But then all I'm going to try to do is show you how that is a pattern and how it would. How it's a pattern. And then once I've done that, then I can say, okay, now, this pattern, see, this pattern? This is the same as this other pattern. This other pattern. This other pattern. Like, see how, you know, like, for example, the pattern of resurrection, you know, I mean, that pattern is there everywhere someone dies or almost dies and then gets back up at the end. It's like, you see it in so many movies. You know, that's a. It's just there. It's just there in the story. You know, I can show you that it's there. And then once I've shown you that it's there, then maybe we can start to talk about what it means. But it's no longer now about just that one movie, right? It's about that pattern which is there in several other stories. And. And now we can talk about what it's referring to in terms of existential reality. And so to me, if you stay within those frames, you have less of a danger of kind of going overboard. One of the things that happens and it's happened to me is that sometimes you'll see a pattern and you won't see a counter pattern. You won't see. You'll see, you'll. You'll want to see one aspect of the pattern too much. Then you won't see something else that's going on. So that's totally possible."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6708.07,"end":6716.75,"speaker":"Curt Jaimungal","text":"Can you explain what you mean? You mean to say that you, as the person who's interpreting the piece of art, wants to see a certain pattern, and so it blinds you to a counter pattern?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6716.75,"end":6718.07,"speaker":"Jonathan Pageau","text":"Yeah, for sure. Because."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6719.99,"end":6722.07,"speaker":"Curt Jaimungal","text":"In other words, you're selectively choosing."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6722.55,"end":6753.56,"speaker":"Jonathan Pageau","text":"Well, that's what a pattern is. Right? A pattern is. Is the selectivity. Because just like a movie, just like any other reality, has an indefinite amount of details Right. You could talk about the way the leaves are moving in the story, but you're not going to talk about that because that's not what interests you. And so you'll focus on the characters. For example, you could say, you know, you can interpret. You could, you could, you could ask, if you were just a kind of nihilist, you could ask, why are you focusing on the characters when you're watching a movie? Why aren't you focusing on."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6753.88,"end":6755.04,"speaker":"Curt Jaimungal","text":"On the top right pixel."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6755.04,"end":6757.88,"speaker":"Jonathan Pageau","text":"Exactly. Or the. Yeah, the, the way the wind is blowing?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6758.04,"end":6772.44,"speaker":"Curt Jaimungal","text":"Well, some people who have autism do that. They don't actually look at characters on. Yeah, they don't look at characters in the eye. You can watch them. You can track their. Their eye fixations. And they don't look. So right now I'm looking at you in the eye and they don't watch the characters. They look at the light bulbs. They watch how this swing is swinging."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6772.44,"end":6812.7,"speaker":"Jonathan Pageau","text":"Yeah. And capacity to kind of bring things together. And so that's. So it's inevitable that you will do like, you will selectively choose. But sometimes there, there can be other patterns that are there that you. That you might ignore, that you might. You might marginalize, you could say. And that's. It's. In a way, it's kind of inevitable, but hopefully you try to not, to not do it too much and also to be able to see both and to see both sides. I think the best interpretations that I've done for movies have been the one ones where I'm able to show the true side, let's say, to almost sometimes imagine as if you could see the movie from different aspects."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6813.26,"end":6860.45,"speaker":"Curt Jaimungal","text":"So let's say you're an artist and you want to create something that's not propagandistic, that doesn't try to. You don't try to instill your own values into the art, because otherwise Jung would call that Jung. Carl Jung would call that propagandistic versus exploration art. Or he called it the difference between introverted art and extroverted art. So introverted art is the art where you're trying to. You have your own intentions and you're just using the art as a tool to let the world know what you think. Politically, it's usually political, but it could be whatever it could be, you're the main character in the film because you're filming it yourself and you want people to feel sorry for you. Could be whatever or you want. You had a bad experience with the father and now you want to make sure that people, when they look at Their fathers, they have a bad experience with their father. Like, they look at fathers negatively."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6860.72,"end":6861.12,"speaker":"Jonathan Pageau","text":"Okay?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6861.68,"end":6887.36,"speaker":"Curt Jaimungal","text":"Then he said, there's extroverted art where it just comes through you. You're a conduit for which these ideas flow from. And you don't even know what you're doing when you do it. And until it comes together as a cohesive whole, maybe you can look back, but maybe you can't even look back. And as much as you try to explain it, you realize it's deeper than my explanation. You come back one year from now, and there's more. There's more to it. More to it. More to it. Religion is like the Bibles are. The Bible is like that. So Jung would call the extroverted art."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6887.44,"end":6887.6,"speaker":"Jonathan Pageau","text":"What."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6887.75,"end":6901.67,"speaker":"Curt Jaimungal","text":"What advice would you have for artists who would like to not fall prey to introverted art? They want to do art that will last, that will stand the test of time and not right."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6902.15,"end":6956.33,"speaker":"Jonathan Pageau","text":"I think it's difficult. It's difficult for me to answer that question because I'm not making the kind of extroverted art that Jung is talking about. Let's say the liturgical art that I make is a desire to participate in a community, in a communal language. And so it's very different. It's neither me trying to impose my vision of the world on others, nor is it this kind of surrealist type of exploratory art where you, like you said, you just kind of let yourself go and you don't know what you're doing. It kind of almost like. Like a medium or something. It's completely different. It's actually trying to participate in a common language. And so, like I said that to me, I've chosen that as being the most. Because the problem with."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6957.37,"end":6976.63,"speaker":"Curt Jaimungal","text":"Well, I don't see anything wrong with that, because let's say you're a poet. You're using the language of English or whatever language you're using. So you're using the language of iconography, and then you're constructing within that. So I don't see that as necessarily being opposed to introverted art or extroverted. I mean, I don't see that as you trying to will a certain point of view. I just see it as you using a language."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":6976.63,"end":7001.83,"speaker":"Jonathan Pageau","text":"Well, maybe it's because. Maybe it's because of my idea of the. The. Of how I understand what you're talking about when you talk about the extroverted art, which is this kind of, you know, this kind of letting it flow. Right. Almost like a surrealist, like how they make cataract Ski or how they would. They would. Automatic writing, all that kind of stuff. I think you can just think of."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":7001.83,"end":7004.35,"speaker":"Curt Jaimungal","text":"It as the absence of an intentional message, right?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":7004.51,"end":7069.06,"speaker":"Jonathan Pageau","text":"Well, yeah, no, I think that. In terms of reducing a message, I would say. I think that understanding the complexity of traditional stories is probably a way to help that in the sense that. To try to always see the. The Old Testament characters are some of the best for that. Right. You can read the Bible, the Old Testament characters, and you can read them as the hero. And almost every single character. You can read them as a villain, almost every single one. You can see how they actually. There's a shady aspect to what they're doing. Okay, you can do that about. You can do that about every single character in the Old Testament. It's really fascinating, by the way, to do that. And I think that being aware of that is probably helpful, is to understand that there are two sides to the symbolism all the time."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":7069.86,"end":7083.47,"speaker":"Curt Jaimungal","text":"There's always two sides, and that's something that's wrong or missing in modern movies. Like you said, the one with the reversal of Little Mermaid, what was it called? Diero, Geltorm or del Toro, Whatever."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":7083.79,"end":7085.07,"speaker":"Jonathan Pageau","text":"The shadow. The shape of water."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":7085.07,"end":7092.19,"speaker":"Curt Jaimungal","text":"Yes, the shape of water. That the white male was just. He's bad. There's no good to him. He's just bad. If you label them as bad, you're correct."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":7092.19,"end":7154.42,"speaker":"Jonathan Pageau","text":"Yeah, it was. That was definitely propagandistic movie, that movie. In every. In so many ways, it was propagandistic. And so I think that that's. It's like. I also. I also don't have a problem with having a bad character. Like, there's nothing. Nothing wrong with that. But, you know, if you look at, like in Lord of the Rings, if you look at a character like Gollum, for example, I mean, that's a great character too, because he's. He's bad. He's a bad character, but he's also like an extension of Frodo, you know? You know that he's where Frodo could go. Like, if he let himself go, he could go there. So you can see Gollum and Frodo, and you can see Frodo and Gollum a little bit, too. And so that's a powerful story because you can. You. You have these two characters, one which is like a good character, one which is a bad character, but it's also not just. It's not a simple, simple relationship. There's a relationship where one is like the promise of the other in a certain manner. And so that makes it Far more subtle and far more engaging, in my opinion."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":7154.56,"end":7165.64,"speaker":"Curt Jaimungal","text":"I was trying to think of when is it okay to actually just have a character which you can outright categorize as bad. And I wonder if it's only when they are a representation of Satan. So like, let's say Sauron."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":7165.64,"end":7192.97,"speaker":"Jonathan Pageau","text":"Yeah, yeah. He's like. He's not even embodied, right. He's like, he's just like a. He's just an idea almost. You know, I mean, he. Obviously he's a being, but he's not embodied in the world. They don't encounter Sauron, you know, he encounter him through kind of third, second, second tiers or whatever. So yeah, I think so. Maybe that's a good way to understand it. I've actually thought about Sauron quite a bit sometimes about if. If it's too easy, if that character is too easy."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":7194.49,"end":7208.89,"speaker":"Curt Jaimungal","text":"But like, but then someone could criticize the Bible. Someone could criticize the Bible and say, Jesus is too easy. He's too good. And the Satan is too bad. He's. That's too easy. Yeah, well, but it's like, that's the point. It's supposed to be the extreme. So maybe it's okay when it's supposed to be the extremes."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":7208.89,"end":7237.54,"speaker":"Jonathan Pageau","text":"But the thing that people don't understand, that Christ does not fit that category. People don't know the story of Christ or they read the story of Christ. The story of Christ is the most elated and disturbing story. At the same time, Christ has some stuff that people don't like to cite. Because if you want to just make Christ into a simple good guy story, it's not. That's not."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":7237.62,"end":7238.58,"speaker":"Curt Jaimungal","text":"Give us an example."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":7238.66,"end":7257.22,"speaker":"Jonathan Pageau","text":"Well, Christ says, I came to bring fire to the world, to turn brother against brother. Christ said on the cross, father, why did you abandon me? Christ said, you know, Christ said to Peter, bring a sword. And then when Peter takes a sword out and cuts off the ear of a soldier, he stops and says, no, don't do that."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":7258.66,"end":7261.22,"speaker":"Curt Jaimungal","text":"So why did he say what? Okay, that's another conversation."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":7263.47,"end":7356.88,"speaker":"Jonathan Pageau","text":"What I'm saying is that Christ is a far more complex figure than what we want to believe that he is. You know, think of Christ. Think of crazy stories. Think of Christ there as the rabbi who is the one who brings. Who's bringing the word and the truth and all that. And imagine a whore washing his feet with perfume. Like, think of Christ as the one who hung out with. With, you know, with Samaritans, with strangers and the marginalized and all that. And that's how the left want to portray him, for example, but then he also goes and hangs out with a tax collector who's basically a. Who's basically a stooge for the Romans, who's basically a tool of the. Of the empire to control us. And so Christ goes all directions. Christ goes in all, every direction. It's like you. You read once, if you understand the types that. That are in. That are in stories, and you read Christ's story. You know, I've read. I've read. Scholars complain that we don't know how to. How to frame Christ because he's a. He's a. He's a teacher, but he's. He's like a rabbi figure. He's also like a prophet figure, but then he's also like the son of a worker. He's also. He's also like a woodworker. He's also, you know, he hangs out with fishermen. Then he talks to. And it's like all. He kind of fills up all the stories. And so that's why the story of Christ is very. It's very difficult to."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":7357.84,"end":7379.58,"speaker":"Curt Jaimungal","text":"Well, getting back to propagandistic, this is what's interesting, because it's not simple. You can't frame this person as good or bad. Now, that's standard in screenwriting. Never make your protagonist purely good. Never make your antagonist purely bad. Can we go a little bit beyond that as to. How can we stop ourselves from consciously trying to push a message?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":7380.86,"end":7452.04,"speaker":"Jonathan Pageau","text":"Yeah, well, I mean, I think that there's simple ways. There's ways that have been told to us forever. I mean, just Aristotle told us, give your characters a fatal flaw. Like, it's not a. It's not a mystery. You know, give them something that could destroy them. And either it does or it doesn't, but make sure that it's there, that even your hero has something that could devour them. And I would say the same for your enemy, right? Make your enemies convincing. Make them a twisted version of something true. Right? Don't just make them a random bad guy who. If you make them a twisted understanding of something, of something which actually has value, then that makes for powerful bad guys. Like, for example, in the last Avengers movies, the Thanos character, that was a great character. It was a great evil character because he actually talks about things that people care about today. He talks about ecological disaster. He talks about all the things that even the left cares about. But then he pushes it to such an extreme that you kind of shy away from it because, like, okay, okay, where are you going with this?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":7452.04,"end":7454.84,"speaker":"Curt Jaimungal","text":"You know, versus the shape of water, which is like."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":7454.92,"end":7499.9,"speaker":"Jonathan Pageau","text":"The shape of water is just trash. It's a trash movie because it's, because it, it doesn't. I mean, it's in every single way. Like there's so many ways in which the shape of water is trash. Because it, it's just. It's almost like a cliche. It's like, it's almost a cliche of. You could guess each character, what's going to happen to them, you know, when it, when it starts. And you know the. There's. Oh, there's some, there's some. Especially the bad guy that, the bad guy in the movie. Some of the things he says that are so bad in terms of. They're so obvious that it hurts. What is it? There's one scene when he says something, he goes to the bathroom and he says, you can learn a lot about a man, whether he washes his hands before or after. And I was like, oh my goodness. Like this you're."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":7499.9,"end":7502.02,"speaker":"Curt Jaimungal","text":"And you don't, you don't do it twice because that shows weakness."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":7502.02,"end":7535.95,"speaker":"Jonathan Pageau","text":"Yeah, it's like you're so obvious, you know, you're so obvious about him being, you know, excessive purity and all that stuff. But yeah, it's this par for the course by now. It's non stop. You know, there's this movie coming out just now. What's it called? It's like these monstrous dolls. And you know, it's just not. I mean, we've kind of swallowed this, this thing right now. And this is, this is, this is where society is going in this direction. I don't know where it's going to lead because it can't sustain itself. You can't have a world of exceptions."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":7535.95,"end":7537.83,"speaker":"Curt Jaimungal","text":"Do you see Hollywood contributing to this problem?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":7537.91,"end":7542.55,"speaker":"Jonathan Pageau","text":"Oh, for sure. Since the beginning. I think, I think that. I think that."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":7545.59,"end":7549.47,"speaker":"Curt Jaimungal","text":"This problem of polarization or this problem of what the thing."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":7549.47,"end":7603.74,"speaker":"Jonathan Pageau","text":"Is that it, it falls into the. It's the problem of entertainment culture itself that's a problem. The idea that our cultural artifacts are entertainment, that's a problem. We don't realize that it's basic. It comes back to what I talked to you at first when I talked about art, when I told you that traditional art integrates in a culture. So traditional storytelling was part of festivals, was part of gathering around the campfire and telling the story of our ancestors. It was about putting on masks and wearing the costumes and playing out these characters, but in a manner in which we're participating in it. We're doing it on this date because it's to remember something that happened."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":7605.49,"end":7608.69,"speaker":"Curt Jaimungal","text":"There's a shared principle united under purpose."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":7609.01,"end":7634.86,"speaker":"Jonathan Pageau","text":"Yeah, purpose. And just the fact that we're together, all of this comes together. And so the problem is that now almost all our cultural artifacts are there to entertain us. They're there to. They're like a giant circus. The last remaining cultural artifact we have is basically a circus. It's there to. It's just there for. For to. To keep us distracted."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":7635.66,"end":7639.66,"speaker":"Curt Jaimungal","text":"Okay, last question. When do you see the left going too far?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":7641.26,"end":7658.55,"speaker":"Jonathan Pageau","text":"I think. I think the left. The purpose of the left is to ask questions, you could say, is to say, what about this? Right. So you have some identity, doesn't matter what it is. And then the right hand's like this and the left. And then the left hand side. Well, yeah, what about this? What about that?"}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":7658.95,"end":7660.35,"speaker":"Curt Jaimungal","text":"Like the role of the skeptic."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":7660.35,"end":7791.15,"speaker":"Jonathan Pageau","text":"Yeah. Like, how does this fit? You know, and. And why doesn't this fit? And what did you think about this? You know, it's like, oh, yeah, you say. You say this, but you're leaving this aside, right? You're not considering this. And so in society, that ends up being exactly kind of what we see, which is this, like, oh, you forgot the exception. Don't forget the exception. There's your rule, but there's also exception. Some people don't fit, so you have to remember them. Don't forget the exception. The problem happens when we try to make the exception the norm. It doesn't work. You can't have a world of exceptions. It just doesn't exist. It can't exist. It just crumbles. And so I think that that's the problem that we have now is that we went from wanting to care for marginalized identities to the idea that somehow an accumulation of marginalization will make you into a heroic figure. That doesn't do that. Just because you are marginalized doesn't make you pure. It's like you're flipping it upside down. It's like the identitarians are saying, just because I am of this group, I'm fine. Just because I am, you know, white or I'm a man, or I'm this just because of that, then I am sufficient and I'm fine. It's like I'm pure, right? That's the. That's the bad. But now what we have, this weird crazy left is the very same thing, just upside down. There's. It's like. It's like a competition of purity, but like a competition of exception. If you can be the most exceptional in the sense that you are the most marginal, marginalized, then you're playing the same purity game, just upside down. It doesn't work. You need the two. You need the statement of identity. And then you need things that are there on the margin which say, hey, don't think you've got everything because I'm here to show you that you haven't accounted for everything. You haven't accounted for everything. And I think that that's, that's the normal balance, you know."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":7791.31,"end":7793.71,"speaker":"Curt Jaimungal","text":"All right, man, thank you so much."}
{"episode_id":"SW - #063 - 2019-10-09 - Interview for - Better Left Unsaid - Documentary","start":7793.71,"end":7864.56,"speaker":"Jonathan Pageau","text":"Well, I hope, I hope it was useful. We'll see what it looks like. I hope you enjoyed this episode of the Symbolic World. The Symbolic World is edited by Justin Ward and it is based on a series of videos that you can find on my YouTube channel, Jonathan Pedro's YouTube channel. You can also get involved. There is a Facebook group that has started by fans of the podcast called the Symbolic World within the Zombie Invasion. I will put a link to that in the show description. And so it is a discussion of all things symbolism that is quite interesting. I'd like to drop in there and also leave some of my comments as well. You can always help the podcast by, of course, leaving a review on itunes. Everybody knows that's the best way to get the podcast out there, to get it heard. And if you want to get involved, you can also support the podcast financially, going to www.thesymbolicworld.com support or else on Patreon Pageau videos as well, and on subscribestar, all those links you can find on my website or in the show description. So thank you and I will see you soon."}
